[{"figure_path": "YfVMcbcDqo/figures/figures_2_1.jpg", "caption": "Figure 1: Method overview: (a) 3D MRI and PET scans of a glioblastoma patient (b) Preprocessed input includes brain tissue maps, tumor segmentation, and a metabolic map from FET-PET. (c) Tumor cell distribution and brain anatomy inferred using a loss function based on assumptions about physical processes, initial conditions. (d) Outcomes: initial healthy anatomy, spatial tumor cell distribution, and system identification parameters.", "description": "This figure provides a visual overview of the proposed method.  Panel (a) shows the input data: 3D MRI and PET scans of a glioblastoma patient.  Panel (b) details the preprocessed data used, including brain tissue maps derived from the scans, and a tumor segmentation.  Panel (c) illustrates the core of the method: physics-regularized learning of spatiotemporal distributions of tumor cells and brain tissues. The method uses a loss function that incorporates physical assumptions and integrates data to learn the spatial tumor cell distribution and brain anatomy.  Panel (d) presents the method's output: the inferred initial healthy anatomy, spatial tumor cell distribution, and system identification parameters.  This output can be used for radiotherapy planning.", "section": "1 Introduction"}, {"figure_path": "YfVMcbcDqo/figures/figures_4_1.jpg", "caption": "Figure 2: Learning process overview: optimization of spatiotemporal distributions of tumor cells and tissues. (a) Initial condition penalties enforce symmetric healthy anatomy, with the initial tumor distribution at t = 0 as a small Gaussian blob. (b) Physics penalties regularize dynamics between the initial and the final time. The first row shows gray matter contours with particle positions; the second row shows white matter contours with learned tumor concentrations. (c) Agreement of tumor distribution with anatomical tissues, visible tumor segmentations, and metabolic map after transforming the final tumor distribution through the imaging function.", "description": "This figure illustrates the learning process of the proposed method. It shows how initial assumptions, physics-based penalties, and imaging data reconstruction work together to optimize the spatiotemporal distributions of tumor cells and tissues. The initial conditions are set with a symmetric healthy anatomy and an initial tumor distribution modeled as a Gaussian blob. Physics-based penalties enforce consistency between initial and final states according to the governing equations, and imaging data reconstruction ensures that learned distributions are aligned with actual imaging observations, including tumor segmentations and a metabolic map.", "section": "2 Physical Assumptions"}, {"figure_path": "YfVMcbcDqo/figures/figures_5_1.jpg", "caption": "Figure 3: Inference overview: (a) Patient's MRI 3D scans. (b) Estimated tissues through non-rigid registration of the average brain, showing white matter and visible tumor segmentations. (c) Learned tumor cell distribution, regularized by the physics residual and aligned with patient data. (d) Learned initial condition of the tissues representing healthy anatomy. (e) Average brain template for reference, rigidly registered to the MRI scan. Notable anatomical differences include the lack of matter passage between the hemispheres next to the tumor, which could affect tumor cell inference results.", "description": "This figure shows the inference process of the proposed method. It starts with the patient's MRI scan (a), then estimates the white matter tissues and tumor segmentation (b). The method infers the full spatial tumor cell distribution, regularized by the physics residual and aligned with the patient data (c). Then, the method infers the healthy anatomy (d) and finally uses an average brain template for reference (e). The differences between the inferred healthy anatomy and the average brain template highlight potential areas that could affect tumor cell inference.", "section": "3 Initial Assumptions"}, {"figure_path": "YfVMcbcDqo/figures/figures_6_1.jpg", "caption": "Figure 1: Method overview: (a) 3D MRI and PET scans of a glioblastoma patient (b) Preprocessed input includes brain tissue maps, tumor segmentation, and a metabolic map from FET-PET. (c) Tumor cell distribution and brain anatomy inferred using a loss function based on assumptions about physical processes, initial conditions. (d) Outcomes: initial healthy anatomy, spatial tumor cell distribution, and system identification parameters.", "description": "This figure provides a visual overview of the proposed method. It shows the inputs (3D MRI and PET scans of a glioblastoma patient and pre-processed data), the process of learning the tumor cell distribution and brain anatomy using a physics-informed loss function, and the outputs (initial healthy anatomy, spatial tumor distribution, and system parameters).", "section": "2 Physical Assumptions"}, {"figure_path": "YfVMcbcDqo/figures/figures_7_1.jpg", "caption": "Figure 4: Radiotherapy planning: a) Pre-operative segmentations with white matter concentration as background. b) Distance map from the tumor core segmentation with a 1.5 cm contour and within diffusive tissue, constituting the Standard Plan. c) Our learned tumor cell distribution with the isosurface contour where the enclosed volume equals the total volume of the Standard Plan.", "description": "This figure compares three different approaches for radiotherapy planning.  (a) shows the pre-operative MRI scan with tumor core segmentation.  (b) illustrates the standard radiotherapy plan, which uses a 1.5cm margin around the visible tumor. (c) presents the results of the proposed method, showing a learned tumor cell distribution that is used to define a radiotherapy contour with a volume equal to the standard plan.  The recurrence coverage is significantly improved by the proposed method (77.00% vs 62.33%).", "section": "Validation and Ablation Study of Radiotherapy Planning"}, {"figure_path": "YfVMcbcDqo/figures/figures_14_1.jpg", "caption": "Figure 6: Deformation through particle movement: a) Total loss of our model for reference. b) Particle position with tissue elasticity. c) Particle position without tissue elasticity. These particle positions are learned for the pre-operative time. For grid stability in c), additional regularization is required. For α2 > 0 we observe one large localized deformation caused by the tumor, which is more biologically plausible than multiple smaller deformations visible for α2 = 0.", "description": "This figure shows the effect of the regularization term (α2) on the deformation of the tissue.  Panel (a) shows the total loss function, which includes terms for tumor growth, tissue elasticity, initial conditions, and imaging data reconstruction. Panels (b) and (c) show the deformation of the tissue with (α2 > 0) and without (α2 = 0) the regularization term, respectively. When the regularization term is included, the deformation is more localized and biologically plausible, while without regularization, there are multiple smaller deformations.", "section": "Extended Ablation Study"}]