[{"type": "text", "text": "DISP-LLM: Dimension-Independent Structural Pruning for Large Language Models ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Shangqian Gao ˚ Chi-Heng Lin Ting Hua Florida State University Samsung Research America Samsung Research America ", "page_idx": 0}, {"type": "text", "text": "Tang Zheng Yilin Shen Hongxia Jin Samsung Research America Samsung Research America Samsung Research America ", "page_idx": 0}, {"type": "text", "text": "Yen-Chang Hsu Samsung Research America ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Large Language Models (LLMs) have achieved remarkable success in various natural language processing tasks, including language modeling, understanding, and generation. However, the increased memory and computational costs associated with these models pose significant challenges for deployment on resource-limited devices. Structural pruning has emerged as a promising solution to reduce the costs of LLMs without requiring post-processing steps. Prior structural pruning methods either follow the dependence of structures at the cost of limiting flexibility, or introduce non-trivial additional parameters by incorporating different projection matrices. In this work, we propose a novel approach that relaxes the constraint imposed by regular structural pruning methods and eliminates the structural dependence along the embedding dimension. Our dimension-independent structural pruning method offers several beneftis. Firstly, our method enables different blocks to utilize different subsets of the feature maps. Secondly, by removing structural dependence, we facilitate each block to possess varying widths along its input and output dimensions, thereby significantly enhancing the flexibility of structural pruning. We evaluate our method on various LLMs, including OPT, LLaMA, LLaMA-2, Phi-1.5, and Phi-2. Experimental results demonstrate that our approach outperforms other state-of-the-art methods, showing for the first time that structural pruning can achieve an accuracy similar to semi-structural pruning. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Large Language Models (LLMs) have revolutionized the field of natural language processing by leveraging deep learning techniques to process and generate human-like text. Compared to smaller models, LLMs exhibit unique characteristics and demonstrate remarkable abilities in tackling a wide range of complex tasks [40]. Despite their impressive capabilities, the vast number of parameters in LLMs often hinders their deployment on resource-constrained devices, such as mobile phones. Consequently, there is significant interest in reducing the computational and memory requirements of LLMs. ", "page_idx": 0}, {"type": "text", "text": "Existing compression techniques for large language models (LLMs) include weight sparsification [9], structural pruning [30], and quantization [10]. In this work, we focus on structural pruning and address the limitations of previous methods in this category. Structural pruning [30] is a generalpurpose compression solution that maintains LLM performance across various tasks, facilitates deployment on devices, and is computationally efficient. However, existing methods may restrict pruning flexibility or add significant overhead to the compressed model. For instance, LLM-Pruner [30] follows structural dependence during pruning, requiring different layers to use the same subset of feature maps, which limits pruning flexibility. SliceGPT [2] alleviates this issue by applying orthogonal projections for each layer but introduces a non-trivial number of additional parameters (e.g., ${\\pmb{5}}\\%$ to ${13\\%}$ of the parameters of the original model for LLaMA-2 7B). Our approach aims to overcome these drawbacks and offer a better performance-cost trade-off for structural pruning. ", "page_idx": 0}, {"type": "image", "img_path": "YxaY6tHgg0/tmp/16480e32ab0167cd2c1cd7e24cefb1789aab0bbf27d695d5eb56de9c9ffae29a.jpg", "img_caption": ["Figure 1: We use an MLP layer as an example. Left: Regular pruning methods have to follow structural dependence thus their flexibility is limited. Right: Our dimension-independent structural pruning method breaks the structural dependence via index operations and thus largely improves the flexibility for pruning. "], "img_footnote": [], "page_idx": 1}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "We aim to increase the flexibility of current structural pruning methods and consequently improve performance. Our method provides different sub-spaces or subsets of features to different layers, but unlike SliceGPT, it doesn’t introduce additional parameters. To achieve this, we break the structural dependence of regular structural pruning methods, allowing different layers to have different subsets of features along the embedding dimension and an example is given in Fig. 1. After pruning, we employ index selection and index addition operations to sample subsets of features from the residual connection and add them back after the computation of each layer. Furthermore, our method introduces an additional level of flexibility by learning different widths for each layer. Our approach significantly improves the flexibility of structural pruning without adding additional parameters. ", "page_idx": 1}, {"type": "text", "text": "Extensive experimental results show that our method can outperform state-of-the-art structural pruning methods for LLMs while still maintaining low computational costs. Our method does not require recovery fine-tuning to obtain such performance. In addition, our method does not update the remained model weights during pruning which is a distinct departure from several other methods, such as SparseGPT [9] and LLM Surgeon [37]. Our contributions are as follows: ", "page_idx": 1}, {"type": "text", "text": "• We break the structural dependence of regular structural pruning methods, significantly increasing the flexibility of structural pruning. This allows different layers to select their own subset of features from the embedding dimension. Importantly, our method achieves this without introducing additional parameters, unlike SliceGPT.   \n• We propose to learn the widths of each layer using gradient-based optimization methods. A hypernetwork generates the column or row selection matrices, while the width of each layer is controlled globally. This approach allows for fine-grained control over the pruning process and enhances the adaptability of our method to various models and tasks.   \n• Our method demonstrates superior performance compared to state-of-the-art structural pruning techniques for LLMs across a range of models, including OPT, LLaMA, LLaMA-2, Phi-1.5, and Phi-2. Notably, the resulting model from our method is a sub-network that exists within the original model, indicating the effectiveness of our method in discovering strong sub-networks. ", "page_idx": 1}, {"type": "text", "text": "2 Related Works ", "text_level": 1, "page_idx": 1}, {"type": "text", "text": "Magnitude-based pruning is the most straightforward approach to reduce model size, where weights with the smallest magnitude are pruned. Han et al. [14] employ this strategy for pruning with $L_{1}$ or $L_{2}$ norm of weights. Filter pruning [24] extends this setting to structures of the model instead of performing weight-level sparsification. Although magnitude-based pruning methods are very efficient, they result in significant performance drops for LLMs, even for weight pruning [9]. Another line of research, Optimal Brain Damage [23] and Optimal Brain Surgeon [15], utilize second-order information to remove connections. These methods require calculating the inverse of the Hessian matrix, which is computationally intensive for modern neural network architectures like Convolutional Neural Networks (CNNs) [22, 16], Transformers [38], or Large Language Models (LLMs) [35]. To reduce the cost of computing the Hessian inverse matrix, Optimal Brain Surgeon can be applied in a layer-wise fashion [7, 8], making the computation tractable. However, further scaling up these methods for LLMs remains challenging. ", "page_idx": 1}, {"type": "text", "text": "", "page_idx": 2}, {"type": "image", "img_path": "YxaY6tHgg0/tmp/bd51a281e6024c8ad02a66ff1d57e6c61971e748d67edd1a8ed1e054f8b07dcb.jpg", "img_caption": [], "img_footnote": [], "page_idx": 2}, {"type": "text", "text": "Figure 2: Our method, DISP-LLM, applies different selection matrices to the input and output dimension of the Attention layer and MLP layer $(\\mathbf{S}_{1}/\\mathbf{S}_{2}$ : Attention in/out; $\\mathbf{S}_{3}/\\mathbf{S}_{4}\\overline{{|\\mathbf{S}_{5}}}$ : MLP in/middle/out). When pruning the model, we add “Index Selection” before Layer Norm and we replace addition with “Index Add.” $\\hat{\\mathbf{S}}_{1},\\,\\cdot\\,\\cdot\\,,\\,\\hat{\\mathbf{S}}_{5}$ are applied for pruning weight matrices. ", "page_idx": 2}, {"type": "text", "text": "Recent methods like SparseGPT [9] or GPTQ [10] aim to minimize the squared error before and after pruning or quantization of a given layer. In this setting, the Hessian inverse matrix becomes easy to compute, as it is simply the multiplication between the feature map and its transpose for a given layer. GPTQ and SparseGPT then quantize or sparsify model weights in a column-by-column manner, and the unpruned or unquantized weights are updated to compensate for the error of pruning and quantization. Wanda [34] further avoids computing the inverse of the Hessian matrix by only considering the diagonal of the Hessian matrix. While SparseGPT and Wanda achieve good results, unstructured sparsity is known to be harder to achieve actual speedup. They also applied their methods on semi-structured settings [31], but the performance becomes much worse. ", "page_idx": 2}, {"type": "text", "text": "Several researches [28, 19, 44, 13, 42, 12] apply learnable parameters for specific structures when pruning vision or language models. However, many of these methods cannot be scaled up to LLMs since they need to learn weights and structures together. In contrast, our method explores sub-networks within the ", "page_idx": 2}, {"type": "text", "text": "original model without updating model weights. Additionally, our method mainly explores the regime of pruning without recovery fine-tuning, which is rarely presented in previous methods with learnable parameters on structures. Our method is also related to the unconstrained channel pruning for CNNs [39]. However, our method explores this idea from the perspective of breaking structural dependence and scales it to much larger models than [39]. Moreover, our method thoroughly explores the global allocation of parameters, where [39] fails to do. ", "page_idx": 2}, {"type": "text", "text": "Recently, several works have been proposed to reduce the size of LLMs. LLM-Pruner [30] aims to remove connected structures using importance calculated from Taylor expansions. SliceGPT [2] offers more flexibility than regular pruning by projecting the feature maps to different spaces but introduces extra parameters in the residuals. LLM Surgeon [37] periodically updates model weights and structures, resulting in a higher cost than LLM-Pruner and SliceGPT. Our proposed DISP-LLM breaks the structural dependence relied on by LLM-Pruner, without additional transformation matrices in the residual connections like SliceGPT. Furthermore, in contrast to LLM Surgeon, which requires extensive computational resources, our method is significantly more efficient. ", "page_idx": 2}, {"type": "text", "text": "3 Preliminary ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "3.1 Notations ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "To better understand our paper, we first define some notations. We use $d$ to denote the model dimension or embedding dimension of LLMs. $\\mathbf{X}\\in\\Re^{b\\times n\\times d}$ is used to represent feature maps, and $b$ is the mini-batch size, $n$ is the number of tokens. $\\mathbf{W}\\in\\Re^{d_{1}\\times d_{2}}$ is the model weights of size $d_{1}\\times d_{2}$ . Let S denote a pseudo-index selection matrix of size $d\\times d$ , which is a diagonal matrix filled with 0 or 1 and the positions of the ones indicate the selected index. We further use $\\hat{\\mathbf{S}}$ of size $d\\times d_{\\mathrm{small}}$ to ", "page_idx": 2}, {"type": "image", "img_path": "YxaY6tHgg0/tmp/8d87370f93c0f759d013881a67045f539501f92540cd512b4c029e240362d5cf.jpg", "img_caption": [], "img_footnote": [], "page_idx": 3}, {"type": "text", "text": "Figure 3: Comparison of the projection matrices for structural pruning. We use $\\mathbf{W}_{\\mathrm{in}}$ and $\\mathbf{W}_{\\mathrm{out}}$ in Fig. 1 as an example. Left: SliceGPT employs orthogonal projection matrices, and it has to insert the projection matrices into the residual connections. Middle: Regular structural pruning methods remove structures based on their dependence, requiring to use the unified selection matrix S for all blocks, which limits flexibility. Right: Our method breaks the structural dependence, allowing the use of different selection matrices $\\mathbf{S}_{i n}$ and $\\mathbf{S}_{o u t}$ for the embedding dimension, significantly improving the flexibility of pruning. ", "page_idx": 3}, {"type": "text", "text": "represent the actual selection matrix by removing $d-d_{\\mathrm{small}}$ columns with all zeros from S. For any matrix A, nnz(A) represents the number of nonzero entries of $\\mathbf{A}$ . ", "page_idx": 3}, {"type": "text", "text": "3.2 Revisit SliceGPT ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "The core idea of SliceGPT [2] is to achieve computational invariance within the transformer architecture. It demonstrates that orthogonal projections can be applied to the output of each block and subsequently undone in the next block. This transformation is computed using Principal Component Analysis (PCA), allowing the feature maps between blocks to be projected into their principal components. A significant advantage of this approach is that it projects the feature maps of different blocks into distinct spaces, thereby introducing an additional degree of freedom for compression. This flexibility is not captured by regular structural pruning methods like LLM-Pruner [30], which rely on structural dependence. ", "page_idx": 3}, {"type": "text", "text": "After slicing (pruning), the feature map and weight matrix of $l$ th layer of SliceGPT become: ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\tilde{\\mathbf{X}}_{l}=\\mathbf{X}_{l}\\mathbf{Q}_{l}\\hat{\\mathbf{S}},\\,\\tilde{\\mathbf{W}}_{l}=\\hat{\\mathbf{S}}^{\\top}\\mathbf{Q}_{l}^{\\top}\\mathbf{W}_{l}.}\\end{array}\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "where $\\hat{\\bf S}$ is a $d\\times d_{\\mathrm{small}}$ selection matrix, $\\mathbf{X}_{l}$ is the output of the $l$ th block, and $\\mathbf{Q}_{l}$ contains eigenvectors of $\\mathbf{C}_{l}$ : ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\mathbf{C}_{l}=\\sum_{i}\\mathbf{X}_{l,i}^{\\top}\\mathbf{X}_{l,i}\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "and $\\mathbf{X}_{l,i}$ is the $i$ -th column of $\\mathbf{X}_{l}$ (corresponding to the $i$ th sequence in the calibration dataset). From Eq. 1, we can see that SliceGPT uses the same selection matrix $\\hat{\\mathbf{S}}$ for all layers, but the feature map $\\mathbf{X}_{l}$ is firstly projected by $\\mathbf{Q}_{l}$ , and the pruning for different layers is along with different directions. One crucial drawback of SliceGPT also comes from the projection matrix $\\mathbf{Q}_{l}$ , since the residual connection must be multiplied by the linear transformation $\\mathbf{\\bar{Q}}_{l}^{\\top}\\mathbf{Q}_{l+1}$ (shown in Fig. 7 left in the Appendix). These additional operations bring a non-trivial amount of additional parameters. For a model that has $L$ blocks, with the model dimension $d$ and the remaining percentage of parameters $p\\in[0,1]$ , it brings approximately $L d^{2}p^{2}$ additional parameters to the model (more than $10\\%$ of model parameters in some cases, and more details are given in Fig 10 in the Appendix). ", "page_idx": 3}, {"type": "text", "text": "3.3 Residual Connections Limit the Flexibility of Structural Pruning ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "SliceGPT offers significant flexibility, but achieving similar flexibility with regular structural pruning methods without adding extra parameters is challenging. This section explains the reasons behind this difficulty. To simplify our reasoning, we replace $\\hat{\\bf S}$ with its pseudo selection matrix S. ", "page_idx": 3}, {"type": "text", "text": "Assume we follow the basic setting of dependence-based structural pruning but allow each layer the flexibility to have its own selection matrix, $\\mathbf{S}_{l}$ , along the embedding dimension. Under this assumption, due to structural dependence, all layers will share the same width of $\\mathrm{nnz}(\\mathbf{S}_{0}\\mathbf{S}_{1}\\cdot\\cdot\\cdot\\mathbf{S}_{L})$ . ", "page_idx": 3}, {"type": "text", "text": "In order to prune different positions for different layers, we need to add a transformation matrix to align the width of layers $l$ and $l+1$ . Intuitively, if we have $\\mathbf{S}_{l}$ and $\\mathbf{S}_{l+1}$ , we can then insert $\\mathbf{S}_{l}^{\\top}\\mathbf{S}_{l+1}$ in the residual connection to align consecutive layers. ", "page_idx": 3}, {"type": "table", "img_path": "YxaY6tHgg0/tmp/76a6f108a5cdfa36bbbef434480c06ba6ebd4ffc136abb229ac5aa390112f6c9.jpg", "table_caption": [], "table_footnote": [], "page_idx": 4}, {"type": "text", "text": "With this setup, we can use ${\\bf X}_{l}{\\bf S}_{l}$ to select subsets of features for different layers, mimicking $\\mathbf{Q}_{l}\\mathbf{S}$ for SliceGPT. Although it seems promising, this formulation has issues with layer widths, as detailed in Proposition 1. ", "page_idx": 4}, {"type": "text", "text": "Proposition 1 (Decreasing feature dimensions for deeper layers). Let the pseudo-selection matrices in layers $l$ and $l+1$ be $\\mathbf{S}_{l}$ and $\\mathbf{S}_{l+1}$ , respectively. The number of nonzero entries in the residual adapter satisfies ", "page_idx": 4}, {"type": "equation", "text": "$$\nn n z(\\mathbf{S}_{l}^{\\top}\\mathbf{S}_{l+1})\\leqslant\\operatorname*{min}\\{n n z(\\mathbf{S}_{l}),n n z(\\mathbf{S}_{l+1})\\}.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "For compression strategies that remove dependent structures for layer $l+1$ following $\\mathbf{S}_{l}^{\\top}\\mathbf{S}_{l+1}$ , this implies that the dimension in layer $l+1$ is less than or equal to that in layer l, with equality holding when the feature indices selected in layer $l+1$ are contained within those in layer $l$ or vice versa. ", "page_idx": 4}, {"type": "text", "text": "Remark. The proof of Proposition. 1 is straightforward and it is given in the Appendix A.1. From Proposition 1, we observe that if we naively apply $\\mathbf{S}_{l}$ for different layers, the model width will progressively decrease as we go deeper into the network. It also fails to provide different sets of features for different layers; instead, it merely passes a subset of features from the previous layer to the next. To avoid this restriction, all blocks must share the same width and the same pruned columns or rows. And we then fall back to the regime of previous structural pruning methods such as LLM-Pruner [30], Shared LLaMA [43], etc. ", "page_idx": 4}, {"type": "text", "text": "Proposition 1 highlights two significant obstacles. First, dependence-based structural pruning methods result in a uniform width along the embedding dimension. Second, inserting selection matrices in the residual connections causes the embedding dimension to decrease with depth. These challenges are unavoidable due to the residual connections linking structures across layers. To enhance flexibility along the embedding dimension, bypassing the residual connections is crucial. ", "page_idx": 4}, {"type": "text", "text": "4 Dimension-Independent Large Language Model ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "4.1 Break the Structural dependence ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "Section 3.3 demonstrates that the residual connection is the primary barrier preventing pruning methods from achieving better flexibility. To avoid modifying the residual connection, we relocate the selection matrices inside the residual connection. This approach allows us to successfully create different subsets from the feature maps for different layers. ", "page_idx": 4}, {"type": "text", "text": "Based on this idea, we propose a solution that involves pruning different positions in consecutive blocks and selecting or merging feature maps from or back to the residual connection. This approach breaks the structural dependence inherent in previous pruning methods. Formally, given a transformer block, we apply the following operations: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathrm{Attention}(\\mathbf{X})=\\mathrm{MultiHead}(\\mathbf{X}\\mathbf{S}_{1}^{\\top}\\mathbf{W}_{q},\\mathbf{X}\\mathbf{S}_{1}^{\\top}\\mathbf{W}_{k},\\mathbf{X}\\mathbf{S}_{1}^{\\top}\\mathbf{W}_{v})\\mathbf{W}_{o}\\mathrm{S}_{2},}\\\\ &{\\mathrm{~\\~\\}\\mathbf{MLP}(\\mathbf{X})=(\\sigma(\\mathbf{X}\\mathbf{S}_{3}^{\\top}\\mathbf{W}_{1}\\mathbf{S}_{4})\\odot(\\mathbf{X}\\mathbf{S}_{3}^{\\top}\\mathbf{W}_{2}\\mathbf{S}_{4}))\\mathbf{S}_{4}^{\\top}\\mathbf{W}_{3}\\mathrm{S}_{5},}\\end{array}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $\\mathbf{S}_{1},\\ldots,\\mathbf{S}_{5}$ are pseudo selection matrices of size $d\\times d$ , and $\\odot$ denotes element-wise multiplication. Eq. 3 gives an example operation for gated MLP modules used in LLaMA [35]. For Phi models [1] or OPT [46], the MLP operation is defined as $\\mathbf{MLP}(\\mathbf{X})\\,=\\,\\sigma(\\mathbf{XS}_{3}^{\\top}\\mathbf{W}_{1}\\mathbf{S}_{4})\\mathbf{S}_{4}^{\\top}\\mathbf{W}_{3}\\mathbf{S}_{5}$ . Fig 2 illustrates how to insert these selection matrices into a transformer block. ", "page_idx": 4}, {"type": "text", "text": "Given the operations defined in Eq. 2 and Eq. 3, we successfully remove the constraint in Proposition 1. The input and output of both the Attention layer and the MLP layer can be selected differently from the original feature maps for different layers, mimicking the function of $\\mathbf{Q}_{l}$ in SliceGPT. Additionally, our method eliminates the need for extra parameters in $\\bar{\\mathbf{Q}}_{l}^{\\top}\\mathbf{Q}_{l+1}$ as it does not alter the residual connection. We also enhance flexibility by pruning the middle dimension of the MLP layer. Additionally, this flexibility can be further improved by allowing the query, key, and value weight matrices to use different selection matrices. Our current form is kept for two reasons: (1) SliceGPT uses one $\\mathbf{Q}_{l}$ per layer, and we followed this design for a fair comparison, and (2) adding separate selection matrices would increase indexing operations, potentially slowing down the inference. Fig 3 further compares the projection matrices for SliceGPT, regular structural pruning, and the proposed method. ", "page_idx": 5}, {"type": "text", "text": "Once we have the final selection matrices $\\mathbf{S}_{1},\\ldots,\\mathbf{S}_{5}$ , the pruned model will use a combination of index selection and index addition for inference as shown in Algorithm 1, where $\\mathbf{Ind}_{i}$ is a set containing all indices equal to one in the diagonal of $\\mathbf{S}_{i}$ : ", "page_idx": 5}, {"type": "equation", "text": "$$\n{\\bf I n d}_{i}=\\{j\\ |\\ {\\mathrm{if}}\\ {\\bf s}_{i\\left[j\\right]}=1\\},\\ {\\bf s}_{i}={\\mathrm{diag}}({\\bf S}_{i}).\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "The same color is used to mark the index set $\\mathbf{Ind}_{i}$ and its corresponding selection matrix $\\hat{\\bf S}_{i}$ . Index_ $\\mathrm{{\\sf~Md}}(\\mathbf{A},\\mathbf{B},\\mathbf{Ind})$ adds matrices A and $\\mathbf{B}$ along the last dimension on selected positions from Ind, then returns A after index addition. With index selection and addition, the block dimension can be freely changed. Index selection and addition introduce some overhead, but as demonstrated in the experiment section, we still observe improvements in throughput. ", "page_idx": 5}, {"type": "text", "text": "4.2 Learning the Width for Dimension-Independent LLMs ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "Building on the dimension-independent setting introduced in Section 4.1, our approach offers much greater flexibility in selecting sub-networks from the original dense model compared to the constrained settings in LLM-Pruner [30]. The next challenge is determining the width of each layer. Given the large search space of our dimension-independent structural pruning and the computationally intensive nature of LLMs, it is impractical to use reinforcement learning [17] or evolutionary search-based algorithms [27]. Therefore, we adopt gradient-based methods to address this challenge. Given the diagonal vector $\\mathbf{s}_{i}\\in\\{0,1\\}^{d}$ from $\\mathbf{S}_{i}$ , the Straight-Through (ST) gradient estimator [3] is used to estimate the gradients with respect to learnable continuous latent parameters. More specifically, we use the recently proposed gradient estimator ReinMax [26] to estimate the gradients through the binary operation. A detailed explanation of ReinMax for the binary case is provided in Appendix A.2. ", "page_idx": 5}, {"type": "text", "text": "Given the large search space of our method, we find that only using element-wise learnable parameters is insufficient. To address this issue, a hypernetwork is introduced to generate latent parameters for ReinMax, as detailed below: ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\mathbf{s}=\\operatorname{ReinMax}(\\operatorname{HyperNetwork}(\\Theta)),\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $\\Theta$ represents the parameters of the hypernetwork and s contains $\\mathbf{s}_{i}$ from all blocks. The hypernetwork is composed of GRU [5] and fully connected layers, where the GRU captures blockwise relationships and the fully connected layers capture relationships between different dimensions. With the hypernetwork and ReinMax, we can effectively learn the width of each block. The details of the hypernetwork are provided in Appendix A.3. ", "page_idx": 5}, {"type": "text", "text": "4.3 Dimension-Independent Structural Pruning as an Optimization Problem ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "With the methods described above, we can formulate dimension-independent structural pruning as an optimization problem, with regularization to control the number of remaining parameters. We insert s back into $\\mathbf{S}$ as defined in section 4.1 for forward and backward calculations. The overall objective function is listed below: ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\underset{\\Theta}{\\mathrm{min}}\\ \\mathcal{L}(\\boldsymbol{X};\\mathbf{W},\\mathbf{s})+\\lambda\\mathcal{R}(T(\\mathbf{s}),p T_{\\mathrm{total}}),}\\\\ &{\\mathcal{R}(T(\\mathbf{s}),p T_{\\mathrm{total}})=\\log(\\operatorname*{max}(T(\\mathbf{s}),p T_{\\mathrm{total}})/\\operatorname*{min}(T(\\mathbf{s}),p T_{\\mathrm{total}})),}\\end{array}\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $\\mathcal{L}$ is the language modeling loss function of next word prediction, $\\mathcal{X}$ represents the input tokens, W is the collection of model weights, s is defined in Eq. 4, and $\\mathcal{R}$ is a parameter regularization loss function defined in Eq. 6. Here, $T(\\mathbf{s})$ denotes the number of parameters controlled by the current structure s, $T_{\\mathrm{total}}$ is the total number of parameters of the model, and $p\\in\\left(0,1\\right]$ is a user-defined parameter to control how many parameters should be preserved within the model. With the objective function in Eq. 5, the structures for dimension-independent pruning can be efficiently optimized. Moreover, the overhead of our method is minimal and comparable to parameter-efficient fine-tuning methods like LoRA [18], as it does not require storing gradients or the first and second-order momentum of model weights for the Adam optimizer [21]. ", "page_idx": 5}, {"type": "table", "img_path": "YxaY6tHgg0/tmp/1d3b94da6f0eecee9f32ca8d85787e8694c3b7a56bb9113b91451dd6941b350d.jpg", "table_caption": ["Table 1: Perplexities of different structural pruning methods on WikiText-2. Our method is the only one that does not update model weights. SliceGPT does not directly update model weights, however, it applies orthogonal transformation matrices to the weights. "], "table_footnote": [], "page_idx": 6}, {"type": "table", "img_path": "YxaY6tHgg0/tmp/db6ec4268ddb9dda19af6b7c996411a8e4687ced984ffb4b460b17f84ae8d928.jpg", "table_caption": ["Table 2: Comparison of our method against semi-structure pruning methods on WikiText-2. "], "table_footnote": [], "page_idx": 6}, {"type": "text", "text": "", "page_idx": 6}, {"type": "text", "text": "5 Experiments ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "5.1 Settings ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "Models. We evaluate our DISP-LLM method using several LLMs with transformer blocks. Specifically, we choose the following models: OPT [46]: OPT-125M, OPT-1.3B, OPT-2.7B, OPT-6.7B; Phi-1.5 [25] and Phi-2 [20]; LLaMA 7B [35]; LLaMA-2 [36]: LLaMA-2 7B and LLaMA-2 13B. ", "page_idx": 6}, {"type": "text", "text": "Implementations. We implemented our method using Pytorch [32] and Hugging Face transformer library [41]. We freeze the model weights W when training the hypernetwork. We use the AdamW [29] optimizer to optimize the hypernetwork. The hypernetwork is trained for 10,000 iterations for all models. For all experiments, we set $\\lambda$ in Obj. 5 to 6. Depending on the size of the base model, we use 1 to 4 NVIDIA A100 GPUs to train the hypernetwork. More implementation details can be found in the Appendix A.4. ", "page_idx": 6}, {"type": "text", "text": "Datasets. Following previous papers [2, 30], we use WikiText-2 and Alpaca datasets to train the hypernetwork. Following SliceGPT [2], we evaluate our method and other methods on five wellknown zero-shot tasks: PIQA [4]; WinoGrande [33]; HellaSwag [45]; ARC-e and ARC-c [6]. We use llm-eval-harness [11] to evaluate the compressed models. ", "page_idx": 6}, {"type": "text", "text": "Baselines. We compare our DISP-LLM across baselines from structural pruning like LLMPruner [30], SliceGPT [2] and LLMSurgeon [37]. We also include semi-structure pruning baselines like SparseGPT [9] and Wanda [34]. ", "page_idx": 6}, {"type": "text", "text": "5.2 Language Modeling ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "In Table 1, we report the perplexity of pruned OPT and LLaMA-2 models. Our DISP-LLM, which does not update weights, consistently outperforms more complex pruning methods such as K-OBD and LLM Surgeon, which involve weight updates, across all pruning ratios and models. The performance gap is even larger when compared to SliceGPT. The advantage is particularly clear in better-trained models like LLaMA-2 7B and 13B. For instance, our method surpasses LLM Surgeon by margins of 5.54 and 2.22 when pruning $50\\%$ of parameters of LLaMA-2 7B and 13B, respectively. Against K-OBD, our performance advantage extends to 36.80 and 9.49 under the same setting. For consistency, we let the pruning ratio of SliceGPT equal the slicing ratio. However, the actual pruning ratio for SliceGPT is much lower than the slicing ratio. More details are given in Appendix A.5. ", "page_idx": 6}, {"type": "table", "img_path": "YxaY6tHgg0/tmp/9b6a48a4594b70429dc53071569da1736ca3abac14d59956cccc80effdbc6394.jpg", "table_caption": ["Table 3: Zero-shot performance of the compressed LLaMA 7B, LLaMA-2 7B and Phi models. The structure of $D I S P{-}L L M$ is based on the WikiText dataset, and the structure of DISP-LLM Alpaca is based on the Alpaca dataset. "], "table_footnote": [], "page_idx": 7}, {"type": "image", "img_path": "YxaY6tHgg0/tmp/588f6638fc93bdff903ee1f4247e5f38774000b9667a252204518f9a322bbf3d.jpg", "img_caption": ["Figure 4: The pruned model architecture along the embedding dimension (model dimension) for the LLaMA-2 7B model when the pruning ratio equals $50\\%$ . "], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "", "page_idx": 7}, {"type": "text", "text": "In Table 2, we report the perplexity of pruned LLaMA and LLaMA-2 models and we compare our method with semi-structure pruning methods. From the table, we can see that our method outperforms both SparseGPT and Wanda on LLaMA 13B and LLaMA-2 7B/13B models. Our method performs on par with SparseGPT and Wanda with the LLaMA 7B model, and our DISP-LLM is a little bit worse than SparseGPT and is similar to Wanda. We are the first to show that structural pruning methods can have a better or similar performance than semi-structural pruning methods. ", "page_idx": 7}, {"type": "text", "text": "5.3 Zero-shot Performance ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "In Tab. 3, we present the zero-shot performance of the pruned model. For the LLaMA 7B model, we compare our method against LLM-Pruner with and without recovery fine-tuning. Our method consistently outperforms LLM-Pruner without fine-tuning, and the gap ranges from 2.63 to 8.88 across different pruning rates for average task performance. After fine-tuning, the performance of LLM-Pruner is largely boosted, however, our method is still able to outperform it demonstrating the existence of strong sub-networks within the original model. For the LLaMA-2 7B model, we compare our method against SliceGPT, K-OBD, and LLM Surgeon. With weight updates, LLM ", "page_idx": 7}, {"type": "image", "img_path": "YxaY6tHgg0/tmp/f88bc422792a748a2e6e1023459d9c3c8499bbd0c22c2d98701245911592f6c2.jpg", "img_caption": ["Figure 5: The training dynamics when learning the hypernetwork are shown in Figs. 5a, 5b, 5e, 5f. The results of different settings are in Figs. 5c, 5d, throughput is in Fig. 5g, and cost is in Fig. 5h. "], "img_footnote": [], "page_idx": 8}, {"type": "image", "img_path": "YxaY6tHgg0/tmp/9ae27b01d6c64d4718392fc4660906adfdc0ce0f0680a8aa3d3a2e335637fdf4.jpg", "img_caption": ["Figure 6: Model width after pruning for the LLaMA-2 7B model when the pruning ratio equals $50\\%$ . "], "img_footnote": [], "page_idx": 8}, {"type": "text", "text": "Surgeon performs well with a lower pruning ratio like $30\\%$ . At this pruning ratio, our method performs similarly to LLM Surgeon, and our method outperforms other comparison baselines. When increasing the pruning ratio to $50\\%$ , the advantage of our method becomes obvious, and the gap between our method and LLM Surgeon is 5.37 for average task performance. We further compare our method with SliceGPT on Phi-1.5 and Phi-2, and our method consistently achieves better performance. ", "page_idx": 8}, {"type": "text", "text": "5.4 Analysis ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "Ablation Study. We visualize the results of ablation studies in Figs. 5a, 5b, 5c, 5d with Phi-1.5 model. The setting “DISP-LLM w/o HN” refers to using element-wise gates for learning subnetworks. The setting “Constrained LLM w HN” refers to pruning the embedding dimension following the structural dependence like LLM-Pruner. From Figs. 5a, 5b, we can see that using the hypernetwork largely accelerates the learning process for DISP-LLM, which is also verified in Figs. 5c, 5d. From Figs. 5c, 5d, we also see that our DISP-LLM always outperforms constrained structural pruning, demonstrating the value of added flexibility by breaking the dependence. To further study the impact of the HyperNetwork architecture, we provide more results in Tab. 4. “w/o $H N^{\\bullet}$ is equivalent to “DISP-LLM w/o HN”. The setting “w/o Bi-GRU” simply removes GRU and adds a fixed input (initialized in the same way as see Appendix A.3 for more details) for each linear layer. These results indicate that both GRU and linear layers within the HyperNetwork affect the final performance. One explanation is that linear layers connect different dimensions of the model, accelerating learning, while GRU layers capture inter-layer relationships, further reducing the difficulty of learning sub-network structures. Therefore, both GRU and linear layers are essential to the HyperNetwork. ", "page_idx": 8}, {"type": "text", "text": "Different Pruning Ratios, Costs and Throughput. In Figs. 5e, 5f, we show the language modeling loss $\\mathcal{L}$ and regularization loss $\\mathcal{R}$ in Obj 5 given different pruning ratios $p$ with Phi-1.5 model. We can see that our method consistently minimizes the language modeling loss across different $p$ . In addition, our method quickly pushes the regularization loss $\\mathcal{R}$ to near 0 values within 200 iterations. In Fig. 5g, the pruned model from LLaMA-13B improves the throughput of the dense model by $1.08\\times$ to $1.50\\times$ . In Fig. 5h, we compare the costs of our method against LLM Surgeon. Our method is $\\bf{27.39\\times}$ and $\\mathbf{14.76\\times}$ cheaper compared to LLM Surgeon with LLaMA-2 7B and LLaMA-2 13B models. ", "page_idx": 8}, {"type": "table", "img_path": "YxaY6tHgg0/tmp/465957581c2fbda4c6a79e4cabff601e7d039220f0bdf959d39416b9120d0c5b.jpg", "table_caption": ["Table 4: The impact of the Hypernetwork architecture on the Phi-1.5 model. Performance is measured by PPL (perplexity). "], "table_footnote": [], "page_idx": 9}, {"type": "text", "text": "", "page_idx": 9}, {"type": "text", "text": "Every Embedding Dimension is Important. In Fig. 4, we visualize the pruning decisions along the embedding dimension and depth for the LLaMA-2 7B model, we can see that all embedding dimensions have been used across different layers. This becomes more obvious in the second right figure of Fig. 4, where we sum all pruning decisions along the depth dimension, and we can see that every embedding dimension is kept around $80\\%$ given all layers. We further visualize the model width after pruning for the LLaMA-2 7B model in Fig. 6, where we can see that several layers are more severely pruned than other layers. ", "page_idx": 9}, {"type": "text", "text": "6 Conclusion ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "In this paper, we proposed dimension-independent structural pruning for Large Language Models. By breaking the structural dependence imposed by previous compression methods, our method creates sub-networks with a lot more flexibility than regular structural pruning methods and also avoids the overhead brought by SliceGPT. The flexibility of our method is reflected in two perspectives. Firstly, our method provides different subsets of the feature maps for different layers. Secondly, our method freely selects the width for each layer without considering architecture dependence. With dramatically increased flexibility, our method outperforms other structural pruning and semi-structural pruning methods given similar pruning ratios. The novel design of the unconstrained pruning space along with strong empirical performance opens new possibilities for structural pruning for LLMs. ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "[1] Marah Abdin, Sam Ade Jacobs, Ammar Ahmad Awan, Jyoti Aneja, Ahmed Awadallah, Hany Awadalla, Nguyen Bach, Amit Bahree, Arash Bakhtiari, Harkirat Behl, et al. Phi-3 technical report: A highly capable language model locally on your phone. arXiv preprint arXiv:2404.14219, 2024.   \n[2] Saleh Ashkboos, Maximilian L Croci, Marcelo Gennari do Nascimento, Torsten Hoefler, and James Hensman. Slicegpt: Compress large language models by deleting rows and columns. In The Twelfth International Conference on Learning Representations, 2024.   \n[3] Yoshua Bengio, Nicholas Léonard, and Aaron Courville. Estimating or propagating gradients through stochastic neurons for conditional computation. arXiv preprint arXiv:1308.3432, 2013.   \n[4] Yonatan Bisk, Rowan Zellers, Jianfeng Gao, Yejin Choi, et al. Piqa: Reasoning about physical commonsense in natural language. In Proceedings of the AAAI conference on artificial intelligence, volume 34, pages 7432–7439, 2020.   \n[5] Kyunghyun Cho, Bart Van Merriënboer, Dzmitry Bahdanau, and Yoshua Bengio. On the properties of neural machine translation: Encoder-decoder approaches. arXiv preprint arXiv:1409.1259, 2014.   \n[6] Peter Clark, Isaac Cowhey, Oren Etzioni, Tushar Khot, Ashish Sabharwal, Carissa Schoenick, and Oyvind Tafjord. Think you have solved question answering? try arc, the ai2 reasoning challenge. arXiv preprint arXiv:1803.05457, 2018.   \n[7] Xin Dong, Shangyu Chen, and Sinno Pan. Learning to prune deep neural networks via layer-wise optimal brain surgeon. In Advances in Neural Information Processing Systems, pages 4857–4867, 2017.   \n[8] Elias Frantar and Dan Alistarh. Optimal brain compression: A framework for accurate post-training quantization and pruning. Advances in Neural Information Processing Systems, 35:4475–4488, 2022.   \n[9] Elias Frantar and Dan Alistarh. Sparsegpt: Massive language models can be accurately pruned in one-shot. In International Conference on Machine Learning, pages 10323–10337. PMLR, 2023.   \n[10] Elias Frantar, Saleh Ashkboos, Torsten Hoefler, and Dan Alistarh. OPTQ: Accurate quantization for generative pre-trained transformers. In The Eleventh International Conference on Learning Representations, 2023.   \n[11] Leo Gao, Jonathan Tow, Stella Biderman, Sid Black, Anthony DiPof,i Charles Foster, Laurence Golding, Jeffrey Hsu, Kyle McDonell, Niklas Muennighoff, Jason Phang, Laria Reynolds, Eric Tang, Anish Thite, Ben Wang, Kevin Wang, and Andy Zou. A framework for few-shot language model evaluation, September 2021.   \n[12] Shangqian Gao, Junyi Li, Zeyu Zhang, Yanfu Zhang, Weidong Cai, and Heng Huang. Device-wise federated network pruning. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 12342–12352, 2024.   \n[13] Shangqian Gao, Zeyu Zhang, Yanfu Zhang, Feihu Huang, and Heng Huang. Structural alignment for network pruning through partial regularization. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 17402–17412, 2023.   \n[14] Song Han, Jeff Pool, John Tran, and William Dally. Learning both weights and connections for efficient neural network. In Advances in neural information processing systems, pages 1135–1143, 2015.   \n[15] Babak Hassibi and David G Stork. Second order derivatives for network pruning: Optimal brain surgeon. Morgan Kaufmann, 1993.   \n[16] Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. Deep residual learning for image recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 770–778, 2016.   \n[17] Yihui He, Ji Lin, Zhijian Liu, Hanrui Wang, Li-Jia Li, and Song Han. Amc: Automl for model compression and acceleration on mobile devices. In Proceedings of the European conference on computer vision (ECCV), pages 784–800, 2018.   \n[18] Edward J Hu, Yelong Shen, Phillip Wallis, Zeyuan Allen-Zhu, Yuanzhi Li, Shean Wang, Lu Wang, and Weizhu Chen. Lora: Low-rank adaptation of large language models. arXiv preprint arXiv:2106.09685, 2021.   \n[19] Zehao Huang and Naiyan Wang. Data-driven sparse structure selection for deep neural networks. In Proceedings of the European conference on computer vision (ECCV), pages 304–320, 2018.   \n[20] Mojan Javaheripi, Sébastien Bubeck, Marah Abdin, Jyoti Aneja, Sebastien Bubeck, Caio César Teodoro Mendes, Weizhu Chen, Allie Del Giorno, Ronen Eldan, Sivakanth Gopi, et al. Phi-2: The surprising power of small language models. Microsoft Research Blog, 2023.   \n[21] Diederik P Kingma and Jimmy Ba. Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980, 2014.   \n[22] Alex Krizhevsky, Ilya Sutskever, and Geoffrey E Hinton. Imagenet classification with deep convolutional neural networks. In Advances in neural information processing systems, pages 1097–1105, 2012.   \n[23] Yann LeCun, John S Denker, and Sara A Solla. Optimal brain damage. In Advances in neural information processing systems, pages 598–605, 1990.   \n[24] Hao Li, Asim Kadav, Igor Durdanovic, Hanan Samet, and Hans Peter Graf. Pruning filters for efficient convnets. ICLR, 2017.   \n[25] Yuanzhi Li, Sébastien Bubeck, Ronen Eldan, Allie Del Giorno, Suriya Gunasekar, and Yin Tat Lee. Textbooks are all you need ii: phi-1.5 technical report. arXiv preprint arXiv:2309.05463, 2023.   \n[26] Liyuan Liu, Chengyu Dong, Xiaodong Liu, Bin Yu, and Jianfeng Gao. Bridging discrete and backpropagation: Straight-through and beyond. Advances in Neural Information Processing Systems, 36, 2023.   \n[27] Yuqiao Liu, Yanan Sun, Bing Xue, Mengjie Zhang, Gary G Yen, and Kay Chen Tan. A survey on evolutionary neural architecture search. IEEE transactions on neural networks and learning systems, 34(2):550–570, 2021.   \n[28] Zhuang Liu, Jianguo Li, Zhiqiang Shen, Gao Huang, Shoumeng Yan, and Changshui Zhang. Learning efficient convolutional networks through network slimming. In ICCV, 2017.   \n[29] Ilya Loshchilov and Frank Hutter. Decoupled weight decay regularization. In International Conference on Learning Representations, 2019.   \n[30] Xinyin Ma, Gongfan Fang, and Xinchao Wang. Llm-pruner: On the structural pruning of large language models. Advances in neural information processing systems, 36:21702–21720, 2023.   \n[31] Asit Mishra, Jorge Albericio Latorre, Jeff Pool, Darko Stosic, Dusan Stosic, Ganesh Venkatesh, Chong Yu, and Paulius Micikevicius. Accelerating sparse deep neural networks. arXiv e-prints, pages arXiv–2104, 2021.   \n[32] Adam Paszke, Sam Gross, Francisco Massa, Adam Lerer, James Bradbury, Gregory Chanan, Trevor Killeen, Zeming Lin, Natalia Gimelshein, Luca Antiga, et al. Pytorch: An imperative style, high-performance deep learning library. In Advances in Neural Information Processing Systems, pages 8024–8035, 2019.   \n[33] Keisuke Sakaguchi, Ronan Le Bras, Chandra Bhagavatula, and Yejin Choi. Winogrande: An adversarial winograd schema challenge at scale. Communications of the ACM, 64(9):99–106, 2021.   \n[34] Mingjie Sun, Zhuang Liu, Anna Bair, and J Zico Kolter. A simple and effective pruning approach for large language models. In The Twelfth International Conference on Learning Representations, 2024.   \n[35] Hugo Touvron, Thibaut Lavril, Gautier Izacard, Xavier Martinet, Marie-Anne Lachaux, Timothée Lacroix, Baptiste Rozière, Naman Goyal, Eric Hambro, Faisal Azhar, et al. Llama: Open and efficient foundation language models. arXiv preprint arXiv:2302.13971, 2023.   \n[36] Hugo Touvron, Louis Martin, Kevin Stone, Peter Albert, Amjad Almahairi, Yasmine Babaei, Nikolay Bashlykov, Soumya Batra, Prajjwal Bhargava, Shruti Bhosale, et al. Llama 2: Open foundation and fine-tuned chat models. arXiv preprint arXiv:2307.09288, 2023.   \n[37] Tycho FA van der Ouderaa, Markus Nagel, Mart Van Baalen, and Tijmen Blankevoort. The llm surgeon. In The Twelfth International Conference on Learning Representations, 2024.   \n[38] Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz Kaiser, and Illia Polosukhin. Attention is all you need. Advances in neural information processing systems, 30, 2017.   \n[39] Alvin Wan, Hanxiang Hao, Kaushik Patnaik, Yueyang Xu, Omer Hadad, David Güera, Zhile Ren, and Qi Shan. Upscale: unconstrained channel pruning. In International Conference on Machine Learning, pages 35384–35412. PMLR, 2023.   \n[40] Jason Wei, Yi Tay, Rishi Bommasani, Colin Raffel, Barret Zoph, Sebastian Borgeaud, Dani Yogatama, Maarten Bosma, Denny Zhou, Donald Metzler, et al. Emergent abilities of large language models. Transactions on Machine Learning Research, 2022.   \n[41] Thomas Wolf, Lysandre Debut, Victor Sanh, Julien Chaumond, Clement Delangue, Anthony Moi, Pierric Cistac, Tim Rault, Rémi Louf, Morgan Funtowicz, Joe Davison, Sam Shleifer, Patrick von Platen, Clara Ma, Yacine Jernite, Julien Plu, Canwen Xu, Teven Le Scao, Sylvain Gugger, Mariama Drame, Quentin Lhoest, and Alexander M. Rush. Transformers: State-of-the-art natural language processing. In Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing: System Demonstrations, pages 38–45, Online, October 2020. Association for Computational Linguistics.   \n[42] Xidong Wu, Shangqian Gao, Zeyu Zhang, Zhenzhen Li, Runxue Bao, Yanfu Zhang, Xiaoqian Wang, and Heng Huang. Auto-train-once: Controller network guided automatic network pruning from scratch. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 16163– 16173, 2024.   \n[43] Mengzhou Xia, Tianyu Gao, Zhiyuan Zeng, and Danqi Chen. Sheared llama: Accelerating language model pre-training via structured pruning. In The Twelfth International Conference on Learning Representations, 2024.   \n[44] Mengzhou Xia, Zexuan Zhong, and Danqi Chen. Structured pruning learns compact and accurate models. In Association for Computational Linguistics (ACL), 2022.   \n[45] Rowan Zellers, Ari Holtzman, Yonatan Bisk, Ali Farhadi, and Yejin Choi. Hellaswag: Can a machine really finish your sentence? In Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics, pages 4791–4800, 2019.   \n[46] Susan Zhang, Stephen Roller, Naman Goyal, Mikel Artetxe, Moya Chen, Shuohui Chen, Christopher Dewan, Mona Diab, Xian Li, Xi Victoria Lin, et al. Opt: Open pre-trained transformer language models. arXiv preprint arXiv:2205.01068, 2022. ", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "image", "img_path": "YxaY6tHgg0/tmp/388a6f6ce24c00e219e3c665cccf3cef7cbe55878b1e6dce478dbdd2870f34bb.jpg", "img_caption": ["A Appendix ", "Figure 7: Left: SliceGPT inserts $\\mathbf{Q}_{l}^{\\top}\\mathbf{Q}_{l+1}$ to the residual connection and brings additional parameters. It also modifies the weights and Layer Norms within the original model. The selection matrix S is omitted for consistency. Right: Our method, DISP-LLM, applies different selection matrices to the input and output dimension of the Attention layer and MLP layer $(\\mathbf{S}_{1}/\\mathbf{S}_{2}$ : Attention in/out; ${\\bf S}_{3}/{\\bf S}_{4}/\\bar{\\bf S}_{5}$ : MLP in/middle/out). "], "img_footnote": [], "page_idx": 13}, {"type": "image", "img_path": "YxaY6tHgg0/tmp/d4ce001d239f14413446eedb5a2eca451481a73c87f083174e8ac13a80a9e7d0.jpg", "img_caption": ["Figure 8: The pruned model architecture along the embedding dimension (model dimension) for the LLaMA-2 13B model when the pruning ratio equals $50\\%$ . "], "img_footnote": [], "page_idx": 13}, {"type": "image", "img_path": "YxaY6tHgg0/tmp/68b16cd09dec30c00c371e1b1e8eeb6a524e6250997f036072b005adf0e14e8a.jpg", "img_caption": ["Figure 9: Model width after pruning for the LLaMA-2 13B model when the pruning ratio equals $50\\%$ . "], "img_footnote": [], "page_idx": 13}, {"type": "text", "text": "A.1 Proof of Proposition 1 ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "Proposition 1 (Decreasing feature dimensions for deeper layers). Let the pseudo-selection matrices in layers $l$ and $l+1$ be $\\mathbf{S}_{l}$ and $\\mathbf{S}_{l+1}$ , respectively. The number of nonzero entries in the residual ", "page_idx": 13}, {"type": "text", "text": "Input: $x$ : sigmoid input;   \n$\\tau$ : temperature; $c$ : constant bias.   \nOutput: $\\mathbf{x}.$ binary vector.   \n1. $\\pi_{0}={\\mathrm{sigmoid}}(x+c)$ ,   \n2. $B=$ sample_binary $\\left(\\pi_{0}\\right)$ ,   \n3. π1 “ $\\begin{array}{r}{\\pi_{1}=\\frac{B+\\mathrm{sigmoid}\\left((x+c)/\\tau\\right)}{2}}\\end{array}$   \n4. π1 “ sigmoidp2stop_gradient $(\\ln(\\pi_{1})-(x+c))+(x+c)),$ , 5. $\\begin{array}{r}{\\pi_{2}=2\\bar{\\pi}_{1}-\\frac{1}{2}\\bar{\\pi}_{0}}\\end{array}$   \n6. x “ π2 ´ stop_gradien $:\\!\\left(\\pi_{2}\\right)+B$   \nReturn x. ", "page_idx": 14}, {"type": "text", "text": "adapter satisfies ", "page_idx": 14}, {"type": "equation", "text": "$$\nn n z(\\mathbf{S}_{l}^{\\top}\\mathbf{S}_{l+1})\\leqslant\\operatorname*{min}\\{n n z(\\mathbf{S}_{l}),n n z(\\mathbf{S}_{l+1})\\}.\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "For compression strategies that remove dependent structures for layer $l+1$ following $\\mathbf{S}_{l}^{\\top}\\mathbf{S}_{l+1}$ , this implies that the dimension in layer $l+1$ is less than or equal to that in layer $l$ , with equality holding when the feature indices selected in layer $l+1$ are contained within those in layer l or vice versa. ", "page_idx": 14}, {"type": "text", "text": "Proof. Consider the pseudo-selection matrices $\\mathbf{S}_{l}$ and $\\mathbf{S}_{l+1}$ , both of size $d\\times d$ , and both diagonal matrices. The number of nonzero entries in $\\mathbf{S}_{l}$ and $\\mathbf{S}_{l+1}$ are given by $\\mathrm{{nnz}}(\\mathbf{S}_{l})=k_{l}$ and $\\mathrm{nnz}(\\mathbf{S}_{l+1})=$ $k_{l+1}$ , respectively. ", "page_idx": 14}, {"type": "text", "text": "The product $\\mathbf{S}_{l}^{\\top}\\mathbf{S}_{l+1}$ is also a diagonal matrix of size $d\\times d$ . Each diagonal entry $(i,i)$ in $\\mathbf{S}_{l}^{\\top}\\mathbf{S}_{l+1}$ is the product of the $i$ -th diagonal entry of $\\mathbf{S}_{l}$ and the $i$ -th diagonal entry of $\\mathbf{S}_{l+1}$ . For an entry $(i,i)$ to be nonzero, both $\\mathbf{S}_{l}(i,i)$ and $\\mathbf{S}_{l+1}(i,i)$ must be nonzero. ", "page_idx": 14}, {"type": "text", "text": "Thus, the number of nonzero entries in $\\mathbf{S}_{l}^{\\top}\\mathbf{S}_{l+1}$ , $\\mathrm{nnz}(\\mathbf{S}_{l}^{\\top}\\mathbf{S}_{l+1})$ , is the number of indices $i$ where both $\\mathbf{S}_{l}(i,i)$ and $\\mathbf{S}_{l+1}(i,i)$ are nonzero. This count cannot exceed the smaller of the total number of nonzero entries in $\\mathbf{S}_{l}$ and $\\mathbf{S}_{l+1}$ . ", "page_idx": 14}, {"type": "text", "text": "Hence, ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\mathrm{\\mathsf{nnz}}(\\mathbf{S}_{l}^{\\top}\\mathbf{S}_{l+1})\\leqslant\\mathrm{min}\\{\\mathrm{\\mathbf{nnz}}(\\mathbf{S}_{l}),\\mathrm{nnz}(\\mathbf{S}_{l+1})\\}.\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "This implies that the effective feature dimension will be smaller or equal to the previous layer. Equality holds if and only if the set of indices corresponding to nonzero entries in $\\mathbf{S}_{l+1}$ is a subset of those in $\\mathbf{S}_{l}$ , or vice versa. This concludes the proof. 口 ", "page_idx": 14}, {"type": "text", "text": "In Proposition 1, “remove dependent structures for layer $l+1$ following $\\mathbf{S}_{l}^{\\top}\\mathbf{S}_{l+1}\\mathbf{\\Sigma}^{,\\ast}$ means that the actual selection matrix for layer $l+1$ becomes $\\mathbf{S}_{l+1}^{\\prime}=\\mathbf{S}_{l}^{\\top}\\mathbf{S}_{l+1}$ , and the structure dependence is cut off by the next residual connection. The pruning for layer $l+1$ will based on $\\mathbf{S}_{l+1}^{\\prime}$ instead of $\\mathbf{S}_{l+1}$ . Although this setting partially breaks the structural dependence, it has the limitation that the embedding dimensions will be reduced when going deeper. ", "page_idx": 14}, {"type": "text", "text": "A.2 Binary ReinMax ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "In this section, we provide details for ReinMax when handling binary variables. The ReinMax in our work can be written as shown in Algorithm. 2. We add a constant bias $c$ to $x$ so that we can control binary vectors to have all one value at the beginning when learning the sub-network architecture for DISP-LLMs. Through all experiments, we set $c$ to 3.0 and $\\tau$ to 1.0. ", "page_idx": 14}, {"type": "image", "img_path": "YxaY6tHgg0/tmp/b0a027b8f193ead678d170494f65c8ac6dd2bbd01adc8ff4b4fc6b35286d8bf0.jpg", "img_caption": ["Figure 10: Expected compression rate vs. actual compression rate of our method and Slice-GPT on the LLaMA-7B model. "], "img_footnote": [], "page_idx": 14}, {"type": "text", "text": "A.3 Details of the Hypernetwork ", "text_level": 1, "page_idx": 14}, {"type": "table", "img_path": "YxaY6tHgg0/tmp/7cfaca1e10c239ca41f7085fe9c078e87ba5f3be0ad9d8ffd24d3dfaf72db5d9.jpg", "table_caption": ["Table 5: The architecture of hypernetwork. "], "table_footnote": [], "page_idx": 15}, {"type": "table", "img_path": "YxaY6tHgg0/tmp/4b6819465ba4ae070e94575ee6e8ecde3160e17db20d8d83ae6d6e582e2e09af.jpg", "table_caption": ["Table 6: Time costs of our method. "], "table_footnote": [], "page_idx": 15}, {"type": "image", "img_path": "YxaY6tHgg0/tmp/1375399f11af2f02575b163c135323ca07a5e0abfa1edc4efad101358cfdc2f8.jpg", "img_caption": ["Figure 11: The training dynamics when learning the hypernetwork for LLaMA-2 7B model with WikiText and Alpaca datasets. "], "img_footnote": [], "page_idx": 15}, {"type": "text", "text": "As we discussed in the paper, the Hypernetwork is composed of linear layers and Bi-GRUs, and now we present the architecture of the HN in Tab. 5. $z$ is initially sampled from a normal distribution, and it is then fixed during training. Outputs $s_{l}$ are continuous values and it is then fed to ReinMax to produce the binary vector: $\\mathbf{s}=\\mathrm{ReinMax}(s)$ , where $s$ is the collection of $s_{l}$ from all layers. $N_{l}$ is the original model width, and it equals the embedding dimension for $\\mathbf{S}_{1}$ , $\\mathbf{S}_{2}$ , $\\mathbf{S}_{3}$ and $\\mathbf{S}_{5}$ . ", "page_idx": 15}, {"type": "text", "text": "A.4 More Implementation Details ", "text_level": 1, "page_idx": 15}, {"type": "image", "img_path": "YxaY6tHgg0/tmp/abe666b0c8739e5d2cda108f0651bf2c911e5447f01a80cdbb44f234504997c3.jpg", "img_caption": ["Figure 12: Preserved rates of the LLaMA-2 13B model across different dimensions. The result is accumulated across all the layers. "], "img_footnote": [], "page_idx": 15}, {"type": "text", "text": "Additional Training Details. During training the hypernetwork, we use AdamW optimizer to optimize it with a constant learning rate $10^{-3}$ and weight decay 0.05. We train the hypernetwork for different models, we always set the mini-batchsize to 1 on each GPU. For OPT 6.7B, LLaMA 7B, and LLaMA-2 7B models, we use 2 NVIDIA A100 GPUs, and for LLaMA 13B and LLaMA-2 13B models, we use 4 NVIDIA A100 GPUs. For all the rest models, we use 1 NVIDIA A100 GPU. We set $p=\\{0.5,0.4,0.3,0.2,0.1\\}$ when the pruning ratios equals to $\\{50\\%,40\\%,30\\%,20\\%,10\\%\\}.$ For the Alpaca dataset 2, we use the ‘text’ column within the dataset which combines the columns of ‘instruction’ and ‘output’. When training the hypernetwork, we again minimize the language modeling loss on the Alpaca dataset instead of applying the training process of instruction fine-tuning. ", "page_idx": 15}, {"type": "text", "text": "Details of Eq. 6. The parameter regularization loss function in Eq. 6 is defined as follows: ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\mathcal{R}(x,y)=\\log\\left(\\frac{\\operatorname*{max}(x,y)}{\\operatorname*{min}(x,y)}\\right)=\\left\\{\\begin{array}{l l}{\\log\\left(\\frac{x}{y}\\right)}&{\\mathrm{if~}x>y,}\\\\ {0}&{\\mathrm{if~}x=y,}\\\\ {\\log\\left(\\frac{y}{x}\\right)}&{\\mathrm{if~}x<y}\\end{array}\\right.\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "Since $y$ is fixed, when $x>y$ , Eq. 6 will decrease $x$ , making it closer to $y$ . Conversely, when $x<y$ , Eq. 6 will increase $x$ , also making it closer to $y$ . Thus, the parameter regularization loss always tries to push the current sub-network to achieve the pre-defined parameter budget. ", "page_idx": 15}, {"type": "table", "img_path": "YxaY6tHgg0/tmp/7549c2cf4f9bdd80894a48fe7c42ae45cba572176f6d908b50e943d074b6a6d5.jpg", "table_caption": ["Table 7: Zero-shot performance of the compressed LLaMA-2 13B model. "], "table_footnote": [], "page_idx": 16}, {"type": "table", "img_path": "YxaY6tHgg0/tmp/3d64233c6fb10475d4bf6872b7fe41a8f387ef24f845af3cd5d4361d8a951296.jpg", "table_caption": ["Table 8: Zero-shot performance of the compressed Phi-2 given more pruning rates and settings. "], "table_footnote": [], "page_idx": 16}, {"type": "text", "text": "Ablation Study Settings. In the ablation study 5.4, we removed the hyperntwork, and we revise Eq. 4: ", "page_idx": 16}, {"type": "equation", "text": "$$\n\\mathbf{s}=\\operatorname{ReinMax}(\\Theta),\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "where $\\Theta$ now has the same size of s, and the parametrization space becomes much smaller. For the constrained setting used in the ablation study 5.4, we simply let $\\mathbf{S}_{1}=\\mathbf{S}_{2}=\\mathbf{S}_{3}=\\mathbf{S}_{5}$ . In section 5.4, we calculate the costs of our method and LLM-Surgeon, and the price comes from the official website of Lambda Cloud3. We also list the detailed time costs of our method in Tab. 6. In Fig. 5b, 5f and also in Fig. 11, we normalized the parameter regularization loss $\\mathcal{R}$ with its maximum value to make plots more consistent. ", "page_idx": 16}, {"type": "text", "text": "Licenses. The licenses for various models and datasets are as follows: LLaMA and LLaMA 2: Licensed under the LLAMA 2 Community License. Phi 1.5 and Phi 2: Licensed under the MIT License. WikiText dataset: Licensed under the Creative Commons Attribution-ShareAlike License (CC BY-SA 4.0). Alpaca dataset: Licensed under the Creative Commons AttributionNonCommercial License (CC BY-NC 4.0). ", "page_idx": 16}, {"type": "text", "text": "A.5 Additional Results ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "SliceGPT compression rates: In Fig. 10, we show the expected compression rate and the actual compression rate for our method and SliceGPT given the LLaMA-2 7B model. It can be seen that SliceGPT adds ${\\pmb5}\\%$ to $13\\%$ parameters of the original model across different pruning rates, which is non-trivial for most LLMs. Notably, SliceGPT with $\\overline{{10\\%}}$ slicing actually adds $3\\%$ more parameters to the original model. ", "page_idx": 16}, {"type": "text", "text": "LLaMA-2 13B Results. In Tab. 7, we show the results of the LLaMA-2 13B model given different pruning rates. From the table, we can see that our method consistently outperforms LLM Surgeon under different pruning rates. The advantage of our method becomes more obvious compared to other methods like K-OBD and SliceGPT. ", "page_idx": 16}, {"type": "text", "text": "Phi-2 Results. In Tab. 8, we present a more comprehensive comparison of our method compared to SliceGPT. Our method outperforms SliceGPT by 5.28 to 7.01 giving SliceGPT with or without fine-tuning on the WikiText dataset. These observations again demonstrate the effectiveness of our method, and our method outperforms methods with recovery fine-tuning in several settings. ", "page_idx": 16}, {"type": "table", "img_path": "YxaY6tHgg0/tmp/3c7036a9c6e0270ee41c1e3de8ef81042e09fb4eb3c7ee36ab990c287834e4ed.jpg", "table_caption": ["Table 9: Zero-shot performance of the compressed LLaMA 13B model. "], "table_footnote": [], "page_idx": 17}, {"type": "table", "img_path": "", "table_caption": ["Table 10: Average results with 5 different runs. The result is evaluated on WikiText-2. Test Performance (PPL), Phi-1.5 Dense: 21.82 $\\overline{{10\\%}}$ $\\overline{{20\\%}}$ $\\overline{{30\\%}}$ $\\overline{{40\\%}}$ 50% 18.72 ˘ 0.07 20.48 ˘ 0.24 22.62 ˘ 0.31 25.44 ˘ 0.39 32.72 ˘ 0.37 "], "table_footnote": [], "page_idx": 17}, {"type": "table", "img_path": "YxaY6tHgg0/tmp/db6e65e88c53cf99f3660c1f0f078933d479c67098f616a0fd14afd6b84d5dfd.jpg", "table_caption": ["Table 11: Throughput of the pruned model. "], "table_footnote": [], "page_idx": 17}, {"type": "text", "text": "", "page_idx": 17}, {"type": "text", "text": "LLaMA-2 3B Results. In Table 9, we present a comparison of our method against LLM Pruner and magnitude pruning. At a pruning ratio of $20\\%$ , our method surpasses the performance of LLM Pruner both with and without fine-tuning. Remarkably, even when the pruning ratio is increased to $50\\%$ , our method continues to outperform the LLM Pruner Channel and the Magnitude pruning baselines at a $20\\%$ pruning rate. These results further illustrate our method’s ability to identify strong sub-networks within the original dense model. ", "page_idx": 17}, {"type": "text", "text": "Architecture of the pruned LLaMA-2 13B. In Fig. 8 and Fig. 9, we visualize the pruned architecture of the LLaMA-2 13B model pruned with the WikiText dataset. We have similar observations as in section. 5.4. In Fig. 9, we can see that middle to late layers have large pruning rates, especially for the attention layer. In Fig. 8 and Fig. 12, we can also see that the preserved rates for different dimensions are similar, and all embedding dimensions are effectively utilized. More interestingly, similar pruning rates across different dimensions are achieved without adding any regularization or constraints. ", "page_idx": 17}, {"type": "text", "text": "Training loss for LLaMA-2 7B. In Fig. 11, we further visualize the training dynamics of the LLaMA-2 7B model on WikiText and Alpaca datasets, respectively. The regularization loss with the Alpaca dataset decreases a little bit faster than the WikiText dataset, probably because the loss value on the Alpaca dataset is smaller. From Fig. 11c, we can also see that the language modeling loss continues to decrease when training longer, especially when the pruning ratio is higher. ", "page_idx": 17}, {"type": "text", "text": "Lastly, we evaluate our method on the Phi-1.5 model with 5 runs, and we report our result with mean and standard deviation in Tab. 10. We also measure the throughput of our method on the LLaMA-2 13B model, and the result is shown in Tab. 11 ", "page_idx": 17}, {"type": "text", "text": "A.6 Additional Analysis ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Impact of $\\lambda$ on Phi-1.5 when pruning ${\\bf50\\,\\%}$ of parameters. We show the result in Tab. 12. ‘NC’ means the loss $\\mathcal{R}$ does not converge, and it is much larger than zero, thus it can not prune the model to the target budget. From the table, we can see that the PPL of the model becomes quite stable if it is ", "page_idx": 17}, {"type": "text", "text": "Table 12: Impact of $\\lambda$ on Phi-1.5 ", "page_idx": 17}, {"type": "table", "img_path": "YxaY6tHgg0/tmp/8d555b7d7cc009b20eecbc2dbbc04522db02eb12bcd9b42bd0fe3195922d9fa8.jpg", "table_caption": [], "table_footnote": [], "page_idx": 17}, {"type": "text", "text": "larger or equal to 6. If $\\lambda$ is not large enough, it takes longer to push the loss $\\mathcal{R}$ to reach near 0 values and thus leaves less time for the model to explore different configurations of subnetworks. On the other hand, if $\\lambda$ is large enough, the loss $\\mathcal{R}$ will reach zero in several hundred iterations and leave enough time to find the desirable subnetwork. Due to this reason, our method is quite stable across larger values of $\\lambda$ as shown in the table. ", "page_idx": 17}, {"type": "table", "img_path": "YxaY6tHgg0/tmp/dd4164689ab02b35d79a01c99223ec22968ceaeab1540541b13d33908a62bff9.jpg", "table_caption": ["Table 13: PPL vs. pruning ratio trade-off for the Phi-2 model. "], "table_footnote": [], "page_idx": 18}, {"type": "table", "img_path": "YxaY6tHgg0/tmp/a5e35c37787889c9f3be9be9dcc3d4deb7b84a403d8163effbd05849d42c0d7c.jpg", "table_caption": ["Table 14: Zero-shot task performance vs pruning ratio trade-off for the LLaMA-2 7B model with the WikiText dataset "], "table_footnote": [], "page_idx": 18}, {"type": "table", "img_path": "YxaY6tHgg0/tmp/a2b202f4fcbf9dfa0694b89b08fcf00b19308ad4c8e3147cfe7be6a456163ded.jpg", "table_caption": ["Table 15: Zero-shot performance of the compressed LLaMA-2 7B model with LoRA fine-tuning. "], "table_footnote": [], "page_idx": 18}, {"type": "text", "text": "More results on pruning ratio vs. performance trade-offs. We provide the trade-off between the pruning ratio and performance for the Phi-2 and LLaMA-2 7B model below in Tab. 13 and Tab. 14. ", "page_idx": 18}, {"type": "text", "text": "LoRA fine-tuning [18] of the compressed LLaMA-2 7B model. We follow similar settings of the SliceGPT and the model is fine-tuned on Alpaca. The result is shown in Table. 15. We can see that our method can be further boosted by using parameter-efficient fine-tuning techniques. Since the performance without fine-tuning is already good enough, we prefer not to involve this additional process in our method to save time and computational costs. ", "page_idx": 18}, {"type": "text", "text": "A.7 Generation Samples ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "We show the generated text given DISP-LLM and SliceGPT in Tab. 16. The examples are obtained based on removing $20\\%$ of the model weights with DISP-LLM and $20\\%$ slicing of SliceGPT ( $10\\%$ compression rate). Both models are compressed from LLaMA-2 7B and they are not finetuned. From these two examples, we can see that SliceGPT only generates a small part of meaningful content and then starts repeating itself. On the other hand, our method tends to generate more relevant content, and the self-repeating behavior is much less obvious. These observations comply with the performance gap between DISP-LLM and SliceGPT. ", "page_idx": 18}, {"type": "text", "text": "A.8 Limitations ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Our method explores how to break the structural dependency of pruning for LLMs. Although our method achieves competitive performance, there are still some limitations that are not solved in our current version. The throughput improvements of our method are not consistent across different models, which is probably because the current implementation of index add or index select operations with PyTorch is not efficient enough. An alternative implementation of our method is to select weight matrices instead of feature maps. In this approach, we perform matrix multiplication with the full feature map and fill the weight matrices with zeros. If we have a custom matrix multiplication implementation that ignores zero rows or columns, it may achieve further speed-up. However, this approach primarily focuses on the engineering perspective and is beyond the scope of this work. We leave the exploration of this alternative implementation to future research. ", "page_idx": 18}, {"type": "text", "text": "A.9 Border Impact ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Our dimension-independent structural pruning method significantly reduces the computational and memory requirements of LLMs, enabling their deployment on resource-limited devices and lowering energy consumption, thus contributing to environmental sustainability. By facilitating the use of efficient LLMs on affordable hardware, our approach democratizes access to advanced AI technologies. However, it is crucial to address potential ethical concerns when reducing the size of LLMs, ensuring privacy and fairness in AI applications with compressed LLMs. Overall, our method fosters a more accessible and sustainable use of AI. ", "page_idx": 18}, {"type": "table", "img_path": "YxaY6tHgg0/tmp/f2b97a64d714593bc97042e05d28a288772fdc6b339a889f3e308d20074aa602.jpg", "table_caption": ["Table 16: Generation samples of LLaMA-2 7B with $20\\%$ compression rate "], "table_footnote": [], "page_idx": 19}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "The checklist is designed to encourage best practices for responsible machine learning research, addressing issues of reproducibility, transparency, research ethics, and societal impact. Do not remove the checklist: The papers not including the checklist will be desk rejected. The checklist should follow the references and precede the (optional) supplemental material. The checklist does NOT count towards the page limit. ", "page_idx": 19}, {"type": "text", "text": "Please read the checklist guidelines carefully for information on how to answer these questions. For each question in the checklist: ", "page_idx": 19}, {"type": "text", "text": "• You should answer [Yes] , [No] , or [NA] . ", "page_idx": 19}, {"type": "text", "text": "• [NA] means either that the question is Not Applicable for that particular paper or the relevant information is Not Available. • Please provide a short (1–2 sentence) justification right after your answer (even for NA). ", "page_idx": 19}, {"type": "text", "text": "The checklist answers are an integral part of your paper submission. They are visible to the reviewers, area chairs, senior area chairs, and ethics reviewers. You will be asked to also include it (after eventual revisions) with the final version of your paper, and its final version will be published with the paper. ", "page_idx": 19}, {"type": "text", "text": "The reviewers of your paper will be asked to use the checklist as one of the factors in their evaluation. While \"[Yes] \" is generally preferable to \"[No] \", it is perfectly acceptable to answer \"[No] \" provided a proper justification is given (e.g., \"error bars are not reported because it would be too computationally expensive\" or \"we were unable to find the license for the dataset we used\"). In general, answering \"[No] \" or \"[NA] \" is not grounds for rejection. While the questions are phrased in a binary way, we acknowledge that the true answer is often more nuanced, so please just use your best judgment and write a justification to elaborate. All supporting evidence can appear either in the main paper or the supplemental material, provided in appendix. If you answer [Yes] to a question, in the justification please point to the section(s) where related material for the question can be found. ", "page_idx": 19}, {"type": "text", "text": "• Delete this instruction block, but keep the section heading “NeurIPS paper checklist\", • Keep the checklist subsection headings, questions/answers and guidelines below. • Do not modify the questions and only use the provided macros for your answers. ", "page_idx": 20}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 20}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Justification: The claims in the abstract/introduction are reflected by the experimental results and other related sections of our method. ", "page_idx": 20}, {"type": "text", "text": "Guidelines: ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 20}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 20}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Justification: It is provided in the Appendix. ", "page_idx": 20}, {"type": "text", "text": "Guidelines: ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 20}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 21}, {"type": "text", "text": "Justification: It is given in the Appendix. Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 21}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 21}, {"type": "text", "text": "Justification: We provided the detailed experimental settings in the experiment section and also in the Appendix to ensure reproducibility of our method. ", "page_idx": 21}, {"type": "text", "text": "Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 21}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 22}, {"type": "text", "text": "Answer: [No] ", "page_idx": 22}, {"type": "text", "text": "Justification: Due to the company policy, the code will only be released after going through the internal review process. ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 22}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 22}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 22}, {"type": "text", "text": "Justification: The details are provided in the Appendix. ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 22}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 22}, {"type": "text", "text": "Answer: [No] ", "page_idx": 22}, {"type": "text", "text": "Justification: We follow the settings of previous methods where the result of a single run is provided. ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper. ", "page_idx": 22}, {"type": "text", "text": "• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 23}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: This has been provided in the Appendix. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 23}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: We followed the NeurIPS Code of Ethics in preparing our manuscript. Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 23}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: Provided in the appendix. Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed. • If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact. ", "page_idx": 23}, {"type": "text", "text": "• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 24}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 24}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 24}, {"type": "text", "text": "Justification: [NA] ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks. ", "page_idx": 24}, {"type": "text", "text": "• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 24}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Justification: Provided in the Appendix. Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 24}, {"type": "text", "text": "", "page_idx": 25}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 25}, {"type": "text", "text": "Answer: [NA] Justification: [NA] Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 25}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 25}, {"type": "text", "text": "Answer: [NA] Justification: [NA] Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 25}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 25}, {"type": "text", "text": "Answer: [NA] Justification: [NA] Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 25}]