[{"figure_path": "xeviQPXTMU/figures/figures_2_1.jpg", "caption": "Figure 1: Overall pipeline of the proposed certified watermarks.", "description": "The figure illustrates the overall pipeline of the proposed certified watermarking method, FedGMark.  It consists of two main modules: the Customized Watermark Generator (CWG) and the Robust Model Loader (RML). The CWG integrates edge information from client graphs and unique client key features to generate customized and diverse watermarks for individual graphs and clients. The RML utilizes a novel GL architecture with multiple submodels and a voting classifier to enhance robustness against watermark removal attacks. The pipeline showcases how watermarked graphs are generated, loaded into the robust model, and how the model provides a certified robustness guarantee.", "section": "3 FedGMark: Our Certified Robust Watermark for FedGL"}, {"figure_path": "xeviQPXTMU/figures/figures_7_1.jpg", "caption": "Figure 2: Example learnt watermarks and watermarked graphs by our FedGMark. CWGs generated by different clients produce unique watermarks, characterized by distinct edge connection patterns.", "description": "This figure shows example watermarks generated by the Customized Watermark Generator (CWG) module of FedGMark for different clients and datasets.  The watermarks are visually distinct, demonstrating the diversity achieved by CWG. This diversity is a key feature enabling FedGMark's robustness.", "section": "4.2 Empirical Results: MA and WA"}, {"figure_path": "xeviQPXTMU/figures/figures_8_1.jpg", "caption": "Figure 3: CWA vs. #perturbed layers r in the layer-perturbation attack.", "description": "This figure shows the certified watermark accuracy (CWA) against the number of perturbed layers (r) in the layer-perturbation attack for different settings of submodels (S).  It illustrates the robustness of FedGMark against this attack, showing how CWA degrades as more layers are perturbed. The plots show that with a larger number of submodels, FedGMark maintains higher CWA even with more perturbed layers, demonstrating its provable robustness.", "section": "4.2 Empirical Results: MA and WA"}, {"figure_path": "xeviQPXTMU/figures/figures_15_1.jpg", "caption": "Figure 4: Impact of Tw on FedGMark against prior watermark removal and layer-perturbation attacks.", "description": "The figure shows the results of FedGMark under different numbers of watermarking clients (Tw) against prior watermark removal attacks (distillation and finetuning) and layer perturbation attacks. It demonstrates the impact of the number of watermarking clients on the performance of FedGMark. The results indicate that a larger number of watermarking clients generally leads to better performance, particularly in terms of watermark accuracy (WA).", "section": "4.2 Empirical Results: MA and WA"}, {"figure_path": "xeviQPXTMU/figures/figures_15_2.jpg", "caption": "Figure 5: Impact of nw on FedGMark against prior watermark removal and layer-perturbation attacks.", "description": "This figure shows the impact of varying the number of watermark nodes (nw) on the performance of FedGMark against different attacks including distillation, finetuning, and the proposed layer perturbation attack.  The results are displayed separately for the MUTAG, PROTEINS, DD, and COLLAB datasets.  It demonstrates FedGMark's robustness to these attacks, even when the watermark size is altered.", "section": "4.2 Empirical Results: MA and WA"}, {"figure_path": "xeviQPXTMU/figures/figures_17_1.jpg", "caption": "Figure 6: Global watermark vs. local watermarks 1-4.", "description": "This figure compares the watermark accuracy (WA) achieved using a global watermark versus four different local watermarks (local 1-4) across four different datasets (MUTAG, PROTEINS, DD, and COLLAB) and three different FedGL models (Fed-GIN, Fed-GSAGE, and Fed-GCN).  The results show that while local watermarks are effective, a global watermark, despite not being explicitly used during training, offers slightly better performance. This suggests that the federated training process effectively aggregates the effects of the local watermarks, strengthening the overall watermarking process.", "section": "E Discussion"}]