[{"figure_path": "xtK3gZjQDC/tables/tables_6_1.jpg", "caption": "Table 1: Empirical average test accuracy achieved by four different (simulated) human experts, each with a different noise value γ, on their own (NONE) and using prediction sets constructed with conformal prediction (NAIVE, APS, RAPS and SAPS) and with the greedy algorithm (GREEDY) on four synthetic classification tasks. In each classification task, the classifier f used by conformal prediction and the greedy algorithm achieves a different average accuracy P(Y' = Y). The number of labels is L = 10, the size of the calibration set is m = 1000, and we do not include brute force search because it achieves the same performance as the greedy algorithm. Each cell shows the average and standard deviation over 10 runs. We denote the best results for each classification task in bold.", "description": "This table presents the results of a simulation study comparing the average accuracy of four simulated human experts using prediction sets generated by different methods. The methods include conformal prediction with four different non-conformity scores (NAIVE, APS, RAPS, SAPS) and a novel greedy algorithm (GREEDY). The table shows the average accuracy of each expert for four different classification tasks and four noise levels (γ).  The best performing method for each scenario is highlighted in bold.", "section": "5 Experiments with Synthetic Data"}, {"figure_path": "xtK3gZjQDC/tables/tables_8_1.jpg", "caption": "Table 2: Average test accuracy achieved by a (simulated) human expert on their own (NONE), and using the prediction sets constructed with conformal prediction (NAIVE, APS, RAPS and SAPS), and our greedy algorithm (GREEDY) on the ImageNet16H dataset. We do not include brute force search because it achieves the same performance as the greedy algorithm. Each cell shows the average and standard deviation over 10 runs. We denote the best results in bold.", "description": "This table presents the average test accuracy achieved by simulated human experts using different prediction set construction methods on the ImageNet16H dataset.  The methods compared include four types of conformal prediction (NAIVE, APS, RAPS, SAPS) and a greedy algorithm (GREEDY).  The table shows the average accuracy for each method across four different noise levels (ω = 80, 95, 110, 125), along with the standard deviation across 10 runs.  The best performing method for each noise level is highlighted in bold. A baseline is also provided (NONE), showing the human expert's accuracy without the aid of a prediction set.", "section": "Experiments with Real Data"}, {"figure_path": "xtK3gZjQDC/tables/tables_18_1.jpg", "caption": "Table 1: Empirical average test accuracy achieved by four different (simulated) human experts, each with a different noise value γ, on their own (NONE) and using prediction sets constructed with conformal prediction (NAIVE, APS, RAPS and SAPS) and with the greedy algorithm (GREEDY) on four synthetic classification tasks. In each classification task, the classifier f used by conformal prediction and the greedy algorithm achieves a different average accuracy P(Y' = Y). The number of labels is L = 10, the size of the calibration set is m = 1000, and we do not include brute force search because it achieves the same performance as the greedy algorithm. Each cell shows the average and standard deviation over 10 runs. We denote the best results for each classification task in bold.", "description": "This table presents the average test accuracy achieved by four simulated human experts with varying levels of noise (γ) using different methods to construct prediction sets.  It compares the performance of the experts using prediction sets from conformal prediction methods (NAIVE, APS, RAPS, SAPS) and the greedy algorithm, against the experts' performance without any prediction sets (NONE). The results are averaged over 10 runs for each classification task, with the best performing method highlighted in bold.", "section": "Experiments with Synthetic Data"}, {"figure_path": "xtK3gZjQDC/tables/tables_19_1.jpg", "caption": "Table 1: Empirical average test accuracy achieved by four different (simulated) human experts, each with a different noise value γ, on their own (NONE) and using prediction sets constructed with conformal prediction (NAIVE, APS, RAPS and SAPS) and with the greedy algorithm (GREEDY) on four synthetic classification tasks. In each classification task, the classifier f used by conformal prediction and the greedy algorithm achieves a different average accuracy P(Y' = Y). The number of labels is L = 10, the size of the calibration set is m = 1000, and we do not include brute force search because it achieves the same performance as the greedy algorithm. Each cell shows the average and standard deviation over 10 runs. We denote the best results for each classification task in bold.", "description": "This table presents the average test accuracy achieved by four simulated human experts with varying levels of noise (γ) using different methods for constructing prediction sets.  It compares the accuracy of the experts making predictions on their own (NONE) to the accuracy when using prediction sets from conformal prediction methods (NAIVE, APS, RAPS, SAPS) and the proposed greedy algorithm (GREEDY). The results are shown for four synthetic classification tasks with different classifier accuracies (P(Y'=Y)) and highlight the superior performance of the greedy algorithm.", "section": "Experiments with Synthetic Data"}, {"figure_path": "xtK3gZjQDC/tables/tables_19_2.jpg", "caption": "Table 7: Empirical coverage achieved by the prediction sets constructed using conformal prediction (NAIVE, APS, RAPS, SAPS) and using the greedy algorithm (GREEDY) on the ImageNet-16H dataset. Each cell shows the average and standard deviation over 10 runs. We denote the best results for each noise level in bold.", "description": "This table presents the empirical average test coverage achieved by prediction sets generated using different methods across four noise levels in the ImageNet16H dataset.  The methods include four conformal prediction approaches (NAIVE, APS, RAPS, SAPS) and the proposed greedy algorithm (GREEDY).  The table highlights the average coverage and standard deviation across 10 runs for each method and noise level, indicating the consistency of coverage performance.  Bold values indicate the best coverage obtained for each noise level.", "section": "Experiments with Real Data"}]