[{"figure_path": "wz2KvvEk44/tables/tables_6_1.jpg", "caption": "Table 1: DMControl results in video-background settings. We evaluate each seed five times and calculate the mean value. Then, we calculate the mean and standard deviation with four random seeds. Red indicates the best and blue indicates the second-best. Δ = improvement of SMG over the second best.", "description": "This table presents the generalization performance of SMG and other baseline methods across five DMControl tasks under video-background settings (the most challenging settings).  The table shows the mean and standard deviation of the results obtained using four random seeds, with each seed evaluated five times.  The \"Δ\" column indicates the performance improvement of SMG compared to the second-best performing method for each task. Red highlights the best performing method, while blue highlights the second-best.", "section": "4.2 DMControl Results"}, {"figure_path": "wz2KvvEk44/tables/tables_7_1.jpg", "caption": "Table 1: DMControl results in video-background settings. We evaluate each seed five times and calculate the mean value. Then, we calculate the mean and standard deviation with four random seeds. Red indicates the best and blue indicates the second-best. ∆ = improvement of SMG over the second best.", "description": "This table presents the generalization performance of SMG and other baseline methods on five DMControl tasks under video-background settings.  The results are averaged over four random seeds and show the mean and standard deviation.  The table highlights SMG's superior performance, particularly in challenging video-hard settings.", "section": "4.2 DMControl Results"}, {"figure_path": "wz2KvvEk44/tables/tables_7_2.jpg", "caption": "Table 1: DMControl results in video-background settings. We evaluate each seed five times and calculate the mean value. Then, we calculate the mean and standard deviation with four random seeds. Red indicates the best and blue indicates the second-best. Δ = improvement of SMG over the second best.", "description": "This table presents the generalization performance of SMG and baseline methods across five DMControl tasks under video-background settings, which is considered the most challenging evaluation scenario.  The results are averaged across four random seeds, with each seed evaluated five times.  The table shows SMG's average return for each task, along with the mean and standard deviation, and highlights the performance improvement of SMG over the next-best performing method (second-best).", "section": "4.2 DMControl Results"}, {"figure_path": "wz2KvvEk44/tables/tables_13_1.jpg", "caption": "Table 1: DMControl results in video-background settings. We evaluate each seed five times and calculate the mean value. Then, we calculate the mean and standard deviation with four random seeds. Red indicates the best and blue indicates the second-best. Δ = improvement of SMG over the second best.", "description": "This table presents the generalization performance of SMG and other baseline methods on five DMControl tasks under video-background settings.  The video-background settings are designed to challenge generalization ability. The table shows the mean and standard deviation of the performance across four random seeds.  The Δ column shows the performance improvement of SMG over the second-best method for each task.  The results demonstrate SMG's superior generalization performance.", "section": "4.2 DMControl Results"}, {"figure_path": "wz2KvvEk44/tables/tables_15_1.jpg", "caption": "Table 1: DMControl results in video-background settings. We evaluate each seed five times and calculate the mean value. Then, we calculate the mean and standard deviation with four random seeds. Red indicates the best and blue indicates the second-best. ∆ = improvement of SMG over the second best.", "description": "This table presents the generalization performance of SMG and other baseline methods on DMControl tasks under video-background modifications.  It shows the mean and standard deviation of the results across four random seeds, indicating which method performs best (red) and second best (blue) for each task.  The delta column (∆) shows the improvement of SMG over the second-best performer.  The video-background setting is particularly challenging, designed to test generalization capabilities.", "section": "4.2 DMControl Results"}, {"figure_path": "wz2KvvEk44/tables/tables_15_2.jpg", "caption": "Table 1: DMControl results in video-background settings. We evaluate each seed five times and calculate the mean value. Then, we calculate the mean and standard deviation with four random seeds. Red indicates the best and blue indicates the second-best. Δ = improvement of SMG over the second best.", "description": "This table presents the generalization performance of SMG and other baseline methods on five DMControl tasks under video-background settings, which simulate real-world scenarios with changing video backgrounds.  The results are averaged over multiple runs with different random seeds.  The table highlights SMG's superior performance, especially in challenging video-hard settings, compared to the other algorithms.  The Δ column shows the performance improvement of SMG over the second-best method for each task.", "section": "4.2 DMControl Results"}, {"figure_path": "wz2KvvEk44/tables/tables_16_1.jpg", "caption": "Table 1: DMControl results in video-background settings. We evaluate each seed five times and calculate the mean value. Then, we calculate the mean and standard deviation with four random seeds. Red indicates the best and blue indicates the second-best.  Δ = improvement of SMG over the second best.", "description": "This table presents the generalization performance of SMG and other baseline methods across five DMControl tasks under video-background settings.  The video-background setting makes the tasks more challenging by modifying the background of the environment.  The table shows the mean and standard deviation of the scores achieved by each method across four random seeds.  The best performing method is highlighted in red, and the second best is highlighted in blue.  The last column (Δ) shows the improvement in score achieved by SMG over the second best-performing method.", "section": "4.2 DMControl Results"}, {"figure_path": "wz2KvvEk44/tables/tables_16_2.jpg", "caption": "Table 1: DMControl results in video-background settings. We evaluate each seed five times and calculate the mean value. Then, we calculate the mean and standard deviation with four random seeds. Red indicates the best and blue indicates the second-best. ∆ = improvement of SMG over the second best.", "description": "This table presents the generalization performance of SMG and other baseline methods across various DMControl tasks under video-background settings, which are considered the most challenging.  The results are averages across multiple runs and include mean values, standard deviations, and the improvement achieved by SMG compared to the second-best performing method.  The table highlights SMG's superior performance, particularly in more difficult video-background settings.", "section": "4.2 DMControl Results"}, {"figure_path": "wz2KvvEk44/tables/tables_17_1.jpg", "caption": "Table 1: DMControl results in video-background settings. We evaluate each seed five times and calculate the mean value. Then, we calculate the mean and standard deviation with four random seeds. Red indicates the best and blue indicates the second-best. Δ = improvement of SMG over the second best.", "description": "This table presents the generalization performance of SMG and several baseline methods across five DMControl tasks under video-background modifications.  The results are averaged over four random seeds and show SMG's performance compared to baselines (SAC, DrQ, SODA, SVEA, SRM, SGQN).  The table highlights SMG's superior performance in video-background settings, particularly in more challenging scenarios (video-hard).  The Δ column shows the improvement in performance of SMG over the second-best performing method for each task.", "section": "4.2 DMControl Results"}]