{"importance": "This paper is crucial for researchers in preference learning and human decision-making. It **bridges the gap between realistic cognitive models and tractable preference learning methods**, offering a novel approach to inferring latent utilities from human choices. This work significantly improves the accuracy of preference learning and opens new avenues for research in AI systems that learn from human feedback, particularly in complex tasks involving multiple objectives and contextual effects.", "summary": "Human-like choice modeling revolutionizes preference learning!  A new tractable model, CRCS, significantly improves utility inference from human data, outperforming existing methods.", "takeaways": ["The CRCS model, a tractable surrogate of a complex cognitive model, accurately predicts human choices and outperforms existing models in various datasets.", "The LC-CRCS extension further improves performance by incorporating cross-feature effects, demonstrating the importance of modeling cognitive intricacies.", "Active learning using CRCS and LC-CRCS significantly enhances utility inference with limited data, showing great potential in real-world applications where data collection is expensive."], "tldr": "Preference learning aims to infer human preferences from choices, but existing models often oversimplify human decision-making.  This leads to inaccurate predictions and limits the applicability of these models to real-world scenarios, especially when dealing with complex tasks and context-dependent choices.  Context effects, such as decoy effects where introducing an inferior option alters preferences, are commonly observed but not well-captured by existing models.\nThis paper introduces a novel tractable surrogate model, CRCS, based on a state-of-the-art cognitive model of human choice. This model accounts for contextual effects and other complexities in human decision-making. The researchers demonstrate that CRCS produces significantly better inferences compared to existing methods. Furthermore, they propose LC-CRCS, an extension that leverages the benefits of a complementary model to improve performance.  These improvements were empirically validated using large-scale human data and simulations of real-world scenarios.", "affiliation": "Aalto University", "categories": {"main_category": "Machine Learning", "sub_category": "Reinforcement Learning"}, "podcast_path": "nfq3GKfb4h/podcast.wav"}