[{"figure_path": "1L5vaNIoK5/tables/tables_7_1.jpg", "caption": "Table 1: Quantitative Results on Global Attacks: The table includes the attack result for all transformer based diffusion policy networks. Our DP-Attack can significantly lower the performance of the diffusion models.", "description": "This table presents the quantitative results of global attacks on transformer-based diffusion policy networks.  It compares the success rate (performance) of the models under different attack scenarios: clean (no attack), random noise, targeted offline, untargeted offline, targeted online, and untargeted online.  The results show a significant decrease in performance when DP-Attacker is used, demonstrating its effectiveness in reducing the models' success rate.", "section": "5.1 Global Attack"}, {"figure_path": "1L5vaNIoK5/tables/tables_7_2.jpg", "caption": "Table 2: Quantitative Results on Patched Attacks", "description": "This table presents the quantitative results of the patched attack experiments. It shows the success rate of different diffusion policy models (CNN and Transformer backbones) on four tabletop manipulation tasks (Can, Lift, Square, and Toolhang) when subjected to different types of attacks: Clean (no attack), Random Noise Patch (adding random noise as a baseline), and Untargeted-Offline (patched attacks).  The results demonstrate the effectiveness of DP-Attacker in reducing the performance of diffusion policies.", "section": "5.2 Patched Attack"}, {"figure_path": "1L5vaNIoK5/tables/tables_8_1.jpg", "caption": "Table 3: Different Parameters for DP-Attack: We did an ablation study on parameters σ and N, and we can see that smaller steps and budgets are not enough to fool a DP. Larger budgets will dramatically decrease the Sucess Rate (SR).", "description": "This table presents the results of an ablation study conducted to determine the impact of two key parameters (σ and N) on the effectiveness of the DP-Attacker.  The study varied the number of steps (N) in the attack algorithm and the attack budget (σ), measuring the resulting success rate (SR). The results show that smaller values for both parameters are less effective at fooling the diffusion policy.  Conversely, increasing the attack budget significantly reduces the success rate, suggesting a trade-off between attack strength and robustness.", "section": "5.1 Global Attack"}, {"figure_path": "1L5vaNIoK5/tables/tables_9_1.jpg", "caption": "Table 4: Compared with End to End Attacks DP-Attacker runs significantly faster than the end-to-end attacks even if it is accelerated with DDIM. Our DP-Attacker also provides better attack results.", "description": "This table compares the speed and success rate of different attack methods against diffusion policies.  The \"End to End DDPM\" and \"End to End DDIM-8\" methods represent a more naive approach, while \"DP-Attacker\" uses a more targeted approach. The table demonstrates that the DP-Attacker method is significantly faster, and achieves superior results in terms of reducing the model's success rate.", "section": "5 Experiments"}, {"figure_path": "1L5vaNIoK5/tables/tables_15_1.jpg", "caption": "Table 1: Quantitative Results on Global Attacks: The table includes the attack result for all transformer-based diffusion policy networks. Our DP-Attack can significantly lower the performance of the diffusion models.", "description": "This table presents a quantitative evaluation of global attacks on transformer-based diffusion policy networks.  It compares the success rate (performance) of the models under various conditions:\n\n* **Clean:** Represents the baseline performance without any attacks.\n* **Random Noise:** Shows the effect of adding random noise to the input, serving as a simple baseline attack.\n* **Targeted Offline:**  Measures the success rate of targeted attacks generated offline (perturbations are pre-computed and applied consistently throughout the task).\n* **Untargeted Offline:** Shows the success rate of untargeted attacks generated offline (perturbations aim to disrupt the model's behavior without targeting a specific outcome).\n* **Targeted Online:** Measures the success rate of targeted attacks generated online (perturbations are generated dynamically based on the current state).\n* **Untargeted Online:** Shows the success rate of untargeted attacks generated online.\n\nFor each attack type, the success rate is reported for different tasks (PushT, Can, Lift, Square, Transport, and Toolhang) and datasets (PH and MH). The results demonstrate the effectiveness of DP-Attacker in significantly reducing the performance of diffusion policy models across various attack scenarios.", "section": "5.1 Global Attack"}, {"figure_path": "1L5vaNIoK5/tables/tables_16_1.jpg", "caption": "Table 1: Quantitative Results on Global Attacks: The table includes the attack result for all transformer based diffusion policy networks. Our DP-Attack can significantly lower the performance of the diffusion models.", "description": "This table presents the results of global attacks on transformer-based diffusion policy networks.  It compares the success rate (performance) of the models in various conditions: \n- **Clean:**  The baseline performance without any attack.\n- **Random Noise:** The model's performance when random noise is added to the input, serving as a simple baseline attack.\n- **Targeted-Offline/Online:** The model's performance when a targeted adversarial attack (designed to force a specific action) is applied offline (perturbation is fixed) or online (perturbation changes per frame). \n- **Untargeted-Offline/Online:** The model's performance when an untargeted adversarial attack (designed to reduce performance regardless of specific action) is applied offline or online.\nThe results show that DP-Attacker significantly reduces the model's performance in all attack scenarios.", "section": "5.1 Global Attack"}, {"figure_path": "1L5vaNIoK5/tables/tables_16_2.jpg", "caption": "Table 7: Compared with End to End Attacks DP-Attacker runs significantly faster than the end-to-end attacks even if it is accelerated with DDIM. Our DP-Attacker also provides better attack results", "description": "This table compares the speed and effectiveness of the proposed DP-Attacker method against two baseline end-to-end attack methods (using DDPM and DDIM-8). It shows that DP-Attacker achieves comparable or better attack success rates while being significantly faster.  The results highlight the efficiency of DP-Attacker, especially when considering real-time attack scenarios.", "section": "5.1 Global Attack"}, {"figure_path": "1L5vaNIoK5/tables/tables_17_1.jpg", "caption": "Table 8: Model success rate of the CAN task trained on the MH dataset. We generated offline global attacks for each backbone first, and tested them on both models. The attack transfer case is marked in blue. We also report the model’s original SR (without perturbation).", "description": "This table presents the results of offline global attacks performed on two different backbones (CNN and Transformer) for the CAN task using the MH dataset.  Two models were trained separately, one using a CNN backbone and the other a Transformer backbone.  Offline attacks were generated using each backbone individually. The success rate (SR) is reported for each scenario: original SR (no attack), and attacks transferred from the CNN to the Transformer model, and vice-versa.  The values in blue highlight the transferability of attacks between different backbone models.", "section": "5.2 Patched Attack"}, {"figure_path": "1L5vaNIoK5/tables/tables_17_2.jpg", "caption": "Table 9: Model success rate of the CAN task trained on the PH dataset. We generated physical patched attacks for each backbone first, and tested them on both models. The attack transfer case is marked in blue. We also report the model's original SR (without perturbation).", "description": "This table presents the results of testing the transferability of offline patched attacks across different backbones.  Two models (CNN and Transformer) were trained on the CAN task using the PH dataset.  Offline patched attacks were generated for each model and then used to attack both models. The table shows the success rate for each scenario, with the original success rate (before attack) provided for comparison. The blue-shaded cells highlight cases where the attacks were successfully transferred from one model to the other.", "section": "5.2 Patched Attack"}]