[{"figure_path": "G7NZljVOol/tables/tables_7_1.jpg", "caption": "Table 1: Comparisons of prediction error (%) with prior TTA methods on CIFAR-10-C with ResNet-26 and ImageNet-C with ResNet-50.", "description": "This table presents a comparison of the prediction error rates (%) achieved by different Test-Time Adaptation (TTA) methods on two benchmark datasets: CIFAR-10-C and ImageNet-C.  The results are broken down by corruption type (Noise, Blur, Weather, Digital, etc.) and show the performance of various methods, including the proposed L-TTA method. ResNet-26 was used for CIFAR-10-C and ResNet-50 for ImageNet-C.", "section": "4 Experimental Results"}, {"figure_path": "G7NZljVOol/tables/tables_8_1.jpg", "caption": "Table 2: Comparison of mIoU (%) for semantic segmentation in Cityscapes-C using DeepLabV3Plus with prior TTA methods.", "description": "This table compares the mean Intersection over Union (mIoU) scores achieved by different test-time adaptation (TTA) methods on the Cityscapes-C dataset, which contains semantic segmentation images with various weather conditions. The methods compared include the baseline (Source), the proposed method with and without specific components (Ours w/o GCAL, Ours w/o DEL, Ours), and other state-of-the-art (SOTA) TTA methods (BN STAT, TENT, EcoTTA). The results are presented for each weather condition (Bright, Foggy, Frost, Snow), as well as the average mIoU across all conditions.  The memory usage (Mem.) of each method is also reported in MB to highlight the memory efficiency of the proposed method.", "section": "4 Experimental Results"}, {"figure_path": "G7NZljVOol/tables/tables_15_1.jpg", "caption": "Table 3: Evaluation of the proposed method using ResNet-50 on challenging ImageNet series.", "description": "This table presents the results of evaluating the proposed method's robustness on three challenging ImageNet series: ImageNet-Sketch, ImageNet-R, and ImageNet-A.  The results are shown as prediction error percentages. The \"Source\" column indicates the baseline performance of a ResNet-50 model pre-trained on ImageNet. The \"Ours w/o GCAL\" column shows the performance of the model with the proposed method, excluding the Gaussian Channel Attention Layer (GCAL). The \"Ours\" column represents the performance with the full proposed method. The values in parentheses show the improvement compared to the \"Source\" column, illustrating the method's ability to mitigate performance degradation in challenging scenarios.", "section": "4.3 Ablation Studies"}, {"figure_path": "G7NZljVOol/tables/tables_15_2.jpg", "caption": "Table 4: Comparison of TTA results in terms of average prediction errors for source, DWT level 1, and level 2 decompositions using ResNet-50 on CIFAR-10-C, CIFAR-100-C, and ImageNet-C.", "description": "This table presents the ablation study on the effect of different DWT levels (1 and 2) on the performance of the proposed TTA method. It compares the average prediction errors on three datasets (CIFAR-10-C, CIFAR-100-C, and ImageNet-C) for the source model (without DWT), the model with DWT level 1, the model with DWT level 1 and TTA, the model with DWT level 2, and the model with DWT level 2 and TTA.  The results demonstrate the impact of multi-level decomposition using DWT in improving TTA performance.", "section": "D Appendix: Ablation Studies on Architectural Exploration"}, {"figure_path": "G7NZljVOol/tables/tables_15_3.jpg", "caption": "Table 5: Comparison TTA results in terms of average prediction errors using ResNet-50 on CIFAR-10-C, CIFAR-100-C, and ImageNet-C, focusing on the influence of the SE block's reduction scale.", "description": "This table shows the ablation study on the reduction size hyperparameter of the SE block in GCAL.  The results for CIFAR-10-C, CIFAR-100-C, and ImageNet-C datasets are shown, indicating that reduction sizes of 8, 4, and 32 achieve the best results respectively.  However, there is no significant difference except when the reduction size is 16 in CIFAR-10-C. Even with the different reduction sizes, the results exceed the SOTA.", "section": "D Appendix: Ablation Studies on Architectural Exploration"}, {"figure_path": "G7NZljVOol/tables/tables_16_1.jpg", "caption": "Table 1: Comparisons of prediction error (%) with prior TTA methods on CIFAR-10-C with ResNet-26 and ImageNet-C with ResNet-50.", "description": "This table presents a comparison of the prediction error rates (%) achieved by various test-time adaptation (TTA) methods on two benchmark datasets: CIFAR-10-C and ImageNet-C.  The results are broken down by different types of image corruptions (e.g., noise, blur, weather effects, digital corruptions) applied to the datasets.  The table allows for a direct comparison of the performance of the proposed L-TTA method with existing state-of-the-art (SOTA) TTA techniques.  Additionally, it shows the memory usage (in MB) for each method, highlighting the memory efficiency of the proposed approach. ResNet-26 and ResNet-50 are used as backbone networks for the CIFAR-10-C and ImageNet-C experiments, respectively.", "section": "4 Experimental Results"}, {"figure_path": "G7NZljVOol/tables/tables_16_2.jpg", "caption": "Table 1: Comparisons of prediction error (%) with prior TTA methods on CIFAR-10-C with ResNet-26 and ImageNet-C with ResNet-50.", "description": "This table presents a comparison of the prediction error rates (%) achieved by various Test-Time Adaptation (TTA) methods on two benchmark datasets: CIFAR-10-C and ImageNet-C.  The datasets are corrupted versions of CIFAR-10 and ImageNet, respectively, designed to evaluate model robustness to various image corruptions.  The table shows the average error rates across 15 different corruption types for each method, using ResNet-26 for CIFAR-10-C and ResNet-50 for ImageNet-C.  It allows for a quantitative comparison of the proposed L-TTA method against state-of-the-art (SOTA) TTA techniques in terms of prediction accuracy.", "section": "4 Experimental Results"}, {"figure_path": "G7NZljVOol/tables/tables_17_1.jpg", "caption": "Table 6: Comparisons of prediction error (%) with prior TTA methods on ResNet-50.", "description": "This table compares the prediction error rates of different Test-Time Adaptation (TTA) methods, including the proposed method, on the ResNet-50 model for CIFAR-10-C and CIFAR-100-C datasets.  It shows the average prediction error across 15 types of corruptions for each method and also lists the memory usage. This allows for a comparison of accuracy and efficiency between various TTA approaches.", "section": "4.2 Main Results"}, {"figure_path": "G7NZljVOol/tables/tables_17_2.jpg", "caption": "Table 8: Comparison of Prediction Errors (%) between the proposed method and high-cost methodologies on ResNet-50.", "description": "This table compares the prediction error rates (%) of the proposed L-TTA method with those of several other high-cost TTA methods.  The comparison is made using the ResNet-50 model on two datasets: CIFAR-10-C and CIFAR-100-C, which are corrupted versions of the CIFAR-10 and CIFAR-100 datasets, respectively.  The table highlights that the proposed method achieves competitive or superior performance compared to existing methods, while significantly reducing memory usage.", "section": "4.3 Ablation Studies"}]