[{"figure_path": "SAZeQV2PtT/figures/figures_5_1.jpg", "caption": "Figure 1: Example unnormalized posterior densities given 50 data points for (1a) the Cauchy location model and (1b) the logistic regression model. The orange and blue dashed lines in (1b) indicate one-dimensional slices that are shown in the rightmost panels.", "description": "This figure shows the unnormalized posterior density for two different Bayesian models given 50 data points.  Panel (a) displays a unimodal, symmetric posterior density for a Cauchy location model. Panel (b) shows a multimodal, asymmetric posterior density for a logistic regression model, with one-dimensional slices highlighted in orange and blue, that are further visualized in the rightmost panels of the figure. These example posteriors are used to illustrate the variety of model types considered in the paper.", "section": "4 Lower bound applications"}, {"figure_path": "SAZeQV2PtT/figures/figures_7_1.jpg", "caption": "Figure 2: Importance-weighted coreset quality, showing the minimum of the forward and reverse KL divergences on the vertical axis as a function of dataset size N for 3 coreset sizes: log N (black), √N (blue), and 1/2N (red). Dashed lines indicate predictions from the theory in Corollaries 4.1 and 4.2, solid lines indicate the mean over 10 trials, and error bars indicate standard error. The top row shows the quality of basic importance-weighted coresets (note that both horizontal and vertical axes are in log scale), while the bottom row shows the quality with optimal post-hoc scaling (note that only the horizontal axis is in log scale). The left column corresponds to the Cauchy location model, while the right column corresponds to the logistic regression model. Sampling probabilities pn for both models are set proportional to X2, thresholded to lie between 0.1/N and 10/N.", "description": "This figure empirically validates Corollaries 4.1 and 4.2 which discuss the minimum coreset size for importance-weighted coresets.  It shows the minimum KL divergence (a measure of the difference between the true and approximate posterior distributions) plotted against the dataset size (N) for three different coreset sizes (log N, √N, and N/2).  The figure presents results for both basic importance-weighted coresets and those with optimal post-hoc scaling, and for two different Bayesian models (Cauchy location and logistic regression). The dashed lines represent theoretical predictions, while the solid lines show the empirical means from 10 trials. Error bars illustrate the standard errors.", "section": "4 Lower bound applications"}, {"figure_path": "SAZeQV2PtT/figures/figures_9_1.jpg", "caption": "Figure 3: Subsample-optimize coreset quality, showing the maximum of the forward and reverse KL divergences on the vertical axis as a function of dataset size N for coresets of size 5 + 2 log N. Solid lines indicate the mean over 70 trials, and error bars indicate standard error. The left panel is for the Cauchy location model, while the right panel is for the logistic regression model. Sampling probabilities are uniform pn = 1/N, and coreset weights were optimized by nonnegative least squares for log-likelihoods discretized via samples from π [34, Eq. 4].", "description": "This figure shows the performance of subsample-optimize coreset construction methods on two Bayesian models: a Cauchy location model and a logistic regression model.  It displays the maximum KL divergence (a measure of approximation error) between the true posterior and the coreset approximation as a function of the dataset size (N).  The coreset size (M) is fixed at 5 + 2log(N).  The results demonstrate that high-quality posterior approximations can be achieved with relatively small coresets, even when the models violate common assumptions used in previous theoretical work. Results are averages of 70 trials, with error bars representing standard error.", "section": "6 Upper bound application: subsample-optimize coresets"}]