[{"figure_path": "E4ILjwzdEA/figures/figures_1_1.jpg", "caption": "Figure 1: The CP pipeline.", "description": "The CP pipeline consists of three stages: 1) Training a model using training data.  2) Designing a conformity score. 3) Constructing prediction sets.  This figure shows that the authors' framework operates at the third stage, aiming to design prediction sets that are both conditionally valid and length-efficient (i.e., as small as possible while maintaining validity), given a predictive model and a conformity score.  Previous work focused on improving the first two stages, leaving length optimization at the final stage largely unaddressed.", "section": "1 Introduction"}, {"figure_path": "E4ILjwzdEA/figures/figures_2_1.jpg", "caption": "Figure 2: (a) Distribution of the labels conditioned on the covariate x (b) The conditional PDFs. (c) Avg length vs q+. The red dots correspond to three different marginally-valid prediction sets.", "description": "This figure illustrates three key aspects of the toy example used to explain the principles and challenges of length optimization in conformal prediction. (a) Shows the distribution of labels Y conditioned on the covariate X, highlighting the different variances for x < 0 and x ≥ 0. (b) Displays the conditional probability density functions (PDFs) of the conformity score S given X, demonstrating how the distributions differ based on the value of X. Finally, (c) plots the average length of prediction sets against the parameter q+, demonstrating the existence of an optimal length solution that is distinct from those constructed by split-conformal methods.", "section": "1 Introduction"}, {"figure_path": "E4ILjwzdEA/figures/figures_8_1.jpg", "caption": "Figure 3: Left-hand-side plot shows coverage and right-hand-side shows mean prediction set size.", "description": "This figure presents the results of applying CPL and Split Conformal to multiple-choice question answering datasets.  The left plot shows the coverage achieved by each method on each dataset (BigBench, MMLU, OpenBookQA, PIQA, TruthfulQA), with a horizontal dashed line indicating the target coverage of 90%. The right plot displays the mean prediction set sizes for each method and dataset.  The error bars represent the standard deviation across multiple trials.  The figure visually demonstrates that CPL achieves comparable coverage to Split Conformal but with significantly smaller prediction set sizes, indicating superior length efficiency.", "section": "Part I: Marginal Coverage for Multiple Choice Question Answering"}, {"figure_path": "E4ILjwzdEA/figures/figures_9_1.jpg", "caption": "Figure 4: Left-hand-side plot shows coverage and right-hand-side shows mean interval length.", "description": "This figure compares the performance of CPL, Split Conformal, BatchGCP, and an Optimal Oracle baseline on a synthetic regression task with group-conditional coverage requirements. The left panel shows the coverage achieved by each method in 20 different groups, while the right panel shows the average length of the prediction intervals generated by each method.  The results indicate that CPL achieves near-optimal length while maintaining the desired coverage level across all groups, unlike other methods.", "section": "Part II: Group-Conditional Coverage for Synthetic Regression"}, {"figure_path": "E4ILjwzdEA/figures/figures_9_2.jpg", "caption": "Figure 3: Left-hand-side plot shows coverage and right-hand-side shows mean prediction set size.", "description": "This figure compares the performance of CPL, Split Conformal in terms of coverage and prediction set size for multiple choice question answering task.  The left plot displays the coverage achieved by each method across various datasets (BigBench, MMLU, OpenBookQA, PIQA, TruthfulQA), showing that CPL maintains a coverage close to 90%, similar to Split Conformal.  The right plot presents the mean prediction set size for each method, revealing that CPL consistently produces smaller prediction sets than Split Conformal across all datasets, indicating improved length efficiency.", "section": "Part I: Marginal Coverage for Multiple Choice Question Answering"}]