[{"figure_path": "AvBuK8Ezrg/figures/figures_2_1.jpg", "caption": "Figure 1: Planting a novel multivariate SC-FC coupling mechanism to explainable deep model. Orange box: The structural connectivity (SC) denoted by grey links represents the strength of neurological fiber that physically connects two brain regions. SC is relatively static given the neural activities are transient, e.g. cognitive tasks. Green box: The functional connectivity (FC) is commonly considered as the brain network topology [48] since SC is static for different cognitive tasks. The overlapping area of orange and green boxes: the multivariate SC-FC coupling mechanism, where a neural pathway (detour) is constructed by multiple SC links to support one FC link. Grey box: NeuroPath Transformer using a new MHSA module filtered by adjacency matrices emits the representation of multi-hop detours.", "description": "This figure illustrates the core concept of NeuroPath, a novel deep learning model that leverages both structural and functional connectivity data to identify neural pathways supporting brain function.  It highlights the multivariate SC-FC coupling mechanism, demonstrating how multiple structural connections (SC, in orange) can support a single functional connection (FC, in green), forming a \"detour pathway.\" The NeuroPath Transformer uses a multi-head self-attention mechanism to capture these multi-hop detour pathways from paired SC and FC graphs, ultimately leading to more accurate and interpretable results in tasks such as cognitive task recognition and disease diagnosis.", "section": "3 NeuroPath – A Biological-Inspired Transformer for Human Connectomes"}, {"figure_path": "AvBuK8Ezrg/figures/figures_3_1.jpg", "caption": "Figure 1: Planting a novel multivariate SC-FC coupling mechanism to explainable deep model. Orange box: The structural connectivity (SC) denoted by grey links represents the strength of neurological fiber that physically connects two brain regions. SC is relatively static given the neural activities are transient, e.g. cognitive tasks. Green box: The functional connectivity (FC) is commonly considered as the brain network topology [48] since SC is static for different cognitive tasks. The overlapping area of orange and green boxes: the multivariate SC-FC coupling mechanism, where a neural pathway (detour) is constructed by multiple SC links to support one FC link. Grey box: NeuroPath Transformer using a new MHSA module filtered by adjacency matrices emits the representation of multi-hop detours.", "description": "This figure illustrates the core concept of NeuroPath, a novel deep learning model for analyzing human connectomes.  It highlights the relationship between structural connectivity (SC), representing the physical connections in the brain, and functional connectivity (FC), representing the correlated activity between brain regions. The key innovation is the concept of a \"topological detour,\" where a functional connection (FC link) is supported by multiple indirect structural pathways (SC detour). The model uses a multi-head self-attention mechanism within a Transformer architecture to capture these multi-hop detour pathways and learn effective representations from both SC and FC data.", "section": "3 NeuroPath – A Biological-Inspired Transformer for Human Connectomes"}, {"figure_path": "AvBuK8Ezrg/figures/figures_4_1.jpg", "caption": "Figure 3: Framework of twin branch, topological detour filtered multi-head self-attention (TD-MHSA) and functional connectivity filtered multi-head self-attention (FC-MHSA), for node feature transformation in NeuroPath, where training/testing readout indicates different branch is used for training/testing stage. Note that Dh avoids finding all simple paths by our model, it significantly reduces computational costs with sufficient power for the neural pathways representation as discussed in Sec. 3.2.", "description": "This figure shows the architecture of NeuroPath, a deep learning model for analyzing human connectomes. It uses two branches: one for topological detour (TD-MHSA) and one for functional connectivity (FC-MHSA).  Both branches employ multi-head self-attention mechanisms to capture multi-modal features from structural and functional connectivity data. The TD-MHSA branch focuses on identifying neural pathways, while the FC-MHSA branch processes functional connectivity information.  A consistency constraint loss (LTD) ensures that both branches learn consistent representations.  The model efficiently represents neural pathways by avoiding the computation of all simple paths, significantly reducing computational cost.", "section": "3.1 Network Architecture of NeuroPath"}, {"figure_path": "AvBuK8Ezrg/figures/figures_8_1.jpg", "caption": "Figure 4: Ablation study of various lengths of the neural pathway that is visible to NeuroPath. Static BOLD is set as node attributes in this experiment. The blue shade is the range of error bars and the green lines are average F1 scores.", "description": "This figure shows the ablation study on the pathway length of NeuroPath. The x-axis represents the pathway length (from 2 to 8 hops), and the y-axis represents the F1 score.  The four subplots show the results for four different datasets (HCPA, UKB, ADNI, and OASIS), each with a different number of brain regions (333, 333, 116, and 160, respectively).  The green line represents the average F1 score, and the shaded area represents the standard error.  The results indicate that the optimal pathway length varies across datasets and may be related to the number of brain regions.", "section": "4.5 Ablation of Model Architecture"}, {"figure_path": "AvBuK8Ezrg/figures/figures_9_1.jpg", "caption": "Figure 1: Planting a novel multivariate SC-FC coupling mechanism to explainable deep model. Orange box: The structural connectivity (SC) denoted by grey links represents the strength of neurological fiber that physically connects two brain regions. SC is relatively static given the neural activities are transient, e.g. cognitive tasks. Green box: The functional connectivity (FC) is commonly considered as the brain network topology [48] since SC is static for different cognitive tasks. The overlapping area of orange and green boxes: the multivariate SC-FC coupling mechanism, where a neural pathway (detour) is constructed by multiple SC links to support one FC link. Grey box: NeuroPath Transformer using a new MHSA module filtered by adjacency matrices emits the representation of multi-hop detours.", "description": "This figure illustrates the core concept of NeuroPath, a novel deep learning model for analyzing brain connectomes. It highlights the multivariate SC-FC coupling mechanism, which considers how functional connectivity (FC) between brain regions is supported by multiple pathways of structural connectivity (SC). The figure shows how NeuroPath uses a multi-head self-attention mechanism to capture this multi-hop pathway information, leading to improved representation learning and downstream applications.", "section": "3 NeuroPath – A Biological-Inspired Transformer for Human Connectomes"}, {"figure_path": "AvBuK8Ezrg/figures/figures_14_1.jpg", "caption": "Figure 1: Planting a novel multivariate SC-FC coupling mechanism to explainable deep model. Orange box: The structural connectivity (SC) denoted by grey links represents the strength of neurological fiber that physically connects two brain regions. SC is relatively static given the neural activities are transient, e.g. cognitive tasks. Green box: The functional connectivity (FC) is commonly considered as the brain network topology [48] since SC is static for different cognitive tasks. The overlapping area of orange and green boxes: the multivariate SC-FC coupling mechanism, where a neural pathway (detour) is constructed by multiple SC links to support one FC link. Grey box: NeuroPath Transformer using a new MHSA module filtered by adjacency matrices emits the representation of multi-hop detours.", "description": "This figure illustrates the core concept of NeuroPath, highlighting the multivariate SC-FC coupling mechanism. It shows how functional connectivity (FC) links between brain regions are supported by multiple structural connectivity (SC) pathways forming a cyclic loop.  NeuroPath leverages this multi-hop detour pathway information via a novel multi-head self-attention mechanism to learn better feature representations.", "section": "3 NeuroPath – A Biological-Inspired Transformer for Human Connectomes"}, {"figure_path": "AvBuK8Ezrg/figures/figures_15_1.jpg", "caption": "Figure 1: Planting a novel multivariate SC-FC coupling mechanism to explainable deep model. Orange box: The structural connectivity (SC) denoted by grey links represents the strength of neurological fiber that physically connects two brain regions. SC is relatively static given the neural activities are transient, e.g. cognitive tasks. Green box: The functional connectivity (FC) is commonly considered as the brain network topology [48] since SC is static for different cognitive tasks. The overlapping area of orange and green boxes: the multivariate SC-FC coupling mechanism, where a neural pathway (detour) is constructed by multiple SC links to support one FC link. Grey box: NeuroPath Transformer using a new MHSA module filtered by adjacency matrices emits the representation of multi-hop detours.", "description": "This figure illustrates the core concept of NeuroPath, a novel deep learning model for analyzing human connectomes. It highlights the multivariate SC-FC coupling mechanism, where functional connectivity (FC) links are supported by multiple structural connectivity (SC) pathways forming a cyclic loop.  NeuroPath leverages a multi-head self-attention mechanism within a Transformer architecture to capture multi-modal features from paired SC and FC graphs, effectively modeling this complex relationship.", "section": "3 NeuroPath – A Biological-Inspired Transformer for Human Connectomes"}, {"figure_path": "AvBuK8Ezrg/figures/figures_16_1.jpg", "caption": "Figure 1: Planting a novel multivariate SC-FC coupling mechanism to explainable deep model. Orange box: The structural connectivity (SC) denoted by grey links represents the strength of neurological fiber that physically connects two brain regions. SC is relatively static given the neural activities are transient, e.g. cognitive tasks. Green box: The functional connectivity (FC) is commonly considered as the brain network topology [48] since SC is static for different cognitive tasks. The overlapping area of orange and green boxes: the multivariate SC-FC coupling mechanism, where a neural pathway (detour) is constructed by multiple SC links to support one FC link. Grey box: NeuroPath Transformer using a new MHSA module filtered by adjacency matrices emits the representation of multi-hop detours.", "description": "This figure illustrates the core concept of NeuroPath, highlighting the multivariate SC-FC coupling mechanism.  It shows how functional connectivity (FC) links between brain regions are supported by multiple structural connectivity (SC) pathways forming a cyclic loop. NeuroPath uses a multi-head self-attention mechanism to capture this multi-hop detour pathway information for improved feature representation.", "section": "3 NeuroPath – A Biological-Inspired Transformer for Human Connectomes"}]