[{"figure_path": "7U5MwUS3Rw/figures/figures_1_1.jpg", "caption": "Figure 1: Illustration of our idea through different forms of loss curves.", "description": "This figure illustrates the core idea of the proposed method, VFair, which aims to minimize the variance of training losses. Panel (a) shows the probability density of losses for different methods. The ideal case is a Dirac delta distribution, where all losses are concentrated at zero. VFair aims to approximate this ideal distribution. Panel (b) displays the per-example losses sorted in ascending order for different methods. VFair shows a flattened loss curve compared to ERM (Empirical Risk Minimization) and worst-case fairness methods. This indicates that VFair achieves similar losses for each example, thus improving fairness.  The figure visually represents the trade-off between fairness and utility, where VFair aims to balance the two by maintaining a low average loss while minimizing variance.", "section": "1 Introduction"}, {"figure_path": "7U5MwUS3Rw/figures/figures_4_1.jpg", "caption": "Figure 2: Two situations when updating primary and secondary gradient simultaneously.", "description": "This figure illustrates two scenarios during the gradient update process in the VFair algorithm. (a) shows a situation where the gradients of the primary and secondary objectives form an obtuse angle, resulting in a detrimental component in the primary objective's direction. (b) depicts a scenario where the gradients form an acute angle, thus avoiding gradient conflicts. The figure helps explain how the dynamic coefficient λ is adjusted to ensure the update direction always benefits the primary objective (minimizing loss) without hindering fairness.", "section": "3.4 Harmless fairness update"}, {"figure_path": "7U5MwUS3Rw/figures/figures_7_1.jpg", "caption": "Figure 3: Per-example losses for all compared methods sorted in ascending order on train set.", "description": "This figure shows the per-example losses for different fairness methods (ERM, DRO, ARL, VFair, FairRF) on a training dataset, sorted in ascending order.  The x-axis represents the index of the training examples, and the y-axis represents the loss value.  A vertical dashed cyan line separates the correctly classified examples (left) from incorrectly classified examples (right). A pink shaded area highlights the average loss for each method. The figure illustrates how the proposed method (VFair) achieves a more flattened loss curve compared to other methods, suggesting that VFair produces more consistent loss values across the training set. This is in line with the objective of minimizing the variance of the losses and achieving a better representation of the data across all groups.", "section": "4.3 Examine harmless fairness in classification tasks"}, {"figure_path": "7U5MwUS3Rw/figures/figures_8_1.jpg", "caption": "Figure 4: Experimental verification of the harmless update strategy.", "description": "This figure presents experimental results to verify the effectiveness of the proposed harmless update strategy in VFair.  Subfigure (a) shows training curves on the COMPAS dataset for various metrics (Utility, WU, MUD, TUD), demonstrating improvement across these metrics during training with the variance penalty. Subfigure (b) compares the impact of different λ strategies (λ = 1, λ = max(λ₁, 0), λ = λ₂, λ = max(λ₁, λ₂)) on MSE across five regression datasets, highlighting the stability of the full strategy (λ = max(λ₁, λ₂)). Subfigure (c) illustrates the dynamic adjustment of λ₁ and λ₂ during training on the C & C dataset.", "section": "4 Experiments"}, {"figure_path": "7U5MwUS3Rw/figures/figures_17_1.jpg", "caption": "Figure 1: Illustration of our idea through different forms of loss curves.", "description": "The figure illustrates the concept of minimizing loss distribution variance to achieve fairness. Subfigure (a) shows the probability density of losses, with VFair approximating a Dirac delta distribution (ideal fairness). Subfigure (b) shows per-example loss sorted in ascending order, demonstrating VFair's flattened loss curve compared to other methods (Oracle, ERM, Worst-case, Uniform), indicating similar losses across examples and suggesting fairer solutions.", "section": "3 VFair methodology"}, {"figure_path": "7U5MwUS3Rw/figures/figures_17_2.jpg", "caption": "Figure 1: Illustration of our idea through different forms of loss curves.", "description": "This figure illustrates the core idea of the proposed method, VFair, by showing different loss curve distributions.  Panel (a) compares the probability density of losses for different approaches:  Oracle (ideal, zero variance), ERM (standard training), Worst-case (prioritizing worst-off group), Uniform (evenly poor performance across groups), and VFair (the proposed method). VFair aims to minimize the variance of losses while maintaining low average loss, approximating a Dirac delta function. Panel (b) shows the per-example losses sorted in ascending order for each method, further illustrating the loss curve flattening achieved by VFair, showing relatively uniform loss across all examples.", "section": "1 Introduction"}, {"figure_path": "7U5MwUS3Rw/figures/figures_17_3.jpg", "caption": "Figure 1: Illustration of our idea through different forms of loss curves.", "description": "This figure illustrates the concept of minimizing the variance of training losses to achieve fairness. (a) shows the probability density of losses for different methods. VFair aims to approximate a Dirac delta distribution, where all losses are concentrated near zero, indicating fairness. (b) shows per-example losses sorted in ascending order. VFair achieves a flattened loss curve, indicating similar losses for each example, which is a key characteristic of fairness.  Other methods, such as ERM (Empirical Risk Minimization), Worst-case fairness, and a Uniform model, demonstrate more variance in their losses.", "section": "1 Introduction"}]