[{"figure_path": "eNeqGc9AgR/tables/tables_7_1.jpg", "caption": "Table 1: Quantitative comparisons of our FAM and SLIM in terms of parameterization conformality.", "description": "This table presents a quantitative comparison of the proposed Flatten Anything Model (FAM) and the state-of-the-art method SLIM in terms of parameterization conformality.  Conformality measures how well angles are preserved during the mapping from 3D to 2D. Lower values indicate better conformality. The table shows that FAM significantly outperforms SLIM across various models.", "section": "4 Experiments"}, {"figure_path": "eNeqGc9AgR/tables/tables_7_2.jpg", "caption": "Table 2: Quantitative conformality metrics of our parameterization results.", "description": "This table presents the quantitative conformality metrics for various 3D models processed using the proposed FAM method.  Conformality, in this context, measures how well the parameterization preserves angles from the 3D surface to the 2D plane. Lower values indicate better conformality, meaning that angles are better preserved during flattening. The table allows for a comparison of the method's performance across different models with varying geometric and topological complexity.", "section": "4 Experiments"}, {"figure_path": "eNeqGc9AgR/tables/tables_7_3.jpg", "caption": "Table 3: Conformality metrics of our FAM and FBCP-PC for point cloud parameterization.", "description": "This table presents a quantitative comparison of the proposed Flatten Anything Model (FAM) and the state-of-the-art method FBCP-PC for point cloud parameterization.  The comparison is based on the conformality metric for three different point cloud datasets: cloth-pts, julius-pts, and spiral-pts. Lower conformality values indicate better parameterization quality.  FAM shows slightly worse results than FBCP-PC on the three datasets.", "section": "4 Experiments"}, {"figure_path": "eNeqGc9AgR/tables/tables_9_1.jpg", "caption": "Table 4: Quantitative self-intersection metrics of our parameterization results.", "description": "This table presents a quantitative comparison of the self-intersection metrics for the parameterization results obtained using the proposed FAM and the baseline SLIM methods. Self-intersection is a common issue in surface parameterization that can impact the quality of the resulting parameterization. The table reports the percentage of self-intersected triangles in the UV space for both FAM and SLIM on open surface models (from Figure 3) and higher-genus models (from Figure 4). The results show that FAM achieves lower self-intersection rates compared to SLIM, especially for the higher-genus models, demonstrating the effectiveness of the proposed FAM in preventing self-intersections.", "section": "4 Experiments"}, {"figure_path": "eNeqGc9AgR/tables/tables_13_1.jpg", "caption": "Table 1: Quantitative comparisons of our FAM and SLIM in terms of parameterization conformality.", "description": "This table presents a quantitative comparison of the proposed Flatten Anything Model (FAM) and the state-of-the-art method SLIM in terms of parameterization conformality.  Conformality measures how well the method preserves angles during the mapping from 3D surface to 2D parameter space. Lower values indicate better conformality. The table shows that FAM significantly outperforms SLIM across various 3D models, demonstrating its superior performance in preserving angles during parameterization.", "section": "4 Experiments"}]