[{"type": "text", "text": "Prediction-Powered Ranking of Large Language Models ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Ivi Chatzi   \nMax Planck Institute for Software Systems   \nKaiserslautern, Germany   \nichatzi@mpi-sws.org   \nEleni Straitouri   \nMax Planck Institute for   \nSoftware Systems   \nKaiserslautern, Germany   \nestraitouri@mpi-sws.org Suhas Thejaswi   \nMax Planck Institute for Software Systems   \nKaiserslautern, Germany   \nthejaswi@mpi-sws.org ", "page_idx": 0}, {"type": "text", "text": "", "page_idx": 0}, {"type": "text", "text": "", "page_idx": 0}, {"type": "text", "text": "Manuel Gomez Rodriguez Max Planck Institute for Software Systems Kaiserslautern, Germany manuelgr@mpi-sws.org ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Large language models are often ranked according to their level of alignment with human preferences—a model is better than other models if its outputs are more frequently preferred by humans. One of the popular ways to elicit human preferences utilizes pairwise comparisons between the outputs provided by different models to the same inputs. However, since gathering pairwise comparisons by humans is costly and time-consuming, it has become a common practice to gather pairwise comparisons by a strong large language model—a model strongly aligned with human preferences. Surprisingly, practitioners cannot currently measure the uncertainty that any mismatch between human and model preferences may introduce in the constructed rankings. In this work, we develop a statistical framework to bridge this gap. Given a (small) set of pairwise comparisons by humans and a large set of pairwise comparisons by a model, our framework provides a rank-set—a set of possible ranking positions—for each of the models under comparison. Moreover, it guarantees that, with a probability greater than or equal to a user-specified value, the rank-sets cover the true ranking consistent with the distribution of human pairwise preferences asymptotically. Using pairwise comparisons made by humans in the LMSYS Chatbot Arena platform and pairwise comparisons made by three strong large language models, we empirically demonstrate the effectivity of our framework and show that the rank-sets constructed using only pairwise comparisons by the strong large language models are often inconsistent with (the distribution of) human pairwise preferences. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "During the last years, large language models (LLMs) have shown a remarkable ability to generate and understand general-purpose language [1]. As a result, there has been an increasing excitement in their potential to help humans solve a variety of open-ended, complex tasks across many application domains such as coding [2], healthcare [3] and scientific discovery [4], to name a few. However, evaluating and comparing the performance of different LLMs has become very challenging [5]. The main reason is that, in contrast to traditional machine learning models, LLMs can solve a large number of different tasks and, in many of these tasks, there is not a unique, structured solution. As a consequence, there has been a paradigm shift towards evaluating their performance according to their level of alignment with human preferences—a model is better than other models if its outputs are more frequently preferred by humans [6–10]. ", "page_idx": 0}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "One of the most popular paradigms to rank a set of LLMs according to their level of alignment with human preferences utilizes pairwise comparisons [10–17]. Under this paradigm, each pairwise comparison comprises the outputs of two different models picked uniformly at random to an input sampled from a given distribution of inputs. Moreover, the pairwise comparisons are used to rank the models with a variety of methods such as the Elo rating [18–22], the Bradley-Terry model [10, 17, 23] or the win-rate [12, 17, 23]. While it is widely agreed that, given a sufficiently large set of pairwise comparisons, higher (lower) ranking under this paradigm corresponds to better (worse) human alignment, there have also been increasing concerns that this paradigm is too costly and timeconsuming to be practical, especially given the pace at which models are updated and new models are developed. ", "page_idx": 1}, {"type": "text", "text": "To lower the cost and increase the efficiency of ranking from pairwise comparisons, it has become a common practice to ask a strong LLM—a model known to strongly align with human preferences—to perform pairwise comparisons [24–33]. The rationale is that, if a model strongly aligns with human preferences, then, the distributions of pairwise comparisons by the model and by the human should in principle match [24, 27, 34]. Worryingly, there are multiple lines of evidence, including our experimental findings in Figure 3, showing that the rankings constructed using pairwise comparisons made by a strong LLM are sometimes different to those constructed using pairwise comparisons by humans [12, 14–16, 19, 35, 36], questioning the rationale above. In this work, we introduce a statistical framework to measure the uncertainty in the rankings constructed using pairwise comparisons made by a model, which may be introduced by a mismatch between human and model preferences or by the fact that we use a finite number of pairwise comparisons. ", "page_idx": 1}, {"type": "text", "text": "Our contributions. Our framework measures uncertainty using rank-sets—sets of possible ranking positions that each model can take. If the rank-set of a model is large (small), it means that there is high (low) uncertainty in the ranking position of the model. To construct the rank-sets, our framework first leverages a (small) set of pairwise comparisons by humans and a large set of pairwise comparisons by a strong LLM to create a confidence ellipsoid. By using prediction-powered inference [37–39], this confidence ellipsoid is guaranteed to contain the vector of (true) probabilities that each model is preferred over others by humans—the win-rates—with a user-specified coverage probability $1-\\alpha$ . Then, it uses the distance between this ellipsoid and the hyperplanes under which pairs of models have the same probability values of being preferred over others to efficiently construct the rank-sets. Importantly, we can show that, with probability greater than or equal to $1\\mathrm{~-~}\\alpha$ , the constructed rank-sets are guaranteed to cover the ranking consistent with the (true) probability that each model is preferred over others by humans asymptotically. Moreover, our framework does not make any assumptions on the distribution of human preferences nor about the degree of alignment between pairwise preferences of humans and the strong LLM. Experiments on pairwise comparisons made by humans in the LMSYS Chatbot Arena platform [28] and pairwise comparisons made by three strong LLMs, namely GPT 3.5, Claude 3 and GPT 4, empirically demonstrate that the rank-sets constructed using our framework are more likely to cover the true ranking consistent with (the distribution of) human pairwise preferences than the rank-sets constructed using only pairwise comparisons made by the strong LLMs. An open-source implementation of our methodology as well as the data on pairwise preferences of strong LLMs used in our experiments are available at https://github.com/Networks-Learning/prediction-powered-ranking. ", "page_idx": 1}, {"type": "text", "text": "Further related work. Our work builds upon recent work on prediction-powered inference, ranking under uncertainty, and ranking of LLMs. ", "page_idx": 1}, {"type": "text", "text": "Prediction-powered inference [37–39] is a recently introduced statistical framework to obtain valid $p$ -values and confidence intervals about a population-level quantity such as the mean outcome or a regression coefficient using a small labeled dataset and a large unlabeled dataset, whose labels are imputed using a black-box machine learning model. However, our work is the first to use prediction-powered inference (as a subroutine) to construct rank-sets with coverage guarantees. In this context, it is worth acknowledging that a very recent work by Saad-Falcon et al. [40] has used prediction-powered inference to construct (single) rankings, rather than rank-sets. However, their rankings do not enjoy coverage guarantees with respect to the true ranking consistent with (the distribution of) the human preferences. Moreover, an independent, concurrent work by Boyeau et al. [23] has also used prediction-powered inference to construct (single) rankings based on the estimated coefficients of a Bradley-Terry model. However, the estimated coefficients come with large, overlapping confidence intervals, which would have led to uninformative rank-sets, had the authors used them to construct rank-sets. ", "page_idx": 1}, {"type": "text", "text": "", "page_idx": 2}, {"type": "text", "text": "The vast majority of the literature on ranking under uncertainty has focused on confidence intervals for individual ranking positions [41–47]. Only recently, a paucity of work has focused on joint measures of uncertainty for rankings [48–51]. Similarly as in our work, this line of work also seeks to construct rank-sets with coverage guarantees. However, in contrast to our work, it estimates the quality metric (in our work, the probability that an LLM is preferred over others) and the confidence intervals separately for each of the items (in our work, LLMs) using independent samples. As a consequence, it needs to perform multiple comparison correction to create the rank-sets. ", "page_idx": 2}, {"type": "text", "text": "In recent years, there has also been a flurry of work on ranking LLMs using benchmark datasets with manually hand-crafted inputs and ground-truth outputs [52–58]. However, it has become increasingly clear that oftentimes rankings derived from benchmark datasets do not correlate well with rankings derived from human preferences—an improved ranking position in the former does not lead to an improved ranking position in the latter [12–14, 17, 26]. Within the literature on ranking LLMs from pairwise comparisons, most studies use the Elo rating system [18–22], originally introduced for chess tournaments [59]. However, Elo-based rankings are sensitive to the order of pairwise comparisons, as newer comparisons have more weight than older ones, which leads to unstable rankings [15]. To address this limitation, several studies have instead used the Bradley-Terry model [10, 17, 23], which weighs pairwise comparisons equally regardless of their order. Nevertheless, both the Elo rating system and the Bradley-Terry model have faced criticism, as pairwise comparisons often fail to satisfy the fundamental axiom of transitivity, upon which both approaches rely [15, 60], Recently, several studies have used the win-rate [12, 17, 23], which weighs comparisons equally regardless of their order and does not require the transitivity assumption, but requires humans to make pairwise comparisons between every pair of models. In our work, we build upon the win-rate and lift the above requirement by using pairwise comparisons made by a strong LLM. ", "page_idx": 2}, {"type": "text", "text": "2 LLM Ranking under Uncertainty ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Let $\\mathcal{M}$ be a set of $k$ large language models (LLMs) and $P(Q)$ be a distribution of inputs on a discrete set of inputs $\\mathcal{Q}$ . Moreover, assume that, for each input $q\\sim P(Q)$ ,1 each model $m\\in\\mathcal{M}$ may provide an output $r\\sim P_{m}(R\\,|\\,Q=q)$ from a discrete set of outputs $\\mathcal{R}$ . Further, given two outputs $r,r^{\\prime}\\in\\mathcal{R}$ from two different models, the (binary) variables $w,\\bar{w}^{\\prime}\\,\\sim\\,P(W,W^{\\prime}\\,\\bar{|}\\,Q\\,=\\,q,R\\,\\bar{=}\\,r,R^{\\prime}\\,=\\,r^{\\prime})$ indicate whether a human prefers $r$ over $r^{\\prime}$ $w=1$ , $w^{\\prime}=0$ ) or viceversa $(w=0,\\,w^{\\prime}=1)$ . In the case of a tie, then $w=w^{\\prime}=0$ . In what follows, we use $m(r)$ and $m(r^{\\prime})$ to denote the models that provide outputs $r$ and $r^{\\prime}$ respectively, and without loss of generality, we assume that the output $r$ is shown first. Then, our goal is to rank all models according to the (empirical) probability $\\theta_{m}$ that their outputs are preferred over the outputs of any other model picked uniformly at random. ", "page_idx": 2}, {"type": "text", "text": "To this end, we start by writing the probability $\\theta_{m}$ as an expectation over the distribution of inputs, outputs and pairwise preferences: ", "page_idx": 2}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\theta_{m}=\\displaystyle\\frac{1}{k-1}\\sum_{\\tilde{m}\\in\\mathcal{M}\\backslash\\{m\\}}\\mathbb{E}_{Q}\\left[\\frac{1}{2}\\mathbb{E}_{R\\sim P_{m},R^{\\prime}\\sim P_{\\tilde{m}}}\\left[\\mathbb{E}_{W}[W\\,|\\,Q,R,R^{\\prime}]\\right]+\\right.}\\\\ {\\displaystyle\\left.\\frac{1}{2}\\mathbb{E}_{R\\sim P_{\\tilde{m}},R^{\\prime}\\sim P_{m}}\\left[\\mathbb{E}_{W^{\\prime}}[W^{\\prime}\\,|\\,Q,R,R^{\\prime}]\\right]\\right],}\\end{array}\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "where note that the order of the pairs of outputs is picked at random. Next, following previous work [48, 50], we formally characterize the ranking position of each model $m\\in\\mathcal{M}$ in the ranking induced by the probabilities $\\theta_{m}$ using a rank-set $[\\bar{l}(\\bar{m}),u(m)]$ , where ", "page_idx": 2}, {"type": "equation", "text": "$$\nl(m)=1+\\sum_{\\Tilde{m}\\in\\mathcal{M}\\backslash\\{m\\}}\\mathbf{1}\\{\\theta_{m}<\\theta_{\\Tilde{m}}\\}\\quad\\mathrm{and}\\quad u(m)=k-\\sum_{\\Tilde{m}\\in\\mathcal{M}\\backslash\\{m\\}}\\mathbf{1}\\{\\theta_{m}>\\theta_{\\Tilde{m}}\\},\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "are the lower and upper ranking position respectively and smaller ranking position indicates better alignment with human preferences. Here, note that it often holds that $\\theta_{m}\\neq\\theta_{\\tilde{m}}$ for all $\\tilde{m}\\in\\mathcal{M}\\backslash\\{m\\}$ and then the rank-set reduces to a singleton, i.e., $l(m)=u(m)$ . ", "page_idx": 2}, {"type": "text", "text": "In general, we cannot directly construct the rank-sets as defined above because the probabilities $\\theta_{m}$ are unknown. Consequently, the typical strategy reduces to first gathering pairwise comparisons by humans to compute unbiased estimates of the above probabilities using sample averages and then construct estimates $[\\hat{l}(m),\\hat{u}(m)]$ of the rank-sets using Eq. 2 with $\\widehat{\\theta}_{m}$ rather than $\\theta_{m}$ . Under this strategy, if the amount of pairwise comparisons we gather is sufficiently large, the estimates of the rank-sets will closely match the true rank-sets. However, since gathering pairwise comparisons from humans is costly and time-consuming, it has become a very common practice to gather pairwise comparisons $\\hat{w},\\hat{w}^{\\prime}$ by a strong LLM, rather than pairwise comparisons $w,w^{\\prime}$ by humans [12–14, 28, 29, 31, 61– 64], and then utilize them to compute unbiased estimates of the probabilities $\\breve{\\theta}_{m}$ that the outputs provided by each model is preferred over others by the strong LLM, which can be written in terms of expectations as follows: ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\check{\\theta}_{m}=\\displaystyle\\frac{1}{k-1}\\sum_{\\tilde{m}\\in\\mathcal{M}\\backslash\\{m\\}}\\mathbb{E}_{Q}\\left[\\frac{1}{2}\\mathbb{E}_{R\\sim P_{m},R^{\\prime}\\sim P_{\\tilde{m}}}\\left[\\mathbb{E}_{\\hat{W}}[\\hat{W}\\,|\\,Q,R,R^{\\prime}]\\right]+\\right.}\\\\ {\\left.\\frac{1}{2}\\mathbb{E}_{R\\sim P_{\\tilde{m}},R^{\\prime}\\sim P_{m}}\\left[\\mathbb{E}_{\\hat{W}^{\\prime}}[\\hat{W}^{\\prime}\\,|\\,Q,R,R^{\\prime}]\\right]\\right].}\\end{array}\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "In general, one can only draw valid conclusions about $\\pmb{\\theta}$ using (an estimate of) $\\breve{\\pmb\\theta}$ if the distribution of the pairwise comparisons by the strong LLM $P(\\hat{W},\\hat{W}^{\\prime}\\,|\\,Q=q,R=r,R^{\\prime}=r^{\\prime})$ closely matches the distribution of pairwise comparisons by the humans $P(W,W^{\\prime}\\,|\\,Q\\,=\\,q,R\\,=\\,r,R^{\\prime}\\,=\\,r^{\\prime})$ for any $q\\,\\in\\,\\mathcal{Q}$ and $r,{\\bar{r^{\\prime}}}\\in\\mathcal{R}$ . However, there are multiple lines of evidence showing that there is a mismatch between the distributions, questioning the validity of the conclusions drawn by a myriad of papers. In what follows, we introduce a statistical framework that, by complementing a (large) set of $N+n$ pairwise comparisons $\\hat{w},\\hat{w}^{\\prime}$ by a strong LLM with a small set of $n$ pairwise comparisons $w,w^{\\prime}$ by humans, is able to construct estimates $[\\hat{l}(m),\\hat{u}(m)]$ of the rank-sets with provable coverage guarantees. More formally, given a user-specified value $\\alpha\\in(0,1)$ , the estimates of the rank-sets satisfy that ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\operatorname*{lim}_{n}\\mathbb{P}\\left(\\bigcap_{m\\in\\mathcal{M}}\\left[l(m),u(m)\\right]\\subseteq\\left[\\hat{l}(m),\\hat{u}(m)\\right]\\right)\\geq1-\\alpha.\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "To this end, we will first use prediction-powered inference [37, 38] to construct a confidence ellipsoid that, with probability $1\\mathrm{~-~}\\alpha$ , is guaranteed to contain the (column) vector of (true) probabilities $\\pmb{\\theta}=(\\theta_{m})_{m\\in\\mathcal{M}}$ . Then, we will use the distance between this ellipsoid and the hyperplanes under which each pair of models $m,\\tilde{m}\\in\\mathcal{M}$ have the same probability values of being preferred over others, to efficiently construct the estimates $[\\hat{l}(m),\\hat{u}(m)]$ of the rank-sets. ", "page_idx": 3}, {"type": "text", "text": "3 Constructing Confidence Regions with Prediction-Powered Inference ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Let the set $\\mathcal{D}_{N}=\\{(q_{i},r_{i},r_{i}^{\\prime},m(r_{i}),m(r_{i}^{\\prime}),\\hat{w}_{i},\\hat{w}_{i}^{\\prime})\\}_{i=1}^{N}$ comprise pairwise comparisons by a strong LLM to $N$ inputs and the set $\\mathcal{D}_{n}=\\{(q_{i},r_{i},r_{i}^{\\prime},m(r_{i}),m(r_{i}^{\\prime}),w_{i},w_{i}^{\\prime},\\hat{w}_{i},\\hat{w}_{i}^{\\prime})\\}_{i=1}^{n}$ comprise pairwise comparisons by the same strong LLM and by humans to $n$ inputs, with $n\\ll N$ . In what follows, for each pairwise comparison, we will refer to the models $m(r)$ and $m(r^{\\prime})$ that provided the first and second output using one-hot (column) vectors $\\mathbf{\\nabla}m$ and $m^{\\prime}$ , respectively. Moreover, to summarize the pairwise comparisons2 in $\\mathcal{D}_{N}$ and $\\mathcal{D}_{n}$ , we will stack the one-hot vectors $\\mathbf{\\nabla}m$ and $m^{\\prime}$ into four matrices, $M_{N}$ and $M_{N}^{\\prime}$ for $\\mathcal{D}_{N}$ and $M_{n}$ and $M_{n}^{\\prime}$ for $\\mathcal{D}_{n}$ , where each column corresponds to a one-hot vector, and the indicators $w$ and $\\hat{w}$ into six (column) vectors, $\\hat{\\pmb w}_{N}$ and $\\hat{w}_{N}^{\\prime}$ for $\\mathcal{D}_{N}$ and $\\hat{\\pmb w}_{n}$ , $\\hat{\\pmb w}_{n}^{\\prime}$ , ${\\pmb w}_{n}$ and $\\pmb{w}_{n}^{\\prime}$ for $\\mathcal{D}_{n}$ . ", "page_idx": 3}, {"type": "text", "text": "Algorithm 1: It estimates $\\hat{\\pmb\\theta}$ and $\\widehat{\\boldsymbol{\\Sigma}}$ using prediction-powered inference. ", "page_idx": 4}, {"type": "text", "text": "Input: k, $\\mathcal{D}_{N}$ , $\\mathcal{D}_{n}$ Output: θˆ,Σ   \n$\\mathbf{1}\\ \\hat{w}_{N},\\hat{w}_{N}^{\\prime},M_{N},M_{N}^{\\prime}\\gets\\mathrm{sUMMARIZE}(\\mathcal{D}_{N},k)$   \n2 $\\boldsymbol{w}_{n},\\boldsymbol{w}_{n}^{\\prime},\\hat{\\boldsymbol{w}}_{n},\\hat{\\boldsymbol{w}}_{n}^{\\prime},M_{n},M_{n}^{\\prime}\\gets\\mathrm{SUMMARIZE}\\big(\\mathcal{D}_{n},\\boldsymbol{k}\\big)$   \n3 $\\lambda\\gets\\mathrm{LAMBDA}(k,\\hat{w}_{N},\\hat{w}_{N}^{\\prime},M_{N},M_{N}^{\\prime},{w}_{n},{w}_{n}^{\\prime},\\hat{w}_{n},\\hat{w}_{n}^{\\prime},M_{n},M_{n}^{\\prime})$ // Algorithm 4   \n4 $\\begin{array}{r}{\\pmb{a}\\gets\\left(\\mathbf{1}_{k}\\left(\\left(M_{N}+M_{N}^{\\prime}\\right)\\mathbf{1}_{N}\\right)^{\\top}\\odot\\mathbb{I}_{k}\\right)^{-1}\\left(M_{N}\\cdot\\lambda\\hat{\\pmb{w}}_{N}+M_{N}^{\\prime}\\cdot\\lambda\\hat{\\pmb{w}}_{N}^{\\prime}\\right)}\\end{array}$   \n5 $\\begin{array}{r l}&{b\\gets\\left(\\mathbf{1}_{k}\\left(\\left(M_{n}+M_{n}^{\\prime}\\right)\\mathbf{1}_{n}\\right)^{\\top}\\odot\\mathbb{I}_{k}\\right)^{-1}\\left(M_{n}(\\lambda\\hat{w}_{n}-\\mathbf{w}_{n})+M_{n}^{\\prime}\\left(\\lambda\\hat{w}_{n}^{\\prime}-\\mathbf{w}_{n}^{\\prime}\\right)\\right)}\\\\ &{\\hat{\\theta}\\gets a-b\\quad\\qquad\\qquad\\qquad\\quad//\\mathrm{~prediction-powere}}\\end{array}$   \n6 // prediction-powered estimate (Eq. 5)   \n7 $\\begin{array}{r l}&{A\\gets\\left(\\left(\\mathbf{1}_{k}(\\lambda\\hat{w}_{N}-M_{N}^{\\top}{a})^{\\top}\\right)\\odot M_{N}+\\left(\\mathbf{1}_{k}(\\lambda\\hat{w}_{N}^{\\prime}-M_{N}^{\\prime\\top}{\\mathbf{a}})^{\\top}\\right)\\odot M_{N}^{\\prime}\\right)}\\\\ &{B\\gets\\left(\\mathbf{1}_{k}(\\lambda\\hat{w}_{-}-w_{n}-\\underline{{M_{n}^{\\top}}}b)^{\\top}\\right)\\odot M_{n}+\\left(\\mathbf{1}_{k}(\\lambda\\hat{w}_{n}^{\\prime}-w_{n}^{\\prime}-M_{n}^{\\prime\\top}b)^{\\top}\\right)\\odot M_{n}^{\\prime}}\\\\ &{\\hat{\\qquad}\\qquad\\qquad\\qquad\\qquad\\qquad\\qquad\\qquad\\times}\\end{array}$   \n8   \n9 $\\begin{array}{r}{\\widehat{\\pmb{\\Sigma}}\\leftarrow\\frac{1}{N^{2}}\\pmb{A}\\pmb{A}^{\\top}+\\frac{1}{n^{2}}\\pmb{B}\\pmb{B}^{\\top}}\\end{array}$ // estimate of covariance (Eq. 7) ˆ ", "page_idx": 4}, {"type": "text", "text": "Then, building upon the recent framework of prediction-powered inference [37], we compute an unbiased estimate $\\hat{\\pmb\\theta}$ of the vector of (true) probabilities $\\pmb{\\theta}$ : ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\hat{\\theta}=\\underbrace{\\bigg(\\mathbf{1}_{k}\\left(\\left(M_{N}+M_{N}^{\\prime}\\right)\\mathbf{1}_{N}\\right)^{\\top}\\odot\\mathbb{I}_{k}\\bigg)^{-1}\\left(M_{N}\\cdot\\lambda\\hat{w}_{N}+M_{N}^{\\prime}\\cdot\\lambda\\hat{w}_{N}^{\\prime}\\right)}_{a}}\\\\ &{\\qquad\\qquad-\\underbrace{\\bigg(\\mathbf{1}_{k}\\left(\\left(M_{n}+M_{n}^{\\prime}\\right)\\mathbf{1}_{n}\\right)^{\\top}\\odot\\mathbb{I}_{k}\\bigg)^{-1}\\left(M_{n}\\left(\\lambda\\hat{w}_{n}-w_{n}\\right)+M_{n}^{\\prime}\\left(\\lambda\\hat{w}_{n}^{\\prime}-w_{n}^{\\prime}\\right)\\right)}_{b},}\\end{array}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $\\mathbf{1}_{d}$ denotes a $d$ -dimensional column vector where each dimension has value 1 and $\\mathbb{I}_{k}$ denotes a $k$ -dimensional identity matrix. Here, note that the first term $\\textbf{\\em a}$ utilizes the pairwise comparisons by the strong LLM from $\\mathcal{D}_{N}$ to compute an unbiased estimate of the vector of probabilities θ˘ defined in Eq. 3 using sample averages, and the second term $^{b}$ utilizes the pairwise comparisons by the strong LLM and by humans from $\\mathcal{D}_{n}$ to compute an unbiased estimate of the difference of probabilities $\\theta-\\breve{\\theta}$ defined in Eqs. 1 and 3, also using sample averages. The parameter $\\lambda\\in[0,1]$ weighs the comparisons $\\hat{w},\\hat{w}^{\\prime}$ differently than the comparisons $w,w^{\\prime}$ . Details on why this can be useful and on the selection of $\\lambda$ are in Appendix B.2. ", "page_idx": 4}, {"type": "text", "text": "Further, as shown in Angelopoulos et al. [38], the difference of probabilities $\\hat{\\pmb{\\theta}}-\\pmb{\\theta}$ converges in distribution to a $k$ -dimensional normal $\\mathcal{N}_{k}(0,\\Sigma)$ , where $\\pmb{\\Sigma}=\\mathbb{E}[(\\hat{\\pmb{\\theta}}-\\pmb{\\theta})(\\hat{\\pmb{\\theta}}-\\pmb{\\theta})^{\\top}]$ , and thus the confidence region ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\mathcal{C}_{\\alpha}=\\left\\{x\\in\\mathbb{R}^{k}\\,|\\,\\left({\\pmb x}-{\\hat{\\pmb\\theta}}\\right)^{\\top}\\left(\\frac{\\widehat{\\Sigma}^{-1}}{\\chi_{k,1-\\alpha}^{2}}\\right)\\left({\\pmb x}-{\\hat{\\pmb\\theta}}\\right)\\leq1\\right\\},\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $\\widehat{\\boldsymbol{\\Sigma}}$ is an empirical estimate of the covariance matrix $\\Sigma$ using pairwise comparisons from $\\mathcal{D}_{N}$ and $\\mathcal{D}_{n}$ , i.e., ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\widehat{\\pmb{\\Sigma}}=\\frac{1}{N^{2}}{\\pmb{A}}{\\pmb{A}}^{\\top}+\\frac{1}{n^{2}}{\\pmb{B}}{\\pmb{B}}^{\\top},\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "with ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{A=\\left(\\left(\\mathbf{1}_{k}(\\lambda\\hat{w}_{N}-M_{N}^{\\top}\\pmb{a})^{\\top}\\right)\\odot M_{N}+\\left(\\mathbf{1}_{k}(\\lambda\\hat{w}_{N}^{\\prime}-M_{N}^{\\prime\\top}\\pmb{a})^{\\top}\\right)\\odot M_{N}^{\\prime}\\right),}\\\\ &{B=\\left(\\mathbf{1}_{k}(\\lambda\\hat{w}_{n}-\\pmb{w}_{n}-M_{n}^{\\top}\\pmb{b})^{\\top}\\right)\\odot M_{n}+\\left(\\mathbf{1}_{k}(\\lambda\\hat{w}_{n}^{\\prime}-\\pmb{w}_{n}^{\\prime}-M_{n}^{\\prime\\top}\\pmb{b})^{\\top}\\right)\\odot M_{n}^{\\prime},}\\end{array}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "and $\\chi_{\\boldsymbol{k},1-\\alpha}^{2}$ is the $1-\\alpha$ quantile of the $\\chi^{2}$ distribution with $k$ degrees of freedom, satisfies that ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\operatorname*{lim}_{n}\\mathbb{P}(\\pmb{\\theta}\\in\\mathcal{C}_{\\alpha})=1-\\alpha.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Algorithm 1 summarizes the overall procedure to compute $\\hat{\\pmb\\theta}$ and $\\widehat{\\boldsymbol{\\Sigma}}$ , which runs in $O(k^{2}(N+n))$ time. ", "page_idx": 4}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/11c5ddf29654fa56e16cc923b58c979a34d9455e2fe4e5705a322c2179ec412a.jpg", "img_caption": [], "img_footnote": [], "page_idx": 5}, {"type": "text", "text": "4 Constructing Rank-Sets with Coverage Guarantees ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "For each pair of models $m,\\tilde{m}\\in\\mathcal{M}$ such that $m\\neq\\tilde{m}$ , we first define a hyperplane $H_{m,\\tilde{m}}\\subseteq\\mathbb{R}^{k}$ as follows: ", "page_idx": 5}, {"type": "equation", "text": "$$\nH_{m,\\tilde{m}}=\\{\\pmb{x}\\in\\mathbb{R}^{k}\\,|\\,x_{m}=x_{\\tilde{m}}\\}.\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "Then, for each of these hyperplanes $H_{m,\\tilde{m}}$ , we calculate the distance $d(\\mathcal{C}_{\\alpha},H_{m,\\tilde{m}})$ between $H_{m,\\tilde{m}}$ and the confidence region $\\mathcal{C}_{\\alpha}$ defined by Eq. 6, i.e., ", "page_idx": 5}, {"type": "equation", "text": "$$\nd(\\mathcal{C}_{\\alpha},H_{m,\\tilde{m}})=\\frac{|\\hat{\\theta}_{m}-\\hat{\\theta}_{\\tilde{m}}|-\\sqrt{(\\widehat{\\Sigma}_{m,m}+\\widehat{\\Sigma}_{\\tilde{m},\\tilde{m}}-2\\widehat{\\Sigma}_{m,\\tilde{m}})\\chi_{k,1-\\alpha}^{2}}}{\\sqrt{2}},\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $\\widehat{\\boldsymbol{\\Sigma}}$ is the empirical covariance matrix defined by Eq. 7. ", "page_idx": 5}, {"type": "text", "text": "Now, for each pair of models $m,m^{\\prime}\\ \\in\\ \\mathcal{M}$ , we can readily conclude that, if the distance $d(\\mathcal{C}_{\\alpha},H_{m,\\tilde{m}})>\\bar{0}$ , then, the confidence region $\\mathcal{C}_{\\alpha}$ either lies in the half-space of $\\mathbb{R}^{k}$ where $x_{m}>x_{\\tilde{m}}$ if $\\hat{\\theta}_{m}>\\hat{\\theta}_{\\tilde{m}}$ or it lies in the half space of $\\mathbb{R}^{k}$ where $x_{m}\\,<\\,x_{\\tilde{m}}$ if $\\hat{\\theta}_{m}<\\hat{\\theta}_{\\tilde{m}}$ . Building upon this observation, for each model $m\\,\\in\\,{\\mathcal{M}}$ , we construct the following estimates $[\\hat{l}(m),\\hat{u}(m)]$ of the rank-sets $[l(m),u(m)]$ : ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\hat{l}(m)=1+\\displaystyle\\sum_{\\tilde{m}\\in\\mathcal{M}\\backslash\\{m\\}}\\mathbf{1}\\{d(\\mathcal{C}_{\\alpha},H_{m,\\tilde{m}})>0\\}\\cdot\\mathbf{1}\\{\\hat{\\theta}_{m}<\\hat{\\theta}_{\\tilde{m}}\\}}\\\\ &{\\hat{u}(m)=k-\\displaystyle\\sum_{\\tilde{m}\\in\\mathcal{M}\\backslash\\{m\\}}\\mathbf{1}\\{d(\\mathcal{C}_{\\alpha},H_{m,\\tilde{m}})>0\\}\\cdot\\mathbf{1}\\{\\hat{\\theta}_{m}>\\hat{\\theta}_{\\tilde{m}}\\}.}\\end{array}\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "Importantly, using a similar proof technique as in Lemma 1 in Neuhof and Benjamini [48], we can show that the above rank-sets estimates enjoy provable coverage guarantees with respect to the rank-sets $[l(m),u(m)]$ induced by the probabilities $\\pmb{\\theta}$ that the outputs of each model is preferred over any other model by humans (proven in Appendix A): ", "page_idx": 5}, {"type": "text", "text": "Theorem 4.1 The estimates $[\\hat{l}(m),\\hat{u}(m)]$ of the rank-sets defined by Eq. 11 satisfy that ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\operatorname*{lim}_{n}\\mathbb{P}\\left(\\bigcap_{m\\in\\mathcal{M}}\\left[l(m),u(m)\\right]\\subseteq\\left[\\hat{l}(m),\\hat{u}(m)\\right]\\right)\\geq1-\\alpha.\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "Algorithm 2 summarizes the overall procedure to construct the rank-sets $[\\hat{l}(m),\\hat{u}(m)]$ for all $m\\in\\mathcal{M}$ , which runs in $O(k^{2}(N+n))$ ). ", "page_idx": 5}, {"type": "text", "text": "5 Experiments ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "We apply our framework to construct rank-sets for 12 popular LLMs using pairwise comparisons made by humans in the LMSYS Chatbot Arena platform3 and pairwise comparisons made by three strong LLMs. We show that the rank-sets constructed using our framework are significantly more likely to cover the true ranking consistent with (the distribution of) human pairwise preferences than the rank-sets constructed using only pairwise comparisons made by the strong LLMs. ", "page_idx": 6}, {"type": "text", "text": "Experimental setup. Our starting point is the Chatbot Arena dataset [12], which comprises 33,481 pairwise comparisons made by 13,383 humans about the responses given by 20 different LLMs to 26,968 unique queries. In what follows, we refer to each pair of responses to a query by two different LLMs and the query itself as an instance. As an initial pre-processing, we filter out any instance whose corresponding query is flagged as toxic or multiturn. Then, we gather pairwise comparisons made by three strong LLMs, namely GPT-3.5-turbo-0125 (GPT3.5), GPT-4-0125-preview (GPT4) and Claude-3-Opus-20240229 (CL3), about all the (pre-processed) instances from the Chatbot Arena dataset. To this end, we use (almost) the same prompt as in Zheng et al. [12], which instructs each strong LLM to output option ‘A’ (‘B’) if it prefers the response of first (second) LLM, or option ‘C’ if it declares a tie. Further, we filter out any instances for which at least one strong LLM provides a verbose output instead of ‘A’, ‘B’, or $\\surd C$ , and focus on a set of LLMs with at least 96 pairwise comparisons between every pair of LLMs in the set. After these pre-processing steps, we have 14,947 instances comprising 13,697 unique queries and 12 different LLMs and, for each instance, we have one pairwise comparison made by a human and three pairwise comparisons by the three strong LLMs. Refer to Appendix C for more information regarding the 12 LLMs, the number of pairwise comparisons between every pair of LLMs, and the prompt used to gather pairwise comparisons made by the three strong LLMs. ", "page_idx": 6}, {"type": "text", "text": "To draw reliable conclusions, in each experiment, we construct rank-sets 1,000 times and, each time, we use a random set of $N+n=6{,}336$ instances with an equal number of instances per pair of models, out of the 14,947 instances. The values of $N$ and $n$ vary across experiments and they define two random subsets, also with an equal number of instances per pair of models. ", "page_idx": 6}, {"type": "text", "text": "Methods. In our experiments, we construct rank-sets using the following methods: ", "page_idx": 6}, {"type": "text", "text": "a) BASELINE: it constructs (unbiased) rank-sets using the pairwise comparisons made by humans corresponding to the random set of $N+n$ instances via Algorithms 2 and 3, shown in Appendix B.1. The constructed rank-sets are presumably likely to cover the true rank-sets.   \nb) LLM GPT4, LLM GPT3.5 and LLM CL3: they construct (possibly biased) rank-sets using the pairwise comparisons made by one of the three strong LLMs corresponding to the random set of $N+n$ instances via Algorithms 2 and 3.   \nc) PPR GPT4, PPR GPT3.5 and PPR CL3: they construct (unbiased) rank-sets using pairwise comparisons made by one of the three strong LLMs corresponding to the random set of $N+n$ instances and pairwise comparisons made by humans corresponding to the random subset of $n$ instances via Algorithms 1 and 2.   \nd) HUMAN ONLY: it constructs (unbiased) rank-sets using the pairwise comparisons made by humans corresponding to the random subset of $n$ instances via Algorithms 2 and 3. ", "page_idx": 6}, {"type": "text", "text": "In the above, note that a), b) and d) use linear regression to construct a confidence region $\\mathcal{C}_{\\alpha}$ using only pairwise comparisons by either humans or a strong LLM via Algorithm 3, which runs in $O(\\bar{k}^{2}\\bar{(}N+n))$ in a)-b) and in $O(k^{2}n)$ in $\\mathrm{d}$ ), and then use this confidence region to construct the rank-sets via Algorithm 2. ", "page_idx": 6}, {"type": "text", "text": "Quality metrics. Since the true probabilities $\\pmb{\\theta}$ are unknown, we cannot compute the true rank-sets of the 12 LLMs under comparison, which presumably may be singletons. As a result, we cannot estimate the (empirical) coverage probability—the probability that the rank-sets constructed using the above methods cover the true rank-sets, which Theorem 4.1 refers to. To overcome this, we assess the quality of the rank-sets using two alternative metrics: rank-set size and baseline intersection probability. Here, smaller (larger) rank-set sizes and larger (smaller) intersection probabilities are better (worse). The baseline intersection probability is just the (empirical) probability that the rank-sets $[\\hat{l}(m),\\hat{u}(m)]$ ", "page_idx": 6}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/2438577b5fc2feefd1f25669bf923efa6ff40ac71448d16b4326f6ff140ad912.jpg", "img_caption": [], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "Figure 1: Average rank-set size against baseline intersection probability for rank-sets constructed using only pairwise comparisons by a strong LLM (LLM GPT4, LLM GPT3.5 and LLM CL3), only pairwise comparisons by humans (HUMAN ONLY), and pairwise comparisons by both a strong LLM and humans (PPR GPT4, PPR GPT3.5 and PPR CL3) for different values of $\\alpha$ and $n=990$ . Smaller (larger) average rank-set sizes and larger (smaller) intersection probabilities are better (worse). In all panels, $95\\%$ confidence bars for the rank-set size are not shown, as they are always below 0.02. ", "page_idx": 7}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/d953806a482ebc1326d3a73ada99fabda142272af71ffb1664a86c9cb11d3e28.jpg", "img_caption": ["Figure 2: Average rank-set size against baseline intersection probability for rank-sets constructed using pairwise comparisons by both a strong LLM and humans for different values of $n$ and $\\alpha$ . Smaller (larger) average rank-set sizes and larger (smaller) intersection probabilities are better (worse). In all panels, $95\\%$ confidence bars for the rank-set size are not shown, as they are always below 0.04. "], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "constructed using one of the above methods intersect with the rank-sets $[\\tilde{l}(m),\\tilde{u}(m)]$ constructed using the BASELINE method, i.e., $\\begin{array}{r}{\\mathbb{P}\\left(\\bigcap_{m\\in\\mathcal{M}}{\\mathbf1}\\left\\{[\\tilde{l}(m),\\tilde{u}(m)]\\cap[\\hat{l}(m),\\hat{u}(m)]\\right\\}\\right)}\\end{array}$ . Intuitively, we expect that the larger the baseline intersection probability, the larger the coverage probability since the BASELINE method uses a large(r) number of pairwise comparisons by humans to construct (unbiased) rank-sets and thus it is expected to approximate well the true rank-sets. Further, note that the baseline intersection probability tells us how frequently there exists at least one single ranking covered by both one of the above methods and the BASELINE method. In Appendix D.2, we experiment with an alternative metric, namely baseline coverage probability, which is the (empirical) probability that the rank-sets constructed using one of the above methods covers the rank-sets constructed using the BASELINE method. In Appendix E, we additionally evaluate our framework in a synthetic setting where the true rank-sets are known, allowing us to compute the coverage probability and rank-biased overlap (RBO) [65]. ", "page_idx": 7}, {"type": "text", "text": "Quality of the rank-sets. Figure 1 shows the average rank-set size against the baseline intersection probability for rank-sets constructed using all methods4 except BASELINE for different $\\alpha$ values5 and $n=990$ . The results show several interesting insights. First, we find that rank-sets constructed using only pairwise comparisons by a strong LLM (LLM GPT4, LLM GPT3.5 and LLM CL3) achieve much lower baseline intersection probability, even orders of magnitude lower, than those constructed using only pairwise comparisons by humans (HUMAN ONLY) or using both pairwise comparisons by a strong LLM and humans (PPR GPT4, PPR GPT3.5 and PPR CL3). This suggests that the distributions of pairwise comparisons by strong LLMs and humans are actually different, questioning the rationale used by an extensive line of work that proposed using only pairwise comparisons by strong LLMs to rank LLMs [12, 25–29, 31]. Second, we find that rank-sets constructed using both pairwise comparisons by two of the strong LLMs and humans (PPR GPT4 and PPR CL3) achieve a better trade-off between average rank-set size and baseline intersection probability than those constructed using only pairwise comparisons by humans (HUMAN ONLY). This suggests that pairwise comparisons by strong LLMs are valuable if they are complemented with (a few) pairwise comparisons by humans. Third, we find that, among the three strong LLMs, GPT 4 stands out as the best performer. ", "page_idx": 7}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/f9f5a7de887b775a809ee277145b6303d4fc0d09c0b38d362ba6d7db15ac2165.jpg", "img_caption": ["Figure 3: Empirical probability that each ranking position is included in the rank-sets constructed by BASELINE, LLM GPT4 and PPR GPT4 for each of the LLMs under comparison. In all panels, $n=990$ and $\\alpha=0.05$ . Larger (smaller) dots indicate higher (lower) empirical probability. "], "img_footnote": [], "page_idx": 8}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/d81538dc05b206689c34d73b571fcc00b3fac0c81bc239699991474d6690afa9.jpg", "img_caption": ["Figure 4: Empirical probability of each rank-set constructed by BASELINE, LLM GPT4 and PPR GPT4 for GPT 4 (left), Claude 1 (middle left), Vicuna (middle right) and PaLM 2 (right). In all panels, $n=990$ and $\\alpha=0.05$ . "], "img_footnote": [], "page_idx": 8}, {"type": "text", "text": "", "page_idx": 8}, {"type": "text", "text": "Figure 2 shows the average rank-set size against the baseline intersection probability for rank-sets constructed using PPR GPT4, PPR GPT3.5 and PPR CL3 for different values of $n$ and $\\alpha$ (the same values as in Figure 1).6 The results show that the trade-off between rank-sets and baseline intersection probabilities improves rapidly as the number of pairwise comparisons by humans $n$ increases but with diminishing returns. ", "page_idx": 8}, {"type": "text", "text": "Structure of the rank-sets. In this section, we take a closer look to the structure of the rank-sets constructed using BASELINE, LLM GPT4 and PPR GPT4. In Appendix D.3, we include additional results for all other methods. ", "page_idx": 8}, {"type": "text", "text": "First, we compute the empirical probability that each ranking position is included in the rank-sets constructed by BASELINE, LLM GPT4 and PPR GPT4 of each of the LLMs under comparison. Figure 3 summarizes the results for $n=990$ and $\\alpha=0.05$ , which reveal several interesting insights. We find that there is lower uncertainty regarding the ranking position of each model for LLM GPT4 than for PPR GPT4. However, for LLM GPT4, the ranking position with the highest probability mass differs from BASELINE in 7 out of 12 LLMs, including the top-2 performers. In contrast, for PPR GPT4, it only differs from BASELINE in 3 out of 12 LLMs. This questions once more the status quo, which proposed using only pairwise comparisons by strong LLMs to rank LLMs [12, 25–29, 31]. ", "page_idx": 8}, {"type": "text", "text": "Next, we compute the empirical probability of each rank-set constructed by BASELINE, LLM GPT4 and PPR GPT4 for each of the LLMs under comparison. Figure 4 summarizes the results for GPT 4, Claude 1, Vicuna and PaLM 2 for $n=990$ and $\\alpha=0.05$ . In agreement with the findings derived from Figure 3, we observe that the distribution of rank-sets constructed by LLM GPT4 is more concentrated than the distribution of rank sets constructed by PPR GPT4. However, the rank-sets with the highest probability mass constructed by LLM GPT4 coincide with those constructed by BASELINE much less frequently than those constructed by PPR GPT4. Refer to Appendix D.3 for qualitatively similar results for other LLMs. ", "page_idx": 9}, {"type": "text", "text": "6 Discussion and Limitations ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "In this section, we highlight several limitations of our work, discuss its broader impact, and propose avenues for future work. ", "page_idx": 9}, {"type": "text", "text": "Data. Our framework assumes that the queries and the pairwise comparisons made by humans and the strong LLMs are drawn i.i.d. from fixed distributions. In future work, it would be very interesting to lift these assumptions and allow for distribution shift. Moreover, our framework assumes that the pairwise comparisons made by humans are truthful. However, an adversary could have an economic incentive to make pairwise comparisons strategically in order to favor a specific model over others. In this context, it would be interesting to extend our framework so that it is robust to strategic behavior. ", "page_idx": 9}, {"type": "text", "text": "Methodology. Our framework utilizes rank-sets as a measure of uncertainty in rankings. However, in case of limited pairwise comparison data, rank-sets may be large and overlapping, reducing their value. In such situations, it may be worthwhile to explore other measures of uncertainty for rankings beyond rank-sets. Further, to measure the level of alignment with human preferences, our framework utilizes the win-rate—the probability that the outputs of each model are preferred over the outputs of any other model picked uniformly at random. However, if we need to rank $k$ LLMs and $k$ is large, win-rate may be impractical since, to obtain reliable estimates, we need to gather $O(k^{2})$ pairwise comparisons made by humans. Finally, our framework constructs rank-sets with asymptotic coverage guarantees, however, it would be interesting to derive PAC-style, finite-sample coverage guarantees. ", "page_idx": 9}, {"type": "text", "text": "Evaluation. We have showcased our framework using pairwise comparisons made by humans in a single platform, namely LMSYS Chatbot Arena, and pairwise comparisons made by just three strong LLMs. As a result, one may question the generalizability of the conclusion derived from the rank-sets estimated using our framework. In this context, it is also important to acknowledge that, in LMSYS Chatbot Arena, the queries are chosen by the humans who make pairwise comparisons and this may introduce a variety of biases. Therefore, it would be interesting to apply our framework to human data from other platforms. ", "page_idx": 9}, {"type": "text", "text": "Broader Impact. Our framework rank LLMs according to their level of alignment with human preferences—a LLM is ranked higher than others if its outputs are more frequently preferred by humans. However, in many application domains, especially in high-stakes scenarios, it may be important to account for other important factors such as accuracy, fairness, bias and toxicity [57]. ", "page_idx": 9}, {"type": "text", "text": "7 Conclusions ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "We have introduced a statistical framework to construct a ranking of a collection of LLMs consistent with their level of alignment with human preferences using a small set of pairwise comparisons by humans and a large set of pairwise comparisons by a strong LLM. Our framework quantifies uncertainty in the ranking by providing a rank-set—a set of possible ranking positions—for each of the models under comparison. Moreover, it guarantees that, with a probability greater than or equal to a user-specific value, the rank-sets cover the ranking consistent with the (true) probability that each model is preferred over others by humans asymptotically. Finally, we have empirically demonstrated that the rank-sets constructed using our framework are more likely to cover the true ranking consistent with (the distribution of) human pairwise preferences than the rank-sets constructed using only pairwise comparisons made by the strong LLMs. ", "page_idx": 9}, {"type": "text", "text": "Acknowledgments and Disclosure of Funding ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "Gomez-Rodriguez acknowledges support from the European Research Council (ERC) under the European Union’s Horizon 2020 research and innovation programme (grant agreement No. 945719). ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "[1] Sébastien Bubeck, Varun Chandrasekaran, Ronen Eldan, Johannes Gehrke, Eric Horvitz, Ece Kamar, Peter Lee, Yin Tat Lee, Yuanzhi Li, Scott Lundberg, Harsha Nori, Hamid Palangi, Marco Tulio Ribeiro, and Yi Zhang. Sparks of Artificial General Intelligence: Early experiments with GPT-4. arXiv preprint arXiv:2303.12712, 2023.   \n[2] Hussein Mozannar, Gagan Bansal, Adam Fourney, and Eric Horvitz. Reading Between the Lines: Modeling User Behavior and Costs in AI-Assisted Programming. In Proceedings of the Conference on Human Factors in Computing Systems. Association for Computing Machinery, 2024.   \n[3] Claudia E Haupt and Mason Marks. AI-Generated Medical Advice—GPT and Beyond. Journal of American Medical Association, 329(16):1349–1350, 2023.   \n[4] Bernardino Romera-Paredes, Mohammadamin Barekatain, Alexander Novikov, Matej Balog, M. Pawan Kumar, Emilien Dupont, Francisco J. R. Ruiz, Jordan S. Ellenberg, Pengming Wang, Omar Fawzi, Pushmeet Kohli, and Alhussein Fawzi. Mathematical Discoveries from Program Search with Large Language Models. Nature, 625(7995):468–475, 2023.   \n[5] Yupeng Chang, Xu Wang, Jindong Wang, Yuan Wu, Linyi Yang, Kaijie Zhu, Hao Chen, Xiaoyuan Yi, Cunxiang Wang, Yidong Wang, Wei Ye, Yue Zhang, Yi Chang, Philip S. Yu, Qiang Yang, and Xing Xie. A Survey on Evaluation of Large Language Models. ACM Transactions on Intelligent Systems and Technology, 2024.   \n[6] Dan Hendrycks, Collin Burns, Steven Basart, Andy Zou, Mantas Mazeika, Dawn Song, and Jacob Steinhardt. Measuring Massive Multitask Language Understanding. In Proceedings of the International Conference on Learning Representations. ICLR, 2021.   \n[7] Yizhong Wang, Yeganeh Kordi, Swaroop Mishra, Alisa Liu, Noah A. Smith, Daniel Khashabi, and Hannaneh Hajishirzi. Self-Instruct: Aligning Language Models with Self-Generated Instructions. In Proceedings of the Association for Computational Linguistics (Volume 1: Long Papers), pages 13484–13508. Association for Computational Linguistics, 2023.   \n[8] Long Ouyang, Jeffrey Wu, Xu Jiang, Diogo Almeida, Carroll Wainwright, Pamela Mishkin, Chong Zhang, Sandhini Agarwal, Katarina Slama, Alex Gray, John Schulman, Jacob Hilton, Fraser Kelton, Luke Miller, Maddie Simens, Amanda Askell, Peter Welinder, Paul Christiano, Jan Leike, and Ryan Lowe. Training Language Models to Follow Instructions with Human Feedback. In Advances in Neural Information Processing Systems, pages 27730–27744. Curran Associates, Inc., 2022.   \n[9] Yufei Wang, Wanjun Zhong, Liangyou Li, Fei Mi, Xingshan Zeng, Wenyong Huang, Lifeng Shang, Xin Jiang, and Qun Liu. Aligning Large Language Models with Human: A Survey. arXiv preprint arXiv:2307.12966, 2023.   \n[10] LMSYS. Chatbot Arena: Benchmarking LLMs in the Wild with Elo Ratings. https://lmsys.org/, 2023. Online; accessed 21 May 2024.   \n[11] Rohan Taori, Ishaan Gulrajani, Tianyi Zhang, Yann Dubois, Xuechen Li, Carlos Guestrin, Percy Liang, and Tatsunori B Hashimoto. Stanford Alpaca: An instruction-following LLaMA model. https://github.com/tatsu-lab/stanford_alpaca, 2023. Online; accessed 21 May 2024.   \n[12] Lianmin Zheng, Wei-Lin Chiang, Ying Sheng, Siyuan Zhuang, Zhanghao Wu, Yonghao Zhuang, Zi Lin, Zhuohan Li, Dacheng Li, Eric P. Xing, Hao Zhang, Joseph E. Gonzalez, and Ion Stoica. Judging LLM-as-a-Judge with MT-Bench and Chatbot Arena. In Advances in Neural Information Processing Systems, data track, pages 46595–46623. Curran Associates, Inc., 2023.   \n[13] Junlong Li, Shichao Sun, Weizhe Yuan, Run-Ze Fan, Hai Zhao, and Pengfei Liu. Generative Judge for Evaluating Alignment. In Proceedings of the International Conference on Learning Representations. ICLR, 2024.   \n[14] Ruosen Li, Teerth Patel, and Xinya Du. PRD: Peer Rank and Discussion Improve Large Language Model based Evaluations. Transactions on Machine Learning Research (TMLR), 2024.   \n[15] Meriem Boubdir, Edward Kim, Beyza Ermis, Sara Hooker, and Marzieh Fadaee. Elo Uncovered: Robustness and Best Practices in Language Model Evaluation. arXiv preprint arXiv:2311.17295, 2023.   \n[16] Karan Singhal, Shekoofeh Azizi, Tao Tu, S. Sara Mahdavi, Jason Wei, Hyung Won Chung, Nathan Scales, Ajay Tanwani, Heather Cole-Lewis, Stephen Pfohl, Perry Payne, Martin Seneviratne, Paul Gamble, Chris Kelly, Abubakr Babiker, Nathanael Schärli, Aakanksha Chowdhery, Philip Mansfield, Dina Demner-Fushman, Blaise Agüera y Arcas, Dale Webster, Greg S. Corrado, Yossi Matias, Katherine Chou, Juraj Gottweis, Nenad Tomasev, Yun Liu, Alvin Rajkomar, Joelle Barral, Christopher Semturs, Alan Karthikesalingam, and Vivek Natarajan. Large Language Models Encode Clinical Knowledge. Nature, 620(7972):172–180, July 2023.   \n[17] Wei-Lin Chiang, Lianmin Zheng, Ying Sheng, Anastasios Nikolas Angelopoulos, Tianle Li, Dacheng Li, Banghua Zhu, Hao Zhang, Michael I. Jordan, Joseph E. Gonzalez, and Ion Stoica. Chatbot Arena: An Open Platform for Evaluating LLMs by Human Preference. In Proceedings of the International Conference on Machine Learning. PMLR, 2024.   \n[18] Amanda Askell, Yuntao Bai, Anna Chen, Dawn Drain, Deep Ganguli, Tom Henighan, Andy Jones, Nicholas Joseph, Ben Mann, Nova DasSarma, Nelson Elhage, Zac Hatfield-Dodds, Danny Hernandez, Jackson Kernion, Kamal Ndousse, Catherine Olsson, Dario Amodei, Tom Brown, Jack Clark, Sam McCandlish, Chris Olah, and Jared Kaplan. A General Language Assistant as a Laboratory for Alignment. arXiv preprint arXiv:2112.00861, 2021.   \n[19] Tim Dettmers, Artidoro Pagnoni, Ari Holtzman, and Luke Zettlemoyer. QLoRA: Efficient Finetuning of Quantized LLMs. In Advances in Neural Information Processing Systems, pages 10088–10115. Curran Associates, Inc., 2024.   \n[20] Yuntao Bai, Andy Jones, Kamal Ndousse, Amanda Askell, Anna Chen, Nova DasSarma, Dawn Drain, Stanislav Fort, Deep Ganguli, Tom Henighan, Nicholas Joseph, Saurav Kadavath, Jackson Kernion, Tom Conerly, Sheer El-Showk, Nelson Elhage, Zac Hatfield-Dodds, Danny Hernandez, Tristan Hume, Scott Johnston, Shauna Kravec, Liane Lovitt, Neel Nanda, Catherine Olsson, Dario Amodei, Tom Brown, Jack Clark, Sam McCandlish, Chris Olah, Ben Mann, and Jared Kaplan. Training a Helpful and Harmless Assistant with Reinforcement Learning from Human Feedback. arXiv preprint arXiv:2204.05862, 2022.   \n[21] Yuxiang Wu, Zhengyao Jiang, Akbir Khan, Yao Fu, Laura Ruis, Edward Grefenstette, and Tim Rocktäschel. ChatArena: Multi-Agent Language Game Environments for Large Language Models. https://github.com/chatarena/chatarena, 2023.   \n[22] Yen-Ting Lin and Yun-Nung Chen. LLM-Eval: Unified Multi-Dimensional Automatic Evaluation for Open-Domain Conversations with Large Language Models. In Proceedings of the Workshop on NLP for Conversational AI, pages 47–58. Association for Computational Linguistics, July 2023.   \n[23] Pierre Boyeau, Anastasios N Angelopoulos, Nir Yosef, Jitendra Malik, and Michael I Jordan. AutoEval Done Right: Using Synthetic Data for Model Evaluation. arXiv preprint arXiv:2403.07008, 2024.   \n[24] Paul Thomas, Seth Spielman, Nick Craswell, and Bhaskar Mitra. Large Language Models Can Accurately Predict Searcher Preferences. In Proceedings of the International ACM SIGIR Conference on Research and Development in Information Retrieval, pages 1930–1940. Association for Computing Machinery, 2024.   \n[25] Peiyi Wang, Lei Li, Liang Chen, Zefan Cai, Dawei Zhu, Binghuai Lin, Yunbo Cao, Lingpeng Kong, Qi Liu, Tianyu Liu, and Zhifang Sui. Large language models are not fair evaluators. In Proceedings of the Association for Computational Linguistics, pages 9440–9450. Association for Computational Linguistics, 2024.   \n[26] Wei-Lin Chiang, Zhuohan Li, Zi Lin, Ying Sheng, Zhanghao Wu, Hao Zhang, Lianmin Zheng, Siyuan Zhuang, Yonghao Zhuang, Joseph E. Gonzalez, Ion Stoica, and Eric P. Xing. Vicuna: An Open-Source Chatbot Impressing GPT-4 with $90\\%*$ ChatGPT Quality. https://vicuna.lmsys.org, 2023. Online; accessed 21 May 2024.   \n[27] Cheng-Han Chiang and Hung-yi Lee. Can Large Language Models Be an Alternative to Human Evaluations? In Proceedings of the Association for Computational Linguistics (Volume 1: Long Papers), pages 15607–15631. Association for Computational Linguistics, 2023.   \n[28] Dongfu Jiang, Xiang Ren, and Bill Yuchen Lin. LLM-Blender: Ensembling Large Language Models with Pairwise Ranking and Generative Fusion. In Proceedings of the Association for Computational Linguistics (Volume 1: Long Papers), pages 14165–14178, Toronto, Canada, 2023. Association for Computational Linguistics.   \n[29] Yidong Wang, Zhuohao Yu, Zhengran Zeng, Linyi Yang, Cunxiang Wang, Hao Chen, Chaoya Jiang, Rui Xie, Jindong Wang, Xing Xie, Wei Ye, Shikun Zhang, and Yue Zhang. PandaLM: An Automatic Evaluation Benchmark for LLM Instruction Tuning Optimization. In Proceedings of the International Conference on Learning Representations. ICLR, 2024.   \n[30] Chengwei Qin, Aston Zhang, Zhuosheng Zhang, Jiaao Chen, Michihiro Yasunaga, and Diyi Yang. Is ChatGPT a General-Purpose Natural Language Processing Task Solver? In Proceedings of the Conference on Empirical Methods in Natural Language Processing, pages 1339–1384. Association for Computational Linguistics, 2023.   \n[31] Yann Dubois, Chen Xuechen Li, Rohan Taori, Tianyi Zhang, Ishaan Gulrajani, Jimmy Ba, Carlos Guestrin, Percy S Liang, and Tatsunori B Hashimoto. AlpacaFarm: A Simulation Framework for Methods that Learn from Human Feedback. In Advances in Neural Information Processing Systems, pages 30039–30069. Curran Associates, Inc., 2024.   \n[32] Zhen Qin, Rolf Jagerman, Kai Hui, Honglei Zhuang, Junru Wu, Jiaming Shen, Tianqi Liu, Jialu Liu, Donald Metzler, Xuanhui Wang, and Michael Bendersky. Large Language Models are Effective Text Rankers with Pairwise Ranking Prompting. In Proceedings of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (Volume 1: Long Papers), pages 1504–1518. Association for Computational Linguistics, 2024.   \n[33] Yinhong Liu, Han Zhou, Zhijiang Guo, Ehsan Shareghi, Ivan Vulic´, Anna Korhonen, and Nigel Collier. Aligning with Human Judgement: The Role of Pairwise Preference in Large Language Model Evaluators. arXiv preprint arXiv:2403.16950, 2024.   \n[34] Mudit Verma, Siddhant Bhambri, and Subbarao Kambhampati. Preference Proxies: Evaluating Large Language Models in Capturing Human Preferences in Human-AI Tasks. In Proceedings of the ICML Workshop The Many Facets of Preference-Based Learning, 2023.   \n[35] Tim R Davidson, Veniamin Veselovsky, Martin Josifoski, Maxime Peyrard, Antoine Bosselut, Michal Kosinski, and Robert West. Evaluating Language Model Agency Through Negotiations. In Proceedings of the International Conference on Learning Representations. ICLR, 2024.   \n[36] Yupeng Hou, Junjie Zhang, Zihan Lin, Hongyu Lu, Ruobing Xie, Julian McAuley, and Wayne Xin Zhao. Large Language Models are Zero-Shot Rankers for Recommender Systems. In European Conference on Information Retrieval, pages 364–381. Springer, 2024.   \n[37] Anastasios N. Angelopoulos, Stephen Bates, Clara Fannjiang, Michael I. Jordan, and Tijana Zrnic. Prediction-Powered Inference. Science, 382(6671):669–674, 2023.   \n[38] Anastasios N. Angelopoulos, John C Duchi, and Tijana Zrnic. PPI $^{++}$ : Efficient PredictionPowered Inference. arXiv preprint arXiv:2311.01453, 2023.   \n[39] Tijana Zrnic and Emmanuel J Candès. Cross-Prediction-Powered Inference. volume 121, page e2322083121. National Academy Sciences, 2024.   \n[40] Jon Saad-Falcon, Omar Khattab, Christopher Potts, and Matei Zaharia. ARES: An Automated Evaluation Framework for Retrieval-Augmented Generation Systems. In Proceedings of the 2024 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (Volume 1: Long Papers), pages 338–354, 2024.   \n[41] Oscar Lemmers, Jan AM Kremer, and George F Borm. Incorporating Natural Variation into IVF Clinic League Tables. Human Reproduction, 22(5):1359–1362, 2007.   \n[42] Harvey Goldstein and David J Spiegelhalter. League Tables and Their Limitations: Statistical Issues in Comparisons of Institutional Performance. Journal of the Royal Statistical Society. Series A (Statistics in Society), 159(3):385–409, 1996.   \n[43] Peter Hall and Hugh Miller. Using the Bootstrap to Quantify the Authority of an Empirical Ranking. The Annals of Statistics, 37:3929–3959, 2009.   \n[44] E Clare Marshall, Colin Sanderson, David J Spiegelhalter, and Martin McKee. Reliability of League Tables of In Vitro Fertilisation Clinics: Retrospective Analysis of Live Birth Rates. British Medical Journal, 316(7146):1701–1705, 1998.   \n[45] Tommy Wright, Martin Klein, and Jerzy Wieczorek. Ranking Populations Based on Sample Survey Data. Statistics, page 12, 2014.   \n[46] Minge Xie, Kesar Singh, and Cun-Hui Zhang. Confidence Intervals for Population Ranks in the Presence of Ties and Near Ties. Journal of the American Statistical Association, 104(486):775– 788, 2009.   \n[47] Shunpu Zhang, Jun Luo, Li Zhu, David G Stinchcomb, Dave Campbell, Ginger Carter, Scott Gilkeson, and Eric J Feuer. Confidence Intervals for Ranks of Age-Adjusted Rates across States or Counties. Statistics in Medicine, 33(11):1853–1866, 2014.   \n[48] Bitya Neuhof and Yuval Benjamini. Confident Feature Ranking. In Proceeding of the ICML workshop on Spurious Correlations, Invariance and Stability. PMLR, 2023.   \n[49] Justin Rising. Uncertainty in Ranking. arXiv preprint arXiv:2107.03459, 2021.   \n[50] Diaa Al Mohamad, Jelle J Goeman, and Erik W van Zwet. Simultaneous Confidence Intervals for Ranks with Application to Ranking Institutions. Biometrics, 78(1):238–247, 2022.   \n[51] Martin Klein, Tommy Wright, and Jerzy Wieczorek. A Joint Confidence Region for an Overall Ranking of Populations. Journal of the Royal Statistical Society Series C: Applied Statistics, 69(3):589–606, 2020.   \n[52] Stephen Bach, Victor Sanh, Zheng Xin Yong, Albert Webson, Colin Raffel, Nihal V. Nayak, Abheesht Sharma, Taewoon Kim, M Saiful Bari, Thibault Fevry, Zaid Alyafeai, Manan Dey, Andrea Santilli, Zhiqing Sun, Srulik Ben-david, Canwen Xu, Gunjan Chhablani, Han Wang, Jason Fries, Maged Al-shaibani, Shanya Sharma, Urmish Thakker, Khalid Almubarak, Xiangru Tang, Dragomir Radev, Mike Tian-jian Jiang, and Alexander Rush. PromptSource: An Integrated Development Environment and Repository for Natural Language Prompts. In Proceedings of the Association for Computational Linguistics: System Demonstrations, pages 93–104. Association for Computational Linguistics, May 2022.   \n[53] Jason Wei, Maarten Bosma, Vincent Zhao, Kelvin Guu, Adams Wei Yu, Brian Lester, Nan Du, Andrew M. Dai, and Quoc V Le. Finetuned Language Models are Zero-Shot Learners. In Proceedings of the International Conference on Learning Representations. ICLR, 2022.   \n[54] Alon Talmor, Jonathan Herzig, Nicholas Lourie, and Jonathan Berant. CommonsenseQA: A Question Answering Challenge Targeting Commonsense Knowledge. In Proceedings of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers), pages 4149–4158. Association for Computational Linguistics, 2019.   \n[55] Swaroop Mishra, Daniel Khashabi, Chitta Baral, and Hannaneh Hajishirzi. Cross-Task Generalization via Natural Language Crowdsourcing Instructions. In Proceedings of the Association for Computational Linguistics (Volume 1: Long Papers), pages 3470–3487, Dublin, Ireland, May 2022. Association for Computational Linguistics.   \n[56] Mark Chen, Jerry Tworek, Heewoo Jun, Qiming Yuan, Henrique Ponde de Oliveira Pinto, Jared Kaplan, Harri Edwards, Yuri Burda, Nicholas Joseph, Greg Brockman, Alex Ray, Raul Puri, Gretchen Krueger, Michael Petrov, Heidy Khlaaf, Girish Sastry, Pamela Mishkin, Brooke Chan, Scott Gray, Nick Ryder, Mikhail Pavlov, Alethea Power, Lukasz Kaiser, Mohammad Bavarian, Clemens Winter, Philippe Tillet, Felipe Petroski Such, Dave Cummings, Matthias Plappert, Fotios Chantzis, Elizabeth Barnes, Ariel Herbert-Voss, William Hebgen Guss, Alex Nichol, Alex Paino, Nikolas Tezak, Jie Tang, Igor Babuschkin, Suchir Balaji, Shantanu Jain, William Saunders, Christopher Hesse, Andrew N. Carr, Jan Leike, Josh Achiam, Vedant Misra, Evan Morikawa, Alec Radford, Matthew Knight, Miles Brundage, Mira Murati, Katie Mayer, Peter Welinder, Bob McGrew, Dario Amodei, Sam McCandlish, Ilya Sutskever, and Wojciech Zaremba. Evaluating Large Language Models Trained on Code. arXiv preprint arXiv:2107.03374, 2021.   \n[57] Percy Liang, Rishi Bommasani, Tony Lee, Dimitris Tsipras, Dilara Soylu, Michihiro Yasunaga, Yian Zhang, Deepak Narayanan, Yuhuai Wu, Ananya Kumar, Benjamin Newman, Binhang Yuan, Bobby Yan, Ce Zhang, Christian Alexander Cosgrove, Christopher D Manning, Christopher Re, Diana Acosta-Navas, Drew Arad Hudson, Eric Zelikman, Esin Durmus, Faisal Ladhak, Frieda Rong, Hongyu Ren, Huaxiu Yao, Jue WANG, Keshav Santhanam, Laurel Orr, Lucia Zheng, Mert Yuksekgonul, Mirac Suzgun, Nathan Kim, Neel Guha, Niladri S. Chatterji, Omar Khattab, Peter Henderson, Qian Huang, Ryan Andrew Chi, Sang Michael Xie, Shibani Santurkar, Surya Ganguli, Tatsunori Hashimoto, Thomas Icard, Tianyi Zhang, Vishrav Chaudhary, William Wang, Xuechen Li, Yifan Mai, Yuhui Zhang, and Yuta Koreeda. Holistic Evaluation of Language Models. Transactions on Machine Learning Research, 2023.   \n[58] Shayne Longpre, Le Hou, Tu Vu, Albert Webson, Hyung Won Chung, Yi Tay, Denny Zhou, Quoc V Le, Barret Zoph, Jason Wei, and Adam Roberts. The Flan Collection: Designing Data and Methods for Effective Instruction Tuning. In Proceedings of the International Conference on Machine Learning, pages 22631–22648. PMLR, Jul 2023.   \n[59] Arpad E. Elo. The USCF Rating System: Its Development, Theory, and Applications. United States Chess Federation, 1966.   \n[60] Quentin Bertrand, Wojciech Marian Czarnecki, and Gauthier Gidel. On the Limitations of the Elo, Real-World Games are Transitive, Not Additive. In International Conference on Artificial Intelligence and Statistics, pages 2905–2921. PMLR, 2023.   \n[61] Adian Liusie, Potsawee Manakul, and Mark J. F. Gales. LLM Comparative Assessment: Zero-shot NLG Evaluation through Pairwise Comparisons using Large Language Models. In Proceedings of the European Chapter of the Association for Computational Linguistics (Volume 1: Long Papers), pages 139–151. Association for Computational Linguistics, 2024.   \n[62] Zongjie Li, Chaozheng Wang, Pingchuan Ma, Daoyuan Wu, Shuai Wang, Cuiyun Gao, and Yang Liu. Split and Merge: Aligning Position Biases in Large Language Model Based Evaluators. arXiv preprint arXiv:2310.01432, 2023.   \n[63] Mingqi Gao, Jie Ruan, Renliang Sun, Xunjian Yin, Shiping Yang, and Xiaojun Wan. Human-like Summarization Evaluation with ChatGPT. arXiv preprint arXiv:2304.02554, 2023.   \n[64] Yushi Bai, Jiahao Ying, Yixin Cao, Xin Lv, Yuze He, Xiaozhi Wang, Jifan Yu, Kaisheng Zeng, Yijia Xiao, Haozhe Lyu, Jiayin Zhang, Juanzi Li, and Lei Hou. Benchmarking Foundation Models with Language-Model-as-an-Examiner. In Advances in Neural Information Processing Systems. Curran Associates, Inc., 2024.   \n[65] William Webber, Alistair Moffat, and Justin Zobel. A Similarity Measure for Indefinite Rankings. ACM Transactions on Information Systems, 28(4):20:1–20:38, 2010. ", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "", "page_idx": 13}, {"type": "text", "text": "", "page_idx": 14}, {"type": "text", "text": "A Proof of Theorem 4.1 ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "Note that Eq. 12 holds if and only if: ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\operatorname*{lim}_{n}\\mathbb{P}\\left(\\exists m\\in\\mathcal{M}:\\,[l(m),u(m)]\\subsetneq[\\hat{l}(m),\\hat{u}(m)]\\right)\\leq\\alpha\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "Therefore, to prove the theorem, it is sufficient to prove that Eq. 13 holds. Now, to prove that Eq. 13, we first show that the probability on the left hand side of the above equation is smaller than or equal to the probability $\\mathbb{P}(\\pmb{\\theta}\\notin\\mathcal{C}_{\\alpha})$ . ", "page_idx": 15}, {"type": "text", "text": "To this end, first note that, if for at least one model $m\\ \\in\\ {\\mathcal{M}}$ , we have that $\\hat{l}(m)\\;>\\;l(m)$ or $\\hat{u}(m)<u(m)$ , then it holds that ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\bigcap_{m\\in\\mathcal{M}}\\left[l(m),u(m)\\right]\\mathcal{Z}\\;[\\hat{l}(m),\\hat{u}(m)].\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "Next, without loss of generality, assume that, for model $m$ , we have that ${\\hat{l}}(m)>l(m)$ . In this case, from Eqs. 11 and 2 we get: ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\sum_{\\tilde{m}\\in\\mathcal{M}\\backslash\\{m\\}}\\mathbf{1}\\big\\{d(\\mathcal{C}_{\\alpha},H_{m,\\tilde{m}})>0\\big\\}\\cdot\\mathbf{1}\\big\\{\\hat{\\theta}_{m}<\\hat{\\theta}_{\\tilde{m}}\\big\\}\\quad>\\sum_{\\tilde{m}\\in\\mathcal{M}\\backslash\\{m\\}}\\mathbf{1}\\big\\{\\theta_{m}<\\theta_{\\tilde{m}}\\big\\},\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "which means that there must be at least one model $\\tilde{m}\\,\\in\\,\\mathcal{M}$ such that $x_{m}\\,<\\,x_{\\tilde{m}}\\,\\,\\forall{\\pmb x}\\,\\in\\,{\\mathcal C}_{\\alpha}$ and $\\theta_{m}>\\theta_{\\tilde{m}}$ , which implies that $\\pmb{\\theta}\\notin\\mathcal{C}_{\\alpha}$ . As a result, we can immediately conclude that, ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\operatorname*{lim}_{n}\\mathbb{P}\\left(\\exists m\\in\\mathcal{M}:\\,[l(m),u(m)]\\not\\subseteq[\\hat{l}(m),\\hat{u}(m)]\\right)\\,\\leq\\,\\operatorname*{lim}_{n}\\mathbb{P}(\\pmb\\theta\\not\\in\\mathcal{C}_{\\alpha})\\,=\\,\\alpha.\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "This concludes the proof. ", "page_idx": 15}, {"type": "text", "text": "B Algorithms ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "B.1 Algorithm 3 ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "In this section, we present a pseudocode implementation of the algorithm to construct confidence regions using linear regression. ", "page_idx": 16}, {"type": "text", "text": "Note that, in Algorithm 2, $\\hat{\\pmb\\theta}$ and $\\widehat{\\boldsymbol{\\Sigma}}$ can alternatively be computed by calling Algorithm 3 instead of Algorithm 1. Algorithm 3 runs i n $O(k^{2}|D|)$ time. ", "page_idx": 16}, {"type": "text", "text": "B.2 Algorithm to set $\\lambda$ ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "The parameter $\\lambda\\in[0,1]$ weighs the comparisons $\\hat{w},\\hat{w}^{\\prime}$ by the strong LLM differently than the comparisons $w,w^{\\prime}$ by humans. This way, if the strong LLM’s preferences are strongly aligned with human preferences, the pairwise comparisons by the strong LLM can be weighed close to or equally with the pairwise comparisons by humans. Conversely, if the strong LLM’s preferences are not well aligned with human preferences, the pairwise comparisons $\\hat{w},\\hat{w}^{\\prime}$ can be weighed lower than the pairwise comparisons $w,w^{\\prime}$ . Following Angelopoulous et al. [38], we select the $\\lambda$ that minimizes $\\mathrm{tr}(\\Sigma)$ , where $\\pmb{\\Sigma}=\\mathbb{E}[(\\hat{\\pmb{\\theta}}-\\pmb{\\theta})(\\hat{\\pmb{\\theta}}-\\pmb{\\theta})^{\\top}]$ : ", "page_idx": 16}, {"type": "equation", "text": "$$\n\\lambda=\\frac{n}{n+N}\\frac{\\mathrm{tr}(\\Sigma_{n})}{\\mathrm{tr}(\\Sigma_{N})}\n$$", "text_format": "latex", "page_idx": 16}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/086f0bd977c589acee850cfbcbee166f8ec52a7f5274d0cf9c87d06f889d4b78.jpg", "img_caption": ["// Algorithm 3"], "img_footnote": [], "page_idx": 16}, {"type": "text", "text": "where $\\Sigma_{N}$ is the sample covariance matrix of the estimate of $\\breve{\\theta}$ computed from Algorithm 3 using the pairwise comparisons by the strong LLM $\\mathcal{D}_{N}$ , and $\\Sigma_{n}$ is the sample covariance matrix of the estimates of $\\breve{\\pmb\\theta}$ and $\\pmb{\\theta}$ computed via Algorithm 3 using the pairwise comparisons by the strong LLM and by humans respectively in dataset $\\mathcal{D}_{n}$ . Detailed computation of $\\lambda$ is shown in Algorithm 4, which runs in $O(k^{2}(N+{n}))$ . ", "page_idx": 16}, {"type": "text", "text": "Algorithm 4: It computes $\\lambda$ Input: k, $\\mathcal{D}_{N}$ , $\\mathcal{D}_{n}$ ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Output: $\\lambda$ 1 $\\boldsymbol{w}_{n},\\mathbf{\\dot{w}}_{n}^{\\prime},\\boldsymbol{\\hat{w}}_{n},\\boldsymbol{\\hat{w}}_{n}^{\\prime},M_{n},M_{n}^{\\prime}\\gets\\mathrm{SUMMARIZE}(\\mathcal{D}_{n},k)$ 2 $\\begin{array}{r}{\\hat{\\boldsymbol{a}}_{n}\\gets\\left(\\mathbf{1}_{k}\\left(\\left(M_{n}+M_{n}^{\\prime}\\right)\\mathbf{1}_{n}\\right)^{\\top}\\odot\\mathbb{I}_{k}\\right)^{-1}\\left(M_{n}\\cdot\\hat{\\boldsymbol{w}}_{n}+M_{n}^{\\prime}\\cdot\\hat{\\boldsymbol{w}}_{n}^{\\prime}\\right)}\\end{array}$ 3 $\\begin{array}{r}{\\pmb{a}_{n}\\leftarrow\\left(\\mathbf{1}_{k}\\left(\\left(M_{n}+M_{n}^{\\prime}\\right)\\mathbf{1}_{n}\\right)^{\\top}\\odot\\mathbb{I}_{k}\\right)^{-1}\\left(M_{n}\\cdot\\pmb{w}_{n}+M_{n}^{\\prime}\\cdot\\pmb{w}_{n}^{\\prime}\\right)}\\end{array}$ 4 $\\mathring{A}_{n}\\gets\\big(\\big(\\mathbf{1}_{k}\\big(\\hat{w}_{n}-M_{n}^{\\top}\\hat{a}_{n}\\big)^{\\top}\\big)\\odot M_{n}+\\big(\\mathbf{1}_{k}\\big(\\hat{w}_{n}^{\\prime}-M_{n}^{\\prime\\top}\\hat{a}_{n}\\big)^{\\top}\\big)\\odot M_{n}^{\\prime}\\big)$ 5 $A_{n}\\gets\\big(\\big(\\mathbf{1}_{k}(\\boldsymbol{w}_{n}-\\boldsymbol{M}_{n}^{\\top}\\boldsymbol{a}_{n})^{\\top}\\big)\\odot\\boldsymbol{M}_{n}+\\big(\\mathbf{1}_{k}(\\boldsymbol{w}_{n}^{\\prime}-\\boldsymbol{M}_{n}^{\\prime\\top}\\boldsymbol{a}_{n})^{\\top}\\big)\\odot\\boldsymbol{M}_{n}^{\\prime}\\big)$ 6 $\\begin{array}{r}{\\Sigma_{n}\\leftarrow\\frac{1}{n^{2}}\\hat{A}_{n}A_{n}^{-1}}\\end{array}$ $\\boldsymbol{\\tau}^{\\mathrm{~-~}}\\!-,\\boldsymbol{\\Sigma}_{N}\\gets\\mathrm{{conFIDENCE-ELLIPSOID}}\\big(k,\\mathcal{D}_{N}\\big)$ 8 $\\begin{array}{r}{\\lambda\\leftarrow\\frac{n}{n+N}\\frac{\\mathrm{tr}(\\Sigma_{n})}{\\mathrm{tr}(\\Sigma_{N})}}\\end{array}$ ", "page_idx": 16}, {"type": "text", "text": "9 return λ ", "page_idx": 16}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/a043e270848e68ed9f6d996f8c62cdc06df9f0035dff64d207d9d896dcfce37d.jpg", "img_caption": ["Listing 1: The prompt used for gathering pairwise preferences of strong LLMs. "], "img_footnote": [], "page_idx": 17}, {"type": "text", "text": "C Additional Details of the Experimental Setup ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "In this section, we provide the implementation details and computational resources used to execute the experiments discussed in Section 5. Our algorithms are implemented in Python 3.11.2 programming language using NumPy and SciPy open-source libraries for efficient matrix operations. Further, we use the matplotlib package to facilitate visualizations of our results. The complete details of the software requirements can be found in the source code provided as part of the supplementary materials. Our experiments are executed on a compute server equipped with $2\\times\\mathrm{AMD}$ EPYC 7702 processor with 64 cores per processor and 2 TB of main memory. It is worth noting that, our experiments are not resource intensive and can be executed on a standard desktop computer or a laptop. ", "page_idx": 17}, {"type": "text", "text": "Pairwise comparisons and preprocessing. Using the dataset from LMSYS Chatbot Arena7, we gathered pairwise comparisons of three strong LLMs via API calls to OpenAI API version 2024-02-15-preview for GPT 3.5 and GPT 4, and Anthropic API version 2023-06-01 for Claude 3. To this end, we use (almost) the same prompt as in Zheng et al. [12] that instructs each strong LLM to output option $\\mathrm{{}^{\\bullet}A^{\\prime}\\left(\\mathrm{{}^{\\bullet}B^{\\prime}}\\right)}$ if it prefers the response of first (second) model, or option ‘C’ if it declares a tie. The prompt used to obtain pairwise preferences of is available in Listing 1. We preprocess the dataset by filtering out instances—an instance is a pair of responses to a query by two different models and the query itself—for which at least one strong LLM returned a verbose output instead of ‘A’, ‘B’ or $\\surd C`$ , and choose a set of 12 popular large language models for our experiments. The chosen models, along with their specific versions, are listed in Table 1. In Figure 5, we show the number of pairwise comparisons per each pair of these chosen models after completing all preprocessing steps. ", "page_idx": 17}, {"type": "text", "text": "Table 1: The names and versions of the 12 popular large language models considered for our experiments after preprocessing the Chatbot Arena dataset. ", "page_idx": 18}, {"type": "table", "img_path": "7V62sQ5Jra/tmp/84f39d1650bdf2e592b73769d09a716a324daf99c7e1be0b5af8524519fa7478.jpg", "table_caption": [], "table_footnote": [], "page_idx": 18}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/6390fe5bc69428a96d9b99fab65d0a0ed60d634bf8fc50316b58284b3a3ac854.jpg", "img_caption": ["Figure 5: The number of pairwise comparisons per each pair of models after all preprocessing steps. "], "img_footnote": [], "page_idx": 18}, {"type": "text", "text": "D Additional Experimental Results ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "In this section, we discuss additional experimental results that were omitted from the main paper due to space limitations. ", "page_idx": 19}, {"type": "text", "text": "D.1 Quality of the Rank-sets ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "In Figure 6, we show a more detailed analysis of the average rank-set size plotted against the baseline intersection probability, with individual plots for each strong LLM: GPT4 (top), CL3 (middle) and GPT3.5 (bottom), for $n=990$ and different $\\alpha$ values.8 All observations made in Figure 1 apply to Figure 6 as well. Moreover, it is evident that among the three strong LLMs, GPT 4 clearly outperforms the others, achieving higher baseline intersection probability and returning rank-sets with smaller average size. Specifically, in Figure 6 (a), the difference between average rank-set size between HUMAN ONLY and PPR GPT4 is significantly pronounced, while the gap gradually narrows in subsequent plots for PPR CL3 and PPR GPT3.5. ", "page_idx": 19}, {"type": "text", "text": "D.2 Baseline Coverage Probability ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "In this subsection, we investigate a more conservative quality metric, namely baseline coverage probability, which is the (empirical) probability that the rank-sets $[\\hat{l}(m),\\hat{u}(m)]$ constructed by any method cover the rank-sets $[\\tilde{l}(m),\\tilde{u}(m)]$ constructed using the BASELINE method, i.e., ", "page_idx": 19}, {"type": "equation", "text": "$$\n\\mathbb{P}\\left(\\bigcap_{m\\in\\mathcal{M}}{\\mathbf{1}}\\left\\{[\\tilde{l}(m),\\tilde{u}(m)]\\subseteq[\\hat{l}(m),\\hat{u}(m)]\\right\\}\\right)\n$$", "text_format": "latex", "page_idx": 19}, {"type": "text", "text": "The baseline intersection probability, which we discussed in Section 5 and illustrated in Figure 1, is a less conservative metric compared to the baseline coverage probability. While the latter represents the probability that all rank-sets are covered by the BASELINE rank-sets, the former only considers the probability that the rank-sets intersect. Thus, achieving high baseline coverage probability is difficult, particularly when the BASELINE rank-sets are larger. ", "page_idx": 19}, {"type": "text", "text": "Quality of the rank-sets when considering the baseline coverage probability. In Figure 7, we show the average rank-set size against the baseline coverage probability for rank-sets constructed using all methods (except BASELINE) for $n=990$ and different values of $\\alpha$ (the same values as in Figure 6). Immediately, we notice that the baseline coverage probability of all methods is very low. For rank-sets constructed using pairwise comparisons only by a strong LLM (LLM GPT4, LLM CL3 and LLM GPT3.5), the baseline coverage probability is close to (or exactly) zero. Rank-sets constructed using only pairwise comparisons by humans (HUMAN ONLY) or prediction-powered ranking using a strong LLM (PPR GPT4, PPR CL3 and PPR GPT3.5) achieve better baseline coverage probability. However, the difference in performance among these methods is not clear to distinguish, which motivated us to consider the baseline intersection probability metric for our experimental results in Section 5. ", "page_idx": 19}, {"type": "text", "text": "In Figure 8, we show the average rank-set size against the baseline coverage probability for rank-sets constructed using PPR GPT4, PPR GPT3.5 and PPR CL3 for different values 9 of $n$ and $\\alpha$ (the same $\\alpha$ values as in Figure 6). Similarly as in Figure 2, results show that there is a trade-off between average rank-set size and the baseline coverage probability, which improves rapidly as the number of pairwise comparisons by humans $n$ increases, but with diminishing returns. ", "page_idx": 19}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/5d17c233dcb483b5c4a9d29faf6b069112df7f922de1dd74922838b6fc2c2ac5.jpg", "img_caption": ["Figure 6: Average rank-set size against baseline intersection probability for rank-sets constructed using only pairwise comparisons by a strong LLM: LLM GPT4 (top), LLM CL3 (middle) and LLM ${\\mathrm{GpT}}3.5$ (bottom), only pairwise comparisons by humans (HUMAN ONLY), and pairwise comparisons by both a strong LLM and humans (PPR GPT4 top, PPR CL3 middle and PPR GPT3.5 bottom) for different $\\alpha$ values and $n\\,=\\,990$ . Smaller (larger) average rank-set sizes and larger (smaller) intersection probabilities are better (worse). The shaded region shows a $95\\%$ confidence interval for the rank-set size of all rank-sets among all 1, 000 repetitions. ", "(c) GPT 3.5 "], "img_footnote": [], "page_idx": 20}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/c93e3e50a1bddf05bbfedba688d6da404f090fd15accbed65b2baf1acb225041.jpg", "img_caption": [], "img_footnote": [], "page_idx": 21}, {"type": "text", "text": "Figure 7: Average rank-set size against baseline coverage probability for rank-sets constructed using only pairwise comparisons by a strong LLM (LLM GPT4, LLM GPT3.5 and LLM CL3), only pairwise comparisons by humans (HUMAN ONLY), and pairwise comparisons by both a strong LLM and humans (PPR GPT4, PPR GPT3.5 and PPR CL3) for different $\\alpha$ values and $n=990$ . Smaller (larger) average rank-set sizes and larger (smaller) coverage probabilities are better (worse). In all panels, $95\\%$ confidence bars for the rank-set size are not shown, as they are below 0.02. ", "page_idx": 21}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/a2e3bfe7d036feebe30716fcf8bb225b3495baae09983ebb0051a442b9ae2894.jpg", "img_caption": ["Figure 8: Average rank-set size against baseline coverage probability for rank-sets constructed using pairwise comparisons by both a strong LLM and humans for different $n$ and $\\alpha$ values. Smaller (larger) average rank-set sizes and larger (smaller) coverage probabilities are better (worse). In all panels, $95\\%$ confidence bars for the rank-set size are not shown, as they are below 0.04. "], "img_footnote": [], "page_idx": 21}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/04c785ca20a52d3b469a9baee7d3578da3da39f7bfada54126ab37e7aac4b516.jpg", "img_caption": ["Figure 9: Empirical probability that each ranking position is included in the rank-sets constructed by all methods for each of the LLMs under comparison. In all panels, $n=990$ and $\\alpha=0.05$ . Larger (smaller) dots indicate higher (lower) empirical probability. "], "img_footnote": [], "page_idx": 22}, {"type": "text", "text": "D.3 Structure of the Rank-sets ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "In this subsection, we take closer look at the structure of the rank-sets constructed by all methods. We compute the empirical probability that each ranking position is included in the rank-sets constructed by all methods, of each of the LLMs under comparison. The results are summarized in Figure 9 for $\\alpha=0.05$ and $n=990$ . ", "page_idx": 22}, {"type": "text", "text": "Empirical probability of ranking positions. Our first observation is that, the ranking positions of each model in LLM GPT4 and LLM CL3 have lower uncertainty compared to PPR GPT3.5 and PPR CL3, respectively. However, LLM GPT3.5 exhibits higher uncertainty compared to PPR GPT3.5. Nonetheless, the ranking positions with the highest probability mass in LLM GPT4, LLM CL3 and LLM GPT3.5 significantly deviate from the BASELINE. Specifically, the ranking position with highest probability mass differs for 7 out of 12 models. In contrast, for PPR GPT4, PPR CL3 and PPR GPT3.5 it only differs from the BASELINE for 3 out of 12 LLMs. These findings once again question the rationale of relying solely on pairwise comparisons by strong LLMs to rank LLMs [12, 25–29, 31]. Our second observation is that there is no significant difference in the uncertainty in ranking positions across HUMAN ONLY, PPR GPT4, PPR CL3 and PPR GPT4. However, the distribution of probability mass across different ranking positions differs slightly among these methods. This observation is clearly seen in PPR GPT4, where the Alpaca model has zero probability mass for position 6. ", "page_idx": 22}, {"type": "text", "text": "Empirical probability of rank-sets. Next, we compute the empirical probability of each rank-set constructed by all methods and for each of the LLMs under comparison with $n=990$ and $\\alpha=0.05$ . The results are summarized in Figure 10. Consistent with the observations from Figure 9, we note that the distribution of rank-sets constructed by LLM GPT4 is more concentrated than those constructed by other methods. Conversely, LLM GPT3.5 exhibits a more spread-out distribution of rank-sets, indicating higher uncertainty in its ranking positions. This observation is consistent across all LLMs considered for ranking. Despite the more concentrated distributions of rank-sets for LLM GPT4 and LLM CL3, we observed that the ranking positions with the highest probability mass often differed from those of the BASELINE, with discrepancies observed in 7 out of 12 models. On the contrary, the rank-sets constructed by PPR GPT4, PPR CL3 and PPR GPT3.5 exhibit distributions that are neither excessively spread out nor highly concentrated. But the rank-sets with the highest probability mass constructed by these methods coincide with those constructed by BASELINE more frequently than their LLM only counterparts. Once again, these findings underscore our argument that rank-sets obtained using only pairwise comparisons of strong LLMs are not very reliable. ", "page_idx": 22}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/faa21e9f87bed66df67ed8104163abe3c172bbeb21ebd9857cb7e7f34fc68e74.jpg", "img_caption": ["(b) Claude 1 "], "img_footnote": [], "page_idx": 23}, {"type": "text", "text": "Figure 10: Empirical probability of each rank-set constructed by all methods for all 12 models (one model per sub-figure). In all panels, $n=990$ and $\\alpha=0.05$ . ", "page_idx": 23}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/269bb9e42efc981c14cddee1f0a6402f46492bf25c6f1eae254d933cb0da655f.jpg", "img_caption": ["Figure 10 (cont.) "], "img_footnote": [], "page_idx": 24}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/8f4af03ac6e93be0a5b8d871662956d59c627d26a77bb648dc710e5c646ed7a2.jpg", "img_caption": ["Figure 10 (cont.) "], "img_footnote": [], "page_idx": 25}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/d8b5aff5206048da1313d217564923ef6e47f986e6dc52cb2aa0dea43f61e74b.jpg", "img_caption": ["Figure 10 (cont.) "], "img_footnote": [], "page_idx": 26}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/ebc50590364e8c5f7109870bd895c304576c61bd79c77cb1c41ef2a8353f420c.jpg", "img_caption": ["Figure 10 (cont.) "], "img_footnote": [], "page_idx": 27}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/076602b56af86f2988b6564fbb1493afd0f29d5c441e41868cb3cd1597775d67.jpg", "img_caption": ["ChatGLM ", "Figure 10 (cont.) "], "img_footnote": [], "page_idx": 28}, {"type": "text", "text": "E Synthetic Experiments ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "In this section, we evaluate our framework in a synthetic setting where the true rank-sets of the models are known. This allows us to validate the theoretical coverage guarantee of Theorem 4.1 without relying on a proxy metric, and also compute the rank-biased overlap (RBO) [65]. ", "page_idx": 29}, {"type": "text", "text": "Experimental setup. We consider $k=8$ models and, in each experiment, we generate a random vector of true win probabilities $\\pmb{\\theta}$ (Eq. 1), which induces the true rank-sets of the models.10 To obtain win probabilities $\\breve{\\pmb\\theta}$ (Eq. 3), we add random noise to the vector and then re-normalize $\\breve{\\pmb\\theta}$ . We sample the noise from a Uniform $(-u,u)$ distribution, where $u$ a parameter we manually set to simulate different alignment levels between strong LLMs and human preferences. A larger $u$ indicates a greater difference between $\\pmb{\\theta}$ and $\\breve{\\pmb\\theta}$ , meaning the LLM is less aligned with human preference, and vice versa. In our experiments, we set $u\\in\\{0.05,0.1,0.3\\}$ to simulate three different strong LLMs. ", "page_idx": 29}, {"type": "text", "text": "To draw reliable conclusions, for each experiment, we create rank-sets 300 times, each time using a different set of $n+N=50{,}000$ simulated pairwise comparisons by humans and the three strong LLMs, with an equal number of pairwise comparisons per pair of models. We ensure that each model provides the first and second response to an equal number of pairwise comparisons. Let $m_{a}$ and $m_{b}$ be the two models in a pairwise comparison, with $m_{a}$ giving the first response. For each pairwise comparison, first, we generate a number $x\\in(0,1)$ uniformly at random. For the human outcome, if $x<2\\,\\theta_{m_{a}}$ , then the response of model $m_{a}$ is preferred $\\ w=1$ ). Similarly, for the strong LLM outcome, if $\\bar{x}<2\\,\\breve{\\theta}_{m_{a}}$ , then the response of model $m_{a}$ is preferred $\\hat{w}=1$ ). In every comparison we set $w^{\\prime}=\\hat{w}^{\\prime}=0$ . ", "page_idx": 29}, {"type": "text", "text": "Coverage probability. Using the generated pairwise comparisons, we compute rank-sets in a similar way as described in Section 5, with $\\alpha=0.1$ . Since the true rank-sets are known, we can compute the (empirical) coverage probability, shown in Figure 11. The results show that the coverage probability increases with $n$ , consistent with Theorem 4.1. Further, the coverage probability is greater when $u$ is smaller, indicating that our method achieves better results when the strong LLM is more aligned to human preference. ", "page_idx": 29}, {"type": "text", "text": "Rank-biased overlap (RBO). For each method, we obtain a ranking $\\hat{T}$ by sorting the models in descending order of their θˆ values. We then compute the RBO metric relative to their true ranking $T$ as follows: ", "page_idx": 29}, {"type": "equation", "text": "$$\n\\mathrm{RBO}(T,\\hat{T},p)=(1-p)\\sum_{i\\in[k]}p^{i-1}\\frac{|T_{:i}\\cap\\hat{T}_{:i}|}{i}\n$$", "text_format": "latex", "page_idx": 29}, {"type": "text", "text": "where $T_{:i}$ and $\\hat{T}_{:i}$ represents the top $i$ models in ranking $T$ and $\\hat{T}$ , respectively, and $p\\in[0,1]$ is a chosen parameter. When $p=1$ , all models are weighed equally. As we decrease $p$ , more emphasis is given to the top-ranked models, and at $p=0$ , only the top-ranked model is considered. In Figure 12, we compare RBO values as we increase the number of human pairwise comparisons $n$ , for $p=0.6$ The results show that increasing $n$ improves RBO across all methods. Additionally, combining human pairwise preferences with a strong LLM further improves RBO values, demonstrating that our method performs better than those solely relying on strong LLM preferences. We repeated our experiments with multiple values of $p\\in[0,\\dot{1}]$ and observed no significant variation in the results. ", "page_idx": 29}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/d105be1268a40f79ec80d06c407d81c78bd70fa2bb9138a59e8b06946872fbd5.jpg", "img_caption": ["Figure 11: Empirical coverage probability of the rank-sets constructed using only $n$ synthetic pairwise comparisons by humans (HUMAN ONLY) and using both $n$ synthetic pairwise comparisons by humans and $N+n$ synthetic pairwise comparisons by one out of three different simulated strong LLMs (PPR 0.05, PPR 0.1 and PPR 0.3) with $\\alpha=0.1$ and $N+n=50000$ . Each of the strong LLMs has a different level of alignment with human preferences controlled by a noise value $u\\in\\{0.05,0.1,0.3\\}$ . The dashed line indicates the $1-\\alpha$ target coverage. The empirical coverage of the rank-sets constructed using only $N+n$ synthetic pairwise comparison by one of the same three strong LLMs (not shown in the figure) is 0.38 $\\chi=0.05)$ ), 0.13 $u=0.1$ ) and 0.0 $u=0.3)$ ). "], "img_footnote": [], "page_idx": 30}, {"type": "image", "img_path": "7V62sQ5Jra/tmp/f60f11ef09ab817a2a6f8134b6334aa3ac465823ccd5b9cf3d7869861a243d75.jpg", "img_caption": ["Figure 12: Average rank-biased overlap (RBO) of rankings constructed by ordering the empirical win probabilities $\\hat{\\pmb\\theta}$ estimated using only $N+n$ synthetic pairwise comparisons by one out of three different simulated strong LLMs $\\mathbf{\\mathcal{L}L M\\ 0.05}$ , $\\mathrm{LLM\\0.1}$ and $\\mathrm{LLM\\0.3})$ ), only $n$ synthetic pairwise comparisons by humans (HUMAN ONLY), and both $n$ synthetic pairwise comparisons by humans and $N+n$ synthetic pairwise comparisons by one out of the same three strong LLMs ( $\\mathrm{PPR}\\ 0.05$ , PPR 0.1 and PPR 0.3) for $\\alpha=0.1$ and $N+n=50000$ . Each of the strong LLMs has a different level of alignment with human preferences controlled by a noise value $u\\in\\{0.05,0.1,0.3\\}$ . RBO was computed with respect to the true ranking constructed by ordering the true win probabilities $\\pmb{\\theta}$ , for $p=0.6$ . The shaded region shows a $95\\%$ confidence interval for the RBO among all 300 repetitions. "], "img_footnote": [], "page_idx": 30}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 31}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 31}, {"type": "text", "text": "Justification: The main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope. ", "page_idx": 31}, {"type": "text", "text": "Guidelines: ", "page_idx": 31}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 31}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 31}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Justification: We discuss the limitations of our work in Section 6. ", "page_idx": 31}, {"type": "text", "text": "Guidelines: ", "page_idx": 31}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 31}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 31}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 31}, {"type": "text", "text": "Justification: We provide the proof of Theorem 4.1 in Appendix A Guidelines: ", "page_idx": 32}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 32}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 32}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 32}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 32}, {"type": "text", "text": "Justification: We provide pseudocode implementation of all the algorithms in Appendix B and describe the setup used in our experiments in Section 5 and Appendix C. In addition, we have released the code and data at https://github.com/Networks-Learning/predictionpowered-ranking. ", "page_idx": 32}, {"type": "text", "text": "Guidelines: ", "page_idx": 32}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 32}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 32}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 33}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 33}, {"type": "text", "text": "Justification: We have released the code and data at https://github.com/NetworksLearning/prediction-powered-ranking. ", "page_idx": 33}, {"type": "text", "text": "Guidelines: ", "page_idx": 33}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https://nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 33}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 33}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 33}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 33}, {"type": "text", "text": "Justification: We describe the training and test details in Section 5 and Appendix C. Guidelines: ", "page_idx": 33}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 33}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 33}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 33}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 33}, {"type": "text", "text": "Justification: We report error bars in Figure 6 in Appendix D.1, and Figure 12 in Appendix E. Guidelines: ", "page_idx": 33}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 33}, {"type": "text", "text": "", "page_idx": 34}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 34}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 34}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 34}, {"type": "text", "text": "Justification: We provide information on computer resources in Appendix C. ", "page_idx": 34}, {"type": "text", "text": "Guidelines: ", "page_idx": 34}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 34}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 34}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 34}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 34}, {"type": "text", "text": "Justification: The research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics. ", "page_idx": 34}, {"type": "text", "text": "Guidelines: ", "page_idx": 34}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 34}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 34}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 34}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 34}, {"type": "text", "text": "Justification: We discuss both potential positive societal impacts and negative social impacts of our work in Section 6. ", "page_idx": 34}, {"type": "text", "text": "Guidelines: ", "page_idx": 34}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed. • If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact. ", "page_idx": 34}, {"type": "text", "text": "• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 35}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 35}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 35}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 35}, {"type": "text", "text": "Justification: We do not release any data or models that have a high risk of misuse. ", "page_idx": 35}, {"type": "text", "text": "Guidelines: ", "page_idx": 35}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 35}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 35}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 35}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 35}, {"type": "text", "text": "Justification: The creators or original owners of assets used in the paper are properly credited, and the license and terms of use are explicitly mentioned in Appendix $\\mathbf{C}$ and properly respected. ", "page_idx": 35}, {"type": "text", "text": "Guidelines: ", "page_idx": 35}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 35}, {"type": "text", "text": "", "page_idx": 36}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 36}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 36}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 36}, {"type": "text", "text": "Justification: The code and data that we have released at https://github.com/NetworksLearning/prediction-powered-ranking contains documentation. ", "page_idx": 36}, {"type": "text", "text": "Guidelines: ", "page_idx": 36}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 36}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 36}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 36}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 36}, {"type": "text", "text": "Justification: The paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 36}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 36}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 36}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 36}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 36}, {"type": "text", "text": "Justification: The paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 36}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 36}, {"type": "text", "text": "", "page_idx": 37}]