[{"figure_path": "XkMCKoHNCD/figures/figures_4_1.jpg", "caption": "Figure 1: Projection of the first 6 PCAs. Each PCA has an interpretation from the qualitative analysis. Each plot has their respective cluster along with the average phrase of each cluster for The Big Bang Theory dialogue lines", "description": "This figure shows the projection of the first six principal components (PCAs) obtained from a principal component analysis (PCA) performed on the embeddings of dialogue lines from the TV series *The Big Bang Theory*. Each PCA is associated with a specific direction of maximum variance in the data, and the figure visualizes these directions using two-dimensional plots.  Each plot shows the projection of two PCAs, with dialogue lines clustered based on their values on these two components.  The qualitative interpretation of each PCA is provided, which is based on the characteristics of the phrases that are assigned to each cluster. The average phrase for each cluster is also displayed.", "section": "3.1 Qualitative analysis of the principal components"}, {"figure_path": "XkMCKoHNCD/figures/figures_5_1.jpg", "caption": "Figure 2: AUC curves to assess the performance of the logistic regression, by increasing the number of dimensions, in the dialogue lines's prediction for two different couples for the two Tv serie", "description": "This figure shows the Area Under the Curve (AUC) for Receiver Operating Characteristic (ROC) curves for two different character pairs from each of the two TV series (The Big Bang Theory and Friends).  The x-axis represents the number of principal components (PCAs) used as features in a logistic regression model to predict which character spoke a given line of dialogue.  The y-axis represents the AUC, a measure of the model's ability to distinguish between the two characters.  Higher AUC values indicate better performance.  The figure demonstrates how the model's predictive accuracy changes as more principal components are included, showing the relationship between feature dimensionality and classification performance for different character pairs across two distinct TV shows.", "section": "3 Results"}, {"figure_path": "XkMCKoHNCD/figures/figures_7_1.jpg", "caption": "Figure 4: Relationship between characters in The Big Bang Theory in terms of PCA19 (that distinguishes lines about meal/food related form lines about comics). The value on the arrows show the magnitude of the coefficient. Only pairings where the absolute value of the regression coefficient is greater than 0.1 are included. The person at the start of the arrow talks about comics more than they talk about food compared to the person at the end of the arrow.", "description": "This figure shows the relationships between the main characters of the TV series The Big Bang Theory regarding their talking habits about comics and food.  The analysis is based on the Principal Component Analysis (PCA) dimension 19, which separates dialogue lines about comics from those about food.  The arrows indicate the direction and magnitude of the difference. For example, an arrow from Sheldon to Penny signifies that Sheldon talks more about comics than Penny. The weight of the arrow corresponds to the absolute value of the regression coefficient. Only relationships with an absolute coefficient value exceeding 0.1 are depicted.", "section": "3.2 Character prediction"}, {"figure_path": "XkMCKoHNCD/figures/figures_11_1.jpg", "caption": "Figure 5: Projection of the two first PCAs, and their respective interpretation, with the average position for each main character of the two Tv series", "description": "This figure shows the projection of the first two principal components (PCAs) for the dialogue lines from the TV series \"The Big Bang Theory\" and \"Friends\".  Each plot displays the distribution of dialogue lines in the two-dimensional PCA space. The points are colored according to the character who spoke the line.  Additionally, the average position of each main character is marked on the plot, offering a visual comparison of the character's typical phrase characteristics in terms of PCA1 and PCA2. The axes labels provide a qualitative interpretation of what types of dialogue lines are captured by each PCA.", "section": "5.1 Average Position for each main character of the two Tv series"}, {"figure_path": "XkMCKoHNCD/figures/figures_11_2.jpg", "caption": "Figure 2: AUC curves to assess the performance of the logistic regression, by increasing the number of dimensions, in the dialogue lines's prediction for two different couples for the two Tv serie", "description": "This figure shows the AUC (Area Under the Curve) for two different character pairs from two different TV shows (The Big Bang Theory and Friends). The x-axis represents the number of principal components (PCAs) used as features in a logistic regression model to predict which character said a given line.  The y-axis represents the AUC, a measure of the model's ability to distinguish between the two characters. The plot shows that for both TV shows, the AUC generally increases as more PCAs are used, although the improvement diminishes after a certain point. This suggests that the model's predictive power is enhanced by incorporating more information, but there are diminishing returns beyond a specific number of dimensions. The difference in performance between the two TV shows is also notable, with The Big Bang Theory showing generally higher AUC values than Friends, indicating that the characters in The Big Bang Theory are more easily distinguished based on their dialogue than those in Friends.", "section": "3 Results"}, {"figure_path": "XkMCKoHNCD/figures/figures_12_1.jpg", "caption": "Figure 1: Projection of the first 6 PCAs. Each PCA has an interpretation from the qualitative analysis. Each plot has their respective cluster along with the average phrase of each cluster for The Big Bang Theory dialogue lines", "description": "This figure shows the projection of the first six principal components (PCAs) obtained from a principal component analysis (PCA) performed on sentence embeddings of dialogue lines from the TV series \"The Big Bang Theory\". Each plot represents a pair of PCAs (e.g., PCA1 and PCA2, PCA3 and PCA4, etc.).  The data points are clustered using a k-means algorithm, and each cluster is labeled with the average phrase within that cluster. The qualitative interpretation of each PCA is also given, offering insight into the semantic meaning associated with each principal component. This helps in understanding the key distinguishing features of the dialogue based on the character's language usage patterns.", "section": "3.1 Qualitative analysis of the principal components"}, {"figure_path": "XkMCKoHNCD/figures/figures_14_1.jpg", "caption": "Figure 3: Regression coefficients for each possible character pairs for the TV series The Big Bang Theory. For each pair, we conduct a logistic regression to predict if the dialogue line is more likely to be said by a character1 such that P (character1 = 1|the line is said by character1 or character2). We use the first 300 principal components in the logistic regression. Then, we assess the absolute value of each coefficient to determine their magnitude. Following this, we select the top ten coefficients for each linear predictor function. We report in this figure those coefficients, along with their corresponding dimensions. The coefficients are in decreasing order from left to right: the left side have the coefficient with the highest magnitude, the right side have the coefficients with the lowest magnitude.", "description": "This figure shows the top ten most important principal components (PCAs) for distinguishing between pairs of characters in the Big Bang Theory TV series, based on a logistic regression model.  Each row represents a character pair, and the columns list the PCAs in decreasing order of importance, as determined by the magnitude of their regression coefficients.  The sign of a coefficient indicates whether a particular PCA is more or less likely for a given character. For example, a negative coefficient for PCA19 (related to food vs. comics) in the 'Penny or Sheldon' row suggests that Penny is more likely to speak about food than Sheldon.", "section": "2.2 Character prediction"}, {"figure_path": "XkMCKoHNCD/figures/figures_15_1.jpg", "caption": "Figure 5: Projection of the two first PCAs, and their respective interpretation, with the average position for each main character of the two Tv series", "description": "This figure shows the projection of the first two principal components (PCAs) of the dialogue embeddings from the TV series \"The Big Bang Theory\" and \"Friends\".  Each point represents a dialogue line, colored according to the character who spoke it. The plot also shows the average position for each main character, giving a visual representation of how well each character's dialogue is separated in this reduced dimensional space.  The interpretation of each PCA is provided, indicating which types of phrases contribute to the major variations in the data.", "section": "5.1 Average Position for each main character of the two Tv series"}]