[{"figure_path": "me1MpmENpw/figures/figures_1_1.jpg", "caption": "Figure 1: Illustration of the reconstruction and discrimination tasks. The discrimination receiver is given the candidates in addition to the message.", "description": "This figure shows a schematic of the two main tasks used in the emergent communication experiments: reconstruction and discrimination.  In the reconstruction task (a), the sender receives an input (e.g., a number '2') and produces a message.  The receiver then uses only the message to try to reconstruct the original input. The loss is the distance between the reconstructed input and the original input. In the discrimination task (b), the sender also produces a message from an input. The receiver receives the message and a set of candidate inputs, one of which is the original input.  The receiver must then choose the original input among the candidate inputs.  The loss in this task is negative log-likelihood, representing the probability of the receiver correctly identifying the original input.", "section": "1 Introduction"}, {"figure_path": "me1MpmENpw/figures/figures_3_1.jpg", "caption": "Figure 2: Notation for the emergent communication (EC) setup.", "description": "This figure shows a schematic representation of the notation used in the paper for the emergent communication setup.  It outlines the input distribution, message space, agent parameters (sender and receiver), and the objective function used in the training process. The arrow indicates the training process that leads to optimal solutions for the sender and receiver parameters.", "section": "3 Notation and task definitions"}, {"figure_path": "me1MpmENpw/figures/figures_4_1.jpg", "caption": "Figure 3: A message describes a set of inputs. Note: the shapes and colors are not part of the input.", "description": "This figure illustrates the concept of semantic consistency in emergent communication.  Panel (a) shows the input space with three distinct types of objects (triangles, circles, and squares) visually separated into clusters. Panel (b) depicts a semantically consistent mapping, where the objects mapped to the same message (m1, m2, m3) share similar properties and are clustered together. In contrast, panel (c) shows a semantically inconsistent mapping, where objects with dissimilar properties are grouped together under the same message, thus lacking semantic consistency.", "section": "4 Semantic consistency: a prerequisite to meaningful communication"}, {"figure_path": "me1MpmENpw/figures/figures_9_1.jpg", "caption": "Figure 4: Average message purity, comparing trained models to random baselines.", "description": "This figure compares the average message purity achieved by trained models against random baselines across three different experimental setups: reconstruction, discrimination, and supervised discrimination. Message purity measures the percentage of images within an equivalence class (set of inputs mapped to the same message) that share the majority attribute value. Higher purity suggests better semantic consistency and more meaningful communication. The results show that the reconstruction setup achieves significantly higher purity than the other two setups, indicating its stronger capacity for encoding meaningful information in generated messages.", "section": "7.1 Semantic consistency, compositionality and task performance"}, {"figure_path": "me1MpmENpw/figures/figures_26_1.jpg", "caption": "Figure 5: Encoder and Decoder architectures used on Shapes.", "description": "This figure shows the architectures of the encoder and decoder used in the Shapes dataset experiments.  The encoder takes an image as input and outputs a latent vector, while the decoder takes a latent vector as input and outputs a reconstructed image.  Both encoder and decoder consist of multiple convolutional and transposed convolutional layers, batch normalization layers, and LeakyReLU activation functions.", "section": "7 Experiments"}, {"figure_path": "me1MpmENpw/figures/figures_27_1.jpg", "caption": "Figure 1: Illustration of the reconstruction and discrimination tasks. The discrimination receiver is given the candidates in addition to the message.", "description": "This figure illustrates the two main tasks in emergent communication: reconstruction and discrimination.  The reconstruction task involves the sender generating a message based on an input, and the receiver reconstructing the original input from the message. The discrimination task is similar, but the receiver also receives a set of candidate inputs and must choose the correct one based on the message.  The figure visually depicts these processes, highlighting the differences between the two tasks.", "section": "1 Introduction"}, {"figure_path": "me1MpmENpw/figures/figures_28_1.jpg", "caption": "Figure 7: Reconstruction (top) and discrimination (bottom) examples on Shapes", "description": "This figure shows examples of the reconstruction and discrimination tasks performed on the Shapes dataset.  The top half displays reconstruction results. For each example, the original image is shown alongside the image reconstructed by the receiver based solely on the message generated by the sender.  The bottom half shows the discrimination task, where the receiver selects the correct image from a set of candidates. For each example, the input image is shown alongside the candidates. The receiver's prediction and associated score are also provided.", "section": "7 Experiments"}, {"figure_path": "me1MpmENpw/figures/figures_28_2.jpg", "caption": "Figure 8: Reconstruction (top) and discrimination (bottom) examples on MNIST", "description": "This figure shows examples of the reconstruction and discrimination tasks on the MNIST dataset.  The top row displays the original MNIST digit image alongside the reconstructed image generated by the model from a message.  The bottom row shows the input digit image used for generating a message and the scores the model produces for each of the presented candidates, highlighting how well the model identifies the original input digit image among other candidates.", "section": "7 Experiments"}, {"figure_path": "me1MpmENpw/figures/figures_30_1.jpg", "caption": "Figure 9: Message purity per attribute and game type.", "description": "This figure shows the purity of messages for different attributes (color, shape, and maximum purity across all attributes) in reconstruction and discrimination games.  The results show that the reconstruction game generally produces higher purity, indicating that messages are more semantically consistent and informative in this setting, compared to the discrimination game.", "section": "7.2 Message purity"}]