[{"figure_path": "0bFXbEMz8e/tables/tables_7_1.jpg", "caption": "Table 1: Results for material generation on the MP-20 dataset. Stability rate is the percentage of generated materials with Ehull < 0.0 & N-ary ≥ 2.", "description": "This table presents a comparison of FlowLLM's performance against other state-of-the-art methods for material generation using the MP-20 dataset.  It shows various metrics, including validity, coverage (recall and precision of structural compositions), Wasserstein distance (comparing generated and ground truth materials based on properties and number of unique elements), stability rate (percentage of generated materials that are thermodynamically stable), and SUN rate (percentage of stable, unique, and novel materials generated).  The different rows represent different parameter settings or models, highlighting FlowLLM's superior performance across various metrics, particularly stability and SUN rate.", "section": "5.3 Results"}, {"figure_path": "0bFXbEMz8e/tables/tables_8_1.jpg", "caption": "Table 2: Comparison of generated and corresponding ground state structures from the CHGNet relaxation. Compared to FlowMM, FlowLLM generates structures much closer to the ground state.", "description": "This table compares the generated structures from FlowMM and FlowLLM models to their corresponding ground state structures after relaxation using CHGNet.  The metrics used for comparison are Match Rate (percentage of generated structures similar to their ground state structures), RMSD (root mean square deviation between generated and ground state structures), Δ-Energy (energy difference between generated and ground state structures), and Num Steps (number of optimization steps needed to pre-relax the generated structure using CHGNet). The results demonstrate that FlowLLM generates structures significantly closer to their ground state compared to FlowMM, indicating improved model performance.", "section": "5.3 Results"}, {"figure_path": "0bFXbEMz8e/tables/tables_13_1.jpg", "caption": "Table 1: Results for material generation on the MP-20 dataset. Stability rate is the percentage of generated materials with Ehull < 0.0 & N-ary ≥ 2.", "description": "This table presents the results of material generation experiments using several methods on the MP-20 dataset.  The key metrics are Validity, Coverage (the percentage of the material space covered), Structural Composition (Recall and Precision measuring how well the generated structures match the real ones),  weighted distance, Stability Rate (percentage of generated materials that are thermodynamically stable), and SUN Rate (percentage of stable, unique, and novel materials). The table compares the performance of FlowLLM against existing state-of-the-art methods such as CDVAE, DiffCSP, FlowMM, and CrystalLLM, showing that FlowLLM significantly outperforms the others on stability and SUN rates.", "section": "5.3 Results"}, {"figure_path": "0bFXbEMz8e/tables/tables_14_1.jpg", "caption": "Table 4: Proxy metrics for a FlowLLM trained with different levels of random gaussian noise added to continuous values predicted by the LLM. Added noise increases the support of the base distribution, but we do not see an appreciable difference in the metrics.", "description": "This table presents the results of an ablation study on the impact of adding Gaussian noise to continuous values predicted by the LLM in the FlowLLM model.  Four different noise standard deviations (0, 0.01, 0.02, and 0.04) were tested. The metrics evaluated were Validity (Structural and Composition), and Coverage (Recall and Precision).  The results show that adding noise did not significantly impact these proxy metrics, suggesting that the LLM's base distribution is relatively robust to noise.", "section": "5.3 Results"}]