[{"figure_path": "LfC5rujSTk/tables/tables_2_1.jpg", "caption": "Table 1: Categorization of constraint types with exemplar API names, description, and examples.", "description": "This table categorizes different types of constraints found in data science APIs, providing examples of APIs that exhibit each constraint type.  The categories include Equality (where values must match exactly), Inequality (where values must be greater or less than), Arithmetic (constraints involving arithmetic operations), Set-related (constraints based on set properties), and Complex arithmetic (more intricate combinations of operations). For each category, example APIs are listed, and sample constraints are shown to illustrate their application.", "section": "2 Study Approach"}, {"figure_path": "LfC5rujSTk/tables/tables_8_1.jpg", "caption": "Table 2: DSEVAL benchmark result. Each column shows both the accuracy/diversity and ranking (2).", "description": "This table presents the results of the DSEVAL benchmark, which evaluates the performance of eight different LLMs on various data science APIs with different difficulty levels.  Each LLM's performance is assessed based on its accuracy and diversity in generating correct parameters for PyTorch and NumPy APIs. The table shows accuracy scores for easy, medium, and hard difficulty levels, as well as diversity scores and rankings for each model across these difficulty levels. The rankings indicate the relative performance of each LLM compared to others.", "section": "4.4 DSEVAL: A public benchmark for numerical DS API constraints"}, {"figure_path": "LfC5rujSTk/tables/tables_16_1.jpg", "caption": "Table 3: List of APIs and corresponding constraints used in DSEVAL.", "description": "This table lists the twelve APIs used in the DSEVAL benchmark, their corresponding constraints, and the category to which each constraint belongs.  The APIs are drawn from PyTorch and NumPy, and the constraints encompass various types, including equality, inequality, and arithmetic relationships between API parameters and input data properties.  This table is crucial for understanding the scope and complexity of the constraints the LLMs were evaluated on in the DSEVAL benchmark.", "section": "Study Approach"}, {"figure_path": "LfC5rujSTk/tables/tables_17_1.jpg", "caption": "Table 4: List of APIs and corresponding common input range used in DSEVAL.", "description": "This table lists the 12 APIs used in the DSEVAL benchmark, along with the range of common input values for each API's parameters.  The purpose is to define the input space for testing the LLMs' ability to handle various input scenarios, thus controlling the difficulty level of the experiments. Each API has several parameters, and the table provides a common range for those parameters which are not directly involved in the constraint being tested.", "section": "3.1 Subjects"}]