[{"figure_path": "MfGRUVFtn9/tables/tables_6_1.jpg", "caption": "Table 1: Comparison with the SOTA defenses on CIFAR-10 dataset with PreAct-ResNet18 (%).", "description": "This table compares the proposed Two-Stage Backdoor Defense (TSBD) method with eight state-of-the-art (SOTA) backdoor defense methods on the CIFAR-10 dataset using the PreAct-ResNet18 model.  It evaluates the performance of each method against eight different backdoor attacks using three metrics: Accuracy on clean data (ACC), Attack Success Rate (ASR), and Defense Effectiveness Rating (DER).  Higher ACC and DER values, along with lower ASR, indicate better defense performance. The table provides a quantitative comparison of the effectiveness of TSBD against other SOTA methods.", "section": "4.2 Main Results"}, {"figure_path": "MfGRUVFtn9/tables/tables_7_1.jpg", "caption": "Table 1: Comparison with the SOTA defenses on CIFAR-10 dataset with PreAct-ResNet18 (%).", "description": "This table compares the performance of the proposed Two-Stage Backdoor Defense (TSBD) method against eight state-of-the-art (SOTA) backdoor defense methods on the CIFAR-10 dataset using the PreAct-ResNet18 model.  The comparison is based on three metrics: Accuracy on clean data (ACC), Attack Success Rate (ASR), and Defense Effectiveness Rating (DER).  Eight different backdoor attacks are evaluated.", "section": "4.2 Main Results"}, {"figure_path": "MfGRUVFtn9/tables/tables_8_1.jpg", "caption": "Table 3: Comparison of different reinitialization schemes on CIFAR-10 with PreAct-ResNet18 (%)", "description": "This table compares three different reinitialization schemes (V1, V2, and V3 - TSBD's method) on CIFAR-10 using PreAct-ResNet18. It evaluates the effectiveness of these schemes against four different backdoor attacks (BadNets, Blended, LF, and SSBA).  For each scheme, it shows the Accuracy (ACC↑) and Attack Success Rate (ASR↓).  The results demonstrate that TSBD's reinitialization strategy (V3) achieves significantly higher accuracy while maintaining a near-zero ASR compared to other methods. This highlights the superior performance of the proposed two-stage defense method.", "section": "4.3 Ablation Studies"}, {"figure_path": "MfGRUVFtn9/tables/tables_8_2.jpg", "caption": "Table 4: Comparison of different fine-tuning schemes on CIFAR-10 with PreAct-ResNet18 (%).", "description": "This table compares the performance of three different fine-tuning approaches on the CIFAR-10 dataset using the PreAct-ResNet18 model.  The three approaches are: No fine-tuning (No-FT), vanilla fine-tuning (Vanilla-FT), and the proposed activeness-aware fine-tuning (Aa-FT). The table shows the accuracy (ACC↑) and attack success rate (ASR↓) for each method across four different backdoor attacks.  The results demonstrate the effectiveness of the proposed Aa-FT in improving both accuracy and reducing the attack success rate compared to the other methods.", "section": "4.3 Ablation Studies"}, {"figure_path": "MfGRUVFtn9/tables/tables_8_3.jpg", "caption": "Table 1: Comparison with the SOTA defenses on CIFAR-10 dataset with PreAct-ResNet18 (%).", "description": "This table compares the performance of the proposed Two-Stage Backdoor Defense (TSBD) method against eight state-of-the-art (SOTA) backdoor defense methods on the CIFAR-10 dataset using the PreAct-ResNet18 model.  The comparison is based on three metrics: Accuracy on clean data (ACC), Attack Success Rate (ASR), and Defense Effectiveness Rating (DER).  The table shows the performance of each method under eight different backdoor attacks, highlighting the superior performance of TSBD in terms of achieving high ACC and DER while maintaining a low ASR.", "section": "4.2 Main Results"}, {"figure_path": "MfGRUVFtn9/tables/tables_16_1.jpg", "caption": "Table 1: Comparison with the SOTA defenses on CIFAR-10 dataset with PreAct-ResNet18 (%).", "description": "This table compares the proposed Two-Stage Backdoor Defense (TSBD) method with eight state-of-the-art (SOTA) backdoor defense methods on the CIFAR-10 dataset using the PreAct-ResNet18 model.  It evaluates the performance of each method across eight different backdoor attacks. The table presents the accuracy on clean data (ACC), attack success rate (ASR), and defense effectiveness rating (DER) for each method and attack.  Higher ACC and DER, and lower ASR indicate better defense performance.", "section": "4.2 Main Results"}, {"figure_path": "MfGRUVFtn9/tables/tables_16_2.jpg", "caption": "Table 1: Comparison with the SOTA defenses on CIFAR-10 dataset with PreAct-ResNet18 (%).", "description": "This table compares the proposed Two-Stage Backdoor Defense (TSBD) method with eight state-of-the-art (SOTA) backdoor defense methods on the CIFAR-10 dataset using the PreAct-ResNet18 model.  It evaluates the performance of each method across eight different backdoor attacks using three metrics: Accuracy on clean data (ACC), Attack Success Rate (ASR), and Defense Effectiveness Rating (DER).  Higher ACC and DER values, along with lower ASR values, indicate better defense performance. The table allows for a quantitative comparison of TSBD against existing methods.", "section": "4.2 Main Results"}, {"figure_path": "MfGRUVFtn9/tables/tables_18_1.jpg", "caption": "Table 1: Comparison with the SOTA defenses on CIFAR-10 dataset with PreAct-ResNet18 (%).", "description": "This table compares the performance of the proposed Two-Stage Backdoor Defense (TSBD) method against eight state-of-the-art (SOTA) backdoor defense methods on the CIFAR-10 dataset using the PreAct-ResNet18 model.  The comparison is based on three metrics: Accuracy on clean data (ACC), Attack Success Rate (ASR), and Defense Effectiveness Rating (DER).  Each row represents a different backdoor attack, and each column represents a different defense method or the baseline (no defense).  Higher ACC and DER values, and lower ASR values indicate better defense performance.", "section": "4.2 Main Results"}, {"figure_path": "MfGRUVFtn9/tables/tables_18_2.jpg", "caption": "Table 1: Comparison with the SOTA defenses on CIFAR-10 dataset with PreAct-ResNet18 (%).", "description": "This table compares the performance of the proposed Two-Stage Backdoor Defense (TSBD) method against eight state-of-the-art (SOTA) backdoor defense methods on the CIFAR-10 dataset using the PreAct-ResNet18 model.  The comparison is based on three metrics: Accuracy on clean data (ACC), Attack Success Rate (ASR), and Defense Effectiveness Rating (DER).  Each row represents a different backdoor attack, and the columns show the performance of each defense method on that attack.  Higher ACC and DER values and lower ASR values indicate better defense performance.", "section": "4.2 Main Results"}, {"figure_path": "MfGRUVFtn9/tables/tables_19_1.jpg", "caption": "Table 10: Performance on CIFAR-10 with ViT-b-16 (%).", "description": "This table compares the performance of different defense methods on the CIFAR-10 dataset using the ViT-b-16 model. The table shows the accuracy (ACC↑) and attack success rate (ASR↓) for different attacks (Input-aware and WaNet).  It demonstrates the effectiveness of the proposed TSBD method compared to other state-of-the-art defenses (CLP, ANP).", "section": "K Performance on Scaled-Up Experiments"}, {"figure_path": "MfGRUVFtn9/tables/tables_19_2.jpg", "caption": "Table 1: Comparison with the SOTA defenses on CIFAR-10 dataset with PreAct-ResNet18 (%).", "description": "This table compares the performance of the proposed Two-Stage Backdoor Defense (TSBD) method against other state-of-the-art (SOTA) backdoor defense methods on the CIFAR-10 dataset using the PreAct-ResNet18 model.  The table presents results for eight different backdoor attacks.  For each attack and defense method, the table shows the accuracy on clean data (ACC), attack success rate (ASR), and defense effectiveness rating (DER).  Higher ACC and DER values, and lower ASR values, indicate better performance.", "section": "4.2 Main Results"}, {"figure_path": "MfGRUVFtn9/tables/tables_19_3.jpg", "caption": "Table 1: Comparison with the SOTA defenses on CIFAR-10 dataset with PreAct-ResNet18 (%).", "description": "This table compares the performance of the proposed Two-Stage Backdoor Defense (TSBD) method against eight state-of-the-art (SOTA) backdoor defense methods on the CIFAR-10 dataset using the PreAct-ResNet18 model.  The comparison is based on three metrics: Accuracy on clean data (ACC), Attack Success Rate (ASR), and Defense Effectiveness Rating (DER).  Eight different backdoor attacks are evaluated.  Higher ACC and DER, and lower ASR, indicate better defense performance.  The table helps demonstrate the superior performance of TSBD compared to other SOTA methods.", "section": "4.2 Main Results"}]