[{"figure_path": "jZv9A8Tg9p/figures/figures_1_1.jpg", "caption": "Figure 1: Arrows indicate direct effects. Since Ability is not directly observed and is correlated with education, the influence that should be attributed to Ability (arrow 1) is erroneously attributed to Education (arrow 2) in feature attribution. To fix this issue, Parental Education can be used as an instrumental variable for investigating the true impact of Education on Income.", "description": "This figure illustrates the problem of unobservable confounders in feature attribution.  Ability, an unobserved variable, influences both Education and Income. Because Ability and Education are correlated, standard feature attribution methods mistakenly attribute the effect of Ability on Income to Education.  The solution proposed is to use Parental Education as an instrumental variable, which affects Education but not directly Income, to isolate the true effect of Education on Income.", "section": "Motivation example"}, {"figure_path": "jZv9A8Tg9p/figures/figures_7_1.jpg", "caption": "Figure 2: Evaluation results on synthetic Dataset A.", "description": "This figure displays the evaluation results for four feature attribution methods (IV-BSHAP, SHAP, IV-IG, and IG) on synthetic Dataset A.  The results are presented as box plots, showing the distribution of errors in feature attribution for each method across various levels of feature deviation (0.125, 0.25, 0.375, 0.5) and different values of parameter p (0.2, 0.4, 0.6, 0.8, 1.0).  The box plots show the median, quartiles, and range of the errors. This visual representation allows for a comparison of the performance of the different methods under varying conditions, demonstrating the effectiveness of the proposed data-faithful feature attribution methods (IV-BSHAP and IV-IG) in mitigating the effects of unobservable confounders.", "section": "5 Experiments"}, {"figure_path": "jZv9A8Tg9p/figures/figures_7_2.jpg", "caption": "Figure 2: Evaluation results on synthetic Dataset A.", "description": "This figure presents the error rates of different feature attribution methods (IV-BSHAP, SHAP, IV-IG, IG) on synthetic dataset A, categorized by the feature deviation and the parameter p (which controls the noise level).  Each box plot represents the distribution of errors for each method at each combination of feature deviation and parameter p. The plot aims to show the effectiveness of the proposed data-faithful feature attribution method (IV-BSHAP, IV-IG) compared to the standard methods (SHAP, IG) in reducing errors in the presence of unobservable confounders.", "section": "5.1 Experiments on Synthetic Datasets"}, {"figure_path": "jZv9A8Tg9p/figures/figures_7_3.jpg", "caption": "Figure 1: Arrows indicate direct effects. Since Ability is not directly observed and is correlated with education, the influence that should be attributed to Ability (arrow 1) is erroneously attributed to Education (arrow 2) in feature attribution. To fix this issue, Parental Education can be used as an instrumental variable for investigating the true impact of Education on Income.", "description": "This figure illustrates a causal diagram showing the relationship between education, income, and an unobservable confounder, ability.  It highlights the problem of misattribution in feature attribution methods. Because ability is correlated with education, and directly affects income, feature attribution methods may mistakenly attribute the effect of ability on income to education. The solution shown is to use parental education as an instrumental variable, which affects education but not income directly, to isolate the true effect of education on income.", "section": "Motivation example"}, {"figure_path": "jZv9A8Tg9p/figures/figures_22_1.jpg", "caption": "Figure 2: Evaluation results on synthetic Dataset A.", "description": "This figure displays the evaluation results for four different feature attribution methods (IV-BSHAP, SHAP, IV-IG, IG) on synthetic dataset A.  Each subplot represents a different level of feature deviation (0.125, 0.25, 0.375, 0.5), and within each subplot are boxplots showing the error of each method at that deviation level, for five different values of parameter p (0.2, 0.4, 0.6, 0.8, 1.0).  The boxplots help visualize the distribution of the errors.  The figure is designed to demonstrate how the proposed methods (IV-BSHAP, IV-IG) perform against baseline methods (SHAP, IG) under different conditions.", "section": "5.1 Experiments on Synthetic Datasets"}, {"figure_path": "jZv9A8Tg9p/figures/figures_22_2.jpg", "caption": "Figure 2: Evaluation results on synthetic Dataset A.", "description": "The figure displays the evaluation results on synthetic dataset A for various feature deviation values (0.125, 0.25, 0.375, 0.5) and different values of parameter p (0.2, 0.4, 0.6, 0.8, 1.0).  It shows the error in attribution values for four different methods: IV-BSHAP, SHAP, IV-IG, and IG. The box plots illustrate the distribution of errors for each method across different scenarios, allowing comparison of their accuracy in feature attribution.", "section": "5.1 Experiments on Synthetic Datasets"}, {"figure_path": "jZv9A8Tg9p/figures/figures_22_3.jpg", "caption": "Figure 2: Evaluation results on synthetic Dataset A.", "description": "The figure shows the error in feature attribution for different feature deviation values on synthetic dataset A. The error is calculated as the absolute difference between the attribution values from the proposed method and the ground truth. The proposed method is shown to have lower error than SHAP and IG in most cases.", "section": "5.1 Experiments on Synthetic Datasets"}, {"figure_path": "jZv9A8Tg9p/figures/figures_23_1.jpg", "caption": "Figure 2: Evaluation results on synthetic Dataset A.", "description": "This figure presents the evaluation results on synthetic Dataset A, comparing the performance of IV-BSHAP, SHAP, and IV-IG across different feature deviations (0.125, 0.25, 0.375, 0.5) and different values of p (0.2, 0.4, 0.6, 0.8, 1.0). Each box plot shows the distribution of errors for a specific feature deviation and p value.  The figure visually demonstrates the effectiveness of the proposed methods (IV-BSHAP and IV-IG) compared to the baseline method (SHAP) in reducing errors, especially when the feature deviation and p values are higher.", "section": "5.1 Experiments on Synthetic Datasets"}]