{"importance": "This paper is crucial for researchers working on **model training stability and practical operations like model merging**. It challenges the existing understanding of Linear Mode Connectivity (LMC) by investigating tree-based models, offering valuable insights into architecture-specific invariances and their impact on LMC. The findings contribute to the broader understanding of non-convex optimization and pave the way for more efficient and robust machine learning practices.", "summary": "Achieving Linear Mode Connectivity (LMC) in tree ensembles requires considering subtree flip and splitting order invariances, in addition to tree permutation invariance, ensuring consistent performance for interpolated models.", "takeaways": ["Linear Mode Connectivity (LMC) can be achieved in tree ensembles.", "Subtree flip and splitting order invariances are crucial for LMC in tree ensembles.", "A novel decision list-based tree architecture eliminates the need for additional invariances beyond tree permutation to achieve LMC."], "tldr": "Many machine learning models trained using gradient methods exhibit a non-trivial characteristic: models trained from different random initializations become functionally equivalent, even though their parameter representations differ. This phenomenon, Linear Mode Connectivity (LMC), is crucial for the success of non-convex optimization and practical parameter-based operations such as model merging. While LMC has been achieved for neural networks, its attainment for other models remains an open question.\nThis paper addresses this gap by focusing on soft tree ensembles, commonly used differentiable tree-based models. The authors demonstrate that achieving LMC in soft tree ensembles requires not only tree permutation invariance, which exists in neural networks, but also two additional invariances: subtree flip invariance and splitting order invariance. These invariances are unique to tree architectures.  Furthermore, they show that by designing a decision list-based tree architecture, LMC can be achieved even without these additional invariances.", "affiliation": "string", "categories": {"main_category": "AI Theory", "sub_category": "Optimization"}, "podcast_path": "RdAfUp4LcD/podcast.wav"}