[{"figure_path": "az1SLLsmdR/tables/tables_6_1.jpg", "caption": "Table 1: Comparison with the SOTA baseline dataset condensation methods. SRe²L and RDED utilize ResNet-18 for data synthesis, whereas G-VBSM and EDC leverage various backbones for this purpose.", "description": "This table compares the performance of the proposed EDC method with three state-of-the-art (SOTA) baseline dataset condensation methods (SRe²L, G-VBSM, and RDED) across various datasets (CIFAR-10, CIFAR-100, Tiny-ImageNet, ImageNet-10, and ImageNet-1k) and different image per class (IPC) values.  The table highlights EDC's superior accuracy compared to the baselines, particularly in scenarios with high compression ratios (low IPC). The use of different backbones for G-VBSM and EDC is also noted.", "section": "4 Experiments"}, {"figure_path": "az1SLLsmdR/tables/tables_6_2.jpg", "caption": "Table 1: Comparison with the SOTA baseline dataset condensation methods. SRe²L and RDED utilize ResNet-18 for data synthesis, whereas G-VBSM and EDC leverage various backbones for this purpose.", "description": "This table compares the performance of the proposed EDC method against three state-of-the-art (SOTA) baseline methods for dataset condensation across different datasets (CIFAR-10, CIFAR-100, Tiny-ImageNet, ImageNet-10, and ImageNet-1k) and image processing compression (IPC) rates.  The table highlights the superior accuracy achieved by EDC, especially at higher IPC values, demonstrating its efficiency and effectiveness in various settings and model architectures.", "section": "Experiments"}, {"figure_path": "az1SLLsmdR/tables/tables_7_1.jpg", "caption": "Table 3: Ablation studies on ImageNet-1k with IPC 10. Left: Explore the influence of the slowdown coefficient with CONFIG C. Right: Evaluate the effectiveness of real image initialization (), smoothing LR schedule () and smaller batch size () with  = 2.", "description": "This ablation study on ImageNet-1k with an IPC of 10 investigates the impact of several design choices on model performance.  The left half of the table shows the effect of varying the slowdown coefficient (ζ) in the smoothing learning rate schedule on ResNet-18, ResNet-50, and ResNet-101 architectures. The right half evaluates the combined effects of real image initialization, smoothing learning rate schedule, and a smaller batch size, showing the performance improvements achieved through these modifications.", "section": "4 Experiments"}, {"figure_path": "az1SLLsmdR/tables/tables_7_2.jpg", "caption": "Table 4: Ablation studies on ImageNet-1k with IPC 10. Investigate the potential effects of several factors, including loss type, loss weight, β, and τ, amid flatness regularization (1).", "description": "This table presents ablation study results on ImageNet-1k with an IPC of 10.  It examines the impact of different choices in the flatness regularization strategy on model performance across various network architectures (ResNet-18, ResNet-50, DenseNet-121).  Specifically, it investigates the effects of varying the loss type (LFR, L'FR, vanilla SAM), loss weight, and hyperparameters β and τ on the final accuracy achieved.", "section": "3.2 Our Solutions"}, {"figure_path": "az1SLLsmdR/tables/tables_8_1.jpg", "caption": "Table 5: Ablation studies on ImageNet-1k with IPC 10. Evaluate the effectiveness of several design choices, including soft category-aware matching (), weak augmentation () and EMA-based evaluation ().", "description": "This table presents the ablation study results on ImageNet-1k with an IPC of 10. It investigates the impact of several design choices on the model's performance.  The design choices include soft category-aware matching (parameter α), weak augmentation (scale parameter ζ), and EMA-based evaluation. The table shows the Top-1 accuracy achieved by ResNet-18, ResNet-50, and ResNet-101 models under different configurations of these design choices. Each row represents a different combination of the design choices, allowing for an analysis of their individual and combined effects on the model's accuracy.", "section": "4.2 Ablation Studies"}, {"figure_path": "az1SLLsmdR/tables/tables_12_1.jpg", "caption": "Table 1: Comparison with the SOTA baseline dataset condensation methods. SRe2L and RDED utilize ResNet-18 for data synthesis, whereas G-VBSM and EDC leverage various backbones for this purpose.", "description": "This table compares the proposed EDC method with three state-of-the-art (SOTA) baseline dataset condensation methods (SRe2L, G-VBSM, and RDED) across various datasets (CIFAR-10, CIFAR-100, Tiny-ImageNet, ImageNet-10, and ImageNet-1k) and different image per class (IPC) values.  It shows the top-1 accuracy achieved by each method on each dataset and IPC. Notably, it highlights that while SRe2L and RDED use ResNet-18 for their data synthesis, G-VBSM and EDC utilize multiple different backbone network architectures.", "section": "Experiments"}, {"figure_path": "az1SLLsmdR/tables/tables_12_2.jpg", "caption": "Table 1: Comparison with the SOTA baseline dataset condensation methods. SRe²L and RDED utilize ResNet-18 for data synthesis, whereas G-VBSM and EDC leverage various backbones for this purpose.", "description": "This table compares the performance of the proposed Elucidating Dataset Condensation (EDC) method against state-of-the-art (SOTA) baseline methods for dataset condensation.  It shows the top-1 accuracy achieved on various datasets (CIFAR-10, CIFAR-100, Tiny-ImageNet, ImageNet-10, and ImageNet-1k) using different Image Processing Counts (IPC) values and different network architectures (ResNet-18, ResNet-50, ResNet-101, MobileNet-V2). The results demonstrate that EDC outperforms SOTA methods across various datasets, IPCs, and model architectures.  Note that SRe²L and RDED use ResNet-18 for data synthesis, while G-VBSM and EDC use a variety of backbone networks.", "section": "Experiments"}, {"figure_path": "az1SLLsmdR/tables/tables_12_3.jpg", "caption": "Table 1: Comparison with the SOTA baseline dataset condensation methods. SRe2L and RDED utilize ResNet-18 for data synthesis, whereas G-VBSM and EDC leverage various backbones for this purpose.", "description": "This table compares the performance of the proposed Elucidating Dataset Condensation (EDC) method with state-of-the-art (SOTA) baseline methods for dataset condensation.  The comparison is made across different datasets (CIFAR-10, CIFAR-100, Tiny-ImageNet, ImageNet-10, and ImageNet-1k) and at various Image Per Class (IPC) values, representing different compression ratios.  It highlights EDC's superior accuracy and efficiency compared to SOTA methods, especially at higher compression ratios (lower IPC).  Note that while SRe2L and RDED use ResNet-18 for data synthesis, EDC and G-VBSM explore the use of various backbones.", "section": "Experiments"}, {"figure_path": "az1SLLsmdR/tables/tables_12_4.jpg", "caption": "Table 1: Comparison with the SOTA baseline dataset condensation methods. SRe²L and RDED utilize ResNet-18 for data synthesis, whereas G-VBSM and EDC leverage various backbones for this purpose.", "description": "This table compares the performance of the proposed Elucidate Dataset Condensation (EDC) method with state-of-the-art (SOTA) baseline methods for dataset condensation.  It shows the top-1 accuracy achieved on various datasets (CIFAR-10, CIFAR-100, Tiny-ImageNet, ImageNet-10, and ImageNet-1k) using different image per class (IPC) values. The table also highlights that while SOTA methods like SRe2L and RDED use ResNet-18 for data synthesis, EDC utilizes a variety of backbones, demonstrating its adaptability and superior performance.", "section": "Experiments"}, {"figure_path": "az1SLLsmdR/tables/tables_12_5.jpg", "caption": "Table 1: Comparison with the SOTA baseline dataset condensation methods. SRe²L and RDED utilize ResNet-18 for data synthesis, whereas G-VBSM and EDC leverage various backbones for this purpose.", "description": "This table compares the proposed Elucidating Dataset Condensation (EDC) method with other state-of-the-art (SOTA) dataset condensation methods.  The comparison is made across several datasets (CIFAR-10, CIFAR-100, Tiny-ImageNet, ImageNet-10, and ImageNet-1k) and different image processing computation (IPC) values (1, 10, 50).  The table shows the top-1 accuracy achieved by each method for each dataset and IPC. Importantly, it highlights that EDC outperforms the other methods in almost all scenarios, underscoring its effectiveness. The table also notes that SRe²L and RDED use ResNet-18 for the data synthesis process, whereas G-VBSM and EDC utilize a broader range of backbones, adding to the versatility of the EDC approach.", "section": "Experiments"}, {"figure_path": "az1SLLsmdR/tables/tables_12_6.jpg", "caption": "Table 1: Comparison with the SOTA baseline dataset condensation methods. SRe²L and RDED utilize ResNet-18 for data synthesis, whereas G-VBSM and EDC leverage various backbones for this purpose.", "description": "This table compares the performance of the proposed EDC method with other state-of-the-art (SOTA) dataset condensation methods across several datasets (CIFAR-10, CIFAR-100, Tiny-ImageNet, ImageNet-10, and ImageNet-1k) at different IPC (Images Per Class) values.  It shows the top-1 accuracy achieved by each method, highlighting the superior performance of EDC across various datasets and model architectures (ResNet-18, ResNet-50, ResNet-101, and MobileNet-V2).  Note that SRe2L and RDED used ResNet-18 for data synthesis, while G-VBSM and EDC utilized multiple backbones.", "section": "Experiments"}, {"figure_path": "az1SLLsmdR/tables/tables_13_1.jpg", "caption": "Table 1: Comparison with the SOTA baseline dataset condensation methods. SRe²L and RDED utilize ResNet-18 for data synthesis, whereas G-VBSM and EDC leverage various backbones for this purpose.", "description": "This table compares the performance of the proposed Elucidate Dataset Condensation (EDC) method with state-of-the-art (SOTA) baseline methods for dataset condensation on various datasets and image classification tasks.  It shows the top-1 accuracy achieved by different methods on several datasets (CIFAR-10, CIFAR-100, Tiny-ImageNet, ImageNet-10, and ImageNet-1k) at different Image Per Class (IPC) ratios.  The table highlights that EDC outperforms SOTA methods, especially at lower IPC values (higher compression ratios), demonstrating its superior efficiency and effectiveness in transferring critical attributes to smaller synthetic datasets.", "section": "Experiments"}, {"figure_path": "az1SLLsmdR/tables/tables_13_2.jpg", "caption": "Table 1: Comparison with the SOTA baseline dataset condensation methods. SRe²L and RDED utilize ResNet-18 for data synthesis, whereas G-VBSM and EDC leverage various backbones for this purpose.", "description": "This table compares the proposed Elucidating Dataset Condensation (EDC) method with other state-of-the-art (SOTA) dataset condensation methods.  It shows the top-1 accuracy achieved on various datasets (CIFAR-10, CIFAR-100, Tiny-ImageNet, ImageNet-10, and ImageNet-1k) at different IPC (Images Per Class) values.  The table highlights EDC's superior performance across different datasets and model architectures (ResNet-18, ResNet-50, ResNet-101, MobileNet-V2), particularly at higher compression ratios (lower IPC values). It also notes that while some SOTA methods use a single model architecture (ResNet-18), EDC uses a variety of models for comparison.", "section": "Experiments"}, {"figure_path": "az1SLLsmdR/tables/tables_13_3.jpg", "caption": "Table 1: Comparison with the SOTA baseline dataset condensation methods. SRe²L and RDED utilize ResNet-18 for data synthesis, whereas G-VBSM and EDC leverage various backbones for this purpose.", "description": "This table compares the performance of the proposed Elucidate Dataset Condensation (EDC) method with three state-of-the-art (SOTA) baseline methods (SRe²L, G-VBSM, and RDED) for dataset condensation on various datasets (CIFAR-10, CIFAR-100, Tiny-ImageNet, ImageNet-10, and ImageNet-1k) and different image processing counts (IPC).  The table shows that EDC consistently outperforms the other methods across all datasets and IPCs. Note that SRe²L and RDED use ResNet-18 for data synthesis, while G-VBSM and EDC use a variety of backbones.", "section": "Experiments"}, {"figure_path": "az1SLLsmdR/tables/tables_13_4.jpg", "caption": "Table 1: Comparison with the SOTA baseline dataset condensation methods. SRe²L and RDED utilize ResNet-18 for data synthesis, whereas G-VBSM and EDC leverage various backbones for this purpose.", "description": "This table compares the performance of the proposed Elucidating Dataset Condensation (EDC) method against state-of-the-art (SOTA) baseline dataset condensation methods, namely SRe²L, G-VBSM, and RDED.  The comparison is done across various datasets (CIFAR-10, CIFAR-100, Tiny-ImageNet, ImageNet-10, and ImageNet-1k) and at different Image Per Class (IPC) values.  It highlights EDC's superior accuracy and efficiency, especially at higher compression ratios (lower IPC). The use of ResNet-18 for the SOTA baselines vs. varying backbones for EDC is also noted.", "section": "Experiments"}, {"figure_path": "az1SLLsmdR/tables/tables_13_5.jpg", "caption": "Table 11: Ablation studies on CIFAR-10 with IPC 10. With the remaining settings are the same as those of G-VBSM, our new backbone setting achieves better performance.", "description": "This ablation study investigates the impact of different numbers of backbones on the performance of G-VBSM for CIFAR-10 dataset with IPC 10.  It compares the original 5 backbones used in G-VBSM against using 100 backbones (MTT) and a new setting of 8 backbones to show the optimal backbone combination for better performance.  The results demonstrate that the new backbone setting improves the accuracy across ResNet-18, AlexNet and VGG11-BN.", "section": "G.1 Backbone Choices of Data Synthesis on ImageNet-1k"}, {"figure_path": "az1SLLsmdR/tables/tables_22_1.jpg", "caption": "Table 12: Ablation studies on ImageNet-1k with IPC 10. Verify the influence of backbone choices on data synthesis with CONFIG C (( = 1.5).", "description": "This ablation study investigates the impact of different backbone choices for the data synthesis stage of the EDC method on ImageNet-1k using an IPC of 10.  The table shows the top-1 accuracy achieved using ResNet-18 as the verified model, varying the observer model across different architectures (ResNet-18, MobileNet-V2, EfficientNet-B0, ShuffleNet-V2, WRN-40-2, AlexNet, ConvNext-Tiny, DenseNet-121).  The results highlight the relative performance of each backbone in this specific stage of the dataset condensation process.", "section": "G.1 Backbone Choices of Data Synthesis on ImageNet-1k"}, {"figure_path": "az1SLLsmdR/tables/tables_22_2.jpg", "caption": "Table 13: Ablation studies on ImageNet-1k with IPC 1. Verify the influence of backbone choice on soft label generation with CONFIG G (ς = 2).", "description": "This table presents the ablation study results on the ImageNet-1k dataset with an IPC of 1, focusing on the impact of different backbone choices for soft label generation within the EDC framework.  The experiment uses CONFIG G (with ς = 2).  The table shows that the combination of ResNet-18, MobileNet-V2, EfficientNet-B0, ShuffleNet-V2 and AlexNet for soft label generation results in the best performance.", "section": "G.2 Backbone Choices of Soft Label Generation on ImageNet-1k"}, {"figure_path": "az1SLLsmdR/tables/tables_23_1.jpg", "caption": "Table 14: Ablation studies on ImageNet-1k with IPC 10. Additional experimental result of the slowdown coefficient on the verified model MobileNet-V2.", "description": "This ablation study investigates the impact of the slowdown coefficient (ζ) in the smoothing learning rate schedule on the performance of the MobileNet-V2 model for ImageNet-1k dataset condensation with an IPC of 10.  The results show how different values of ζ affect the model's top-1 accuracy.", "section": "G.3 Smoothing LR Schedule Analysis"}, {"figure_path": "az1SLLsmdR/tables/tables_23_2.jpg", "caption": "Table 15: Ablation studies on ImageNet-1k with IPC 10. Verify the effectiveness of ALRS in post-evaluation.", "description": "This ablation study investigates the impact of different Adaptive Learning Rate Scheduler (ALRS) settings on the performance of the model after dataset condensation on ImageNet-1k with an IPC of 10.  The table shows that while ALRS doesn't provide a clear performance boost, certain settings achieve results close to the optimal configuration.", "section": "G.3 Smoothing LR Schedule Analysis"}, {"figure_path": "az1SLLsmdR/tables/tables_24_1.jpg", "caption": "Table 16: Ablation studies on ImageNet-1k with IPC 40. Verify the effectiveness of SSRS in post-evaluation.", "description": "This table presents ablation study results on ImageNet-1k with an IPC of 40, focusing specifically on evaluating the impact of different learning rate schedulers during the post-evaluation phase.  It compares the performance of using a standard smoothing learning rate schedule against the proposed early Smoothing-later Steep Learning Rate Schedule (SSRS). The results show that SSRS improves performance without introducing additional computational overhead.", "section": "G.4 Ablation Studies"}, {"figure_path": "az1SLLsmdR/tables/tables_24_2.jpg", "caption": "Table 17: Ablation studies on ImageNet-1k with IPC 10. Verify the effect of EMA Rate in EMA-based Evaluation.", "description": "This table presents the ablation study on the impact of EMA Rate on the performance of the EMA-based evaluation method on ImageNet-1k with an IPC of 10.  Different EMA Rates were tested (0.99, 0.999, 0.9999, 0.999945) and their corresponding top-1 accuracy is reported.  The results show that a specific EMA Rate is most effective for this setting.", "section": "G.4 Ablation Studies"}, {"figure_path": "az1SLLsmdR/tables/tables_24_3.jpg", "caption": "Table 18: Ablation studies on CIFAR-10 with IPC 10. We employ ResNet-18 exclusively for data synthesis and soft label generation, examining the impact of iteration count during post-evaluation and adhering to RDED's consistent hyperparameter settings.", "description": "This ablation study investigates the effect of the number of iterations during the post-evaluation phase on the performance of the dataset condensation method EDC on the CIFAR-10 dataset with an IPC of 10.  ResNet-18 is used as the backbone network for both data synthesis and soft label generation.  The hyperparameters are kept consistent with those used in the RDED method. The table shows that the optimal number of iterations is 75, as it achieves the highest accuracy of 42.7%.", "section": "G.5 Ablation Studies on CIFAR-10"}, {"figure_path": "az1SLLsmdR/tables/tables_24_4.jpg", "caption": "Table 1: Comparison with the SOTA baseline dataset condensation methods. SRe²L and RDED utilize ResNet-18 for data synthesis, whereas G-VBSM and EDC leverage various backbones for this purpose.", "description": "This table compares the performance of the proposed Elucidating Dataset Condensation (EDC) method with three state-of-the-art (SOTA) baseline dataset condensation methods: SRe2L, G-VBSM, and RDED.  The comparison is done across multiple datasets (CIFAR-10, CIFAR-100, Tiny-ImageNet, ImageNet-10, and ImageNet-1k) and different image processing compression ratios (IPC).  The results show that EDC consistently outperforms the baseline methods across all datasets and IPCs, demonstrating its superior accuracy in dataset condensation.", "section": "4 Experiments"}, {"figure_path": "az1SLLsmdR/tables/tables_24_5.jpg", "caption": "Table 1: Comparison with the SOTA baseline dataset condensation methods. SRe²L and RDED utilize ResNet-18 for data synthesis, whereas G-VBSM and EDC leverage various backbones for this purpose.", "description": "This table compares the proposed EDC method with state-of-the-art (SOTA) baseline dataset condensation methods (SRe2L, G-VBSM, RDED) across different datasets (CIFAR-10, CIFAR-100, Tiny-ImageNet, ImageNet-10, ImageNet-1k) and image per class (IPC) values.  The table highlights the superior accuracy achieved by EDC, particularly at higher IPC values, showcasing its effectiveness in dataset condensation.", "section": "4 Experiments"}, {"figure_path": "az1SLLsmdR/tables/tables_25_1.jpg", "caption": "Table 21: Ablation studies on CIFAR-10 with IPC 10. Explore the influence of various scheduler in post-evaluation. Hyperparameter settings follow those in Table 10.", "description": "This table presents the ablation study results on CIFAR-10 with an IPC of 10, focusing on the impact of different learning rate schedulers during the post-evaluation phase.  The schedulers compared include smoothing LR schedule with two different  ζ (slowdown coefficient) values, and MultiStepLR with two different γ (decay rate) values and milestone settings.  The hyperparameters for other settings followed those in Table 10. The table shows the top-1 accuracy achieved by different verified models (ResNet-18, ResNet-50, ResNet-101, and MobileNet-V2) under each scheduler configuration.", "section": "G.5 Ablation Studies on CIFAR-10"}, {"figure_path": "az1SLLsmdR/tables/tables_31_1.jpg", "caption": "Table 22: Comparison of Different Methods on ImageNet-21k.", "description": "This table presents a comparison of different dataset condensation methods on the ImageNet-21k dataset.  The results show the top-1 accuracy achieved by each method (SRe2L, CDA, RDED, EDC) using a compression ratio of 10, along with the baseline accuracy obtained using the original dataset.  It demonstrates the scalability of EDC to larger datasets.", "section": "K.1 Scalability on ImageNet-21k"}, {"figure_path": "az1SLLsmdR/tables/tables_31_2.jpg", "caption": "Table 1: Comparison with the SOTA baseline dataset condensation methods. SRe²L and RDED utilize ResNet-18 for data synthesis, whereas G-VBSM and EDC leverage various backbones for this purpose.", "description": "This table compares the performance of the proposed Elucidating Dataset Condensation (EDC) method against state-of-the-art (SOTA) baseline methods for dataset condensation.  It shows the top-1 accuracy achieved on various datasets (CIFAR-10, CIFAR-100, Tiny-ImageNet, ImageNet-10, and ImageNet-1k) using different Image Processing Counts (IPC) values, representing different compression ratios.  The table highlights that EDC outperforms other methods, especially at higher IPC values, indicating its effectiveness in generating high-quality condensed datasets.", "section": "4 Experiments"}, {"figure_path": "az1SLLsmdR/tables/tables_31_3.jpg", "caption": "Table 1: Comparison with the SOTA baseline dataset condensation methods. SRe²L and RDED utilize ResNet-18 for data synthesis, whereas G-VBSM and EDC leverage various backbones for this purpose.", "description": "This table compares the performance of the proposed Elucidating Dataset Condensation (EDC) method against state-of-the-art (SOTA) baseline methods for dataset condensation on various datasets (CIFAR-10, CIFAR-100, Tiny-ImageNet, ImageNet-10, and ImageNet-1k) and at different IPCs (images per class).  The table shows that EDC achieves superior accuracy compared to SOTA methods across all datasets and IPCs. Notably, the table highlights that SRe2L and RDED use ResNet-18 architecture for data synthesis, while G-VBSM and EDC use various backbones, demonstrating the versatility and effectiveness of EDC.", "section": "Experiments"}, {"figure_path": "az1SLLsmdR/tables/tables_33_1.jpg", "caption": "Table 1: Comparison with the SOTA baseline dataset condensation methods. SRe2L and RDED utilize ResNet-18 for data synthesis, whereas G-VBSM and EDC leverage various backbones for this purpose.", "description": "This table compares the performance of the proposed Elucidate Dataset Condensation (EDC) method with state-of-the-art (SOTA) baseline methods for dataset condensation across different datasets (CIFAR-10, CIFAR-100, Tiny-ImageNet, ImageNet-10, and ImageNet-1k) and image per class (IPC) values.  It highlights EDC's superior accuracy and efficiency, particularly on larger datasets. Note that different methods use different backbone networks for comparison.", "section": "4 Experiments"}]