[{"figure_path": "Gb0mXhn5h3/figures/figures_2_1.jpg", "caption": "Figure 1: Experimental paradigm and MiSO closed-loop framework. (A) MiSO's goal is to optimize brain stimulation parameter configurations to create specified neural population activity states. (B) Experimental setup. Top: Spiking activity was recorded from a multi-electrode array implanted in PFC. During fixation, uStim was applied for 150ms (orange bar) to induce a specified neural population activity state in the post uStim period (pink bar). Bottom: The uStim response was evaluated within a low-d latent space (e.g., 2D) identified from high-d multi-electrode spiking activity. (C) Closed-loop stimulation framework. Each MiSO iteration involves four steps (Section 2.5).", "description": "This figure illustrates the experimental setup and workflow of the MiSO closed-loop stimulation framework. Panel A shows the overall goal of MiSO, which is to find the optimal stimulation parameters to achieve a target neural activity state. Panel B details the experimental setup, including the use of a multi-electrode array implanted in the prefrontal cortex (PFC) of a non-human primate, and shows how the spiking activity is recorded and processed.  Panel C outlines the four steps of the MiSO closed-loop stimulation framework: (1) choosing stimulation parameters, (2) performing microstimulation, (3) analyzing the induced neural activity, and (4) updating predictions based on the analysis. This iterative process continues until the desired neural activity state is reached. ", "section": "2 Methods"}, {"figure_path": "Gb0mXhn5h3/figures/figures_6_1.jpg", "caption": "Figure 2: Closed-loop performance in a non-human primate of MiSO initialized using merged samples. (A) An example closed-loop experimental session. The top two panels show smoothed (for visualization) FA latent activity in the two target dimensions. Trials for all three methods were interleaved in the session. The bottom two panels show the electrode selected for uStim on each trial by \"Random uStim\" and “MiSO with single elec., sample avg.\". (B) Mean L1 error relative to the \"No uStim\" baseline across 5 closed-loop experimental sessions. Error bars indicate standard error across sessions.", "description": "This figure shows the results of a closed-loop experiment using MiSO initialized with merged samples. Panel A displays an example session, showing the latent activity over trials for three methods: No uStim, Random uStim, and MiSO. The bottom part of Panel A shows the electrodes selected for stimulation. Panel B presents the mean L1 error across five sessions, comparing the three methods against a No uStim baseline.", "section": "3 Results"}, {"figure_path": "Gb0mXhn5h3/figures/figures_7_1.jpg", "caption": "Figure 3: Leveraging spatial smoothness to predict uStim responses to untested uStim patterns. (A) uStim pattern difference determined by the physical location(s) of the stimulating electrode(s) on the array (illustrated here for single-electrode patterns). (B) Relationship between uStim pattern difference (horizontal axis, L1 distance, Section S5) and uStim response difference (vertical axis, latent activity difference along FA dim1) when stimulating using single electrodes. A positive correlation (r) implies that stimulating using nearby electrodes tended to induce similar responses. (C) uStim response prediction error as a function of the percentage of held-out uStim patterns during training. Error bars indicate standard error across test datasets. (D, E) Same format as (B) and (C) respectively, but for stimulation using double-electrode patterns. In (E), we experimentally tested 45% of all possible double-electrode patterns (9 sessions, 3301 trials).", "description": "This figure demonstrates the spatial smoothness in uStim responses.  Panels (B) and (D) show the correlation between the physical distance of stimulated electrodes and the similarity of their responses for single and double electrode stimulation respectively. Panels (C) and (E) compare the prediction errors of three different machine learning models (MLP, GP, CNN) for predicting uStim responses to held-out patterns, showcasing that the CNN model leverages spatial smoothness for better generalization.", "section": "2.4 Stimulation-response sample collection and CNN model fitting"}, {"figure_path": "Gb0mXhn5h3/figures/figures_8_1.jpg", "caption": "Figure 4: Closed-loop performance in a non-human primate of MiSO initialized using a CNN. (A) Range of activity patterns achievable by single (pink) and double (blue) electrode uStim patterns, as predicted by the CNN. Dashed region: area reachable exclusively by double-electrode uStim. Yellow star: target state used in (B). (B) Example closed-loop experimental session. Same format as Fig. 2A. (C) Mean L1 error of different methods relative to “No uStim” baseline, across 3 closed-loop sessions. Error bars indicate standard error across sessions.", "description": "This figure shows the results of closed-loop experiments using MiSO with a CNN model. Panel A shows the range of neural activity patterns achievable using single and double electrode microstimulation. Panel B shows an example closed-loop session demonstrating MiSO’s ability to drive neural activity towards a target state.  Panel C shows the average error for each method across sessions relative to a no stimulation baseline.  MiSO with double electrode stimulation performs better than other methods.", "section": "3 Results"}, {"figure_path": "Gb0mXhn5h3/figures/figures_15_1.jpg", "caption": "Figure S1: uStim response consistency across sessions. (A) Response maps of uStim-induced mean firing rates. Each panel shows the mean firing rate, averaged across the entire array, induced by stimulating each electrode individually. For example, the color of the top left cell in a given response map indicates the mean firing rate across the array induced by stimulating this particular electrode. Each column corresponds to a different session. (B) Response maps of uStim-induced mean latent activity across trials. Each panel shows the average latent activity induced by stimulating each electrode individually. The latent spaces have been aligned across sessions. Stimulation-response samples from the five sessions shown here are used to compute the sample average-based predictions in Fig. 2. (C) Normalized distance of response maps from session 1. The mean firing rates and latent activity are normalized across sessions using a min-max transformation to align their scales. The uStim response is more consistent across sessions in the aligned latent space than in the raw firing rate space.", "description": "This figure demonstrates how the proposed latent space alignment method improves the consistency of uStim responses across different experimental sessions.  Panel A shows raw firing rates for each electrode across 5 sessions, illustrating significant variability. Panel B shows the same data after latent space alignment, revealing greater consistency across sessions.  Panel C quantifies this improved consistency, showing that the response maps are much closer in the aligned latent space than in the original firing rate space. This consistency is critical for reliably merging data from different sessions to improve the performance of the MiSO closed-loop stimulation system.", "section": "Supplementary material"}, {"figure_path": "Gb0mXhn5h3/figures/figures_15_2.jpg", "caption": "Figure S2: Relationship between uStim pattern spatial similarity and response similarity along the second target dimension. Same format as Fig. 3B and Fig. 3D, which were based on the first target dimension. Left, single-electrode uStim, right, double-electrode uStim.", "description": "This figure shows the relationship between the spatial similarity of uStim patterns and the similarity of their responses. The left panel shows the relationship for single-electrode stimulation, and the right panel shows the relationship for double-electrode stimulation. The x-axis represents the spatial distance between the uStim patterns, and the y-axis represents the difference in their responses. The correlation coefficients (r) are shown for both panels, indicating a positive relationship between spatial similarity and response similarity.", "section": "Supplementary material"}, {"figure_path": "Gb0mXhn5h3/figures/figures_16_1.jpg", "caption": "Figure 3: Leveraging spatial smoothness to predict uStim responses to untested uStim patterns. (A) uStim pattern difference determined by the physical location(s) of the stimulating electrode(s) on the array (illustrated here for single-electrode patterns). (B) Relationship between uStim pattern difference (horizontal axis, L1 distance, Section S5) and uStim response difference (vertical axis, latent activity difference along FA dim1) when stimulating using single electrodes. A positive correlation (r) implies that stimulating using nearby electrodes tended to induce similar responses. (C) uStim response prediction error as a function of the percentage of held-out uStim patterns during training. Error bars indicate standard error across test datasets. (D, E) Same format as (B) and (C) respectively, but for stimulation using double-electrode patterns. In (E), we experimentally tested 45% of all possible double-electrode patterns (9 sessions, 3301 trials).", "description": "This figure demonstrates the spatial smoothness in uStim responses. Panel A shows how uStim pattern difference is calculated based on electrode location. Panels B and D show the correlation between uStim pattern difference and uStim response difference for single and double electrode stimulation respectively. Panels C and E show the uStim response prediction error with different percentages of held-out uStim patterns for training.", "section": "2.4 Stimulation-response sample collection and CNN model fitting"}]