[{"figure_path": "9JFSJitKC0/tables/tables_24_1.jpg", "caption": "Table 1: Details of network structures.", "description": "This table presents the architectural details of the neural networks used in the paper. It specifies the number of hidden layers, activation functions (LeakyReLU and Linear), and the output layer activation function (Linear for policy and reward critics, and SoftPlus for cost critics).  Additionally, the number of quantiles and ensembles used in the quantile regression distributional critic are provided for the reward and cost critics.", "section": "D.2 Network Structure"}, {"figure_path": "9JFSJitKC0/tables/tables_25_1.jpg", "caption": "Table 2: Description on hyperparameter settings.", "description": "This table lists the hyperparameter settings used in the experiments for all the algorithms, including the proposed SRCPO method and several baseline methods.  It covers various aspects of algorithm configuration, such as learning rates, batch sizes, numbers of updates, and parameters specific to certain algorithms like the trust region size for CPO and the entropy coefficient for SAC. The table helps clarify the experimental setup and ensure reproducibility of results.", "section": "D.3 Hyperparameter Settings"}, {"figure_path": "9JFSJitKC0/tables/tables_25_2.jpg", "caption": "Table 3: Training time for the point goal task averaged over five runs.", "description": "This table presents the averaged training time for six different safe reinforcement learning algorithms on the point goal task of the safety gymnasium.  The training time is measured in hours, minutes, and seconds and averaged over five separate training runs for each algorithm.  The purpose is to provide a comparison of the computational efficiency of different methods.", "section": "E Additional Experimental Results"}, {"figure_path": "9JFSJitKC0/tables/tables_26_1.jpg", "caption": "Table 4: Discretization results.", "description": "The table shows the results of the discretization of the Wang and Pow risk measures for different risk levels (α = 0.5, 1.0, 0.75, 0.9). For each risk measure and risk level, the table provides the optimized values of the parameters {nj} and {aj} for the discretized spectrum, as defined in equation (10). These parameters are obtained by minimizing the distance between the original spectrum function and its discretized version, as described in the paper.", "section": "E.2 Experiments on Various Risk Measures"}]