{"importance": "This paper is significant for researchers in computer graphics and vision because it presents **ReGS**, a novel method for real-time scene stylization that outperforms existing approaches.  It addresses the limitations of previous methods by combining **3D Gaussian Splatting** with a **texture-guided control mechanism**, achieving high-fidelity results while maintaining **real-time performance**. This opens up new possibilities for interactive applications and inspires further research in efficient 3D scene manipulation and stylization techniques.", "summary": "ReGS: Real-time reference-based 3D scene stylization using Gaussian Splatting for high-fidelity texture editing and free-view navigation.", "takeaways": ["ReGS achieves real-time stylized view synthesis with high-fidelity textures well-aligned with a given reference image.", "A novel texture-guided control mechanism adaptively adjusts local Gaussians for effective appearance editing, preserving geometric structure.", "ReGS outperforms state-of-the-art methods in terms of both visual quality and rendering speed."], "tldr": "Existing reference-based scene stylization methods struggle with slow rendering times due to reliance on neural radiance fields (NeRFs).  These methods also suffer from an inability to accurately capture fine texture details in the reference image when editing the appearance of pre-trained NeRFs. This paper introduces ReGS, which leverages 3D Gaussian Splatting for significantly faster rendering while addressing these texture limitations. \nReGS introduces a novel texture-guided control mechanism. This method identifies areas where the appearance needs improvement, then adapts the underlying Gaussian splat geometry for better matching to the reference image.  The method also incorporates depth regularization to preserve the original scene geometry.  Experimental results demonstrate that ReGS achieves state-of-the-art stylization quality with real-time performance, surpassing existing NeRF-based approaches in speed and accuracy.", "affiliation": "Johns Hopkins University", "categories": {"main_category": "Computer Vision", "sub_category": "3D Vision"}, "podcast_path": "ynJr0RW6FR/podcast.wav"}