[{"figure_path": "PzG7xVlYqm/figures/figures_23_1.jpg", "caption": "Figure 1: Metropolis-Hastings random walk under different privacy budgets and l₁ regularization. (Strong signal)", "description": "This figure visualizes the performance of the Metropolis-Hastings algorithm across various privacy budgets (ε) and regularization parameters (K).  Each subplot represents a different combination of ε and K, showing the evolution of the model's F1 score (a metric of model accuracy) and Ry (a measure of the model's goodness of fit). The red dashed line indicates the F1 score of the non-private best subset selection, which serves as a baseline for comparison. The gray shaded region represents the interquartile range (IQR) across ten independent MCMC runs, highlighting the variability in the algorithm's performance. This visualization helps to understand how the algorithm's performance and stability are influenced by varying privacy and regularization levels under a strong signal.", "section": "5 Numerical experiments"}, {"figure_path": "PzG7xVlYqm/figures/figures_24_1.jpg", "caption": "Figure 1: Metropolis-Hastings random walk under different privacy budgets and l1 regularization. (Strong signal)", "description": "This figure displays the results of the Metropolis-Hastings random walk algorithm under different privacy budgets (ε) and l1 regularization parameters (K). It focuses on the \"strong signal\" scenario.  Each subplot shows the evolution of the F1 score and Ry (a measure of model quality) over iterations of the algorithm. Different colors represent different chains, and the red line indicates the F1 score of the non-private BSS estimator. The figure helps to visualize the convergence of the algorithm and its performance under various privacy constraints and regularization levels.", "section": "5 Numerical experiments"}, {"figure_path": "PzG7xVlYqm/figures/figures_25_1.jpg", "caption": "Figure 1: Metropolis-Hastings random walk under different privacy budgets and l₁ regularization. (Strong signal)", "description": "This figure shows the results of the Metropolis-Hastings algorithm for different privacy budgets (ε) and l₁ regularization parameters (K).  Each subplot represents a different combination of ε and K, showing how the algorithm's performance varies across different privacy levels and regularization strengths. The algorithm's performance is evaluated by calculating the mean F1-score and tracking Ry which is proportional to the log-likelihood of the model, and this value increases as the chain progresses.  The red horizontal line indicates the Ry value for the non-private BSS model; the gray area denotes the iterations of the Markov chain. The strong signal case has been shown here. The algorithm shows good performance for larger values of ε (lower privacy) and appropriately chosen K.", "section": "5 Numerical experiments"}, {"figure_path": "PzG7xVlYqm/figures/figures_26_1.jpg", "caption": "Figure 1: Metropolis-Hastings random walk under different privacy budgets and l1 regularization. (Strong signal)", "description": "This figure displays the results of the Metropolis-Hastings random walk algorithm under various privacy budgets (ε) and l1 regularization parameters (K).  The strong signal case is shown, where the signal strength is relatively high. Each subplot represents a different combination of ε and K, showing the F1 score (a measure of model accuracy) and Ry (a measure of model fit) over iterations of the algorithm. The red dashed line represents the F1 score of non-private BSS, serving as a baseline for comparison. This figure helps to visualize how the algorithm's performance changes under differing levels of privacy and regularization.", "section": "5 Numerical experiments"}]