[{"figure_path": "i9QpRjUAhv/figures/figures_0_1.jpg", "caption": "Figure 1: HiCo model serves to enhance layout controllability for text-to-image generation, by integrating bounding box condition of different objects hierarchically. The proposed unique conditioning branch structure can produce more harmonious and holistic image with complex layout.", "description": "This figure showcases the HiCo model's ability to generate images based on complex layouts. It highlights how the model integrates bounding box conditions of different objects hierarchically, leading to more harmonious and holistic images.  Four examples are presented: (a) Layout-grounded generation with closed-set short descriptions, (b) Layout-grounded generation with open-ended fine-grained descriptions, (c) HiCo's compatibility with different Stable Diffusion (SD) variants, and (d) Multi-concept generation by HiCo with multiple LoRAs.  Additionally, (e) shows fast inference using HiCo-LCM/HiCo-Lightning.", "section": "Abstract"}, {"figure_path": "i9QpRjUAhv/figures/figures_0_2.jpg", "caption": "Figure 1: HiCo model serves to enhance layout controllability for text-to-image generation, by integrating bounding box condition of different objects hierarchically. The proposed unique conditioning branch structure can produce more harmonious and holistic image with complex layout.", "description": "This figure shows several examples of images generated by the HiCo model, highlighting its ability to control the layout of the generated images. The first row shows images generated with short and fine-grained descriptions, respectively. The second row demonstrates the compatibility of HiCo with different Stable Diffusion variants and its ability to generate multi-concept images. The third row showcases fast inference with HiCo-LCM and HiCo-Lightning.", "section": "Abstract"}, {"figure_path": "i9QpRjUAhv/figures/figures_0_3.jpg", "caption": "Figure 1: HiCo model serves to enhance layout controllability for text-to-image generation, by integrating bounding box condition of different objects hierarchically. The proposed unique conditioning branch structure can produce more harmonious and holistic image with complex layout.", "description": "This figure demonstrates the HiCo model's ability to generate images based on layouts.  It shows four examples highlighting different aspects: (a) simple layout with short descriptions; (b) complex layout with detailed descriptions; (c) compatibility with different Stable Diffusion variants; (d) multi-concept generation using LoRA; and (e) fast inference with HiCo-LCM/HiCo-Lightning.  The core idea is to improve the controllability of image generation by hierarchically integrating bounding boxes of different objects to create more coherent and visually appealing results.", "section": "Abstract"}, {"figure_path": "i9QpRjUAhv/figures/figures_0_4.jpg", "caption": "Figure 1: HiCo model serves to enhance layout controllability for text-to-image generation, by integrating bounding box condition of different objects hierarchically. The proposed unique conditioning branch structure can produce more harmonious and holistic image with complex layout.", "description": "This figure showcases the HiCo model's ability to generate images based on a given layout.  It demonstrates HiCo's capability to handle complex layouts by hierarchically integrating bounding box conditions of different objects. The unique conditioning branch structure enables the model to produce images with a higher degree of harmony and holism compared to previous methods.  The figure displays example images showing results with closed-set short descriptions, open-ended fine-grained descriptions, compatibility with different Stable Diffusion (SD) variants, multi-concept generation with multiple LoRAs, and fast inference using HiCo-LCM or HiCo-Lightning.", "section": "Abstract"}, {"figure_path": "i9QpRjUAhv/figures/figures_0_5.jpg", "caption": "Figure 1: HiCo model serves to enhance layout controllability for text-to-image generation, by integrating bounding box condition of different objects hierarchically. The proposed unique conditioning branch structure can produce more harmonious and holistic image with complex layout.", "description": "This figure shows several example images generated by the HiCo model, highlighting its ability to generate images with complex layouts based on textual and positional descriptions of objects.  Panel (a) demonstrates the generation of an image from a closed-set of short descriptions. Panel (b) shows generation from open-ended, more detailed descriptions. Panel (c) illustrates the model's compatibility with various Stable Diffusion variants. Panel (d) shows the model's ability to handle multiple concepts within a single image. Finally, panel (e) showcases fast inference capabilities using HiCo-LCM and HiCo-Lightning.", "section": "Abstract"}, {"figure_path": "i9QpRjUAhv/figures/figures_1_1.jpg", "caption": "Figure 2: The generation of CAG[6], GLIGEN[4] and HiCo in complex layouts.", "description": "This figure compares the image generation results of three different models (CAG, GLIGEN, and HiCo) on complex layouts.  The input is a complex layout specified by object positions and descriptions. CAG fails to generate several objects, demonstrating its inability to handle complex scenarios. GLIGEN performs better, but still shows some distortions and inaccuracies. HiCo shows significant improvement in object completeness and overall image quality. This highlights HiCo's strength in producing accurate and realistic images even in the face of complex layouts.", "section": "1 Introduction"}, {"figure_path": "i9QpRjUAhv/figures/figures_3_1.jpg", "caption": "Figure 3: The overall architecture of our approach.", "description": "The figure shows the overall architecture of the HiCo model for layout-to-image generation.  It consists of multiple branches of HiCo Nets, each independently modeling a different foreground object or the background. Each branch takes as input the corresponding textual description and bounding box information for its respective object. The branches are then aggregated in a Fuse Net module, which combines their features to generate a holistic representation of the layout. This representation is then fed to a frozen UNet model, which generates the final image. The diagram highlights that the HiCo Net is trainable while the UNet is frozen, showcasing the hierarchical nature of the model.", "section": "3 Method"}, {"figure_path": "i9QpRjUAhv/figures/figures_4_1.jpg", "caption": "Figure 4: The visualization of the features on different layers of the HiCo branch and Fuse Net.", "description": "This figure visualizes the features extracted by different layers of the HiCo branch and Fuse Net.  The HiCo Net uses a multi-branch architecture, each branch processing a different part of the layout.  This figure shows features from layers 2, 5, and 11 during downsampling.  It illustrates how shallow layers respond to layout areas, intermediate layers refine object details, and deeper layers integrate regional information for layout control. The fusion process of the HiCo branches uses a masking technique.", "section": "3.2 HiCo Diffusion Model"}, {"figure_path": "i9QpRjUAhv/figures/figures_4_2.jpg", "caption": "Figure 5: The model fine-tuning technique based on various positions of LoRA. (a) Adding LoRA parameters on UNet. (b) Adding LoRA parameters on HiCo.", "description": "This figure illustrates two different approaches for integrating LoRA (Low-Rank Adaptation) into the HiCo diffusion model for fine-tuning.  (a) shows LoRA parameters added to the UNet, a common approach for adjusting the underlying image generation process. (b) demonstrates the addition of LoRA parameters specifically to the HiCo model, enabling more targeted fine-tuning focused on layout control and potentially enhancing efficiency.", "section": "3.3 Hierarchical Controllable Analysis"}, {"figure_path": "i9QpRjUAhv/figures/figures_6_1.jpg", "caption": "Figure 1: HiCo model serves to enhance layout controllability for text-to-image generation, by integrating bounding box condition of different objects hierarchically. The proposed unique conditioning branch structure can produce more harmonious and holistic image with complex layout.", "description": "This figure showcases the HiCo model's ability to improve layout control in text-to-image generation.  It highlights how HiCo uses a hierarchical approach, integrating bounding boxes of objects to generate images with complex layouts. The unique conditioning branch structure enables the creation of more harmonious and holistic images.  Four image examples are given demonstrating HiCo's effectiveness with different scenarios: using short, closed-set descriptions; using longer, open-ended descriptions; compatibility with different Stable Diffusion variants; and multi-concept generation.", "section": "Abstract"}, {"figure_path": "i9QpRjUAhv/figures/figures_7_1.jpg", "caption": "Figure 7: Qualitative comparison with other models on HiCo-7K. Compared with other methods, HiCo can generate high-quality images for both simple and complex layout information.", "description": "This figure shows a qualitative comparison of image generation results between HiCo and other state-of-the-art methods on the HiCo-7K dataset.  The dataset contains images with varying levels of layout complexity. For each image, the layout, ground truth image, and the outputs of several different models are displayed. The results demonstrate that HiCo generates high-quality, detailed images with accurate object placement and relationships, even for layouts that are highly complex. In contrast, the other models exhibit issues such as object omission, misplacement, and inconsistencies in image quality and style.", "section": "4.3.2 Fine-Grained Open-ended Text2Img Generation"}, {"figure_path": "i9QpRjUAhv/figures/figures_9_1.jpg", "caption": "Figure 1: HiCo model serves to enhance layout controllability for text-to-image generation, by integrating bounding box condition of different objects hierarchically. The proposed unique conditioning branch structure can produce more harmonious and holistic image with complex layout.", "description": "This figure demonstrates the HiCo model's ability to generate images based on a given layout.  It showcases how HiCo uses a hierarchical approach, integrating bounding box conditions of different objects to achieve improved layout control in text-to-image generation.  The unique conditioning branch structure enables the generation of more harmonious and complete images, even with complex layouts. The figure includes four subfigures illustrating different aspects of HiCo's capabilities: layout-grounded generation with closed-set short descriptions, layout-grounded generation with open-ended fine-grained descriptions, HiCo's compatibility with different Stable Diffusion variants, and multi-concept generation using multiple LoRAs.", "section": "Abstract"}, {"figure_path": "i9QpRjUAhv/figures/figures_14_1.jpg", "caption": "Figure 1: HiCo model serves to enhance layout controllability for text-to-image generation, by integrating bounding box condition of different objects hierarchically. The proposed unique conditioning branch structure can produce more harmonious and holistic image with complex layout.", "description": "This figure demonstrates the HiCo model's ability to improve layout control in text-to-image generation. It achieves this through a hierarchical integration of bounding boxes representing different objects. The unique multi-branch structure of the model ensures that the generated images have a more harmonious and complete layout, even in complex scenarios.", "section": "Introduction"}, {"figure_path": "i9QpRjUAhv/figures/figures_14_2.jpg", "caption": "Figure 1: HiCo model serves to enhance layout controllability for text-to-image generation, by integrating bounding box condition of different objects hierarchically. The proposed unique conditioning branch structure can produce more harmonious and holistic image with complex layout.", "description": "This figure demonstrates the HiCo model's ability to improve layout control in text-to-image generation.  It uses a hierarchical approach, integrating bounding boxes of objects to enhance controllability. The unique multi-branch structure allows the model to create more harmonious and complete images, especially those with complex layouts.  Subfigures (a) and (b) show layout-grounded generation with different levels of description detail.  Subfigures (c) and (d) highlight HiCo's compatibility with different Stable Diffusion variants and its capability for multi-concept generation using multiple LoRAs. Finally, (e) shows the fast inference capabilities.", "section": "Abstract"}, {"figure_path": "i9QpRjUAhv/figures/figures_16_1.jpg", "caption": "Figure 1: HiCo model serves to enhance layout controllability for text-to-image generation, by integrating bounding box condition of different objects hierarchically. The proposed unique conditioning branch structure can produce more harmonious and holistic image with complex layout.", "description": "This figure shows examples of images generated by the HiCo model, highlighting its ability to control the layout of objects in the image.  The model takes as input a layout description, which includes textual descriptions and bounding boxes for each object. (a) demonstrates generation with a closed set of short descriptions, (b) with open-ended and fine-grained descriptions. (c) shows HiCo's compatibility with different Stable Diffusion variants, (d) shows the ability to generate images with multiple concepts using multiple LoRAs, and (e) demonstrates fast inference using HiCo-LCM or HiCo-Lightning.  The overall result shows the model successfully places objects according to the given layout, creating visually coherent and harmonious images.", "section": "Abstract"}, {"figure_path": "i9QpRjUAhv/figures/figures_17_1.jpg", "caption": "Figure 1: HiCo model serves to enhance layout controllability for text-to-image generation, by integrating bounding box condition of different objects hierarchically. The proposed unique conditioning branch structure can produce more harmonious and holistic image with complex layout.", "description": "This figure shows several examples of images generated by the HiCo model, highlighting its ability to handle complex layouts.  Panel (a) demonstrates generation with closed-set short descriptions, (b) shows generation with open-ended fine-grained descriptions, (c) illustrates HiCo's compatibility with different Stable Diffusion variants, (d) showcases multi-concept generation using multiple LoRAs, and (e) highlights the fast inference capabilities of HiCo-LCM and HiCo-Lightning.  The overall theme is that HiCo effectively integrates bounding box information for various objects to create coherent and visually appealing images, even with complex scene arrangements.", "section": "Abstract"}, {"figure_path": "i9QpRjUAhv/figures/figures_17_2.jpg", "caption": "Figure 1: HiCo model serves to enhance layout controllability for text-to-image generation, by integrating bounding box condition of different objects hierarchically. The proposed unique conditioning branch structure can produce more harmonious and holistic image with complex layout.", "description": "This figure shows several examples of images generated by the HiCo model, highlighting its ability to control the layout of objects in the image.  The first row demonstrates the model's ability to generate images based on both short and detailed descriptions with specific object layouts.  The second row shows HiCo's compatibility with different Stable Diffusion (SD) variants and how it generates images with multiple concepts using different LoRAs. Finally, the third row illustrates the speed of the HiCo-LCM and HiCo-Lightning inference methods, showcasing their capability to generate images quickly.", "section": "Abstract"}, {"figure_path": "i9QpRjUAhv/figures/figures_17_3.jpg", "caption": "Figure 1: HiCo model serves to enhance layout controllability for text-to-image generation, by integrating bounding box condition of different objects hierarchically. The proposed unique conditioning branch structure can produce more harmonious and holistic image with complex layout.", "description": "This figure showcases the HiCo model's ability to generate images based on complex layouts. It highlights how the model uses hierarchical bounding boxes to condition the generation process, leading to more harmonious and complete images, even with intricate layouts.  Several example image generation results are displayed, illustrating various aspects of the model's capabilities.", "section": "Abstract"}, {"figure_path": "i9QpRjUAhv/figures/figures_17_4.jpg", "caption": "Figure 1: HiCo model serves to enhance layout controllability for text-to-image generation, by integrating bounding box condition of different objects hierarchically. The proposed unique conditioning branch structure can produce more harmonious and holistic image with complex layout.", "description": "This figure showcases the capabilities of the HiCo model in generating images based on complex layouts.  It demonstrates how HiCo integrates bounding box information of various objects hierarchically, leading to more coherent and visually appealing results compared to methods that lack this hierarchical control.  The figure uses several examples to highlight HiCo's ability to handle open-ended descriptions, compatibility with various Stable Diffusion variants, multi-concept generation using LoRA, and fast inference with HiCo-LCM/HiCo-Lightning. ", "section": "Abstract"}]