[{"figure_path": "aetbfmCcwg/figures/figures_6_1.jpg", "caption": "Figure 2: Empirical coverage of the 95% confidence interval for the population mean of age and the population effect of therapy on blood pressure adjusted for stage.", "description": "This figure displays the empirical coverage of 95% confidence intervals for two different population parameters: the mean age and the effect of therapy on blood pressure (adjusted for stage).  The results are shown for original data and data generated using two different deep generative models (CTGAN and TVAE), both with and without the proposed debiasing strategy. The x-axis represents sample size (n, on a logarithmic scale), and the y-axis represents the empirical coverage (percentage).  The figure demonstrates the impact of the debiasing strategy on improving coverage, especially at larger sample sizes.", "section": "4 Simulation study"}, {"figure_path": "aetbfmCcwg/figures/figures_7_1.jpg", "caption": "Figure 3: Each dot in Figure (a) is an estimate for the population mean of age per Monte Carlo run. The funnel indicates the behaviour of an unbiased and √n-consistent estimator based on observed data. Figure (b) depicts the empirical and average MLE-based SE for the sample mean of age.", "description": "The figure shows the results of the simulation study in terms of bias and standard error. Figure 3a shows the estimates of the population mean of age per Monte Carlo run. Each point represents an estimate, and the funnel represents the behavior of an unbiased and square-root-n-consistent estimator based on observed data. Figure 3b displays the empirical and average MLE-based standard error for the sample mean of age.", "section": "4 Simulation study"}, {"figure_path": "aetbfmCcwg/figures/figures_8_1.jpg", "caption": "Figure 4: Empirical coverage of 95% CIs for the risk difference for death in each of the three datasets (m = n = 500) for the IST case study.", "description": "This figure displays the empirical coverage of the 95% confidence intervals for the risk difference in death between the treatment arms (aspirin and no aspirin) based on original data, default synthetic data, and debiased synthetic data for the International Stroke Trial (IST) dataset.  Each point represents the result of a single Monte Carlo simulation run (n=500). The horizontal dashed line represents the true risk difference from the population (-0.009). The funnel represents the typical behavior of an unbiased, root-n consistent estimator based on observed data.  The figure shows that using default synthetic data leads to confidence intervals that frequently do not contain the true risk difference. The debiased synthetic data considerably improves the coverage.", "section": "5.1 International Stroke Trial"}, {"figure_path": "aetbfmCcwg/figures/figures_16_1.jpg", "caption": "Figure A1: Suppose that interest lies in inferring the mean (.) (orange solid vertical line) of the ground truth distribution P (orange solid curve) from synthetic data. (1) First, a random sample of original data of size n with empirical distribution Pn (orange histogram) is collected from this ground truth. Theory on asymptotic linearity prescribes that the sample mean (orange dashed vertical line) will deviate from the population mean by order of 1 over root-n (grey arrow). (2) Subsequently, a deep generative model is trained on these original data, yielding an estimated distribution Pn (blue solid curve). Its mean (blue solid vertical line) may in turn differ from the original sample mean by an order larger than 1 over root-n (red arrow), which is referred to as regularisation bias in Decruyenaere et al. (2024). (3) Finally, synthetic data of size m (here m = n) are sampled from the estimated distribution Pn, forming the empirical distribution Pm = Pm (blue histogram with sample mean indicated by the blue dashed vertical line). The mean of both distributions Pn and Pm will again differ by order of 1 over root-m (green arrow). Ideally, the data analyst, who uses the synthetic data to estimate 0(P) by 0(Pm), needs to take into account these three sources of random variability. (4) The large sample behaviour of the synthetic data estimator 0(Pm) is depicted by repeating the above procedure multiple times across increasing sample sizes of n = m and storing each estimate of the synthetic sample mean. Although the estimator remains unbiased for (P) (dashed line), its empirical standard error becomes larger than in the original data due to the additional sources of variability. However, the correction factor √1 + m/n to the model-based standard error previously proposed by Raab et al. (2016) only captures the original data sampling variability (grey funnel) and a lower bound of the synthetic data sampling variability (green funnel), while the uncertainty associated with the regularisation bias (red funnel) remains unaccounted for. Since it cannot readily be expressed analytically, our debiasing strategy will eliminate the latter by shifting the mean of the distribution 0(Pn) estimated by the generative model towards the original sample mean (thereby removing the red arrow and funnel). Additionally, choosing synthetic sample sizes of m → ∞ will shrink the synthetic data sampling variability (ultimately removing the green arrow and funnel), such that the synthetic data estimator exhibits similar large sample behaviour as in original data.", "description": "This figure illustrates the three sources of uncertainty when using synthetic data generated by a deep generative model to estimate a population parameter.  It shows how the sample mean from original data, the estimated mean from a trained generative model, and the sample mean from synthetic data generated by that model will all differ from the true population parameter. The figure also highlights how a correction factor and debiasing strategy can help mitigate the uncertainty and improve the accuracy of the estimate using synthetic data.", "section": "A.4 Graphical summary"}, {"figure_path": "aetbfmCcwg/figures/figures_22_1.jpg", "caption": "Figure 2: Empirical coverage of the 95% confidence interval for the population mean of age and the population effect of therapy on blood pressure adjusted for stage.", "description": "This figure displays the empirical coverage of 95% confidence intervals for two different population parameters: the mean of age and the effect of therapy on blood pressure (adjusted for stage). The coverage is shown for different sample sizes (n) and for both original data and data generated by two different deep generative models (CTGAN and TVAE).  It also distinguishes between results with and without the application of the debiasing strategy proposed in the paper. The results show how the debiasing strategy improves the coverage of the confidence intervals, bringing them closer to the nominal level (95%). The figure shows that without the debiasing strategy the coverage decreases as the sample size increases for both CTGAN and TVAE because the standard error shrinks slower than the typical rate of 1/√n.", "section": "4 Simulation study"}, {"figure_path": "aetbfmCcwg/figures/figures_22_2.jpg", "caption": "Figure 3: Each dot in Figure (a) is an estimate for the population mean of age per Monte Carlo run. The funnel indicates the behaviour of an unbiased and √n-consistent estimator based on observed data. Figure (b) depicts the empirical and average MLE-based SE for the sample mean of age.", "description": "The figure shows the results of the simulation study on the sample mean of age. Figure 3a shows the estimates for the population mean of age, and Figure 3b shows the empirical and average MLE-based standard errors for the sample mean of age. The funnel in Figure 3a indicates the behaviour of an unbiased and √n-consistent estimator based on observed data.  The results show how the debiasing strategy affects the bias, variability, and convergence rate of the estimator.", "section": "4 Simulation study"}, {"figure_path": "aetbfmCcwg/figures/figures_23_1.jpg", "caption": "Figure A4: The empirical and MLE-based standard error for the sample mean of age.", "description": "The figure displays the empirical and MLE-based standard errors for the sample mean of age across different sample sizes (n) and for different deep generative models (CTGAN and TVAE).  Each point represents an average over multiple Monte Carlo simulations. The MLE-based standard errors, calculated under the assumption of a root-n consistent estimator, are compared to the empirical standard errors. Debiasing has a significant positive effect on the empirical standard errors' convergence rate and their approximation by the MLE-based SE.", "section": "4.2.2 Bias and Standard Error"}, {"figure_path": "aetbfmCcwg/figures/figures_23_2.jpg", "caption": "Figure A2: Empirical coverage of the 95% confidence interval for the MLE-based estimators.", "description": "This figure shows the empirical coverage of 95% confidence intervals for MLE-based estimators of the population mean of age and the population effect of therapy on blood pressure, adjusted for stage.  It compares the coverage obtained from original data, default synthetic datasets (generated using CTGAN and TVAE with hyperparameters from SDV and Synthcity), and debiased synthetic datasets. The results illustrate the impact of debiasing on coverage, showing that debiasing improves coverage, particularly for the population mean, while coverage for the effect of therapy remains closer to the nominal level (95%) only at larger sample sizes.", "section": "4.2.1 Coverage"}, {"figure_path": "aetbfmCcwg/figures/figures_23_3.jpg", "caption": "Figure A6: The empirical and MLE-based standard error for the (MLE-based) effect of therapy on blood pressure adjusted for stage.", "description": "The figure shows the empirical and MLE-based standard errors for the effect of therapy on blood pressure, adjusted for stage.  It visually demonstrates how the standard error of the maximum likelihood estimate (MLE) underestimates the empirical standard error, especially in smaller sample sizes. The data is split into four panels based on the deep generative model used (CTGAN(SDV), CTGAN(Synthcity), TVAE(SDV), TVAE(Synthcity)) and whether debiasing was applied. This shows how debiasing improves the approximation of the MLE standard error to the empirical standard error.", "section": "A.7.4 Additional results"}, {"figure_path": "aetbfmCcwg/figures/figures_24_1.jpg", "caption": "Figure A7: Convergence rate of the empirical standard error (SE) for the MLE-based estimators. If the SE is of the form SE = cn⁻ª, where c is a constant, then log (SE) = log(c) + (-a) log (n). Therefore slope a represents the convergence rate and the vertical offset log(c) indicates the log asymptotic variance. The dashed line indicates the behaviour of the SE of an unbiased and √n-consistent estimator based on observed data, whereas the dotted line indicates the assumed behaviour of the SE of the same estimator based on synthetic data, following the correction proposed by Raab et al. (2016).", "description": "This figure displays the convergence rate of the empirical standard error (SE) for the maximum likelihood estimation (MLE)-based estimators.  The slope of the lines show the convergence rate (n⁻ª), where a is estimated. A slope of -0.5 indicates a convergence rate of 1/√n, as expected for an unbiased and consistent estimator with original data.  The plot compares the convergence rates of the MLE-based SE for original data and synthetic data generated by different deep generative models, both before and after the proposed debiasing strategy.  It illustrates how the debiasing strategy improves convergence to the expected 1/√n rate.", "section": "A.7.3 Quality of synthetic data"}, {"figure_path": "aetbfmCcwg/figures/figures_26_1.jpg", "caption": "Figure A8: Empirical coverage of the 95% confidence interval for the maximum likelihood estimation (MLE)-based and efficient influence curve (EIC)-based estimators.", "description": "This figure displays the empirical coverage of the 95% confidence intervals for both MLE-based and EIC-based estimators for the population mean of age and the population effect of therapy on blood pressure adjusted for stage.  The results are shown for original data and synthetic data generated using CTGAN and TVAE with and without the proposed debiasing strategy. The figure helps visualize how the debiasing strategy improves the coverage, especially for smaller sample sizes and when using synthetic data.", "section": "A.7.5 Influence curve based estimation"}, {"figure_path": "aetbfmCcwg/figures/figures_27_1.jpg", "caption": "Figure A9: The horizontal dashed line represents the population parameter and each dot is a maximum likelihood estimation (MLE)-based or efficient influence curve (EIC)-based estimate per Monte Carlo run (250 dots in total per value of n). The dashed funnel indicates the behaviour of an unbiased and √n-consistent estimator based on observed data.", "description": "This figure displays the MLE-based and EIC-based estimates of the population mean of age and the effect of therapy on blood pressure adjusted for stage, across different sample sizes (n).  The horizontal dashed line represents the true population parameter value. Each dot shows an estimate from a single Monte Carlo simulation run. The funnel illustrates the expected behavior of an unbiased and consistent estimator from observed data, demonstrating how the standard error should shrink with increasing sample size. The figure compares the estimates from original data, default synthetic data, and debiased synthetic data, to illustrate the effect of the debiasing strategy on reducing bias and variance in synthetic data.", "section": "A.7.5 Influence curve based estimation"}, {"figure_path": "aetbfmCcwg/figures/figures_27_2.jpg", "caption": "Figure A11: Convergence rate of the empirical standard error (SE) for the maximum likelihood estimation (MLE)-based and efficient influence curve (EIC)-based estimators. If the SE is of the form SE = cn⁻ª, where c is a constant, then log(SE) = log(c) + (-a)log(n). Therefore slope a represents the convergence rate and the vertical offset log(c) indicates the log asymptotic variance. The dashed line indicates the behaviour of the SE of an unbiased and √n-consistent estimator based on observed data, whereas the dotted line indicates the assumed behaviour of the SE of the same estimator based on synthetic data, following the correction proposed by Raab et al. (2016).", "description": "The figure shows the convergence rate of the empirical standard error for both MLE-based and EIC-based estimators. The slope of the lines indicates the convergence rate, while the vertical offset represents the log asymptotic variance.  Dashed and dotted lines show the expected behavior for estimators based on real and synthetic data respectively. The figure helps to illustrate how the debiasing strategy affects the convergence rate and variance of the estimators.", "section": "A.7.3 Quality of synthetic data"}, {"figure_path": "aetbfmCcwg/figures/figures_28_1.jpg", "caption": "Figure A7: Convergence rate of the empirical standard error (SE) for the MLE-based estimators. If the SE is of the form SE = cn⁻ᵃ, where c is a constant, then log(SE) = log(c) + (-a) log(n). Therefore slope a represents the convergence rate and the vertical offset log(c) indicates the log asymptotic variance. The dashed line indicates the behaviour of the SE of an unbiased and √n-consistent estimator based on observed data, whereas the dotted line indicates the assumed behaviour of the SE of the same estimator based on synthetic data, following the correction proposed by Raab et al. (2016).", "description": "This figure shows the convergence rate of the empirical standard error for the MLE-based estimators. The slope of the lines indicates the convergence rate, and the vertical intercept indicates the asymptotic variance. The dashed line represents the expected behavior for an unbiased, root-n consistent estimator based on real data. The dotted line shows the expected behavior for a similar estimator based on synthetic data using a correction factor from Raab et al. (2016).  Parallel lines to the dashed and dotted lines indicate root-n convergence, while horizontal or vertical lines indicate slower or faster convergence, respectively.", "section": "A.7.3 Convergence Rate of Standard Error"}, {"figure_path": "aetbfmCcwg/figures/figures_30_1.jpg", "caption": "Figure A12: Estimates for the proportion of death in both treatment arms and their corresponding risk difference estimates. We show results for original data, and both default synthetic data (left) and debiased synthetic data (right) for all four generators. The horizontal dashed line represents the population proportion of death in each group and the corresponding risk difference, and each dot is an estimate per Monte Carlo run (100 dots in total per value of n). The dashed funnel indicates the behaviour of an unbiased and √n-consistent estimator based on observed data.", "description": "This figure shows the results for the proportion of deaths in the aspirin and no-aspirin groups, as well as their risk difference, for both default and debiased synthetic data. It compares the results across four different generative models (CTGAN (SDV), CTGAN (Synthcity), TVAE (SDV), and TVAE (Synthcity)) and varying sample sizes (n).  The horizontal dashed line indicates the true population values, providing a visual comparison of the estimates' accuracy and precision. The funnel represents the expected behavior of an unbiased estimator with a convergence rate of 1/√n, illustrating how the estimates' variability decreases as the sample size increases.", "section": "A.8.1 International Stroke Trial"}, {"figure_path": "aetbfmCcwg/figures/figures_30_2.jpg", "caption": "Figure A13: Figure (a) shows the empirical coverage of the 95% CI for the true proportion of death in the aspirin treatment arm. In Figure (b), one can find the empirical type 1 error rate for the risk difference in death between aspirin and no aspirin group based on original data, default and targeted synthetic data. The null hypothesis states that the risk difference is equal to -0.009, the risk difference as observed in the population (i.e. the original IST data). Tests were conducted at the 5% significance level, where the black horizontal line on the figure depicts this nominal level.", "description": "This figure shows the empirical coverage and type 1 error rate for the proportion of death in the aspirin treatment arm and the risk difference in death between aspirin and no aspirin groups, based on original, default, and debiased synthetic data. The results indicate that the debiasing strategy improves the coverage and reduces type 1 error, especially for smaller sample sizes.", "section": "A.8.1 International Stroke Trial"}]