[{"figure_path": "TWfNFCOPaK/figures/figures_1_1.jpg", "caption": "Figure 1: Geometric surrogates for modelling wireless signal propagation. (a): Predictive modelling of channels from 3D geometry, transmitter, and receiver properties. Wi-GATr is a fast and differentiable surrogate for ray tracers. (b): A probabilistic approach with diffusion models lets us reconstruct 3D environments (c) and antenna positions (d) from the wireless signal.", "description": "This figure illustrates two approaches for modeling wireless signal propagation using the Wireless Geometric Algebra Transformer (Wi-GATr).  (a) shows a predictive model where Wi-GATr acts as a differentiable surrogate for ray tracing simulators, predicting channel characteristics from 3D geometry and device properties.  (b) presents a probabilistic approach leveraging diffusion models to perform inverse problem solving. This allows reconstruction of 3D environments (c) and antenna positions (d) from received wireless signals.  The figure highlights the efficiency and versatility of Wi-GATr in handling both forward and inverse wireless signal propagation problems.", "section": "1 Introduction"}, {"figure_path": "TWfNFCOPaK/figures/figures_5_1.jpg", "caption": "Figure 2: Qualitative signal prediction results. We show a single floor plan from the WiPTR test set. The black lines indicate the walls and doors, the colors show the received power as a function of the transmitter location (brighter colours mean a stronger signal). The transmitting antenna is shown as a black cross. The z coordinates of transmitter and receiver are all fixed to the same height. We compare the ground-truth predictions (top left) to the predictions from different predictive models, each trained on only 100 WiPTR floor plans. Wi-GATr is able to generalize to this unseen floor plan even with such a small training set.", "description": "This figure compares the ground truth received power prediction with predictions from different models (Wi-GATr, Transformer, and Vision Transformer) trained on a limited dataset (100 floor plans).  It shows a heatmap of received power across a single floor plan, highlighting Wi-GATr's superior generalization ability to unseen data.", "section": "5 Experiments"}, {"figure_path": "TWfNFCOPaK/figures/figures_7_1.jpg", "caption": "Figure 2: Qualitative signal prediction results. We show a single floor plan from the WiPTR test set. The black lines indicate the walls and doors, the colors show the received power as a function of the transmitter location (brighter colours mean a stronger signal). The transmitting antenna is shown as a black cross. The z coordinates of transmitter and receiver are all fixed to the same height. We compare the ground-truth predictions (top left) to the predictions from different predictive models, each trained on only 100 WiPTR floor plans. Wi-GATr is able to generalize to this unseen floor plan even with such a small training set.", "description": "This figure qualitatively demonstrates the signal prediction performance of different models on an unseen floor plan from the WiPTR dataset.  The top-left panel shows the ground truth received power distribution, while the other panels depict the predictions made by different models (Transformer, Vision Transformer (ViT), and Wi-GATr) trained on a limited dataset (only 100 floor plans). It highlights Wi-GATr's superior generalization ability, accurately predicting the signal even without extensive training data.  The color intensity represents received power strength.", "section": "3.3 Predictive modelling"}, {"figure_path": "TWfNFCOPaK/figures/figures_7_2.jpg", "caption": "Figure 2: Qualitative signal prediction results. We show a single floor plan from the WiPTR test set. The black lines indicate the walls and doors, the colors show the received power as a function of the transmitter location (brighter colours mean a stronger signal). The transmitting antenna is shown as a black cross. The z coordinates of transmitter and receiver are all fixed to the same height. We compare the ground-truth predictions (top left) to the predictions from different predictive models, each trained on only 100 WiPTR floor plans. Wi-GATr is able to generalize to this unseen floor plan even with such a small training set.", "description": "This figure qualitatively demonstrates the performance of different signal prediction models on an unseen floor plan from the WiPTR dataset.  The top-left panel shows the ground truth received power as a heatmap, indicating signal strength at different transmitter locations.  The other panels compare this to the predictions made by a vanilla transformer, Vision Transformer (ViT), and the proposed Wi-GATr model. Wi-GATr shows superior generalization ability, achieving high-fidelity predictions even when trained on a limited dataset.", "section": "3.3 Predictive modelling"}, {"figure_path": "TWfNFCOPaK/figures/figures_8_1.jpg", "caption": "Figure 1: Geometric surrogates for modelling wireless signal propagation. (a): Predictive modelling of channels from 3D geometry, transmitter, and receiver properties. Wi-GATr is a fast and differentiable surrogate for ray tracers. (b): A probabilistic approach with diffusion models lets us reconstruct 3D environments (c) and antenna positions (d) from the wireless signal.", "description": "This figure illustrates the two main approaches used in the paper for modelling wireless signal propagation.  The first approach (a) uses a predictive model (Wi-GATr) to estimate channel properties directly from 3D geometry, transmitter, and receiver information, acting as a fast and differentiable alternative to traditional ray-tracing simulators. The second approach (b) utilizes a probabilistic diffusion model to generate samples of the channel, the environment (c), and antenna positions (d), given some observed data. The probabilistic model allows for the reconstruction of missing information in inverse problems.", "section": "1 Introduction"}, {"figure_path": "TWfNFCOPaK/figures/figures_20_1.jpg", "caption": "Figure 6: Rx localization error, as a function of the number of Tx. Lines and error band show mean and its standard error over 240 measurements.", "description": "This figure shows the mean Rx localization error plotted against the number of transmitters used, comparing the performance of the Transformer model and the Wi-GATr model.  Error bars represent the standard error, indicating the uncertainty in the mean error. The plot demonstrates how the accuracy of receiver localization improves with an increasing number of transmitters, and highlights the superior performance of the Wi-GATr model across different transmitter counts.", "section": "5.2 Probabilistic modelling"}, {"figure_path": "TWfNFCOPaK/figures/figures_21_1.jpg", "caption": "Figure 7: Inference wall time vs signal prediction error per Tx/Rx prediction on the first room of the WiPTR validation set.", "description": "This figure shows a comparison of inference time and prediction error for different methods on a single room from the WiPTR validation set.  The x-axis represents the time taken to process a single transmitter-receiver link, while the y-axis shows the mean absolute error (MAE) of the signal prediction.  It highlights the trade-off between speed and accuracy, showing that the Wi-GATr model achieves a good balance of both.", "section": "5 Experiments"}, {"figure_path": "TWfNFCOPaK/figures/figures_22_1.jpg", "caption": "Figure 3: Signal prediction. We show the mean absolute error on the received power as a function of the training data on Wi3R (left) and WiPTR (right). Wi-GATr outperforms the transformer and PLVIT baselines at any amount of training data, and scales better to large data or many tokens than SEGNN.", "description": "This figure compares the performance of different models (Wi-GATr, Transformer, and PLVIT) on signal prediction tasks using two datasets (Wi3R and WiPTR).  The mean absolute error (MAE) in dBm is plotted against the amount of training data used.  The results demonstrate that Wi-GATr consistently outperforms other models and scales better with larger datasets.", "section": "5.1 Predictive modelling"}, {"figure_path": "TWfNFCOPaK/figures/figures_23_1.jpg", "caption": "Figure 2: Qualitative signal prediction results. We show a single floor plan from the WiPTR test set. The black lines indicate the walls and doors, the colors show the received power as a function of the transmitter location (brighter colours mean a stronger signal). The transmitting antenna is shown as a black cross. The z coordinates of transmitter and receiver are all fixed to the same height. We compare the ground-truth predictions (top left) to the predictions from different predictive models, each trained on only 100 WiPTR floor plans. Wi-GATr is able to generalize to this unseen floor plan even with such a small training set.", "description": "This figure compares the ground truth received power with the predictions from three different models (Transformer, ViT, and Wi-GATr) for a single floor plan from the WiPTR dataset. Each model was trained using only 100 floor plans. The black lines represent the walls and doors, while the colors represent the received power strength at different transmitter locations. The figure demonstrates Wi-GATr's ability to generalize to unseen floor plans, even with limited training data, outperforming the other two models.", "section": "5 Experiments"}]