[{"figure_path": "9hKN99RNdR/tables/tables_4_1.jpg", "caption": "Table 1: Runtimes per experiment.", "description": "This table shows the runtime statistics for each experiment conducted in the paper.  The metrics reported include total runtime in hours, total number of steps, episode length, and seconds per episode.  The experiments covered include 3-Block Stacking, Walker, Ant Maze, Point Maze, Block Rotation, and Pen Rotation. These results provide insights into the computational cost of each task and can be used to compare the efficiency of the proposed method (CE2) with other methods.", "section": "G Implementation Details"}, {"figure_path": "9hKN99RNdR/tables/tables_4_2.jpg", "caption": "Table 1: Runtimes per experiment.", "description": "This table presents the runtime statistics for each experiment conducted in the study.  The experiments were performed on an Nvidia A100 GPU with approximately 5GB of memory. The table shows the total runtime in hours, total number of steps, episode length, and seconds per episode for six different environments: 3-Block Stacking, Walker, Ant Maze, Point Maze, Block Rotation, and Pen Rotation.  The table highlights the computational cost associated with each experiment, illustrating the time efficiency (or inefficiency) of the different experimental settings.", "section": "G.2 Runtime"}, {"figure_path": "9hKN99RNdR/tables/tables_5_1.jpg", "caption": "Table 1: Runtimes per experiment.", "description": "This table presents the computational cost of the proposed CE2 algorithm and baselines across six different reinforcement learning environments.  It shows the total runtime in hours, the total number of steps taken, the length of each episode in steps, and the average time spent per episode in seconds. The table provides insights into the computational efficiency of the different methods, enabling a comparison of their resource requirements.", "section": "G Implementation Details"}, {"figure_path": "9hKN99RNdR/tables/tables_18_1.jpg", "caption": "Table 1: Runtimes per experiment.", "description": "This table presents the runtime statistics for each experiment conducted in the paper.  It breaks down the total runtime in hours, the total number of steps taken, the episode length (number of steps per episode), and the time taken per episode in seconds. The experiments covered include 3-Block Stacking, Walker, Ant Maze, Point Maze, Block Rotation, and Pen Rotation. The data provides insights into the computational cost and efficiency of each experimental task.", "section": "G.2 Runtime"}, {"figure_path": "9hKN99RNdR/tables/tables_18_2.jpg", "caption": "Table 1: Runtimes per experiment.", "description": "This table shows the runtime statistics for each of the six experiments conducted in the paper.  It provides the total runtime in hours, the total number of steps taken during the experiment, the episode length, and the average number of seconds it took to complete a single episode for each experiment. The experiments are: 3-Block Stacking, Walker, Ant Maze, Point Maze, Block Rotation, and Pen Rotation.", "section": "G.2 Runtime"}, {"figure_path": "9hKN99RNdR/tables/tables_18_3.jpg", "caption": "Table 1: Runtimes per experiment.", "description": "This table presents the runtime statistics for each experiment conducted in the study. It shows the total runtime in hours, the total number of steps taken, the episode length, and the number of seconds per episode for six different environments: 3-Block Stacking, Walker, Ant Maze, Point Maze, Block Rotation, and Pen Rotation.  These statistics provide insights into the computational cost and efficiency of the experiments.", "section": "G.2 Runtime"}, {"figure_path": "9hKN99RNdR/tables/tables_18_4.jpg", "caption": "Table 1: Runtimes per experiment.", "description": "This table shows the runtime statistics for each experiment conducted in the paper, broken down by environment.  It includes the total runtime in hours, the total number of steps taken, the episode length, and the average number of seconds per episode.  This data provides insights into the computational cost and efficiency of the proposed CE2 algorithm compared to baseline methods.", "section": "G Implementation Details"}, {"figure_path": "9hKN99RNdR/tables/tables_19_1.jpg", "caption": "Table 1: Runtimes per experiment.", "description": "This table presents the runtime statistics for each experiment conducted in the paper.  It details the total runtime in hours, the total number of steps taken during each experiment, the length of each episode, and the average number of seconds required per episode for six different environments: 3-Block Stacking, Walker, Ant Maze, Point Maze, Block Rotation, and Pen Rotation.  This information allows readers to gauge the computational cost and efficiency of the experiments performed.", "section": "G.2 Runtime"}, {"figure_path": "9hKN99RNdR/tables/tables_19_2.jpg", "caption": "Table 1: Runtimes per experiment.", "description": "This table presents the runtime statistics for each experiment conducted in the paper, broken down by environment.  It shows the total runtime in hours, the total number of steps simulated, the episode length, and the average seconds per episode.  The data provides insights into the computational cost of the proposed method and baselines across different task complexities.", "section": "G.2 Runtime"}, {"figure_path": "9hKN99RNdR/tables/tables_19_3.jpg", "caption": "Table 1: Runtimes per experiment.", "description": "This table presents the runtime statistics for each experiment conducted in the paper, broken down by environment.  It shows the total runtime in hours, the total number of steps, the episode length, and the average seconds per episode. These metrics provide a quantitative assessment of the computational demands of the different experimental tasks.", "section": "G.2 Runtime"}, {"figure_path": "9hKN99RNdR/tables/tables_20_1.jpg", "caption": "Table 1: Runtimes per experiment.", "description": "This table presents the computational cost of the proposed CE2 algorithm and its variants across different robotic environments.  It shows the total runtime in hours, the total number of steps, the length of each episode, and the average time (in seconds) spent per episode for each environment. This provides a measure of the computational efficiency of the algorithm across various tasks of varying complexity.", "section": "G.2 Runtime"}, {"figure_path": "9hKN99RNdR/tables/tables_20_2.jpg", "caption": "Table 1: Runtimes per experiment.", "description": "This table shows the runtime statistics for each experiment conducted in the paper.  The experiments were performed on an Nvidia A100 GPU with approximately 5GB of memory. The table lists the total runtime in hours, the total number of steps, the episode length (in timesteps), and the average time (in seconds) required to complete a single episode for each of the six environments (3-Block Stacking, Walker, Ant Maze, Point Maze, Block Rotation, Pen Rotation).  The runtime data provides insights into the computational cost and efficiency of the different experiments.", "section": "G.2 Runtime"}, {"figure_path": "9hKN99RNdR/tables/tables_21_1.jpg", "caption": "Table 1: Runtimes per experiment.", "description": "This table presents the computational cost of the experiments conducted in the paper.  For each of the six environments (3-Block Stacking, Walker, Ant Maze, Point Maze, Block Rotation, Pen Rotation), it shows the total runtime in hours, the total number of steps taken, the episode length in steps, and the time taken per episode in seconds.  This helps to give an understanding of the resource requirements of the experiments and to compare the relative computational costs of the different environments.", "section": "G.2 Runtime"}, {"figure_path": "9hKN99RNdR/tables/tables_21_2.jpg", "caption": "Table 2: Computation time needed to optimize goal states", "description": "This table presents a comparison of the computation time required by three different methods (CE², PEG, and MEGA) to optimize goal states for launching the Go-Explore procedure in the 3-Block Stacking environment.  The time is measured in seconds per episode.", "section": "G.2 Runtime"}]