[{"figure_path": "2Inwtjvyx8/figures/figures_1_1.jpg", "caption": "Figure 1: Illustration depicting the impact of camera on attack performance. The bounding boxes indicate the YOLOv5 [17] detector successfully detects the person. In each setting, we maintain scene consistency to minimize irrelevant influences. In contrast to the AdvPatch [29] attack, which is effective only on Samsung devices, our method successfully executes attacks across all six cameras.", "description": "This figure compares the success rate of the AdvPatch attack [29] and the proposed CAP attack across six different cameras (Sony, Canon, iPhone, Redmi, Huawei, and Samsung).  The top row shows the results of the AdvPatch attack, which only successfully concealed the person in one out of six camera images. The bottom row displays the results for the CAP attack, showing success across all six cameras, highlighting its camera-agnostic nature and improved robustness.", "section": "1 Introduction"}, {"figure_path": "2Inwtjvyx8/figures/figures_3_1.jpg", "caption": "Figure 2: Overview of our adversarial optimization framework. The framework comprises two mutually adversarial parts: Attacker and Defender. The attacker optimizes adversarial perturbations to maximize attack effectiveness, while the defender optimizes the conditional input hyperparameter of the ISP proxy network to minimize attack effectiveness. The two parts cyclically alternate during the optimization stage.", "description": "This figure illustrates the adversarial optimization framework used in the paper.  It consists of two modules: an attacker and a defender. The attacker module aims to maximize the effectiveness of the adversarial patches by optimizing them. The defender module aims to minimize the effectiveness of the attacks by optimizing the conditional parameters of a camera ISP proxy network. The two modules engage in an iterative process of optimization, with the attacker's optimization being followed by the defender's optimization, and this process continuing until convergence or a set number of iterations are reached. The ultimate goal is to create an adversarial patch that is effective across multiple cameras.", "section": "3 Camera-Agnostic Attack"}, {"figure_path": "2Inwtjvyx8/figures/figures_5_1.jpg", "caption": "Figure 3: Illustration of digital-space attacks under different ISP settings. The bounding boxes indicate the detector successfully detects the person instances, i.e., the attack fails. Due to space constraints, we only present one comparative method, T-SEA [15]. For additional results, please refer to the Supplementary Material.", "description": "This figure compares the performance of different attack methods in a digital space under various ISP settings.  Three rows represent different attack methods: a benign image without attack, T-SEA attack, and the proposed CAP attack. The columns show the detection results under different ISP settings (Original, ISP1, ISP2, ISP3, ISP4), indicated by the bounding boxes around the detected persons. Each setting maintains the same scene. The red boxes indicate successful detection of the person; in contrast, attacks are successful when no bounding boxes are shown. The results illustrate that the CAP attack consistently fails to fool the detector, even under different camera ISP settings, whereas T-SEA occasionally fools the detector.", "section": "4 Experiments"}, {"figure_path": "2Inwtjvyx8/figures/figures_6_1.jpg", "caption": "Figure 1: Illustration depicting the impact of camera on attack performance. The bounding boxes indicate the YOLOv5 [17] detector successfully detects the person. In each setting, we maintain scene consistency to minimize irrelevant influences. In contrast to the AdvPatch [29] attack, which is effective only on Samsung devices, our method successfully executes attacks across all six cameras.", "description": "This figure shows a comparison of the success rate of adversarial attacks against person detection using different cameras.  The top row shows the results using the AdvPatch method, where only one out of six cameras successfully concealed the person.  The bottom row shows results using the proposed CAP method, where all six cameras successfully concealed the person, demonstrating its camera-agnostic nature.", "section": "1 Introduction"}, {"figure_path": "2Inwtjvyx8/figures/figures_7_1.jpg", "caption": "Figure 6: Physical-space attacks across six different cameras. Our method removing the camera ISP module only achieves successful attacks on specific cameras. Our method removing the adversarial optimization slightly outperforms the former. In contrast, our full method achieves successful attacks across all six cameras.", "description": "This figure compares the attack success rate of three different versions of the proposed CAP attack method across six different cameras: Sony, Canon, iPhone, Redmi, Huawei, and Samsung. The three versions are: 1) without the camera ISP module; 2) without adversarial optimization; and 3) the full method (with both camera ISP module and adversarial optimization).  The results show that removing either the camera ISP module or the adversarial optimization significantly reduces the attack's effectiveness and cross-camera consistency.  Only the full CAP attack method achieves consistent success across all six cameras.", "section": "4.3 Camera-Agnostic Attack in Physical Space"}]