[{"figure_path": "8B3sAX889P/figures/figures_1_1.jpg", "caption": "Figure 1: Phenotype imputation with multi-modal biological data. \"M1\" denotes Modality 1, and \"M2\" represents Modality 2. \"-\" refers to the missing modality and the red question mark refers to the phenotype that needs to be imputed.", "description": "This figure illustrates the concept of phenotype imputation using multi-modal biological data.  It shows a matrix representing phenotypes (P1-P4) with some missing values represented by question marks.  A second matrix shows corresponding multi-modal biological data (M1, M2) with missing data represented by dashes. The connection between the two is made via a central icon representing the integration of biological and clinical data to infer missing phenotypes. The resulting imputed phenotypes are shown in a third matrix.", "section": "1 Introduction"}, {"figure_path": "8B3sAX889P/figures/figures_3_1.jpg", "caption": "Figure 2: An overview of the MPI framework: (1) Residual Quantization quantizes the biological data and uncovers the underlying factors. (2) Biological-view GNN and Phenotype-view GNN are employed to encode the correlation between patients, biological factors, and phenotypes in separate graphs. (3) Cross-view knowledge distillation makes use of learned representations from different views and enhances the imputation.", "description": "This figure illustrates the MPI (Multimodal Phenotype Imputation) framework, which consists of three main components. First, Residual Quantization processes the multi-modal biological data to identify latent biological factors. Second, two separate graph neural networks (GNNs) model the relationships between patients and their biological factors (biological-view GNN), and the relationships between patients and their phenotypes (phenotype-view GNN). Finally, cross-view contrastive knowledge distillation leverages information from both views to improve phenotype imputation, enhancing the model's accuracy and robustness.", "section": "4 The Proposed Method"}, {"figure_path": "8B3sAX889P/figures/figures_8_1.jpg", "caption": "Figure 2: An overview of the MPI framework: (1) Residual Quantization quantizes the biological data and uncovers the underlying factors. (2) Biological-view GNN and Phenotype-view GNN are employed to encode the correlation between patients, biological factors, and phenotypes in separate graphs. (3) Cross-view knowledge distillation makes use of learned representations from different views and enhances the imputation.", "description": "This figure presents an overview of the proposed Multimodal Phenotype Imputation (MPI) framework.  It shows three main stages: (1) Residual Quantization processes the multi-modal biological data to extract latent biological factors. (2)  Two separate graph neural networks (GNNs) model patient relationships—one based on the biological factors (biological view) and one based on phenotype co-occurrences (phenotype view). (3) Cross-view contrastive knowledge distillation is employed to refine phenotype imputation by transferring knowledge from the biological-view GNN to the phenotype-view GNN.", "section": "4 The Proposed Method"}, {"figure_path": "8B3sAX889P/figures/figures_8_2.jpg", "caption": "Figure 2: An overview of the MPI framework: (1) Residual Quantization quantizes the biological data and uncovers the underlying factors. (2) Biological-view GNN and Phenotype-view GNN are employed to encode the correlation between patients, biological factors, and phenotypes in separate graphs. (3) Cross-view knowledge distillation makes use of learned representations from different views and enhances the imputation.", "description": "This figure provides a visual overview of the proposed Multimodal Phenotype Imputation (MPI) framework. It details three key components:\n\n1.  **Residual Quantization:** This step processes the multi-modal biological data, reducing noise and identifying underlying biological factors using a residual quantization technique.\n2.  **Dual-view Graph Neural Networks (GNNs):**  The processed data is fed into two separate GNNs: one focusing on patient-phenotype relationships, and the other focusing on relationships between patients based on their biological factors. These GNNs generate embeddings representing each patient from two different perspectives.\n3.  **Cross-view Contrastive Knowledge Distillation:** This component integrates knowledge from the two separate GNNs.  It leverages information from the biological view to improve the accuracy of the phenotype imputation using a contrastive knowledge distillation strategy.", "section": "4 The Proposed Method"}]