[{"figure_path": "PI0CDY6nmo/tables/tables_1_1.jpg", "caption": "Table 1: Asymptotic Õ(·) regret bounds and per-round time complexities up to poly-logarithmic terms in d, for the following deterministic algorithms: UCB (Auer et al., 2002a), UCBV (Audibert et al., 2009), CUCB (Kveton et al., 2015), OLS-UCB (Degenne and Perchet, 2016), ESCB-C (Perrault et al., 2020b), and OLS-UCB-C (ours); as well as the two stochastic algorithms: CTS-Gaussian (Perrault et al., 2020a) and COS-V (ours).", "description": "The table compares the asymptotic regret bounds and per-round time complexities of several deterministic and stochastic algorithms for combinatorial semi-bandits.  It shows how different algorithms leverage information from the semi-bandit feedback (semi-bandit feedback) and/or knowledge of the covariance structure (covariance-adaptive), affecting both the regret and the computational cost. The algorithms are categorized by feedback type (bandit or semi-bandit) and algorithm type (deterministic or stochastic).  For each algorithm, regret bounds (gap-free and gap-dependent) and time complexity are shown, providing a comprehensive overview of state-of-the-art methods.", "section": "2 Covariance-adaptative deterministic algorithm: OLS-UCB-C"}, {"figure_path": "PI0CDY6nmo/tables/tables_3_1.jpg", "caption": "Table 1: Asymptotic Õ(·) regret bounds and per-round time complexities up to poly-logarithmic terms in d, for the following deterministic algorithms: UCB (Auer et al., 2002a), UCBV (Audibert et al., 2009), CUCB (Kveton et al., 2015), OLS-UCB(a) (Degenne and Perchet, 2016), ESCB-C (Perrault et al., 2020b), and OLS-UCB-C (ours); as well as the two stochastic algorithms: CTS-Gaussian(b) (Perrault et al., 2020a) and COS-V (ours). Notations: a refers to actions; i and j refer to items; m denotes the maximum number of items per action; B is a vector of bounds on the items' rewards; Γ is a covariance-proxy matrix; y is the maximum of \"correlations-proxy\"; we abbreviate max{x, 0} to (x)+ for any x ∈ R; CIT refers to the complexity of the optimisation step needed in ESCB-C.", "description": "This table compares the asymptotic regret bounds and time complexities of several algorithms for solving the stochastic combinatorial semi-bandit problem.  It includes both deterministic and stochastic algorithms, highlighting their information requirements, computational costs, and regret performance in terms of gap-free asymptotic regret. The table categorizes algorithms based on feedback type (bandit or semi-bandit) and includes notations to clarify the symbols used in the regret bounds.", "section": "2 Covariance-adaptative deterministic algorithm: OLS-UCB-C"}, {"figure_path": "PI0CDY6nmo/tables/tables_5_1.jpg", "caption": "Table 1: Asymptotic Õ(·) regret bounds and per-round time complexities up to poly-logarithmic terms in d, for the following deterministic algorithms: UCB (Auer et al., 2002a), UCBV (Audibert et al., 2009), CUCB (Kveton et al., 2015), OLS-UCB (Degenne and Perchet, 2016), ESCB-C (Perrault et al., 2020b), and OLS-UCB-C (ours); as well as the two stochastic algorithms: CTS-Gaussian (Perrault et al., 2020a) and COS-V (ours).", "description": "This table compares the asymptotic regret bounds and per-round time complexities of several combinatorial semi-bandit algorithms.  It shows both deterministic and stochastic approaches, highlighting the gap-free and gap-dependent regret bounds achieved by each algorithm.  The table also details the information used by each algorithm (e.g., covariance matrix or variance proxy) and its computational complexity. The algorithms are categorized by feedback type (bandit or semi-bandit).", "section": "2 Covariance-adaptative deterministic algorithm: OLS-UCB-C"}]