[{"figure_path": "jXs6Cvpe7k/figures/figures_1_1.jpg", "caption": "Figure 1: RPO optimizes a set of trigger tokens that enforces safe outputs even under jailbreaks and adversarial attacks. RPO suffixes are universal and transfer to many LLMs and jailbreaks.", "description": "This figure illustrates the Robust Prompt Optimization (RPO) method.  It shows how RPO works by optimizing a small set of trigger tokens appended to user prompts. These tokens are designed to guide the language model towards safe outputs, even when the prompt is adversarial or attempts to 'jailbreak' the model's safety mechanisms.  The figure highlights the iterative process of defense and jailbreak optimization, showing how RPO adapts to new attack strategies. The resulting 'RPO suffix' is shown to be transferable across different language models (LLMs) and effective against multiple jailbreaking attempts.  The key idea is to find a small, efficient addition to the prompt that significantly improves the model's robustness against malicious inputs.", "section": "1 Introduction"}, {"figure_path": "jXs6Cvpe7k/figures/figures_16_1.jpg", "caption": "Figure 1: RPO optimizes a set of trigger tokens that enforces safe outputs even under jailbreaks and adversarial attacks. RPO suffixes are universal and transfer to many LLMs and jailbreaks.", "description": "This figure illustrates how Robust Prompt Optimization (RPO) works.  A user provides a potentially harmful prompt (e.g., asking how to spread hate speech).  The prompt is then processed through an ethical gate, which uses RPO's optimized trigger tokens to ensure a safe response.  The figure showcases that even when adversarial attacks (jailbreaks) are attempted, RPO modifies the prompt with a suffix, preventing the LLM from generating harmful output.  The system remains robust to both known and unknown jailbreaks, highlighting the effectiveness and transferability of the RPO approach across various LLMs.", "section": "1 Introduction"}, {"figure_path": "jXs6Cvpe7k/figures/figures_21_1.jpg", "caption": "Figure 1: RPO optimizes a set of trigger tokens that enforces safe outputs even under jailbreaks and adversarial attacks. RPO suffixes are universal and transfer to many LLMs and jailbreaks.", "description": "This figure illustrates how Robust Prompt Optimization (RPO) works.  It shows a user providing a prompt that could elicit a harmful response from a language model like GPT-4.  The RPO system intervenes by adding a suffix to the prompt. This suffix is designed to prevent the model from generating unsafe responses, even if the original prompt is modified by an adversary to try to 'jailbreak' it. The optimized suffix is shown to be effective across various language models (LLMs) and different types of attacks.", "section": "1 Introduction"}]