[{"figure_path": "znBiAp5ISn/figures/figures_3_1.jpg", "caption": "Figure 1: Analysis on spike frequency variation of GCN using IMDB-BINARY [54] dataset.", "description": "The figure shows the analysis of spike frequency variation in Graph Convolutional Networks (GCNs) using the IMDB-BINARY dataset. It consists of two subfigures: (a) Histogram showing the distribution of total spikes counted over time for each node, demonstrating that many nodes show very few spikes, suggesting the problem of neuron starvation, and (b) Heatmap visualizing spike frequency across layers and nodes grouped and sorted by node degree. The heatmap reveals patterns such as high-degree nodes exhibiting higher spike frequencies, spike frequencies correlated with the corresponding nodes, and feature neurons within a node behaving differently according to their positions.", "section": "3 Analysis on Spike Frequency Variation of GNNs"}, {"figure_path": "znBiAp5ISn/figures/figures_3_2.jpg", "caption": "Figure 1: Analysis on spike frequency variation of GCN using IMDB-BINARY [54] dataset.", "description": "This figure analyzes the spike frequency variation in Graph Convolutional Networks (GCNs) using the IMDB-BINARY dataset.  Subfigure (a) shows histograms of the total spike counts for each node across three layers of the GCN, revealing a skewed distribution with many nodes having few spikes (starvation). Subfigure (b) presents a heatmap visualizing spike frequency across feature dimensions and nodes sorted by degree. Brighter colors indicate higher spike frequencies. This heatmap demonstrates that high-degree nodes tend to exhibit higher spike frequencies, illustrating the correlation between node degree and spike frequency.  The horizontal strips represent the spike frequencies associated with specific nodes, while vertical strips show differing behavior of feature neurons within a single node.", "section": "3 Analysis on Spike Frequency Variation of GNNs"}, {"figure_path": "znBiAp5ISn/figures/figures_4_1.jpg", "caption": "Figure 2: Overall graph classification architecture with proposed methods.", "description": "This figure illustrates the overall architecture of the TAS-GNN model for graph classification.  The input graphs are first encoded into spike representations using a Poisson encoder. Then, the message passing is performed in a spike format within multiple GNN layers interspersed with SNN layers that include the proposed topology-aware group-adaptive neurons. Finally, the graph embeddings are processed by a readout layer and a classification head to produce the classification result. This process is repeated for multiple timesteps (t=1 to t=T) to further refine the classification decision.", "section": "4 Proposed Method"}, {"figure_path": "znBiAp5ISn/figures/figures_5_1.jpg", "caption": "Figure 3: Sensitivity of neurons to its initial threshold.", "description": "This figure shows the sensitivity of the adaptive neurons in the proposed TAS-GNN model to their initial threshold values. The accuracy of the model is plotted against different initial threshold values (Vinit) for three different GNN architectures: GCN, GAT, and GIN. The results demonstrate that the performance of the adaptive neurons is highly sensitive to the choice of initial threshold values, indicating the need for careful tuning or learning of these values.", "section": "4.3 Reducing the Initial Threshold Sensitivity"}, {"figure_path": "znBiAp5ISn/figures/figures_7_1.jpg", "caption": "Figure 4: Sensitivity study of neurons to its initial threshold.", "description": "This figure shows the sensitivity analysis of neurons to their initial thresholds. The x-axis represents different initial threshold values, and the y-axis represents the accuracy. Three different GNN models (GCN, GAT, and GIN) are compared in terms of their performance under both the topology-aware group adaptive neuron (TAG) method and the proposed method. The results indicate that the proposed method is less sensitive to initial threshold variations, demonstrating its robustness and stability.", "section": "4.3 Reducing the Initial Threshold Sensitivity"}, {"figure_path": "znBiAp5ISn/figures/figures_8_1.jpg", "caption": "Figure 1: Analysis on spike frequency variation of GCN using IMDB-BINARY [54] dataset.", "description": "This figure presents an analysis of spike frequency variation in Graph Convolutional Networks (GCNs) using the IMDB-BINARY dataset.  Subfigure (a) shows histograms illustrating the distribution of total spikes per node across three layers of the GCN. Subfigure (b) provides a heatmap visualization of spike frequencies, with nodes grouped and sorted by degree (descending order), revealing how spike frequency varies across feature dimensions and node degrees. The heatmap shows patterns where high-degree nodes have higher spike frequencies, features within a node behave differently, and neurons in the same position across different nodes behave similarly.", "section": "3 Analysis on Spike Frequency Variation of GNNs"}, {"figure_path": "znBiAp5ISn/figures/figures_8_2.jpg", "caption": "Figure 1: Analysis on spike frequency variation of GCN using IMDB-BINARY [54] dataset.", "description": "This figure analyzes spike frequency variations in Graph Convolutional Networks (GCNs) using the IMDB-BINARY dataset.  Subfigure (a) shows histograms of the total spike counts per node across three layers (Layer 1, Layer 2, Layer 3), illustrating the distribution of spiking activity. Subfigure (b) provides a heatmap visualizing spike frequency variations across feature dimensions and nodes, sorted by degree (from high to low). Brighter colors indicate higher spike frequencies. The heatmap reveals a correlation between node degree and spike frequency, indicating that high-degree nodes tend to have higher spiking activity.", "section": "3 Analysis on Spike Frequency Variation of GNNs"}, {"figure_path": "znBiAp5ISn/figures/figures_15_1.jpg", "caption": "Figure 1: Analysis on spike frequency variation of GCN using IMDB-BINARY [54] dataset.", "description": "This figure analyzes the spike frequency variation in Graph Convolutional Networks (GCNs) using the IMDB-BINARY dataset. It consists of two subfigures:\n(a) shows histograms plotting the distribution of total spikes counted over time for each node in each layer (Layer 1, Layer 2, and Layer 3).  The x-axis represents spike counts and the y-axis represents the density of each bin.\n(b) shows a heatmap visualizing the spike frequency variation across different features and nodes. Nodes are grouped and sorted by their degree in descending order. The x-axis represents feature dimensions and the y-axis represents nodes. Brighter spots indicate higher spike frequencies. This subfigure helps illustrate the relationship between spike frequency, node degree, and feature dimensions. The visualization shows that high-degree nodes exhibit higher spike frequencies. ", "section": "3 Analysis on Spike Frequency Variation of GNNs"}, {"figure_path": "znBiAp5ISn/figures/figures_16_1.jpg", "caption": "Figure 6: Histogram plotting distribution of total spikes counted over time for each node. X-axis denotes spike counts from each node, while y-axis denotes density of each bin.", "description": "This figure shows the distribution of total spikes counted over time for each node in different datasets and models. The X-axis represents the number of spikes per node, while the Y-axis represents the density of nodes with that number of spikes. The figure is split into subplots, each showing the distribution for a different dataset (MUTAG, PROTEINS, ENZYMES, NCI1, IMDB-BINARY) and model (SpikingGNN and TAS-GNN). The figure aims to illustrate the impact of TAS-GNN in alleviating the neuron starvation problem by showing a more uniform spike distribution across nodes, indicating that the modified model utilizes more neurons effectively.", "section": "A.4 Analysis on Spike Frequency"}]