[{"figure_path": "EC9Hfi9V3k/tables/tables_6_1.jpg", "caption": "Table 1: Dataset statistics. Dense is generated synthetically by drawing each edge with probability 0.8, and other four datasets are from KONECT.", "description": "This table presents the statistics of five datasets used in the experiments. Four real-world datasets (NY Times, Twitter WWW, Twitter MPI, Friendster) were obtained from KONECT, while one synthetic dataset (Dense) was generated with a probability of 0.8 for edge creation.", "section": "5 Experiments"}, {"figure_path": "EC9Hfi9V3k/tables/tables_8_1.jpg", "caption": "Table 1: Dataset statistics. Dense is generated synthetically by drawing each edge with probability 0.8, and other four datasets are from KONECT.", "description": "This table presents the characteristics of five datasets used in the paper's experiments.  The datasets include one synthetic dataset ('Dense') and four real-world datasets from the KONECT repository. For each dataset, the table shows the file size in MB, the number of vertices, and the number of edges.", "section": "5 Experiments"}, {"figure_path": "EC9Hfi9V3k/tables/tables_15_1.jpg", "caption": "Table 1: Dataset statistics. Dense is generated synthetically by drawing each edge with probability 0.8, and other four datasets are from KONECT.", "description": "This table presents statistics for five datasets used in the paper's experiments.  Four of the datasets (NY Times, Twitter WWW, Twitter MPI, Friendster) are real-world graphs obtained from the KONECT repository.  The 'Dense' dataset is synthetic, created by randomly assigning edges with a probability of 0.8.  For each dataset, the table lists the file size in MB, the number of vertices, and the number of edges.", "section": "5 Experiments"}, {"figure_path": "EC9Hfi9V3k/tables/tables_18_1.jpg", "caption": "Table 1: Dataset statistics. Dense is generated synthetically by drawing each edge with probability 0.8, and other four datasets are from KONECT.", "description": "This table presents the statistics of five datasets used in the paper's experiments. Four datasets (NY Times, Twitter, Friendster) were obtained from the KONECT repository, while one dataset (Dense) was generated synthetically by assigning a probability of 0.8 to the creation of each edge.  The table shows the file size of each dataset in MB, the number of vertices, and the number of edges.", "section": "5 Experiments"}, {"figure_path": "EC9Hfi9V3k/tables/tables_18_2.jpg", "caption": "Table 1: Dataset statistics. Dense is generated synthetically by drawing each edge with probability 0.8, and other four datasets are from KONECT.", "description": "This table presents the statistics of five datasets used in the paper's experiments.  Four real-world datasets were obtained from the KONECT network collection, while one dataset ('Dense') was synthetically generated with a specified edge probability (0.8). The table shows the file size, number of vertices, and number of edges for each dataset. This information is crucial for understanding the scale and characteristics of the data used in evaluating the proposed streaming algorithms.", "section": "5 Experiments"}, {"figure_path": "EC9Hfi9V3k/tables/tables_19_1.jpg", "caption": "Table 1: Dataset statistics. Dense is generated synthetically by drawing each edge with probability 0.8, and other four datasets are from KONECT.", "description": "This table presents statistics for five graph datasets used in the paper's experiments.  Four datasets (NY Times, Twitter WWW, Twitter MPI, Friendster) were obtained from the KONECT repository. One dataset (Dense) was synthetically generated with an edge probability of 0.8 to represent a dense graph.  The table lists the file size of each dataset in MB, the number of vertices (nodes), and the number of edges.", "section": "5 Experiments"}]