[{"figure_path": "LuqrIkGuru/figures/figures_4_1.jpg", "caption": "Figure 1: The overall framework of NIFA: (a) Utilizing uncertainty estimation, nodes exhibiting high uncertainty (depicted as shaded nodes) are designated as targeted nodes. (b) Injected nodes are equally assigned to each sensitive group, and only connect targeted nodes with the same sensitive attribute. (c) After node injection, the injected feature matrix and surrogate model are optimized iteratively by diverse objective functions.", "description": "This figure illustrates the three main steps of the Node Injection-based Fairness Attack (NIFA) method.  First, it identifies nodes with high model uncertainty as targets for injection. Second, it injects new nodes, distributing them evenly across sensitive groups and connecting them only to target nodes within the same group to increase homophily.  Finally, it iteratively optimizes the features of the injected nodes using multiple objective functions, balancing fairness and utility.", "section": "4.1 Framework overview"}, {"figure_path": "LuqrIkGuru/figures/figures_8_1.jpg", "caption": "Figure 1: The overall framework of NIFA: (a) Utilizing uncertainty estimation, nodes exhibiting high uncertainty (depicted as shaded nodes) are designated as targeted nodes. (b) Injected nodes are equally assigned to each sensitive group, and only connect targeted nodes with the same sensitive attribute. (c) After node injection, the injected feature matrix and surrogate model are optimized iteratively by diverse objective functions.", "description": "This figure illustrates the framework of the Node Injection-based Fairness Attack (NIFA). It consists of three main stages:\n(a) Uncertainty Estimation: Nodes with high model uncertainty are selected as target nodes for injection.\n(b) Node Injection: Injected nodes are assigned to sensitive groups and connected to target nodes within the same group to increase homophily.\n(c) Feature Optimization: Injected nodes' features and a surrogate model are iteratively optimized using multiple objective functions to maximize fairness and maintain utility.", "section": "4.1 Framework overview"}, {"figure_path": "LuqrIkGuru/figures/figures_8_2.jpg", "caption": "Figure 3: Defense performance on Pokec-z with masking η training nodes with the highest uncertainty", "description": "The figure shows the impact of masking a proportion (η) of training nodes with the highest uncertainty on the fairness attack performance.  As the proportion of masked nodes increases, the attack's effectiveness diminishes, as indicated by decreases in Δsp and Δeo.  This suggests that focusing on nodes with high model uncertainty is a key aspect of the attack strategy.  Despite the defense mechanism's impact, there is still significant deterioration of fairness compared to the baseline.  Accuracy is only slightly affected by the defense.", "section": "5.4 Ablation study"}, {"figure_path": "LuqrIkGuru/figures/figures_18_1.jpg", "caption": "Figure 1: The overall framework of NIFA: (a) Utilizing uncertainty estimation, nodes exhibiting high uncertainty (depicted as shaded nodes) are designated as targeted nodes. (b) Injected nodes are equally assigned to each sensitive group, and only connect targeted nodes with the same sensitive attribute. (c) After node injection, the injected feature matrix and surrogate model are optimized iteratively by diverse objective functions.", "description": "This figure illustrates the framework of the Node Injection-based Fairness Attack (NIFA). It shows three main stages: (a) Uncertainty Estimation, where nodes with high uncertainty are selected as targets for injection; (b) Node Injection, where injected nodes are connected to target nodes within the same sensitive group to increase homophily; and (c) Feature Optimization, where the features of injected nodes and a surrogate model are iteratively optimized to maximize unfairness.", "section": "4.1 Framework overview"}, {"figure_path": "LuqrIkGuru/figures/figures_19_1.jpg", "caption": "Figure 1: The overall framework of NIFA: (a) Utilizing uncertainty estimation, nodes exhibiting high uncertainty (depicted as shaded nodes) are designated as targeted nodes. (b) Injected nodes are equally assigned to each sensitive group, and only connect targeted nodes with the same sensitive attribute. (c) After node injection, the injected feature matrix and surrogate model are optimized iteratively by diverse objective functions.", "description": "This figure illustrates the three main steps of the Node Injection-based Fairness Attack (NIFA) framework.  First, it shows how nodes with high model uncertainty are identified as targets for injection. Second, it details the node injection strategy, where injected nodes are connected only to target nodes within the same sensitive group, increasing homophily. Finally, it describes the iterative optimization process of the injected nodes' features and the surrogate model to maximize fairness attacks while maintaining model utility.", "section": "4.1 Framework overview"}, {"figure_path": "LuqrIkGuru/figures/figures_19_2.jpg", "caption": "Figure 1: The overall framework of NIFA: (a) Utilizing uncertainty estimation, nodes exhibiting high uncertainty (depicted as shaded nodes) are designated as targeted nodes. (b) Injected nodes are equally assigned to each sensitive group, and only connect targeted nodes with the same sensitive attribute. (c) After node injection, the injected feature matrix and surrogate model are optimized iteratively by diverse objective functions.", "description": "This figure illustrates the framework of the Node Injection-based Fairness Attack (NIFA).  It shows three main stages:\n\n(a) **Uncertainty Estimation:**  The algorithm identifies nodes with high model uncertainty, making them more susceptible to attacks. These nodes are highlighted in the figure.\n(b) **Node Injection:**  New nodes (injected nodes) are added to the graph.  Crucially, these nodes are connected only to target nodes (identified in stage a) that share the same sensitive attribute (e.g., gender, race), thus increasing homophily within sensitive groups.\n(c) **Feature Optimization:** The features of the injected nodes are iteratively optimized using multiple objective functions. This optimization aims to maximize the attack's impact on fairness while maintaining the model's overall utility.", "section": "4.1 Framework overview"}, {"figure_path": "LuqrIkGuru/figures/figures_19_3.jpg", "caption": "Figure 1: The overall framework of NIFA: (a) Utilizing uncertainty estimation, nodes exhibiting high uncertainty (depicted as shaded nodes) are designated as targeted nodes. (b) Injected nodes are equally assigned to each sensitive group, and only connect targeted nodes with the same sensitive attribute. (c) After node injection, the injected feature matrix and surrogate model are optimized iteratively by diverse objective functions.", "description": "This figure illustrates the framework of the Node Injection-based Fairness Attack (NIFA). It shows three main steps: uncertainty estimation to identify target nodes, node injection while ensuring equal distribution across sensitive groups and connections only with nodes of the same attribute, and iterative optimization of injected node features and a surrogate model to enhance the attack's effectiveness.", "section": "4.1 Framework overview"}, {"figure_path": "LuqrIkGuru/figures/figures_19_4.jpg", "caption": "Figure 1: The overall framework of NIFA: (a) Utilizing uncertainty estimation, nodes exhibiting high uncertainty (depicted as shaded nodes) are designated as targeted nodes. (b) Injected nodes are equally assigned to each sensitive group, and only connect targeted nodes with the same sensitive attribute. (c) After node injection, the injected feature matrix and surrogate model are optimized iteratively by diverse objective functions.", "description": "This figure illustrates the framework of the Node Injection-based Fairness Attack (NIFA). It is a three-stage process: First, nodes with high model uncertainty are selected as targets for injection. Second, injected nodes are connected to the target nodes within the same sensitive group. Third, the injected features and surrogate model are optimized iteratively to maximize the attack's effectiveness.", "section": "4.1 Framework overview"}]