[{"figure_path": "nF34qXcY0b/figures/figures_8_1.jpg", "caption": "Figure 1: Convergence rate of the LSE for pendulum and quadrotor scenarios: (a) Pendulum example with uniform, (b) Pendulum example with truncated-Gaussian, (c) Quadrotor example with uniform, and (d) Quadrotor example with truncated-Gaussian noises and disturbances. Here, uniform noises and disturbances are i.i.d. generated from uniform([-1,1]), and truncated-Gaussian noises and disturbances are i.i.d. generated from truncated-Gaussian (0,0.1, [-1,1]). \"theo\" denotes the theoretical convergence rate, and \"empr\" represents the empirical rate. The mean error across 20 trials is shown by dots on the empirical plots, with shaded areas illustrating empirical standard deviation.", "description": "This figure compares the theoretical and empirical convergence rates of the least squares estimation (LSE) method for two different systems (pendulum and quadrotor) under different noise distributions (uniform and truncated Gaussian).  The plots show that the empirical convergence rates closely match the theoretical rates, demonstrating the effectiveness of LSE in these scenarios.", "section": "Numerical Experiments"}, {"figure_path": "nF34qXcY0b/figures/figures_9_1.jpg", "caption": "Figure 2: Convergence rate of the SME for pendulum and quadrotor scenarios: (a) Pendulum example with uniform, (b) Pendulum example with truncated-Gaussian, (c) Quadrotor example with uniform, and (d) Quadrotor example with truncated-Gaussian noises and disturbances. Here, uniform noises and disturbances are i.i.d. generated from uniform([-1,1]), and truncated-Gaussian noises and disturbances are i.i.d. generated from truncated-Gaussian (0, 0.5, [-1,1]). \"theo\" denotes the theoretical convergence rate, and \"empr\" represents the empirical rate. The mean error across 10 trials is shown by dots on the empirical plots, with shaded areas illustrating empirical standard deviation.", "description": "This figure compares the theoretical and empirical convergence rates of the Set Membership Estimation (SME) method for estimating the uncertainty set of parameters in a pendulum and quadrotor system.  The plots show that the empirical convergence rates closely match the theoretical rates derived in the paper, for both uniform and truncated Gaussian noise distributions.  The results support the claim that SME converges efficiently under independent and identically distributed (i.i.d) random inputs.", "section": "Numerical Experiments"}, {"figure_path": "nF34qXcY0b/figures/figures_9_2.jpg", "caption": "Figure 3: Performance of SME for pendulum in (a) with control input ut = −k&t + nt where k = 0.1, nt i.i.d. generated from truncated-Gaussian(0, 2, [−2, 2]) and disturbed with wt i.i.d. generated from truncated-Gaussian(0, 1, [−1, 1]). (b) Diameter of the uncertainty set estimated by SME. (c) Uncertainty set depicted for T = 50, 200, 250, 400, 500.", "description": "This figure shows the performance of Set Membership Estimation (SME) for a pendulum system.  Panel (a) illustrates the pendulum system. Panel (b) presents a plot of the uncertainty set diameter versus trajectory length T.  Panel (c) displays the uncertainty sets estimated by SME at different trajectory lengths, illustrating how they contract as the trajectory length increases. The true parameter values are shown for comparison.", "section": "Numerical Experiments"}, {"figure_path": "nF34qXcY0b/figures/figures_21_1.jpg", "caption": "Figure 4: 2D projections of the uncertainty set estimated by SME for the unknown parameters of the quadrotor example. The noises and disturbances are i.i.d generated from truncated-Gaussian(0,0.5, [-1,1]).", "description": "This figure shows the 2D projections of the uncertainty sets estimated by the Set Membership Estimation (SME) method for the quadrotor example. Each plot displays two parameters' uncertainty sets across different trajectory lengths (T = 200, 500, 1000, 2000) along with the ground truth (marked with a red star). The noises and disturbances are independently and identically distributed (i.i.d.) and generated from a truncated Gaussian distribution with mean 0, variance 0.5, and truncated range [-1, 1].  The figure illustrates how the uncertainty sets contract towards the true parameter values as the trajectory length increases.", "section": "Numerical Experiments"}]