[{"figure_path": "Bj2CpB9Dey/figures/figures_4_1.jpg", "caption": "Figure 1: Visual motivation for the TSCI method. Observed time series are related to latent states evolving on some manifolds. Given observed time series x(t) and y(t), we reconstruct latent states x(t) and ỹ(t) that reside in manifolds Mx and My, respectively. If x and y are causally coupled, there should exist a function F that maps between these manifolds. Using the Jacobian matrix JF, we can map the velocity vector field on Mx to a vector field on My, and use the angle between velocity vectors as a measure of their similarity.", "description": "This figure provides a visual explanation of the Tangent Space Causal Inference (TSCI) method.  It shows two manifolds, Mx and My, representing the latent state spaces of two observed time series, x(t) and y(t).  A function F maps between these manifolds, and its Jacobian matrix, JF(x), transforms tangent vectors from the tangent space of Mx (TxMx) to the tangent space of My at F(x) (TF(x)My). The angle between the transformed and original tangent vectors provides a measure of similarity, which is used by TSCI to infer causality.", "section": "2.2 Tangent Space Causal Inference"}, {"figure_path": "Bj2CpB9Dey/figures/figures_6_1.jpg", "caption": "Figure 2: Shadow manifolds Mx and My from the unidirectionally coupled Rössler-Lorenz system Eq. (13) with C = 1, and the corresponding histograms of û and v. The test statistics, rx→y and ry→x, correspond to the means of these distributions.", "description": "This figure visualizes the shadow manifolds (Mx and My) of a unidirectionally coupled Rössler-Lorenz system (with coupling strength C=1).  It shows the manifolds with tangent vectors overlaid, illustrating the concept of mapping vector fields between manifolds using Jacobian matrices. The histograms display the distribution of cosine similarities between the tangent vectors of one manifold and the mapped tangent vectors from the other manifold, for both directions (x→y and y→x). The means of these distributions represent the TSCI test statistics, which reveal the degree of similarity between the vector fields and, therefore, the causal relationship between the systems.", "section": "3.1 Unidirectionally-Coupled Rössler-Lorenz System"}, {"figure_path": "Bj2CpB9Dey/figures/figures_7_1.jpg", "caption": "Figure 3: Comparison of TSCI with CCM for the Rössler-Lorenz system (true causation X → Y). The plotted lines show the median test statistic over 100 trials for both CCM and TSCI, and the shaded region indicates the 5th and 95th percentiles when (a) C is varied from 0 (no coupling) to 3 (approximate general synchrony), and (b) C is fixed to 1.0 and the library length is varied.", "description": "This figure compares the performance of Tangent Space Causal Inference (TSCI) and Convergent Cross Mapping (CCM) methods on a unidirectionally coupled Rössler-Lorenz system.  Subfigure (a) shows how the median test statistic of both methods varies with the coupling strength (C) between the two systems, while subfigure (b) demonstrates the impact of library length (the length of the time series used for analysis) on the test statistic for a fixed coupling strength of C=1.0. Shaded areas represent the 5th and 95th percentiles across 100 trials, illustrating variability in performance.", "section": "3.1 Unidirectionally-Coupled Rössler-Lorenz System"}, {"figure_path": "Bj2CpB9Dey/figures/figures_14_1.jpg", "caption": "Figure 4: Comparison of TSCI and CCM for the unidirectionally coupled Rössler-Lorenz system Eq. (13) with C = 1. Here, x(t) = z2(t) and y(t) = z4(t), and the true causality is x → y. The red lines indicate the values of Qx and Qy selected by false-nearest neighbors with a tolerance of 0.01.", "description": "This figure compares the performance of Tangent Space Causal Inference (TSCI) and Convergent Cross Mapping (CCM) methods in detecting causal relationships in a unidirectionally coupled Rössler-Lorenz system.  The heatmaps illustrate the test statistics (correlation coefficients) for different embedding dimensions (Qx and Qy) for both methods,  showing the direction of causality (X→Y or Y→X). The red lines represent the embedding dimensions selected by a false-nearest neighbor algorithm which helps determine the optimal number of dimensions to accurately capture the system's dynamics. The figure aims to demonstrate that TSCI is more robust in detecting the true causality compared to CCM across various embedding dimensions.", "section": "3.1 Unidirectionally-Coupled Rössler-Lorenz System"}, {"figure_path": "Bj2CpB9Dey/figures/figures_14_2.jpg", "caption": "Figure 5: Comparison of TSCI with CCM for the Rössler-Lorenz system (true causation X → Y) with additive noise. The plotted lines show the median test statistic over 100 trials for both CCM and TSCI, and the shaded region indicates the 5th and 95th percentiles when (a) C is fixed to 1.0 and the signal-to-noise ratio is varied.", "description": "The figure compares the performance of TSCI and CCM in the presence of additive noise in the Rössler-Lorenz system.  It shows the median test statistic and its 5th and 95th percentiles over 100 trials for both algorithms, while varying the signal-to-noise ratio. The true causal relationship is X → Y. The shaded areas represent the variability of the results.", "section": "3.3 Additional Experiments"}, {"figure_path": "Bj2CpB9Dey/figures/figures_15_1.jpg", "caption": "Figure 6: Results of the Rössler-Lorenz system with C = 1 corrupted by an additive sine signal of varying amplitude. The amplitude of the signal, relative to the sine wave, is plotted in decibels on the horizontal axis.", "description": "This figure compares the performance of TSCI and CCM in detecting causality when the Rössler-Lorenz system is affected by an additive sine wave signal. The x-axis represents the relative signal power of the sine wave in dB, which is varied to simulate different levels of signal corruption.  The y-axis shows the correlation coefficient, a measure of the strength of the detected causal relationship. The plot displays the median test statistic over 100 trials, with shaded regions showing the 5th and 95th percentiles.  Separate lines are plotted for both the true causal direction (x→y) and the opposite direction (y→x) for both TSCI and CCM. The results show that both methods' performance degrades as the sine wave's relative power increases, meaning that higher signal corruption negatively impacts the accuracy of causal inference. However, TSCI shows greater resilience to false claims of strong causation at higher relative signal powers than CCM.", "section": "3.3 Additional Experiments"}, {"figure_path": "Bj2CpB9Dey/figures/figures_15_2.jpg", "caption": "Figure 7: Results of the Rössler-Lorenz system using the cosine similarity and mutual information while varying C. Compare to Figure 2a in the main manuscript.", "description": "This figure compares the results obtained using cosine similarity (CS) and mutual information (MI) as test statistics for the TSCI algorithm applied to a Rössler-Lorenz system with varying coupling strength (C). The top panel displays the results using cosine similarity, while the bottom panel shows the results using mutual information.  Each panel shows the TSCI scores (rx→y and ry→x) for both the causal direction (x → y) and the reversed direction (y → x) as a function of C.  The shaded areas represent confidence intervals, highlighting the variability of the results.  This figure serves to compare the performance and interpretability of cosine similarity against mutual information as test statistics in the TSCI approach.", "section": "B.3 Using the Mutual Information for Scores"}]