[{"figure_path": "wJAF8TGVUG/figures/figures_3_1.jpg", "caption": "Figure 1: Overview of S-MolSearch Framework", "description": "This figure illustrates the architecture of the S-MolSearch framework.  It shows two encoders, fe and gy. Encoder fe processes limited labeled molecules using contrastive learning to generate a similarity matrix and embeddings. Encoder gy processes the full dataset (labeled and unlabeled molecules).  The embeddings from fe, without gradient updates, are used to compute a similarity matrix. Optimal transport is then used to transfer information from fe to gy, generating soft labels for gy which are used in training along with the full data similarity matrix. The framework combines semi-supervised contrastive learning with optimal transport to leverage both labeled and unlabeled data for more effective molecule search.", "section": "3 Method"}, {"figure_path": "wJAF8TGVUG/figures/figures_8_1.jpg", "caption": "Figure 2: t-SNE visualization of molecular representations learned by S-MolSearch versus pretrained checkpoint. Different colors represent different protein targets' active molecules.", "description": "This figure compares the t-distributed Stochastic Neighbor Embedding (t-SNE) visualizations of molecular representations generated by two different approaches: (a) using a pretrained checkpoint (Uni-Mol), and (b) using the S-MolSearch model.  Different colors represent molecules that bind to different protein targets. The visualization aims to show how well the different methods separate molecules according to their target protein. The S-MolSearch model shows clearer separation between different targets and tighter clustering within each target, suggesting that it learns more informative representations that better capture the relationships between molecular structure and activity.", "section": "3.2 Pretraining Backbone of Molecular Encoder"}, {"figure_path": "wJAF8TGVUG/figures/figures_8_2.jpg", "caption": "Figure 2: t-SNE visualization of molecular representations learned by S-MolSearch versus pretrained checkpoint. Different colors represent different protein targets' active molecules.", "description": "This figure compares the t-SNE visualizations of molecular representations learned by the S-MolSearch model and a pretrained checkpoint.  The visualizations show how well the model separates molecules based on their protein targets.  Different colors represent different protein targets. The S-MolSearch model shows a better separation of the molecules indicating that it better captures the relationships between molecules and their protein targets.", "section": "3 Method"}, {"figure_path": "wJAF8TGVUG/figures/figures_9_1.jpg", "caption": "Figure 3: Performance on DUD-E and LIT-PCBA with varying numbers of labeled data, while keeping unlabeled data fixed at 1m. The blue bars represent the results of encoder gψ, while the green bars represent the results of encoder fe.", "description": "This figure shows the performance of both encoder fθ (trained only on labeled data) and encoder gψ (trained on both labeled and unlabeled data) on the DUD-E and LIT-PCBA datasets.  The x-axis represents the amount of labeled data used for training, ranging from 1k to 1m.  The y-axis shows the EF1% (Enrichment Factor at 1% of the database screened), a metric evaluating the effectiveness of virtual screening.  The results clearly demonstrate that using unlabeled data significantly improves performance (blue bars consistently outperform green bars) and that there is an optimal amount of labeled data for best performance. Beyond a certain amount, increasing labeled data doesn't improve results.", "section": "4.4.3 Impact of Labeled Data Scale"}, {"figure_path": "wJAF8TGVUG/figures/figures_16_1.jpg", "caption": "Figure 4: Qualitative examples of similarities for targets hdac2 and csflr in DUD-E.", "description": "This figure shows examples of similar molecules retrieved by S-MolSearch for two target proteins (hdac2 and csflr) from the DUD-E dataset.  For each target, the query molecule is shown alongside its top-ranked similar molecules.  The embedding similarity (calculated by S-MolSearch) and Tanimoto similarity (a traditional measure of molecular similarity) are provided for each pair, demonstrating the correlation between the two similarity metrics.", "section": "F Qualitative Examples of Similarities"}]