[{"figure_path": "MtRvzJBsBA/tables/tables_4_1.jpg", "caption": "Table 1: Quantitative results comparing LRM-Zero with GS-LRM [107] (trained on Objaverse) under the 8-input-view setting. We use GSO [28] and ABO [18] evaluation datasets and PSNR, SSIM, and LPIPS [108] metrics. LRM-Zero demonstrates competitive performance against GS-LRM.", "description": "This table presents a quantitative comparison of the performance of two 3D reconstruction models: LRM-Zero (trained on synthetic data) and GS-LRM (trained on Objaverse).  The comparison is based on metrics (PSNR, SSIM, LPIPS) calculated using two benchmark datasets (GSO and ABO) with 8 input views.  The results show that LRM-Zero achieves competitive results to GS-LRM, demonstrating the efficacy of training with fully synthesized data.", "section": "4.2 Results"}, {"figure_path": "MtRvzJBsBA/tables/tables_7_1.jpg", "caption": "Table 1: Quantitative results comparing LRM-Zero with GS-LRM [107] (trained on Objaverse) under the 8-input-view setting. We use GSO [28] and ABO [18] evaluation datasets and PSNR, SSIM, and LPIPS [108] metrics. LRM-Zero demonstrates competitive performance against GS-LRM.", "description": "This table presents a quantitative comparison of the performance of the LRM-Zero model (trained on synthetic data) and the GS-LRM model (trained on Objaverse) on two standard 3D reconstruction benchmarks: GSO and ABO.  The comparison uses three metrics: PSNR, SSIM, and LPIPS, which evaluate the visual quality of the 3D reconstructions.  The results demonstrate that LRM-Zero achieves competitive performance compared to GS-LRM, suggesting that high-quality 3D reconstruction is possible even without training on real-world data.", "section": "4.2 Results"}, {"figure_path": "MtRvzJBsBA/tables/tables_8_1.jpg", "caption": "Table 1: Quantitative results comparing LRM-Zero with GS-LRM [107] (trained on Objaverse) under the 8-input-view setting. We use GSO [28] and ABO [18] evaluation datasets and PSNR, SSIM, and LPIPS [108] metrics. LRM-Zero demonstrates competitive performance against GS-LRM.", "description": "This table presents a quantitative comparison of the performance of LRM-Zero and GS-LRM on two standard 3D reconstruction benchmarks, GSO and ABO.  The comparison uses the PSNR, SSIM, and LPIPS metrics, with the experiment configured to use 8 input views.  The results show that LRM-Zero achieves competitive performance compared to GS-LRM, which was trained on the Objaverse dataset, despite LRM-Zero being trained solely on synthetic data.", "section": "4.2 Results"}, {"figure_path": "MtRvzJBsBA/tables/tables_8_2.jpg", "caption": "Table 5: NeRF-LRM-Zero performs competitively against NeRF-LRM-Objv.", "description": "This table presents a quantitative comparison of the performance of two NeRF-based Large Reconstruction Models (LRMs): NeRF-LRM-Zero and NeRF-LRM-Objv.  NeRF-LRM-Zero is trained using the synthetic Zeroverse dataset, while NeRF-LRM-Objv is trained using the Objaverse dataset. The comparison is based on the PSNR, SSIM, and LPIPS metrics evaluated on the GSO and ABO benchmark datasets.  The results indicate that despite being trained on fully synthesized data, NeRF-LRM-Zero achieves comparable performance to NeRF-LRM-Objv, which is trained on real-world data. This highlights the potential of using synthetic data for training effective 3D reconstruction models.", "section": "5.3 Generalization"}, {"figure_path": "MtRvzJBsBA/tables/tables_8_3.jpg", "caption": "Table 1: Quantitative results comparing LRM-Zero with GS-LRM [107] (trained on Objaverse) under the 8-input-view setting. We use GSO [28] and ABO [18] evaluation datasets and PSNR, SSIM, and LPIPS [108] metrics. LRM-Zero demonstrates competitive performance against GS-LRM.", "description": "This table presents a quantitative comparison of the performance of two 3D reconstruction models: LRM-Zero and GS-LRM.  LRM-Zero is trained using only synthetic data, while GS-LRM is trained on the Objaverse dataset. The comparison is made using three metrics (PSNR, SSIM, LPIPS) and two evaluation datasets (GSO, ABO). The results show that LRM-Zero, despite being trained on synthetic data, achieves competitive performance compared to GS-LRM.", "section": "4.2 Results"}, {"figure_path": "MtRvzJBsBA/tables/tables_17_1.jpg", "caption": "Table 1: Quantitative results comparing LRM-Zero with GS-LRM [107] (trained on Objaverse) under the 8-input-view setting. We use GSO [28] and ABO [18] evaluation datasets and PSNR, SSIM, and LPIPS [108] metrics. LRM-Zero demonstrates competitive performance against GS-LRM.", "description": "This table presents a quantitative comparison of the performance of LRM-Zero and GS-LRM on two benchmark datasets (GSO and ABO) using three metrics (PSNR, SSIM, and LPIPS).  LRM-Zero, trained on synthetic data, is compared to GS-LRM, which was trained on the Objaverse dataset. The results show that LRM-Zero achieves competitive performance to GS-LRM, demonstrating the effectiveness of training with synthetic data.", "section": "4.2 Results"}, {"figure_path": "MtRvzJBsBA/tables/tables_20_1.jpg", "caption": "Table 1: Quantitative results comparing LRM-Zero with GS-LRM [107] (trained on Objaverse) under the 8-input-view setting. We use GSO [28] and ABO [18] evaluation datasets and PSNR, SSIM, and LPIPS [108] metrics. LRM-Zero demonstrates competitive performance against GS-LRM.", "description": "This table presents a quantitative comparison of the performance of LRM-Zero and GS-LRM on two benchmark datasets (GSO and ABO) using three metrics (PSNR, SSIM, LPIPS).  The comparison is done for the 8-input-view setting, highlighting the performance of LRM-Zero, which is trained only on synthetic data, relative to the GS-LRM model trained on real-world data (Objaverse).", "section": "4.2 Results"}, {"figure_path": "MtRvzJBsBA/tables/tables_21_1.jpg", "caption": "Table 1: Quantitative results comparing LRM-Zero with GS-LRM [107] (trained on Objaverse) under the 8-input-view setting. We use GSO [28] and ABO [18] evaluation datasets and PSNR, SSIM, and LPIPS [108] metrics. LRM-Zero demonstrates competitive performance against GS-LRM.", "description": "This table presents a quantitative comparison of the performance of LRM-Zero and GS-LRM on two standard 3D reconstruction benchmarks (GSO and ABO).  It uses 8 input views and evaluates the results using three metrics: PSNR, SSIM, and LPIPS.  The results demonstrate that LRM-Zero, despite being trained only on synthetic data, achieves comparable performance to GS-LRM, which is trained on real-world data (Objaverse).", "section": "4.2 Results"}, {"figure_path": "MtRvzJBsBA/tables/tables_23_1.jpg", "caption": "Table 1: Quantitative results comparing LRM-Zero with GS-LRM [107] (trained on Objaverse) under the 8-input-view setting. We use GSO [28] and ABO [18] evaluation datasets and PSNR, SSIM, and LPIPS [108] metrics. LRM-Zero demonstrates competitive performance against GS-LRM.", "description": "This table presents a quantitative comparison of the performance of LRM-Zero and GS-LRM models on two benchmark datasets, GSO and ABO.  The comparison is done using three metrics: PSNR, SSIM, and LPIPS, all common in evaluating image quality.  The results show that LRM-Zero, a model trained entirely on synthetic data, achieves comparable results to GS-LRM, which was trained on the real-world Objaverse dataset.  The comparison is performed using 8 input views.", "section": "4.2 Results"}, {"figure_path": "MtRvzJBsBA/tables/tables_24_1.jpg", "caption": "Table 1: Quantitative results comparing LRM-Zero with GS-LRM [107] (trained on Objaverse) under the 8-input-view setting. We use GSO [28] and ABO [18] evaluation datasets and PSNR, SSIM, and LPIPS [108] metrics. LRM-Zero demonstrates competitive performance against GS-LRM.", "description": "This table presents a quantitative comparison of the performance of LRM-Zero and GS-LRM models on two benchmark datasets, GSO and ABO.  The comparison is based on three metrics: PSNR, SSIM, and LPIPS. The results show that LRM-Zero, trained entirely on synthetic data, achieves competitive performance to GS-LRM, which was trained on the real-world Objaverse dataset.  The experiment used 8 input views.", "section": "4.2 Results"}, {"figure_path": "MtRvzJBsBA/tables/tables_24_2.jpg", "caption": "Table 1: Quantitative results comparing LRM-Zero with GS-LRM [107] (trained on Objaverse) under the 8-input-view setting. We use GSO [28] and ABO [18] evaluation datasets and PSNR, SSIM, and LPIPS [108] metrics. LRM-Zero demonstrates competitive performance against GS-LRM.", "description": "This table presents a quantitative comparison of the performance of LRM-Zero and GS-LRM on two standard 3D reconstruction benchmarks (GSO and ABO) using 8 input views.  The metrics used are PSNR, SSIM, and LPIPS, which measure the visual quality of the 3D reconstruction.  The results show that LRM-Zero, which is trained solely on synthetic data, achieves competitive results to GS-LRM, which uses real-world data for training.", "section": "4.2 Results"}]