[{"figure_path": "UaJErAOssN/figures/figures_2_1.jpg", "caption": "Figure 1: GRAPHSSM framework.", "description": "The figure illustrates the GRAPHSSM framework, which is a state space model for temporal graphs. The framework consists of multiple blocks, each containing a graph convolution layer, an SSM layer, and a residual connection. The input is a sequence of graph snapshots, and the output is a prediction of some property of the graph.", "section": "3 The GRAPHSSM framework"}, {"figure_path": "UaJErAOssN/figures/figures_4_1.jpg", "caption": "Figure 2: Illustrative example of the unobserved graph mutation issue. In this example, the underlying graph is observed at time points τ₁, τ₂, τ₃ with two unobserved mutations between [τ₁, τ₂) and one between [τ₂, τ₃). These unobserved mutations result in temporal dynamics that are inconsistent across the observed intervals, thereby complicating direct applications of ODE discretization methods such as the Euler method or the zero-order hold (ZOH) method.", "description": "This figure illustrates the problem of unobserved graph mutations in temporal graphs.  The underlying graph changes at times t₁, t₂, t₄, and t₅, but these changes are not observed directly. Instead, only snapshots of the graph are observed at times τ₁, τ₂, and τ₃.  These unobserved mutations make it difficult to model the continuous-time evolution of the graph using standard ODE discretization methods.", "section": "3.2 Unobserved graph mutations and mixed discretization"}, {"figure_path": "UaJErAOssN/figures/figures_8_1.jpg", "caption": "Figure 3: Comparison of GRAPHSSM with different initialization strategies.", "description": "This figure compares the performance of GRAPHSSM using three different initialization strategies for the A matrix: HIPPO, Random, and Constant. The results are shown for four different datasets: DBLP-3, Brain, Reddit, and DBLP-10.  The y-axis represents the Micro-F1 score (%), a measure of the model's performance. The figure illustrates that the HIPPO initialization strategy consistently outperforms the other two, suggesting it is a more effective approach for this task.", "section": "Experiments"}]