[{"figure_path": "Ln8ogihZ2S/figures/figures_5_1.jpg", "caption": "Figure 1: Smoothing and predictive performance on bouncing ball and pendulum. To the left of the red line are samples from the posterior during the data window projected to image space, to the right of the red line are samples unrolled from po(Zt | Zt-1). a) while all methods are adept at smoothing in the context window, our methods predictive performance is better by a noticeable margin as measured by the R2. b) similar results hold for the bouncing ball dataset.", "description": "This figure compares the smoothing and predictive performance of the proposed method (XFADS) against several other state-of-the-art methods on two datasets: a pendulum and a bouncing ball.  The left side of the red line in each subplot shows the smoothed posterior, which represents the model's estimate of the system's state during the observation window. The right side shows predictions made by unrolling the learned dynamics from the end of the observed data.  The figure highlights that while several methods perform comparably at smoothing, XFADS significantly outperforms them in predictive accuracy, as measured by the R-squared (R2) value.", "section": "Experiments"}, {"figure_path": "Ln8ogihZ2S/figures/figures_6_1.jpg", "caption": "Figure 2: a) Empirical time complexity scaling. Since complexity is a function of L, S, and r, we vary L (top) for fixed r = 10 and (bottom) for fixed S = 5; we examine several values of the variable not fixed. Examining wall-clock time shows empirically our implementation scales linearly in L; on the (bottom) we plot wall-clock time for a Kalman filter implementation, showing the standard cubic dependence on L. b) (top) Negative ELBO as a function of training epoch when N = L (bottom) when N = L/5; the left column shows the case L = 50 and the right when L = 100. Different colors indicate different settings of the local/backward encoder rank; zooming in for L = 100, shows low-rank updates can match diagonal ones. c) Peristimulus time histogram (PSTH) for the DMFC RSG dataset for different trial condition averages; we consider a context window of 1.3s and a prediction window of 1.3s. d) BPS for each method for context/prediction windows.", "description": "Figure 2 presents an empirical analysis of the proposed method's time complexity and performance. Panel (a) demonstrates the linear scaling of the method's time complexity with the latent state dimension (L), contrasting with the cubic scaling of a Kalman filter. Panel (b) shows the negative ELBO's convergence over training epochs for different rank configurations of the local/backward encoder, illustrating that low-rank updates can achieve comparable performance to diagonal updates. Panel (c) displays peristimulus time histograms (PSTHs) for different trial conditions of the DMFC RSG dataset, illustrating the ability of the method to capture and predict neural dynamics. Finally, panel (d) provides a comparison of bits-per-spike (BPS) values across different methods and conditions.", "section": "Experiments"}, {"figure_path": "Ln8ogihZ2S/figures/figures_8_1.jpg", "caption": "Figure 3: Predict behavior from a causally inferred initial condition. a) Actual reaches. b) (top) Reaches linearly decoded from smoothed (R<sup>2</sup> = 0.89), causally filtered (R<sup>2</sup> = 0.88), & predicted (R<sup>2</sup> = 0.74) latent trajectories starting from an initial condition causally inferred during the preparatory period. (bottom) Top 3 principal latent dimensions per regime (smoothing/filtering/prediction) for three example trials. c) bps / R<sup>2</sup> of predicted hand velocity using rates inferred from the 700ms context window and the 500ms prediction window. d) Velocity decoding R<sup>2</sup> using predicted trajectories as a function of how far into the trial the latent state was filtered until it was only sampled from the autonomous dynamics; by the the movement onset, behavioral predictions using latent trajectory predictions are nearly on par with behavior decoded from the smoothed posterior.", "description": "This figure demonstrates the model's ability to predict behavior from a causally inferred initial condition.  Panel (a) shows actual monkey reaches. Panel (b) displays the reaches linearly decoded from the smoothed, causally filtered, and predicted latent trajectories. The top part shows the complete reaches, while the bottom part zooms into the top three principal latent dimensions to showcase the dynamics. Panel (c) provides a comparison of bits per spike (BPS) and R-squared (R<sup>2</sup>) values for predicted hand velocity using different context and prediction windows. Finally, panel (d) illustrates the predictive performance against the time into the trial, highlighting that predictions become comparable to the smoothed posterior at the movement onset.", "section": "Experiments"}, {"figure_path": "Ln8ogihZ2S/figures/figures_21_1.jpg", "caption": "Figure 6: XFADS predictive capabilities on real data. On the left are example reaches the monkey made during several trials. Using the learned model from the monkey reaching experiment, we filtered neural activity starting from -240ms up until -80ms before movement onset (each vertical panel represents the result from filtering more and more data) and unroll the final filtered states through the dynamics (starting from the dashed red line) to make predictions.", "description": "This figure shows the predictive performance of the XFADS model on real monkey reaching data.  The leftmost panel displays example reaches from the monkey. The remaining panels show the model's ability to predict hand movement speed at different time points before the actual movement onset.  The model uses increasing amounts of data (indicated by R² values and time to movement onset) to improve the prediction accuracy.  The predicted hand movement speeds (red line) are compared to the true speeds (black line).  The grey shading represents the variability/uncertainty in the model's predictions.", "section": "Experiments"}]