[{"figure_path": "M20p6tq9Hq/figures/figures_3_1.jpg", "caption": "Figure 1: The considered data-generating process. The latent variables Z follow a nonlinear causal model with additive Gaussian noises. We observe them after an unknown linear mixing.", "description": "The figure illustrates the data generating process described in the paper.  It shows how latent variables Z are generated by a nonlinear causal model with additive Gaussian noise. These latent variables are then linearly mixed to produce the observed variables X. The arrows represent causal relationships, with the direction indicating the influence of one variable on another. The figure shows that multiple latent variables can influence the same observed variable (and vice versa), and demonstrates the process of disentanglement that aims to extract individual causal factors from the mixed observational data.", "section": "2 Setup"}, {"figure_path": "M20p6tq9Hq/figures/figures_8_1.jpg", "caption": "Figure 3: Score oracle simulations. (A) Estimated versus true latent variables on the line graph. (B) Estimated versus true latent variables on the Y-structure. (C) Estimated versus true exogenous variables on the line graph. (D) Estimated versus true exogenous variables on the Y-structure.", "description": "This figure shows the results of applying the proposed algorithms to simulated data with perfect score oracles.  Panels (A) and (B) display scatter plots comparing the estimated latent variables to their true values for a linear causal graph and a Y-shaped causal graph, respectively. The color coding helps visualize the relationships between the variables. Panels (C) and (D) present heatmaps showing the mean absolute correlations (MAC) between the estimated and true exogenous noise variables for both graph structures, illustrating the accuracy of disentanglement.", "section": "Numerical Results"}, {"figure_path": "M20p6tq9Hq/figures/figures_9_1.jpg", "caption": "Figure 3: Score oracle simulations. (A) Estimated versus true latent variables on the line graph. (B) Estimated versus true latent variables on the Y-structure. (C) Estimated versus true exogenous variables on the line graph. (D) Estimated versus true exogenous variables on the Y-structure.", "description": "This figure displays the results of simulations using perfect score oracles. It shows the relationship between the estimated and true latent variables for both line and Y-structure causal graphs. Scatter plots visualize the relationships between estimated and true latent variables, while heatmaps show the mean absolute correlations between estimated and true exogenous noise variables. The results demonstrate the algorithm's ability to accurately recover latent variables, particularly for root nodes in the causal graphs.", "section": "5 Numerical Results"}]