[{"figure_path": "oTZYhOAMhX/tables/tables_6_1.jpg", "caption": "Table 1: Group recommendation performance. Bold and underlined values denote the best and the runner-up.  denotes the model relies on group annotations. ° denotes the unsupervised model.", "description": "This table presents the performance comparison of various group recommendation methods on two datasets (Mafengwo and CAMRa2011).  The metrics used are Hit Ratio@5 (HR@5), HR@10, Normalized Discounted Cumulative Gain@5 (NDCG@5), NDCG@10, and the average of these four metrics.  The table highlights the best performing method (bold and underlined) and indicates whether a method uses group annotations (using a superscript *) or is unsupervised (°). It shows how the proposed unsupervised method (ITR°) performs compared to existing state-of-the-art supervised and unsupervised methods.", "section": "4.3 Comparison Experiment"}, {"figure_path": "oTZYhOAMhX/tables/tables_8_1.jpg", "caption": "Table 1: Group recommendation performance. Bold and underlined values denote the best and the runner-up.  denotes the model relies on group annotations. ° denotes the unsupervised model.", "description": "This table presents the performance of various group recommendation methods on two datasets (Mafengwo and CAMRa2011) in terms of HR@5, HR@10, NDCG@5, and NDCG@10.  The results highlight the performance difference between models that utilize group annotations and unsupervised models.  The ITR model, an unsupervised approach, shows competitive results, particularly on the CAMRa2011 dataset.", "section": "4.3 Comparison Experiment"}, {"figure_path": "oTZYhOAMhX/tables/tables_9_1.jpg", "caption": "Table 1: Group recommendation performance. Bold and underlined values denote the best and the runner-up.  denotes the model relies on group annotations. ° denotes the unsupervised model.", "description": "This table presents the performance of various group recommendation models on two datasets (Mafengwo and CAMRa2011).  The metrics used are Hit Ratio@5 (HR@5), Hit Ratio@10 (HR@10), Normalized Discounted Cumulative Gain@5 (NDCG@5), and NDCG@10.  The table compares supervised and unsupervised models, highlighting the best performing model in each category.  The average performance across all metrics is also shown.", "section": "4.3 Comparison Experiment"}, {"figure_path": "oTZYhOAMhX/tables/tables_9_2.jpg", "caption": "Table 1: Group recommendation performance. Bold and underlined values denote the best and the runner-up.  denotes the model relies on group annotations. ° denotes the unsupervised model.", "description": "This table presents the performance of various group recommendation methods on two datasets (Mafengwo and CAMRa2011).  The metrics used are HR@5, HR@10, NDCG@5, and NDCG@10.  The table shows the performance of both supervised (using group annotations) and unsupervised methods.  The best and second-best results are highlighted for each metric and dataset.", "section": "4.3 Comparison Experiment"}, {"figure_path": "oTZYhOAMhX/tables/tables_9_3.jpg", "caption": "Table 2: Performance of user recommendation. Bold and underlined values denote the best and the runner-up.  denotes the model relies on group annotations. ° denotes the unsupervised model.", "description": "This table presents the results of user recommendation experiments on two datasets (Mafengwo and CAMRa2011).  It compares the performance of the proposed ITR model against twelve state-of-the-art methods across four metrics: HR@5, HR@10, NDCG@5, and NDCG@10.  The table highlights the best and second-best performing models for each metric and dataset. The notation  indicates methods that utilize group annotations, while ° denotes unsupervised models.  The results demonstrate ITR's performance in the user recommendation task, even without leveraging group information.", "section": "4.3 Comparison Experiment"}, {"figure_path": "oTZYhOAMhX/tables/tables_16_1.jpg", "caption": "Table 1: Group recommendation performance. Bold and underlined values denote the best and the runner-up.  denotes the model relies on group annotations. ° denotes the unsupervised model.", "description": "This table presents the performance of various group recommendation methods on two datasets (Mafengwo and CAMRa2011) in terms of HR@5, HR@10, NDCG@5, and NDCG@10.  It compares the performance of the proposed unsupervised ITR model against twelve state-of-the-art methods, highlighting the superior performance of ITR, especially when group annotations are unavailable.", "section": "4.3 Comparison Experiment"}, {"figure_path": "oTZYhOAMhX/tables/tables_18_1.jpg", "caption": "Table 6: A/B testing on real-time industrial recommender. The symbol '-' denotes business secret.", "description": "This table presents the results of A/B testing conducted on a real-time industrial recommender system.  It compares the performance of a baseline model ('Base') against the same model enhanced with the proposed ITR framework ('Base+ITR').  The metrics used measure click-through rates (uvctr, pvctr) and trade metrics (uv, pv). Percentage improvements are shown for the 'Base+ITR' model compared to the baseline.", "section": "7.6.2 A/B Testing"}]