{"importance": "This paper is crucial for researchers working on **spike-based neural networks** and **neuromorphic computing**. It addresses the challenge of efficient and balanced learning in supervised scenarios, offering a novel architecture and competition regulation mechanism.  This improves accuracy and opens avenues for building more efficient and powerful spiking neural networks for various applications. The proposed methods are relevant to the current trend of using local learning rules in SNNs and minimize the dependence on labeled data.", "summary": "Neuronal Competition Groups (NCGs) enhance supervised STDP training in spiking neural networks by promoting balanced competition and improved class separation, resulting in significantly higher classification accuracy.", "takeaways": ["Neuronal Competition Groups (NCGs) improve spiking neural network classification accuracy by promoting the learning of various patterns per class.", "The proposed two-compartment threshold mechanism in NCGs ensures balanced competition and fair decision-making during training.", "NCGs significantly improve the accuracy of state-of-the-art supervised STDP rules on image recognition datasets, achieving performance comparable to fully-supervised methods with greater efficiency."], "tldr": "Spiking Neural Networks (SNNs) are energy-efficient alternatives to traditional Artificial Neural Networks. However, training SNNs using local learning rules like Spike Timing-Dependent Plasticity (STDP) remains a challenge. While unsupervised STDP with Winner-Takes-All (WTA) competition is effective for feature extraction, applying it to supervised classification poses difficulties due to unbalanced competition. This limits the ability of SNNs to accurately learn various class-specific patterns.\nThis research introduces Neuronal Competition Groups (NCGs), which improve the classification capabilities of SNNs trained with supervised STDP. NCGs use a two-compartment threshold mechanism for balanced competition regulation within each class. Experimental results on image datasets demonstrate that NCGs significantly improve the accuracy of state-of-the-art supervised STDP rules by learning multiple patterns per class. This makes it possible to achieve comparable accuracy to fully-supervised methods with improved efficiency.", "affiliation": "Univ. Lille", "categories": {"main_category": "Machine Learning", "sub_category": "Deep Learning"}, "podcast_path": "GeE5qF6ICg/podcast.wav"}