[{"figure_path": "kS9dciADtY/tables/tables_6_1.jpg", "caption": "Table 1: Performance comparison with the state-of-the-art methods on THUMOS14 and ActivityNet v1.3. Average mAP is calculated to evaluate performance at different tIoU thresholds: [0.3:0.1:0.7] for THUMOS14 and [0.5:0.05:0.95] for ActivityNet v1.3. † represents using the prompt ensemble.", "description": "This table presents a comparison of the proposed Ti-FAD model's performance against several state-of-the-art zero-shot temporal action detection (ZSTAD) methods.  The comparison is done using two benchmark datasets, THUMOS14 and ActivityNet v1.3, and considers two experimental settings (50/50% and 75/25% seen/unseen classes).  Performance is measured using mean Average Precision (mAP) at various Intersection over Union (IoU) thresholds, providing a comprehensive evaluation of the models' accuracy and robustness in localizing and classifying actions.", "section": "4.2 Main Results"}, {"figure_path": "kS9dciADtY/tables/tables_7_1.jpg", "caption": "Table 2: Analysis of contributions of each component on THUMOS14.", "description": "This table presents an ablation study evaluating the impact of individual components of the proposed Ti-FAD model on the THUMOS14 dataset.  It shows the performance (mAP@AVG) under two different train/test split settings (50%-50% and 75%-25%) by incrementally adding components: SAM (Salient Attentive Mask), S-FAD (soft foreground-aware head), and H-FAD (hard foreground-aware head). Row 1 represents the baseline model without any of these additions, while subsequent rows progressively incorporate each component to show the contribution of each. The final row (8) displays the full Ti-FAD model's performance.", "section": "4.3 Further Analysis"}, {"figure_path": "kS9dciADtY/tables/tables_7_2.jpg", "caption": "Table 3: Analysis of X-MHA operation in TiCA module on THUMOS14.", "description": "This table presents the results of an ablation study on the THUMOS14 dataset, investigating the impact of different cross-attention mechanisms within the TiCA module on the model's performance.  Specifically, it compares the performance when using only text-to-vision cross-attention, only vision-to-text cross-attention, and both, reporting the average mean Average Precision (mAP) at different Intersection over Union (IoU) thresholds (0.3, 0.5, and 0.7). The results help determine the optimal cross-attention strategy for the TiCA module.", "section": "4.3 Further Analysis"}, {"figure_path": "kS9dciADtY/tables/tables_8_1.jpg", "caption": "Table 4: Ablation studies of our Ti-FAD on THUMOS14 in the 50%-50% setting.", "description": "This table presents the ablation study results for the proposed Ti-FAD model on the THUMOS14 dataset under the 50%-50% split setting (50% of classes for training and the rest for testing).  The study investigates different design choices of the model's components by systematically removing or changing various features.  Specifically, it looks at the impact of different kernel functions (Tophat, Cauchy, Gaussian) used for the Saliency Attentive Mask (SAM) and the effects of different ways of applying this mask to the cross-attention mechanism, as well as the impact of using fixed or learnable parameters for the Gaussian mask's standard deviation (σ). The results show the average mean Average Precision (mAP) at different temporal Intersection over Union (tIoU) thresholds (0.3, 0.5, 0.7).", "section": "4.3 Further Analysis"}, {"figure_path": "kS9dciADtY/tables/tables_8_2.jpg", "caption": "Table 4: Ablation studies of our Ti-FAD on THUMOS14 in the 50%-50% setting.", "description": "This table presents the ablation study results on the THUMOS14 dataset using the 50%-50% train/test split. It shows the impact of different design choices for the salient attentive mask (SAM) component of the Ti-FAD model on the mean average precision (mAP) at different intersection over union (IoU) thresholds (0.3, 0.5, 0.7). The table is organized to show the effects of different kernel types for SAM, different structures for combining SAM with visual features, different sigma values for the Gaussian kernel, and different text prompt tuning strategies.", "section": "4.3 Further Analysis"}, {"figure_path": "kS9dciADtY/tables/tables_8_3.jpg", "caption": "Table 4: Ablation studies of our Ti-FAD on THUMOS14 in the 50%-50% setting.", "description": "This table presents the ablation study results on the THUMOS14 dataset using a 50/50 train/test split.  The study systematically investigates the impact of different design choices within the Ti-FAD model.  Specifically, it examines the effects of varying the kernel design of the Saliency Attentive Mask (SAM), the structure used to incorporate SAM with visual features, the sigma (σ) values of the Gaussian mask used in SAM, and the impact of text prompt tuning strategies on model performance. Each row represents a different configuration, allowing readers to assess the contribution of each component to the overall model performance.", "section": "4.3 Further Analysis"}, {"figure_path": "kS9dciADtY/tables/tables_8_4.jpg", "caption": "Table 4: Ablation studies of our Ti-FAD on THUMOS14 in the 50%-50% setting.", "description": "This table presents the ablation study results for the Ti-FAD model on the THUMOS14 dataset using a 50%-50% train-test split.  It shows the impact of different design choices on the model's performance, measured by mAP@tIoU at thresholds of 0.3, 0.5, and 0.7, and the average mAP across these thresholds.  Specific ablation studies include variations in the kernel design for the Salient Attentive Mask (SAM), the structure of SAM, the sigma (σ) value of the Gaussian mask in SAM, and the use of text prompt tuning (TPT).  This table helps to understand which design choices are crucial for the model's performance and provides insights into the model's robustness and the impact of various design elements.", "section": "4.3 Further Analysis"}, {"figure_path": "kS9dciADtY/tables/tables_12_1.jpg", "caption": "Table A: Ablation of cross-modal baseline on THUMOS14.", "description": "This table presents the ablation study of the cross-modal baseline on the THUMOS14 dataset.  It compares the performance of three different models: (a) ActionFormer without cross-modal fusion, (b) a cross-modal baseline using self-attention, and (c) a cross-modal baseline using cross-attention. The results are reported in terms of mean average precision (mAP) at different intersection over union (IoU) thresholds (0.3, 0.5, 0.7).  The table shows the significant impact of cross-modal fusion and the superior performance of cross-attention compared to self-attention for this task.", "section": "A Additional Experiments"}, {"figure_path": "kS9dciADtY/tables/tables_12_2.jpg", "caption": "Table 3: Analysis of X-MHA operation in TiCA module on THUMOS14.", "description": "This table presents the results of an ablation study on the THUMOS14 dataset, investigating the impact of different cross-attention mechanisms within the TiCA (Text-infused Cross Attention) module. It compares the performance using text-to-vision, vision-to-text, and both directions of cross-attention, offering insights into the effectiveness of each approach and the optimal configuration for integrating text and video features.", "section": "4.3 Further Analysis"}, {"figure_path": "kS9dciADtY/tables/tables_13_1.jpg", "caption": "Table C: Comparison with other methods for text prompt engineering on THUMOS14.", "description": "This table compares the performance of the proposed Ti-FAD model and its baseline with several other methods that use different text prompt engineering techniques on the THUMOS14 dataset. The different methods shown are: (a) a simple text prompt, (b) prompt augmentation, (c) prompt ensemble, and (d) the proposed method's baseline. The table shows mAP values for different tIoU thresholds (0.3, 0.5, 0.7) and the average mAP. This allows for an assessment of how different prompt engineering approaches affect performance on zero-shot temporal action detection.", "section": "4.2 Main Results"}]