[{"figure_path": "KvAaIJhqhI/tables/tables_1_1.jpg", "caption": "Table 1: Comparison about different settings of DA.", "description": "This table compares different domain adaptation (DA) settings based on the number of source and target domains, and the availability of domain labels.  It highlights the differences between Unsupervised Domain Adaptation (UDA), Single-Source Domain Adaptation (SSDA), Multi-Source Domain Adaptation (MSDA), Multi-Target Domain Adaptation (MTDA), Blended-Target Domain Adaptation (BTDA), Multi-Source Multi-Target Domain Adaptation (MMDA), and Multi-Source Blended-Target Domain Adaptation (MBDA). The table shows whether domain labels are available for each setting.", "section": "1 Introduction"}, {"figure_path": "KvAaIJhqhI/tables/tables_7_1.jpg", "caption": "Table 2: Accuracy (%) on the DomainNet for MBDA (ResNet-50).", "description": "This table presents the accuracy results of different domain adaptation methods on the DomainNet dataset using ResNet-50.  The methods are compared across various source-target domain combinations, representing different scenarios of multi-source blended-target domain adaptation (MBDA). The table shows the average accuracy across two target domains for each experimental setup, providing a comprehensive comparison of the proposed SAUE method against state-of-the-art techniques.", "section": "4.2 Comparisons to State-of-the-Art"}, {"figure_path": "KvAaIJhqhI/tables/tables_7_2.jpg", "caption": "Table 3: Accuracy (%) on the (a) Office-Home and the (b) ImageCLEF-DA for MBDA (ResNet-50).", "description": "This table presents the accuracy results of different domain adaptation methods on two benchmark datasets, Office-Home and ImageCLEF-DA, using ResNet-50.  It compares the performance of several state-of-the-art methods against the proposed SAUE method on multi-source blended-target domain adaptation (MBDA) tasks.", "section": "4.2 Comparisons to State-of-the-Art"}, {"figure_path": "KvAaIJhqhI/tables/tables_8_1.jpg", "caption": "Table 4: Accuracy (%) on the (a) default version of DomainNet dataset and (b) VisDA-2017 dataset (ResNet-101).", "description": "This table presents the accuracy results of different domain adaptation methods on two benchmark datasets: the default version of DomainNet and VisDA-2017.  The DomainNet results show accuracy for various combinations of source and target domains using ResNet-101.  The VisDA-2017 results show the accuracy for transferring knowledge from the synthetic domain to the real domain.  It compares the performance of the proposed SAUE method against other state-of-the-art domain adaptation techniques.", "section": "4 Experiments"}, {"figure_path": "KvAaIJhqhI/tables/tables_8_2.jpg", "caption": "Table 2: Accuracy (%) on the DomainNet for MBDA (ResNet-50).", "description": "This table presents the accuracy results of the proposed SAUE method and other state-of-the-art domain adaptation methods on the DomainNet dataset.  The results are shown for different combinations of source and target domains using ResNet-50 as the backbone network.  The table demonstrates the superiority of the SAUE method in achieving higher accuracy across various domain adaptation scenarios.", "section": "4.2 Comparisons to State-of-the-Art"}, {"figure_path": "KvAaIJhqhI/tables/tables_9_1.jpg", "caption": "Table 6: Ablation study of SAUE on the DomainNet.", "description": "This table presents the ablation study results on the DomainNet dataset. It shows the performance of the SAUE model when different components are removed. Specifically, it compares the full SAUE model against versions without the style adaptation (SA) module, without the uncertainty loss (Lunc), without both SA and Lunc, and without the Wasserstein Distance (WD) based style selection.  The results highlight the contribution of each component to the overall performance of the SAUE model.", "section": "4.3 Experiment Analysis"}, {"figure_path": "KvAaIJhqhI/tables/tables_9_2.jpg", "caption": "Table 2: Accuracy (%) on the DomainNet for MBDA (ResNet-50).", "description": "This table presents the accuracy results of different domain adaptation methods on the DomainNet dataset using ResNet-50 as the backbone.  The methods are compared across various settings involving different combinations of source and target domains, represented by letters such as R, S, C, P.  The 'Avg.' column indicates the average accuracy across all settings. The numbers in parentheses show the improvement of SAUE over the second-best method (MCDA). The '*' indicates that the results were obtained using the released code of the corresponding method.", "section": "4.2 Comparisons to State-of-the-Art"}, {"figure_path": "KvAaIJhqhI/tables/tables_9_3.jpg", "caption": "Table 3: Accuracy (%) on the (a) Office-Home and the (b) ImageCLEF-DA for MBDA (ResNet-50).", "description": "This table presents the accuracy results achieved by different methods on two benchmark datasets for multi-source blended-target domain adaptation (MBDA) using ResNet-50.  The Office-Home dataset is shown in (a) and the ImageCLEF-DA dataset is shown in (b).  Each cell represents the average accuracy across multiple runs.", "section": "4.2 Comparisons to State-of-the-Art"}]