[{"figure_path": "dIVb5C0QFf/figures/figures_2_1.jpg", "caption": "Figure 1: Illustrations of Meta-Objective Aligner, which follows a three-stage paradigm.", "description": "This figure illustrates the three-stage paradigm of the Meta-Objective Aligner (MetaAligner). Stage 1 involves a dynamic objectives reformulation algorithm that reorganizes traditional alignment datasets to enable flexible alignment across various objectives.  Stage 2 uses a conditional weak-to-strong correction paradigm, aligning weak policy model outputs to stronger, higher-preference outputs by incorporating and combining text descriptions of various alignment objectives. This allows plug-and-play inferences on any policy model, significantly reducing training costs.  Stage 3 employs a generalizable inference method that flexibly adjusts target objectives by updating their text descriptions in prompts, facilitating alignment with unseen objectives. The figure visually represents the workflow with icons and text labels clarifying each step.", "section": "3 Meta-Objective Aligner"}, {"figure_path": "dIVb5C0QFf/figures/figures_5_1.jpg", "caption": "Figure 1: Illustrations of Meta-Objective Aligner, which follows a three-stage paradigm.", "description": "This figure provides a visual overview of the Meta-Objective Aligner's three-stage process. Stage 1 involves the reformulation of raw datasets into dynamic objective datasets.  Stage 2 shows the conditional weak-to-strong correction, where a base model and MetaAligner work together to align weak model outputs to strong outputs based on specified objectives.  Stage 3 highlights the generalizable inference, allowing alignment to new objectives simply by updating the text descriptions within prompts.", "section": "3 Meta-Objective Aligner"}, {"figure_path": "dIVb5C0QFf/figures/figures_7_1.jpg", "caption": "Figure 3: Zero-shot alignment on 6 unseen objectives. In the x-axis, \"Aligned Obj.\" denotes the 4 supervised objectives (\"◊\" markers), and \"+\" denotes further addition of an unseen objective (\"0\" markers). \"+\" denotes the win rates for the unseen objectives before all zero-shot alignments, \"-.\" lines identify win rate fluctuations before alignment, and solid lines identify fluctuations after alignment.", "description": "This figure shows the results of zero-shot alignment experiments using MetaAligner on six unseen objectives.  The x-axis shows the progression of adding unseen objectives one by one to the existing set of four aligned objectives.  The y-axis represents the win rate achieved. The markers show the win rate for each objective. The dashed lines track the win rate changes before zero-shot alignment, while the solid lines show win rate changes after the zero-shot alignment. The overall trend indicates improved performance on both aligned and unseen objectives, illustrating the generalizability of MetaAligner.", "section": "4.4 Generalizable Alignment to Unseen Objectives"}, {"figure_path": "dIVb5C0QFf/figures/figures_8_1.jpg", "caption": "Figure 1: Illustrations of Meta-Objective Aligner, which follows a three-stage paradigm.", "description": "This figure illustrates the three stages of the Meta-Objective Aligner (MetaAligner): dynamic objectives reformulation, conditional weak-to-strong correction, and generalizable inference.  The first stage shows how raw datasets are processed to create dynamic objective datasets used to train the model to align across different objectives.  The second stage depicts how the model corrects weak outputs from policy models to approach strong outputs with higher preferences.  The third stage highlights the model's ability to generalize to unseen objectives by adjusting the text description of the objectives in the prompt. The diagram visually represents the three-stage process and the flow of data through each stage.", "section": "3 Meta-Objective Aligner"}, {"figure_path": "dIVb5C0QFf/figures/figures_18_1.jpg", "caption": "Figure 2: Heatmaps of the objective distributions. The columns categorize samples according to the sizes of their objective set. For the lines, \"Overall\" shows their distributions in the training data. Other lines show objective-wise distributions across different categories in the columns.", "description": "The figure displays heatmaps visualizing the distribution of objectives across different dataset categories.  The columns represent the number of objectives in each data sample, while the rows detail individual objective distributions (including an \"Overall\" row showing the total distribution).  This helps illustrate the balance (or imbalance) of objectives in the training data and the representation of each objective across different dataset sizes.", "section": "4 Experiments"}, {"figure_path": "dIVb5C0QFf/figures/figures_23_1.jpg", "caption": "Figure 1: Illustrations of Meta-Objective Aligner, which follows a three-stage paradigm.", "description": "This figure illustrates the three-stage paradigm of the Meta-Objective Aligner (MetaAligner).  Stage 1 involves dynamic objectives reformulation, where a raw dataset is processed to create warm-up, equal-preference, and contrastive subsets. Stage 2 performs conditional weak-to-strong correction, where a base model and MetaAligner are used to align weak outputs of a target policy model with stronger outputs, incorporating human feedback. Stage 3 enables generalizable inference, where unseen objectives can be handled by adjusting text descriptions within prompts.  The diagram visually represents the flow of data and the interaction between the different components.", "section": "3 Meta-Objective Aligner"}, {"figure_path": "dIVb5C0QFf/figures/figures_23_2.jpg", "caption": "Figure 1: Illustrations of Meta-Objective Aligner, which follows a three-stage paradigm.", "description": "This figure provides a visual representation of the Meta-Objective Aligner's three-stage process: 1) Dynamic Objectives Reformulation, where raw data is processed to create dynamic-objective datasets for flexible alignment across objectives; 2) Conditional Weak-to-Strong Correction, where weak outputs from fixed policy models are corrected to achieve stronger outputs with higher preferences in alignment objectives; 3) Generalizable Inference, where unseen objectives are handled through prompt adjustments, facilitating flexible alignment with unseen objectives.  The figure shows the flow of data through each stage and highlights key components of the Meta-Objective Aligner.", "section": "3 Meta-Objective Aligner"}, {"figure_path": "dIVb5C0QFf/figures/figures_23_3.jpg", "caption": "Figure 1: Illustrations of Meta-Objective Aligner, which follows a three-stage paradigm.", "description": "This figure shows a three-stage paradigm of the Meta-Objective Aligner. Stage 1 is dynamic objectives reformulation, which involves reorganizing traditional alignment datasets to supervise the model on performing flexible alignment across different objectives. Stage 2 is conditional weak-to-strong correction, which aligns the weak outputs of fixed policy models to approach strong outputs with higher preferences in the corresponding alignment objectives.  Stage 3 is generalizable inference, which flexibly adjusts target objectives by updating their text descriptions in the prompts. The figure also illustrates the flow of data and processing through each stage.", "section": "3 Meta-Objective Aligner"}, {"figure_path": "dIVb5C0QFf/figures/figures_24_1.jpg", "caption": "Figure 1: Illustrations of Meta-Objective Aligner, which follows a three-stage paradigm.", "description": "The figure shows a three-stage paradigm of the Meta-Objective Aligner. Stage 1 is \"Dynamic Objectives Reformulation\", which reorganizes traditional alignment datasets to supervise the model on performing flexible alignment across different objectives. Stage 2 is \"Conditional Weak-to-Strong Correction\", which aligns weak outputs of fixed policy models to approach strong outputs with higher preferences in the corresponding alignment objectives. Stage 3 is \"Generalizable Inference\", which flexibly adjusts target objectives by updating their text descriptions in the prompts. The figure also includes an illustration of how the three stages work together to align the language model with multiple objectives.", "section": "3 Meta-Objective Aligner"}]