[{"figure_path": "aeGSA8UoXF/figures/figures_4_1.jpg", "caption": "Figure 1: Pipeline for incorporating symmetries into equation discovery via solving linear symmetry constraint (Section 4.1), regularization (Section 4.2) and symmetry discovery (Section 4.3). Given the trajectory data from the dynamical system, we first identify its symmetry based on prior knowledge or symmetry discovery techniques. We then enforce the symmetry by solving a set of constraints when possible and otherwise promote the symmetry through regularization.", "description": "This figure illustrates the pipeline of the proposed symmetry-informed governing equation discovery method.  It starts with trajectory data and checks for prior knowledge of symmetries. If symmetries are known, the pipeline branches depending on whether they are linear or not, and whether a latent equation representation is desired. If symmetries are unknown, a symmetry discovery module is employed first.  Regardless of the symmetry's nature, the main equation discovery is then performed, guided or regularized by the identified or learned symmetries. The pipeline is broken down into three sub-pipelines corresponding to solving linear symmetry constraints explicitly, using symmetry regularization, and the case of discovering unknown symmetries from data.", "section": "4 Symmetry-Informed Governing Equation Discovery"}, {"figure_path": "aeGSA8UoXF/figures/figures_7_1.jpg", "caption": "Figure 2: Solutions for equivariant constraints of (13, 14). In (13), the 2D parameter space is spanned by Q1 and Q2. In (14), the 3D parameter space is spanned by Q1,2,3, each marked with a different color.", "description": "This figure visualizes the parameter spaces for two dynamical systems (Damped Oscillator and Growth) under the equivariance constraint. The original parameter space is reduced significantly due to the constraint.  For the damped oscillator, the 2D parameter space is spanned by Q1 and Q2. For the Growth system, the 3D parameter space is spanned by Q1, Q2, and Q3, each represented by a different color. This demonstrates the effect of incorporating symmetry constraints into reducing the search space for equation discovery.", "section": "5.1 Equivariant SINDy for Linear Symmetries"}, {"figure_path": "aeGSA8UoXF/figures/figures_8_1.jpg", "caption": "Figure 3: Reaction-diffusion system and the prediction error in the high-dimensional input space using equations from different methods. The means and standard deviations (shaded area) of errors over 3 random runs are plotted.", "description": "This figure shows a reaction-diffusion system and compares the prediction errors of three different methods: EquivSINDYAE, LaLiGAN + SINDY, and SINDYAE.  The left panel displays a visualization of the reaction-diffusion system. The right panel presents a line graph plotting the mean squared error (MSE) against the timestep for each method. Shaded areas represent standard deviations across three runs.  The graph visually demonstrates the superior performance of EquivSINDYAE in accurately predicting the system's dynamics over time, particularly compared to SINDYAE which exhibits significantly larger and more unstable errors.", "section": "5.2 Equivariant SINDy in Latent Space"}, {"figure_path": "aeGSA8UoXF/figures/figures_16_1.jpg", "caption": "Figure 1: Pipeline for incorporating symmetries into equation discovery via solving linear symmetry constraint (Section 4.1), regularization (Section 4.2) and symmetry discovery (Section 4.3). Given the trajectory data from the dynamical system, we first identify its symmetry based on prior knowledge or symmetry discovery techniques. We then enforce the symmetry by solving a set of constraints when possible and otherwise promote the symmetry through regularization.", "description": "This figure shows the pipeline of incorporating symmetries into equation discovery.  The pipeline starts with trajectory data from a dynamical system.  Based on prior knowledge or via a symmetry discovery technique, the system's symmetry is identified. Then, depending on whether the symmetry is linear, the pipeline uses one of two methods: 1) solving a set of constraints to enforce the symmetry; or 2) promoting symmetry through regularization. The outcome is a symmetry-informed governing equation.", "section": "4 Symmetry-Informed Governing Equation Discovery"}, {"figure_path": "aeGSA8UoXF/figures/figures_17_1.jpg", "caption": "Figure 1: Pipeline for incorporating symmetries into equation discovery via solving linear symmetry constraint (Section 4.1), regularization (Section 4.2) and symmetry discovery (Section 4.3). Given the trajectory data from the dynamical system, we first identify its symmetry based on prior knowledge or symmetry discovery techniques. We then enforce the symmetry by solving a set of constraints when possible and otherwise promote the symmetry through regularization.", "description": "This figure shows the pipeline of incorporating symmetries into equation discovery algorithms.  It starts with trajectory data and determines if prior knowledge about symmetry exists. If not, the pipeline uses symmetry discovery techniques.  Then, it checks for linear symmetry; if present, it solves the linear symmetry constraints.  Otherwise, it uses symmetry regularization.  The final output is the learned governing equation.", "section": "4 Symmetry-Informed Governing Equation Discovery"}, {"figure_path": "aeGSA8UoXF/figures/figures_18_1.jpg", "caption": "Figure 6: Long-term prediction error (MSE) on Lotka-Volterra system. The error curves are averaged over all discovered equations and random initial conditions in the test dataset. The shaded area indicates the standard deviation of prediction error at each timestep. Our methods based on symmetry regularization have slower error growth (visualized in solid lines).", "description": "This figure shows the long-term prediction error for the Lotka-Volterra system using different methods. The y-axis represents the mean squared error (MSE), and the x-axis represents the simulation time.  The solid lines represent the methods using symmetry regularization, and the dashed lines represent the baseline methods. The shaded area represents the standard deviation. The figure demonstrates that the methods incorporating symmetry regularization have slower error growth compared to the baseline methods.", "section": "5.3 Symmetry Regularization"}, {"figure_path": "aeGSA8UoXF/figures/figures_18_2.jpg", "caption": "Figure 7: Long-term prediction error (MSE) on glycolytic oscillator. Left: results for sparse regression-based methods. Right: genetic programming-based methods. Our symmetry regularization improves prediction accuracy over the base methods. D-CODE can achieve the best prediction accuracy in a long horizon, even though its discovered equations may not have the correct form.", "description": "This figure compares the long-term prediction error (Mean Squared Error or MSE) of different methods for the glycolytic oscillator model.  It shows that incorporating symmetry regularization via the proposed EquivSINDy-r and EquivGP-r methods leads to lower prediction errors compared to standard SINDy and GP methods, particularly over longer prediction horizons.  While D-CODE achieves the lowest error, its discovered equations may not always correctly capture the model dynamics.", "section": "5.3 Symmetry Regularization"}, {"figure_path": "aeGSA8UoXF/figures/figures_19_1.jpg", "caption": "Figure 1: Pipeline for incorporating symmetries into equation discovery via solving linear symmetry constraint (Section 4.1), regularization (Section 4.2) and symmetry discovery (Section 4.3). Given the trajectory data from the dynamical system, we first identify its symmetry based on prior knowledge or symmetry discovery techniques. We then enforce the symmetry by solving a set of constraints when possible and otherwise promote the symmetry through regularization.", "description": "This figure shows the pipeline for incorporating symmetries into equation discovery.  It starts with trajectory data and determines if prior knowledge of symmetry exists. If yes, it leverages that to solve linear symmetry constraints or use symmetry regularization. If not, symmetry discovery techniques are applied to first learn the symmetry before enforcing it via constraints or regularization. The pipeline branches according to whether the symmetry is linear, solvable or requires regularization, leading to different methods for equation discovery.", "section": "4 Symmetry-Informed Governing Equation Discovery"}, {"figure_path": "aeGSA8UoXF/figures/figures_21_1.jpg", "caption": "Figure 1: Pipeline for incorporating symmetries into equation discovery via solving linear symmetry constraint (Section 4.1), regularization (Section 4.2) and symmetry discovery (Section 4.3). Given the trajectory data from the dynamical system, we first identify its symmetry based on prior knowledge or symmetry discovery techniques. We then enforce the symmetry by solving a set of constraints when possible and otherwise promote the symmetry through regularization.", "description": "This figure shows the pipeline of the proposed symmetry-informed governing equation discovery method.  It details the steps involved in leveraging symmetry knowledge (either known beforehand or learned from data) to enhance equation discovery algorithms.  The pipeline branches based on whether the symmetry is linear and explicitly solvable, or requires regularization techniques. This approach aims to improve accuracy and parsimony in the discovered equations.", "section": "4 Symmetry-Informed Governing Equation Discovery"}]