[{"figure_path": "ALISPmDPCq/figures/figures_1_1.jpg", "caption": "Figure 1: Overview of our method. We first select models to check for contamination, then select reference models and benchmarks, and finally compute CONSTAT to detect and quantify contamination.", "description": "This figure illustrates the four main steps of the proposed CONSTAT method for detecting contamination in large language models.  It starts with defining the problem by selecting target models (M1 and M2) and their performance on a benchmark (D). Step 2 involves selecting reference models (Mref,1, Mref,2, Mref,3) and a reference benchmark (Dref).  The reference benchmark can be a rephrased, synthetic, or similar benchmark to the original benchmark D. Step 3 shows the computation of CONSTAT, comparing the performance of the target models on the original benchmark and the reference benchmark, considering the difficulty of the benchmarks using the reference model performances to predict the expected performance and calculate a difference (δ). Step 4 is the result extraction of CONSTAT which displays the contamination magnitude (δ) with its p-value, indicating the statistical significance of the contamination level. A high δ value with a low p-value signifies strong contamination, indicating a significant performance difference between the original and reference benchmarks. The emojis illustrate the idea of whether a model is contaminated or not (evil vs happy face).", "section": "This Work: A Statistical Test for Contamination"}, {"figure_path": "ALISPmDPCq/figures/figures_5_1.jpg", "caption": "Figure 2: Estimated 8 as a function of the true 8 for the finetuned models. 2-sigma intervals are shown.", "description": "This figure shows the results of evaluating CONSTAT's ability to estimate the sample-specific contamination effect.  It compares CONSTAT's estimate of the contamination effect (δ) against the ground truth measurement obtained from uncontaminated samples. The plot shows a strong positive correlation (R²=0.94) between the estimated and actual contamination effects, indicating that CONSTAT accurately estimates the magnitude of sample-specific contamination.", "section": "4.2 Validating Contamination Detection with CONSTAT in a Controlled Setting"}, {"figure_path": "ALISPmDPCq/figures/figures_20_1.jpg", "caption": "Figure 3: CDF of various statistical tests for uncontaminated models in different scenarios.", "description": "This figure shows the cumulative distribution function (CDF) of p-values obtained from various statistical tests applied to uncontaminated models under different conditions.  The tests include CONSTAT (and several ablation variants of CONSTAT) as well as MEAN-TEST and NORMALIZED-TEST.  Each scenario represents a different challenge: (a) a simple scenario for comparison where the test should return a CDF close to the identity line, (b) benchmarks with different distributions, (c) a non-linear relationship between original and reference benchmark performance, (d) noisy reference models and a linear relationship between the benchmarks, (e) noisy reference models and a non-linear relationship between benchmarks, and (f) a small number of reference models and a non-linear relationship. The figure demonstrates the robustness of CONSTAT compared to other tests in handling these different conditions.  A well-performing test should closely follow the identity line (dashed black line).", "section": "B Ablation Study via Simulation"}, {"figure_path": "ALISPmDPCq/figures/figures_20_2.jpg", "caption": "Figure 3: CDF of various statistical tests for uncontaminated models in different scenarios.", "description": "This figure shows the cumulative distribution function (CDF) of p-values obtained from various statistical tests for uncontaminated models under different simulation scenarios.  The scenarios test the robustness of the tests to various factors such as differing difficulty of benchmarks, non-linear relationships between benchmarks, noise in reference models, the impact of bootstrapping on reference models, and the effect of including a random model in the reference set. The 'Identity' line represents a perfect test; a test should ideally match this line for an uncontaminated model. Deviations from this line illustrate the shortcomings of each statistical test under the given scenario. CONSTAT demonstrates its robustness by closely tracking the identity line across all scenarios.", "section": "B.2 Results"}, {"figure_path": "ALISPmDPCq/figures/figures_20_3.jpg", "caption": "Figure 3: CDF of various statistical tests for uncontaminated models in different scenarios.", "description": "This figure shows the cumulative distribution functions (CDFs) of the p-values returned by various statistical tests for uncontaminated models under different scenarios.  The scenarios manipulate factors like the difference in difficulty between benchmarks, non-linearity in the relationship between benchmark performances, noise in reference model evaluations, the use of model bootstrapping and the inclusion of a random model in the reference model set. The identity line represents a perfect test that would always accurately reflect the null hypothesis. Deviations from this line indicate a higher likelihood of false positives (above the line) or false negatives (below the line).  The figure demonstrates that CONSTAT is consistently more robust to these varying conditions than other methods, producing p-value distributions that closely match the ideal identity line.", "section": "B.2 Results"}, {"figure_path": "ALISPmDPCq/figures/figures_20_4.jpg", "caption": "Figure 3: CDF of various statistical tests for uncontaminated models in different scenarios.", "description": "This figure presents the cumulative distribution function (CDF) of p-values obtained from several statistical tests for contamination detection on uncontaminated models under various simulation scenarios. Each test's performance is shown as a curve on the graph, with the identity line (dashed black line) representing perfect accuracy. Deviations from the identity line indicate false positive rates. The scenarios considered include: simple cases, cases with differing benchmark difficulties, cases with non-linear relationships between benchmark performances, cases with noisy reference models, cases without bootstrapping or random models. The figure illustrates how CONSTAT outperforms alternative tests by being robust to various scenarios.", "section": "B.2 Results"}, {"figure_path": "ALISPmDPCq/figures/figures_20_5.jpg", "caption": "Figure 3: CDF of various statistical tests for uncontaminated models in different scenarios.", "description": "This figure compares the performance of CONSTAT against several other statistical tests in various scenarios using simulations. The x-axis represents the p-value, and the y-axis represents the cumulative distribution function (CDF) of the p-values. The scenarios include cases with different distributions, non-linear relationships between benchmarks, noisy reference models, and the impact of specific design choices in CONSTAT. The results demonstrate CONSTAT's robustness and reliability compared to other methods.", "section": "B Ablation Study via Simulation"}, {"figure_path": "ALISPmDPCq/figures/figures_20_6.jpg", "caption": "Figure 3: CDF of various statistical tests for uncontaminated models in different scenarios.", "description": "This figure shows the cumulative distribution functions (CDFs) of p-values obtained from various statistical tests for uncontaminated models under different scenarios.  The scenarios simulate various conditions to evaluate the robustness and accuracy of these tests in detecting contamination.  Each line represents a different statistical test (ConStat, Mean-Test, Normalized-Test, variants of ConStat), with the identity line representing a perfect test (uncontaminated model always gives p-value above 0.5).  The tests are compared based on how closely their CDFs match the identity line, indicating the accuracy and reliability of each test in identifying uncontaminated models. Deviations from the identity line indicate issues like false positives (CDF above identity line) and false negatives (CDF below identity line).", "section": "B.2 Results"}]