[{"figure_path": "7LIm53Jiic/tables/tables_7_1.jpg", "caption": "Table 1: Performance of different ECOCs with various code length (nL) on small scale tasks, i.e., MNIST and CIFAR10. The proposed method achieves better performance in the presence of weight-errors.", "description": "This table presents the performance comparison of different ECOC methods (One-hot, Repetition, Random, Hadamard, and the proposed Method 1) on two small-scale datasets: MNIST and CIFAR10.  The performance is evaluated under varying levels of weight-errors (ω) and different code lengths (nL or η₁).  The results show the accuracy of each method under clean conditions (ω=0) and various levels of Gaussian noise added to the weights during inference. The proposed Method 1 generally outperforms other methods, especially when weight errors are present.", "section": "6.2 Results and Analysis"}, {"figure_path": "7LIm53Jiic/tables/tables_8_1.jpg", "caption": "Table 2: Performance of different ECOCs with various code length (nL) on large scale tasks, i.e., CIFAR100 and Tiny ImageNet. The proposed method shows better performance among all.", "description": "This table presents the performance comparison of different ECOCs (Error Correcting Output Codes) on two large-scale image classification datasets: CIFAR-100 and Tiny ImageNet.  The performance is evaluated under varying levels of weight-error (noise added to the model weights during inference), represented by the ω values.  Different ECOC methods are compared: One-hot, Repetition, Random, Hadamard, and the proposed Method 2.  The table shows that the proposed Method 2 generally outperforms other methods in terms of accuracy, especially when there is significant weight error.", "section": "6.2 Results and Analysis"}, {"figure_path": "7LIm53Jiic/tables/tables_8_2.jpg", "caption": "Table 1: Performance of different ECOCs with various code length (nL) on small scale tasks, i.e., MNIST and CIFAR10. The proposed method achieves better performance in the presence of weight-errors.", "description": "This table presents the performance comparison of different ECOCs (Error Correcting Output Codes) on two small-scale datasets: MNIST and CIFAR10.  The performance is evaluated under varying levels of weight-errors (noise added to the weights), indicated by the \nω\n values. Different ECOC methods are compared: one-hot, repetition, random, Hadamard, and the methods proposed in the paper (Method 1 for this table). The table shows that the proposed methods consistently outperform others, especially when significant weight errors are present.", "section": "6.2 Results and Analysis"}]