[{"figure_path": "xvTMc9Ovx3/tables/tables_3_1.jpg", "caption": "Table 1: Comparison between the TOI and State-of-the-art Datasets. 'Impo.' represents the object importance annotation.", "description": "This table compares the TOI dataset with other state-of-the-art datasets used for on-road object importance estimation and related tasks.  It shows the number of objects, frames, scenes, frames per second (FPS), and year of release for each dataset.  It also indicates whether each dataset provides object importance annotations, GPS/IMU data, LiDAR data, and 3D labels. This allows for a clear comparison of the size, scope, and features of various datasets in relation to the newly proposed TOI dataset.", "section": "3 A New Dataset: TOI"}, {"figure_path": "xvTMc9Ovx3/tables/tables_7_1.jpg", "caption": "Table 2: Quantitative comparison with baselines on TOI and Ohn-Bar (33) datasets. The 'Video' signifies the usage of RGB video sequence, 'Velocity' denotes the incorporation of vehicle velocity information, and ‘3D-Object’ indicates the utilization of 3D object properties information.", "description": "This table presents a quantitative comparison of the proposed model's performance against seven baseline methods on two datasets: the newly introduced TOI dataset and the existing Ohn-Bar dataset.  The performance is measured using Average Precision (AP), F1-score, and Accuracy (Acc).  The table also indicates which input modalities (RGB video, vehicle velocity, and 3D object properties) were used by each method.", "section": "5.1 Comparison Experiment"}, {"figure_path": "xvTMc9Ovx3/tables/tables_7_2.jpg", "caption": "Table 3: Ablation study on top-down and bottom-up framework.", "description": "This table presents the ablation study results of the proposed model, comparing different combinations of the bottom-up module, TRG (Traffic Rule Guidance) module, and DISG (Driver Intention and Semantics Guidance) module.  The results show the improvement in AP (Average Precision) and F1 scores as more modules are added, highlighting the effectiveness of the proposed interactive bottom-up and top-down fusion framework.", "section": "5.2 Ablation Studies"}, {"figure_path": "xvTMc9Ovx3/tables/tables_8_1.jpg", "caption": "Table 4: Ablation study on DISG.", "description": "This ablation study analyzes the impact of the semantic context guidance and driver intention guidance on the model's performance. It compares four variations of the model: (1) without either guidance, (2) with only semantic guidance, (3) with only intention guidance, and (4) with both. The results demonstrate the significant contribution of both guidance features, with the best performance achieved by the model with both semantic and intention guidance.", "section": "5.2 Ablation Studies"}, {"figure_path": "xvTMc9Ovx3/tables/tables_8_2.jpg", "caption": "Table 5: Ablation study on TRG.", "description": "This table presents the ablation study results for the Traffic Rule Guidance (TRG) module. It compares the performance of the model with different combinations of object-lane interaction and object-lane interaction weighting. The results show that including both object-lane interaction and object-lane interaction weighting significantly improves the performance of the model.", "section": "5.2 Ablation Studies"}, {"figure_path": "xvTMc9Ovx3/tables/tables_13_1.jpg", "caption": "Table 6: Ablation study on OFE.", "description": "This ablation study investigates the impact of using only spatial features, only temporal features, or both spatial and temporal features for object importance estimation. The results demonstrate that using both spatial and temporal features significantly improves the performance of the model compared to using only one type of feature.", "section": "5.2 Ablation Studies"}, {"figure_path": "xvTMc9Ovx3/tables/tables_13_2.jpg", "caption": "Table 2: Quantitative comparison with baselines on TOI and Ohn-Bar (33) datasets. The 'Video' signifies the usage of RGB video sequence, 'Velocity' denotes the incorporation of vehicle velocity information, and ‘3D-Object’ indicates the utilization of 3D object properties information.", "description": "This table presents a quantitative comparison of the proposed model's performance against seven baseline models on two datasets: the newly introduced TOI dataset and the publicly available Ohn-Bar dataset.  The comparison uses three metrics: Average Precision (AP), F1-score (F1), and Accuracy (Acc). It also indicates whether each method uses RGB video sequences, vehicle velocity information, and 3D object properties in its input.", "section": "5.1 Comparison Experiment"}, {"figure_path": "xvTMc9Ovx3/tables/tables_14_1.jpg", "caption": "Table 1: Comparison between the TOI and State-of-the-art Datasets. 'Impo.' represents the object importance annotation.", "description": "This table compares the TOI dataset with other state-of-the-art datasets used for on-road object importance estimation and related tasks.  It shows the number of objects, frames, scenes, frames per second (FPS), and year of release for each dataset.  It also indicates whether each dataset provides object importance annotations, GPS/IMU, lidar data, and 3D labels. This allows for a direct comparison of the size and annotation richness of the TOI dataset relative to existing resources.", "section": "3 A New Dataset: TOI"}]