[{"figure_path": "B4q98aAZwt/tables/tables_5_1.jpg", "caption": "Table 1: Mean and standard deviation of AUC top-10 (↑) from five independent runs. We use oracle ID (in lexicographical order) instead of a name for better readability, and the best mean scores are denoted in bold for each task. The results of further baselines are provided in Appendix G.2.", "description": "This table presents the mean and standard deviation of the area under the curve (AUC) for the top 10 results obtained from five independent runs of a molecular optimization experiment using different methods.  The table compares the performance of Genetic GFN against several other methods across 23 different oracle tasks.  Each oracle represents a different molecular optimization problem.  The best average AUC scores are highlighted in bold.", "section": "5.1 Sample efficient molecular optimization"}, {"figure_path": "B4q98aAZwt/tables/tables_6_1.jpg", "caption": "Table 2: Ablation studies. In the GS ablation study (-{GS}), the generative policy solely generates samples, while e-greedy samples from PF mixed with a uniform distribution. The bold text indicates the best value.", "description": "This table presents the results of ablation studies conducted to evaluate the impact of the genetic search (GS) and KL-divergence penalty on the performance of the proposed Genetic GFN model.  The ablation studies systematically remove components of the model to isolate their individual contributions to overall performance.  The results are presented as mean ± standard deviation of AUC scores for Top-1, Top-10 and Top-100 molecules across various oracles. The table shows that both genetic search and KL-divergence penalty significantly improve the model's performance.", "section": "5.1 Main results in the official benchmark of PMO"}, {"figure_path": "B4q98aAZwt/tables/tables_7_1.jpg", "caption": "Table 3: Comparison with GFlowNet variants. Notably, samples from the GS have larger SMILES distances than LS, leading to better sample efficiency. The bold text indicates the best value.", "description": "This table compares the performance of Genetic GFN with three GFlowNet variants: LS-GFN, GFN, and GFN-AL.  The comparison is done using two metrics (AUC scores and search distances) and two tasks (GSK3β and JNK3). The results show that Genetic GFN outperforms other methods, particularly in terms of sample efficiency, highlighted by larger SMILES distances in the genetic search compared to the local search. The bolded values indicate the best results for each metric in each task.", "section": "5.1.3 Comparisons with GFlowNets variants"}, {"figure_path": "B4q98aAZwt/tables/tables_7_2.jpg", "caption": "Table 4: Average and standard deviation of hypervolumes (↑) for each task. The baseline results are directly from the HN-GFN paper [11]. The bold text indicates the best value.", "description": "This table presents the results of a multi-objective molecular optimization experiment comparing Genetic GFN's performance to several baselines. Two tasks were evaluated: GSK3β + JNK3 and GSK3β + JNK3 + QED + SA. The hypervolume metric is used to evaluate performance, which considers both the quality and diversity of solutions found by each algorithm. The results show Genetic GFN outperforming the other methods on both tasks.", "section": "5.1.4 Sample efficient multi-objective molecular optimization"}, {"figure_path": "B4q98aAZwt/tables/tables_8_1.jpg", "caption": "Table 5: Average Top-100 scores (↑). Ours outperforms baselines with 10 times fewer steps. The bold denotes the best scores.", "description": "This table compares the average top-100 scores achieved by Genetic GFN against several baselines on two SARS-CoV-2 targets (PLPro and RdRp) using only 100 and 1000 steps.  The results show that Genetic GFN significantly outperforms all the baselines, achieving much higher scores with drastically fewer steps. This demonstrates the efficiency of the proposed Genetic GFN approach in designing SARS-CoV-2 inhibitors.", "section": "5.2 Designing inhibitors against SARS-CoV-2 targets"}, {"figure_path": "B4q98aAZwt/tables/tables_18_1.jpg", "caption": "Table 6: Hyperparameters of Genetic GFN-AL", "description": "This table compares the hyperparameters used in the Genetic GFN-AL model with those used in the GFlowNet-AL model from the PMO benchmark.  It highlights key differences in settings such as proxy sample size, training iterations, hidden dimension, and exploration strategies (kappa, gamma, random action probability). These differences reflect the adaptations made to the GFlowNet-AL framework to incorporate Genetic GFN's unique approach.", "section": "D.1 Implementation of Genetic GFN-AL"}, {"figure_path": "B4q98aAZwt/tables/tables_18_2.jpg", "caption": "Table 7: Comparing AL and model-based algorithms. The bold text indicates the best value.", "description": "This table compares the performance of Genetic GFN-AL with other active learning and model-based algorithms in terms of AUC Top-1, AUC Top-10, and AUC Top-100.  It highlights the superior performance of Genetic GFN-AL, especially compared to the fragment-based GFlowNet-AL which serves as a baseline for active learning approaches.", "section": "5.1 Sample efficient molecular optimization"}, {"figure_path": "B4q98aAZwt/tables/tables_20_1.jpg", "caption": "Table 8: The results of Top-100 molecules for PLPr_7JIR target. The docking, QED, and SA of baselines are directly from MolRL-MGPT, and the total score is recalculated according to Eq. (5) using average values.", "description": "This table presents the performance of different methods in predicting the docking, QED, SA, and diversity scores for the top-100 molecules targeting PLPr_7JIR.  The \"Score\" column represents a combined metric calculated using a specific formula (Eq. 5 in the paper).  The baselines' docking, QED, and SA values are taken directly from the MolRL-MGPT paper, while Genetic GFN's results are original to this paper.", "section": "5.2 Designing inhibitors against SARS-CoV-2 targets"}, {"figure_path": "B4q98aAZwt/tables/tables_20_2.jpg", "caption": "Table 9: The results of Top-100 molecules for RdRp_6YYT target. The docking, QED, and SA of baselines are directly from MolRL-MGPT, and the total score is recalculated according to Eq. (5) using average values.", "description": "This table presents the performance comparison of different methods in terms of docking score, QED, SA, and diversity for the RdRp_6YYT target in the SARS-CoV-2 inhibitor design task. The scores are calculated using a specific formula, and the baselines' docking, QED, and SA values are taken directly from a previous study (MolRL-MGPT).", "section": "5.2 Designing inhibitors against SARS-CoV-2 targets"}, {"figure_path": "B4q98aAZwt/tables/tables_22_1.jpg", "caption": "Table 1: Mean and standard deviation of AUC top-10 (↑) from five independent runs. We use oracle ID (in lexicographical order) instead of a name for better readability, and the best mean scores are denoted in bold for each task. The results of further baselines are provided in Appendix G.2.", "description": "This table presents the mean and standard deviation of the AUC (Area Under the Curve) for the top-10 results from five independent runs of a molecular optimization experiment.  The experiment used 23 different oracle functions (tasks) to evaluate the performance of different methods.  The best mean score for each task is highlighted in bold. Additional results from other baselines are included in Appendix G.2.", "section": "5.1 Sample efficient molecular optimization"}, {"figure_path": "B4q98aAZwt/tables/tables_22_2.jpg", "caption": "Table 1: Mean and standard deviation of AUC top-10 (↑) from five independent runs. We use oracle ID (in lexicographical order) instead of a name for better readability, and the best mean scores are denoted in bold for each task. The results of further baselines are provided in Appendix G.2.", "description": "This table presents the mean and standard deviation of the Area Under the Curve (AUC) for the top 10 results from five independent runs of a molecular optimization experiment.  It compares the performance of Genetic GFN against several other methods across 23 different tasks (oracles).  The best performing method for each task is highlighted in bold.  Additional baseline results are available in Appendix G.2.", "section": "5.1 Sample efficient molecular optimization"}, {"figure_path": "B4q98aAZwt/tables/tables_23_1.jpg", "caption": "Table 1: Mean and standard deviation of AUC top-10 (↑) from five independent runs. We use oracle ID (in lexicographical order) instead of a name for better readability, and the best mean scores are denoted in bold for each task. The results of further baselines are provided in Appendix G.2.", "description": "This table presents the mean and standard deviation of the Area Under the Curve (AUC) for the top 10 results from five independent runs of a molecular optimization experiment.  It compares the performance of Genetic GFN against several other methods across 23 different oracle tasks (molecular properties to optimize). The best performing method for each task is highlighted in bold.  Appendix G.2 contains results for additional baseline methods.", "section": "5.1 Sample efficient molecular optimization"}, {"figure_path": "B4q98aAZwt/tables/tables_23_2.jpg", "caption": "Table 1: Mean and standard deviation of AUC top-10 (↑) from five independent runs. We use oracle ID (in lexicographical order) instead of a name for better readability, and the best mean scores are denoted in bold for each task. The results of further baselines are provided in Appendix G.2.", "description": "This table presents the mean and standard deviation of the Area Under the Curve (AUC) for the top 10 results from five independent runs of a molecular optimization experiment.  The results are shown for a genetic GFlowNet model and several comparison methods across 23 different oracle tasks.  The best mean score for each task is highlighted in bold.  Further baseline results are available in Appendix G.2.", "section": "5.1 Sample efficient molecular optimization"}, {"figure_path": "B4q98aAZwt/tables/tables_25_1.jpg", "caption": "Table 1: Mean and standard deviation of AUC top-10 (↑) from five independent runs. We use oracle ID (in lexicographical order) instead of a name for better readability, and the best mean scores are denoted in bold for each task. The results of further baselines are provided in Appendix G.2.", "description": "This table presents the mean and standard deviation of the Area Under the Curve (AUC) for the top 10 results from five independent runs of a molecular optimization experiment.  It compares the performance of Genetic GFN against several other methods across 23 different tasks (oracles).  The best-performing method for each task is highlighted in bold.  Additional results for other methods are available in Appendix G.2 of the paper.", "section": "5.1 Sample efficient molecular optimization"}, {"figure_path": "B4q98aAZwt/tables/tables_26_1.jpg", "caption": "Table 2: Ablation studies. In the GS ablation study (-{GS}), the generative policy solely generates samples, while e-greedy samples from PF mixed with a uniform distribution. The bold text indicates the best value.", "description": "This table presents the results of ablation studies conducted to evaluate the impact of the genetic search (GS) and the KL-divergence penalty on the performance of the proposed Genetic GFN model.  The ablation studies involve removing either the genetic search component or the KL-divergence penalty from the model, and also includes a variation that replaces the genetic search with an epsilon-greedy exploration strategy. The table shows the average AUC scores (Top-1, Top-10, and Top-100) for each ablation variation across multiple runs.  The best-performing configuration is highlighted in bold.", "section": "5.1.2 Controllability of the scores-diversity trade-off and ablation studies"}, {"figure_path": "B4q98aAZwt/tables/tables_27_1.jpg", "caption": "Table 16: Performance of Genetic GFN with SELFIES generations.", "description": "This table presents a comparison of the performance of Genetic GFN using SELFIES representation against REINVENT with SELFIES across various oracles.  The table shows the average AUC scores (along with standard deviation) for both methods across each of the specified benchmark tasks, and summarizes the total AUC and diversity scores.", "section": "G.6 Genetic GFN with SELFIES generation"}, {"figure_path": "B4q98aAZwt/tables/tables_27_2.jpg", "caption": "Table 1: Mean and standard deviation of AUC top-10 (↑) from five independent runs. We use oracle ID (in lexicographical order) instead of a name for better readability, and the best mean scores are denoted in bold for each task. The results of further baselines are provided in Appendix G.2.", "description": "This table presents the mean and standard deviation of the AUC top-10 scores across five independent runs for each of the 23 oracles in the PMO benchmark.  The best average score for each oracle is highlighted in bold.  Additional results for other baselines are available in Appendix G.2.", "section": "5.1 Sample efficient molecular optimization"}, {"figure_path": "B4q98aAZwt/tables/tables_28_1.jpg", "caption": "Table 18: Ablation studies for the number of GA generation. ‘×0’ stands for the results of TB loss training without GA explorations.", "description": "This table presents the ablation study results by varying the number of GA generations.  The results show the performance of Genetic GFN with 0, 1, 2 and 3 GA generations, comparing AUC Top-1, AUC Top-10, AUC Top-100 and diversity for each configuration. The ‘x0’ row indicates the results without using GA exploration during training.", "section": "G.8 Experiments with varying hyperparameters"}, {"figure_path": "B4q98aAZwt/tables/tables_28_2.jpg", "caption": "Table 1: Mean and standard deviation of AUC top-10 (↑) from five independent runs. We use oracle ID (in lexicographical order) instead of a name for better readability, and the best mean scores are denoted in bold for each task. The results of further baselines are provided in Appendix G.2.", "description": "This table shows the performance comparison of Genetic GFN with other state-of-the-art molecular optimization methods across 23 different tasks in the PMO benchmark.  The AUC Top-10 score, a metric representing sample efficiency, is reported, along with its standard deviation, for each method across each task. The best mean score for each task is highlighted in bold.  Appendix G.2 provides a more comprehensive set of results.", "section": "5.1 Sample efficient molecular optimization"}, {"figure_path": "B4q98aAZwt/tables/tables_28_3.jpg", "caption": "Table 20: Results by varying the number of training inner loops.", "description": "This table presents the ablation study results by varying the number of training inner loops in the Genetic GFN model.  It shows the impact of this hyperparameter on AUC Top-1, AUC Top-10, AUC Top-100, and diversity metrics, providing insight into the model's performance and diversity at different training extents.", "section": "G.8 Experiments with varying hyperparameters"}]