[{"figure_path": "MSSRhxwZP7/tables/tables_7_1.jpg", "caption": "Table 1: Quantitative comparison of the state-of-the-art methods and proposed DisPA on LS-PCQA [23], SJTU-PCQA [46], WPC [20]. The best results are shown in bold, and second results are underlined. \"P\" / \"I\" stands for the method is based on the point cloud/image modality, respectively. \"↑\"/\"+\" indicates that larger/smaller is better.", "description": "This table presents a quantitative comparison of the proposed DisPA method against several state-of-the-art methods for no-reference point cloud quality assessment (NR-PCQA).  It evaluates performance across three datasets (LS-PCQA, SJTU-PCQA, and WPC) using three metrics: SROCC, PLCC, and RMSE.  The table highlights the best and second-best performing methods for each dataset and metric, indicating whether higher or lower values are better for each metric. The modality of each method (point cloud or image-based) is also specified.", "section": "5.3 Comparison with State-of-the-art Methods"}, {"figure_path": "MSSRhxwZP7/tables/tables_9_1.jpg", "caption": "Table 1: Quantitative comparison of the state-of-the-art methods and proposed DisPA on LS-PCQA [23], SJTU-PCQA [46], WPC [20]. The best results are shown in bold, and second results are underlined. \"P\" / \"I\" stands for the method is based on the point cloud/image modality, respectively. \"↑\"/\"+\" indicates that larger/smaller is better.", "description": "This table presents a quantitative comparison of the proposed DisPA method against several state-of-the-art methods for no-reference point cloud quality assessment (NR-PCQA) on three benchmark datasets: LS-PCQA, SJTU-PCQA, and WPC.  The performance is measured using three metrics: SROCC, PLCC, and RMSE. The table indicates whether each method uses point cloud data (P) or image data (I) as input.  The best results for each metric and dataset are highlighted in bold, with the second-best results underlined. The arrows (↑ and ↓) indicate whether a higher or lower value is better for each metric.", "section": "5 Experiments"}]