[{"figure_path": "clqX9cVDKV/tables/tables_7_1.jpg", "caption": "Table 1: Protein Design results. The best and suboptimal results are labeled with bold and underlined. \"VFN\" means that we replace the geometric interaction operation with VFN's operation [27]. \"-GDP\" means that we remove the geometric dot product features. \"-EAttn\" means that we replace the gated edge attention with PiGNN's attention module [10]. \"-VFrame\" means that we remove the global virtual frames.", "description": "This table presents the results of protein design experiments comparing the performance of UniIF against various baselines (with and without ESM2) across different datasets (CATH4.3, CASP, NovelPro).  It showcases UniIF's superior performance, particularly in time-split evaluations where it surpasses even ESM2-based methods, highlighting its generalizability.  Ablation studies analyze the effects of removing key components of the UniIF model (geometric dot product, gated edge attention, and virtual frames).", "section": "4.1 Protein Design (T1)"}, {"figure_path": "clqX9cVDKV/tables/tables_7_2.jpg", "caption": "Table 2: The recovery of RNA design. The best and suboptimal results are labeled with bold and underlined.", "description": "This table presents the results of RNA inverse folding experiments using various methods, including SeqRNN, SeqLSTM, StructMLP, StructGNN, GraphTrans, PiFold, RDesign, and the proposed UniIF model.  The recovery rate, which represents the percentage of correctly predicted residues in the RNA sequences, is reported for short, medium, long, and all lengths of RNA sequences.  The results are shown as median and standard deviation over three independent runs. The table demonstrates the improved performance of the UniIF model compared to existing methods.", "section": "4.2 RNA Design (T2)"}, {"figure_path": "clqX9cVDKV/tables/tables_8_1.jpg", "caption": "Table 3: CHILI-3K Results.", "description": "This table presents the results of the material design task (T3) on the CHILI-3K dataset.  It compares the recovery rate (Rec % ↑) achieved by UniIF against several baseline methods including GCN, PMLP, GraphSAGE, GAT, GraphUNet, GIN, and EdgeCNN.  The table also shows ablation studies for UniIF, specifically removing the learned frame and using quaternions instead of the learned frame for orientation representation, highlighting the importance of the proposed frame-based block representation and the learned frame for optimal performance.", "section": "4.3 Material Design (T3)"}]