[{"figure_path": "6CFHg7exjY/figures/figures_1_1.jpg", "caption": "Figure 1: Toy examples and causal graphs of heterogeneous observational data, both of which are missing not at random (MNAR) due to the selection bias. In causal graphs, bu,i, Ou,i, ru,i and hu,i denote basic mandatory features, observation, rating and optional features, respectively, where observed and unobserved variables are represented by solid-line and dashed-line circles.", "description": "This figure illustrates two scenarios of user data collection for recommender systems, highlighting the presence or absence of hidden confounding.  In the left panel, two example user profiles are presented. Alice provides complete information including optional features (age and salary), while Bob only provides mandatory information (username and gender). This difference is represented by the data source indicator *g<sub>u,i</sub>*, where 1 indicates complete data (Alice), and 0 indicates incomplete data (Bob). The right panel displays two causal graphs depicting the relationship between observed and unobserved variables in the presence and absence of hidden confounding.  Solid lines indicate observed variables, while dashed lines indicate unobserved variables. The graphs show how the selection bias (MNAR data) is affected by the presence (g<sub>u,i</sub>=0) or absence (g<sub>u,i</sub>=1) of hidden confounders (user age or salary), illustrating the challenges of causal inference in this context. ", "section": "1 Introduction"}, {"figure_path": "6CFHg7exjY/figures/figures_4_1.jpg", "caption": "Figure 2: Architecture of MetaDebias to address selection bias in the presence of hidden confounding.", "description": "The figure shows the architecture of the MetaDebias model, which addresses selection bias in recommendation systems in the presence of hidden confounders.  The model consists of five sub-models: a propensity model, a residual model, an oracle imputation model, a prediction model, and a naive imputation model. The propensity model estimates the probability of observing a rating given the input features and the data source indicator (gu,i). The residual model captures the difference in prediction errors between subgroups with and without hidden confounders. The oracle imputation model estimates the oracle prediction error on all user-item pairs.  The prediction model predicts the true ratings and the naive imputation model estimates the naive prediction error based on the observed features.  The different sub-models are connected through a series of operations which allow the model to learn from heterogeneous data with both observed and hidden confounders and make unbiased predictions.", "section": "3 MetaDebias: Meta Learning Based Debiased Recommendation Approach"}, {"figure_path": "6CFHg7exjY/figures/figures_7_1.jpg", "caption": "Figure 2: Architecture of MetaDebias to address selection bias in the presence of hidden confounding.", "description": "This figure shows the architecture of the MetaDebias model, illustrating how it addresses selection bias in the presence of hidden confounding.  The model consists of several components: a propensity model (predicting the probability of observing a rating), a residual model (modeling the difference in prediction error between observed and unobserved data), an oracle imputation model (estimating the true prediction error), a prediction model (predicting ratings), and a naive imputation model (a simpler imputation model used in the training process). The model utilizes a meta-learning approach, optimizing the oracle imputation model to improve the performance of the prediction model. The input includes features (Xu,i), a data source indicator (gu,i), and the observed rating (Ou,i * ru,i).", "section": "3 MetaDebias: Meta Learning Based Debiased Recommendation Approach"}, {"figure_path": "6CFHg7exjY/figures/figures_8_1.jpg", "caption": "Figure 3: Effects of hidden confounding strength on the KUAIREC dataset.", "description": "This figure shows the impact of hidden confounding strength on the KUAIREC dataset.  The x-axis represents the hidden confounding strength, ranging from 0.1 to 0.9.  The y-axis shows the performance metrics: AUC, NDCG@50, and Recall@50.  The different colored lines represent different debiased recommendation methods (DR, BRD-DR, Res-DR, and MetaDebias). The figure demonstrates how the performance of all methods degrades as the hidden confounding strength increases. MetaDebias shows comparatively better performance compared to other methods.", "section": "4.2 Experimental Results"}, {"figure_path": "6CFHg7exjY/figures/figures_9_1.jpg", "caption": "Figure 5: Effects of varying RCT training set size on AUC on three benchmark datasets.", "description": "This figure shows the impact of varying the percentage of RCT training data on the AUC (Area Under the Curve) performance metric across three benchmark datasets: Coat, Yahoo! R3, and KuaiRec.  Each line represents a different debiasing method (KD-Label, AutoDebias, Bal-DR, LTD-DR, Res-DR, and MetaDebias). The x-axis shows the percentage of RCT data used, and the y-axis displays the AUC scores. The figure demonstrates how the performance of each method changes as the amount of RCT data increases, highlighting the relative effectiveness of each debiasing technique in the presence of RCT data.", "section": "4.2 Experimental Results"}, {"figure_path": "6CFHg7exjY/figures/figures_16_1.jpg", "caption": "Figure 3: Effects of hidden confounding strength on the KUAIREC dataset.", "description": "This figure shows the impact of hidden confounding strength on the KUAIREC dataset.  The x-axis represents the strength of hidden confounding, and the y-axis shows the performance metrics (AUC, NDCG@50, Recall@50).  The results show that as the hidden confounding strength increases, the performance of all methods degrades. However, MetaDebias shows superior performance in handling the confounding compared to other methods.", "section": "4.2 Experimental Results"}, {"figure_path": "6CFHg7exjY/figures/figures_17_1.jpg", "caption": "Figure 3: Effects of hidden confounding strength on the KUAIREC dataset.", "description": "This figure shows the impact of hidden confounding strength on the KUAIREC dataset.  The x-axis represents the strength of hidden confounding, and the y-axis shows the performance metrics (AUC, NDCG@50, and Recall@50).  The different colored bars represent different debiasing methods (DR, BRD-DR, Res-DR, and MetaDebias).  The results show how performance degrades as hidden confounding increases, illustrating the effectiveness of the MetaDebias approach, which maintains a higher performance even with stronger confounding.", "section": "4.2 Experimental Results"}]