[{"figure_path": "7WoOphIZ8u/figures/figures_8_1.jpg", "caption": "Figure 1: Numerical behavior of SGD iterates and their derivatives (Jacobians) in a linear regression problem solved by ordinary least squares. The plots depict the convergence of the suboptimality f(xk(θ))−f(x∗(θ)) and the Frobenius norm of the derivative error ||∂θxk(θ)−∂θx∗(θ)||F across different experimental settings: constant step-size (first column), decreasing step-size (second column), double interpolation (third column), and simple interpolation (fourth column). The experiments utilize varying step-size strategies to illustrate general estimates, sublinear rates, and the impacts of interpolation regimes, validating theoretical predictions of Theorem 2.2.", "description": "The figure shows the convergence behavior of SGD iterates and their Jacobian derivatives for ordinary least squares linear regression under different scenarios: constant step size, decreasing step size, double interpolation (σ=0 for both iterates and derivatives), and simple interpolation (σ=0 for iterates but not derivatives).  Each column represents a different step-size strategy, visualizing the convergence of both the suboptimality (f(xk(θ))−f(x∗(θ))) and the derivative error (||∂θxk(θ)−∂θx∗(θ)||F). The results validate the theoretical convergence rates established in Theorem 2.2.", "section": "4 Numerical illustration"}, {"figure_path": "7WoOphIZ8u/figures/figures_9_1.jpg", "caption": "Figure 1: Numerical behavior of SGD iterates and their derivatives (Jacobians) in a linear regression problem solved by ordinary least squares. The plots depict the convergence of the suboptimality f(xk(θ))−f(x∗(θ)) and the Frobenius norm of the derivative error ||∂θxk(θ)−∂θx∗(θ)||F across different experimental settings: constant step-size (first column), decreasing step-size (second column), double interpolation (third column), and simple interpolation (fourth column). The experiments utilize varying step-size strategies to illustrate general estimates, sublinear rates, and the impacts of interpolation regimes, validating theoretical predictions of Theorem 2.2.", "description": "This figure shows the convergence of SGD iterates and their derivatives (Jacobians) in four different settings of linear regression problems solved by ordinary least squares.  Each setting varies the step-size strategy used: constant, decreasing, double interpolation, and simple interpolation.  The plots show the suboptimality (f(xk(θ))−f(x∗(θ))) and the Frobenius norm of the derivative error (||∂θxk(θ)−∂θx∗(θ)||F). The results validate the theoretical predictions of Theorem 2.2 from the paper.  Each column represents a specific step size strategy and is accompanied by a corresponding subplot illustrating the convergence behavior of the derivatives.", "section": "4 Numerical illustration"}, {"figure_path": "7WoOphIZ8u/figures/figures_9_2.jpg", "caption": "Figure 1: Numerical behavior of SGD iterates and their derivatives (Jacobians) in a linear regression problem solved by ordinary least squares. The plots depict the convergence of the suboptimality f(xk(0)) − f(x*(0)) and the Frobenius norm of the derivative error ||дөхк (0) – дөх*(0) || F across different experimental settings: constant step-size (first column), decreasing step-size (second column), double interpolation (third column), and simple interpolation (fourth column). The experiments utilize varying step-size strategies to illustrate general estimates, sublinear rates, and the impacts of interpolation regimes, validating theoretical predictions of Theorem 2.2.", "description": "The figure displays the convergence behavior of SGD iterates and their Jacobian derivatives in four different experimental settings of linear regression using ordinary least squares.  The settings vary the step size strategy (constant, decreasing) and the level of interpolation (simple, double). Each subplot shows the convergence of both the suboptimality (f(xk(θ)) - f(x*(θ))) and the Frobenius norm of the derivative error (||∂θxk(θ) - ∂θx*(θ)||F). The results illustrate the theoretical convergence rates and behaviors established in Theorem 2.2.", "section": "4 Numerical illustration"}]