[{"figure_path": "OuKW8cUiuY/figures/figures_5_1.jpg", "caption": "Figure 1: Unconditional HR images generation from LR diffusion models", "description": "This figure shows the results of generating high-resolution (HR) images from low-resolution (LR) diffusion models.  The left side displays 256x256 images sampled from a 128x128 diffusion model, highlighting the local nature of the generated textures. The right side shows 512x512 images sampled from a 256x256 diffusion model, further emphasizing this locality. This demonstrates that the pre-trained LR diffusion model can be used to directly handle high-resolution noisy images by leveraging the inherent local diffusion prior.", "section": "3.4 Local Diffusion Priors"}, {"figure_path": "OuKW8cUiuY/figures/figures_7_1.jpg", "caption": "Figure 2: Visual comparison of different denoising methods in SIDD validation dataset.", "description": "This figure shows a visual comparison of different denoising methods applied to images from the SIDD validation dataset.  The results demonstrate the visual quality of denoising using several different methods.  The denoised images are compared to the ground truth (GT) images to illustrate the performance of each method.  It is a visual representation of the quantitative results reported in Table 2 of the paper.", "section": "4.2 Main Results"}, {"figure_path": "OuKW8cUiuY/figures/figures_7_2.jpg", "caption": "Figure 2: Visual comparison of different denoising methods in SIDD validation dataset.", "description": "This figure compares the visual results of different denoising methods on the SIDD validation dataset.  It shows a section of a noisy image alongside the results obtained by several methods: DIP, Self2Self, PD-denoising, ZS-N2N, ScoreDVI, GDP, DR2, DDRM, APBSN, and the proposed method.  The comparison allows for a visual assessment of the effectiveness of each method in removing noise while preserving image details and textures.  The ground truth (GT) image is also included for reference.", "section": "4.2 Main Results"}, {"figure_path": "OuKW8cUiuY/figures/figures_8_1.jpg", "caption": "Figure 4: The estimated noise variance 1/E(φο) = βο/20 on SIDD dataset", "description": "This figure consists of two subfigures. Subfigure (a) shows visual results of the estimated noise variance β₀/α₀. The brighter the color is, the larger the value of β₀/α₀ will be, representing higher noise variance. Subfigure (b) shows the relationship between PSNR and the average β₀/α₀ over the entire SIDD dataset. It demonstrates an inverse correlation; images with higher average β₀/α₀ tend to have lower PSNR values.", "section": "4.3 Ablation and Analyses"}, {"figure_path": "OuKW8cUiuY/figures/figures_14_1.jpg", "caption": "Figure 2: Visual comparison of different denoising methods in SIDD validation dataset.", "description": "This figure shows a visual comparison of different denoising methods applied to images from the SIDD validation dataset.  It provides a qualitative assessment of the results by visually comparing the denoised images produced by different methods against the ground truth. This allows for a direct visual comparison of the effectiveness of different techniques in removing noise from real-world images.", "section": "4.2 Main Results"}, {"figure_path": "OuKW8cUiuY/figures/figures_15_1.jpg", "caption": "Figure 6: Visual comparison of different denoising methods in PolyU.", "description": "This figure shows a visual comparison of different denoising methods applied to a real-world image from the PolyU dataset.  The image depicts a close-up of some electronic components and wires.  It highlights the differences in denoising performance across various methods, including the proposed approach, showing improvements in noise reduction and detail preservation.  The comparison visually demonstrates that the proposed approach performs superior denoising while preserving image details.", "section": "4.2 Main Results"}, {"figure_path": "OuKW8cUiuY/figures/figures_15_2.jpg", "caption": "Figure 7: Visual comparison of different denoising methods in FMDD", "description": "This figure shows the visual comparison of different denoising methods on the FMDD dataset. The methods compared include Noisy (original noisy image), PD, ZS-N2N, DDRM, ScoreDVI, APBSN, Self2Self, GDP, Ours (the proposed method), and GT (ground truth). The zoomed-in section highlights the differences in detail preservation and noise removal between the methods.  The figure demonstrates the superior performance of the proposed method in restoring fine details and reducing noise effectively compared to other existing methods. ", "section": "4.2 Main Results"}, {"figure_path": "OuKW8cUiuY/figures/figures_15_3.jpg", "caption": "Figure 3: Visual comparison of different denoising methods in PolyU. PSNR/SSIM values: PD (36.77/0.916), APBSN (37.59/0.944), DR2 (34.53/0.864), Self2Self (39.44/0.961), ZSN2N (35.12/0.879), GDP (33.43/0.888), DDRM (33.61/0.773), ScoreDVI (37.76/0.939), Ours (39.01/0.965)", "description": "This figure compares different image denoising methods on the PolyU dataset, showing visual results and PSNR/SSIM values for each method.  The methods compared include: PD-denoising, APBSN, DR2, Self2Self, ZS-N2N, GDP, DDRM, ScoreDVI, and the proposed method. The figure highlights the visual quality differences between methods and shows that the proposed method achieves the highest PSNR/SSIM scores.", "section": "4.2 Main Results"}, {"figure_path": "OuKW8cUiuY/figures/figures_15_4.jpg", "caption": "Figure 9: Visual comparison of denoising results on Bernoulli denoising (p = 0.2)", "description": "This figure compares the denoising results of different methods on Bernoulli noise with p=0.2.  It shows two example images and their denoised versions using ZS-N2N and the proposed method, along with the ground truth. The figure visually demonstrates the effectiveness of the proposed method in reducing noise while preserving image details and textures, especially compared to ZS-N2N which leaves noticeable artifacts.", "section": "4.5 Application to image demosaicing"}]