[{"figure_path": "qzwAG8qxI1/figures/figures_1_1.jpg", "caption": "Figure 1: Illustration of our graph-theoretic framework for joint out-of-distribution generalization and detection. Left: Graph formulation containing three types of data in the wild: ID (e.g., seabird), covariate OOD (e.g., bird in the forest), and semantic OOD (e.g., dog). Right: Graph factorization for obtaining the closed-form solution of the data representations, which are used to derive OOD generalization and OOD detection errors.", "description": "This figure illustrates the proposed graph-theoretic framework for jointly addressing out-of-distribution (OOD) generalization and detection. The left panel shows the graph formulation, where nodes represent data points (in-distribution (ID), covariate OOD, and semantic OOD) and edges connect similar data points.  The right panel details the graph factorization process, using singular value decomposition (SVD) to obtain data representations from the adjacency matrix which allows for quantifying errors in OOD generalization and detection.", "section": "1 Introduction"}, {"figure_path": "qzwAG8qxI1/figures/figures_5_1.jpg", "caption": "Figure 1: Illustration of our graph-theoretic framework for joint out-of-distribution generalization and detection. Left: Graph formulation containing three types of data in the wild: ID (e.g., seabird), covariate OOD (e.g., bird in the forest), and semantic OOD (e.g., dog). Right: Graph factorization for obtaining the closed-form solution of the data representations, which are used to derive OOD generalization and OOD detection errors.", "description": "This figure illustrates the graph-theoretic framework proposed in the paper for jointly addressing out-of-distribution (OOD) generalization and detection.  The left panel shows the graph formulation, where nodes represent data points (in-distribution (ID), covariate-shifted OOD, and semantic-shifted OOD) and edges represent relationships between data points. The right panel depicts the graph factorization process, which involves singular value decomposition (SVD) of the adjacency matrix to obtain data representations. These representations are then used to quantify OOD generalization and detection performance through provable error bounds. The overall framework combines graph-based data representation with spectral analysis to bridge the gap between OOD generalization and detection.", "section": "1 Introduction"}, {"figure_path": "qzwAG8qxI1/figures/figures_6_1.jpg", "caption": "Figure 3: Value of function S(f)", "description": "This figure shows a heatmap visualizing the value of function S(f) across different values of α' and β'. The function S(f) quantifies the distance between ID and semantic OOD data, with larger values indicating better OOD detection capability.  The heatmap reveals the relationship between these two parameters and their impact on the separability of ID data from semantic OOD data, offering insights into the effectiveness of OOD detection.  The color intensity represents the magnitude of S(f).", "section": "4 Theoretical Analysis"}, {"figure_path": "qzwAG8qxI1/figures/figures_8_1.jpg", "caption": "Figure 4: (a) Distribution of KNN distance. (b) t-SNE visualization of learned embeddings. We employ CIFAR-10 as Pin, CIFAR-10-C as Pcovariate, and SVHN as Psemanticout.", "description": "This figure visualizes the distribution of KNN distances and the t-SNE visualization of learned embeddings, which are used to analyze the performance of the proposed graph-theoretic framework.  Panel (a) shows the distribution of KNN distances for the ID data, covariate OOD, and semantic OOD data.  The distribution of KNN distances clearly shows the separation between semantic OOD data and the ID data, while the covariate OOD data is embedded closely to the ID data. Panel (b) shows the t-SNE visualization of learned embeddings, demonstrating the grouping of ID and covariate OOD data in the embedding space while semantic OOD data is separated. This visualization supports the theoretical analysis and empirical results presented in the paper.", "section": "5.3 Further Analysis"}, {"figure_path": "qzwAG8qxI1/figures/figures_19_1.jpg", "caption": "Figure 1: Illustration of our graph-theoretic framework for joint out-of-distribution generalization and detection. Left: Graph formulation containing three types of data in the wild: ID (e.g., seabird), covariate OOD (e.g., bird in the forest), and semantic OOD (e.g., dog). Right: Graph factorization for obtaining the closed-form solution of the data representations, which are used to derive OOD generalization and OOD detection errors.", "description": "This figure illustrates the proposed graph-theoretic framework. The left panel shows the graph formulation with three data types: in-distribution (ID), covariate out-of-distribution (OOD), and semantic OOD.  The right panel depicts the graph factorization process used to obtain data representations for quantifying OOD generalization and detection performance.  The graph factorization uses singular value decomposition (SVD) to obtain a low-rank approximation of the adjacency matrix, allowing for the derivation of closed-form solutions which are then used to quantify error in both generalization and detection.", "section": "1 Introduction"}, {"figure_path": "qzwAG8qxI1/figures/figures_20_1.jpg", "caption": "Figure 3: Value of function S(f)", "description": "The figure shows the heatmap of function S(f) which represents the separability between ID and semantic OOD data. The magnitude of S(f) reflects the extent of separation between ID and semantic OOD data. Larger S(f) suggests better OOD detection capability. The x-axis represents α' and the y-axis represents β', which are parameters related to the augmentation transformation probability. The color bar represents the value of S(f). The heatmap shows how the separability varies depending on the values of α' and β'.", "section": "4 Theoretical Analysis"}]