[{"type": "text", "text": "M3GPT: An Advanced Multimodal, Multitask Framework for Motion Comprehension and Generation ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Mingshuang Luo1,2,3, Ruibing $\\mathbf{Hou}^{1*}$ , Zhuo $\\mathbf{Li^{4}}$ , Hong Chang1,3, Zimo Liu2, Yaowei Wang2,5, Shiguang Shan1,3 ", "page_idx": 0}, {"type": "text", "text": "1Key Laboratory of Intelligent Information Processing of Chinese Academy of Sciences (CAS), Institute of Computing Technology, CAS, China 2Peng Cheng Laboratory, China, 3University of Chinese Academy of Sciences, China 4WeChat, Tencent Inc, 5Harbin Institute of Technology, Shenzhen ", "page_idx": 0}, {"type": "text", "text": "mingshuang.luo@vipl.ict.ac.cn,{houruibing,changhong,sgshan}@ict.ac.cn albertzli@tencent.com,liuzm@pcl.ac.cn,wangyaowei@hit.edu.cn ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "This paper presents $\\mathbf{M}^{\\mathrm{3}}\\mathbf{G}\\mathbf{P}\\mathbf{T},$ , an advanced Multimodal, Multitask framework for Motion comprehension and generation. $\\mathrm{\\bfM^{3}G P T}$ operates on three fundamental principles. The first focuses on creating a unified representation space for various motion-relevant modalities. We employ discrete vector quantization for multimodal conditional signals, such as text, music and motion/dance, enabling seamless integration into a large language model (LLM) with a single vocabulary. The second involves modeling motion generation directly in the raw motion space. This strategy circumvents the information loss associated with a discrete tokenizer, resulting in more detailed and comprehensive motion generation. Third, $\\mathrm{M^{3}G P T}$ learns to model the connections and synergies among various motion-relevant tasks. Text, the most familiar and well-understood modality for LLMs, is utilized as a bridge to establish connections between different motion tasks, facilitating mutual reinforcement. To our knowledge, $\\mathrm{M^{3}G P T}$ is the first model capable of comprehending and generating motions based on multiple signals. Extensive experiments highlight $\\mathbf{\\bar{M}}^{3}$ GPT’s superior performance across various motion-relevant tasks and its powerful zero-shot generalization capabilities for extremely challenging tasks. Project page: https://github.com/luomingshuang/M3GPT. ", "page_idx": 0}, {"type": "image", "img_path": "ODbTlAs0Oj/tmp/4a0d54da67b1c813c04739a09fe7f7dcb746aec61cda0f28c8f4ffec15e10b88.jpg", "img_caption": ["Figure 1: $:\\mathbf{M}^{3}\\mathrm{GPT}$ can handle core motion comprehension and generation tasks, including text-to-motion, motionto-text, music-to-dance, dance-to-music, motion prediction, and motion in-between. The motion sequences within the dashed-line areas are masked in the input. "], "img_footnote": [], "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 1}, {"type": "text", "text": "Motion comprehension and generation in multimodality are crucial for diverse applications, including AR/VR creation, video games, and virtual reality. Numerous studies [15, 51, 64, 52] focus on motion comprehension, including captioning 3D human motions and generating music from 3D human dances2. Recent advancements in AI [14, 44, 42, 48] have paved the way for motion generation, allowing for various control signals including textual descriptions, music pieces, and human poses. A significant shortcoming of most existing works is their focus on single-modality control signals, overlooking the potential for multimodal information integration. More importantly, the comprehension and generation of motions are predominantly studied in isolation. In reality, human motion cognition and communication indispensably require seamless transitions between any motion-relevant modalities. Therefore, it is vital to develop a unified framework for motion comprehension and generation that can efficiently utilize multiple signals simultaneously. ", "page_idx": 1}, {"type": "text", "text": "Recent works [12, 62, 63, 58] have shown success in developing a unified multitask motion framework which integrates text-driven and audio-driven motion generation through a single architecture. Employing a large language model (LLM), [60] adeptly handles multimodal control signals, such as text and single-frame pose, to generate consecutive motions. Despite their promising performance in motion generation, these approaches often fall short in comprehending motion. MotionGPT [21], a recent innovation, constructs a unified motion-language model to generate plausible human motions and natural language descriptions through prompt instructions. However, MotionGPT focuses solely on a single non-motion modality, i.e., text. While aligning motion with one additional modality is relatively straightforward, integrating three or more modalities within a single framework and achieving bidirectional alignment among them to cover a broad range of modalities for motion comprehension and generation presents a formidable challenge. ", "page_idx": 1}, {"type": "text", "text": "Two main challenges need to be solved for building a unified multimodal framework for motion comprehension and generation. The first is how to create a unified representation space across different motion-relevant modalities. MotionGPT [21] and SpeechGPT [54] separately treat motion and speech as specific language for seamlessly integrating with text. Inspired by these efforts [21, 54], we view both motion and music as distinct forms of language, facilitating better associations with text via LLMs. Specifically, akin to language, we compress raw motion and music into a sequence of discrete semantic tokens. By encoding motion, music, and language within a single vocabulary, we can build a unified representation space across these different modalities. The second is how to model the connections and synergies among various motion tasks. Different motion-relevant tasks are interconnected and can mutually enhance each other. Since text is the most familiar and well-understood modality for LLMs, we propose employing text as a bridge to establish connections between different motion tasks. Specifically, to better learn the complex music-to-dance task where both input and output modalities are unfamiliar to LLMs, we introduce two auxiliary tasks: musicto-text and text-to-dance, aimed at aligning music and dance modalities with the structured text embedding space. This strategy enables us to establish connections and synergies between musicto-dance and text-to-motion tasks, facilitating the alignment and collaboration of text, music, and motion/dance modalities across different tasks. ", "page_idx": 1}, {"type": "text", "text": "In this work, we propose a uniform Multimodal, Multitask framework for Motion comprehension and generation, namely $\\mathbf{M}^{\\mathrm{3}}\\mathbf{G}\\mathbf{P}\\mathbf{T},$ , that leverages the strong language generation capability of LLMs for unifying various motion-relevant tasks, as depicted in Fig. 1. $\\mathbf{\\breve{M}}^{\\mathrm{3}}\\mathbf{GPT}$ comprises three tires. Firstly, $\\mathbf{M}^{\\bar{3}}\\mathbf{GPT}$ is equipped with multimodal tokenizers capable of compressing raw multimodal data, including motion, music, and text, into a sequence of discrete semantic tokens. These discrete representations allow the core LLM to unify motion comprehension and generation in an autoregressive manner, operating at the discrete semantic representation space. Secondly, different from [21, 60] that solely optimize LLM in discrete semantic space, we jointly train LLM and motion de-tokenizer, optimizing LLM in both discrete semantic space and raw continuous motion space. This operation enables the motion-space error signals from de-tokenizer to backpropagate to LLM, enhancing LLM’s ability to generate the details of motion. Thirdly, we construct paired text descriptions for music, and design two auxiliary music-to-text and text-to-dance tasks, which aid in aligning music and dance with the text embedding space. Also, we build up a shared tokenizer for motion and dance data to project them into a shared semantic space. These auxiliary tasks and shared tokenizer establish connections between music-to-dance and text-to-motion, enabling mutual reinforcement. ", "page_idx": 1}, {"type": "table", "img_path": "ODbTlAs0Oj/tmp/f9613a9c52f0dbdb4ff100f515bebfd2963393d665a2782aa75aa1d814964236.jpg", "table_caption": [], "table_footnote": ["Table 1: Comparison of recent multimodal, multitask methods across various motion comprehension and generation tasks. T2M: text-to-motion; M2T: motion-to-text; A2D: music-to-dance; D2A: dance-to-music; M2M: motion-to-motion that includes motion prediction and motion in-between. Random M, Random T, and Random A represent the unconstrained generation of motion, text, and music3, respectively. "], "page_idx": 2}, {"type": "text", "text": "", "page_idx": 2}, {"type": "text", "text": "We employ a multimodal pre-training $^+$ instruction-tuning pipeline to train $\\mathbf{M}^{3}\\mathbf{GPT}$ , enhancing inter-modal alignment and effectively aligning them with human intent. To our knowledge, $\\mathrm{M^{3}G P\\bar{T}}$ is the first approach to integrate six core tasks of motion comprehension and generation—text-tomotion, motion-to-text, music-to-dance, dance-to-music, motion prediction, and motion in-between— into a uniform framework. Extensive experiments demonstrate that $\\mathrm{\\bfM^{3}G P T}$ achieves competitive performance across multiple motion-relevant tasks. Additionally, through qualitative results, we demonstrate that $\\mathrm{M^{3}G P T}$ possesses powerful zero-shot generalization capabilities, e.g., long-term dance generation and music-text conditioned dance generation. ", "page_idx": 2}, {"type": "text", "text": "2 Related Work ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Motion comprehension and Generation. Many existing works focus on studying human appearance, pose, detection, attribute, part parsing and so on [61, 19, 45, 40, 23, 17]. This work focuses on studying human motion, including motion comprehension and motion generation. Motion comprehension involves two core tasks: motion-to-text and dance-to-music. Motion-to-text aims to describe human motion with natural language [37]. For example, recurrent networks have been used in [37] to accomplish this task. Dance-to-music involves creating a piece of music from a given dance [20, 27, 64]. For example, Zhun et al. [64] utilizes a generative adversarial network to generate music from dance videos. On the other hand, motion generation involves generating diverse human motions using multimodal inputs, such as text [44, 56, 15, 5, 57], music [27, 18, 52, 42] and incomplete motion [31, 1, 3]. Text-to-motion is one of the most important motion generation tasks. Recent works typically map text to motion using different architectures: diffusion model [57] and autoregressive transformer model [15]. Music-to-dance focuses on generating dance movements from music. For example, [42] predicts discrete token sequences conditioned on music, which are then used to regenerate the dance sequence. Motion Completion generates motion conditioning on partial motions, such as motion prediction [31, 1] and motion-in-between [34, 43]. Although these methods have shown promising results in various human motion tasks, most are limited to handling a single task. Until recently, some works [12, 21, 60, 62] attempt to integrate two or more tasks into a unified model, as shown in Tab. 1. However, these works either lack the ability of motion comprehension [62, 60] or fail to handle music modality [12, 21]. In this work, we propose a unified motion comprehension and generation framework that can handle multiple control signals simultaneously. ", "page_idx": 2}, {"type": "text", "text": "Language Models and Multimodal. Large language models (LLMs) enabled by extensive datasets and model size, such as T5 [39], Flan-T5 [7], LLaMA [46], LLaMA-2 [47] and Vicuna [6], have demonstrated impressive comprehension and generation capabilities. Researchers have leveraged the capabilities of LLMs to handle multimodal tasks, expanding them to multimodal large language models (MLLMs). For example, AnyGPT [53] employs LLaMA-2 [47] to construct an any-to-any multimodal language model. NExT-GPT [50] employs Vicuna [6] with multimodal adaptors and diffusion decoders to perform tasks across arbitrary combinations of text, images, videos, and audio. Recently, the works [21, 60] attempt to use LLMs for motion-related tasks. [60] uses LLaMA [46] to build a general-purpose motion generator, which, however, lacks the ability to comprehend motion. [21] leverages T5 to construct a unified motion-language model, but cannot deal with music modality. ", "page_idx": 2}, {"type": "image", "img_path": "ODbTlAs0Oj/tmp/899ed87a766bf40030f1c45818e26fde9103eb4c98af461400c1115a9596ef03.jpg", "img_caption": ["Figure 2: An overview of the $\\mathrm{M^{3}G P T}$ framework. $\\mathrm{\\bfM^{3}G P T}$ consists of multimodal tokenizers and a motionaware language model. The training process of $\\mathrm{M}^{3}\\mathrm{GPT}$ consists of three stages: multimodal tokenizers training, modality-alignment pre-training, and instruction tuning. "], "img_footnote": [], "page_idx": 3}, {"type": "text", "text": "3 Method ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "To enhance the comprehension and generation of motion-relevant modalities, we propose a unified multimodal framework named $\\mathbf{M}^{\\mathrm{3}}\\bar{\\mathbf{G}}\\mathbf{P}\\mathbf{T}$ . As illustrated in Fig. 2, $\\mathrm{\\bfM^{3}G P T}$ consists of multimodal tokenizers responsible for compressing raw motion and music data into discrete tokens (Sec. 3.1), and a motion-aware language model that learns to understand and generate motion tokens from LLMs by corresponding text and music (Sec. 3.2). To address motion-relevant tasks, we employ a three-stage training scheme encompassing multimodal tokenizers training, modality-alignment pre-training, and instruction tuning (Sec. 3.3). During the inference process, multimodal tokens are decoded back into their original representations by associated de-tokenizers (decoders of multimodal tokenizers), enabling various motion-relevant tasks to be executed via instructions (Sec. 3.4). ", "page_idx": 3}, {"type": "text", "text": "3.1 Multimodal tokenizers ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "As shown in Fig. 2, Multimodal tokenizers aim to discretize continuous human motion and music into language-like tokens, allowing the three modalities to be unified within a single language model. ", "page_idx": 3}, {"type": "text", "text": "3D Human Motion Tokenizer. To represent motion in discrete semantic tokens, we build a 3D human motion tokenizer based on Vector Quantized Variational Autoencoders (VQ-VAE) following [12, 62, 21, 60]. The motion tokenizer consists of a motion encoder $\\mathcal{E}_{m}$ and a motion decoder $\\mathcal{D}_{m}$ , along with a codebook $\\mathcal{B}_{m}=\\left\\{b^{1},b^{2},\\ldots,b^{N_{m}}\\right\\}$ containing $N_{m}$ discrete semantic vectors. Notably, to facilitate mutual enhancement between motion and dance data, we employ a shared tokenizer for both motions and dances, projecting them into a consistent and shared semantic space. Formally, given a 3D motion sequence $\\bar{m}\\in\\mathbb{R}^{\\breve{T}_{m}\\times d_{m}}$ , where $T_{m}$ is the time length and $d_{m}$ is the dimensionality of each frame’s pose, the motion encoder $\\mathcal{E}_{m}$ that consists of several 1-D convolutional layers projects $\\mathbf{\\nabla}m$ to a latent embeddings $\\boldsymbol{z}\\in\\mathbb{R}^{L_{m}\\times d}$ . Here, $L_{m}$ is the time interval after downsampling and $d$ is the latent dimension. Next, we transform $_{\\textit{z}}$ into a collection of codebook entries through discrete quantization. Specifically, the quantization process replaces each item of $_{z}$ with its nearest embedding in the codebook $B_{m}$ , obtaining the quantized latent vectors $\\boldsymbol{e}\\in\\mathbb{R}^{L_{m}\\times d}$ as follows: ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\boldsymbol{e}=\\underset{b^{k}\\in\\mathcal{B}_{m}}{\\arg\\operatorname*{min}}\\left\\|\\boldsymbol{z}-\\boldsymbol{b}^{k}\\right\\|_{2}.\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "The motion decoder $\\mathcal{D}_{m}$ , which consists of several 1-D deconvolutional layers, projects the quantized embeddings back to raw motion space as $\\hat{m}={\\cal D}_{m}\\left(e\\right)$ . Following [21, 60], the motion tokenizer can be trained by the reconstruction loss, embedding loss and commitment loss as follows: ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\mathcal{L}_{v q}=||\\pmb{\\hat{m}}-\\pmb{m}||_{1}+||\\mathbf{sg}\\left[\\pmb{z}\\right]-\\pmb{e}||_{2}^{2}+\\beta||\\pmb{z}-\\mathbf{sg}\\left[\\pmb{e}\\right]||_{2}^{2}\\;.\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "where $\\mathrm{sg}\\left[\\cdot\\right]$ is the stop gradient, and $\\beta$ is the factor that adjusts the weight of the commitment loss. ", "page_idx": 3}, {"type": "text", "text": "After training the motion tokenizer, a motion sequence $\\mathbf{\\nabla}m$ can be represented as a sequence of discrete codebook-indices of quantized embedding vector, namely motion tokens $\\boldsymbol{q_{m}}\\in\\mathbb{R}^{L_{m}}$ , as follows: ", "page_idx": 4}, {"type": "equation", "text": "$$\nq_{m}=\\underset{k\\in\\{1,\\dots,N_{m}\\}}{\\arg\\operatorname*{min}}\\left\\|\\mathcal{E}_{m}\\left(m\\right)-b^{k}\\right\\|_{2}.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Music Tokenizer. For the music data, we adopt the VQ-VAE in Jukebox [9] as the music tokenizer, which consists of a music encoder $\\mathcal{E}_{a}$ , a music decoder $\\mathcal{D}_{a}$ and a music codebook $\\boldsymbol{{B}}_{a}$ . Notably, the limited number of music samples in dance datasets makes it inadequate for training an effective music tokenizer. To leverage the strong representation ability of the tokenizer trained on the large-scale musical dataset, we use the pre-trained VQ-VAE from Jukebox [9], which has been trained on a dataset of 1.2 million songs. Specifically, we first segment each input music sample into 5-second music segments. Then, for each 5 seconds segment $\\pmb{a}\\in\\mathbb{R}^{T_{a}\\times d_{a}^{\\textbf{\\texttt{x}}}}$ , we use the pre-trained music tokenizer $\\{\\mathcal{E}_{a},\\mathcal{B}_{a}\\}$ to encode $\\textbf{\\em a}$ into a sequence of discrete codebook-indices $\\pmb{q_{a}}\\in\\mathbb{R}^{L_{a}}$ (namely music tokens) following Eq. 3. ", "page_idx": 4}, {"type": "text", "text": "3.2 Language Model Backbone ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "Expanding Vocabulary. To incorporate multimodal discrete representations into a pre-trained LLM, we expand the original text vocabulary $V_{t}$ in LLM with motion vocabulary $B_{m}$ and music vocabulary $\\boldsymbol{{\\beta}}_{a}$ , forming a new unified vocabulary $V=\\{V_{t},B_{m},B_{a}\\}$ . To accommodate the expanded vocabulary, we extend the corresponding embedding and prediction layer of LLM, where the newly incorporated parameters are initialized randomly. ", "page_idx": 4}, {"type": "text", "text": "Unified Multimodal Language Model. Equipped with multimodal tokenizers, we can compress multimodal data into discrete token sequences. To be specific, employing the trained motion tokenizer and music tokenizer, the input motion $m\\in\\mathbb{R}^{T_{m}\\times d_{m}}$ and music $\\bar{\\mathbfit{a}}\\in\\breve{\\mathbb{R}}^{T_{a}\\times d_{a}}$ can be mapped into a sequence of discrete motion tokens $\\b{q_{m}}\\in\\mathbb{R}^{L_{m}}$ and music tokens $\\pmb{q_{a}}\\in\\mathbb{R}^{L_{a}}$ . Then equipped with a unified vocabulary $V$ , we can formulate various motion-relevant tasks in a general format, where both input and output tokens come from the same vocabulary. These tokens can represent natural language, human motion, music, or any combination, depending on the specific task to be solved. This naturally enables the core LLM to unify motion comprehension and generation tasks in an autoregressive manner. ", "page_idx": 4}, {"type": "text", "text": "Following [21], we employ T5 [39] as the language model backbone, which is pre-trained on 750 GB of text tokens. By leveraging this pre-trained large language model, we can harness its powerful modeling capabilities and generalizability to develop a more user-friendly, motion-related human-computer interaction model. ", "page_idx": 4}, {"type": "text", "text": "3.3 Training Strategy ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "The training process is divided into three stages. The first stage is Multimodal Tokenizers Training, which focuses on learning the motion/music tokenizer to represent motion/music as discrete tokens. The second stage is Modality-Alignment Pre-training, which aims to align motion, music, and text modalities, and facilitate collaboration across different motion-relevant tasks. The third stage is Instruction Fine-Tuning, aimed at enhancing the model’s instruction-following capability. ", "page_idx": 4}, {"type": "text", "text": "Stage1: Multimodal Tokenizers Training. We first train a motion tokenizer using the objective defined in Eq. 2. As for the music tokenizer, due to the limited music samples in existing dance datasets, we directly use the pre-trained VQ-VAE model from Jukebox [9]. This process allows any motion sequence and music to be represented as a sequence of tokens, enabling seamless integration with text within LLM. To ensure the stability of LLM training, the encoder of motion tokenizer and whole music tokenizer remain unchanged. Notably, we continue to optimize the decoder of motion tokenizer in subsequent training stages to further enhance the quality of generated motions. ", "page_idx": 4}, {"type": "text", "text": "Stage2: Modality-Alignment Pre-training. To enable LLM to handle discrete modalities, we utilize paired motion corpus to train LLM in a next-token prediction task. This process aims to align the text, music, and motion modalities for unified reasoning in LLM. ", "page_idx": 4}, {"type": "text", "text": "• Joint optimization of LLM and motion de-tokenizer. Human motion (especially dance) encompasses intricate details. Previous works [21, 60] keep the motion de-tokenizer fixed during training LLM, which hinders LLM’s ability to perceive the distribution and details of motions. Specifically, in the output space of LLM, different motion tokens are treated as independent classes; therefore, the cost of classifying a motion token as semantic-similar token and semantic-distant token is the same. Apparently, relying solely on LLM’s autoregressive loss is insufficient for capturing the details of motion. To address this problem, we jointly optimize LLM and motion de-tokenizer in stage2 and stage3. This strategy enables the reconstruction error signals in raw motion space to backpropagate to LLM, enhancing LLM’s ability to generate the details of motion. With the goal of minimizing L1 loss between the predicted and real motion, we search for the motion’s token sequence that could minimize this L1 loss in original motion space. As the motion de-tokenizer continuously optimizes, the target motion’s token sequence, which supervises LLM training, dynamically changes. This dynamic adjustment reduces L1 loss progressively, achieving joint optimization. ", "page_idx": 4}, {"type": "text", "text": "", "page_idx": 5}, {"type": "text", "text": "• Synergy learning of multitasks. Although aligning text with one additional modality is relatively straightforward, integrating multiple modalities (e.g., motion, text, and music) within a single framework poses a significant challenge. Additionally, as noted in [4], multitask joint training usually achieves inferior performance on each individual task compared to single-task training. This phenomenon is also observed in our text-to-motion task, as shown in Tab. 2. We argue that the large modality difference among different motion-relevant tasks (e.g., music-to-dance and text-to-motion) prevents the model from effectively establishing connections between these tasks. Thus it is difficult for the model to identify a common optimization direction that beneftis all tasks. ", "page_idx": 5}, {"type": "text", "text": "As ‘text’ serves as a highly semantic descriptor for other modalities and is the most familiar and well-modeled modality to LLM, we use ‘text’ as a bridge to align motion, text, and music data, thereby mitigating conflicts in aligning multiple modalities. Initially, we construct paired textual descriptions for music samples in the dance datasets. Specifically, we use the style annotations of the music to create paired texts, such as ‘a person is dancing Jazz’. Then, we construct two auxiliary tasks using the generated pairs of music and text, i.e., music-to-text and text-to-dance. Through these two auxiliary tasks, $\\mathbf{\\bar{M}}^{3}\\mathbf{GPT}$ implicitly learns to decompose the complex music-to-dance task into two simpler tasks music-to-text and text-to-dance. Additionally, with a shared tokenizer for motion and dance, text-to-dance and text-to-motion tasks occupy the same matching space, and thus can mutually reinforce each other. In this way, $\\mathrm{M^{3}G P T}$ builds the synergies between the two primary motion generation tasks, music-to-dance and text-to-motion, facilitating mutual reinforcement, as shown in Tab. 2. ", "page_idx": 5}, {"type": "text", "text": "Combining the above analysis, we jointly train LLM and motion de-tokenizer using a mixture of motion comprehension and generation tasks, along with two auxiliary music-to-text and text-todance tasks. Besides the auxiliary tasks, we consider 2 basic motion comprehension tasks, i.e., motion-to-text and dance-to-music, and 4 basic motion generation tasks, i.e., text-to-motion, musicto-dance, motion prediction and motion in-between. Formally, for a specific task, we denote the source input consisting of a sequence of tokens as $\\pmb q_{s}=\\{\\pmb q_{s}^{i}\\}_{i=1}^{L_{s}}$ s1, the target output as qt = qit iL=t1, LLM predicts the probability distribution of potential next token at each step $p_{\\theta}\\left(\\pmb{q}_{t}^{i}|\\pmb{q}_{t}^{<i},\\pmb{q}_{s}\\right)$ in an autoregressive manner. For motion generation tasks, we add a reconstruction loss. Specifically, when the output tokens are motion tokens, we pass them to motion de-tokenizer to generate a motion sequence (denoted as $\\hat{m}$ ), where a reconstruction loss is then employed for guidance. Overall, during this training process, the objective is to maximize the log-likelihood of the data distribution and minimize the reconstruction error within raw motion space: ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\mathcal{L}=\\sum_{i=0}^{L_{t}-1}\\log p_{\\theta}\\left(\\pmb{q}_{t}^{i}|\\pmb{q}_{t}^{<i},\\pmb{q}_{s}\\right)+\\lambda\\left\\|\\pmb{\\hat{m}}-\\pmb{m}\\right\\|_{1},\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $\\mathbf{\\nabla}m$ denotes the ground-truth for $\\hat{m}$ generated by motion de-tokenizer, and $\\lambda$ is a hyperparameter to adjust the weight for reconstruction loss. ", "page_idx": 5}, {"type": "text", "text": "Stage3: Instruction Fine-Tuning. To enhance the generalization and instruction-following capability of $\\mathbf{M}^{\\mathrm{3}}\\mathbf{G}\\mathbf{P}\\mathbf{T}$ , we construct a multimodal instruction dataset with resort to GPT-4, building upon existing motion datasets. Specifically, we define 11 core tasks, each comprising $200/50/5\\bar{0}$ training/validation/test instruction templates. For example, an instruction for text-to-motion task could be \"Create a motion that complements the poetic elements in <Caption_Placeholder>\", with <Caption_Placeholder> standing for any text sequence; an instruction for music-to-dance could be \"Script a dance that adapts to the tempo shifts in <Audio_Placeholder>\", with <Audio_Placeholder> standing for any music sequence. Further details are available in Appendix B.4. ", "page_idx": 5}, {"type": "text", "text": "3.4 Inference $\\mathbf{M}^{3}\\mathbf{GPT}$ ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "During inference, we evaluate $\\mathrm{\\mathbf{M}^{3}G P T}^{:}$ ’s performance across multiple motion-relevant tasks and datasets (Sec. 4.2 and Appendix (C, D). Also, we consider two challenging dance generation tasks to evaluate the zero-shot generalization ability of $\\mathrm{M^{3}G P T}$ : ", "page_idx": 6}, {"type": "text", "text": "(1) Generating long-duration dances from long music. Long-duration dance generation involves creating uninterrupted, coherent dance sequences based on a single piece of music. Due to the limitation of computational cost and memory overload, we train $\\bar{\\bf M}^{3}\\bar{\\bf G}{\\bf P}\\bar{\\bf T}$ on the task of 5-second music-to-dance generation. Conversely, during inference, we can combine this training task music-todance to generate an initial 5-second dance segment, and an unseen zero-shot task music $^+$ dance-todance that recursively generates subsequent dance segments conditioned on both music and previously generated dance segments, to perform long-duration and coherent dance generation. ", "page_idx": 6}, {"type": "text", "text": "(2) Generating dance controlled by both music and text. Integrating music and text as control signals in dance generation (music $^+$ text-to-dance) augments music-to-dance task with text modality. This process guides the generated dances to synchronize with particular actions described in input texts. Thanks to the tokenizer mechanism, $\\mathrm{M^{3}G P T}$ can seamlessly combine music and text in LLM’s input, enabling the integration of text instructions to produce a wide variety of dance sequences. ", "page_idx": 6}, {"type": "text", "text": "4 Experiments ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "4.1 Experimental setup ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "Datasets and Preprocessing. We use a large-scale text-to-motion dataset: Motion-X [29], and two music-to-dance datasets: $\\mathrm{AlST++}$ [24] and FineDance [25]. Notably, the 3D pose annotations differ among these datasets, therefore, we standardize their processing for uniform usage. Specifically, we select 22 joints common to these datasets and preprocess the motion samples following [13], resulting in motion sequences with identical representation. Further details on datasets and preprocessing are provided in Appendix B.1. ", "page_idx": 6}, {"type": "text", "text": "Evaluation Metrics. Different tasks employ distinct evaluation metrics. We use the most common evaluation metrics to assess the performance of $\\mathrm{M^{3}G P T}$ for each task. (1) Text-to-Motion. Following [21, 12], we use Frechet Inception Distance (FID), Diversity $(D i\\nu)$ , $R$ -Precition that calculates the top-1 motion-to-text retrieval accuracy (R TOP1). (2) Motion-to-Text. Following [21], we use linguistic metrics like BLEU, CIDEr, along with $R$ -Precision for evaluating motion-to-text alignment. (3) Music-to-Dance. Following [26, 52], we use $F I D$ , Diversity and Beat Align Score (BAS) on kinetic features [22] (denoted as $\"k\"$ ) to evaluate the dance generation quality. Notably, as noted in [48], the geometric features [33] are unreliable as a measure of dance generation quality. So we only use the kinetic features for evaluation. (4) Dance-to-Music. Following [52], we use Beats Coverage Scores (BCS), Beats Hit Scores (BHS), and $F l$ score to evaluate music generation quality. (5) Motion Prediction and In-Between. Following [21], we use $F I D$ and Diversity to measure the consistency between the provided pose conditions and generated motion. More details and results on other evaluation metrics are provided in Appendix B.2 and C. ", "page_idx": 6}, {"type": "text", "text": "Implementation Details. For motion tokenizer, we set the codebook size to 512. As for music tokenizer, we use the pre-trained VQ-VAE from Jukebox with a codebook size of 2048. In term of temporal downsampling rate, the motion encoder uses a rate of 4, while the music encoder uses a rate of 128. We utilize T5 base [39] as our language model backbone. For training the motion tokenizer, we use Adam as the optimizer with a batch size of 1000 and an initial learning rate of $10^{-4}$ . To train the language model backbone, we employ the Adafactor_dev optimizer and use CosineAnnealingLR as the learning rate scheduler. The learning rate is set to $2\\times\\bar{10}^{-4}$ for pre-training stage, and $\\bar{10}^{-4}$ for instruction fine-tuning stage. For hyperparameter settings, $\\lambda$ in Eq. 4 is set to 0.2, and $\\beta$ in Eq. 2 is set to 0.02. All our experiments are conducted on 8 NVIDIA A40 GPUs. To evaluate the model’s performance across different platforms, we also test our trained $\\mathrm{M^{3}G P T}$ with T5-base on Ascend 910B NPUs. Further details on implementation and hyperparameter analysis are provided in Appendix E. ", "page_idx": 6}, {"type": "table", "img_path": "ODbTlAs0Oj/tmp/1082b47cc5098143f26daea6819130ec0937a05a6e6f09b79f491e4806782aa0.jpg", "table_caption": ["Table 2: Evaluation of synergy learning and joint optimization of LLM and motion de-tokenizer on Text-toMotion (Motion-X [29]) and Music-to-Dance ( $\\mathrm{AIST++}$ [24]). T2M: Text-to-Motion. A2D: Music-to-Dance. T2D: Text-to-Dance. A2T: Music-to-Text. Trained single task refers to a model trained and tested on a single task. Pre-trained and Instruction-tuned indicate the model after pre-training (stage2) and instruction tuning (stage3), followed by direct testing on each task. The arrows $(\\uparrow)$ indicate that higher values are better. The arrows (↓) indicate that smaller values are better. Bold indicates the best result. "], "table_footnote": [], "page_idx": 7}, {"type": "text", "text": "4.2 Ablation Studies ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "In this section, we conduct ablation studies to validate the effectiveness of our method. We use the same model architecture throughout the experiments. The ablation results are shown in Tab. 2. ", "page_idx": 7}, {"type": "text", "text": "Effectiveness of joint optimization of LLM and motion de-tokenizer. Different from previous works [21, 60] that fix motion de-tokenizer during training LLM, we jointly optimize LLM and motion de-tokenizer in stage2 and stage3, as detailed in Sec. 3.3. As shown in Tab. 2, the joint optimization consistently brings performance gains across various metrics and most settings. Specifically, it largely enhances the fidelity of generated dances, reflected in a notable decrease in $\\mathrm{FID}_{k}$ score. We also notice a minor increase (less than 0.003) in FID of text-to-motion task in $\\mathbf{M}^{3}\\mathbf{G}\\mathbf{P}\\mathbf{T}$ . The possible reason is that the motion patterns controlled by text are relatively simple, making LLM optimized solely in discrete semantic space adequate for text-to-motion. Conversely, dances involve greater complexity, necessitating the joint optimization of motion decoder to accurately capture intricate dance movements without compromising information. ", "page_idx": 7}, {"type": "text", "text": "Effectiveness of synergy learning of multitasks. During the training of $\\mathbf{M}^{\\mathrm{3}}\\mathbf{G}\\mathbf{P}\\mathbf{T},$ we introduce a synergy multitask learning strategy by constructing two auxiliary tasks: Text-to-Dance (T2D) and Music-to-Text (A2T), as detailed in Sec. 3.3. As shown in Tab. 2, the inclusion of T2D and A2T consistently brings performance gains across various metrics on both text-to-motion and music-to-dance tasks. Specifically, for music-to-dance, the $\\mathrm{FID}_{k}$ score is decreased by nearly 10 points, indicating that the synergy learning helps generate more realistic dances. We argue that by incorporating these two auxilary tasks, $\\mathrm{M^{3}\\bar{G}P\\bar{T}}$ implicitly learns to decompose the complex music-to-dance into two simpler tasks, music-to-text and text-to-dance. This way, the text-to-motion task can assist in learning the music-to-dance task, thereby enhancing its performance. ", "page_idx": 7}, {"type": "text", "text": "4.3 Comparisons with State-of-the-arts ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "In this section, we compare our $\\mathbf{M}^{3}\\mathbf{GPT}$ with state-of-the-arts on multiple core motion-relevant tasks. We respectively report the comparison results on text-to-motion dataset, Motion-X [29], and music-to-dance datasets, $\\mathrm{AIST++}$ [24] and FineDance [25]. More quantitative and qualitative results are provided in Appendix C and D. Also, in the supplementary material’s zip file, we provide the render videos of generated motions/dances and generated music files by our $\\mathrm{\\dot{M}^{3}G P T}$ . ", "page_idx": 7}, {"type": "text", "text": "Main results on text-to-motion dataset. On the text-to-motion dataset, Motion-X, we evaluate $\\mathrm{{M^{3}G P T}}$ on 4 tasks, i.e., text-to-motion, motion-to-text, motion prediction, and motion in-between. The comparison results are shown in Tab. 3. As shown, $\\mathrm{M^{3}G P T}$ achieves competitive performance across all evaluated tasks, highlighting its capability to address diverse motion tasks in a single model. Also, for text-to-motion task, $\\bar{M^{3}}G P\\bar{T}$ (instruction-tuned only T2M), which combines multitask pretraining and instruction fine-tuning solely on T2M task, yields better performance than Trained single task that only trains the model on T2M task. Tab. 4 presents the results of testing on the Ascend 910B NPUs, where $\\mathrm{\\bfM^{3}G P T}$ also achieves comparably good performance. These results demonstrate that multitask pre-training can enhance the performance of individual tasks across different computation platforms. Further results of $\\mathrm{{M^{3}G P T}}$ trained on NPUs will be presented later. ", "page_idx": 7}, {"type": "table", "img_path": "ODbTlAs0Oj/tmp/35685341643b3585490537e2d03098b28fac92a43c5f10f83499d73172a1a9db.jpg", "table_caption": ["Table 3: Comparison results on Motion-X [29] dataset. The evaluation metrics are computed using the encoder introduced in Appendix A. Empty columns of previous methods indicate that they can not handle the task. Instruction-tuned only T2M indicates the model that is initially pre-trained on multiple tasks, followed by instruction tuning solely on text-to-motion task. "], "table_footnote": [], "page_idx": 8}, {"type": "table", "img_path": "ODbTlAs0Oj/tmp/313fba2746a13ec24e7eed00aa8aa40a3cfd72ef89e6aa13cede6a8641ed340f.jpg", "table_caption": ["Table 4: Comparison results on Motion-X [29] dataset based on Ascend 910B NPUs. "], "table_footnote": [], "page_idx": 8}, {"type": "table", "img_path": "ODbTlAs0Oj/tmp/bb40c4c63168f6981860fc76ba4371f7a1977d946f224c838628fd311bdef87b.jpg", "table_caption": [], "table_footnote": [], "page_idx": 8}, {"type": "table", "img_path": "ODbTlAs0Oj/tmp/69df8fb521aaf85788910aeec47e71ded60fd04c142fc0b777e166cf6ede960d.jpg", "table_caption": ["Table 6: Comparison results on $\\mathrm{AIST++}$ [24] and FineDance [25] datasets based on Ascend 910B NPUs. "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "", "page_idx": 8}, {"type": "text", "text": "Main results on music-to-dance datasets. On the music-to-dance datasets, $\\mathrm{AIST++}$ and FineDance, we evaluate $\\mathrm{M^{3}G P T}$ on 2 tasks, i.e., music-to-dance and dance-to-music. As shown in Tab. 5, in general, the performance of multitask pre-training and instruction fine-tuning in $\\mathrm{M^{3}G P T}$ outperforms single-task training, underscoring the effectiveness of multitask training for dance-relevant tasks. Also, $\\mathrm{M^{3}G P T}$ achieves competitive performance on most metrics. For music-to-dance, the best-performing method on the FineDance dataset is Lodge [26]. This approach features a specialized two-stage architecture for generating long-duration dance sequences, progressively refining movements from coarse to fine granularity using a diffusion model. On $\\mathrm{AIST++}$ dataset, $\\mathrm{M^{3}G P T}$ reports the best $\\mathrm{FID}_{k}$ of 24.34 for music-to-dance task, the best BHS and F1 of 94.0 and 94.9 for dance-to-music task. The results in Tab. 6, tested on the Ascend 910B NPUs, also demonstrate that multitask training can enhance the performance of both music-to-dance and dance-to-music tasks. ", "page_idx": 8}, {"type": "image", "img_path": "ODbTlAs0Oj/tmp/e0a4116fbca9ae3a90eaf58199e58287ec7da400d76c696929857764fcb87f6b.jpg", "img_caption": ["Figure 3: Qualitative results for long-term dance and music-text conditioned dance generation of $\\mathrm{\\bfM^{3}G P T}$ . "], "img_footnote": [], "page_idx": 9}, {"type": "text", "text": "", "page_idx": 9}, {"type": "text", "text": "4.4 Evaluation on Zero-Shot Tasks ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "In this section, we explore $\\mathbf{M}^{3}$ GPT’s capabilities in handling zero-shot tasks, as mentioned in Sec. 3.4. Fig. 3 (a) shows the long-term dance generation. As seen, $\\mathbf{M}^{3}\\mathbf{GPT}$ can generate a coherent dance sequence by seamlessly integrating the music-to-dance and zero-shot music $^{\\cdot+}$ dance-to-dance tasks. Fig. 3 (b) shows the generated 3D dance with both music and text instruction. We can see that $\\mathrm{M^{3}G P T}$ maintains plausible visual results in accordance with input text instructions (cartweel), underscoring its remarkable zero-shot generalization capability. ", "page_idx": 9}, {"type": "text", "text": "5 Conclusion ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "In this paper, we present $\\mathrm{{M^{3}G P T}}$ , a unified framework for comprehending and generating motion aligned with both text and music modalities. By employing text as a bridge, we build connections and synergies between different motion-relevant tasks, facilitating mutual reinforcement. Additionally, the joint optimization of LLM and motion de-tokenizer further enriches the details of generated motion, enhancing overall motion generation quality. Our extensive evaluations across various motion-relevant tasks demonstrate the effectiveness of $\\mathrm{{M^{3}G P T}}$ in both motion comprehension and generation. Besides, $\\mathrm{{M^{3}G P T}}$ exhibits strong zero-shot generalization abilities, enabling it to handle previously unseen and challenging motion-relevant tasks. ", "page_idx": 9}, {"type": "text", "text": "Limitations and Broader Impacts. Although our $\\mathrm{\\bfM^{3}G P T}$ has successfully processed signals from motion, text, and music modalities for motion comprehension and generation, it focuses on modeling human body movements, excluding hands and faces details. Future research can extend the scope of $\\mathrm{{M^{3}G P T}}$ to include hands and facial modeling. ", "page_idx": 9}, {"type": "text", "text": "Acknowledgments. This work is sponsored by the National Natural Science Foundation of China (NSFC) under Grant 62306301, the National Postdoctoral Program for Innovative Talents under Grant BX20220310, and the CAAI-CANN Open Fund developed on the OpenI Community. It is also supported by the project of Peng Cheng Laboratory (PCL2023A08). ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "[1] Judith Butepage, Michael J Black, Danica Kragic, and Hedvig Kjellstrom. Deep representation learning for human motion prediction and classification. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 6158–6166, 2017.   \n[2] Ke Chen, Yusong Wu, Haohe Liu, Marianna Nezhurina, Taylor Berg-Kirkpatrick, and Shlomo Dubnov. Musicldm: Enhancing novelty in text-to-music generation using beat-synchronous mixup strategies. In ICASSP 2024-2024 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), pages 1206–1210. IEEE, 2024.   \n[3] Ling-Hao Chen, Jiawei Zhang, Yewen Li, Yiren Pang, Xiaobo Xia, and Tongliang Liu. Humanmac: Masked motion completion for human motion prediction. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 9544–9555, 2023.   \n[4] Ting Chen, Saurabh Saxena, Lala Li, Tsung-Yi Lin, David J Fleet, and Geoffrey E Hinton. A unified sequence interface for vision tasks. Advances in Neural Information Processing Systems, 35:31333–31346, 2022.   \n[5] Xin Chen, Biao Jiang, Wen Liu, Zilong Huang, Bin Fu, Tao Chen, and Gang Yu. Executing your commands via motion diffusion in latent space. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 18000–18010, 2023.   \n[6] Wei-Lin Chiang, Zhuohan Li, Zi Lin, Ying Sheng, Zhanghao Wu, Hao Zhang, Lianmin Zheng, Siyuan Zhuang, Yonghao Zhuang, Joseph E Gonzalez, et al. Vicuna: An open-source chatbot impressing gpt-4 with $90\\%*$ chatgpt quality, march 2023. URL https://lmsys. org/blog/2023-03-30-vicuna, 3(5), 2023.   \n[7] Hyung Won Chung, Le Hou, Shayne Longpre, Barret Zoph, Yi Tay, William Fedus, Yunxuan Li, Xuezhi Wang, Mostafa Dehghani, Siddhartha Brahma, et al. Scaling instruction-finetuned language models. Journal of Machine Learning Research, 25(70):1–53, 2024.   \n[8] Wenxun Dai, Ling-Hao Chen, Jingbo Wang, Jinpeng Liu, Bo Dai, and Yansong Tang. Motionlcm: Realtime controllable motion generation via latent consistency model. arXiv preprint arXiv:2404.19759, 2024.   \n[9] Prafulla Dhariwal, Heewoo Jun, Christine Payne, Jong Wook Kim, Alec Radford, and Ilya Sutskever. Jukebox: A generative model for music. arXiv preprint arXiv:2005.00341, 2020.   \n[10] Shangzhe Di, Zeren Jiang, Si Liu, Zhaokai Wang, Leyan Zhu, Zexin He, Hongming Liu, and Shuicheng Yan. Video background music generation with controllable music transformer. In Proceedings of the 29th ACM International Conference on Multimedia, pages 2037–2045, 2021.   \n[11] Chuang Gan, Deng Huang, Peihao Chen, Joshua B Tenenbaum, and Antonio Torralba. Foley music: Learning to generate music from videos. In Computer Vision–ECCV 2020: 16th European Conference, Glasgow, UK, August 23–28, 2020, Proceedings, Part XI 16, pages 758–775. Springer, 2020.   \n[12] Kehong Gong, Dongze Lian, Heng Chang, Chuan Guo, Zihang Jiang, Xinxin Zuo, Michael Bi Mi, and Xinchao Wang. Tm2d: Bimodality driven 3d dance generation via music-text integration. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 9942–9952, 2023.   \n[13] Chuan Guo, Shihao Zou, Xinxin Zuo, Sen Wang, Wei Ji, Xingyu Li, and Li Cheng. Generating diverse and natural 3d human motions from text. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), pages 5152–5161, 2022.   \n[14] Chuan Guo, Shihao Zou, Xinxin Zuo, Sen Wang, Wei Ji, Xingyu Li, and Li Cheng. Generating diverse and natural 3d human motions from text. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 5152–5161, 2022.   \n[15] Chuan Guo, Xinxin Zuo, Sen Wang, and Li Cheng. Tm2t: Stochastic and tokenized modeling for the reciprocal generation of 3d human motions and texts. In European Conference on Computer Vision, pages 580–597. Springer, 2022.   \n[16] Chuan Guo, Yuxuan Mu, Muhammad Gohar Javed, Sen Wang, and Li Cheng. Momask: Generative masked modeling of 3d human motions. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 1900–1910, 2024.   \n[17] Hao Guo, Xiaochuan Fan, and Song Wang. Visual attention consistency for human attribute recognition. International Journal of Computer Vision, 130(4):1088–1106, 2022.   \n[18] Bo Han, Yi Ren, and Yuheng Li. Dance2midi: Dance-driven multi-instruments music generation. arXiv preprint arXiv:2301.09080, 2:3, 2023.   \n[19] Ruibing Hou, Bingpeng Ma, Hong Chang, Xinqian Gu, Shiguang Shan, and Xilin Chen. Feature completion for occluded person re-identification. IEEE Transactions on Pattern Analysis and Machine Intelligence, 44 (9):4894–4912, 2021.   \n[20] Ruozi Huang, Huang Hu, Wei Wu, Kei Sawada, Mi Zhang, and Daxin Jiang. Dance revolution: Long-term dance generation with music via curriculum learning. arXiv preprint arXiv:2006.06119, 2020.   \n[21] Biao Jiang, Xin Chen, Wen Liu, Jingyi Yu, Gang Yu, and Tao Chen. Motiongpt: Human motion as a foreign language. Advances in Neural Information Processing Systems, 36, 2024.   \n[22] and Jessica K Hodgins Kensuke Onuma, Christos Faloutsos. Fmdistance: A fast and effective distance function for motion capture data. In Eurographics, pages 83–86, 2008.   \n[23] Peike Li, Yunqiu Xu, Yunchao Wei, and Yi Yang. Self-correction for human parsing. IEEE Transactions on Pattern Analysis and Machine Intelligence, 44(6):3260–3271, 2020.   \n[24] Ruilong Li, Shan Yang, David A Ross, and Angjoo Kanazawa. Ai choreographer: Music conditioned 3d dance generation with aist++. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 13401–13412, 2021.   \n[25] Ronghui Li, Junfan Zhao, Yachao Zhang, Mingyang Su, Zeping Ren, Han Zhang, Yansong Tang, and Xiu Li. Finedance: A fine-grained choreography dataset for 3d full body dance generation. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 10234–10243, 2023.   \n[26] Ronghui Li, YuXiang Zhang, Yachao Zhang, Hongwen Zhang, Jie Guo, Yan Zhang, Yebin Liu, and Xiu Li. Lodge: A coarse to fine diffusion network for long dance generation guided by the characteristic dance primitives. arXiv preprint arXiv:2403.10518, 2024.   \n[27] Sifei Li, Weiming Dong, Yuxin Zhang, Fan Tang, Chongyang Ma, Oliver Deussen, Tong-Yee Lee, and Changsheng Xu. Dance-to-music generation with encoder-based textual inversion of diffusion models. arXiv preprint arXiv:2401.17800, 2024.   \n[28] Chin-Yew Lin. Rouge: A package for automatic evaluation of summaries. In Text summarization branches out, pages 74–81, 2004.   \n[29] Jing Lin, Ailing Zeng, Shunlin Lu, Yuanhao Cai, Ruimao Zhang, Haoqian Wang, and Lei Zhang. Motion-x: A large-scale 3d expressive whole-body human motion dataset. Advances in Neural Information Processing Systems, 2023.   \n[30] Matthew Loper, Naureen Mahmood, Javier Romero, Gerard Pons-Moll, and Michael J Black. Smpl: A skinned multi-person linear model. In Seminal Graphics Papers: Pushing the Boundaries, Volume 2, pages 851–866. 2023.   \n[31] Julieta Martinez, Michael J Black, and Javier Romero. On human motion prediction using recurrent neural networks. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 2891–2900, 2017.   \n[32] Brian McFee, Colin Raffel, Dawen Liang, Daniel PW Ellis, Matt McVicar, Eric Battenberg, and Oriol Nieto. librosa: Audio and music signal analysis in python. In SciPy, pages 18–24, 2015.   \n[33] Meinard Müller, Tido Röder, and Michael Clausen. Efficient content-based retrieval of motion capture data. In ACM SIGGRAPH, pages 677–685. 2005.   \n[34] Boris N Oreshkin, Antonios Valkanas, Félix G Harvey, Louis-Simon Ménard, Florent Bocquelet, and Mark J Coates. Motion in-betweening via deep delta-interpolator. IEEE Transactions on Visualization and Computer Graphics, 2023.   \n[35] Kishore Papineni, Salim Roukos, Todd Ward, and Wei-Jing Zhu. Bleu: a method for automatic evaluation of machine translation. In Proceedings of the 40th annual meeting of the Association for Computational Linguistics, pages 311–318, 2002.   \n[36] Georgios Pavlakos, Vasileios Choutas, Nima Ghorbani, Timo Bolkart, Ahmed AA Osman, Dimitrios Tzionas, and Michael J Black. Expressive body capture: 3d hands, face, and body from a single image. In Proceedings of the IEEE/CVF conference on computer vision and pattern recognition, pages 10975–10985, 2019.   \n[37] Matthias Plappert, Christian Mandery, and Tamim Asfour. Learning a bidirectional mapping between human whole-body motion and natural language using deep recurrent neural networks. Robotics and Autonomous Systems, 109:13–26, 2018.   \n[38] Alec Radford, Jong Wook Kim, Chris Hallacy, Aditya Ramesh, Gabriel Goh, Sandhini Agarwal, Girish Sastry, Amanda Askell, Pamela Mishkin, Jack Clark, et al. Learning transferable visual models from natural language supervision. In International conference on machine learning, pages 8748–8763. PMLR, 2021.   \n[39] Colin Raffel, Noam Shazeer, Adam Roberts, Katherine Lee, Sharan Narang, Michael Matena, Yanqi Zhou, Wei Li, and Peter J Liu. Exploring the limits of transfer learning with a unified text-to-text transformer. Journal of machine learning research, 21(140):1–67, 2020.   \n[40] Mikel Rodriguez, Ivan Laptev, Josef Sivic, and Jean-Yves Audibert. Density-aware person detection and tracking in crowds. In 2011 International Conference on Computer Vision, pages 2423–2430. IEEE, 2011.   \n[41] Javier Romero, Dimitrios Tzionas, and Michael J Black. Embodied hands: Modeling and capturing hands and bodies together. arXiv preprint arXiv:2201.02610, 2022.   \n[42] Li Siyao, Weijiang Yu, Tianpei Gu, Chunze Lin, Quan Wang, Chen Qian, Chen Change Loy, and Ziwei Liu. Bailando: 3d dance generation by actor-critic gpt with choreographic memory. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 11050–11059, 2022.   \n[43] Paul Starke, Sebastian Starke, Taku Komura, and Frank Steinicke. Motion in-betweening with phase manifolds. Proceedings of the ACM on Computer Graphics and Interactive Techniques, 6(3):1–17, 2023.   \n[44] Guy Tevet, Sigal Raab, Brian Gordon, Yoni Shafir, Daniel Cohen-or, and Amit Haim Bermano. Human motion diffusion model. In The Eleventh International Conference on Learning Representations, 2022.   \n[45] Alexander Toshev and Christian Szegedy. Deeppose: Human pose estimation via deep neural networks. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 1653–1660, 2014.   \n[46] Hugo Touvron, Thibaut Lavril, Gautier Izacard, Xavier Martinet, Marie-Anne Lachaux, Timothée Lacroix, Baptiste Rozière, Naman Goyal, Eric Hambro, Faisal Azhar, et al. Llama: Open and efficient foundation language models. arXiv preprint arXiv:2302.13971, 2023.   \n[47] Hugo Touvron, Louis Martin, Kevin Stone, Peter Albert, Amjad Almahairi, Yasmine Babaei, Nikolay Bashlykov, Soumya Batra, Prajjwal Bhargava, Shruti Bhosale, et al. Llama 2: Open foundation and fine-tuned chat models. arXiv preprint arXiv:2307.09288, 2023.   \n[48] Jonathan Tseng, Rodrigo Castellon, and Karen Liu. Edge: Editable dance generation from music. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 448–458, 2023.   \n[49] Ramakrishna Vedantam, C Lawrence Zitnick, and Devi Parikh. Cider: Consensus-based image description evaluation. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 4566–4575, 2015.   \n[50] Shengqiong Wu, Hao Fei, Leigang Qu, Wei Ji, and Tat-Seng Chua. Next-gpt: Any-to-any multimodal llm. arXiv preprint arXiv:2309.05519, 2023.   \n[51] Tatsuro Yamada, Hiroyuki Matsunaga, and Tetsuya Ogata. Paired recurrent autoencoders for bidirectional translation between robot actions and linguistic descriptions. IEEE Robotics and Automation Letters, 3(4): 3441–3448, 2018.   \n[52] Jiashuo Yu, Yaohui Wang, Xinyuan Chen, Xiao Sun, and Yu Qiao. Long-term rhythmic video soundtracker. In International Conference on Machine Learning, pages 40339–40353. PMLR, 2023.   \n[53] Jun Zhan, Junqi Dai, Jiasheng Ye, Yunhua Zhou, Dong Zhang, Zhigeng Liu, Xin Zhang, Ruibin Yuan, Ge Zhang, Linyang Li, et al. Anygpt: Unified multimodal llm with discrete sequence modeling. arXiv preprint arXiv:2402.12226, 2024.   \n[54] Dong Zhang, Shimin Li, Xin Zhang, Jun Zhan, Pengyu Wang, Yaqian Zhou, and Xipeng Qiu. Speechgpt: Empowering large language models with intrinsic cross-modal conversational abilities. arXiv preprint arXiv:2305.11000, 2023.   \n[55] Jianrong Zhang, Yangsong Zhang, Xiaodong Cun, Shaoli Huang, Yong Zhang, Hongwei Zhao, Hongtao Lu, and Xi Shen. T2m-gpt: Generating human motion from textual descriptions with discrete representations. arXiv preprint arXiv:2301.06052, 2023.   \n[56] Jianrong Zhang, Yangsong Zhang, Xiaodong Cun, Yong Zhang, Hongwei Zhao, Hongtao Lu, Xi Shen, and Ying Shan. Generating human motion from textual descriptions with discrete representations. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 14730– 14740, 2023.   \n[57] Mingyuan Zhang, Zhongang Cai, Liang Pan, Fangzhou Hong, Xinying Guo, Lei Yang, and Ziwei Liu. Motiondiffuse: Text-driven human motion generation with diffusion model. IEEE Transactions on Pattern Analysis and Machine Intelligence, 2024.   \n[58] Mingyuan Zhang, Daisheng Jin, Chenyang Gu, Fangzhou Hong, Zhongang Cai, Jingfang Huang, Chongzhi Zhang, Xinying Guo, Lei Yang, Ying He, et al. Large motion model for unified multi-modal motion generation. arXiv preprint arXiv:2404.01284, 2024.   \n[59] Yan Zhang, Michael J Black, and Siyu Tang. We are more than our joints: Predicting how 3d bodies move. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 3372–3382, 2021.   \n[60] Yaqi Zhang, Di Huang, Bin Liu, Shixiang Tang, Yan Lu, Lu Chen, Lei Bai, Qi Chu, Nenghai Yu, and Wanli Ouyang. Motiongpt: Finetuned llms are general-purpose motion generators. In Proceedings of the AAAI Conference on Artificial Intelligence, pages 7368–7376, 2024.   \n[61] Jiahe Zhao, Ruibing Hou, Hong Chang, Xinqian Gu, Bingpeng Ma, Shiguang Shan, and Xilin Chen. Clothes-changing person re-identification with feasibility-aware intermediary matching. arXiv preprint arXiv:2404.09507, 2024.   \n[62] Zixiang Zhou and Baoyuan Wang. Ude: A unified driving engine for human motion generation. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 5632–5641, 2023.   \n[63] Zixiang Zhou, Yu Wan, and Baoyuan Wang. A unified framework for multimodal, multi-part human motion synthesis. arXiv preprint arXiv:2311.16471, 2023.   \n[64] Ye Zhu, Kyle Olszewski, Yu Wu, Panos Achlioptas, Menglei Chai, Yan Yan, and Sergey Tulyakov. Quantized gan for complex music generation from dance videos. In European Conference on Computer Vision, pages 182–199. Springer, 2022.   \n[65] Ye Zhu, Yu Wu, Kyle Olszewski, Jian Ren, Sergey Tulyakov, and Yan Yan. Discrete contrastive diffusion for cross-modal music and image generation. arXiv preprint arXiv:2206.07771, 2022. ", "page_idx": 9}, {"type": "text", "text": "", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "", "page_idx": 13}, {"type": "text", "text": "Appendix ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "A Text-Motion Alignment Model ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Due to the lack of a powerful and publicly available text-motion alignment model, we independently leverage existing datasets to develop a functional text-motion alignment model, which is used to evaluate tasks such as text-to-motion, motion-to-text, motion prediction, and motion in-between. We adopt the motion encoder architecture $E_{m}$ from [14] and use the pretrained CLIP [38] ViT-B/32 model for the text encoder $E_{t}$ . As depicted in Fig. 4, the training of the text-motion alignment model is split into two phases: pre-training the motion auto-encoder and text-motion contrastive learning. During the pre-training phase, we use motion data from the text-to-motion, and dance data from the music-to-dance tasks. This stage employs a reconstruction loss to ensure the model achieves a robust initial state capable of extracting an expressive motion representation. In the text-motion contrastive learning phase, we utilize text-motion pair data from the text-to-motion task. We incorporate an adapter MLP layer into both the motion and text encoders to align the dimensions of ${\\bf z}_{m}$ and $\\mathbf{z}_{t}$ at 512. This setup facilitates the alignment of text and motion in the representational space. The motion reconstruction loss $\\bar{L}_{\\mathrm{recon\\_motion}}$ for the pre-training stage and the contrastive learning loss $L_{\\mathrm{infoNCE}}$ for the aligning stage are used to optimize this model, as follows, ", "page_idx": 14}, {"type": "image", "img_path": "ODbTlAs0Oj/tmp/2abebe0ce335163fb768901514868d65d1d88a638cb6946665eac45032b2bc56.jpg", "img_caption": ["Figure 4: Pipeline of Text-Motion Alignment Model. The training of the text-motion alignment model includes two stages: pre-training motion auto-encoder and text-motion contrastive learning. "], "img_footnote": [], "page_idx": 14}, {"type": "text", "text": "B Details for Training and Evaluating ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "B.1 Data Introductions and Preprocessing ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "We leverage the largest available text-to-motion dataset, Motion-X [29], along with widely-used music-todance datasets, $\\mathrm{AIST++}$ [24] and FineDance [25], for our multitask training regimen. Motion- $.\\mathrm{\\DeltaX}$ is used for text-to-motion, motion-to-text, motion prediction, and motion in-between tasks, while $\\mathrm{AIST++}$ and FineDance datasets support both music-to-dance and dance-to-music tasks, and are also adapted for motion prediction and in-between tasks to enhance our training resources. ", "page_idx": 14}, {"type": "text", "text": "Motion-X includes 15.6 million precise 3D whole-body SMPL-X [36] pose annotations across 81.1K motion sequences with sequence-level semantic text descriptions. $\\mathrm{AIST++}$ contains 1,409 dance motion sequences across 10 dance genres with SMPL [30] pose annotations, and FineDance provides 7.7 hours of dance, totaling 831,600 frames with SMPL-H [41] poses at 30 fps across 16 dance genres. Tab. 7 shows the training datasets and their corresponding sample numbers that we use to train our model. ", "page_idx": 14}, {"type": "text", "text": "We standardize data across these datasets by selecting the 22 common joints and normalizing each motion sequence to face the same direction and to run at 30 fps. We use a processing technique consistent with prior research [14, 5, 21] that integrates joint velocities, positions, and rotations for consistent motion representation, facilitating effective utilization across tasks. For the music data, we use the Librosa toolkit [32] to load raw .wav data at a sampling rate of $22050\\ \\mathrm{Hz}$ , processed into features by the Jukebox encoder [9]. To optimize the use of these datasets, we strategically employ data from specific datasets for different tasks. During training for music and dance tasks, we randomly select 5-second segments from complete music tracks and corresponding dance segments as training samples, setting the sample length to 6.25 seconds for motion prediction and in-between tasks with $\\mathrm{AIST++}$ and FineDance. When assessing music-to-dance on the FineDance dataset, we don’t evaluate all 5-second samples directly. Instead, we generate continuous long dance sequences using music-to-dance and motion prediction, then segment these into 30-second samples for evaluation to align with Lodge’s testing methodology. ", "page_idx": 14}, {"type": "text", "text": "", "page_idx": 15}, {"type": "table", "img_path": "ODbTlAs0Oj/tmp/f8cd75ff29b0b1f4435d1772b998aa21f6f8c289f78ac7721ec1abf070a0f271.jpg", "table_caption": ["Table 7: The training datasets and sample numbers for different tasks. "], "table_footnote": [], "page_idx": 15}, {"type": "text", "text": "B.2 Comprehensive Evaluation Metrics ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "Different tasks utilize specific evaluation metrics. We use the consistent evaluation metrics following prior research [14, 21, 12, 26, 64, 52]. ", "page_idx": 15}, {"type": "text", "text": "• Text-to-Motion. We measure the discrepancy between generated and actual motion features using Frechet Inception Distance (FID), assess diversity (Div) among all generated motion sequences, and evaluate motion-text semantic correlation with R-precision. Multimodal Distance (MM Dist) quantifies the disparity between motions and texts. A specialized model developed for evaluating the text-to-motion task on the Motion-X dataset with 22 joints is detailed in Appendix A.   \n• Motion-to-Text. We use linguistic metrics including BLEU [35], ROUGE [28], CIDEr [49], and BertScore [59], along with R-Precision and MM Dist to assess alignment between generated text and motion.   \n• Music-to-Dance. We employ the evaluation framework recommended by FACT [24] and Bailando [42], utilizing FID, Diversity, and Beat Align Score (BAS) to gauge dance quality. In our paper, we use kinetic features to compute FID and Diversity.   \n• Dance-to-Music. We use metrics from [52, 64] such as Beats Coverage Scores (BCS), Beats Hit Scores (BHS), F1 scores, Beats Coverage Std (CSD), and Beats Hit Std (HSD) to evaluate music generation quality.   \n• Motion Prediction and Motion In-between. We use Average Displacement Error (ADE) and Final Displacement Error (FDE) to assess the quality of predicted motion. The text-motion alignment model aids in evaluating motion prediction performance. ", "page_idx": 15}, {"type": "text", "text": "B.3 Distributed Training for Multitasks ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "We employ a single-node multi-GPU distributed training strategy for $\\mathbf{M}^{3}\\mathbf{GPT},$ distributing each task across separate GPUs to facilitate multitask training through shared model parameters. This method allows us to tailor the maximum token length of the LLM for each task, based on the longest sample sequence typical for that task. Specifically, we set the maximum LLM token length to 192 for tasks such as text-to-motion, motion-to-text, motion prediction, and motion in-between. For tasks involving the music modality, such as music-to-dance and dance-to-music, the maximum length is set at 980. This task-specific configuration enables us to optimize batch sizes effectively, thus maximizing GPU utilization. ", "page_idx": 15}, {"type": "text", "text": "In our experimental setup, the batch size is set to 40 for the text-to-motion, text-to-dance, and motion-to-text tasks, and 4 for the music-to-dance, dance-to-music, and music-to-text tasks. For motion prediction and motion in-between tasks, the batch size is set to 45. We also establish the number of iterations for pre-training at 1,000,000, instruction fine-tuning at 200,000. This structured approach ensures that each task is optimally processed, enhancing the efficiency and effectiveness of our training regimen. ", "page_idx": 15}, {"type": "text", "text": "B.4 Tasks for Pre-training and Instruction tuning ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "As shown in Fig. 5, we define 11 core motion-related tasks for the instruction tuning of $\\mathbf{M}^{3}\\mathbf{GPT}$ , including text-to-motion, random-to-motion, motion-to-text, random-to-text, motion prediction, motion in-between, musicto-dance, dance-to-music, random-to-music, text-to-dance, and music-to-text. The tasks of text-to-dance and music-to-text were specifically constructed based on the music-to-dance datasets. Random-to- $\\mathbf{\\nabla}X$ represents the unconstrained generation of motion, text and music. In Tab. 8, we present a selection of command templates for each task, where <Motion_Placeholder>, <Caption_Placeholder>, and <Music_Placeholder> respectively represent the motion sequence (including dance sequence), textual description, and music segment from the training data. ", "page_idx": 15}, {"type": "text", "text": "C Quantitative Results and Comparisons with SOTA Methods ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "In this section, we compare the performance of our $\\mathrm{\\bfM^{3}G P T}$ with existing SOTA methods on a broader set of metrics for each task across three datasets: Motion-X [29], AIST $^{++}$ [24], and FineDance [25]. Tab. 9 shows the comparison of text-to-motion on Motion-X dataset. Tab. 10 shows the comparison of motion-to-text on Motion-X dataset. Tab. 11 shows the comparison of music-to-dance on $\\mathrm{AIST++}$ and FineDance datasets. Tab. 12 shows the comparison of dance-to-music on $\\mathrm{AIST++}$ and FineDance datasets. Tab. 13 and Tab. 14 shows the comparison of motion prediction and motion in-between on Motion-X dataset. Tab. 15 shows the comparison of music-to-text, text-to-dance and text-to-music on $\\mathrm{AIST++}$ dataset. Tab. 16 and Tab. 17 show the comparison of motion-related tasks among different size of T5. As shown in these tables, $\\mathrm{\\bfM^{3}G P T}$ can achieve competitive performance with SOTAs across all evaluated tasks. ", "page_idx": 15}, {"type": "image", "img_path": "ODbTlAs0Oj/tmp/726fbc55a61d658a98fff902feca7944caffbec8692bcc4166e5cf8b16956cc9.jpg", "img_caption": ["Figure 5: Tasks for $\\mathrm{M}^{3}\\mathrm{GPT}$ pre-training and instruction tuning. Random represents the unconstrained generation of motion/text/music in the corresponding task. "], "img_footnote": [], "page_idx": 16}, {"type": "table", "img_path": "ODbTlAs0Oj/tmp/2209ac2746057b9a452e46112c1cd681cfe9bb9b51e61214741dadf6e662c979.jpg", "table_caption": ["Table 8: Examples of instruction templates for each task when instruction tuning $\\mathrm{M}^{3}\\mathrm{GPT}$ "], "table_footnote": [], "page_idx": 16}, {"type": "text", "text": "", "page_idx": 16}, {"type": "text", "text": "D Qualitative Results and Comparison with SOTA Methods ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Fig. 6 presents visualizations for a variety of tasks, including text-to-motion, motion-to-text, motion prediction, motion in-between, music-to-dance, long-term dance generation, and music-text conditioned dance generation. The visualization results show that our method can generate realistic results across various motion-relevant tasks. Fig. 7 presents the qualitative results between different methods for text-to-motion and music-to-dance. ", "page_idx": 16}, {"type": "text", "text": "E Additional Experiments ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "The performance of text-to-motion based on different $\\lambda$ . In Tab. 18, the performance of $\\mathrm{M^{3}G P T}$ on Motion-X dataset is analyzed across different values of $\\lambda$ for the text-to-motion task. The results indicate that as $\\lambda$ increases, the model’s recall precision (Top1, Top2, Top3) initially improves but subsequently declines. The optimal performance is achieved at $\\lambda=0.2$ , as evidenced by the highest scores in RPrecision and modality metrics. ", "page_idx": 16}, {"type": "text", "text": "Further increases in $\\lambda$ to 0.3 and 0.4 lead to deteriorating performance, particularly in FID and RPrecision, suggesting that excessive $\\lambda$ values may result in over-regularization or reduced adaptability of the model. ", "page_idx": 17}, {"type": "table", "img_path": "ODbTlAs0Oj/tmp/d33f26190885fd3be82942f48ef0c5fe4afa6f48306902d47dd75cf8e8235105.jpg", "table_caption": ["Table 9: Comparison of Text-to-Motion on Motion-X dataset [29]. The arrows (↑) indicate that higher values are better. The arrows $\\left(\\downarrow\\right)$ indicate that smaller values are better. Bold and underline indicate the best and the second best result. "], "table_footnote": [], "page_idx": 17}, {"type": "table", "img_path": "ODbTlAs0Oj/tmp/109953340aa9ae5728599d23d8952785950f8391b3f801a2cc38df3d684ced44.jpg", "table_caption": ["Table 10: Comparison of Motion-to-Text on Motion-X [29]. "], "table_footnote": [], "page_idx": 17}, {"type": "table", "img_path": "ODbTlAs0Oj/tmp/258c8fed42afb3b20f6cc392c6143f203e62e39101fc75328d453d914be1f760.jpg", "table_caption": ["Table 11: Comparison of Music-to-Dance on $\\mathrm{AIST++}$ [24] and FineDance [25]. "], "table_footnote": [], "page_idx": 17}, {"type": "table", "img_path": "ODbTlAs0Oj/tmp/8494f0c3a6e87a27ed1a95467420aaa87244e2bc856fff3bd45abeb4eb1a1db0.jpg", "table_caption": ["Table 12: Comparison of Dance-to-Music on AIST $^{++}$ [24] and FineDance [25]. "], "table_footnote": [], "page_idx": 17}, {"type": "table", "img_path": "ODbTlAs0Oj/tmp/1a3d0d682a55d247f198f9aaa86cc9e4f4215c809444ca9e9138195cc1f2e2ae.jpg", "table_caption": ["Table 13: Comparison of Motion Prediction and Motion In-between on Motion-X [29]. "], "table_footnote": [], "page_idx": 18}, {"type": "table", "img_path": "ODbTlAs0Oj/tmp/c76340e02ade7c06ef2362713f1b2b20a6e5948b397296e6bae91224e3b91880.jpg", "table_caption": ["Table 18: Hyper-parameter analysis of $\\lambda$ . Comparison of Text-to-Motion on Motion-X [29] with different values of $\\lambda$ . For this ablation study, $\\dot{\\mathbf{M}}^{3}\\mathbf{GPT}$ is trained solely on the text-to-motion task to examine the impact of $\\lambda$ . This study is conducted during the pre-training stage. "], "table_footnote": [], "page_idx": 18}, {"type": "image", "img_path": "ODbTlAs0Oj/tmp/cde2c2f1aba1c708dc8976b063527a1a2df084ba9d8cb29cfd1183d3e5488d69.jpg", "img_caption": ["Figure 6: The qualitative results for different motion comprehension and generation tasks. "], "img_footnote": [], "page_idx": 19}, {"type": "image", "img_path": "ODbTlAs0Oj/tmp/9c98bb6c4eec73778bcdd38d489313d0001d74884f7967c1e2065d01453cca25.jpg", "img_caption": ["(b) Qualitative comparison on music-to-dance task. "], "img_footnote": [], "page_idx": 20}, {"type": "text", "text": "Figure 7: Qualitative comparisons for text-to-motion task and music-to-dance task. (a) refers to the qualitative comparison between Real, MDM, MoMask and M3GPT on text-to-motion task. The red words and boxes highlight the misaligned motions. The results demonstrate that our M3GPT shows good text understanding for motion generation. (b) refers to the qualitative comparison between Bailando and M3GPT on music-to-dance task. The input is an 5-second-long piece of music in the Break style. ", "page_idx": 20}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "1. Claims ", "page_idx": 21}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 21}, {"type": "text", "text": "Justification: A summary of the paper’s contributions is provided in the introduction. ", "page_idx": 21}, {"type": "text", "text": "Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 21}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 21}, {"type": "text", "text": "Justification: See Section 5 ", "page_idx": 21}, {"type": "text", "text": "Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 21}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 21}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 21}, {"type": "text", "text": "Justification: Not Applicable ", "page_idx": 21}, {"type": "text", "text": "Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and cross-referenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 21}, {"type": "text", "text": "", "page_idx": 22}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 22}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 22}, {"type": "text", "text": "Justification: See Section 4 and Appendix for implementation details. Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 22}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 22}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 22}, {"type": "text", "text": "Justification: See https://github.com/luomingshuang/M3GPT ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/public/ guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https://nips.cc/public/ guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 22}, {"type": "text", "text": "", "page_idx": 23}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: See Section 4 and Appendix for implementation details. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them.   \n• The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 23}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 23}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 23}, {"type": "text", "text": "Justification: Not Applicable. Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 23}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: See Section 4 and Appendix for implementation details. Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute. ", "page_idx": 23}, {"type": "text", "text": "• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 24}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 24}, {"type": "text", "text": "Justification: The research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 24}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Justification: See Section 5 ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed.   \n• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 24}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 24}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 24}, {"type": "text", "text": "Justification: Not Applicable. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images. ", "page_idx": 24}, {"type": "text", "text": "• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 25}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "ustification: See References.   \nGuidelines: • The answer NA means that the paper does not use existing assets. • The authors should cite the original paper that produced the code package or dataset. • The authors should state which version of the asset is used and, if possible, include a URL. • The name of the license (e.g., CC-BY 4.0) should be included for each asset. • For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided. • If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset. • For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided. • If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 25}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 25}, {"type": "text", "text": "Answer: [NA]   \nJustification: Not Applicable. Guidelines:   \n• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 25}, {"type": "text", "text": "", "page_idx": 25}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 25}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 25}, {"type": "text", "text": "Justification: Not Applicable. Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 25}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? Answer: [NA] ", "page_idx": 25}, {"type": "text", "text": "", "page_idx": 25}, {"type": "text", "text": "Justification: Not Applicable. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 26}]