[{"figure_path": "Tnl2K6Iz9j/tables/tables_4_1.jpg", "caption": "Figure 2: 95% confidence region of regret of Algorithm 1 over 10 trajectories: σε = 1 (left) and σε = 0 (right).", "description": "This figure displays the 95% confidence intervals of the regret obtained by Algorithm 1 over 10 separate trajectories.  The left panel shows results when there is supply randomness (σς = 1), while the right panel shows the results when there is no supply randomness (σς = 0). The figure visually represents the performance of the algorithm under different conditions and demonstrates the impact of supply randomness on the regret.", "section": "5 Numerical Study"}, {"figure_path": "Tnl2K6Iz9j/tables/tables_4_2.jpg", "caption": "Algorithm 2 Act Algorithm.", "description": "This algorithm calculates the optimal service fee by maximizing the expected revenue, considering the supply and demand curves.  It then adds a noise term to the optimal fee to facilitate exploration, specifically when there's no randomness in the supply. The noise's variance decreases over time. The output is the final service fee.", "section": "3 Regret Upper Bounds: Actions as Instruments"}, {"figure_path": "Tnl2K6Iz9j/tables/tables_15_1.jpg", "caption": "Algorithm 4 IV Algorithm.", "description": "This algorithm takes datasets D and A as input and performs an instrumental variable regression to estimate the parameters β0 and β1 of the demand curve.  It first regresses equilibrium quantity Qe and price Pe on the service fee at, obtaining estimates â0, â1, ˆb0, ˆb1. Then it calculates the sample means of Qe and Pe, denoted by Qe and Pe, and estimates β1 as the ratio of ˆb1 to ˆa1. Finally, it estimates β0 using the sample mean Pe, estimated β1, and sample mean Qe. The output is (βˆ0, βˆ1), the estimated parameters of the demand curve.", "section": "C Omitted Details of Algorithm Implementations"}, {"figure_path": "Tnl2K6Iz9j/tables/tables_15_2.jpg", "caption": "Figure 3: 95% confidence region of regret of Algorithm 1 over 100 trajectories: σs = 0.5, 1, 1.5, 2 (top to bottom, left to right).", "description": "This figure presents the results of simulation experiments conducted to evaluate the performance of Algorithm 1 under different levels of supply randomness (σs).  The plots show the 95% confidence intervals for the regret (difference between the actual revenue and the optimal revenue) across 100 simulation runs for four different values of σs (0.5, 1, 1.5, and 2). The x-axis represents the number of rounds, and the y-axis represents the regret. The results illustrate how the regret changes with different amounts of supply randomness.", "section": "5 Numerical Study"}, {"figure_path": "Tnl2K6Iz9j/tables/tables_33_1.jpg", "caption": "Figure 2: 95% confidence region of regret of Algorithm 1 over 10 trajectories: σs = 1 (left) and σs = 0 (right).", "description": "This figure displays the 95% confidence intervals for the regret of Algorithm 1 across 10 separate simulation runs.  The left panel shows results when there is supply randomness (σs = 1), while the right panel shows results when there is no supply randomness (σs = 0). The results illustrate the impact of supply randomness on the algorithm's performance and regret.", "section": "5 Numerical Study"}]