{"references": [{"fullname_first_author": "Nikolaos Karalias", "paper_title": "Erdos goes neural: an unsupervised learning framework for combinatorial optimization on graphs", "publication_date": "2020-12-01", "reason": "This paper introduces a novel unsupervised learning framework for combinatorial optimization problems on graphs, which is relevant to the current paper's focus on applying neural networks to real-life decision-making problems."}, {"fullname_first_author": "Richard Sinkhorn", "paper_title": "Concerning nonnegative matrices and doubly stochastic matrices", "publication_date": "1967-00-00", "reason": "This foundational paper introduces the Sinkhorn-Knopp algorithm, which is a key component in several methods for solving linear assignment problems and is used as a building block for the proposed GLinSAT algorithm."}, {"fullname_first_author": "Marco Cuturi", "paper_title": "Sinkhorn distances: Lightspeed computation of optimal transport", "publication_date": "2013-00-00", "reason": "This paper presents an efficient algorithm for computing optimal transport distances, which is relevant to the current paper's optimization problem where a similar algorithm is used for efficient projection."}, {"fullname_first_author": "Po-Wei Wang", "paper_title": "Satnet: Bridging deep learning and logical reasoning using a differentiable satisfiability solver", "publication_date": "2019-00-00", "reason": "This paper introduces SATNet, a differentiable satisfiability solver that bridges deep learning and logical reasoning, providing a related approach to constraint satisfaction in neural networks which the proposed method builds upon."}, {"fullname_first_author": "Akshay Agrawal", "paper_title": "Differentiable convex optimization layers", "publication_date": "2019-00-00", "reason": "This paper introduces differentiable convex optimization layers, which are relevant to the current paper's approach of integrating optimization solvers into neural network layers for end-to-end learning."}]}