{"importance": "This paper is crucial for researchers in dataset distillation.  It challenges the existing large-scale soft label requirement, **significantly reducing storage needs** while improving performance. This opens up new avenues for efficient large-scale dataset distillation and its application in computationally intensive tasks such as neural architecture search.", "summary": "Large-scale dataset distillation can be achieved with significantly less soft labels by using class-wise supervision during image synthesis, enabling simple random label pruning and enhancing model accuracy.", "takeaways": ["Class-wise supervision during image synthesis improves within-class diversity in condensed datasets.", "Random label pruning is effective for compressing soft labels when combined with increased image diversity.", "The proposed LPLD method significantly reduces soft label storage (40x compression in experiments) while improving model performance in large-scale dataset distillation."], "tldr": "Current large-scale dataset distillation methods suffer from excessive storage needs for auxiliary soft labels.  This is mainly due to high within-class similarity of synthesized images, resulting from batching samples across classes. This paper reveals that large-scale soft labels are not always necessary and investigates ways to reduce them.\nThis paper proposes Label Pruning for Large-scale Distillation (LPLD), addressing the issue by introducing class-wise supervision during image synthesis. By batching samples within classes, LPLD enhances within-class diversity, enabling effective soft label compression using simple random pruning.  Experimental results show significant reductions in soft label storage and performance gains, demonstrating that achieving ImageNet-level dataset condensation with minimal soft labels is feasible.", "affiliation": "Agency for Science, Technology and Research, Singapore", "categories": {"main_category": "Computer Vision", "sub_category": "Image Classification"}, "podcast_path": "12A1RT1L87/podcast.wav"}