[{"figure_path": "J709rtAUD1/figures/figures_1_1.jpg", "caption": "Figure 1: Graphical model for nonstationary causally related time-delayed time-series data generation process with unobserved domain variables ut.", "description": "This figure shows a graphical model illustrating the generation process of nonstationary time-series data.  The model incorporates time-delayed causal relationships between latent variables (z), unobserved domain variables (u) that influence transition functions (m), and observed variables (x).  The arrows represent the causal relationships. The mixing function 'g' maps the latent variables to the observed variables. The model highlights the nonstationary nature of the transitions, reflecting the varying relationships over time, influenced by the domain variables.", "section": "2 Problem Formulation"}, {"figure_path": "J709rtAUD1/figures/figures_5_1.jpg", "caption": "Figure 2: Illustration of CtrlNS with (1) Sparse Transition, (2) Prior Network, (3) Encoder-Decoder Module.", "description": "This figure illustrates the architecture of the CtrlNS framework, which consists of three main components:  The Sparse Transition module estimates the transition functions and a clustering function to identify domain shifts. The Prior Network estimates the prior distribution of latent variables, ensuring conditional independence. The Encoder-Decoder module uses reconstruction loss to ensure the invertibility of the learned mixing function. These components work together to recover both nonstationary domain variables and time-delayed latent causal dynamics.", "section": "4 The CtrINS Framework"}, {"figure_path": "J709rtAUD1/figures/figures_7_1.jpg", "caption": "Figure 3: Visualization of three-phase training process for CtrlNS.", "description": "This figure visualizes the training process of the CtrlNS model, which is divided into three phases. Phase 1 shows the initial estimations of both domain variables (ut) and latent variables (zt) are imprecise. During Phase 2, the accuracy of ut estimation improves significantly, while zt estimation remains relatively unchanged. In Phase 3, as ut becomes clearly identifiable, zt estimation accuracy improves substantially, achieving full identifiability. This three-phase behavior supports the theoretical predictions of the paper.", "section": "4 The CtrINS Framework"}, {"figure_path": "J709rtAUD1/figures/figures_8_1.jpg", "caption": "Figure 4: Two illustrative visualizations of the action segmentation task on the Hollywood dataset are presented. The colors represent the ground truth and the predicted action labels for each frame, as produced by the baseline ATBA and our proposed CtrlNS.", "description": "This figure shows two examples of action segmentation results from the Hollywood dataset. Each example shows several frames from a video along with a bar graph visualization for both ground truth and model predictions (ATBA and CtrlNS). The bar graphs represent different action classes through color-coding.  The purpose is to visually demonstrate the improvement in action segmentation accuracy achieved by the proposed CtrlNS method compared to the ATBA baseline. The differences in color-coding between the ground truth and model predictions highlight areas where the CtrlNS model provides more accurate segmentation.", "section": "5.2 Real-world Application on Weakly Supervised Action Segmentation"}, {"figure_path": "J709rtAUD1/figures/figures_16_1.jpg", "caption": "Figure 1: Graphical model for nonstationary causally related time-delayed time-series data generation process with unobserved domain variables u<sub>t</sub>.", "description": "This figure shows a graphical model representing the generative process for nonstationary, causally related, time-delayed time series data.  The model incorporates unobserved domain variables (u<sub>t</sub>) that influence the transitions between time-delayed latent components (z<sub>t</sub>). These latent components then generate the observed data (x<sub>t</sub>) through a mixing function (g). The model explicitly addresses the nonstationarity by allowing the transition functions (m) to vary depending on the domain variables.  This variation in transition functions is key to modeling the distribution shifts inherent to nonstationary data.", "section": "2 Problem Formulation"}, {"figure_path": "J709rtAUD1/figures/figures_19_1.jpg", "caption": "Figure 1: Graphical model for nonstationary causally related time-delayed time-series data generation process with unobserved domain variables ut.", "description": "This figure is a graphical model illustrating how the observed data (xt) are generated from causally related latent temporal processes (zt) that exhibit nonstationary behavior. The latent variables (zt) are influenced by their previous states (zt-1) and unobserved domain variables (ut) which represent different regimes or domains. The domain variables (ut) determine the transition functions (mt) which govern the changes in the latent variables over time. The observed data (xt) are generated by an invertible mixing function g(zt) which maps the latent variables to the observations. This model captures the time-delayed causal relationships and nonstationary transitions in the data generation process.", "section": "2 Problem Formulation"}, {"figure_path": "J709rtAUD1/figures/figures_19_2.jpg", "caption": "Figure 1: Graphical model for nonstationary causally related time-delayed time-series data generation process with unobserved domain variables ut.", "description": "This figure illustrates the graphical model used in the paper to represent the nonstationary time series generative model.  The model shows how observed variables (xt) are generated from causally related, time-delayed latent components (zt) through an invertible mixing function (g). The latent variables (zt) are generated by transition functions (m), which vary across different domains (ut), which are themselves unobserved. Each latent variable at time t has latent parents from time t-1 (zt-1) which can influence the generation of the variable. Noise terms are also included in the model (et). The figure depicts the causal relationships between these variables. ", "section": "2 Problem Formulation"}, {"figure_path": "J709rtAUD1/figures/figures_23_1.jpg", "caption": "Figure 1: Graphical model for nonstationary causally related time-delayed time-series data generation process with unobserved domain variables ut.", "description": "This figure presents a graphical model illustrating the generative process of nonstationary, causally related, time-delayed time series data.  The model incorporates unobserved domain variables (ut) influencing the transitions between time-delayed latent variables (zt). These latent variables then map to the observed variables (xt) through an invertible mixing function. The model depicts the nonstationary nature of the data generation by showing how transitions in the latent space vary across different domains.  The time delay is shown by the dependence of Zt on Zt-1.", "section": "Problem Formulation"}]