[{"figure_path": "J709rtAUD1/tables/tables_7_1.jpg", "caption": "Table 1: Experiment results of synthetic dataset on baseline models and the proposed CtrlNS. All experiments were conducted using three different random seeds to calculate the average and standard deviation. The best results are highlighted in bold.", "description": "This table presents the quantitative results of experiments conducted on synthetic datasets to evaluate the performance of the proposed CtrlNS model and compare it against several baseline methods. The metrics used are MCC (Mean Correlation Coefficient) for evaluating the identifiability of latent variables (z<sub>t</sub>) and Acc (Accuracy) for evaluating the identifiability of domain variables (u<sub>t</sub>). The results show that CtrlNS significantly outperforms all the baseline methods in terms of both MCC and Acc, indicating its superior ability in recovering both latent and domain variables in nonstationary settings.", "section": "5.1 Synthetic Experiments on Causal Representation Learning"}, {"figure_path": "J709rtAUD1/tables/tables_8_1.jpg", "caption": "Table 1: Experiment results of synthetic dataset on baseline models and the proposed CtrlNS. All experiments were conducted using three different random seeds to calculate the average and standard deviation. The best results are highlighted in bold.", "description": "This table presents the quantitative results of the proposed CtrlNS model and several baseline models on a synthetic dataset.  The results are presented in terms of the mean correlation coefficient (MCC) for latent variable recovery and clustering accuracy (Acc) for domain variable identification.  The table compares the performance of CtrlNS against these baselines, highlighting the superior performance of CtrlNS, particularly in the accuracy of both domain and latent variable identification.", "section": "5.1 Synthetic Experiments on Causal Representation Learning"}, {"figure_path": "J709rtAUD1/tables/tables_9_1.jpg", "caption": "Table 1: Experiment results of synthetic dataset on baseline models and the proposed CtrlNS. All experiments were conducted using three different random seeds to calculate the average and standard deviation. The best results are highlighted in bold.", "description": "This table presents the quantitative results of the proposed CtrlNS model and several baseline models on a synthetic dataset.  The results evaluate the identifiability of the models by comparing the estimated latent variables (MCC) and domain variables (Acc).  The CtrlNS model significantly outperforms the baselines in both metrics, demonstrating the effectiveness of its approach.", "section": "5.1 Synthetic Experiments on Causal Representation Learning"}, {"figure_path": "J709rtAUD1/tables/tables_24_1.jpg", "caption": "Table 1: Experiment results of synthetic dataset on baseline models and the proposed CtrlNS. All experiments were conducted using three different random seeds to calculate the average and standard deviation. The best results are highlighted in bold.", "description": "This table compares the performance of the proposed CtrlNS model against several baseline models on a synthetic dataset.  The metrics used are the accuracy of domain variable estimation (Ut Acc) and the mean correlation coefficient (Zt MCC) between estimated and ground truth latent variables. The results show that CtrlNS significantly outperforms the baselines in both metrics, demonstrating its effectiveness.", "section": "5.1 Synthetic Experiments on Causal Representation Learning"}]