[{"figure_path": "uXJlgkWdcI/tables/tables_7_1.jpg", "caption": "Table 1: Comparison of # parameters, training error (last epoch), and test error on three benchmarks among our PACE and various baselines. We use geo-means to report overall improvements across different benchmarks.", "description": "This table compares the performance of the proposed PACE model against various baselines on three real-world complicated photonic device benchmarks.  The metrics used for comparison include the number of parameters (#Params), training error (Train Err), and test error (Test Err). The table shows that PACE significantly outperforms existing methods in terms of lower error and fewer parameters.  Overall improvements across all benchmarks are summarized using geometric means.", "section": "5.2 Main Results"}, {"figure_path": "uXJlgkWdcI/tables/tables_7_2.jpg", "caption": "Table 2: Comparison between our two-stage model and simply scaling more layers. All models use the same Fourier modes setup.", "description": "This table compares the performance of a single 12-layer PACE model, a single 20-layer PACE model, and a two-stage PACE model (with and without cross-stage feature distillation) on two benchmarks: Etched MMI 3x3 and Etched MMI 5x5. The results show that the two-stage model outperforms the single-stage models in terms of test error and that cross-stage feature distillation further improves performance.", "section": "5.2 Main Results"}, {"figure_path": "uXJlgkWdcI/tables/tables_8_1.jpg", "caption": "Table 3: Model design ablation on Metaline dataset.", "description": "This table presents the ablation study of the proposed PACE operator on the Metaline dataset. It shows the impact of removing the self-weighted path, the projection unit, and using TFNO instead of the PACE operator on the model's performance, measured by the number of parameters, training error, and test error. The results highlight the importance of each component in achieving high accuracy.", "section": "5.3 Discussion"}, {"figure_path": "uXJlgkWdcI/tables/tables_13_1.jpg", "caption": "Table 4: Summary of etched MMI device design variable's sampling range, distribution, and unit.", "description": "This table details the ranges and distributions of various design parameters used in the generation of the etched MMI datasets.  It lists the variables (Length, Width, Port Length, Port Width, Taper Length, Taper Width, Border Width, PML Width, Wavelengths λ, Cavity Ratio, Relative Permittivity εr), their units (µm or -), and the value/distribution used in generating both the 3x3 and 5x5 etched MMI device datasets, as well as the Metaline 3x3 device dataset.  Understanding this table is key to replicating the dataset generation process and interpreting the results in the paper.  The use of uniform distributions and ranges is clearly indicated.", "section": "A.1 Dataset Generation"}, {"figure_path": "uXJlgkWdcI/tables/tables_15_1.jpg", "caption": "Table 5: Ablation on # group on an 8-layer PACE model on the Metaline dataset.", "description": "This table presents an ablation study on the impact of the number of groups (g) in the PACE operator on model performance.  It shows that varying the number of groups affects both the number of parameters and the training and testing errors.  The results suggest that a group size of 4 provides a good balance between model complexity (number of parameters) and accuracy (training and testing errors).", "section": "5.3 Discussion"}, {"figure_path": "uXJlgkWdcI/tables/tables_15_2.jpg", "caption": "Table 6: Ablation on the comparison between PACE and NeuroLight with the adopted double skip and pre-normalization.", "description": "This table compares the performance of PACE and NeuroLight models with and without double skip connections and pre-normalization. It shows that adding both techniques improves the performance of both models, especially PACE. The table shows the number of parameters, training error, and test error for each model configuration.", "section": "5.2 Main Results"}, {"figure_path": "uXJlgkWdcI/tables/tables_16_1.jpg", "caption": "Table 2: Comparison between our two-stage model and simply scaling more layers. All models use the same Fourier modes setup.", "description": "This table compares the performance of the proposed two-stage PACE model against a single PACE model with increased layers.  It shows the number of parameters, training error, and testing error for both models on two benchmark datasets (Etched MMI 3x3 and Etched MMI 5x5). The cross-stage distillation technique is also investigated to show its impact on the model's performance. The results demonstrate the effectiveness of the two-stage approach, particularly when cross-stage distillation is utilized.", "section": "5.2 Main Results"}]