[{"figure_path": "rDoPMODpki/tables/tables_5_1.jpg", "caption": "Table 1: Link Prediction Performance Comparison. Results are averaged values (of ten runs for FB15K-237/PrimeKG and of three runs for YAGO3-10) of head/tail entity predictions. \"*\" indicates the results taken from method's original paper. KG-FIT consistently outperforms both PLM-based models and structure-based base models across all datasets and metrics, demonstrating its effectiveness in incorporating open-world knowledge from LLMs for enhancing KG embeddings.", "description": "This table presents a comparison of link prediction performance across various KG embedding methods. It includes PLM-based methods (KG-BERT, StAR, PKGC, etc.) and structure-based methods (TransE, DistMult, ComplEx, etc.). The table shows the Mean Rank (MR), Mean Reciprocal Rank (MRR), and Hits@N (H@N) metrics for each model on FB15K-237, YAGO3-10, and PrimeKG datasets.  The results highlight KG-FIT's superior performance across all metrics and datasets, showcasing its ability to leverage open-world knowledge from LLMs to improve KG embeddings.", "section": "4 Experiment"}, {"figure_path": "rDoPMODpki/tables/tables_6_1.jpg", "caption": "Table 1: Link Prediction Performance Comparison. Results are averaged values (of ten runs for FB15K-237/PrimeKG and of three runs for YAGO3-10) of head/tail entity predictions. Top-3 results for each metric are highlighted. \"*\" indicates the results taken from method's original paper. KG-FIT consistently outperforms both PLM-based models and structure-based base models across all datasets and metrics, demonstrating its effectiveness in incorporating open-world knowledge from LLMs for enhancing KG embeddings.", "description": "This table presents the results of link prediction experiments on three benchmark datasets: FB15K-237, YAGO3-10, and PrimeKG.  It compares KG-FIT's performance against various state-of-the-art baselines, including both PLM-based (language model based) and structure-based (graph structure based) knowledge graph embedding methods.  The results are averaged across multiple runs and presented using three evaluation metrics: Mean Rank (MR), Mean Reciprocal Rank (MRR), and Hits@N (where N=1, 5, 10).  The table highlights KG-FIT's superior performance across all datasets and metrics, demonstrating the effectiveness of integrating open-world knowledge from Large Language Models (LLMs) to improve knowledge graph embedding.", "section": "4.1 Experimental Setup"}, {"figure_path": "rDoPMODpki/tables/tables_7_1.jpg", "caption": "Table 1: Link Prediction Performance Comparison. Results are averaged values (of ten runs for FB15K-237/PrimeKG and of three runs for YAGO3-10) of head/tail entity predictions. Top-3 results for each metric are highlighted. \"*\" indicates the results taken from method's original paper. KG-FIT consistently outperforms both PLM-based models and structure-based base models across all datasets and metrics, demonstrating its effectiveness in incorporating open-world knowledge from LLMs for enhancing KG embeddings.", "description": "This table presents a comparison of link prediction performance across various models on three benchmark datasets: FB15k-237, YAGO3-10, and PrimeKG.  The models are categorized into PLM-based (pre-trained language model-based) and structure-based methods.  For each dataset and method, the table reports the Mean Rank (MR), Mean Reciprocal Rank (MRR), and Hits@N (H@N) metrics (where N is 1, 5, and 10) for head and tail entity prediction.  KG-FIT consistently achieves top performance across all metrics and datasets, highlighting its ability to leverage open-world knowledge from LLMs (Large Language Models) to improve KG (Knowledge Graph) embeddings.", "section": "4 Experiment"}, {"figure_path": "rDoPMODpki/tables/tables_15_1.jpg", "caption": "Table 1: Link Prediction Performance Comparison. Results are averaged values (of ten runs for FB15K-237/PrimeKG and of three runs for YAGO3-10) of head/tail entity predictions. \"*\" indicates the results taken from method's original paper. KG-FIT consistently outperforms both PLM-based models and structure-based base models across all datasets and metrics, demonstrating its effectiveness in incorporating open-world knowledge from LLMs for enhancing KG embeddings.", "description": "This table presents a comparison of link prediction performance among various knowledge graph embedding (KGE) methods.  It compares KG-FIT against state-of-the-art PLM-based and structure-based methods on three benchmark datasets (FB15K-237, YAGO3-10, PrimeKG).  The results, averaged over multiple runs, are reported using Mean Rank (MR), Mean Reciprocal Rank (MRR), and Hits@N (H@N) metrics for both head and tail entity predictions.  The table highlights KG-FIT's superior performance, demonstrating the effectiveness of integrating open-world knowledge from LLMs to improve KG embeddings.", "section": "4 Results"}, {"figure_path": "rDoPMODpki/tables/tables_16_1.jpg", "caption": "Table 6: Statistics of WN18RR. #Ent./#Rel: number of entities/relations. #Train/#Valid/#Test: number of triples contained in the set.", "description": "This table presents the statistics of the WN18RR dataset, including the number of entities, relations, and triples in the training, validation, and testing sets.  It provides a summary of the dataset's size and composition, which is important context for understanding the experimental results presented in the paper.", "section": "4.1 Experimental Setup"}, {"figure_path": "rDoPMODpki/tables/tables_21_1.jpg", "caption": "Table 1: Link Prediction Performance Comparison. Results are averaged values (of ten runs for FB15K-237/PrimeKG and of three runs for YAGO3-10) of head/tail entity predictions. \"*\" indicates the results taken from method's original paper. KG-FIT consistently outperforms both PLM-based models and structure-based base models across all datasets and metrics, demonstrating its effectiveness in incorporating open-world knowledge from LLMs for enhancing KG embeddings.", "description": "This table presents a comparison of link prediction performance across different knowledge graph embedding (KGE) methods.  It compares KG-FIT against state-of-the-art PLM-based (pre-trained language model-based) and structure-based KGE methods on three benchmark datasets: FB15k-237, YAGO3-10, and PrimeKG. The results are averaged over multiple runs and show the performance for both head and tail entity prediction using Mean Rank (MR), Mean Reciprocal Rank (MRR), and Hits@N (where N is 1, 5, and 10). KG-FIT consistently achieves better results than the baselines, highlighting its ability to leverage open-world knowledge from LLMs to improve KG embeddings.", "section": "4.1 Experimental Setup"}, {"figure_path": "rDoPMODpki/tables/tables_23_1.jpg", "caption": "Table 7: Statistics of the hierarchies constructed by KG-FIT on different datasets.", "description": "This table presents statistics on the hierarchies created by the KG-FIT model for four different knowledge graph datasets: FB15K-237, YAGO3-10, PrimeKG, and WN18RR.  It compares the seed hierarchy (before LLM refinement) with the LLM-guided refined hierarchy (after refinement) to show the changes and improvements after applying the LLM-guided refinement process. The statistics include the number of clusters, the number of nodes, the maximum, minimum, and average number of entities within each cluster, the maximum, minimum, and average depth of the hierarchy, and the maximum, minimum, and average number of branches per node.  The data reveals the effect of the LLM refinement process on the structure and organization of the hierarchies, providing insights into its effectiveness in enhancing the quality of the knowledge graph embeddings.", "section": "F.3 Statistics of Constructed Hierarchies"}, {"figure_path": "rDoPMODpki/tables/tables_24_1.jpg", "caption": "Table 1: Link Prediction Performance Comparison. Results are averaged values (of ten runs for FB15K-237/PrimeKG and of three runs for YAGO3-10) of head/tail entity predictions. Top-3 results for each metric are highlighted. \"*\" indicates the results taken from method's original paper. KG-FIT consistently outperforms both PLM-based models and structure-based base models across all datasets and metrics, demonstrating its effectiveness in incorporating open-world knowledge from LLMs for enhancing KG embeddings.", "description": "This table presents a comparison of link prediction performance between KG-FIT and various baseline methods (PLM-based and structure-based) across three benchmark datasets: FB15K-237, YAGO3-10, and PrimeKG.  The results, averaged over multiple runs, show KG-FIT achieving superior performance in terms of Mean Rank (MR), Mean Reciprocal Rank (MRR), and Hits@N (H@N) metrics for all datasets.  The table highlights KG-FIT's improvement over both PLM-based and structure-based methods, demonstrating the effectiveness of integrating open-world knowledge from LLMs.", "section": "4 Results"}, {"figure_path": "rDoPMODpki/tables/tables_25_1.jpg", "caption": "Table 1: Link Prediction Performance Comparison. Results are averaged values (of ten runs for FB15K-237/PrimeKG and of three runs for YAGO3-10) of head/tail entity predictions. Top-3 results for each metric are highlighted. \"*\" indicates the results taken from method's original paper. KG-FIT consistently outperforms both PLM-based models and structure-based base models across all datasets and metrics, demonstrating its effectiveness in incorporating open-world knowledge from LLMs for enhancing KG embeddings.", "description": "This table presents a comparison of link prediction performance between KG-FIT and several baseline models (both PLM-based and structure-based) across three benchmark datasets (FB15K-237, YAGO3-10, PrimeKG).  The results, averaged over multiple runs, are reported for three key metrics: Mean Rank (MR), Mean Reciprocal Rank (MRR), and Hits@N (for N=1, 5, 10).  The table highlights KG-FIT's superior performance, demonstrating the effectiveness of incorporating open-world knowledge from LLMs to improve KG embedding models.", "section": "4.2 Results"}, {"figure_path": "rDoPMODpki/tables/tables_25_2.jpg", "caption": "Table 1: Link Prediction Performance Comparison. Results are averaged values (of ten runs for FB15K-237/PrimeKG and of three runs for YAGO3-10) of head/tail entity predictions. Top-3 results for each metric are highlighted. \"*\" indicates the results taken from method's original paper. KG-FIT consistently outperforms both PLM-based models and structure-based base models across all datasets and metrics, demonstrating its effectiveness in incorporating open-world knowledge from LLMs for enhancing KG embeddings.", "description": "This table presents a comparison of link prediction performance across several state-of-the-art knowledge graph embedding models, including both PLM-based and structure-based methods.  The results are averaged over multiple runs for each method and dataset, using metrics such as Mean Rank (MR), Mean Reciprocal Rank (MRR), and Hits@N (H@N).  The table highlights the superior performance of the proposed KG-FIT model compared to existing methods. KG-FIT consistently outperforms baseline methods in all metrics across three benchmark datasets (FB15k-237, YAGO3-10, PrimeKG).", "section": "4.1 Experimental Setup"}, {"figure_path": "rDoPMODpki/tables/tables_26_1.jpg", "caption": "Table 1: Link Prediction Performance Comparison. Results are averaged values (of ten runs for FB15K-237/PrimeKG and of three runs for YAGO3-10) of head/tail entity predictions. Top-3 results for each metric are highlighted. '*' indicates the results taken from method's original paper. KG-FIT consistently outperforms both PLM-based models and structure-based base models across all datasets and metrics, demonstrating its effectiveness in incorporating open-world knowledge from LLMs for enhancing KG embeddings.", "description": "This table presents a comparison of link prediction performance across several datasets (FB15K-237, YAGO3-10, PrimeKG) using various methods.  The methods compared include both PLM-based (e.g., KG-BERT, StAR, PKGC) and structure-based (TransE, DistMult, ComplEx, etc.) knowledge graph embedding techniques. The table shows the Mean Rank (MR), Mean Reciprocal Rank (MRR), and Hits@N (H@N) metrics for each method and dataset, highlighting KG-FIT's superior performance.  The results illustrate the improvement achieved by KG-FIT, which integrates knowledge from LLMs to enhance KG embeddings, over both structure-based and existing PLM-based methods.", "section": "4.1 Experimental Setup"}, {"figure_path": "rDoPMODpki/tables/tables_27_1.jpg", "caption": "Table 1: Link Prediction Performance Comparison. Results are averaged values (of ten runs for FB15K-237/PrimeKG and of three runs for YAGO3-10) of head/tail entity predictions. Top-3 results for each metric are highlighted. \"*\" indicates the results taken from method's original paper. KG-FIT consistently outperforms both PLM-based models and structure-based base models across all datasets and metrics, demonstrating its effectiveness in incorporating open-world knowledge from LLMs for enhancing KG embeddings.", "description": "This table presents a comparison of link prediction performance across different KG embedding methods. It shows the Mean Rank (MR), Mean Reciprocal Rank (MRR), and Hits@N (H@N) metrics for three benchmark datasets (FB15k-237, YAGO3-10, and PrimeKG).  The methods are categorized into PLM-based and structure-based methods, with KG-FIT being compared against both.  The results show that KG-FIT consistently outperforms all baselines across all metrics and datasets, demonstrating its effectiveness at integrating open-world knowledge from LLMs to improve KG embedding.", "section": "4.1 Experimental Setup"}, {"figure_path": "rDoPMODpki/tables/tables_27_2.jpg", "caption": "Table 1: Link Prediction Performance Comparison. Results are averaged values (of ten runs for FB15K-237/PrimeKG and of three runs for YAGO3-10) of head/tail entity predictions. Top-3 results for each metric are highlighted. \"*\" indicates the results taken from method's original paper. KG-FIT consistently outperforms both PLM-based models and structure-based base models across all datasets and metrics, demonstrating its effectiveness in incorporating open-world knowledge from LLMs for enhancing KG embeddings.", "description": "This table presents a comparison of link prediction performance across various methods on three benchmark datasets (FB15k-237, YAGO3-10, PrimeKG).  It compares KG-FIT against state-of-the-art PLM-based methods (KG-BERT, StAR, PKGC, etc.) and structure-based methods (TransE, DistMult, ComplEx, etc.).  The results are averaged across multiple runs, and the top three results for Mean Rank (MR), Mean Reciprocal Rank (MRR), Hits@1, Hits@5, and Hits@10 are highlighted. The table shows KG-FIT consistently outperforms the other methods, demonstrating its effectiveness in integrating open-world knowledge from LLMs into KG embeddings.", "section": "4.1 Experimental Setup"}, {"figure_path": "rDoPMODpki/tables/tables_32_1.jpg", "caption": "Table 1: Link Prediction Performance Comparison. Results are averaged values (of ten runs for FB15K-237/PrimeKG and of three runs for YAGO3-10) of head/tail entity predictions. Top-3 results for each metric are highlighted. \"*\" indicates the results taken from method's original paper. KG-FIT consistently outperforms both PLM-based models and structure-based base models across all datasets and metrics, demonstrating its effectiveness in incorporating open-world knowledge from LLMs for enhancing KG embeddings.", "description": "This table presents a comparison of link prediction performance between KG-FIT and various baseline methods (PLM-based and structure-based) across three benchmark datasets (FB15K-237, YAGO3-10, and PrimeKG).  The results show KG-FIT consistently outperforms all baseline models across multiple metrics (Mean Rank, Mean Reciprocal Rank, Hits@1, Hits@5, Hits@10), highlighting the effectiveness of incorporating open-world knowledge from LLMs to improve KG embeddings.", "section": "4 Results"}]