[{"figure_path": "LJNqVIKSCr/figures/figures_1_1.jpg", "caption": "Figure 1: (a) Existing search methods are single-ended, and aim to identify a synthetic route where all leaf nodes meet certain termination criteria, e.g., buyability. (b) DESP is a bidirectional search algorithm that enables a double-ended starting material-constrained search, better reflecting certain real-world use cases in complex molecule synthesis planning. Empirically, double-ended search finds starting material-constrained solutions with fewer node expansions.", "description": "This figure compares single-ended and double-ended search methods for synthesis planning. (a) shows a typical single-ended search where the algorithm explores from the target molecule to arbitrary building blocks until the termination criteria is met. (b) shows the double-ended search used by the DESP algorithm where the search is conducted bidirectionally from both the target molecule and the specified starting material, interleaving expansions to ensure constraint satisfiability, resulting in fewer node expansions.", "section": "1 Introduction"}, {"figure_path": "LJNqVIKSCr/figures/figures_4_1.jpg", "caption": "Figure 2: (a) DESP algorithm. Evaluation of top nodes is based on both Vm and Dm. For F2E search, synthetic distance is calculated between a molecule and the opposing goal, while for F2F, it is calculated based on the closest opposing molecule. (b) Overview of the one-step expansion procedures.", "description": "This figure shows the DESP algorithm's workflow. (a) illustrates the algorithm's bidirectional search process between the target and starting material, using a combination of top-down retrosynthesis and bottom-up synthesis.  Node evaluation considers both the traditional cost (Vm) and the newly introduced synthetic distance (Dm). Two variations, F2E and F2F, are depicted, differing in how the opposing graph is used to guide the search. (b) details the one-step expansion procedures for both retro and forward synthesis, highlighting the use of classifiers to rank reaction templates and k-NN search for building blocks.", "section": "3 Methods"}, {"figure_path": "LJNqVIKSCr/figures/figures_8_1.jpg", "caption": "Figure 3: Ablation study. (a) Solve rate as a function of the binned complexity of target molecules in Pistachio Hard. (b) Number of forward reactions in DESP routes across all benchmark sets.", "description": "This figure presents the results of an ablation study to evaluate the impact of the synthetic distance (D) and bidirectional search on the performance of the proposed Double-Ended Synthesis Planning (DESP) algorithm.  Panel (a) shows the solve rates of different methods (Retro*, Retro*+D, DESP-F2E, DESP-F2F) as a function of the target molecule's complexity (binned SCScore and SAScore values) for the Pistachio Hard dataset.  Panel (b) shows the distribution of the number of forward reactions across all benchmark datasets for DESP-F2E and DESP-F2F, illustrating how the two approaches differ in their utilization of forward reactions.", "section": "4.2 Results"}, {"figure_path": "LJNqVIKSCr/figures/figures_8_2.jpg", "caption": "Figure 4: Exemplary synthetic route for a test case that DESP-F2F was able to solve but Retro* was unable to solve. DESP-F2F was able to match every step of the reference route in this case.", "description": "This figure shows an example of a synthetic route successfully found by DESP-F2F but not by Retro*.  It highlights DESP's ability to find a synthetic route that matches the expert's route step-by-step by leveraging both forward and backward searches, which is a capability that Retro*, a single-ended search algorithm, lacks.", "section": "4 Results"}, {"figure_path": "LJNqVIKSCr/figures/figures_18_1.jpg", "caption": "Figure 1: (a) Existing search methods are single-ended, and aim to identify a synthetic route where all leaf nodes meet certain termination criteria, e.g., buyability. (b) DESP is a bidirectional search algorithm that enables a double-ended starting material-constrained search, better reflecting certain real-world use cases in complex molecule synthesis planning. Empirically, double-ended search finds starting material-constrained solutions with fewer node expansions.", "description": "This figure compares single-ended and double-ended search methods in the context of synthesis planning.  Panel (a) shows a typical single-ended approach, where the search starts from an arbitrary building block and aims to reach a target molecule.  Panel (b) illustrates the double-ended approach of the DESP algorithm, which simultaneously searches forward from a specified starting material and backward from the target molecule, interleaving expansions from both ends to satisfy the constraints and often finding solutions more efficiently.", "section": "1 Introduction"}, {"figure_path": "LJNqVIKSCr/figures/figures_18_2.jpg", "caption": "Figure 5: Illustration of data extraction procedure for offline training of  ft, fb, and D. (a) For each target, the full search graph is enumerated by recursively tracing outgoing edges and propagating Retro* quantities. (b) For each bimolecular reaction with at least one buyable reactant, training examples for ft and fb are labeled. For each molecule node m other than the target, D(m, p*) is computed.", "description": "This figure illustrates the process of extracting training data for three different models (ft, fb, and D) used in the Double-Ended Synthesis Planning (DESP) algorithm.  Panel (a) shows how the full search graph is traversed to find all possible pathways from the target molecule to building blocks. During this traversal, various metrics are calculated and stored. Panel (b) focuses on extracting training data specifically for bimolecular reactions, where the models learn to predict the reaction and resulting molecules, given starting materials and a reaction template.  In both cases, crucial values for synthetic distance are also calculated and used as training labels to help the models improve their estimates of the cost and feasibility of reactions. ", "section": "3.4 Extracting multi-step reaction data from a reaction corpus for offline learning"}, {"figure_path": "LJNqVIKSCr/figures/figures_18_3.jpg", "caption": "Figure 6: Predicted vs. actual values of synthetic distance on the validation examples. Actual values above 9 are set to 10.", "description": "This figure shows a violin plot comparing the predicted synthetic distance values against the actual values on a validation set. The synthetic distance metric, calculated using a goal-conditioned cost network, estimates the cost of synthesizing a molecule from a specific starting material. The plot illustrates the distribution of predicted and actual values, demonstrating a strong correlation between the predicted and actual synthetic distances with an R-squared value of 0.852.  The actual values exceeding 9 are capped at 10 to improve the visualization of the distribution. ", "section": "4.2 Results"}, {"figure_path": "LJNqVIKSCr/figures/figures_19_1.jpg", "caption": "Figure 2: (a) DESP algorithm. Evaluation of top nodes is based on both Vm and Dm. For F2E search, synthetic distance is calculated between a molecule and the opposing goal, while for F2F, it is calculated based on the closest opposing molecule. (b) Overview of the one-step expansion procedures.", "description": "This figure illustrates the DESP algorithm, showing the evaluation of top nodes and how synthetic distance is calculated for both F2E and F2F search strategies. It also provides a detailed overview of the one-step expansion procedures used in the algorithm.", "section": "3 Methods"}, {"figure_path": "LJNqVIKSCr/figures/figures_20_1.jpg", "caption": "Figure 2: (a) DESP algorithm. Evaluation of top nodes is based on both Vm and Dm. For F2E search, synthetic distance is calculated between a molecule and the opposing goal, while for F2F, it is calculated based on the closest opposing molecule. (b) Overview of the one-step expansion procedures.", "description": "This figure illustrates the DESP algorithm, showing how it evaluates top nodes based on both Vm and Dm. It also shows the one-step expansion procedures for both top-down and bottom-up search strategies.", "section": "3 Methods"}, {"figure_path": "LJNqVIKSCr/figures/figures_21_1.jpg", "caption": "Figure 8: Distribution of reaction counts in Pistachio Reachable.", "description": "This histogram shows the distribution of the number of reactions in the synthetic routes of the Pistachio Reachable dataset.  The x-axis represents the number of reactions, and the y-axis represents the number of routes with that many reactions.  The dataset consists of 150 synthetic routes that satisfy specific constraints, such as no reactions being present in the training set, no reactions being shared between any routes, and all reactions being within the top 50 proposals of a single-step retrosynthetic model. The data shows a relatively even distribution, with the most frequent number of reactions being around 7 or 8.", "section": "A.6 New benchmark set details"}, {"figure_path": "LJNqVIKSCr/figures/figures_22_1.jpg", "caption": "Figure 8: Distribution of reaction counts in Pistachio Reachable.", "description": "This histogram shows the distribution of the number of reactions in the synthetic routes of the Pistachio Reachable dataset. The x-axis represents the number of reactions, and the y-axis represents the number of routes with that many reactions.  The distribution appears relatively uniform, with most routes having between 4 and 8 reactions.", "section": "A.6 New benchmark set details"}]