[{"figure_path": "YlIvhHFwQ2/tables/tables_7_1.jpg", "caption": "Table 1: Video to 4D Scene Generation Comparisons. We report the CLIP and LPIPS scores in Kubric [15] and DAVIS [37]. For user preference, A%/B% denotes that A% of the users prefer the baseline while B% prefer ours in two-way voting. We denote methods with Video Scene Decomposition as VSD and methods with Motion Factorization as MF.", "description": "This table compares the performance of DreamScene4D against several baseline methods for video-to-4D scene generation on the DAVIS and Kubric datasets.  The comparison uses CLIP and LPIPS scores to evaluate the visual quality of the generated 4D scenes. User preference is also measured through a two-way voting system.  The table indicates whether each method incorporates Video Scene Decomposition (VSD) and/or Motion Factorization (MF).  Ablation studies on DreamScene4D (removing different components) are also shown.", "section": "4 Experiments"}, {"figure_path": "YlIvhHFwQ2/tables/tables_8_1.jpg", "caption": "Table 2: Gaussian Motion Accuracy. We report the EPE in Kubric [15] and DAVIS [37, 12]. We denote methods with our Video Scene Decomposition in column VSD and methods with 3D Motion Factorization in column MF. Note that CoTracker is trained on Kubric.", "description": "This table presents a comparison of the End Point Error (EPE) for different methods on the DAVIS and Kubric datasets.  The EPE measures the accuracy of 3D motion estimation. It compares DreamScene4D to baselines (DreamGaussian4D, with and without video scene decomposition) and methods specifically trained on point tracking (PIPS++, CoTracker).  The table highlights the improvements achieved by DreamScene4D's motion factorization and video scene decomposition, particularly in reducing the EPE for both visible and occluded points.", "section": "4.2 4D Gaussian Motion Accuracy"}, {"figure_path": "YlIvhHFwQ2/tables/tables_9_1.jpg", "caption": "Table 3: Generation Results Using Different Depth Estimators. We report the PSNR and LPIPS on multi-object DAVIS videos using different depth estimators.", "description": "This table presents the Peak Signal-to-Noise Ratio (PSNR) and Learned Perceptual Image Patch Similarity (LPIPS) scores for 4D scene generation on multi-object DAVIS videos using various depth estimation methods.  The methods compared include the original Depth-Anything v1, Depth-Anything v1 with added noise (10% and 25%), MiDAS v3.1, and Depth-Anything v2.  The results demonstrate the robustness of the DreamScene4D approach to variations in depth estimation accuracy.", "section": "4.3 Reliance on External Depth Estimation"}, {"figure_path": "YlIvhHFwQ2/tables/tables_14_1.jpg", "caption": "Table 1: Video to 4D Scene Generation Comparisons. We report the CLIP and LPIPS scores in Kubric [15] and DAVIS [37]. For user preference, A%/B% denotes that A% of the users prefer the baseline while B% prefer ours in two-way voting. We denote methods with Video Scene Decomposition as VSD and methods with Motion Factorization as MF.", "description": "This table compares the performance of DreamScene4D against several baselines on two video datasets: DAVIS and Kubric.  The comparison uses CLIP and LPIPS scores to evaluate the quality of 4D scene generation, and includes a user preference study to gauge the relative appeal of each method's output.  The table also indicates whether each method uses Video Scene Decomposition (VSD) or Motion Factorization (MF).", "section": "4 Experiments"}, {"figure_path": "YlIvhHFwQ2/tables/tables_16_1.jpg", "caption": "Table 5: Video Amodal Completion Evaluations. We report the PSNR, LPIPS, and Temporal Consistency (TC) measured using CLIP similarity in randomly masked YoutubeVOS [55] videos.", "description": "This table presents a comparison of video amodal completion methods.  It shows the Peak Signal-to-Noise Ratio (PSNR), Learned Perceptual Image Patch Similarity (LPIPS), and Temporal Consistency (TC) scores for different approaches.  The methods compared include Repaint [29], SD-Inpaint [45], and the authors' method, DreamScene4D.  Ablation studies removing the spatiotemporal self-attention (STSA) and consistency guidance components from DreamScene4D are also included to assess their individual impact on the results.", "section": "A.4 Video Amodal Completion Comparisons"}]