[{"figure_path": "EFrgBP9au6/figures/figures_8_1.jpg", "caption": "Figure 1: Results for linear regression/random feature model trained on datasets X, Y, and Z. (a)-(c) Quantile-Quantile plots of fitted Student-t-distribution against empirical SGD iterates; (d)-(f) Quantile-Quantile plots of fitted a-stable distribution against empirical SGD iterates; (g)-(i) Comparison between ccdf of empirical data and Student-t-distribution parameterized by upper tail-index bound η* and lower bound η*. ", "description": "This figure presents a comparison of the empirical distribution of SGD iterates with theoretical distributions (Student's t and alpha-stable).  QQ plots (a-f) show how well the empirical data fits the theoretical distributions. The plots (g-i) compare the complementary cumulative distribution function (ccdf) of the empirical data to the Student's t-distribution, illustrating the accuracy of the theoretical upper and lower tail index bounds.", "section": "4 Experiments"}, {"figure_path": "EFrgBP9au6/figures/figures_9_1.jpg", "caption": "Figure 1: Results for linear regression/random feature model trained on datasets X, Y, and Z. (a)-(c) Quantile-Quantile plots of fitted Student-t-distribution against empirical SGD iterates; (d)-(f) Quantile-Quantile plots of fitted α-stable distribution against empirical SGD iterates; (g)-(i) Comparison between ccdf of empirical data and Student-t-distribution parameterized by upper tail-index bound η* and lower bound η*. ", "description": "This figure displays the results of experiments conducted on three different datasets (X, Y, and Z) using linear regression and a random feature model.  The first row shows quantile-quantile (QQ) plots comparing the empirical distribution of stochastic gradient descent (SGD) iterates against a fitted Student's t-distribution and an alpha-stable distribution. The second row presents similar QQ plots, but focuses on the alpha-stable distribution. The third row compares the complementary cumulative distribution function (ccdf) of the empirical data to the ccdfs of Student's t-distributions parameterized by upper and lower bounds (η* and η*) of the asymptotic tail index. These comparisons visually assess the goodness-of-fit of the Student's t-distribution and the alpha-stable distribution as models for the heavy-tailed distribution of SGD iterates.", "section": "4 Experiments"}]