[{"figure_path": "2fiYzs3YkH/tables/tables_7_1.jpg", "caption": "Table 1: Noisy restoration on ImageNet with σ = 0.05. The LPIPS metrics are multiplied by 100.", "description": "This table presents the performance comparison of different methods on three linear image restoration tasks (super-resolution, inpainting, and Gaussian deblurring) on the ImageNet dataset with Gaussian noise (σ = 0.05).  The metrics used for evaluation are PSNR, SSIM, LPIPS (multiplied by 100 for easier readability), and FID.  The results show the performance of ProjDiff compared to other state-of-the-art methods (DPS, DDRM, DDNM+, RED-diff).", "section": "4.1 Image restoration"}, {"figure_path": "2fiYzs3YkH/tables/tables_7_2.jpg", "caption": "Table 2: Phase retrieval results. The LPIPS metrics are multiplied by 100.", "description": "This table presents the performance comparison of different phase retrieval algorithms (ER, HIO, OSS, DPS, RED-diff, and ProjDiff) under two scenarios: noise-free (σ = 0) and noisy (σ = 0.1).  The performance metrics reported include PSNR, SSIM, LPIPS (multiplied by 100), and FID.  The NFES column indicates the number of function evaluations used by each algorithm.  The results demonstrate ProjDiff's superior performance, especially in the noise-free scenario.", "section": "4.1 Image restoration"}, {"figure_path": "2fiYzs3YkH/tables/tables_9_1.jpg", "caption": "Table 3: SI-SDRi for source separation task (higher is better).", "description": "This table presents the scale-invariant SDR improvement (SI-SDRi) scores for a source separation task.  The task involves separating four instruments (bass, drums, guitar, piano) from a mixed audio sequence.  The table compares the performance of ProjDiff against several other methods, including Demucs+Gibbs (a previous state-of-the-art), ISDM-Gaussian, ISDM-Dirac, and RED-diff.  Higher SI-SDRi values indicate better separation performance.  The \"Average\" column provides an overall performance score across all four instruments.", "section": "4.2 Source separation and partial generation"}, {"figure_path": "2fiYzs3YkH/tables/tables_9_2.jpg", "caption": "Table 4: The sub-FAD metrics on different partial generation tasks (lower is better). The capital letters in the table header represent the initial letters of the generated instruments. For example, BD represents the task of generating bass and drums given piano and guitar.", "description": "This table presents the results of the partial generation task, which aims to generate tracks of other instruments given partial tracks of some instruments. The results are evaluated using the sub-FAD metric, a lower score indicating better performance. Each column represents a different partial generation task, denoted by a combination of capital letters representing the instruments; for example, BD means generating bass and drums given piano and guitar.  The table compares the performance of different methods, including MSDM, RED-diff, and ProjDiff.", "section": "4.2 Source separation and partial generation"}, {"figure_path": "2fiYzs3YkH/tables/tables_19_1.jpg", "caption": "Table 1: Noisy restoration on ImageNet with σ = 0.05. The LPIPS metrics are multiplied by 100.", "description": "This table presents the performance comparison of different methods on noisy image restoration tasks using the ImageNet dataset with a noise standard deviation of 0.05.  The metrics used for evaluation include Peak Signal-to-Noise Ratio (PSNR), Structural Similarity Index (SSIM), Learned Perceptual Image Patch Similarity (LPIPS), and Frechet Inception Distance (FID).  LPIPS values are multiplied by 100 for easier readability. The methods compared include a baseline (A†y), DPS, DDRM, DDNM+, RED-diff, and the proposed ProjDiff method.  The number of function evaluations (NFES) is also specified for each method.", "section": "4.1 Image restoration"}, {"figure_path": "2fiYzs3YkH/tables/tables_20_1.jpg", "caption": "Table 1: Noisy restoration on ImageNet with σ = 0.05. The LPIPS metrics are multiplied by 100.", "description": "The table presents the performance comparison of different image restoration algorithms on the ImageNet dataset with noise (standard deviation = 0.05).  The algorithms are evaluated using four metrics: PSNR (Peak Signal-to-Noise Ratio), SSIM (Structural Similarity Index), LPIPS (Learned Perceptual Image Patch Similarity), and FID (Fréchet Inception Distance).  The LPIPS scores are multiplied by 100 for easier readability.  The results show the effectiveness of ProjDiff compared to other state-of-the-art methods across three image restoration tasks: super-resolution, inpainting, and Gaussian deblurring.", "section": "4.1 Image restoration"}, {"figure_path": "2fiYzs3YkH/tables/tables_20_2.jpg", "caption": "Table 1: Noisy restoration on ImageNet with σ = 0.05. The LPIPS metrics are multiplied by 100.", "description": "This table presents the performance comparison of different methods on the noisy image restoration task using the ImageNet dataset with a noise level (standard deviation) of 0.05.  The metrics used for evaluation are PSNR, SSIM, LPIPS (multiplied by 100 for easier readability), and FID.  The table compares the performance of ProjDiff against several state-of-the-art (SOTA) methods including A†y (least squares solution), DPS, DDRM, DDNM+, and RED-diff, across three different linear image restoration tasks: super-resolution, inpainting, and Gaussian deblurring.", "section": "4.1 Image restoration"}, {"figure_path": "2fiYzs3YkH/tables/tables_20_3.jpg", "caption": "Table 2: Phase retrieval results. The LPIPS metrics are multiplied by 100.", "description": "This table presents the performance of different methods on the phase retrieval task with two different noise levels (σ = 0 and σ = 0.1).  The metrics used for evaluation are PSNR, SSIM, LPIPS (multiplied by 100), and FID.  The results show a comparison between ProjDiff and other baseline and state-of-the-art algorithms such as ER, HIO, OSS, DPS, and RED-diff.  The number of function evaluations (NFES) is also specified.", "section": "4.1 Image restoration"}, {"figure_path": "2fiYzs3YkH/tables/tables_20_4.jpg", "caption": "Table 9: Noise-free restoration with 20 steps on ImageNet. The LPIPS metrics are multiplied by 100.", "description": "This table presents a comparison of the performance of DDRM, DDNM, and ProjDiff on three linear image restoration tasks (super-resolution, inpainting, and Gaussian deblurring) using only 20 steps.  The metrics used to evaluate the performance are PSNR, SSIM, LPIPS (multiplied by 100), and FID.  The results demonstrate ProjDiff's competitive performance, even with a significantly reduced number of steps.", "section": "4.1 Image restoration"}, {"figure_path": "2fiYzs3YkH/tables/tables_20_5.jpg", "caption": "Table 1: Noisy restoration on ImageNet with σ = 0.05. The LPIPS metrics are multiplied by 100.", "description": "This table presents the performance comparison of several image restoration algorithms on the ImageNet dataset with Gaussian noise (σ = 0.05).  The algorithms are evaluated on three linear inverse problems: super-resolution, inpainting, and Gaussian deblurring.  The metrics used for evaluation include PSNR, SSIM, LPIPS (multiplied by 100 for easier readability), and FID.  The results show the performance of ProjDiff against state-of-the-art methods.", "section": "4.1 Image restoration"}, {"figure_path": "2fiYzs3YkH/tables/tables_21_1.jpg", "caption": "Table 2: Phase retrieval results. The LPIPS metrics are multiplied by 100.", "description": "This table presents the performance comparison of different phase retrieval algorithms on the FFHQ dataset.  The algorithms are evaluated using four metrics: PSNR, SSIM, LPIPS, and FID.  The table shows results for two noise levels (σ = 0 and σ = 0.1), and for a different number of function evaluations (NFES).  The LPIPS values have been multiplied by 100 for easier interpretation.  ProjDiff consistently demonstrates superior performance, highlighting its effectiveness in handling nonlinear inverse problems.", "section": "4.1 Image restoration"}, {"figure_path": "2fiYzs3YkH/tables/tables_22_1.jpg", "caption": "Table 12: Ablation study of the gradient truncation method in ProjDiff on noise-free tasks on CelebA.", "description": "This ablation study compares the performance of ProjDiff with and without gradient truncation on noise-free image restoration tasks using the CelebA dataset.  It shows the impact of the gradient truncation method on the model's performance, measured by PSNR, SSIM, LPIPS, and FID, and also reports the training time for each model.", "section": "4.1 Image restoration"}, {"figure_path": "2fiYzs3YkH/tables/tables_22_2.jpg", "caption": "Table 2: Phase retrieval results. The LPIPS metrics are multiplied by 100.", "description": "This table presents the performance of different methods on the phase retrieval task with two different noise levels (σ = 0 and σ = 0.1).  The metrics used to evaluate the performance are PSNR (higher is better), SSIM (higher is better), LPIPS (lower is better, multiplied by 100), and FID (lower is better).  The results show the performance of ProjDiff compared to other baselines (ER, HIO, OSS, DPS, and RED-diff) for different numbers of function evaluations (NFEs).", "section": "4.1 Image restoration"}, {"figure_path": "2fiYzs3YkH/tables/tables_22_3.jpg", "caption": "Table 1: Noisy restoration on ImageNet with σ = 0.05. The LPIPS metrics are multiplied by 100.", "description": "This table presents the performance comparison of different methods on noisy image restoration tasks using the ImageNet dataset.  The noise level (standard deviation) is set to 0.05.  Metrics used include PSNR, SSIM, LPIPS (multiplied by 100 for easier readability), and FID.  The methods compared include a baseline (A†y), DPS, DDRM, DDNM+, RED-diff, and the proposed ProjDiff, each evaluated with 100 or 1000 function evaluations.  The table allows for a comparison of various methods' effectiveness in handling noisy image data for three different restoration types (Super-Resolution, Inpainting, Gaussian Deblurring).", "section": "4.1 Image restoration"}, {"figure_path": "2fiYzs3YkH/tables/tables_23_1.jpg", "caption": "Table 1: Noisy restoration on ImageNet with σ = 0.05. The LPIPS metrics are multiplied by 100.", "description": "This table presents the performance comparison of different methods on noisy image restoration tasks using the ImageNet dataset.  The noise level (standard deviation) is set to 0.05. The metrics used for evaluation include PSNR, SSIM, LPIPS (multiplied by 100 for easier reading), and FID.  The results demonstrate the effectiveness of ProjDiff in comparison to other state-of-the-art methods across different image restoration tasks.", "section": "4.1 Image restoration"}, {"figure_path": "2fiYzs3YkH/tables/tables_23_2.jpg", "caption": "Table 3: SI-SDR¡ for source separation task (higher is better).", "description": "This table presents the performance comparison of different source separation methods, including Demucs+Gibbs, ISDM-Gaussian, ISDM-Dirac, RED-diff, and ProjDiff.  The performance is evaluated using the scale-invariant SDR improvement (SI-SDRi) metric for each instrument (Bass, Drums, Guitar, Piano) and the average SI-SDRi across all four instruments.  Higher SI-SDRi values indicate better separation performance.", "section": "4.2 Source separation and partial generation"}, {"figure_path": "2fiYzs3YkH/tables/tables_23_3.jpg", "caption": "Table 3: SI-SDRi for source separation task (higher is better).", "description": "This table presents the performance comparison of different source separation methods on the SLACK2100 dataset.  The metrics used are scale-invariant SDR improvement (SI-SDRi) for each instrument (bass, drums, guitar, piano) and their average. Higher SI-SDRi values indicate better separation performance.", "section": "4.2 Source separation and partial generation"}, {"figure_path": "2fiYzs3YkH/tables/tables_24_1.jpg", "caption": "Table 3: SI-SDR¡ for source separation task (higher is better).", "description": "This table presents the performance comparison of different methods on a source separation task.  The scale-invariant SDR improvement (SI-SDRi) metric is used to evaluate the quality of source separation for each instrument (Bass, Drums, Guitar, Piano) and provides an average across all instruments. Higher values of SI-SDRi indicate better separation performance.", "section": "4.2 Source separation and partial generation"}, {"figure_path": "2fiYzs3YkH/tables/tables_24_2.jpg", "caption": "Table 3: SI-SDR; for source separation task (higher is better).", "description": "This table presents the performance comparison of different algorithms on a source separation task, specifically measuring the scale-invariant SDR improvement (SI-SDR;) for four instruments (bass, drums, guitar, piano) and their average.  Higher values indicate better performance.", "section": "4.2 Source separation and partial generation"}, {"figure_path": "2fiYzs3YkH/tables/tables_24_3.jpg", "caption": "Table 4: The sub-FAD metrics on different partial generation tasks (lower is better). The capital letters in the table header represent the initial letters of the generated instruments. For example, BD represents the task of generating bass and drums given piano and guitar.", "description": "The table shows the performance of different methods on partial generation tasks, measured by the sub-FAD metric.  Lower values indicate better performance. Each column represents a different partial generation task, where the letters indicate which instruments are generated (e.g., BD means bass and drums are generated, given the other two). The methods compared include MSDM, RED-diff, and ProjDiff.  The results demonstrate ProjDiff's superior performance across various partial generation scenarios.", "section": "4.2 Source separation and partial generation"}, {"figure_path": "2fiYzs3YkH/tables/tables_28_1.jpg", "caption": "Table 1: Noisy restoration on ImageNet with σ = 0.05. The LPIPS metrics are multiplied by 100.", "description": "This table presents the performance comparison of different methods on the noisy ImageNet dataset with a noise standard deviation of 0.05.  The metrics used for comparison include PSNR, SSIM, LPIPS (multiplied by 100 for easier readability), and FID.  Different methods are compared for three different image restoration tasks: Super-Resolution, Inpainting, and Gaussian Deblurring, each with a different number of function evaluations (NFES).", "section": "4.1 Image restoration"}]