[{"figure_path": "bzuQtVDxv0/tables/tables_7_1.jpg", "caption": "Table 1: Comparison with existing methods on Tap-Vid benchmark (DAVIS).", "description": "This table compares the proposed method with several state-of-the-art (SOTA) methods on the DAVIS dataset using the Tap-Vid benchmark.  The metrics used for comparison include PSNR, SSIM, LPIPS, Average Jaccard Index (AJ), Average Overlap (OA), and Temporal Consistency (TC).  Additionally, the table provides information on training time, GPU memory usage, and frames per second (FPS) to give a comprehensive comparison of computational efficiency.  The results indicate that the proposed method outperforms other methods in several metrics, demonstrating its superior performance and efficiency.", "section": "6 Experiments"}, {"figure_path": "bzuQtVDxv0/tables/tables_8_1.jpg", "caption": "Table 2: Ablation of each module in our framework.", "description": "This table presents the ablation study results, comparing the performance of the proposed method (Ours) against variations where different modules are removed.  Specifically, it shows the impact of using a perspective camera instead of the proposed orthographic camera, removing the flow loss, removing the depth loss, and using a different depth loss function (L2 loss instead of the scale and shift trimmed loss). The results are evaluated using PSNR, SSIM, and LPIPS metrics to assess the quality of the video reconstruction.", "section": "6.2 Ablation Study"}, {"figure_path": "bzuQtVDxv0/tables/tables_14_1.jpg", "caption": "Table 3: Gaussian attributes table", "description": "This table shows the learning rates (lr) and annealed learning rates (Annealed lr) used for different attributes of the 3D Gaussians in the model.  The attributes include Position, Rotation, Scaling, SH (spherical harmonics), Polynomial, and Fourier coefficients, Segmentation Label, and SAM Feature.  Each attribute is optimized using a different learning rate schedule.", "section": "A.1 Implementation Details"}, {"figure_path": "bzuQtVDxv0/tables/tables_16_1.jpg", "caption": "Table 4: Ablation of n/l choice.", "description": "This table presents the results of an ablation study on the hyperparameters n and l, which control the flexibility of Gaussian motion trajectories.  Different combinations of n and l (polynomial and Fourier coefficients, respectively) were tested to determine their impact on video reconstruction quality.  The metrics used to assess performance are PSNR, SSIM, and LPIPS.  A row labeled 'w/o' shows the results when these parameters were omitted, which provides a baseline for comparison.", "section": "6.3 Limitations"}, {"figure_path": "bzuQtVDxv0/tables/tables_16_2.jpg", "caption": "Table 5: Comparision of per-frame SAM feature and ours.", "description": "This table compares the performance of using per-frame SAM features versus the method proposed in the paper.  The metrics compared are Intersection over Union (IOU), which measures the accuracy of segmentation, and Times, which represents the processing time.  The results show that the proposed method achieves significantly higher IOU with much faster processing speed.", "section": "A.4 Consistent SAM Feature Evaluation"}]