[{"figure_path": "Y6RV6z98Pk/figures/figures_3_1.jpg", "caption": "Figure 1: Examples of poisoned samples and their v/ηr.", "description": "This figure shows examples of poisoned samples with their visibility (v) and robustness (nr) scores.  The visibility score (v) quantifies how noticeable the backdoor trigger is, while the robustness score (ηr) measures how resistant the poisoned sample is to modifications from random noise. The figure visually demonstrates that backdoors with low visibility are less robust to noise (easily destroyed by lightweight noise) while those with high visibility are more robust but easier to detect.", "section": "3 Preliminary Study"}, {"figure_path": "Y6RV6z98Pk/figures/figures_4_1.jpg", "caption": "Figure 3: Framework and workflow of our SampDetox approach", "description": "The figure illustrates the SampDetox approach, a two-stage process for purifying poisoned samples. Stage 1 (Global Detoxification) involves adding noise globally to the poisoned samples to eliminate low-visibility backdoors and then using a diffusion model to restore the samples. Stage 2 (Local Detoxification) involves comparing the restored samples to the original clean samples to identify the locations of high-visibility backdoors.  Targeted noise is then applied to these areas, followed by denoising with the diffusion model. The output is a detoxified sample.", "section": "4.2 Overview of SampDetox"}, {"figure_path": "Y6RV6z98Pk/figures/figures_7_1.jpg", "caption": "Figure 4: Illustration of poisoned samples, backdoor triggers, and their corresponding detoxified samples for the ten attacks, respectively.", "description": "This figure shows the results of applying SampDetox to ten different backdoor attacks.  The top row displays a clean sample alongside its poisoned versions created by each of the ten attacks. The middle row visualizes the triggers identified by the SampDetox algorithm during its second stage (local detoxification).  The bottom row presents the corresponding detoxified samples produced by SampDetox after both stages of processing.", "section": "5.2 Performance Comparison"}, {"figure_path": "Y6RV6z98Pk/figures/figures_9_1.jpg", "caption": "Figure 3: Framework and workflow of our SampDetox approach", "description": "This figure shows the framework and workflow of the SampDetox approach.  It illustrates a two-stage process: Stage 1 (Global Detoxification) applies noise to the entire sample to remove low-visibility backdoors. Stage 2 (Local Detoxification) uses pixel-wise comparison with the original sample to identify high-visibility triggers and then selectively applies noise to those areas. Diffusion models are used in both stages to reconstruct clean samples after noise application.", "section": "4.2 Overview of SampDetox"}, {"figure_path": "Y6RV6z98Pk/figures/figures_22_1.jpg", "caption": "Figure 6: Examples of poisoned samples and their v/nr.", "description": "This figure shows 30 examples of poisoned images from the CIFAR-10 dataset, each with its corresponding visibility score (v) and robustness score (nr). These scores are calculated using the metrics defined in Section 3.1 of the paper.  The visibility score (v) represents how easily the backdoor trigger is detectable in the image, while the robustness score (nr) indicates how resistant the poisoned sample is to noise or modifications. This figure visually demonstrates the correlation observed between trigger visibility and sample robustness, which is a key finding of the preliminary study presented in Section 3 of the paper.", "section": "3 Preliminary Study"}]