[{"figure_path": "i4jZ6fCDdy/tables/tables_6_1.jpg", "caption": "Table 1: Test results for frequency response prediction. Column VF indicates if F is indirectly predicted through the velocity field (Q3), column FQ indicates if frequency queries (Q1) are used. Q1 to Q3 refer to the model components described in Section 3.", "description": "This table presents the performance of various machine learning models on the task of frequency response prediction.  The models are evaluated using three metrics: Mean Squared Error (MSE), Earth Mover's Distance (EEMD), and Peak Frequency Error (EPEAKS).  The table also indicates whether each model uses a velocity field prediction (VF) and/or frequency queries (FQ) as part of its architecture.  The results are shown separately for two dataset settings (V-5000 and G-5000).", "section": "3 Experiments"}, {"figure_path": "i4jZ6fCDdy/tables/tables_8_1.jpg", "caption": "Table 1: Test results for frequency response prediction. Column VF indicates if F is indirectly predicted through the velocity field (Q3), column FQ indicates if frequency queries (Q1) are used. Q1 to Q3 refer to the model components described in Section 3.", "description": "This table presents the performance of various methods for predicting the frequency response of vibrating plates.  It compares baseline methods (k-NN, RN18 + FNO, DeepONet, FNO (velocity field), Grid-RN18) against the proposed Frequency-Query Operator (FQO) using ResNet18 (FQO-RN18), Vision Transformer (FQO-ViT), and U-Net (FQO-UNet) architectures. The evaluation metrics include Mean Squared Error (MSE), Earth Mover's Distance (EEMD), Peak Frequency Error (EPEAKS), and Peak Frequency Shift (EF). The VF and FQ columns indicate whether the method used velocity field prediction (Q3) and frequency queries (Q1), respectively.  The results show that the proposed FQO methods significantly outperform the baseline methods.", "section": "Experiments"}, {"figure_path": "i4jZ6fCDdy/tables/tables_8_2.jpg", "caption": "Table 3: A FQO-UNet is trained in parallel on batches from V-5000 and G-5000 and evaluated on the G-5000 test set. Performance increases in all metrics.", "description": "This table presents the results of training a Frequency-Query Operator UNet model on two different datasets (V-5000 and G-5000), and then evaluating its performance on the G-5000 test dataset.  The results are reported in terms of four evaluation metrics: Earth Mover's Distance (EEMD), Mean Squared Error (MSE), Peak Frequency Error (EPEAKS), and Peak Frequency Shift (EF). The table shows that training the model on a combined dataset of V-5000 and G-5000 leads to improved performance compared to training solely on the G-5000 dataset, demonstrating the benefit of transfer learning in the context of the research.", "section": "2.2 Evaluation"}, {"figure_path": "i4jZ6fCDdy/tables/tables_15_1.jpg", "caption": "Table 4: Dataset settings. Width is the width of lines and ellipses in mm. Properties. (prop.) involves plate size, thickness, material, boundary and loading properties.", "description": "This table presents the configurations used in generating the V-5000 and G-5000 datasets.  It shows how the plate geometries and material properties were varied to create the different samples. The 'setting' column refers to whether fixed (V-5000) or varying (G-5000) parameters were used. 'Prop.' specifies if material properties were fixed or varied. The 'lines' and 'ellipses' columns represent the number of lines and ellipses used in the beading patterns. 'Width' indicates the range of widths (in mm) of these beading features. Finally, 'Train' and 'Test' give the number of samples used for training and testing in each setting.", "section": "2 Dataset and Benchmark Construction"}, {"figure_path": "i4jZ6fCDdy/tables/tables_16_1.jpg", "caption": "Table 1: Test results for frequency response prediction. Column VF indicates if F is indirectly predicted through the velocity field (Q3), column FQ indicates if frequency queries (Q1) are used. Q1 to Q3 refer to the model components described in Section 3.", "description": "This table presents the results of frequency response prediction using various methods. It compares the performance of different models in terms of Mean Squared Error (MSE), Earth Mover's Distance (EEMD), Peak Frequency Error (EPEAKS), and the average distance between peaks (EF) on two datasets, V-5000 and G-5000.  The table also indicates whether each model uses frequency queries (FQ) and/or predicts the velocity field (VF) before computing the frequency response.", "section": "3 Experiments"}, {"figure_path": "i4jZ6fCDdy/tables/tables_16_2.jpg", "caption": "Table 1: Test results for frequency response prediction. Column VF indicates if F is indirectly predicted through the velocity field (Q3), column FQ indicates if frequency queries (Q1) are used. Q1 to Q3 refer to the model components described in Section 3.", "description": "This table presents the performance of various methods for predicting the frequency response of vibrating plates.  It compares different model architectures (including baselines and the proposed Frequency-Query Operator), showing mean squared error (MSE), Earth Mover's Distance (EEMD), and Peak Frequency Error (EPEAKS) metrics.  The VF column indicates whether the model indirectly predicts the frequency response via the velocity field, and the FQ column indicates whether frequency queries were used as input.  Lower values for the error metrics indicate better performance.", "section": "3 Experiments"}, {"figure_path": "i4jZ6fCDdy/tables/tables_18_1.jpg", "caption": "Table 1: Test results for frequency response prediction. Column VF indicates if F is indirectly predicted through the velocity field (Q3), column FQ indicates if frequency queries (Q1) are used. Q1 to Q3 refer to the model components described in Section 3.", "description": "This table presents the performance of different methods for predicting the frequency response of vibrating plates.  It compares various deep learning approaches (FQO-RN18, FQO-ViT, FQO-UNet, and baselines like DeepONet and FNO) on two datasets (V-5000 and G-5000), evaluating their Mean Squared Error (MSE), Earth Mover's Distance (EEMD), Peak Frequency Error (EPEAKS), and the average frequency error (EF). The 'VF' column indicates whether the model predicts the velocity field and then calculates the frequency response, and 'FQ' shows if the model incorporates frequency queries.  Lower values for MSE, EEMD, EPEAKS, and EF indicate better performance.", "section": "3 Experiments"}, {"figure_path": "i4jZ6fCDdy/tables/tables_20_1.jpg", "caption": "Table 1: Test results for frequency response prediction. Column VF indicates if F is indirectly predicted through the velocity field (Q3), column FQ indicates if frequency queries (Q1) are used. Q1 to Q3 refer to the model components described in Section 3.", "description": "This table presents the results of frequency response prediction using various methods.  The table compares different methods (baselines and the proposed FQO method) across two datasets (V-5000 and G-5000).  The evaluation metrics include Mean Squared Error (MSE), Earth Mover Distance (EEMD), Peak Frequency Error (EPEAKS), and the average frequency error (EF). The columns 'VF' and 'FQ' indicate whether the velocity field was used for prediction and whether frequency queries were employed, respectively.", "section": "Experiments"}, {"figure_path": "i4jZ6fCDdy/tables/tables_20_2.jpg", "caption": "Table 1: Test results for frequency response prediction. Column VF indicates if F is indirectly predicted through the velocity field (Q3), column FQ indicates if frequency queries (Q1) are used. Q1 to Q3 refer to the model components described in Section 3.", "description": "This table presents the quantitative results of various methods used for frequency response prediction on the V-5000 and G-5000 datasets.  The methods are compared using four metrics: Mean Squared Error (MSE), Earth Mover's Distance (EEMD), Peak Frequency Error (EPEAKS), and the average peak frequency shift (EF). The table also indicates whether each method used a velocity field (VF) and frequency query (FQ) approach, corresponding to questions Q1-Q3 in the paper, allowing for analysis of the impact of these architectural decisions on prediction accuracy.", "section": "3 Experiments"}, {"figure_path": "i4jZ6fCDdy/tables/tables_21_1.jpg", "caption": "Table 1: Test results for frequency response prediction. Column VF indicates if F is indirectly predicted through the velocity field (Q3), column FQ indicates if frequency queries (Q1) are used. Q1 to Q3 refer to the model components described in Section 3.", "description": "This table presents the performance of various methods for predicting the frequency response of vibrating plates.  It compares different model architectures, including baselines and the proposed Frequency-Query Operator (FQO), across two datasets (V-5000 and G-5000). The metrics used to evaluate performance are Mean Squared Error (MSE), Earth Mover's Distance (EEMD), Peak Frequency Error (EPEAKS), and Peak Frequency Shift (EF).  The VF and FQ columns indicate whether the model uses velocity field prediction and frequency queries, respectively, as described in Section 3 of the paper.", "section": "Experiments"}, {"figure_path": "i4jZ6fCDdy/tables/tables_21_2.jpg", "caption": "Table 1: Test results for frequency response prediction. Column VF indicates if F is indirectly predicted through the velocity field (Q3), column FQ indicates if frequency queries (Q1) are used. Q1 to Q3 refer to the model components described in Section 3.", "description": "This table presents the test results of various methods for frequency response prediction.  It compares different model architectures (including baselines) on two datasets (V-5000 and G-5000).  The metrics used to evaluate the models are Mean Squared Error (MSE), Earth Mover Distance (EEMD), Peak Frequency Error (EPEAKS), and the average frequency shift (EF).  The 'VF' column indicates whether the model indirectly predicts the frequency response through the velocity field, and the 'FQ' column indicates whether the model uses frequency queries as input.", "section": "Experiments"}, {"figure_path": "i4jZ6fCDdy/tables/tables_21_3.jpg", "caption": "Table 1: Test results for frequency response prediction. Column VF indicates if F is indirectly predicted through the velocity field (Q3), column FQ indicates if frequency queries (Q1) are used. Q1 to Q3 refer to the model components described in Section 3.", "description": "This table presents the performance of various models on the task of frequency response prediction.  It compares different model architectures, including baselines (k-NN, RN18 + FNO, DeepONet, etc.) and the proposed Frequency-Query Operator (FQO) method in variations (FQO-RN18, FQO-ViT, FQO-UNet). Evaluation metrics used are Mean Squared Error (MSE), Earth Mover's Distance (EEMD), Peak Frequency Error (EPEAKS), and average Peak Frequency shift (EF). The 'VF' column indicates whether the model uses velocity field prediction and 'FQ' shows whether it uses frequency query.  The table shows results for two different dataset settings (V-5000 and G-5000) which vary in the number of parameters used to describe the plates.", "section": "Experiments"}]