[{"figure_path": "GxpkSJjbQR/figures/figures_3_1.jpg", "caption": "Figure 1: AI classification model", "description": "This figure illustrates the AI classification model used in the paper. It shows the different processing steps involved, starting with all features extracted from brain scans, followed by a feature selection process to choose the most relevant features.  The selected features are then used to train and test a neural network model. The trained model is then used to make predictions.  The colors represent different features from the brain scans, with the final selection displayed in a reduced color palette.", "section": "3.2 AI model predicting early-stage AD"}, {"figure_path": "GxpkSJjbQR/figures/figures_4_1.jpg", "caption": "Figure 2: Classification accuracy of AI model.", "description": "The figure shows a graph illustrating the relationship between the number of features selected for the AI model and its classification accuracy. The x-axis represents the number of features selected, and the y-axis represents the classification accuracy.  The graph shows that accuracy generally increases as more features are added up to a point and then plateaus. The graph indicates that a satisfying level of accuracy was reached with a relatively small number of features (around 6-7).", "section": "3.2 AI model predicting early-stage AD"}, {"figure_path": "GxpkSJjbQR/figures/figures_6_1.jpg", "caption": "Figure 3: Class diagram", "description": "This class diagram illustrates the architecture of the decentralized expert system for early Alzheimer's prediction.  It shows the interactions between several key components: Data Privacy and Security (handling data encryption, secure transmission, and privacy compliance); Decentralized Data Sharing (managing patient contributions, blockchain technology, and anonymization); User Interface (for data input, prediction disposition, and recommendations); MRI Data Processing (including brain image preprocessing, standard/atlas, and brain connectivity matrix generation); AI Model (for model training/testing, personalized prediction, and decentralized model updates); and Governance (managing model aggregation, cross-validation, and stakeholder feedback).  The diagram visually represents the flow of data and the collaborative aspects of the system.", "section": "4.1 System Architecture"}, {"figure_path": "GxpkSJjbQR/figures/figures_8_1.jpg", "caption": "Figure 4: backend-frontend infrastructure diagram.", "description": "This figure illustrates the interaction between the frontend (user interface), backend (application services, database, FSL interface, Octave interface), and the database.  The frontend receives user requests and forwards them to the backend API. The backend API interacts with various application services, including the database, FSL interface (for brain connectivity matrix processing), and Octave interface.  The backend services manage data processing, using FSL and Octave, and communicate with the database to store and retrieve results. The scripts (M-Files) represent the programs and processes used by the FSL and Octave interfaces. The diagram highlights the modular and scalable design of the system.", "section": "4.1 System Architecture"}]