[{"figure_path": "JvlrUFJMbI/tables/tables_2_1.jpg", "caption": "Table 1: This table depicts the success rate of classical semantic routing methods (named in the \"Baseline\" column) on waypoint routing task sampled from our benchmark. We define a method as being successful if it returns at least one route that visits points-of-interest that together fulfill each part of the user's query. The “cost modifiers” method returns every route that can be elicited by a cost modifying rule (Delling et al., 2009); the “Electrical flows” method returns 4,096 routes sampled with the electrical flows algorithm (Sinop et al., 2021). ± denotes standard error (n=100).", "description": "The table presents the success rate of two classical semantic routing methods (cost modifiers and electrical flows) on a waypoint routing task from the benchmark dataset.  A method is considered successful if at least one of the returned routes satisfies all requirements of the user query.  The results show very low success rates for both methods, highlighting the limitations of classical approaches.", "section": "2.1 Benchmark Overview"}, {"figure_path": "JvlrUFJMbI/tables/tables_4_1.jpg", "caption": "Table 1: This table depicts the success rate of classical semantic routing methods (named in the \"Baseline\" column) on waypoint routing task sampled from our benchmark. We define a method as being successful if it returns at least one route that visits points-of-interest that together fulfill each part of the user's query. The “cost modifiers” method returns every route that can be elicited by a cost modifying rule (Delling et al., 2009); the “Electrical flows” method returns 4,096 routes sampled with the electrical flows algorithm (Sinop et al., 2021). ± denotes standard error (n=100).", "description": "This table shows the poor performance of classical semantic routing methods on waypoint routing tasks from the benchmark dataset.  It compares two common techniques: cost modifiers and electrical flows.  The results highlight the failure of these methods to effectively handle waypoint routing tasks, setting the stage for the proposed learning-based approach.", "section": "2 A Benchmark for Semantic Routing"}, {"figure_path": "JvlrUFJMbI/tables/tables_7_1.jpg", "caption": "Table 2: The task-level performance metrics of the proof-of-concept autoregressive transformer model on our benchmark. The evaluated problems represent various semantic routing tasks with queries drawn from a holdout test set and conducted on a road network from a previously unseen city (Berkeley, CA). “Waypoint Routing Success Rate” is the fraction of waypoint routing problems that are successfully completed (see Table 1). “Errands", "description": "This table shows the performance of the proof-of-concept autoregressive transformer model on a held-out test set of semantic routing problems, using a road network from a city not seen during training (Berkeley, CA).  The table presents success rates for different types of waypoint routing tasks (errands, locations, mixed) and trip planning tasks.  It also includes the median excess penalty (additional travel time) and median total travel time for mixed waypoint routing tasks.", "section": "3 A Proof-of-Concept Autoregressive Model"}, {"figure_path": "JvlrUFJMbI/tables/tables_16_1.jpg", "caption": "Table 1: This table depicts the success rate of classical semantic routing methods (named in the\n\"Baseline\" column) on waypoint routing task sampled from our benchmark. We define a method as\nbeing successful if it returns at least one route that visits points-of-interest that together fulfill each\npart of the user's query. The “cost modifiers” method returns every route that can be elicited by a cost\nmodifying rule (Delling et al., 2009); the “Electrical flows", "description": "This table shows the poor performance of two classical semantic routing methods on a waypoint routing task from the benchmark dataset.  The methods used are 'cost modifiers' and 'electrical flows'. The success rate is defined as whether the method returns at least one route that visits points-of-interest satisfying all parts of a user's query.  The low success rates highlight the limitations of classical methods for handling complex semantic routing tasks.", "section": "2 A Benchmark for Semantic Routing"}, {"figure_path": "JvlrUFJMbI/tables/tables_16_2.jpg", "caption": "Table 4: Hyperparameters for the scaling study experiment on the grid-world dataset.", "description": "This table details the hyperparameters used in a scaling study experiment conducted on a grid-world dataset.  The experiment investigated the effect of varying model size (depth and width) on the model's performance.  Different configurations are shown, each with a specified number of data points, learning rate, dropout rate, batch size, iterations, learning rate schedule, receptive field size, attention heads, embedding dimension, intermediate dimension, number of transformer blocks, intermediate dimension for road features, and number of MLP layers for road data.", "section": "Technical Details"}, {"figure_path": "JvlrUFJMbI/tables/tables_17_1.jpg", "caption": "Table 5: Hyperparameters for the scaling study experiment on the grid-world dataset (continued).", "description": "This table shows the hyperparameters used in the scaling study experiment on the grid-world dataset.  The experiment varied the model's depth and width (embedding dimension) to see how performance scaled.  The hyperparameters include the number of datapoints, learning rate, L2 weight decay, dropout rate, batch size, number of iterations, seeds, learning rate schedule, receptive field size, number of attention heads, embedding dimension, intermediate dimension, number of transformer blocks, intermediate dimension for road encoding, and number of MLP layers for road encoding.", "section": "C Experiment Details"}, {"figure_path": "JvlrUFJMbI/tables/tables_17_2.jpg", "caption": "Table 1: This table depicts the success rate of classical semantic routing methods (named in the \"Baseline\" column) on waypoint routing task sampled from our benchmark. We define a method as being successful if it returns at least one route that visits points-of-interest that together fulfill each part of the user's query. The “cost modifiers” method returns every route that can be elicited by a cost modifying rule (Delling et al., 2009); the “Electrical flows", "description": "This table compares the success rates of two classical semantic routing methods on a waypoint routing task from the benchmark dataset.  The methods are: \n\n1. **Cost Modifiers:**  This method adjusts edge weights based on user preferences and then uses a shortest-path algorithm.  The success rate is reported as 0% because it failed to produce any successful routes that meet the benchmark criteria.\n2. **Electrical Flows (4096 routes):** This method uses electrical flows to sample multiple candidate routes (4096 in this case) and checks if any satisfy the query.  The success rate is reported as 1.3%, suggesting very low success using this approach.\nThe low success rates highlight the limitations of classical methods for handling complex semantic routing tasks, setting the stage for the learning-based approach presented in the paper.", "section": "2 A Benchmark for Semantic Routing"}, {"figure_path": "JvlrUFJMbI/tables/tables_17_3.jpg", "caption": "Table 1: This table depicts the success rate of classical semantic routing methods (named in the \"Baseline\" column) on waypoint routing task sampled from our benchmark. We define a method as being successful if it returns at least one route that visits points-of-interest that together fulfill each part of the user's query. The “cost modifiers” method returns every route that can be elicited by a cost modifying rule (Delling et al., 2009); the “Electrical flows” method returns 4,096 routes sampled with the electrical flows algorithm (Sinop et al., 2021). ± denotes standard error (n=100).", "description": "This table compares the success rate of two classical semantic routing methods against a waypoint routing task from the benchmark dataset.  It shows that classical methods (cost modifiers and electrical flows) perform poorly (0% and 1.3% success rate, respectively) on this complex task, highlighting the need for a novel approach.", "section": "2. A Benchmark for Semantic Routing"}]