[{"figure_path": "pnmUiVAGnv/tables/tables_6_1.jpg", "caption": "Table 1: Organ segmentation performance on FLARE22. The results(%) are evaluated by DSC. Scores of SAM-based are adopted from the CT-SAM-Med3D [41]. † denotes obtained via the official pre-trained weights. * means implemented from the official code and trained on the same dataset. Abbreviations: “Liv.”-Liver, “R_Kid.”-Right Kidney, “Spl.”-Spleen, “Pan.”-Pancreas, “Aor.”-Aorta, “IVC”-Inferior Vena Cava, “RAG”-Right Adrenal Gland, “LAG”-Left Adrenal Gland, “Gal.”-Gallbladder, “Eso.”-Esophagus, “Sto.”-Stomach, “Duo.”-Duodenum, “L_Kid.”-Inferior Vena Cava.", "description": "This table presents a comparison of the organ segmentation performance of the proposed CAT model against several state-of-the-art methods on the FLARE22 dataset.  The performance is measured using the Dice Similarity Coefficient (DSC), a common metric for evaluating segmentation accuracy. The table shows DSC scores for 12 different abdominal organs, highlighting CAT's superior performance compared to other methods, especially those based on adapting the Segment Anything Model (SAM).  Abbreviations are provided to clarify the organ names.", "section": "4.1 Main Results"}, {"figure_path": "pnmUiVAGnv/tables/tables_6_2.jpg", "caption": "Table 2: Segmentation performance (%) of tumors on MSD [59] and In-house dataset. We compare our method with traditional and promptable methods. † denotes obtained via the official pre-trained weights. * means implemented from the official code and trained on the same dataset.", "description": "This table presents a comparison of the segmentation performance of different methods on two datasets: the MSD dataset (tumors in the abdomen) and an in-house dataset (colon tumors).  The metrics used are Dice Similarity Coefficient (DSC) and Hausdorff Distance (HD95). The table compares the performance of the proposed CAT model against several baselines, including nnUNet, Swin UNETR, SAM-Med3D+, SegVol, Universal, and ZePT.  The results are broken down by tumor type and dataset, allowing for a detailed analysis of the model's performance across various scenarios.", "section": "4.1 Main Results"}, {"figure_path": "pnmUiVAGnv/tables/tables_8_1.jpg", "caption": "Table 3: Ablation studies of two prompts and model designs on organ and tumor segmentation dataset.", "description": "This table presents the results of ablation studies conducted to evaluate the contribution of different components of the proposed model.  It shows the performance of organ and tumor segmentation tasks under various configurations, including the presence or absence of anatomical and textual prompts, and the usage of hard or soft attention mechanisms. The goal is to demonstrate the individual and combined impact of these components on the overall performance of the model.", "section": "4.2 Ablation Studies"}, {"figure_path": "pnmUiVAGnv/tables/tables_14_1.jpg", "caption": "Table 1: Organ segmentation performance on FLARE22. The results (%) are evaluated by DSC. Scores of SAM-based are adopted from the CT-SAM-Med3D [41]. † denotes obtained via the official pre-trained weights. * means implemented from the official code and trained on the same dataset. Abbreviations: “Liv.”-Liver, “R_Kid.”-Right Kidney, “Spl.”-Spleen, “Pan.”-Pancreas, “Aor.”-Aorta, “IVC”-Inferior Vena Cava, “RAG”-Right Adrenal Gland, “LAG”-Left Adrenal Gland, “Gal.”-Gallbladder, “Eso.”-Esophagus, “Sto.”-Stomach, “Duo.”-Duodenum, “L_Kid.”-Inferior Vena Cava.", "description": "This table presents a comparison of the organ segmentation performance of the proposed CAT model against several existing methods on the FLARE22 dataset.  The performance is measured using the Dice Similarity Coefficient (DSC), a common metric for evaluating segmentation accuracy. The table includes results for 12 different abdominal organs and shows that CAT significantly outperforms existing methods in most cases.", "section": "4.1 Main Results"}, {"figure_path": "pnmUiVAGnv/tables/tables_15_1.jpg", "caption": "Table 1: Organ segmentation performance on FLARE22. The results (%) are evaluated by DSC. Scores of SAM-based are adopted from the CT-SAM-Med3D [41]. † denotes obtained via the official pre-trained weights. * means implemented from the official code and trained on the same dataset. Abbreviations: “Liv.”-Liver, “R_Kid.”-Right Kidney, “Spl.”-Spleen, “Pan.”-Pancreas, “Aor.”-Aorta, “IVC”-Inferior Vena Cava, “RAG”-Right Adrenal Gland, “LAG”-Left Adrenal Gland, “Gal.”-Gallbladder, “Eso.”-Esophagus, “Sto.”-Stomach, “Duo.”-Duodenum, “L_Kid.”-Inferior Vena Cava.", "description": "This table presents a comparison of the organ segmentation performance of the proposed CAT model against several other state-of-the-art methods on the FLARE22 dataset.  The evaluation metric used is the Dice Similarity Coefficient (DSC), which measures the overlap between the predicted segmentation mask and the ground truth.  The table includes results for 12 different abdominal organs, and the abbreviations used for each organ are explicitly defined in the caption.", "section": "4.1 Main Results"}, {"figure_path": "pnmUiVAGnv/tables/tables_15_2.jpg", "caption": "Table 1: Organ segmentation performance on FLARE22. The results (%) are evaluated by DSC. Scores of SAM-based are adopted from the CT-SAM-Med3D [41]. † denotes obtained via the official pre-trained weights. * means implemented from the official code and trained on the same dataset. Abbreviations: “Liv.”-Liver, “R_Kid.”-Right Kidney, “Spl.”-Spleen, “Pan.”-Pancreas, “Aor.”-Aorta, “IVC”-Inferior Vena Cava, “RAG”-Right Adrenal Gland, “LAG”-Left Adrenal Gland, “Gal.”-Gallbladder, “Eso.”-Esophagus, “Sto.”-Stomach, “Duo.”-Duodenum, “L_Kid.”-Inferior Vena Cava.", "description": "This table presents the performance comparison of different models on the FLARE22 dataset for organ segmentation. The performance metric used is Dice Similarity Coefficient (DSC). The results show CAT's superior performance compared to other state-of-the-art methods in most organs.", "section": "4.1 Main Results"}, {"figure_path": "pnmUiVAGnv/tables/tables_15_3.jpg", "caption": "Table 2: Segmentation performance (%) of tumors on MSD [59] and In-house dataset. We compare our method with traditional and promptable methods. † denotes obtained via the official pre-trained weights. * means implemented from the official code and trained on the same dataset.", "description": "This table presents the segmentation performance results for various tumor types using different methods.  It compares the proposed CAT method with several baselines, including traditional methods (nnUNet, Swin UNETR) and other prompt-based methods (SAM-Med3D, SegVol, Universal, ZePT). The performance is evaluated using the Dice Similarity Coefficient (DSC) metric on two datasets: the MSD dataset (tumors in the abdomen) and an in-house dataset (colon tumors in different stages). The table shows the DSC scores for each method on various tumor types (liver, pancreas, hepatic vessel, colon) for the MSD dataset, as well as for different colon tumor stages (T1-T4) in the in-house dataset. The average DSC across all tumors is also presented for each method.", "section": "4.1 Main Results"}]