[{"figure_path": "biAqUbAuG7/figures/figures_4_1.jpg", "caption": "Figure 1: Update size of Adam and Adam-Rel versus k when considering nonstationary gradients. Assumes that optimization starts at time -t', which is large, and that the gradients up until time 0 are g and then there is an increase in the gradient to kg.", "description": "This figure compares the update size of Adam and Adam-Rel over time (t) for various scaling factors (k) applied to the gradient after a time step of 0.  The top panel shows Adam's behavior, illustrating that large updates occur after the gradient change, especially when the k value is large, demonstrating the effect of non-stationarity.  The bottom panel shows Adam-Rel, highlighting that the update size remains bounded and converges to approximately 1, even with significant gradient changes.", "section": "3 Nonstationary Optimization with Adam"}, {"figure_path": "biAqUbAuG7/figures/figures_4_2.jpg", "caption": "Figure 1: Update size of Adam and Adam-Rel versus k when considering nonstationary gradients. Assumes that optimization starts at time -t', which is large, and that the gradients up until time 0 are g and then there is an increase in the gradient to kg.", "description": "This figure shows how the update size of the Adam and Adam-Rel optimizers change over time when there is a sudden increase in the gradient magnitude.  The x-axis represents the timestep, and the y-axis represents the update size.  The figure shows that Adam produces much larger updates after the gradient increase than Adam-Rel, which maintains a relatively stable update size. This demonstrates how Adam-Rel handles non-stationarity better than Adam.", "section": "Nonstationary Optimization with Adam"}, {"figure_path": "biAqUbAuG7/figures/figures_5_1.jpg", "caption": "Figure 2: Performance of Adam-Rel, Adam, Adam-MR, and Adam (β₁ = β2) for PPO and Adam, Adam-MR and Adam-Rel for DQN on Atari-57 and Atari-10 respectively. Atari-10 uses a subset of Atari tasks to estimate median performance across the whole suite. Details can be found in [14]. Error bars are 95% stratified bootstrapped confidence intervals. Results are across 10 seeds except for Adam (β₁ = β2), which is 3 seeds.", "description": "This figure compares the performance of four different Adam-based optimization methods (Adam, Adam-Rel, Adam-MR, and Adam with β₁=β2) on two reinforcement learning tasks: Atari-57 (using Proximal Policy Optimization or PPO) and Atari-10 (using Deep Q-Network or DQN).  The Atari-10 results show the median performance across a subset of the Atari games. The chart displays the human-normalized scores for each method, with error bars indicating the 95% confidence intervals.  The results show the relative effectiveness of each Adam variant in improving performance compared to standard Adam, highlighting the improvement offered by Adam-Rel.", "section": "5.2 Off-policy RL"}, {"figure_path": "biAqUbAuG7/figures/figures_6_1.jpg", "caption": "Figure 3: PPO on Craftax-1B comparison of Adam-Rel against Adam, Adam-MR, and Adam with β₁ = β2 [16]. Bars show the 95% stratified bootstrap confidence interval, with mean marked, over 8 seeds [22].", "description": "This figure compares the performance of four different optimization algorithms (Adam, Adam-Rel, Adam-MR, and Adam with β₁ = β2) used in the Proximal Policy Optimization (PPO) algorithm on the Craftax-1B environment.  The performance metrics shown are the number of achievements, score (geometric mean of success rates for achievements), success rate of collecting diamonds, and success rate of eating plants. Adam-Rel demonstrates consistent improvement over the other methods.", "section": "5.3 On-policy RL"}, {"figure_path": "biAqUbAuG7/figures/figures_6_2.jpg", "caption": "Figure 4: Performance Profile of Adam and Adam-Rel on Atari-57. Error bars represent the standard error across 10 seeds. Green-shaded areas represent Adam-Rel outperforming Adam and red-shaded areas the opposite.", "description": "This figure shows the performance profile of Adam and Adam-Rel on Atari-57, comparing the fraction of runs achieving a score greater than a certain human-normalized score (τ).  The shaded areas highlight where one method surpasses the other. The key takeaway is Adam-Rel's significant performance improvement over Adam, especially in the higher-performing percentile, indicating its ability to enhance performance in challenging tasks without compromising performance on simpler tasks.", "section": "5.4 Method Analysis"}, {"figure_path": "biAqUbAuG7/figures/figures_7_1.jpg", "caption": "Figure 1: Update size of Adam and Adam-Rel versus k when considering nonstationary gradients. Assumes that optimization starts at time -t', which is large, and that the gradients up until time 0 are g and then there is an increase in the gradient to kg.", "description": "This figure shows the update size of both Adam and Adam-Rel plotted against time (t) for different values of k.  The parameter k represents a sudden increase in the gradient magnitude at time t=0. The top plot shows the update size for Adam, demonstrating a large peak exceeding 1 before converging back to 1.  The bottom plot shows Adam-Rel's update size which stays bounded close to 1, highlighting the advantage of using relative timesteps in handling non-stationary gradients.", "section": "Nonstationary Optimization with Adam"}, {"figure_path": "biAqUbAuG7/figures/figures_14_1.jpg", "caption": "Figure 1: Update size of Adam and Adam-Rel versus k when considering nonstationary gradients. Assumes that optimization starts at time -t', which is large, and that the gradients up until time 0 are g and then there is an increase in the gradient to kg.", "description": "This figure shows the update size of the Adam and Adam-Rel optimizers plotted against time (t) for different values of k, which represents the factor by which the gradient increases at time t=0.  The top plot shows that when using Adam, a sudden increase in the gradient (large k) leads to an overshoot in the update size before slowly converging back to 1. The bottom plot shows that Adam-Rel avoids this overshoot, maintaining an update size near 1 even for large k.  This demonstrates Adam-Rel's ability to handle non-stationary gradients.", "section": "3 Nonstationary Optimization with Adam"}, {"figure_path": "biAqUbAuG7/figures/figures_14_2.jpg", "caption": "Figure 6: Comparison of the inter-quartile mean and median of Adam-MR, Adam-Rel and Adam on the Atari games evaluated on in Asadi et al. [10].", "description": "This figure compares the performance of three Adam variants (Adam-MR, Adam-Rel, and Adam) on the Atari games used in the Asadi et al. [10] study. The performance is measured using two metrics: the interquartile mean (IQM) and the median. The IQM represents the average performance excluding extreme outliers, while the median provides a robust central tendency measure. The results show that Adam-Rel generally outperforms the baselines.", "section": "5.2 Off-policy RL"}]