[{"figure_path": "kK23oMGe9g/tables/tables_9_1.jpg", "caption": "Table 2: Image-noise data-point L2 distance reduction after the assignment for minimizing it and the time cost for the assignment.", "description": "This table shows the percentage reduction in the L2 distance between image and noise data points after applying the linear assignment method, for different batch sizes.  It also shows the time taken for the assignment process in milliseconds (ms). The negative percentage indicates a reduction in distance, suggesting the effectiveness of the assignment in bringing images and their corresponding noise closer together.", "section": "4.3 Discussion"}, {"figure_path": "kK23oMGe9g/tables/tables_13_1.jpg", "caption": "Table 3: Immiscible Diffusion boosts training efficiency for Consistency Model on CIFAR-10 dataset.", "description": "This table shows the training steps required to achieve different FID thresholds for both the baseline Consistency Model and the Immiscible Consistency Model on the CIFAR-10 dataset.  The Immiscible Consistency Model requires significantly fewer training steps to reach the same FID score, demonstrating its improved training efficiency.", "section": "A.1.1 Quantitative Training Efficiency Improvements for Immiscible Consistency Model"}, {"figure_path": "kK23oMGe9g/tables/tables_13_2.jpg", "caption": "Table 4: FID improvements of Immiscible DDIM with different inference steps", "description": "This table presents the FID (Fréchet Inception Distance) scores achieved by both baseline DDIM and Immiscible DDIM models, trained using different numbers of inference steps (1000, 500, 100, 50, and 20).  The ΔFID column shows the improvement in FID scores obtained by using the Immiscible DDIM method compared to the baseline DDIM.  Lower FID scores indicate better image quality.", "section": "A.1.2 Quantitative FID Improvements for Immiscible DDIM with Different Inference Steps"}, {"figure_path": "kK23oMGe9g/tables/tables_13_3.jpg", "caption": "Table 5: FID of using L1 or L2 norm for noise assignment in immiscible DDIM on CIFAR-10.", "description": "This table presents the FID scores achieved by the standard DDIM and the proposed Immiscible DDIM method using both L1 and L2 norms for noise assignment on the CIFAR-10 dataset.  The FID score is a metric used to evaluate the quality of generated images, with lower scores indicating better image quality. The table shows FID scores at various training steps (70.2k, 93.6k, 117.0k, 140.4k, and 163.8k).  The results allow for comparison of performance between the standard DDIM and the Immiscible DDIM variations and the effect of different norm choices for noise assignment.", "section": "A.1.3 Ablation on the Distance Measurement Methods in Noise Assignment"}]