[{"figure_path": "Z0wIbVTBXc/figures/figures_6_1.jpg", "caption": "Figure 1: Comparison of trajectories between the data distribution (on the left) and the prior distribution (on the right), as learned by conventional diffusion and NFDM-OT.", "description": "This figure compares the trajectories learned by conventional diffusion models (Score SDE) and the proposed NFDM-OT method.  The left side shows trajectories from the data distribution, while the right displays those from the prior distribution.  NFDM-OT, by learning the forward process, significantly reduces the curvature of the reverse process's trajectories, leading to more direct paths between the prior and data distributions. This illustrates NFDM-OT's ability to improve sampling speed and efficiency.", "section": "6 Experiments"}, {"figure_path": "Z0wIbVTBXc/figures/figures_8_1.jpg", "caption": "Figure 2: Trajectories of NFBM between two-dimensional data distributions, trained with an additional penalty to avoid obstacles.", "description": "This figure visualizes the learned stochastic trajectories of Neural Flow Bridge Models (NFBM) trained with an additional penalty to avoid obstacles.  The left panel shows the trajectories without obstacles, while the right shows trajectories trained to avoid an obstacle represented by the central circular region.  Different colors represent trajectories starting from different initial distributions.  The figure demonstrates the NFBM's capability to learn generative dynamics with specific properties, in this case, obstacle avoidance.", "section": "6.3 Bridges"}, {"figure_path": "Z0wIbVTBXc/figures/figures_26_1.jpg", "caption": "Figure 3: First coordinates of forward deterministic trajectories of NFDM-OT started from points x = (-1, -1) and x = (1, 1).", "description": "This figure shows the first coordinates of forward deterministic trajectories generated by NFDM-OT. Two starting points, (-1, -1) and (1, 1), are used, and multiple trajectories are plotted to show the variability. The trajectories illustrate the impact of the curvature penalty, which encourages straight-line paths.", "section": "G.1 Visualisations of Forward Trajectories of NFDM-OT"}, {"figure_path": "Z0wIbVTBXc/figures/figures_27_1.jpg", "caption": "Figure 4: Generated samples from NFDM trained on various datasets.", "description": "This figure shows samples generated from the NFDM model trained on CIFAR-10, ImageNet 32x32, and ImageNet 64x64 datasets.  It visually demonstrates the model's ability to generate images representative of each dataset's characteristics.", "section": "6.1 Likelihood Estimation"}, {"figure_path": "Z0wIbVTBXc/figures/figures_27_2.jpg", "caption": "Figure 4: Generated samples from NFDM trained on various datasets.", "description": "This figure shows samples generated from the NFDM model trained on CIFAR-10, ImageNet 32, and ImageNet 64 datasets. The samples demonstrate the model's ability to generate high-quality images across different datasets.", "section": "6.1 Likelihood Estimation"}, {"figure_path": "Z0wIbVTBXc/figures/figures_27_3.jpg", "caption": "Figure 6: Generative trajectories from NFBM trained on AFHQ 64.", "description": "This figure visualizes the generative trajectories learned by the Neural Flow Bridge Models (NFBM) when trained on the AFHQ dataset.  The NFBM is a modified version of the Neural Flow Diffusion Model (NFDM) designed to learn mappings between two different distributions. In this case, it learns to translate images of dogs into images of cats. The figure shows a sequence of images generated along the trajectory, starting from a dog image at time t=1 and progressing to a cat image at time t=0. Each column represents a different sample, while each row illustrates the transformation at different time steps (t). The smooth transition demonstrates NFBM's ability to learn a continuous transformation between the two data distributions while avoiding abrupt changes.", "section": "6.3 Bridges"}]