[{"figure_path": "3cb6pF3Tvf/figures/figures_4_1.jpg", "caption": "Figure 1: Illustration for Lemma 4.4. The shaded rectangle is the valid time of a Bahncard purchased by OPT.", "description": "This figure illustrates Lemma 4.4, which states that if a time interval [t, t+T) overlaps with an off phase, and the costs in the preceding on phase (s2), off phase (s3), and succeeding on phase (s4) are less than or equal to γ and γ, respectively, then the total cost in [t,t+T) is at most 2γ+η.  The shaded rectangle represents the time period when OPT (optimal offline algorithm) has a valid Bahncard. The figure visually depicts the different cost components (s2, s3, s4) and their relationship to the Lemma. ", "section": "4.3 PFSUM Algorithm"}, {"figure_path": "3cb6pF3Tvf/figures/figures_5_1.jpg", "caption": "Figure 2: All the 6 patterns of concerned time intervals in which either PFSUM or OPT has a Bahncard. In Patterns III to VI, x is the number of Bahncards purchased by OPT in an on phase and expiring in the next on phase. x can be any non-negative integer.", "description": "This figure shows six different patterns of time intervals where at least one of the two algorithms (PFSUM and OPT) has a valid Bahncard.  The patterns illustrate the various ways the Bahncard validity periods of PFSUM and OPT can overlap.  The 'x' variable represents the number of Bahncards purchased by OPT within a specific pattern, highlighting the potential variations in Bahncard usage strategies between the two algorithms.", "section": "4 Learning-Augmented Algorithms for the Bahncard Problem"}, {"figure_path": "3cb6pF3Tvf/figures/figures_6_1.jpg", "caption": "Figure 2: All the 6 patterns of concerned time intervals in which either PFSUM or OPT has a Bahncard. In Patterns III to VI, x is the number of Bahncards purchased by OPT in an on phase and expiring in the next on phase. x can be any non-negative integer.", "description": "This figure illustrates six patterns of time intervals where at least one of the two algorithms (PFSUM and OPT) has a valid Bahncard.  Patterns I through VI represent various overlapping scenarios of Bahncard validity between PFSUM and OPT,  with 'x' denoting the number of Bahncards purchased by OPT within a specific time frame. This is crucial for the divide-and-conquer analysis in the paper to determine the competitive ratio.", "section": "4.3 PFSUM Algorithm"}, {"figure_path": "3cb6pF3Tvf/figures/figures_8_1.jpg", "caption": "Figure 4: The cost ratios for commuters (β = 0.8, T = 10, C = 100). “U”, “N” and “P” represent Uniform, Normal and Pareto ticket price distributions respectively.", "description": "This figure compares the performance of several algorithms for the Bahncard problem in the context of commuters.  The x-axis represents the perturbing probability (noise in predictions), and the y-axis represents the average cost ratio.  Three different ticket price distributions (Uniform, Normal, and Pareto) are shown.  The algorithms compared include SUM, FSUM, SUMw, PFSUM, PDLA (with different λ values), and SRL (with different λ values). The shaded area represents 95% confidence intervals.", "section": "5 Experiments"}, {"figure_path": "3cb6pF3Tvf/figures/figures_8_2.jpg", "caption": "Figure 5: The cost ratios for occasional travelers (β = 0.8, T = 10, C = 100). “U”, “N” and “P” represent Uniform, Normal and Pareto ticket price distributions respectively.", "description": "This figure presents the results of experiments conducted to evaluate the performance of different algorithms for occasional travelers using three different ticket price distributions: Uniform, Normal, and Pareto.  The x-axis represents the perturbation probability (noise added to predictions), and the y-axis represents the average cost ratio of each algorithm against an optimal offline algorithm.  The shaded area shows the 95% confidence interval. The goal is to show how the algorithms' performance changes under different levels of prediction noise.", "section": "5 Experiments"}, {"figure_path": "3cb6pF3Tvf/figures/figures_9_1.jpg", "caption": "Figure 4: The cost ratios for commuters (β = 0.8, T = 10, C = 100). “U”, “N” and “P” represent Uniform, Normal and Pareto ticket price distributions respectively.", "description": "This figure shows the average cost ratio for different algorithms (SUM, PFSUM, SUMw, FSUM, PDLA, SRL) with different prediction error levels (perturbation probability).  The cost ratio is calculated as the ratio of the cost of the online algorithm to the cost of the optimal offline algorithm. Three different ticket price distributions (Uniform, Normal, Pareto) are considered.", "section": "5 Experiments"}, {"figure_path": "3cb6pF3Tvf/figures/figures_9_2.jpg", "caption": "Figure 5: The cost ratios for occasional travelers (β = 0.8, T = 10, C = 100). “U”, “N” and “P” represent Uniform, Normal and Pareto ticket price distributions respectively.", "description": "This figure compares the performance of different algorithms in the Bahncard problem for occasional travelers under different ticket price distributions (Uniform, Normal, and Pareto).  The x-axis represents the perturbation probability (noise level in the prediction), and the y-axis represents the average cost ratio (algorithm cost / optimal cost). The shaded area shows the 95% confidence interval.  It demonstrates the relative cost-effectiveness of the algorithms across varying prediction accuracy and distribution types.", "section": "5 Experiments"}, {"figure_path": "3cb6pF3Tvf/figures/figures_13_1.jpg", "caption": "Figure 8: An example where the shaded rectangle (resp. bold line) is the valid time of a Bahncard purchased by SUM (resp. OPT). SUMw purchases a Bahncard at t₁ because t2 < t1 + w and € + (γ – €) ≥ γ. SUMw does not purchase a Bahncard at t3 since t3 + w < t5 and SUM(σ; (t3 + w – T, t3]) + ĉ(σ; (t3, t3 + w]) = (γ − 2€) + € < γ. SUMw purchases a Bahncard at t4 because t3, t4, t5 ∈ (t4 + w – T, t4 + w] and the total ticket cost is y.", "description": "This figure shows an example to illustrate that the consistency of SUMw is at least (3-β)/(1+β). It shows the travel request sequence, the valid time of the Bahncard purchased by SUMw and OPT, and the total cost.  The figure demonstrates a scenario where SUMw makes suboptimal decisions due to its cost consideration focusing only on the past and predicted costs.", "section": "4.1 Initial Attempt"}, {"figure_path": "3cb6pF3Tvf/figures/figures_14_1.jpg", "caption": "Figure 2: All the 6 patterns of concerned time intervals in which either PFSUM or OPT has a Bahncard. In Patterns III to VI, x is the number of Bahncards purchased by OPT in an on phase and expiring in the next on phase. x can be any non-negative integer.", "description": "This figure illustrates six patterns of time intervals where either PFSUM or OPT has a valid Bahncard.  The intervals are categorized based on the overlap of Bahncard validity periods between PFSUM and OPT.  Patterns I to VI show different scenarios of how the Bahncard purchase times and validities of PFSUM and OPT interact, with 'x' representing the number of Bahncards purchased by OPT within a specific time range.  Understanding these patterns is crucial for analyzing the competitive ratio of PFSUM.", "section": "4 Learning-Augmented Algorithms for the Bahncard Problem"}, {"figure_path": "3cb6pF3Tvf/figures/figures_16_1.jpg", "caption": "Figure 2: All the 6 patterns of concerned time intervals in which either PFSUM or OPT has a Bahncard. In Patterns III to VI, x is the number of Bahncards purchased by OPT in an on phase and expiring in the next on phase. x can be any non-negative integer.", "description": "This figure illustrates six patterns of time intervals where at least one of PFSUM and OPT has a valid Bahncard.  The patterns are categorized based on how the Bahncard validity periods of PFSUM and OPT overlap.  The key difference highlighted is the variable 'x', representing the number of Bahncards purchased by OPT during an \"on\" phase that expire in the subsequent \"on\" phase. This variable helps in analyzing the cost ratio between PFSUM and OPT across different scenarios.", "section": "4 Learning-Augmented Algorithms for the Bahncard Problem"}, {"figure_path": "3cb6pF3Tvf/figures/figures_17_1.jpg", "caption": "Figure 2: All the 6 patterns of concerned time intervals in which either PFSUM or OPT has a Bahncard. In Patterns III to VI, x is the number of Bahncards purchased by OPT in an on phase and expiring in the next on phase. x can be any non-negative integer.", "description": "This figure illustrates six different patterns of time intervals where either PFSUM or OPT (the optimal offline algorithm) has a valid Bahncard.  The intervals are categorized based on the overlap between PFSUM's and OPT's Bahncard validity periods.  Patterns I-VI represent various scenarios, including complete overlap (Pattern I), no overlap (Pattern II), and partial overlaps starting and ending in different phases (on or off, Patterns III-VI). The variable 'x' in Patterns III-VI represents the number of Bahncards OPT purchases in one on phase that expire in a subsequent on phase.", "section": "4 Learning-Augmented Algorithms for the Bahncard Problem"}, {"figure_path": "3cb6pF3Tvf/figures/figures_19_1.jpg", "caption": "Figure 2: All the 6 patterns of concerned time intervals in which either PFSUM or OPT has a Bahncard. In Patterns III to VI, x is the number of Bahncards purchased by OPT in an on phase and expiring in the next on phase. x can be any non-negative integer.", "description": "This figure illustrates six different patterns of time intervals where either PFSUM or OPT (the optimal offline algorithm) holds a valid Bahncard.  The intervals are analyzed to determine the competitive ratio of PFSUM.  Pattern I shows complete overlap between PFSUM and OPT Bahncard validity periods. Patterns II-VI show various scenarios of overlap and non-overlap between PFSUM and OPT Bahncard periods, with 'x' representing the number of Bahncards purchased by OPT within a specific pattern.", "section": "4 Learning-Augmented Algorithms for the Bahncard Problem"}, {"figure_path": "3cb6pF3Tvf/figures/figures_19_2.jpg", "caption": "Figure 2: All the 6 patterns of concerned time intervals in which either PFSUM or OPT has a Bahncard. In Patterns III to VI, x is the number of Bahncards purchased by OPT in an on phase and expiring in the next on phase. x can be any non-negative integer.", "description": "This figure illustrates six different patterns of time intervals where either PFSUM or OPT (optimal offline algorithm) has a valid Bahncard.  The intervals are categorized based on the overlap and positioning of Bahncard validity periods for both algorithms.  Pattern I shows a complete overlap, while Patterns II through VI represent various degrees of overlap and placement, with 'x' representing the number of Bahncards purchased by OPT during an 'on' phase and expiring in a subsequent 'on' phase. This categorization is crucial for the divide-and-conquer analysis of PFSUM's competitive ratio.", "section": "4 Learning-Augmented Algorithms for the Bahncard Problem"}, {"figure_path": "3cb6pF3Tvf/figures/figures_21_1.jpg", "caption": "Figure 1: Illustration for Lemma 4.4. The shaded rectangle is the valid time of a Bahncard purchased by OPT.", "description": "This figure illustrates Lemma 4.4, which discusses the cost ratio between PFSUM and OPT. The shaded area shows the Bahncard's validity period purchased by OPT. The figure shows three phases: an on phase where OPT has a Bahncard, an off phase where neither OPT nor PFSUM has a Bahncard, and another on phase where OPT has a Bahncard.  The lemma analyzes the total regular costs (s2, s3, s4) in these phases to establish an upper bound on the cost ratio.", "section": "4.3 PFSUM Algorithm"}, {"figure_path": "3cb6pF3Tvf/figures/figures_22_1.jpg", "caption": "Figure 2: All the 6 patterns of concerned time intervals in which either PFSUM or OPT has a Bahncard. In Patterns III to VI, x is the number of Bahncards purchased by OPT in an on phase and expiring in the next on phase. x can be any non-negative integer.", "description": "This figure illustrates six different patterns of time intervals where either PFSUM or OPT (optimal offline algorithm) has a valid Bahncard.  These patterns are used in the analysis of the competitive ratio of PFSUM. Pattern I shows a complete overlap of Bahncard validity between PFSUM and OPT.  Patterns II through VI depict scenarios where the Bahncard validity intervals overlap partially, with varying degrees of overlap and timing differences. The 'x' variable in Patterns III-VI represents the number of Bahncards OPT purchases during a particular time segment.  These patterns are crucial to the divide-and-conquer approach used in the paper to analyze the competitive ratio of PFSUM.", "section": "4 Learning-Augmented Algorithms for the Bahncard Problem"}, {"figure_path": "3cb6pF3Tvf/figures/figures_24_1.jpg", "caption": "Figure 1: Illustration for Lemma 4.4. The shaded rectangle is the valid time of a Bahncard purchased by OPT.", "description": "This figure illustrates Lemma 4.4, which discusses the cost analysis of the PFSUM algorithm.  It shows a timeline divided into an \"on\" phase (when a Bahncard is valid) and an \"off\" phase (when no Bahncard is valid).  A Bahncard is purchased by the optimal offline algorithm (OPT) at some point. The shaded area represents the duration the OPT's Bahncard is valid. The figure depicts how the costs (s2, s3, s4) in different segments of the timeline are used in the Lemma's proof, particularly focusing on the scenario where the T-future cost (c(σ;[t, t+T)) < γ and providing bounds related to the costs when 0 ≤ η ≤ γ and when η > γ, where η is the maximum prediction error.", "section": "4.3 PFSUM Algorithm"}, {"figure_path": "3cb6pF3Tvf/figures/figures_24_2.jpg", "caption": "Figure 2: All the 6 patterns of concerned time intervals in which either PFSUM or OPT has a Bahncard. In Patterns III to VI, x is the number of Bahncards purchased by OPT in an on phase and expiring in the next on phase. x can be any non-negative integer.", "description": "This figure illustrates six different patterns of time intervals where either PFSUM or OPT (the optimal offline algorithm) has a valid Bahncard.  Each pattern shows the relative timing of Bahncard purchases by both algorithms.  The key feature is the variable 'x' in patterns III-VI, which represents the number of Bahncards purchased by OPT within a specific time window and impacting the overall cost comparison between the two algorithms.", "section": "4 Learning-Augmented Algorithms for the Bahncard Problem"}, {"figure_path": "3cb6pF3Tvf/figures/figures_27_1.jpg", "caption": "Figure 1: Illustration for Lemma 4.4. The shaded rectangle is the valid time of a Bahncard purchased by OPT.", "description": "This figure illustrates Lemma 4.4, which discusses the total regular cost in a time interval that overlaps with an off phase.  The figure shows a timeline divided into on and off phases representing when a Bahncard is valid for PFSUM and OPT. The shaded rectangle indicates the valid period of a Bahncard purchased by OPT. The labels s2, s3, and s4 represent the total regular costs in the preceding on phase, the off phase, and the succeeding on phase, respectively.  The Lemma demonstrates an upper bound on the sum of these costs (s2 + s3 + s4) under certain conditions.", "section": "4.3 PFSUM Algorithm"}, {"figure_path": "3cb6pF3Tvf/figures/figures_27_2.jpg", "caption": "Figure 2: All the 6 patterns of concerned time intervals in which either PFSUM or OPT has a Bahncard. In Patterns III to VI, x is the number of Bahncards purchased by OPT in an on phase and expiring in the next on phase. x can be any non-negative integer.", "description": "This figure illustrates six different patterns of time intervals where either PFSUM or OPT (an optimal offline algorithm) has a valid Bahncard.  The intervals are categorized based on how the valid periods of Bahncards purchased by PFSUM and OPT overlap.  Patterns III through VI show scenarios where OPT purchases multiple Bahncards within a longer time frame, impacting the comparison of PFSUM's performance against OPT. The variable 'x' represents the number of Bahncards purchased by OPT during these overlapping periods.", "section": "4 Learning-Augmented Algorithms for the Bahncard Problem"}, {"figure_path": "3cb6pF3Tvf/figures/figures_30_1.jpg", "caption": "Figure 2: All the 6 patterns of concerned time intervals in which either PFSUM or OPT has a Bahncard. In Patterns III to VI, x is the number of Bahncards purchased by OPT in an on phase and expiring in the next on phase. x can be any non-negative integer.", "description": "This figure illustrates six patterns of time intervals where at least one of the two algorithms (PFSUM and OPT) has a valid Bahncard.  The patterns are categorized based on how the Bahncard validity periods of PFSUM and OPT overlap.  Pattern I shows complete overlap, while Patterns II through VI show various partial overlaps. The variable 'x' represents the number of Bahncards purchased by OPT during specific overlapping phases, providing further detail on the timing of Bahncard purchases by OPT relative to PFSUM.", "section": "4 Learning-Augmented Algorithms for the Bahncard Problem"}, {"figure_path": "3cb6pF3Tvf/figures/figures_32_1.jpg", "caption": "Figure 2: All the 6 patterns of concerned time intervals in which either PFSUM or OPT has a Bahncard. In Patterns III to VI, x is the number of Bahncards purchased by OPT in an on phase and expiring in the next on phase. x can be any non-negative integer.", "description": "This figure illustrates six different patterns of time intervals where either PFSUM or OPT (an optimal offline algorithm) possesses a valid Bahncard.  The patterns categorize how the Bahncard validity periods of PFSUM and OPT overlap.  Pattern I shows complete overlap, while patterns II through VI show various degrees of partial overlap. The variable 'x' represents the number of Bahncards purchased by OPT during specific overlapping scenarios, providing a more nuanced understanding of the cost comparisons between the two algorithms.", "section": "4 Learning-Augmented Algorithms for the Bahncard Problem"}, {"figure_path": "3cb6pF3Tvf/figures/figures_35_1.jpg", "caption": "Figure 2: All the 6 patterns of concerned time intervals in which either PFSUM or OPT has a Bahncard. In Patterns III to VI, x is the number of Bahncards purchased by OPT in an on phase and expiring in the next on phase. x can be any non-negative integer.", "description": "This figure illustrates six patterns of time intervals where either PFSUM or OPT (an optimal offline algorithm) has a valid Bahncard.  Each pattern represents different combinations of when each algorithm purchases Bahncards and their validity periods.  The patterns are essential for analyzing the competitive ratio of PFSUM in the paper.  The variable 'x' in patterns III-VI represents the number of Bahncards purchased by OPT within a specific timeframe and is crucial for the analysis of these patterns.", "section": "4.3 PFSUM Algorithm"}, {"figure_path": "3cb6pF3Tvf/figures/figures_38_1.jpg", "caption": "Figure 4: The cost ratios for commuters (β = 0.8, T = 10, C = 100). “U”, “N” and “P” represent Uniform, Normal and Pareto ticket price distributions respectively.", "description": "This figure compares the performance of various algorithms for the Bahncard problem under different ticket price distributions (Uniform, Normal, and Pareto) for commuter scenarios.  The x-axis shows the perturbing probability, representing the level of prediction error, and the y-axis shows the average cost ratio compared to an optimal offline algorithm.  The lines represent different algorithms: SUM, FSUM, SUMw, PFSUM, PDLA (with different λ values), and SRL (with different λ values). The shaded areas show 95% confidence intervals.", "section": "5 Experiments"}, {"figure_path": "3cb6pF3Tvf/figures/figures_39_1.jpg", "caption": "Figure 4: The cost ratios for commuters (β = 0.8, T = 10, C = 100). “U”, “N” and “P” represent Uniform, Normal and Pareto ticket price distributions respectively.", "description": "The figure shows the result of the experiment for commuters with β=0.8, T=10, C=100, and three different ticket price distributions (Uniform, Normal, and Pareto).  The x-axis represents the perturbation probability, which simulates prediction error. The y-axis represents the average cost ratio of different algorithms compared to the optimal offline algorithm (OPT).  Each line represents a different algorithm (SUM, FSUM, SUMw, PFSUM, PDLA with different λ values, and SRL with different λ values). The shaded area shows the 95% confidence interval for each algorithm.", "section": "5 Experiments"}, {"figure_path": "3cb6pF3Tvf/figures/figures_39_2.jpg", "caption": "Figure 4: The cost ratios for commuters (β = 0.8, T = 10, C = 100). “U”, “N” and “P” represent Uniform, Normal and Pareto ticket price distributions respectively.", "description": "This figure compares the performance of different algorithms for the Bahncard problem in a commuter setting with various ticket price distributions (Uniform, Normal, and Pareto).  The x-axis represents the \"perturbing probability\", which simulates the accuracy of predictions used by the algorithms. The y-axis shows the average cost ratio, which is the ratio of the algorithm's total cost to the optimal offline cost. The lower the ratio, the better the algorithm's performance.  The shaded regions represent 95% confidence intervals.", "section": "5 Experiments"}, {"figure_path": "3cb6pF3Tvf/figures/figures_39_3.jpg", "caption": "Figure 5: The cost ratios for occasional travelers (β = 0.8, T = 10, C = 100). “U”, “N” and “P” represent Uniform, Normal and Pareto ticket price distributions respectively.", "description": "This figure compares the performance of different algorithms (SUM, FSUM, SUMw, PFSUM, PDLA, SRL) for occasional travelers using three different ticket price distributions (Uniform, Normal, Pareto). The x-axis represents the perturbing probability, which reflects the prediction error. The y-axis represents the average cost ratio of each algorithm against OPT (optimal offline algorithm). The shaded areas denote the 95% confidence intervals.", "section": "5 Experiments"}, {"figure_path": "3cb6pF3Tvf/figures/figures_39_4.jpg", "caption": "Figure 4: The cost ratios for commuters (β = 0.8, T = 10, C = 100). “U”, “N” and “P” represent Uniform, Normal and Pareto ticket price distributions respectively.", "description": "The figure shows the performance comparison of various algorithms for commuters, with beta=0.8, T=10, and C=100 under different ticket price distributions: Uniform, Normal, and Pareto. Each distribution is represented by a subplot, and the x-axis shows the perturbing probability (noise level in prediction) while the y-axis indicates the average cost ratio. The shaded area shows the 95% confidence interval.", "section": "5 Experiments"}, {"figure_path": "3cb6pF3Tvf/figures/figures_40_1.jpg", "caption": "Figure 5: The cost ratios for occasional travelers (β = 0.8, T = 10, C = 100). “U”, “N” and “P” represent Uniform, Normal and Pareto ticket price distributions respectively.", "description": "This figure shows the average cost ratios for occasional travelers using different algorithms under three ticket price distributions: Uniform, Normal, and Pareto.  The x-axis represents the perturbing probability, which simulates the prediction error, ranging from 0 to 1.  The y-axis shows the average cost ratio, comparing the cost of each algorithm to the optimal offline algorithm (OPT). The shaded area represents the 95% confidence interval.", "section": "5 Experiments"}]