[{"figure_path": "NPKZF1WDjZ/figures/figures_1_1.jpg", "caption": "Figure 1: Comparison between Tree-of-Thoughts (ToT) Reasoning and our DeAR (Decompose-Analyze-Rethink) Reasoning on a reasoning-based problem. (a) The simulation of Tree-of-Thoughts (ToT) (branch = 3). (b) The simulation of DeAR (Decompose-Analyze-Rethink) Reasoning.", "description": "This figure compares the reasoning process of Tree-of-Thoughts (ToT) and the proposed DeAR method on a sample math word problem.  ToT uses a tree structure to explore different reasoning paths sequentially, potentially leading to errors propagating through subsequent steps. In contrast, DeAR uses an iterative tree-based question decomposition, analyzing and refining rationales at each step and globally updating them to improve logical consistency and accuracy.", "section": "1 Introduction"}, {"figure_path": "NPKZF1WDjZ/figures/figures_1_2.jpg", "caption": "Figure 1: Comparison between Tree-of-Thoughts (ToT) Reasoning and our DeAR (Decompose-Analyze-Rethink) Reasoning on a reasoning-based problem. (a) The simulation of Tree-of-Thoughts (ToT) (branch = 3). (b) The simulation of DeAR (Decompose-Analyze-Rethink) Reasoning.", "description": "This figure compares the reasoning process of Tree-of-Thoughts (ToT) and the proposed DeAR method on a sample math word problem.  Panel (a) shows ToT's sequential, tree-like approach where it extends existing rationales, possibly leading to error propagation. Panel (b) illustrates DeAR's iterative method of decomposing the problem into sub-problems, analyzing each sub-problem, and then using feedback from child nodes to rethink and update rationales at higher levels of the reasoning tree, allowing for error correction and creating a more adaptable and accurate logical structure.", "section": "1 Introduction"}, {"figure_path": "NPKZF1WDjZ/figures/figures_3_1.jpg", "caption": "Figure 2: A demonstration of the DeAR (Decompose-Analyze-Rethink) cycle.", "description": "This figure demonstrates the iterative process of the DeAR framework. It shows how a question is decomposed into sub-questions, analyzed to generate rationales, and then rethought by updating the rationales based on the results from lower-level sub-questions. The cycle continues until the final answer is obtained.", "section": "3.3 Framework Overview"}, {"figure_path": "NPKZF1WDjZ/figures/figures_8_1.jpg", "caption": "Figure 3: The distributions of annotators' selections. More annotators considered DeAR's rationales to be more logical.", "description": "This figure shows the results of a human evaluation comparing the logical coherence of rationales generated by three different methods: DeAR, GoT, and ToT.  Annotators were presented with rationales from each method for the same questions and asked to choose the most logical one. The bar chart displays the percentage of annotators selecting each method's rationales as the most logical for ScienceQA, StrategyQA, and GSM8K datasets.  DeAR consistently receives a higher percentage of selections across all datasets, suggesting its rationales are perceived as more logically sound.", "section": "5.4 Logical Coherence of the Generated Rationales"}, {"figure_path": "NPKZF1WDjZ/figures/figures_8_2.jpg", "caption": "Figure 1: Comparison between Tree-of-Thoughts (ToT) Reasoning and our DeAR (Decompose-Analyze-Rethink) Reasoning on a reasoning-based problem. (a) The simulation of Tree-of-Thoughts (ToT) (branch = 3). (b) The simulation of DeAR (Decompose-Analyze-Rethink) Reasoning.", "description": "This figure compares the reasoning processes of Tree-of-Thoughts (ToT) and the proposed Decompose-Analyze-Rethink (DeAR) framework on a sample math word problem.  Panel (a) shows ToT's approach, which extends a reasoning tree sequentially, potentially leading to errors propagating through the tree. Panel (b) illustrates DeAR, which uses a tree-based question decomposition approach to plan the reasoning process, allowing for global updates and error correction at each step.", "section": "1 Introduction"}, {"figure_path": "NPKZF1WDjZ/figures/figures_9_1.jpg", "caption": "Figure 1: Comparison between Tree-of-Thoughts (ToT) Reasoning and our DeAR (Decompose-Analyze-Rethink) Reasoning on a reasoning-based problem. (a) The simulation of Tree-of-Thoughts (ToT) (branch = 3). (b) The simulation of DeAR (Decompose-Analyze-Rethink) Reasoning.", "description": "This figure compares the reasoning processes of Tree-of-Thoughts (ToT) and the proposed DeAR method on a sample math word problem.  Panel (a) shows ToT's sequential, linear approach, extending a fixed number of branches from the original question.  Panel (b) illustrates DeAR's iterative, tree-based method, which decomposes the problem into sub-questions, analyzes them independently, and updates the reasoning tree through feedback. The difference highlights DeAR's more adaptable and human-like reasoning.", "section": "1 Introduction"}, {"figure_path": "NPKZF1WDjZ/figures/figures_19_1.jpg", "caption": "Figure 1: Comparison between Tree-of-Thoughts (ToT) Reasoning and our DeAR (Decompose-Analyze-Rethink) Reasoning on a reasoning-based problem. (a) The simulation of Tree-of-Thoughts (ToT) (branch = 3). (b) The simulation of DeAR (Decompose-Analyze-Rethink) Reasoning.", "description": "This figure compares the reasoning process of Tree-of-Thoughts (ToT) and the proposed DeAR method on a sample math word problem.  (a) shows ToT's sequential, branch-limited approach, highlighting the rigidity and potential for error propagation. (b) illustrates DeAR's iterative, tree-based method, showcasing its flexibility, global perspective, and capacity for error correction through feedback.", "section": "1 Introduction"}, {"figure_path": "NPKZF1WDjZ/figures/figures_20_1.jpg", "caption": "Figure 1: Comparison between Tree-of-Thoughts (ToT) Reasoning and our DeAR (Decompose-Analyze-Rethink) Reasoning on a reasoning-based problem. (a) The simulation of Tree-of-Thoughts (ToT) (branch = 3). (b) The simulation of DeAR (Decompose-Analyze-Rethink) Reasoning.", "description": "This figure compares the reasoning process of Tree-of-Thoughts (ToT) and the proposed DeAR method on a sample math word problem.  ToT uses a tree structure to explore possible reasoning paths, sequentially expanding branches from the original question, whereas DeAR uses a tree-based question decomposition approach that more closely mirrors human-like logical planning.  The figure illustrates how DeAR’s iterative decomposition, analysis, and rethinking steps (Decompose-Analyze-Rethink cycle) allow for more adaptive and accurate reasoning with timely error correction.", "section": "1 Introduction"}, {"figure_path": "NPKZF1WDjZ/figures/figures_20_2.jpg", "caption": "Figure 1: Comparison between Tree-of-Thoughts (ToT) Reasoning and our DeAR (Decompose-Analyze-Rethink) Reasoning on a reasoning-based problem. (a) The simulation of Tree-of-Thoughts (ToT) (branch = 3). (b) The simulation of DeAR (Decompose-Analyze-Rethink) Reasoning.", "description": "This figure compares the reasoning processes of Tree-of-Thoughts (ToT) and the proposed DeAR framework on a sample math word problem.  The ToT approach uses a tree structure with a fixed number of branches (3 in this example), extending rationales sequentially.  The DeAR approach iteratively builds a reasoning tree by decomposing the problem into sub-questions (Decompose), generating and self-checking rationales (Analyze), and updating parent-node rationales based on feedback from child nodes (Rethink). The figure visually illustrates the different structures and processes, highlighting DeAR's more adaptable and accurate approach.", "section": "1 Introduction"}]