[{"figure_path": "kXKrLsR4aJ/figures/figures_1_1.jpg", "caption": "Figure 1: Panel (a): The proposed CON network consists of n damped harmonic oscillators that are coupled through the neuron-like connection tanh(Wx+b) and the non-diagonal stiffness K-k and damping coefficients D-d, respectively. The state of the network is captured by the positions x(t) and velocities x(t) of the oscillators. The time-dependent input is mapped through the (possibly nonlinear) function g(u) to a forcing τ acting on the oscillators. Panel (b): Exploiting Coupled Oscillator Networks (CONs) for learning latent dynamics from pixels: We encode the initial observation o(t0) and the input u(t) into latent space where we leverage the Coupled Oscillator Network (CON) to predict future latent states. Finally, we decode both the latent-space torques τ(t) and the predicted latent states z(t).", "description": "This figure illustrates the proposed Coupled Oscillator Network (CON) architecture. Panel (a) shows the CON's internal structure: a network of coupled damped harmonic oscillators whose dynamics are influenced by an input u(t) via a mapping g(u) and by nonlinear coupling. Panel (b) shows how the CON is used for learning latent-space dynamics from image pixels. The initial observation and the input are encoded into a latent space. The CON predicts future states in the latent space based on the encoded input, which are then decoded to reconstruct the input and predict future observations.", "section": "2 Input-to-State Stable (ISS) Coupled Oscillator Networks (CONs)"}, {"figure_path": "kXKrLsR4aJ/figures/figures_1_2.jpg", "caption": "Figure 1: Panel (a): The proposed CON network consists of n damped harmonic oscillators that are coupled through the neuron-like connection tanh(Wx+b) and the non-diagonal stiffness K-k and damping coefficients D-d, respectively. The state of the network is captured by the positions x(t) and velocities x(t) of the oscillators. The time-dependent input is mapped through the (possibly nonlinear) function g(u) to a forcing τ acting on the oscillators. Panel (b): Exploiting Coupled Oscillator Networks (CONs) for learning latent dynamics from pixels: We encode the initial observation o(to) and the input u(t) into latent space where we leverage the Coupled Oscillator Network (CON) to predict future latent states. Finally, we decode both the latent-space torques τ(t) and the predicted latent states z(t).", "description": "This figure shows the architecture of the proposed Coupled Oscillator Network (CON) for learning latent dynamics from image pixels. Panel (a) illustrates the CON model, which consists of coupled damped harmonic oscillators.  The input u(t) is mapped to a forcing term τ(t) through a function g(u). Panel (b) shows how CON is used for learning latent dynamics. The initial observation o(to) and the input u(t) are encoded into the latent space. The CON predicts future latent states, which are then decoded to reconstruct the input û(t) and predict future observations ô(t).", "section": "2 Input-to-State Stable (ISS) Coupled Oscillator Networks (CONs)"}, {"figure_path": "kXKrLsR4aJ/figures/figures_4_1.jpg", "caption": "Figure 2: Analysis of approximation error of CFA-CON: we compare the ground-truth solution of a 40 s rollout of the CON network consisting of three oscillators (n = 3) with the CFA-CON executed at a time step of dt = 0.1 s and a solution generated by integrating the ODE at a time step of dt = 0.05 s with the Euler method.", "description": "The figure compares the performance of three different methods for integrating the Coupled Oscillator Network (CON) dynamics over 40 seconds.  The ground truth is obtained by numerically integrating the CON ODE with a very small time step (5e-5 seconds) using a high-order method.  Two approximate methods, the Euler method with a time step of 0.05 seconds, and the Closed-Form Approximation of CON (CFA-CON) with a time step of 0.1 seconds, are compared against the ground truth.  The plots show the positions and velocities of the oscillators for each of the three methods.", "section": "An approximate closed-form solution for the rollout of CON"}, {"figure_path": "kXKrLsR4aJ/figures/figures_7_1.jpg", "caption": "Figure 3: Evaluation of prediction performance of the various models vs. the dimension of their latent representation nz and the number of trainable parameters of the dynamics model, respectively, on the PCC-NS-2 dataset. All hyperparameters are tuned for each model separately for nz = 8. The error bar denotes the standard deviation across three random seeds.", "description": "This figure shows the RMSE (Root Mean Squared Error) of different latent dynamic models trained on the PCC-NS-2 dataset (a continuum soft robot with two piecewise constant curvature segments). The left plot compares the RMSE against the latent dimension (nz), while the right plot compares it against the number of trainable parameters.  The results show that the CON models (CON-S, CON-M, CFA-CON) achieve better performance and lower variance compared to the other models, especially as the latent dimension increases.", "section": "Results"}, {"figure_path": "kXKrLsR4aJ/figures/figures_8_1.jpg", "caption": "Figure 4: Panel (a): Samples of some of the datasets used as part of the experimental verification, specifically for the results reported in Tab. 1. The real-world Reaction-Diffusion image is adopted from [43]. Panel (b): Model-based control in latent space by exploiting the physical structure of the CON model.", "description": "This figure shows the datasets used in the paper and a block diagram of the model-based control system. Panel (a) shows example images from four datasets: Mass-Spring with friction, Single Pendulum with friction, Double Pendulum with friction, and a continuum soft robot.  Panel (b) illustrates how the proposed model-based control system works, showing how observations are encoded into a latent space, where a CON model predicts future states, and the control input is calculated based on this prediction and then decoded back into the physical system.  It also shows the integral saturated PID with potential force compensation used for control.", "section": "4 Learning control-oriented latent dynamics from pixels"}, {"figure_path": "kXKrLsR4aJ/figures/figures_9_1.jpg", "caption": "Figure 2: Analysis of approximation error of CFA-CON: we compare the ground-truth solution of a 40 s rollout of the CON network consisting of three oscillators (n = 3) with the CFA-CON executed at a time step of dt = 0.1 s and a solution generated by integrating the ODE at a time step of dt = 0.05 s with the Euler method.", "description": "The figure compares the performance of three different methods for approximating the dynamics of a coupled oscillator network: the ground truth, the CFA-CON method with a time step of 0.1 seconds, and the Euler method with a time step of 0.05 seconds.  The plots show the positions and velocities of the oscillators over time. The CFA-CON method provides a reasonable approximation, especially for the positions, whereas the Euler method shows larger errors, particularly in the velocities.", "section": "3 An approximate closed-form solution for the rollout of CON"}, {"figure_path": "kXKrLsR4aJ/figures/figures_14_1.jpg", "caption": "Figure 6: Illustration of global asymptotic stability for the unforced system with g(u) = 0 and input-to-state stability for the forced system, where the black dashed line denotes the input u(t).", "description": "The figure consists of two subfigures: (a) GAS and (b) ISS. Subfigure (a) shows the decay of the residual dynamics for the unforced system (g(u) = 0).  It illustrates that the system converges to the equilibrium point asymptotically. Subfigure (b) demonstrates the input-to-state stability (ISS) property for the forced system. Here, the system's state remains bounded in proportion to the input, as shown by the red dashed line representing the upper bound. The black dashed line represents the input u(t).", "section": "Global Asymptotic Stability (GAS) for the unforced system. Global Input-to-State Stability (ISS) for the forced system."}, {"figure_path": "kXKrLsR4aJ/figures/figures_19_1.jpg", "caption": "Figure 1: Panel (a): The proposed CON network consists of n damped harmonic oscillators that are coupled through the neuron-like connection tanh(Wx+b) and the non-diagonal stiffness K-k and damping coefficients D-d, respectively. The state of the network is captured by the positions x(t) and velocities x(t) of the oscillators. The time-dependent input is mapped through the (possibly nonlinear) function g(u) to a forcing τ acting on the oscillators. Panel (b): Exploiting Coupled Oscillator Networks (CONs) for learning latent dynamics from pixels: We encode the initial observation o(t0) and the input u(t) into latent space where we leverage the Coupled Oscillator Network (CON) to predict future latent states. Finally, we decode both the latent-space torques τ(t) and the predicted latent states z(t).", "description": "The figure shows the architecture of the Coupled Oscillator Network (CON) model and how it's used for learning latent dynamics from image pixels. Panel (a) details the CON's structure: a network of coupled damped harmonic oscillators with a nonlinear coupling term and external input. Panel (b) illustrates the CON's role in a system that learns latent dynamics from images, using an encoder, CON for dynamics prediction, and a decoder to reconstruct inputs and observations from the latent space.", "section": "1 Introduction"}, {"figure_path": "kXKrLsR4aJ/figures/figures_19_2.jpg", "caption": "Figure 2: Analysis of approximation error of CFA-CON: we compare the ground-truth solution of a 40 s rollout of the CON network consisting of three oscillators (n = 3) with the CFA-CON executed at a time step of dt = 0.1 s and a solution generated by integrating the ODE at a time step of dt = 0.05 s with the Euler method.", "description": "The figure compares the performance of three different methods for integrating the dynamics of a Coupled Oscillator Network (CON).  The ground truth is obtained using a high-precision method. One approximation uses a larger time step of 0.1s, and the other uses a smaller time step of 0.05s with the Euler method. The plots show the positions and velocities of the oscillators over time, illustrating the differences in accuracy between the approximation methods and the ground truth. The results demonstrate the trade-off between computational efficiency and accuracy when using different approximation methods.", "section": "3 An approximate closed-form solution for the rollout of CON"}, {"figure_path": "kXKrLsR4aJ/figures/figures_19_3.jpg", "caption": "Figure 2: Analysis of approximation error of CFA-CON: we compare the ground-truth solution of a 40 s rollout of the CON network consisting of three oscillators (n = 3) with the CFA-CON executed at a time step of dt = 0.1 s and a solution generated by integrating the ODE at a time step of dt = 0.05 s with the Euler method.", "description": "The figure compares the performance of the proposed closed-form approximation of the Coupled Oscillator Network (CFA-CON) with the ground truth solution obtained by numerically integrating the Ordinary Differential Equation (ODE) using the Euler method.  It shows the positions and velocities over a 40-second time period. The CFA-CON is run with a time step of 0.1 seconds, whereas the Euler method uses a smaller time step of 0.05 seconds.  The goal is to assess the accuracy of the CFA-CON approximation against the more accurate (but computationally more expensive) numerical integration.", "section": "3 An approximate closed-form solution for the rollout of CON"}, {"figure_path": "kXKrLsR4aJ/figures/figures_31_1.jpg", "caption": "Figure 8: Evaluation of prediction performance of the various models vs. the dimension of their latent representation nz and the number of trainable parameters of the dynamics model, respectively. We optimize the hyperparameters for the case of nz = 8, and execute the tuning separately for each model and dataset.", "description": "This figure analyzes the performance of various models for predicting future states based on latent representations. It shows how the root mean squared error (RMSE), peak signal-to-noise ratio (PSNR), and structural similarity index (SSIM) change with varying latent dimensions (nz) and model parameters. The hyperparameters were tuned separately for each model and dataset, with a fixed latent dimension of 8 for parameter tuning.", "section": "Results"}, {"figure_path": "kXKrLsR4aJ/figures/figures_31_2.jpg", "caption": "Figure 3: Evaluation of prediction performance of the various models vs. the dimension of their latent representation n<sub>z</sub> and the number of trainable parameters of the dynamics model, respectively, on the PCC-NS-2 dataset. All hyperparameters are tuned for each model separately for n<sub>z</sub> = 8. The error bar denotes the standard deviation across three random seeds.", "description": "The figure shows the RMSE error for different latent dynamic models trained on the PCC-NS-2 dataset. The left plot shows how the RMSE changes with the latent dimension n<sub>z</sub>. The right plot shows how the RMSE changes with the number of trainable parameters.  The error bars represent the standard deviation across three random seeds.", "section": "Results"}, {"figure_path": "kXKrLsR4aJ/figures/figures_31_3.jpg", "caption": "Figure 3: Evaluation of prediction performance of the various models vs. the dimension of their latent representation n<sub>z</sub> and the number of trainable parameters of the dynamics model, respectively, on the PCC-NS-2 dataset. All hyperparameters are tuned for each model separately for n<sub>z</sub> = 8. The error bar denotes the standard deviation across three random seeds.", "description": "This figure compares the prediction performance (RMSE) of several models (RNN, GRU, coRNN, NODE, MECH-NODE, CON-S, CON-M, CFA-CON) against the latent dimension (n<sub>z</sub>) and the number of trainable parameters.  The PCC-NS-2 dataset is used for this evaluation.  The hyperparameters for all models were tuned for a latent dimension of 8, and the error bars show the standard deviation across three trials with different random seeds.", "section": "Results"}, {"figure_path": "kXKrLsR4aJ/figures/figures_31_4.jpg", "caption": "Figure 3: Evaluation of prediction performance of the various models vs. the dimension of their latent representation nz and the number of trainable parameters of the dynamics model, respectively, on the PCC-NS-2 dataset. All hyperparameters are tuned for each model separately for n₂ = 8. The error bar denotes the standard deviation across three random seeds.", "description": "This figure compares the performance of different latent dynamic models in terms of RMSE (Root Mean Squared Error) against the dimension of the latent space (nz) and the number of trainable parameters.  The PCC-NS-2 dataset is used, and hyperparameters are tuned for each model separately (nz = 8).  Error bars represent the standard deviation across three different random seeds, showcasing the consistency and reliability of the results.", "section": "Results"}, {"figure_path": "kXKrLsR4aJ/figures/figures_31_5.jpg", "caption": "Figure 3: Evaluation of prediction performance of the various models vs. the dimension of their latent representation nz and the number of trainable parameters of the dynamics model, respectively, on the PCC-NS-2 dataset. All hyperparameters are tuned for each model separately for n₂ = 8. The error bar denotes the standard deviation across three random seeds.", "description": "The figure shows the RMSE (Root Mean Square Error) of different models in predicting the dynamics of a continuum soft robot.  The x-axis represents the latent dimension (nz) and the number of model parameters.  The plot demonstrates the performance of various models (RNN, GRU, coRNN, NODE, MECH-NODE, CON-S, CON-M, CFA-CON) as latent dimension and model parameters increase. The error bars represent the standard deviation from three different trials.", "section": "Results"}, {"figure_path": "kXKrLsR4aJ/figures/figures_32_1.jpg", "caption": "Figure 1: Panel (a): The proposed CON network consists of n damped harmonic oscillators that are coupled through the neuron-like connection tanh(Wx+b) and the non-diagonal stiffness K-k and damping coefficients D-d, respectively. The state of the network is captured by the positions x(t) and velocities x(t) of the oscillators. The time-dependent input is mapped through the (possibly nonlinear) function g(u) to a forcing τ acting on the oscillators. Panel (b): Exploiting Coupled Oscillator Networks (CONs) for learning latent dynamics from pixels: We encode the initial observation o(to) and the input u(t) into latent space where we leverage the Coupled Oscillator Network (CON) to predict future latent states. Finally, we decode both the latent-space torques τ(t) and the predicted latent states z(t).", "description": "This figure shows the architecture of the proposed Coupled Oscillator Network (CON) model. Panel (a) illustrates the CON's structure:  It consists of multiple coupled damped harmonic oscillators.  The oscillators' interactions are governed by a nonlinear coupling function and stiffness and damping terms. The input to the system is mapped to a forcing term that affects the oscillators. Panel (b) illustrates how the CON is used for learning latent dynamics: input and initial observation are encoded into a latent space.  The CON predicts the future latent states, which are decoded to produce predicted observations and latent-space torques.", "section": "2 Input-to-State Stable (ISS) Coupled Oscillator Networks (CONs)"}, {"figure_path": "kXKrLsR4aJ/figures/figures_32_2.jpg", "caption": "Figure 1: Panel (a): The proposed CON network consists of n damped harmonic oscillators that are coupled through the neuron-like connection tanh(Wx+b) and the non-diagonal stiffness K−k and damping coefficients D−d, respectively. The state of the network is captured by the positions x(t) and velocities ẋ(t) of the oscillators. The time-dependent input is mapped through the (possibly nonlinear) function g(u) to a forcing τ acting on the oscillators. Panel (b): Exploiting Coupled Oscillator Networks (CONs) for learning latent dynamics from pixels: We encode the initial observation o(t0) and the input u(t) into latent space where we leverage the Coupled Oscillator Network (CON) to predict future latent states. Finally, we decode both the latent-space torques τ(t) and the predicted latent states z(t).", "description": "This figure shows the architecture of the proposed Coupled Oscillator Network (CON) and how it's used for learning latent dynamics from image pixels. Panel (a) details the CON's structure, which consists of interconnected damped harmonic oscillators whose dynamics are influenced by an input and nonlinear coupling. Panel (b) illustrates how the CON is integrated into a larger system for learning latent dynamics. The initial image and input are encoded into a latent space, where the CON predicts future latent states. These states are then decoded to reconstruct future images and control inputs.", "section": "2 Input-to-State Stable (ISS) Coupled Oscillator Networks (CONs)"}, {"figure_path": "kXKrLsR4aJ/figures/figures_33_1.jpg", "caption": "Figure 1: Panel (a): The proposed CON network consists of n damped harmonic oscillators that are coupled through the neuron-like connection tanh(Wx+b) and the non-diagonal stiffness K-k and damping coefficients D-d, respectively. The state of the network is captured by the positions x(t) and velocities x(t) of the oscillators. The time-dependent input is mapped through the (possibly nonlinear) function g(u) to a forcing τ acting on the oscillators. Panel (b): Exploiting Coupled Oscillator Networks (CONs) for learning latent dynamics from pixels: We encode the initial observation o(t0) and the input u(t) into latent space where we leverage the Coupled Oscillator Network (CON) to predict future latent states. Finally, we decode both the latent-space torques τ(t) and the predicted latent states z(t).", "description": "This figure shows the architecture of the proposed Coupled Oscillator Network (CON) model and how it is used for learning latent dynamics from image pixels.  Panel (a) details the CON's structure, illustrating its composition of coupled damped harmonic oscillators with nonlinear coupling.  Panel (b) illustrates the CON's application in a latent-space learning framework, demonstrating how an encoder maps input and initial observations into a latent space, the CON predicts future latent states, and a decoder reconstructs the input and observations. This process allows for control in the latent space.", "section": "2 Input-to-State Stable (ISS) Coupled Oscillator Networks (CONs)"}, {"figure_path": "kXKrLsR4aJ/figures/figures_33_2.jpg", "caption": "Figure 1: Panel (a): The proposed CON network consists of n damped harmonic oscillators that are coupled through the neuron-like connection tanh(Wx+b) and the non-diagonal stiffness K-k and damping coefficients D-d, respectively. The state of the network is captured by the positions x(t) and velocities x(t) of the oscillators. The time-dependent input is mapped through the (possibly nonlinear) function g(u) to a forcing τ acting on the oscillators. Panel (b): Exploiting Coupled Oscillator Networks (CONs) for learning latent dynamics from pixels: We encode the initial observation o(to) and the input u(t) into latent space where we leverage the Coupled Oscillator Network (CON) to predict future latent states. Finally, we decode both the latent-space torques τ(t) and the predicted latent states z(t).", "description": "This figure shows the architecture of the proposed Coupled Oscillator Network (CON) and how it is used for learning latent dynamics from pixel data. Panel (a) details the CON architecture, highlighting its components such as coupled damped harmonic oscillators, the nonlinear coupling term, and the input-to-forcing mapping. Panel (b) illustrates the CON's application in learning latent dynamics, showing how an encoder maps the initial observation and input into the latent space, and the decoder reconstructs future latent states and torques.", "section": "2 Input-to-State Stable (ISS) Coupled Oscillator Networks (CONs)"}, {"figure_path": "kXKrLsR4aJ/figures/figures_34_1.jpg", "caption": "Figure 1: Panel (a): The proposed CON network consists of n damped harmonic oscillators that are coupled through the neuron-like connection tanh(Wx+b) and the non-diagonal stiffness K-k and damping coefficients D-d, respectively. The state of the network is captured by the positions x(t) and velocities x(t) of the oscillators. The time-dependent input is mapped through the (possibly nonlinear) function g(u) to a forcing τ acting on the oscillators. Panel (b): Exploiting Coupled Oscillator Networks (CONs) for learning latent dynamics from pixels: We encode the initial observation o(t0) and the input u(t) into latent space where we leverage the Coupled Oscillator Network (CON) to predict future latent states. Finally, we decode both the latent-space torques τ(t) and the predicted latent states z(t).", "description": "This figure shows the architecture of the proposed Coupled Oscillator Network (CON) and how it is used for learning latent dynamics from pixels. Panel (a) details the CON's structure, illustrating its composition of coupled damped harmonic oscillators and the input-to-forcing mapping. Panel (b) outlines the process of latent-space dynamics learning, involving encoding initial observations and inputs, using the CON for prediction, and decoding the latent-space torques and states.", "section": "2 Input-to-State Stable (ISS) Coupled Oscillator Networks (CONs)"}, {"figure_path": "kXKrLsR4aJ/figures/figures_34_2.jpg", "caption": "Figure 2: Analysis of approximation error of CFA-CON: we compare the ground-truth solution of a 40 s rollout of the CON network consisting of three oscillators (n = 3) with the CFA-CON executed at a time step of dt = 0.1 s and a solution generated by integrating the ODE at a time step of dt = 0.05 s with the Euler method.", "description": "This figure compares the ground truth positions and velocities of a CON with three oscillators against those obtained using two approximation methods: the CFA-CON method with a larger time step (0.1s) and the Euler method with a smaller time step (0.05s).  The comparison highlights the approximation errors introduced by the CFA-CON and Euler methods, demonstrating that CFA-CON's error is comparable to that of the Euler method, albeit at a larger time step. This suggests that CFA-CON provides a computationally efficient alternative for approximating the CON dynamics.", "section": "3 An approximate closed-form solution for the rollout of CON"}, {"figure_path": "kXKrLsR4aJ/figures/figures_35_1.jpg", "caption": "Figure 1: Panel (a): The proposed CON network consists of n damped harmonic oscillators that are coupled through the neuron-like connection tanh(Wx+b) and the non-diagonal stiffness K-k and damping coefficients D-d, respectively. The state of the network is captured by the positions x(t) and velocities x(t) of the oscillators. The time-dependent input is mapped through the (possibly nonlinear) function g(u) to a forcing τ acting on the oscillators. Panel (b): Exploiting Coupled Oscillator Networks (CONs) for learning latent dynamics from pixels: We encode the initial observation o(to) and the input u(t) into latent space where we leverage the Coupled Oscillator Network (CON) to predict future latent states. Finally, we decode both the latent-space torques τ(t) and the predicted latent states z(t).", "description": "This figure shows the architecture of the proposed Coupled Oscillator Network (CON) and how it's used for learning latent dynamics from pixels.  Panel (a) details the CON's structure, illustrating n coupled damped harmonic oscillators whose state is determined by their positions and velocities.  Input u(t) is mapped through g(u) to a forcing τ that acts on the oscillators. Panel (b) illustrates how CON learns from pixel data. An encoder maps initial observations o(to) and input u(t) into latent space, where CON predicts future states. A decoder then reconstructs both the latent torques τ(t) and the predicted latent states z(t).", "section": "2 Input-to-State Stable (ISS) Coupled Oscillator Networks (CONs)"}, {"figure_path": "kXKrLsR4aJ/figures/figures_35_2.jpg", "caption": "Figure 1: Panel (a): The proposed CON network consists of n damped harmonic oscillators that are coupled through the neuron-like connection tanh(Wx+b) and the non-diagonal stiffness K-k and damping coefficients D-d, respectively. The state of the network is captured by the positions x(t) and velocities x(t) of the oscillators. The time-dependent input is mapped through the (possibly nonlinear) function g(u) to a forcing τ acting on the oscillators. Panel (b): Exploiting Coupled Oscillator Networks (CONs) for learning latent dynamics from pixels: We encode the initial observation o(to) and the input u(t) into latent space where we leverage the Coupled Oscillator Network (CON) to predict future latent states. Finally, we decode both the latent-space torques τ(t) and the predicted latent states z(t).", "description": "This figure shows the architecture of the proposed Coupled Oscillator Network (CON) model. Panel (a) illustrates the network's structure: n damped harmonic oscillators coupled through a nonlinear connection and external forcing.  Panel (b) demonstrates how CON is used for learning latent dynamics from images. The initial observation and input are encoded into a latent space, CON predicts future latent states, and a decoder reconstructs inputs and observations.", "section": "2 Input-to-State Stable (ISS) Coupled Oscillator Networks (CONs)"}, {"figure_path": "kXKrLsR4aJ/figures/figures_36_1.jpg", "caption": "Figure 1: Panel (a): The proposed CON network consists of n damped harmonic oscillators that are coupled through the neuron-like connection tanh(Wx+b) and the non-diagonal stiffness K-k and damping coefficients D-d, respectively. The state of the network is captured by the positions x(t) and velocities  ̇(t) of the oscillators. The time-dependent input is mapped through the (possibly nonlinear) function g(u) to a forcing τ acting on the oscillators. Panel (b): Exploiting Coupled Oscillator Networks (CONs) for learning latent dynamics from pixels: We encode the initial observation o(t0) and the input u(t) into latent space where we leverage the Coupled Oscillator Network (CON) to predict future latent states. Finally, we decode both the latent-space torques τ(t) and the predicted latent states z(t).", "description": "This figure illustrates the architecture of the Coupled Oscillator Network (CON) and how it's used for learning latent-space dynamics from image pixels. Panel (a) shows the CON's structure: n coupled damped harmonic oscillators with connections influenced by a hyperbolic tangent function.  Panel (b) details the CON's application in learning dynamics.  Initial observations and inputs are encoded into latent space. The CON then predicts future states in this low-dimensional space, before decoding back to the original high-dimensional space (e.g., image pixels).", "section": "2 Input-to-State Stable (ISS) Coupled Oscillator Networks (CONs)"}, {"figure_path": "kXKrLsR4aJ/figures/figures_36_2.jpg", "caption": "Figure 1: Panel (a): The proposed CON network consists of n damped harmonic oscillators that are coupled through the neuron-like connection tanh(Wx+b) and the non-diagonal stiffness K-k and damping coefficients D-d, respectively. The state of the network is captured by the positions x(t) and velocities x(t) of the oscillators. The time-dependent input is mapped through the (possibly nonlinear) function g(u) to a forcing τ acting on the oscillators. Panel (b): Exploiting Coupled Oscillator Networks (CONs) for learning latent dynamics from pixels: We encode the initial observation o(to) and the input u(t) into latent space where we leverage the Coupled Oscillator Network (CON) to predict future latent states. Finally, we decode both the latent-space torques τ(t) and the predicted latent states z(t).", "description": "This figure shows the architecture of the Coupled Oscillator Network (CON) and how it's used for learning latent dynamics from image pixels.  Panel (a) details the CON's structure: interconnected damped harmonic oscillators influenced by an input and non-linear coupling. Panel (b) illustrates the CON's application in a control system: image input and previous input are encoded, the CON predicts future latent states, and these are decoded to obtain predicted observations and control signals.", "section": "2 Input-to-State Stable (ISS) Coupled Oscillator Networks (CONs)"}, {"figure_path": "kXKrLsR4aJ/figures/figures_37_1.jpg", "caption": "Figure 2: Analysis of approximation error of CFA-CON: we compare the ground-truth solution of a 40 s rollout of the CON network consisting of three oscillators (n = 3) with the CFA-CON executed at a time step of dt = 0.1 s and a solution generated by integrating the ODE at a time step of dt = 0.05 s with the Euler method.", "description": "This figure compares three different methods for approximating the CON model's dynamics: the ground truth solution (high accuracy, high computation cost), CFA-CON (approximation method, medium accuracy and computation cost), and Euler integration (low accuracy and computation cost).  The plots show the position and velocity of the oscillators over time.  The goal is to show that the CFA-CON method provides a good balance between accuracy and computational efficiency.", "section": "3 An approximate closed-form solution for the rollout of CON"}, {"figure_path": "kXKrLsR4aJ/figures/figures_38_1.jpg", "caption": "Figure 2: Analysis of approximation error of CFA-CON: we compare the ground-truth solution of a 40 s rollout of the CON network consisting of three oscillators (n = 3) with the CFA-CON executed at a time step of dt = 0.1 s and a solution generated by integrating the ODE at a time step of dt = 0.05 s with the Euler method.", "description": "The figure compares the performance of three different methods for integrating the CON network dynamics: the ground truth solution (obtained by high-precision numerical integration), the CFA-CON method (an approximate closed-form solution), and the Euler method.  The results are shown for both the positions and velocities of the oscillators over a 40-second time period.  It demonstrates the accuracy of the CFA-CON approximation compared to the ground truth, highlighting its computational efficiency.", "section": "3 An approximate closed-form solution for the rollout of CON"}, {"figure_path": "kXKrLsR4aJ/figures/figures_39_1.jpg", "caption": "Figure 21: Potential energy landscapes of a CON with n<sub>z</sub> = 2 trained to learn the latent space dynamics of a continuum soft robots (simulated with two PCC segments). Panel (a): Here, we visualize the learned potential energy of CON using the color scale as a function of the latent representation <b>z</b> = <b>x</b><sub>w</sub> ∈ ℝ². The arrows denote the gradient of the potential field ∇U (i.e., the potential force), with the magnitude of the gradient expressed as the length of the arrow. Panel (b): Again, we display the learned potential energy of CON using the color scale, but in this case, as a function of the configuration <b>q</b> ∈ ℝ² of the robot (that is hidden from the model). First, we render an image <b>o</b> of the shape of the robot for each configuration <b>q</b> = [q<sub>1</sub> q<sub>2</sub>]<sup>T</sup> ∈ ℝ². Then, we encode the image into latent space as <b>z</b> = Φ(<b>o</b>). This allows us then to compute the potential energy U(<b>z</b>) of the CON latent dynamics model. Panel (c): Here, we display the potential energy and its associated potential forces of the actual (i.e., simulated) system.", "description": "This figure visualizes the potential energy landscapes learned by the CON model for a two-segment continuum soft robot. It shows how the model learns the potential energy as a function of both the latent representation and the robot's configuration.  The visualizations aid in understanding the model's ability to capture the system's dynamics.", "section": "Exploiting the dynamic structure for latent-space control"}, {"figure_path": "kXKrLsR4aJ/figures/figures_39_2.jpg", "caption": "Figure 21: Potential energy landscapes of a CON with nz = 2 trained to learn the latent space dynamics of a continuum soft robots (simulated with two PCC segments). Panel (a): Here, we visualize the learned potential energy of CON using the color scale as a function of the latent representation z = xw ∈ R². The arrows denote the gradient of the potential field 4 (i.e., the potential force), with the magnitude of the gradient expressed as the length of the arrow. Panel (b): Again, we display the learned potential energy of CON using the color scale, but in this case, as a function of the configuration q ∈ R of the robot (that is hidden from the model). First, we render an image o of the shape of the robot for each configuration q = [9192] ∈ R². Then, we encode the image into latent space as z = Φ(o). This allows us then to compute the potential energy U(z) of the CON latent dynamics model. Panel (c): Here, we display the potential energy and its associated potential forces of the actual (i.e., simulated) system.", "description": "This figure visualizes the potential energy landscapes obtained from a CON model trained on a two-segment continuum soft robot, comparing it to the ground truth.  It shows three panels. Panel (a) shows the potential energy as a function of the latent representation. Panel (b) shows the potential energy as a function of the robot's configuration (which the model doesn't directly observe). Panel (c) displays the ground truth potential energy for comparison. The color scales represent the potential energy, and the arrows show the direction and magnitude of the potential force.", "section": "Exploiting the dynamic structure for latent-space control"}, {"figure_path": "kXKrLsR4aJ/figures/figures_39_3.jpg", "caption": "Figure 21: Potential energy landscapes of a CON with n₂ = 2 trained to learn the latent space dynamics of a continuum soft robots (simulated with two PCC segments). Panel (a): Here, we visualize the learned potential energy of CON using the color scale as a function of the latent representation z = xw ∈ R². The arrows denote the gradient of the potential field 4 (i.e., the potential force), with the magnitude of the gradient expressed as the length of the arrow. Panel (b): Again, we display the learned potential energy of CON using the color scale, but in this case, as a function of the configuration q ∈ R of the robot (that is hidden from the model). First, we render an image o of the shape of the robot for each configuration q = [9192] ∈ R². Then, we encode the image into latent space as z = Φ(o). This allows us then to compute the potential energy U(z) of the CON latent dynamics model. Panel (c): Here, we display the potential energy and its associated potential forces of the actual (i.e., simulated) system.", "description": "This figure visualizes the potential energy landscape learned by the CON model for a two-segment continuum soft robot. It compares the learned potential energy in latent space and configuration space with the ground truth potential energy.  The arrows show the direction and magnitude of the potential forces.", "section": "5 Exploiting the dynamic structure for latent-space control"}, {"figure_path": "kXKrLsR4aJ/figures/figures_40_1.jpg", "caption": "Figure 2: Analysis of approximation error of CFA-CON: we compare the ground-truth solution of a 40 s rollout of the CON network consisting of three oscillators (n = 3) with the CFA-CON executed at a time step of dt = 0.1 s and a solution generated by integrating the ODE at a time step of dt = 0.05 s with the Euler method.", "description": "The figure compares the performance of three different methods for integrating the dynamics of a Coupled Oscillator Network (CON).  The ground truth is calculated by a high-precision numerical integration method.  The second method uses the proposed closed-form approximation (CFA-CON) with a larger time step, and the third method uses a simpler Euler method with a smaller time step.  The plots show position and velocity over time, demonstrating that CFA-CON provides a reasonable approximation of the ground truth with significantly improved computational efficiency.", "section": "3 An approximate closed-form solution for the rollout of CON"}, {"figure_path": "kXKrLsR4aJ/figures/figures_40_2.jpg", "caption": "Figure 2: Analysis of approximation error of CFA-CON: we compare the ground-truth solution of a 40 s rollout of the CON network consisting of three oscillators (n = 3) with the CFA-CON executed at a time step of dt = 0.1 s and a solution generated by integrating the ODE at a time step of dt = 0.05 s with the Euler method.", "description": "The figure compares the performance of three different methods for approximating the dynamics of a coupled oscillator network.  The ground truth is obtained by numerically integrating the network's ordinary differential equations (ODEs) using a high-precision method (presumably a high-order numerical solver). Two approximation methods are compared against this ground truth: 1) CFA-CON (Closed-Form Approximation of the Coupled Oscillator Network) with a larger time step (dt = 0.1 s) and 2) a lower-order numerical solver (Euler method) with a smaller time step (dt = 0.05s).  The plots show the positions and velocities of the oscillators over time for each method, illustrating the approximation error of the two approximate methods.", "section": "An approximate closed-form solution for the rollout of CON"}, {"figure_path": "kXKrLsR4aJ/figures/figures_41_1.jpg", "caption": "Figure 2: Analysis of approximation error of CFA-CON: we compare the ground-truth solution of a 40 s rollout of the CON network consisting of three oscillators (n = 3) with the CFA-CON executed at a time step of dt = 0.1 s and a solution generated by integrating the ODE at a time step of dt = 0.05 s with the Euler method.", "description": "The figure compares the performance of three different methods for integrating the dynamics of a coupled oscillator network: ground truth, CFA-CON with a time step of 0.1s, and Euler method with a time step of 0.05s. The plot shows the positions and velocities of the oscillators over time, highlighting the approximation error introduced by CFA-CON and the Euler method compared to the ground truth.", "section": "3 An approximate closed-form solution for the rollout of CON"}, {"figure_path": "kXKrLsR4aJ/figures/figures_42_1.jpg", "caption": "Figure 2: Analysis of approximation error of CFA-CON: we compare the ground-truth solution of a 40 s rollout of the CON network consisting of three oscillators (n = 3) with the CFA-CON executed at a time step of dt = 0.1 s and a solution generated by integrating the ODE at a time step of dt = 0.05 s with the Euler method.", "description": "The figure compares three methods for approximating the CON's dynamics: the ground truth solution (obtained via high-accuracy numerical integration), CFA-CON (the proposed closed-form approximation), and Euler integration.  It shows the position and velocity outputs over time and highlights the accuracy of CFA-CON in comparison to the other methods.", "section": "3 An approximate closed-form solution for the rollout of CON"}]