[{"figure_path": "cEb305kE1V/tables/tables_5_1.jpg", "caption": "Table 1: Performance on OASIS validation set. DIO is highly competitive with state-of-the-art DLIR methods in the in-distribution setting. Our feature learning incorporates label-aware features, which is evident from the superior performance compared to four SOTA optimization-based classical methods.", "description": "This table presents the performance comparison of the proposed DIO method with several state-of-the-art Deep Learning Image Registration (DLIR) methods and classical optimization-based methods on the OASIS dataset validation set.  The metrics used are Dice score and 95th percentile Hausdorff distance (HD95).  The results highlight DIO's competitiveness in in-domain settings and emphasize the benefit of incorporating label-aware features learned through the proposed optimization-in-the-loop framework.", "section": "4.2 Results on brain MRI registration"}, {"figure_path": "cEb305kE1V/tables/tables_7_1.jpg", "caption": "Table 2: Zero shot performance by switching optimizers at test-time. Our method is trained on the OASIS dataset with the SGD optimizer to obtain the warp field. At inference time, we use an SGD optimizer for no constraint on the warp field, and the FireANTs optimizer to ensure diffeomorphic warps. Across all architectures, the Dice Score remains robust, with only a slight dip attributed to the constraints introduced by diffeomorphic mappings. The SGD optimization introduces ~1% singularities, while FireANTs shows no singularities.", "description": "This table demonstrates the ability of the proposed method to switch optimizers at test time without retraining.  It shows the results of using two different optimizers (SGD and FireANTs) with four different network architectures on the OASIS dataset. The Dice similarity coefficient (DSC), 95th percentile Hausdorff distance (HD95), and percentage of negative Jacobians (%(||J|| <0)) are reported for each optimizer and architecture combination.", "section": "4.4 Robust feature learning enables zero-shot performance by switching optimizers at test-time"}, {"figure_path": "cEb305kE1V/tables/tables_21_1.jpg", "caption": "Table 1: Performance on OASIS validation set. DIO is highly competitive with state-of-the-art DLIR methods in the in-distribution setting. Our feature learning incorporates label-aware features, which is evident from the superior performance compared to four SOTA optimization-based classical methods.", "description": "This table presents the performance of the proposed DIO method on the OASIS validation set, comparing it against other state-of-the-art (SOTA) deep learning image registration (DLIR) methods and four SOTA optimization-based classical methods.  It shows that DIO is highly competitive with the best DLIR methods and demonstrates that its label-aware feature learning significantly improves performance compared to classical methods.", "section": "4.2 Results on brain MRI registration"}]