[{"figure_path": "hRKsahifqj/tables/tables_12_1.jpg", "caption": "Table 1: List of assets used in the environment.", "description": "This table lists the 13 assets used in the Portfolio Optimization environment of the paper.  For each asset, it provides the index number, ISIN (International Securities Identification Number), ticker symbol, and the full company name.", "section": "A.1 Financial Environment"}, {"figure_path": "hRKsahifqj/tables/tables_12_2.jpg", "caption": "Table 2: KPI estimates for assets based on 2021 (final year of the used data set, source: Refinitiv); EVIC - Enterprise value including Cash", "description": "This table presents Key Performance Indicators (KPIs) for 13 assets used in the Portfolio Optimization environment of the paper.  The KPIs include estimated total energy use and CO2 emissions to Enterprise Value Including Cash (EVIC), estimated weighted average cost of capital, estimated dividend yield, and estimated return on equity.  These metrics are calculated based on 2021 data from Refinitiv and are used to define constraints in the portfolio optimization task.", "section": "A.1 Financial Environment"}, {"figure_path": "hRKsahifqj/tables/tables_13_1.jpg", "caption": "Table 3: Server Specifications", "description": "This table presents the specifications of the nine servers used in the compute load distribution environment.  For each server, it lists the maximum compute cycles per second that can be performed.  This data is used to simulate the varying computational capabilities of servers in a data center.", "section": "A.2 Compute Environment"}, {"figure_path": "hRKsahifqj/tables/tables_13_2.jpg", "caption": "Table 4: User/Job Specifications", "description": "This table lists the specifications for each of the nine users that generate compute jobs in the compute load distribution environment.  For each user, it shows the data size in bits per job, the required compute cycles per job, the average number of jobs created per interval, and the length of each interval in seconds. These specifications are randomly sampled at the creation of the environment. ", "section": "A.2 Compute Environment"}, {"figure_path": "hRKsahifqj/tables/tables_15_1.jpg", "caption": "Table 5: The most important Parameters and Hyperparameters for Various Methods", "description": "This table compares the hyperparameters used for training the proposed PASPO method against several baseline methods for constrained reinforcement learning.  The hyperparameters include training steps, rollout length, learning rate, gradient clipping, minibatch size, optimizer, GAE lambda, discount factor, number of gradient updates per epoch, PPO clip parameter, entropy coefficient, and cost limit.  The table highlights the differences in hyperparameter settings between the PASPO method and various baselines (IPO, P3O, CUP, Lag, OptLayer, and CPO) to aid in understanding the experimental setup and potential reasons for performance differences.", "section": "5.1 Experimental Setup"}]