[{"type": "text", "text": "Streaming Bayes GFlowNets ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Tiago da Silva Getulio Vargas Foundation tiago.henrique@fgv.br ", "page_idx": 0}, {"type": "text", "text": "Daniel Augusto de Souza University College London daniel.souza.21@ucl.ac.uk ", "page_idx": 0}, {"type": "text", "text": "Diego Mesquita Getulio Vargas Foundation diego.mesquita@fgv.br ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Bayes’ rule naturally allows for inference refinement in a streaming fashion, without the need to recompute posteriors from scratch whenever new data arrives. In principle, Bayesian streaming is straightforward: we update our prior with the available data and use the resulting posterior as a prior when processing the next data chunk. In practice, however, this recipe entails i) approximating an intractable posterior at each time step; and ii) encapsulating results appropriately to allow for posterior propagation. For continuous state spaces, variational inference (VI) is particularly convenient due to its scalability and the tractability of variational posteriors, For discrete state spaces, however, state-of-the-art VI results in analytically intractable approximations that are ill-suited for streaming settings. To enable streaming Bayesian inference over discrete parameter spaces, we propose streaming Bayes GFlowNets (abbreviated as SB-GFlowNets) by leveraging the recently proposed GFlowNets — a powerful class of amortized samplers for discrete compositional objects. Notably, SB-GFlowNet approximates the initial posterior using a standard GFlowNet and subsequently updates it using a tailored procedure that requires only the newly observed data. Our case studies in linear preference learning and phylogenetic inference showcase the effectiveness of SB-GFlowNets in sampling from an unnormalized posterior in a streaming setting. As expected, we also observe that SB-GFlowNets is significantly faster than repeatedly training a GFlowNet from scratch to sample from the full posterior. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "One of the foundations of the Big Data revolution in the sciences and engineering is the use of streaming data that is continuously collected and meant to be processed as it arrives. Many of the large statistical models in use were first formulated for the batched i.i.d. data setting and updating such models in this setting is a challenge of its own, as it would naively require us to revisit all past data at each update to avoid forgetting. [19, 39] In this context, Bayesian inference appears as a natural starting point to learning in the streaming data setting due to its innate property of coherence [5], which allows learning can happen continuously, independently of how the data is chunked into packages or ordered. More specifically, given a prior distribution $p(\\theta)$ and a data generating likelihood $\\bar{p}(y_{i}\\mid\\bar{\\theta})$ , the posterior distribution over a set of data $p(\\theta\\mid y_{1},{\\bar{y_{2}}})\\propto p(y_{2}\\mid\\theta)\\bar{p}(y_{1}\\mid\\theta)\\bar{p}(\\theta)$ , can be written as $p(\\bar{y_{2}}\\mid\\theta)p(\\theta\\mid y_{1})$ , where first we compute the posterior over $y_{1}$ and then used as a prior to compute the posterior over $y_{2}$ . As conveniently summarized by Lindley [33]: “Today’s posterior is tomorrow’s prior\". ", "page_idx": 0}, {"type": "text", "text": "Nonetheless, Bayesian inference is notoriously known for being hard to obtain closed-form solutions. The gold standard of approximate methods, Markov chain Monte Carlo (MCMC), requires that the prior and likelihood distributions probability density/mass functions can be evaluated, however, as it can only obtain samples from posterior, using the previous posterior as the prior of the next time-step requires additional work [6]. Thus, variational inference (VI), another popular approximate Bayes method, appears as the best fit as its foundation lies in directly parameterizing the approximate posterior distribution instead of relying on empirical distributions of samples. ", "page_idx": 0}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "Importantly, many problems of interest are built upon a discrete set of parameters. In Bayesian phylogenetic inference (BPI), for example, we are concerned with topologies of phylogenetic trees describing the evolutionary genetic history of a population. This is a especially compelling application of streaming Bayes, allowing researchers to update posteriors over the phylogenetic trees as they decode new nucleobases in genetic sequences — without reprocessing previously decoded nucleobases. In practice, phylogenetic analyses might involve hundreds of thousands of nucleobases. ", "page_idx": 1}, {"type": "text", "text": "Nonetheless, popular methods for VI over discrete posteriors typically rely on gradient-based optimization (e.g., to maximize evidence lower bounds), requiring the modeling of discrete parameters as transformed versions of latent continuous ones [20, 25, 36]. For methods using VI, a discrete posterior distribution with support over a set of size $N$ would require variational posteriors of dimension $N$ , implying either the storage of large covariance matrices of order $N^{2}$ , in the case of continuous reparameterizations, or the use of massively simplifying assumptions such as mean-field, reducing the expressivity of the variational posterior. As an example of support size for discrete distributions, the number of graphs with $N$ nodes grows asymptotically as ${\\sqrt{2^{N(N-1)}}}/N!$ [16]. ", "page_idx": 1}, {"type": "text", "text": "In this work, we leverage Generative Flow Networks (GFlowNets) [2, 3, 30] to efficiently address the implementation of approximate Bayesian models defined on a discrete set of parameters within a streaming data setting. In summary, GFlowNets are a family of amortized VI methods for highdimensional discrete parameter spaces, that learn the policies of a finite-horizon Markov decision process (MDP) by minimizing a loss function enforcing a balance condition. The condition, in turn, provably ensures that the samples generated from the MDP are correctly distributed. Notably, despite their successful deployment in solving a wide range of problems ([11, 12, 22–24, 32, 34, 63]), previous approaches assumed that the target (posterior) distribution did not change in time. Hence, this is the first work handling the training of GFlowNets in dynamic environments. ", "page_idx": 1}, {"type": "text", "text": "More specifically, we propose two novel training schemes to enable GFlowNets on streaming settings. The first consists of directly enforcing a streaming balance condition, which induces a least-squares loss that can be optimized in an off-policy fashion, potentially avoiding issues such as mode collapse. Alternatively, we leverage the well-known relationship between GFlowNets and VI to develop an on-policy divergence-minimizing algorithm that often exhibits faster training convergence when the target distribution is not very sparse. We also analyze theoretically how local errors accumulate through posterior propagation, providing upper bounds on the approximation quality of models learned using both of our update schemes. ", "page_idx": 1}, {"type": "text", "text": "In summary, our main contributions are: ", "page_idx": 1}, {"type": "text", "text": "1. We propose a streaming balance condition and a corresponding provably correct algorithm enabling the training of GFlowNets in a streaming data setting (Algorithm 1), without the need to revisit past data;   \n2. We devise an alternative VI algorithm employing low-variance gradient estimators to train to update GFlowNets in streaming fashion (Section 3). ;   \n3. We theoretically analyze how inaccuracies of individual updates propagate to subsequent posterior approximations, bounding the approximation errors accumulated through repeated streaming updates of the model (Section 4);   \n4. We demonstrate the correctness and effectiveness of our method in a series of streaming tasks, such as Bayesian linear preference learning with integer-valued features (Section 5.2) and online Bayesian phylogenetic inference (Section 5.3). ", "page_idx": 1}, {"type": "text", "text": "2 Preliminaries ", "text_level": 1, "page_idx": 1}, {"type": "text", "text": "Notation and definitions. Let $\\mathcal{X}$ be a set of compositional objects (e.g., trees with nine nodes) and ${\\mathcal{S}}\\supseteq{\\mathcal{X}}$ be an extension of $\\mathcal{X}$ (e.g., forests with nine nodes). Define $\\boldsymbol{\\mathcal{G}}=\\left(\\boldsymbol{S},\\mathbf{A}\\right)$ as a directed acyclic graph (DAG) with nodes in $\\boldsymbol{S}$ , adjacency matrix A, and the following properties: (i) $\\mathcal{G}$ is weakly connected; (ii) there is an unique state $s_{o}\\in\\mathcal S\\setminus\\mathcal X$ without any incoming edges; and (iii) there are no edges leaving $x$ for every $x\\in\\mathscr{X}$ . We call $\\boldsymbol{S}$ the set of states, $\\mathcal{G}$ the state graph, and $\\mathcal{X}$ the set of terminal states; $s_{o}$ is called the initial state. A forward policy over $\\mathcal{G}$ is a function $p_{F}(v,w)\\colon S\\times S\\to\\mathbb{R}_{+}$ such that it defines a probability distribution over $\\boldsymbol{S}$ with support on $v$ ’s children in $\\mathcal{G}$ . A backward policy is a forward policy over $\\mathcal{G}^{\\boldsymbol{\\mathsf{T}}}=(S,\\mathbf{A}^{\\boldsymbol{\\mathsf{T}}})$ . To alleviate notation, we denote the set of trajectories that ends in $x$ as $\\{\\tau\\mid\\tau\\rightsquigarrow x\\}$ , and define a probability distribution in this set as $\\begin{array}{r}{p_{F}(\\tau)=\\dot{\\prod}_{i}p_{F}(s_{i},s_{i+1})}\\end{array}$ and the probability of the backwards trajectory condition on the end point $x$ as $\\begin{array}{r}{p_{B}(\\tau\\mid x)=\\prod_{i}p_{B}(s_{i+1},s_{i})}\\end{array}$ . ", "page_idx": 1}, {"type": "text", "text": "", "page_idx": 2}, {"type": "text", "text": "GFlowNets. We define a GFlowNet as a tuple $G=(\\mathcal{G},p_{F},p_{B},Z)$ specifying a state graph $\\mathcal{G}$ , forward $p_{F}$ and backward $p_{B}$ policies, and an estimate $Z$ of a normalizing constant. A GFlowNet induces a probability distribution over $\\mathcal{X}$ through its forward policy, $\\begin{array}{r}{p_{\\top}(x)\\bar{:}=\\sum_{\\tau\\sim x}p_{F}(\\tau)}\\end{array}$ pF (τ). When there is no risk of ambiguity, we will generally omit $\\mathcal{G}$ from this notation.  We also drop $Z$ when training the GFlowNet with a criterion that does not require it. Following the common convention, we parameterize the forward network by a neural network, and the backward policy at each state is left fixed as a uniform distribution. ", "page_idx": 2}, {"type": "text", "text": "The task a GFlowNet is trained for is to match its induced distribution $p_{\\top}(x)$ with a target distribution $\\pi(x)\\propto\\tilde{\\pi}(x)$ , where $\\tilde{\\pi}(\\boldsymbol{x})$ is an unnormalized distribution. In practice, the agreement between $p_{\\top}$ and $\\pi$ can be enforced by a balance condition over trajectories, avoiding references to $p_{\\top}$ . For instance, we may enforce trajectory balance (TB) condition, $Z p_{F}(\\tau)\\,=\\,p_{B}^{\\bar{}}(\\tau\\mid x)\\tilde{\\pi}(x)$ for all $\\tau\\ \\xrightarrow{}\\ x$ , to estimate the parameters of the GFlowNet by minimizing ", "page_idx": 2}, {"type": "equation", "text": "$$\n\\mathcal{L}_{T B}(G)=\\underset{\\tau\\sim\\xi}{\\mathbb{E}}\\left[\\left(\\log\\frac{Z p_{F}(\\tau)}{p_{B}(\\tau\\mid x)\\tilde{\\pi}(x)}\\right)^{2}\\right],\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "where $\\xi$ is a base policy with full support on the space of complete trajectories, i.e., trajectories starting at $s_{o}$ and terminating at $s_{f}$ . Then, we can use the following unbiased estimate to compute the GFlowNet’s marginal distribution over terminal states $p_{\\top}$ : ", "page_idx": 2}, {"type": "equation", "text": "$$\np_{\\top}(x)=\\mathbb{E}_{\\tau\\sim p_{B}(\\cdot|x)}\\left[\\frac{p_{F}(\\tau)}{p_{B}(\\tau|x)}\\right]\\approx\\frac{1}{K}\\sum_{1\\leq i\\leq k}\\frac{p_{F}(\\tau_{i})}{p_{B}(\\tau_{i}|x)}.\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "For a thorough review of GFlowNets, please refer to [3]. ", "page_idx": 2}, {"type": "text", "text": "GFlowNets and VI. Malkin et al. [38] showed that the training of GFlowNets may be framed as a variational inference on the target $p_{B}(\\tau)\\,\\propto\\,\\tilde{\\pi}(x)p_{B}(\\tau|x)$ with $p_{F}$ as the proposal distribution. Through the data processing inequality, they showed that the minimization of the Kullback-Leibler (KL) divergence between trajectory-level distributions $p_{F}$ and $p_{B}$ incurred in a marginal $p_{\\top}$ over $\\mathcal{X}$ matching the target, namely, $\\mathcal{D}_{K L}[p_{F}||p_{B}]\\geq\\mathcal{D}_{K L}[p_{\\top}||\\pi]$ . Then, they demonstrated the equivalence between the gradients of the on-policy TB loss and the $\\mathrm{KL}$ divergence, and that the latter is a sound learning objective for GFlowNets. Here, we build upon this construction to design a KL divergence-based algorithm for updating GFlowNets in a streaming context. ", "page_idx": 2}, {"type": "text", "text": "Problem description. We assume that the data is drawn from a distribution $f(\\cdot\\vert x)$ indexed by a parameter $x\\in\\mathscr{X}$ and we define $\\pi(x)$ as a prior distribution over $\\mathcal{X}$ . Let $(D_{i})_{i\\geq1}$ be a sequence of continually collected independent data sets and $\\pi_{t}(x|\\mathcal{D}_{1},\\ldots,\\mathcal{D}_{t})\\propto f(\\mathcal{D}_{1},\\ldots,\\bar{\\mathcal{D}}_{t}|x)\\pi(x):=\\tilde{\\pi}_{t}(x)$ be the posterior conditioned on the first $t$ data sets. Note that, due to coherence, we can also write $\\tilde{\\pi}_{t}(x)\\overset{.}{=}f({\\cal D}_{t}|x)\\tilde{\\pi}_{t-1}(x)$ . ", "page_idx": 2}, {"type": "text", "text": "3 Streaming Bayes GFlowNets ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "In this section, we propose streaming Bayes GFlowNets (SB-GFlowNets) as an extension of GFlowNets to handle streaming data. In essence, an SB-GFlowNet $G_{t+1}$ avoids evaluating $\\tilde{\\pi}_{t+1}(x)$ , which would require revisiting all the previous data, by maintaining an SB-GFlowNet $G_{t}$ which targets previous posterior $\\tilde{\\pi}_{t}(\\boldsymbol{x})$ , allowing the target distribution of $G_{t+1}$ to be $f(\\mathcal Ḋ D_{t+1}|x)p_{\\mathsf{T}}^{(t)}(x)$ , where $p_{\\mathsf{T}}^{(t)}(x)$ is the induced distribution of $G_{t}$ , thus avoiding the storage of previous data sets. ", "page_idx": 2}, {"type": "text", "text": "We propose two strategies for matching the target distribution, enforcing the streaming balance $(S B)$ condition (Section 3.1) and applying $K L$ streaming updates (Section 3.2). Importantly, both methods require only newly observed data $\\mathcal{D}_{t+1}$ and the previously trained model, $G_{t}$ to update the posterior approximation, without revisiting past data batches $\\mathcal{D}_{1:t}$ . These conditions are extensions of TB condition and KL criterion proposed for the batched data case, each with its own strengths and weaknesses. Subsequently, we provide both a theoretical analysis (Section 4) and experimental validation (Section 5) for SB-GFLowNets. ", "page_idx": 2}, {"type": "text", "text": "3.1 Streaming balance condition. ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "In streaming settings,training a GFlowNet to sample from $\\tilde{\\pi}_{t+1}\\propto f(D_{t},\\dots,D_{1}|x)\\pi(x)$ by naively enforcing the TB condition entails numerous evaluations of the complete likelihood. However, assuming we have previously trained a GFlowNet to sample from ${\\tilde{\\pi}}_{t}(x)$ , we propose a more convenient balance condition that does not refer explicitly to previously-seen data. ", "page_idx": 3}, {"type": "text", "text": "sDaemfpinliet iporno p1o r(tSitorneaallmyi tnog  tbhea lpaonsctee rcioorn .) .T hLee ts $G_{t}=(\\mathcal{G},p_{F}^{(t)},p_{B}^{(t)},Z_{t})$ obne dait iGonF lfoowr tNheet  GtrFalionewdN teot $\\tilde{\\pi}_{t}(\\boldsymbol{x})$ $(S B)$   \n$G_{t+1}=(\\mathcal{G},p_{F}^{(t+1)},p_{B}^{(t+1)},Z_{t+1})$ , conditioned on $G_{t}$ , is defined as ", "page_idx": 3}, {"type": "equation", "text": "$$\nZ_{t+1}p_{F}^{(t+1)}(\\tau)={\\frac{f({\\mathcal{D}}_{t+1}|x)p_{F}^{(t)}(\\tau)Z_{t}}{p_{B}^{(t)}(\\tau|x)}}p_{B}^{(t+1)}(\\tau|x),\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "in which $f(\\mathcal{D}_{t+1}|x)$ is the model’s likelihood. When the backward policy does not depend on $t$ , e.g., is fixed as an uniform policy, Equation 3 reduces to $Z_{t+1}p_{F}^{(t+1)}(\\tau)=Z_{t}p_{F}^{(t)}(\\tau)f(\\mathcal{D}_{t+1}\\vert x)$ ", "page_idx": 3}, {"type": "text", "text": "Intuitively, if we consider the TB conditions for the GFlowNets $G_{t}$ and $G_{t+1}$ : ", "page_idx": 3}, {"type": "equation", "text": "$$\nZ_{t}p_{F}^{(t)}(\\tau)=\\tilde{\\pi}_{t}(x)p_{B}^{(t)}(\\tau|x)\\quad\\mathrm{~and~}\\quad Z_{t+1}p_{F}^{(t+1)}(\\tau)=f(\\mathcal{D}_{t+1}|x)\\tilde{\\pi}_{t}(x)p_{B}^{(t+1)}(\\tau|x),\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "we can re-arrange the identity for $G_{t}$ to obtain the unnormalized posterior a time $t$ , i.e., $\\tilde{\\pi}_{t}=Z\\t{p_{F}^{(t)}}\\big/{p_{B}^{(t)}}$ and, then, apply this to the TB condition of $G_{t+1}$ yielding Equation 3. ", "page_idx": 3}, {"type": "text", "text": "Naturally, the SB condition gives rise to a loss function by considering the log-squared ratio between the left- and right-hand sides of Equation 3, namely: ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\mathcal{L}_{S B}(G_{t+1};G_{t})=\\underset{\\tau\\sim\\xi}{\\mathbb{E}}\\left[\\left(\\log\\frac{Z_{t+1}p_{F}^{(t+1)}(\\tau)}{p_{B}^{(t+1)}(\\tau|x)}\\cdot\\frac{p_{B}^{(t)}(\\tau|x)}{Z_{t}p_{F}^{(t)}(\\tau)}\\cdot\\frac{1}{f(\\mathcal{D}_{t+1}|x)}\\right)^{2}\\right],\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "for a distribution $\\xi$ of full-support over trajectories. Importantly, Proposition 1 ensures that this approach results in a model sampling proportionally to $\\tilde{\\pi}_{t+1}(x)$ . ", "page_idx": 3}, {"type": "text", "text": "Proposition 1 (Soundness of $\\mathcal{L}_{S B}$ ). Assume $p_{\\top}^{(t)}(x)\\propto\\tilde{\\pi}_{t}(x)$ . Then, if $\\mathcal{L}_{S B}(G_{t+1};G_{t})=0,$ , then $p_{\\top}^{(t+1)}(x)$ samples objects from $\\mathcal{X}$ proportionally to $\\tilde{\\pi}_{t+1}(x)$ . ", "page_idx": 3}, {"type": "text", "text": "Please refer to Algorithm 1 in the supplement for a detailed description of the training of a SBGFlowNet by minimizing $\\mathcal{L}_{S B}$ . ", "page_idx": 3}, {"type": "text", "text": "3.2 Divergence-based updates of SB-GFlowNets. ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "In practice, estimating $\\log{Z_{t}}$ by learning is not straight-forward and, if not done properly, may severely damage the quality of the approximation. Divergence-based objectives provide ways to train GFlowNets without relying on estimates of $\\log{Z_{t}}$ . Indeed, as we show in our experimental results (Section 5), minimizing a divergence-based objective often leads to a better approximation than conventional approaches. However, unlike TB which allows the use of arbitrary base policies, these approaches normally require the use of $p_{\\mathsf{T}}(x)$ as the base policy which may lead to mode collapse depending on target distributions [6, 38]. ", "page_idx": 3}, {"type": "text", "text": "So, as discussed in Section 2, recall that a GFlowNet may equivalently be interpreted as a hierarchical variational model using $p_{F}(\\tau)$ as an approximation to $p_{B}\\dot{(\\tau)}\\propto\\tilde{\\pi}(x)\\dot{p}_{B}(\\tau|x)$ allowing GFlowNets to be trained by minimizing any divergence between $p_{F}$ and $p_{B}$ [38]. Based on this insight, we propose the following divergence-based training criterion for streaming GFlowNets: ", "page_idx": 3}, {"type": "text", "text": "Definition 2 (Divergence-based streaming update). Let $G_{t}=(\\mathcal{G},p_{F}^{(t)},p_{B}^{(t)})$ be a GFlowNet balanced sampling proportional to $\\tilde{\\pi}_{t}$ . For $G_{t+1}=(\\mathcal{G},p_{F}^{(t+1)},p_{B}^{(t+1)})$ and target distribution $\\pi_{t+1}$ , define the unnormalized distribution $p(\\tau)\\propto p_{F}^{(t)}(\\tau)f(\\mathcal{D}_{t+1}|x)$ over trajectories. Then, if= denotes equality up to an additive constant, ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\mathcal{L}_{K L}\\big(G_{t+1};G_{t}\\big)=\\mathbb{E}_{\\tau\\sim p_{F}^{(t+1)}}\\left[\\log\\frac{p_{F}^{(t+1)}(\\tau)}{p_{F}^{(t)}(\\tau)f(\\mathcal{D}_{t+1}|x)}\\right]\\stackrel{C}{=}\\mathcal{D}_{K L}\\left[p_{F}^{(t+1)}(\\tau)||p(\\tau)\\right],\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "is called the $K L$ ’s streaming criterion. ", "page_idx": 3}, {"type": "text", "text": "Note that when $\\mathcal{L}_{K L}$ vanishes, $p_{F}^{(t+1)}(\\tau)~\\propto~p_{F}^{(t)}(\\tau)f(\\mathcal{D}_{t+1}|x)$ for all $\\tau\\ \\ \\sim\\ \\ x$ and $x\\ \\in\\ \\mathcal{X}$ . Then, ", "page_idx": 4}, {"type": "equation", "text": "$$\np_{\\top}^{(t+1)}(x)=\\sum_{\\tau\\rightarrow x}p_{F}^{(t+1)}(\\tau)\\propto p_{\\top}^{(t)}(x)f(\\mathcal{D}_{t}|x).\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Consequently, minimizing $\\mathcal{L}_{K L}$ is a sound objective for learning to sample from $\\pi_{t+1}$ when $p_{\\top}^{(t)}(x)=$ $\\pi_{t}(x)$ . In Section 4, we quantitatively relate the accuracy of $p_{\\top}^{(t+1)}$ with that of $p_{\\mathsf{T}}^{(t)}$ when usin⊤g either Equation (4) or Equation (5) as learning objectives for the SB-GFlowNet. ", "page_idx": 4}, {"type": "text", "text": "Low-variance gradient estimators for $\\mathcal{D}_{K L}$ . Score matching estimates of the divergence’s gradients, $\\nabla_{\\theta}\\mathcal{D}_{K L}$ , are of high variance, negatively affecting the convergence speed of the trained model [42, 46, 57]. To circumvent this issue, we rely upon the REINFORCE leave-one-out (RLOO) gradient estimator [41], which employs a sample-dependent control variate to significantly reduce the noiseness of the estimated gradients. More specifically, define $\\begin{array}{r}{\\gamma(\\tau)=\\log p_{F}^{(t\\mp1)}(\\tau)\\big/p_{F}^{(t)}(\\tau)f(\\mathcal{D}_{t+1}|x)}\\end{array}$ and let $\\tau_{1},\\dots,\\tau_{k}$ be independently sampled trajectories from p(Ft+1). Also, denote by θ the parameters p(Ft+1). In this context, the RLOO estimator for the gradient of KL’s streaming criterion is ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\frac{1}{k}\\sum_{1\\le i\\le k}\\nabla_{\\theta}\\gamma(\\tau_{i})+\\frac{1}{k}\\sum_{1\\le i\\le k}\\left(\\gamma(\\tau_{i})-\\frac{1}{k-1}\\sum_{1\\le j\\le k,j\\neq i}\\gamma(\\tau_{j})\\right)\\nabla_{\\theta}\\log p_{F}^{(t+1)}(\\tau),\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "which is an unbiased estimate for $\\nabla_{\\theta}\\mathbb{E}_{\\tau\\sim p_{F}^{t+1}}[\\gamma(\\tau)]$ . Importantly, RLOO is straightforwardly represented as a vector-Jacobian product. Thus, it can be swiftly computed in standard reverse-mode autodifferentiation packages [47], adding a negligible computational overhead to the algorithm. ", "page_idx": 4}, {"type": "text", "text": "4 Theoretical analysis ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "While posterior propagation is computationally convenient, preventing training from scratch repeatedly, we should also expect errors to propagate through updates. To better understand the behavior of SB-GFlowNets, we analyze how choosing sub-optimal SB-GFlowNet at time $t$ influences our approximation’s quality at time $t+1$ . We quantify goodness-of-fit of SB-GFlowNets’ sampling distribution wrt target both in terms of TV and of their expected distance in log space. Since the SB loss and KL updates incur different parameterizations, we analyze separately the cases in which SB-GFlowNets are trained using each loss. ", "page_idx": 4}, {"type": "text", "text": "Overall, we establish that the accuracy of a SB-GFlowNet’s sampling distribution $p_{\\top}^{(t+1)}$ at time $t+1$ depends on how close the new forward policy p(Ft+1)is from being optimal, on the size of the new data chunk $\\mathcal{D}_{t+1}$ , and on the goodness-of-fit of the previous estimate $p_{\\mathsf{T}}^{(t)}$ . As expected, our analysis suggests that the negative effects of poorly learned $p_{\\top}^{(t)}$ are negligible when the size of a data chunk is relatively large. Also, when the previous SB-GFlowNet $G_{t}$ is a poor approximation to the true posterior $\\pi_{t}$ , we discuss the benefits of using an earlier and potentially more accurate checkpoint $G_{s}$ with $s<t$ as a reference for training $G_{t+1}$ . ", "page_idx": 4}, {"type": "text", "text": "4.1 Analysis for SB loss-based training ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "We first analyze how errors propagate when training SB-GFlowNets by directly enforcing the SB condition, i.e., minimizing Equation 4. To this effect, recall using the SB loss implies learning an estimate of the partition function $Z_{t}$ as well as the forward policy $\\bar{p}_{F}^{(t)}$ at each time step $t$ . In particular, Proposition 2 measures the consequences of an inaccurately learned $p_{F}^{(t)}$ and of insufficiently minimizing the SB loss on the $(t+1)\\cdot$ th approximation. ", "page_idx": 4}, {"type": "text", "text": "PGrFolpoowsNiteitos.n  L2.e t Laelts $G_{t}\\ =\\ (\\mathcal{G},p_{F}^{(t)},p_{B}^{(t)},Z_{t})$ $G_{t+1}\\ =\\ (\\mathcal{G},p_{F}^{(t+1)},p_{B}^{(t+1)},Z_{t+1})$ u rb ep ripoari rd iosf$\\pi_{t+1}(x)\\,\\propto\\,\\pi_{t}(x)f(\\mathcal{D}_{t+1}\\vert x)$ $\\pi\\colon\\mathcal{X}\\,\\rightarrow\\,\\mathbb{R}_{+}$ tribution. Defining $\\begin{array}{r}{Z_{k}^{\\star}:=\\sum_{x}\\pi(x)\\prod_{i=1}^{k}f(\\mathcal{D}_{i}|x)}\\end{array}$ for any $k>0$ , and letting (pˆ(t+1), pˆ(t+1), Zˆ ) be the optimal solution to  Equation $^{4}$ satisfying the SB condition. Then, ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\delta_{L S}^{\\pi_{t+1}}\\left(p_{\\top}^{(t+1)},\\pi_{t+1}\\right)\\leq\\delta_{L S}^{\\pi_{t+1}}\\left(p_{\\top}^{(t+1)},\\hat{p}_{\\top}^{t+1}\\right)+\\left|\\log\\frac{\\hat{Z}_{t+1}}{Z_{t+1}^{\\star}}\\right|+\\delta_{L S}^{\\pi_{t+1}}\\left(p_{\\top}^{(t)},\\pi_{t}\\right)+\\left|\\log\\frac{Z_{t}}{Z_{t}^{\\star}}\\right|,\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $\\delta_{L S}^{\\xi}(p,q):=\\big(\\mathbb{E}_{x\\sim\\xi}[\\log p(x)-\\log q(x)]^{2}\\big)^{1/2}.$ ", "page_idx": 5}, {"type": "text", "text": "As expected, Proposition 2 underlines the importance of starting with a good approximation from the tth stage and of properly solving the learning problem at the $(t+1)\\mathrm{th}$ stage in order to obtain an accurate approximation to $\\pi_{t+1}$ . In particular, this result reveals the detrimental effect of an inadequately estimated partition function on the quality of GFlowNet’s streaming updates. ", "page_idx": 5}, {"type": "text", "text": "Complementary, Proposition 3 provides an upper bound the TV distance between $p_{F}^{(t+1)}$ and $p_{B}^{(t+1)}(\\tau):=p_{B}^{(t+1)}(\\tau|x)\\pi_{t+1}(x)$ p(Bt+1)(τ|x)πt+1(x). Besides corroborating the conclusions of Proposition 2, the explicit dependence of the TV upper bound on of $\\mathcal{D}_{t+1}$ allows for analyzing it as a function of the newly observed data set’s likelihood $f(\\mathcal D_{t+1}|x)$ . In particular, consider the case in which $|\\mathcal{D}_{t+1}|\\to\\infty$ . Then, since $f(\\mathcal D_{t+1}|x)\\to0$ uniformly on $x$ and, for many models, $f(\\mathcal{D}_{t+1}|\\hat{x})/f(\\mathcal{D}_{t+1}|y)\\to\\infty$ for $y\\not\\in\\arg\\operatorname*{max}_{x}f(D|x)$ . Then, the accuracy of $p_{\\top}^{(t)}$ becomes negligible to the overall approximation of the full posterior when the newly observed data set $\\mathcal{D}_{t+1}$ is relatively large and the second term in Proposition 3 approximately vanishes. ", "page_idx": 5}, {"type": "text", "text": "Proposition 3. Let $\\begin{array}{r}{T V(p,q)\\,:=\\,\\frac{1}{2}\\sum_{x\\in\\mathcal{X}}|p(x)-q(x)|}\\end{array}$ be the TV distance between probability distributions $p$ and $q$ . Then, under the same setting of Proposition 2, ", "page_idx": 5}, {"type": "equation", "text": "$$\nT V\\left(p_{\\top}^{(t+1)},\\pi_{t+1}\\right)\\leq T V\\left(p_{\\top}^{(t+1)},\\hat{p}_{\\top}^{(t+1)}\\right)+\\frac{1}{2}\\cdot f(\\mathcal{D}_{t+1}|\\hat{x})\\cdot\\sum_{x\\in\\mathcal{X}}\\left|\\frac{Z_{t}}{Z_{t+1}}p_{\\top}^{(t)}(x)-\\frac{Z_{t}^{\\star}}{Z_{t+1}^{\\star}}\\pi_{t}(x)\\right|,\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "in which $\\begin{array}{r}{\\hat{x}\\in\\arg\\operatorname*{max}_{x\\in\\mathcal{X}}f(\\mathcal{D}_{t+1}|x)}\\end{array}$ is the maximum likelihood instance in $\\mathcal{X}$ for $\\mathcal{D}_{t+1}$ . ", "page_idx": 5}, {"type": "text", "text": "4.2 Analysis for $\\mathbf{KL}$ streaming criterion-based training ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "We now turn to the case in which SB-GFlowNets are trained with KL streaming updates, sequentially minimizing Equation 5 — in which case we only learn the forward a backward policy networks. More specifically, Proposition 4 provides an upper bound on the TV distance between $p_{\\top}^{(t+1)}$ and $\\pi_{t+1}$ as a function of $f(\\mathcal{D}_{t+1}|x)$ , $p_{\\mathsf{T}}^{(t)}$ ’s closeness to $\\pi_{t}$ , and the learning objective. ", "page_idx": 5}, {"type": "text", "text": "Proposition 4. Recall that $p(\\tau)\\propto p_{F}^{(t)}(\\tau)f(\\mathcal{D}_{t+1}|x)$ . Thus, under the notations of Proposition 2, ", "page_idx": 5}, {"type": "equation", "text": "$$\nT V\\left(p_{\\top}^{(t+1)},\\pi_{t+1}\\right)\\leq\\underbrace{\\frac{1}{2}\\sqrt{\\mathcal{D}_{K L}\\left[p_{F}^{(t+1)}||p\\right]}}_{E s t i m a t i o n\\,e r r o r}+\\underbrace{T V\\left(\\frac{p_{\\top}^{(t)}(\\cdot)f(\\mathcal{D}_{t+1}|\\cdot)}{\\mathbb{E}_{y\\sim p_{\\top}^{(t)}}\\left[f(\\mathcal{D}_{t}|y)\\right]},\\frac{\\pi_{t}(\\cdot)f(\\mathcal{D}_{t+1}|\\cdot)}{\\mathbb{E}_{y\\sim\\pi_{t}}\\left[f(\\mathcal{D}_{t}|y)\\right]}\\right)}_{A_{c o u s t o r s\\,\\alpha\\ell_{n}(t)}}.\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "In spite of considering a different learning objective compared to Proposition 3, Proposition 4 reinforces the importance of properly optimizing the loss in each time step — due to its compounding impact on SB-GFlowNet’s accuracy. Nonetheless, the quality of $\\pi_{t}$ is roughly negligible when the observed data set $f(\\mathcal{D}_{t+1}|\\cdot)$ dominates the shape of $p_{\\top}^{(t)}(\\cdot)f(D_{t+1}|\\cdot)$ — and of $\\pi_{t}(\\cdot)f(D_{t+1}|\\cdot)$ . ", "page_idx": 5}, {"type": "text", "text": "5 Experiments ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "We show that SB-GFlowNets can accurately learn the posterior distribution conditioned on the streaming data for one toy and two practically relevant applications. To start with, Section 5.1 illustrates the applicability of SB-GFlowNets in the context of set generation. Nextly, Section 5.2 showcases the correctness of SB-GFlowNets in the problem of Bayesian linear preference learning with integervalued features [8]. Then, Section 5.3 indicates the potential of SB-GFlowNets for carrying out online Bayesian inference over phylogenetic trees [13, 15, 58]. Finally, Section 5.4 touches on the problem of Bayesian structure learning with streaming data. To the best of our knowledge, SB-GFlowNets are the first method enabling variational inference over discrete parameter spaces within a streaming setting, as previous approaches either relied on intractable continuous relaxations [20, 25, 36] or scaled poorly in the size of the target’s support [55]. We provide further implementation details regarding model configurations and experimental settings in Appendix C. ", "page_idx": 5}, {"type": "text", "text": "5.1 Set generation ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "Problem description. We first remark that, if $R_{1},\\ldots,R_{k+1}$ are positive functions on $\\mathcal{X}$ , the problem of streaming Bayesian inference may be generalized to the problem of sampling from $\\mathcal{X}$ proportionally to the product $\\textstyle\\prod_{i=1}^{k+1}R_{i}$ by having only access to $R_{k+1}$ and to a GFlowNet approximating $\\textstyle\\prod_{i=1}^{k}R_{i}$ . Indeed, in the context Bayesian inference, this correspondence is achieved by defining $R_{i}(x)\\,:=\\,f(\\mathcal{D}_{i}|x)$ for $i\\,>\\,1$ and $\\dot{R_{1}(x)}\\,=\\,f(\\mathcal{D}_{1}|x)\\pi(x)$ . Thus, to demonstrate the effectiveness of SB-GFlowNets and highlight the benefits and pitfalls of each proposed training scheme, we consider the set generation task — a popular toy experiment in the GFlowNet literature [3, 44, 53]. In this task, $\\mathcal{X}$ is the space of sets with $S$ elements extracted from a fixed deposit $\\mathcal{T}=\\{1,\\ldots,d\\}$ . Then, for $i\\in\\{1,\\ldots,K\\}$ , we define $f_{i}\\colon\\mathcal{T}\\rightarrow\\mathbb{R}$ and let $\\begin{array}{r}{\\log R_{i}(x)=\\sum_{e\\in x}\\dot{f}_{i}(e)}\\end{array}$ be the ith log-reward of a set $x$ . ", "page_idx": 5}, {"type": "image", "img_path": "Nv0Vvz588D/tmp/fa1a4b88247ab14ebc797bb75550289b104b59762f713a60e84e5e3f8a1a4cfd.jpg", "img_caption": ["Figure 1: SB-GFlowNets learn an accurate approximation to a changing target distribution in a streaming setting for the task of set generation. Each plot depicts the target and learned distributions from the first (left-most) to the last (right-most) streaming update. "], "img_footnote": [], "page_idx": 6}, {"type": "text", "text": "", "page_idx": 6}, {"type": "text", "text": "Experimental setup. We fix $d=24$ and $S=18$ . To define $R_{i}$ , we independently sample $f_{i}(d)$ from an uniform distribution on $[-5,5]$ . Correspondingly, we define $R_{i}^{(\\alpha)}:=R_{i}^{1/\\alpha}$ as the tempered reward, noting that $R_{i}^{(\\alpha)}$ becomes increasingly sparse as $\\alpha\\rightarrow0$ . ", "page_idx": 6}, {"type": "table", "img_path": "", "table_caption": ["Table 1: TV between the GFlowNet and the target. TB outperforms KL for sparse targets (small $\\alpha$ ). "], "table_footnote": [], "page_idx": 6}, {"type": "text", "text": "tween our two training schemes in terms of the target’s temperature. For relatively sparse targets (with $\\alpha\\,<\\,1)$ ), the benefits of off-policy sampling enacted by the minimization of the TB loss lead to a better performance relatively to ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\begin{array}{c c}{{\\frac{\\alpha}{\\mathrm{TB}}\\left|\\begin{array}{c c}{{1.00}}&{{0.75}}\\\\ {{0.21\\pm0.06}}\\\\ {{{\\bf0.13\\pm0.03}}}\\end{array}\\right|\\begin{array}{c c}{{0.75}}&{{0.50}}\\\\ {{{\\bf0.28\\pm0.10}}}\\\\ {{{\\bf0.17\\pm0.04}}}\\end{array}\\right|\\begin{array}{c c}{{{\\bf0.55}\\pm0.38}}\\\\ {{{\\bf0.36}\\pm0.24}}\\\\ {{{\\bf0.55}\\pm0.38}}\\end{array}\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "the KL-minimizing algorithm. Indeed, the on-policy exploration employed by the latter potentially hinders the model’s capabilities of finding the sparsely distributed high-probability regions of the target, slowing down the training convergence and potentially leading to mode collapse [38]. Also, albeit one could implement an IS estimator for off-policy training under the KL criterion, our early experiments suggested that the increased gradient variance outweighed the gains from enhanced exploration. Ultimately, the choice of an appropriate learning objective for training GFlowNets will depend on the application. For training SB-GFlowNets, Figure 1 shows that both TB and KL minimization result in accurate approximations to the changing posterior. ", "page_idx": 6}, {"type": "text", "text": "5.2 Linear preference learning with integer-valued features ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "Problem description. Consider a collection of instances $\\{y_{i}\\}$ endowed with a transitive and complete preference relation $\\succeq$ ; we assume that each $y_{i}\\in\\{1,0\\}^{d}$ is a binary feature vector. Naturally, the preference relation $\\succeq$ is represented as a mapping $u$ such that $y\\succ y^{\\prime}$ if and only if $u(y)>\\dot{u}(y^{\\prime})$ ; uncovering $u$ is the major goal of preference learning methods. Similarly to [8, 21], we here assume that $u$ is a linear function, $u(y)\\doteq x^{T}y$ , for a integer-valued vector $x$ and that we have access to a data set $\\mathbf{y}=\\{(y_{i1},y_{i2},p_{i})\\}_{i}$ denoting whether $y_{i1}$ is preferred to $y_{i2}$ ${p}_{i}=1\\$ ) or otherwise $(p_{i}=0)$ ) for a fixed individual. Subsequently, we define the probabilistic model ", "page_idx": 6}, {"type": "equation", "text": "$$\np(p_{i}=1|x,(y_{i1},y_{i2})):=\\sigma(u(y_{i1})-u(y_{i2}))=\\sigma\\left(x^{T}(y_{i1}-y_{i2})\\right),\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "in which $\\sigma$ is the sigmoid function, and a prior distribution $\\pi(x)$ over $x$ [18]; the intuition is that a larger difference between $y_{i1}$ and $y_{i2}$ ’s utilities makes the event in which $y_{i1}$ is preferred over $y_{i2}$ more likely. Our goal is to infer the individual’s preferences based on the posterior $\\pi(x|\\mathbf{y})$ for some unseen pair $(\\tilde{y}_{1},\\tilde{y}_{j})$ , i.e., to estimate the predictive distribution $p(\\tilde{y}|(\\tilde{y}_{1},\\tilde{y}_{2}\\overline{{)}},\\mathbf{y})$ . ", "page_idx": 6}, {"type": "text", "text": "Experimental setup. We assume $x\\in[[0,4]]^{d}$ and $d=24$ . At each iteration of the streaming process, we sample a novel subset of the $2^{d-1}\\cdot(2^{d}-1)$ pairs of $d$ -dimensional binary feature vectors and use them to update the GFlowNet. The prior on $x$ is a factorized truncated Poisson with $\\lambda=3$ . ", "page_idx": 6}, {"type": "image", "img_path": "Nv0Vvz588D/tmp/7d5a25501f28cce8e6e0b7134a8d75af19a9a2b7525f9ecf1230760de50af3cc.jpg", "img_caption": ["Figure 2: SB-GFlowNet accurately learns the posterior over the utility’s parameters in a streaming setting. Each plot compares the marginal distribution learned by SB-GFlowNet (horizontal axis) and the targeted posterior distribution (vertical axis) at increasingly advanced stages of the streaming process, i.e., from $\\pi_{1}(\\cdot|\\mathcal{D}_{1})$ (left-most) to $\\pi_{8}\\!\\left(\\cdot|\\mathcal{D}_{1:8}\\right)$ (right-most). "], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "Results. Figure 2 shows SB-GFlowNet correctly samples form the posterior in a streaming setting. Note, in particular, that the GFlowNet maintains a high distributional accuracy throughout the streaming iterations. Correspondingly, the predictive log-likelihood of a fixed held out data set monotonically increases as a function of the amount of data consumed by the SB-GFlowNet, as shown in Figure 3; this behavior, also exhibited by the true posterior [54], emphasizes the similarity between the learned and targeted distributions. ", "page_idx": 7}, {"type": "image", "img_path": "Nv0Vvz588D/tmp/c1c2af214fdd9a048d4892dd5a46ff1bf5fae66055e267f3bca8d9002940361b.jpg", "img_caption": ["Figure 3: Predictive performance of SB-GFlowNets in terms of pred. NLL and avg. MSE. SB-GFlowNets behaves similarly to the ground-truth, wrt how the NLL evolves as a function of data chunks. "], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "5.3 Online Bayesian phylogenetic inference ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "Problem description. Bayesian phylogenetic inference (BPI) [29, 59] aims to infer structural properties of evolutionary trees given molecular sequences such as DNA and RNA. Formally, let $\\{S_{1},\\ldots,S_{N}\\}$ be a collection of $N$ DNA sequences of size $M$ , $S_{i}\\in\\{A,T,C,G\\}^{M}$ , one for each biological species. We define a phylogeny as a tuple $T=(t,\\mathbf{b})$ comprising a rooted tree topology $t$ and its non-negative branch lengths b. In this context, a rooted tree topology is a complete binary tree having $N$ labeled leaves corresponding to the considered species and $N-1$ unlabeled internal nodes corresponding to their ancestors. To carry out Bayesian inference over the space of phylogenies, we adopt Jukes & Cantor’s nucleotide substitution model (JC69; [26]) to define a observational model over the observed DNA sequences; to calculate the likelihood, we use Felsenstein’s algorithm [15]. ", "page_idx": 7}, {"type": "text", "text": "Crucially, despite the popularity of BPI methods, the development of new sequencing technologies has swiftly led to the enlargement of already sizeable sequence databases. In this scenario, maintaining an up-to-date estimate of the posterior became an increasingly difficult task due to the necessity of re-estimating the full posterior from scratch every time a new batch of data is collected. In the following, we show that GFlowNets, which have recently shown SOTA performance in BPI [63], can also accurately update the posterior on phylogenetic trees given additional sequences. ", "page_idx": 7}, {"type": "text", "text": "Experimental setup. We generate the data by simulating JC69’s model for a collection of $N=7$ species and a substitution rate of $\\lambda=5{\\cdot}10^{-1}$ (see [58], Chapter 1). At each iteration, we sample a new DNA subsequence of size $10^{2}$ for each species and update SB-GFlowNet according to Algorithm 1. For Table 2, $\\left\\vert\\mathcal{D}_{1}\\right\\vert=10^{3}$ and $|\\mathcal{D}_{2}|=10^{2}$ . The prior is an uniform distibution over phylogenies. ", "page_idx": 7}, {"type": "text", "text": "Results. Figure 4 (left) shows that the learned posterior distribution gets increasingly concentrated on the true phylogenetic tree; this behavior, which is inherent to posteriors over phylogenies under uniform priors [50], emphasizes the similarity between the learned and targeted distributions for SB-GFlowNets. Figure 4 (right), on the other hand, also suggets that the model’s accuracy decreases as a function of the number of streaming updates. Nonetheless, we believe that this is predominantly caused by the poste", "page_idx": 7}, {"type": "image", "img_path": "Nv0Vvz588D/tmp/513567c64ffcd2f6d084aaf573e67342995fe612dc33e7c7cd1433e41eff1b8b.jpg", "img_caption": ["Figure 4: SB-GFlowNet’s accurate fit to the true posterior in terms of the probability of the true phylogeny (left) and of the learned model’s accuracy (right). "], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "rior’s increasing sparsity due to the expanding data sets [50], which makes it more difficult for the GFlowNet to learn a good approximation [11], instead of by an intrinsic limitation of SB-GFlowNets. An investigation of this phenomenon and of the conditions upon which re-train the SB-GFlowNet ", "page_idx": 7}, {"type": "text", "text": "Table 2: SB-GFlowNet significantly accelerates the training of GFlowNets in a streaming setting. Indeed, SB-GFlowNets achieve an accuracy comparable to a GFlowNet trained from scratch to sample from $\\pi_{2}(\\cdot|\\mathcal{D}_{1:2})$ in less than half the time (measured in seconds per $20\\mathbf{k}$ epochs). ", "page_idx": 8}, {"type": "table", "img_path": "Nv0Vvz588D/tmp/c4d500517756460050cf1375c6d010869720860f5cc2d45e4646bd328469e464.jpg", "table_caption": ["Number of leaves "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "based on an earlier checkpoint due to the accumulated unreliability of the streaming updates, as described by Proposition 4, is left application-dependent and is thereby left to future endeavors. Finally, Table 2 shows that SB-GFlowNets, which avoids evaluating the full posterior, more than halve the training time required by a standard GFlowNet, while achieving a similar performance in terms of the total variation $(T V)$ distance between the learned and target distributions. ", "page_idx": 8}, {"type": "text", "text": "5.4 Bayesian structure learning ", "text_level": 1, "page_idx": 8}, {"type": "image", "img_path": "Nv0Vvz588D/tmp/473a2a0d924c0ff7fbaf143c6febf2d8901b2954a63193e54b34175036d6b262.jpg", "img_caption": ["Figure 5: SB-GFlowNets accurately learns a distribution over DAGs for causal discovery in each time step. At each update, an additional dataset of 200 points was sampled from the true model. For this problem, we implemented a DAG-GFlowNet on 5-variable data sets, similarly to [11, Figure 3]. "], "img_footnote": [], "page_idx": 8}, {"type": "text", "text": "Problem description. Let $\\mathbf{X}\\,\\in\\,\\mathbb{R}^{n\\times d}$ be a data set distributed according to a linear Gaussian structural equation model (SEM), i.e., $\\mathbf{X}=\\beta\\mathbf{X}+\\pmb{\\epsilon}.$ , in which $\\beta\\in\\mathbb{R}^{d\\times d}$ is a (sparse) matrix and $\\pmb{\\epsilon}\\in\\mathbb{R}^{n\\times d}$ are ${\\it n d}$ i.i.d. samples from a normal distribution. We assume that the adjacency matrix induced by $\\beta$ , $[\\beta\\neq0]\\in\\{1,0\\}^{d\\times d}$ , characterizes a directed acyclic graph on the dataset’s variables. In this case, the linear Gaussian SEM represents a Bayesian network, and it is the goal of Bayesian structure learning algorithms to find such a network based on the observed $\\mathbf{X}$ [11]. Although this problem has been studied beyond the constraints of linear models governed by Gaussian distributions [12], we focus on a simplified setting in this section. In particular, given a sequence $\\{\\mathbf{X}_{t}\\}_{t\\ge1}$ of i.i.d. realizations of a linear Gaussian SEM, we define a belief distribution over Bayesian networks $\\mathcal{N}=(\\{1,\\ldots,d\\},\\mathbf{A})$ on variables $\\{1,\\ldots,d\\}$ and adjacency matrix $\\mathbf{A}$ as ", "page_idx": 8}, {"type": "equation", "text": "$$\n\\log R_{t}(\\mathcal{N})=\\operatorname*{max}_{\\substack{\\beta:\\;[\\beta\\neq0]=\\mathbf{A}}}\\ell\\left(\\beta|\\mathbf{X}_{t}\\right)\\;\\mathrm{and}\\;R_{1:t}(\\mathcal{N})=\\prod_{1\\leq i\\leq t}R_{t}(\\mathcal{N}),\n$$", "text_format": "latex", "page_idx": 8}, {"type": "text", "text": "in which $\\ell(\\beta|\\mathbf{X}_{t})$ is the log-likelihood of $\\mathbf{X}_{t}$ under the linear Gaussian SEM parameterized by $\\beta$ . SB-GFlowNets can naturally handle streaming inference for this model by casting each $R_{t}$ as a subposterior distribution — in the same fashion of the set generation task in Section 5.1. ", "page_idx": 8}, {"type": "text", "text": "Experimental setup. Likewise Deleu et al. [11, Figure 5], we evaluate SB-GFlowNets on models with $d=5$ variables. Also, we sample a new 200-sized data set from a fixed linear Gaussian SEM for each streaming update of the GFlowNet. To ensure that the generated samples are valid DAGs, we adopt Deleu et al. [11]’s DAG-GFlowNet. ", "page_idx": 8}, {"type": "text", "text": "Results. Our results corroborate the findings of Section 5.3. On the one hand, Figure 5 highlights that our SB-GFlowNet can accurately learn a distribution over DAGs across a range of streaming updates. On the other hand, Figure 5 shows that the probability mass assigned by the SB-GFlowNet to the true DAG responsible for the data-generating process increases as more samples are incorporated into the belief distribution. Hence, SB-GFlowNets abide by the desiradata of a streaming algorithm for Bayesian inference. ", "page_idx": 8}, {"type": "image", "img_path": "Nv0Vvz588D/tmp/7f093d06b3a831cd67a10aa69bd4a77b6a22227f29a7a893ed35e6791df4ee42.jpg", "img_caption": ["Figure 6: The probability mass on the true DAG increases as more samples are added to SB-GFlowNet. "], "img_footnote": [], "page_idx": 8}, {"type": "text", "text": "6 Related works ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "Applications of GFlowNets. GFlowNets [2, 3, 30] were originally proposed as reinforcement learning algorithms to train a stochastic policy to sample states proportionally to a prescribed reward function, From this point on, GFlowNets were widely applied to problems as diverse as probabilistic modeling [23, 60], combinatorial optimization [61], Bayesian causal discovery [11, 12] and phylogenetic inference [63], symbolic regression [32], stochastic control [30], language modeling [22], and Bayesian deep learning [34]. Recently, there is an increasing literature concerned with the possibility of composing multiple pre-trained GFlowNets to fit them to specific applications [17] and to accelerate training convergence [31]. In this context, we show how the composition of two GFlowNets through the SB condition leads to an efficient learning algorithm for Bayesian inference under a streaming setting. ", "page_idx": 9}, {"type": "text", "text": "Streaming Variational Bayes. Streaming, Distributed, Asynchronous (SDA) Bayes [6] was originally presented as a general framework for implementing variational inference algorithms in a streaming setting. Similarly to our work, it was based upon the principle that, if the variational distribution $q^{(t)}(x)$ is a good approximation to the unnormalized posterior $\\tilde{\\pi}_{t}(\\boldsymbol{x})$ , then ${\\boldsymbol{q}}^{(t+1)}(\\boldsymbol{x})$ may be optimized to approximate $q^{(t)}(x)f(D_{t}|x)$ instead of $f(\\mathcal Ḋ D Ḍ _{t}|x)\\tilde{\\pi}_{t}(x)$ . This framework was instantiated to accommodate, for example, the learning of Gaussian processes [7], of tensor factorization [14], of feature models [51] and, jointly with SMC, nonlinear state-space models [62]. Nonetheless, our work is the first one to enable the training of GFlowNets in a streaming setting and, due to the relationship between GFlowNets and variational inference algorithms presented by [38], may be viewed as an instance of SDA-Bayes tailored to inferential problems on a combinatorial support. In the realm of approximate Bayesian inference, Akhound-Sadegh et al. [1], Berner et al. [4], Sendera et al. [52], Zhang and Matsen [59] propose advancements in diffusion-based sampling methods, which we believe could be extended to the context of approximate streaming Bayesian inference via the techniques presented in this work. On the other hand, Mittal et al. [40] introduces an neural network-based approach for approximate Bayesian inference that amortizes over exchangeable data sets to handle posterior inference in novel data. Also, Richter and Berner [48], Richter et al. [49] develop a low-variance gradient estimator for carrying out variational inference derived from the log-variance loss, which could be employed as an alternative to our KL-based objective for streaming updates of GFlowNets. On a broader scale, Cranmer et al. [9] reviews approximate Bayesian methodology under the lens of simulation-based inference. ", "page_idx": 9}, {"type": "text", "text": "7 Conclusions, limitations, and outlook ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "Conclusions. We proposed the first method for carrying out approximate Bayesian inference over discrete distributions within a streaming setting, called SB-GFlowNet. We proposed two training/update schemes for SB-GFlowNet, as well as a theoretical analysis accounting for the compounding effect of errors due to posterior propagation. Our experimental evaluation showcases SB-GFlowNet‘s effectiveness in accurately sampling from the target posterior — while still achieving a significant reduction in training time relative to standard GFlowNets. ", "page_idx": 9}, {"type": "text", "text": "Limitations. Proposition 2 and Proposition 4 suggest that an inappropriate approximation to $\\pi_{t}$ may be propagated through time and lead to increasingly inaccurate models. This phenomenon, known as catasthropic forgetting in the online literature [19, 39], may eventually demand retraining of the current SB-GFlowNet based on an earlier checkpoint or on the full posterior. We also note that unlike traditional variational methods, where the expressiveness of the approximation family is explicitly chosen, the expressiveness implied by different parametrizations of GFlowNets is not clear. We believe this is a fruitful avenue for future investigation. ", "page_idx": 9}, {"type": "text", "text": "Outlook and future works As our proposal provides generic and efficient streaming variational inference solution for discrete parameters, we believe it will allow the use of streaming discrete Bayesian inference to more datasets and to less explored research domains. In this work, we proposed two training criteria based on the trajectory balance condition and the KL criterion, nonetheless, these are not the only training schemes for GFlowNets, we believe other proposed criteria such as detailed balance [3] or the sub-trajectory balance [35] could be adapted for the streaming setting as well. Additionally, due to the flexibility of GFlowNets in sampling unnormalized distributions, our proposal can be extended to different divergences and generalized likelihoods to improve the predictive quality of the learned posteriors [28]. Finally, the problem of updating a GFlowNet when the size of the generated object changes, e.g., when a new species is observed during BPI, remains open. ", "page_idx": 9}, {"type": "text", "text": "Acknowledgements ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "This work was supported by the Fundação Carlos Chagas Filho de Amparo à Pesquisa do Estado do Rio de Janeiro FAPERJ (SEI-260003/000709/2023), the São Paulo Research Foundation FAPESP (2023/00815-6), the Conselho Nacional de Desenvolvimento Científico e Tecnológico CNPq (404336/2023-0), and the Silicon Valley Community Foundation through the University Blockchain Research Initiative (Grant #2022-199610). ", "page_idx": 10}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "[1] T. Akhound-Sadegh, J. Rector-Brooks, A. J. Bose, S. Mittal, P. Lemos, C.-H. Liu, M. Sendera, S. Ravanbakhsh, G. Gidel, Y. Bengio, N. Malkin, and A. Tong. Iterated denoising energy matching for sampling from Boltzmann densities. arXiv preprint arxiv:2402.06121, 2024.   \n[2] E. Bengio, M. Jain, M. Korablyov, D. Precup, and Y. Bengio. Flow network based generative models for non-iterative diverse candidate generation. In Advances in Neural Information Processing Systems (NeurIPS), 2021.   \n[3] Y. Bengio, S. Lahlou, T. Deleu, E. J. Hu, M. Tiwari, and E. Bengio. GFlowNet foundations. Journal of Machine Learning Research (JMLR), 24(210), 2023.   \n[4] J. Berner, L. Richter, and K. Ullrich. An optimal control perspective on diffusion-based generative modeling. arXiv preprint arxiv:2211.01364, 2024.   \n[5] P. G. Bissiri, C. Holmes, and S. Walker. A general framework for updating belief distributions. Journal of the Royal Statistical Society: Series B (Methodological), 78(5), 2016.   \n[6] T. Broderick, N. Boyd, A. Wibisono, A. C. Wilson, and M. I. Jordan. Streaming variational Bayes. In Advances in Neural Information Processing Systems (NeurIPS), 2013.   \n[7] T. D. Bui, C. Nguyen, and R. E. Turner. Streaming sparse Gaussian process approximations. Advances in Neural Information Processing Systems (NeurIPS), 2017.   \n[8] T. J. Cole. Algorithm AS 281: Scaling and rounding regression coefficients to integers. Applied Statistics, 42(1), 1993.   \n[9] K. Cranmer, J. Brehmer, and G. Louppe. The frontier of simulation-based inference. Proceedings of the National Academy of Sciences, 117(48), 2020.   \n[10] I. Csiszár and J. Körner. Information theory: coding theorems for discrete memoryless systems. Cambridge University Press, 2011.   \n[11] T. Deleu, A. Góis, C. C. Emezue, M. Rankawat, S. Lacoste-Julien, S. Bauer, and Y. Bengio. Bayesian structure learning with generative flow networks. In Conference on Uncertainty in Artificial Intelligence (UAI), 2022.   \n[12] T. Deleu, M. Nishikawa-Toomey, J. Subramanian, N. Malkin, L. Charlin, and Y. Bengio. Joint Bayesian inference of graphical structure and parameters with a single generative flow network. In Advances in Neural Information Processing Systems (NeurIPS), 2023.   \n[13] V. Dinh, A. E. Darling, and F. A. Matsen, IV. Online Bayesian phylogenetic inference: Theoretical foundations via sequential Monte Carlo. Systematic Biology, 67(3), 2017.   \n[14] S. Fang, Z. Wang, Z. Pan, J. Liu, and S. Zhe. Streaming Bayesian deep tensor factorization. In International Conference on Machine Learning (ICML), 2021.   \n[15] J. Felsenstein. Evolutionary trees from DNA sequences: A maximum likelihood approach. Journal of Molecular Evolution, 17, 1981.   \n[16] P. Flajolet and R. Sedgewick. Analytic Combinatorics. Cambridge University Press, 1 edition, 2009.   \n[17] T. Garipov, S. D. Peuter, G. Yang, V. Garg, S. Kaski, and T. S. Jaakkola. Compositional sculpting of iterative generative processes. In Advances in Neural Information Processing Systems (NeurIPS), 2023.   \n[18] J. González, Z. Dai, A. Damianou, and N. D. Lawrence. Preferential Bayesian optimization. In International Conference on Machine Learning (ICML), 2017.   \n[19] I. J. Goodfellow, M. Mirza, X. Da, A. C. Courville, and Y. Bengio. An empirical investigation of catastrophic forgeting in gradient-based neural networks. In International Conference on Learning Representations (ICLR), 2014.   \n[20] J. Han, F. Ding, X. Liu, L. Torresani, J. Peng, and Q. Liu. Stein variational inference for discrete distributions. In International Conference on Artificial Intelligence and Statistics (AISTATS), 2020.   \n[21] J. C. Hornberger, H. Habraken, and D. A. Bloch. Minimum data needed on patient preferences for accurate, efficient medical decision making. Medical Care, 33(3), 1995.   \n[22] E. J. Hu, M. Jain, E. Elmoznino, Y. Kaddar, G. Lajoie, Y. Bengio, and N. Malkin. Amortizing intractable inference in large language models. arXiv preprint arxiv:2310.04363, 2023.   \n[23] E. J. Hu, N. Malkin, M. Jain, K. E. Everett, A. Graikos, and Y. Bengio. GFlowNet-EM for learning compositional latent variable models. In International Conference on Machine Learning (ICML), 2023.   \n[24] M. Jain, S. C. Raparthy, A. Hernandez-Garcia, J. Rector-Brooks, Y. Bengio, S. Miret, and E. Bengio. Multi-objective GFlowNets. In International Conference on Machine Learning (ICML), 2023.   \n[25] E. Jang, S. Gu, and B. Poole. Categorical reparameterization with Gumbel-softmax. In International Conference on Learning Representations (ICLR), 2017.   \n[26] T. H. Jukes and C. R. Cantor. Evolution of protein molecules. In Mammalian Protein Metabolism. Academic Press, 1969.   \n[27] D. P. Kingma and J. Ba. Adam: A method for stochastic optimization. arXiv preprint arxiv:1412.6980, 2014.   \n[28] J. Knoblauch, J. Jewson, and T. Damoulas. An optimization-centric view on Bayes’ rule: Reviewing and generalizing variational inference. Journal of Machine Learning Research (JMLR), 23(132), 2022.   \n[29] O. Kviman, R. Molén, and J. Lagergren. Improved variational Bayesian phylogenetic inference using mixtures. arXiv preprint arxiv:2310.00941, 2023.   \n[30] S. Lahlou, T. Deleu, P. Lemos, D. Zhang, A. Volokhova, A. Hernández-García, L. N. Ezzine, Y. Bengio, and N. Malkin. A theory of continuous generative flow networks. In International Conference on Machine Learning (ICML), 2023.   \n[31] E. Lau, N. M. Vemgal, D. Precup, and E. Bengio. DGFN: Double generative flow networks. In NeurIPS 2023 Generative AI and Biology (GenBio) Workshop, 2023.   \n[32] S. Li, I. Marinescu, and S. Musslick. Gfn-sr: Symbolic regression with generative flow networks. arXiv preprint arxiv:2312.00396, 2023.   \n[33] D. V. Lindley. Bayesian statistics: A review. SIAM, 1972.   \n[34] D. Liu, M. Jain, B. F. P. Dossou, Q. Shen, S. Lahlou, A. Goyal, N. Malkin, C. C. Emezue, D. Zhang, N. Hassen, X. Ji, K. Kawaguchi, and Y. Bengio. GFlowOut: Dropout with generative flow networks. In International Conference on Machine Learning (ICML), 2023.   \n[35] K. Madan, J. Rector-Brooks, M. Korablyov, E. Bengio, M. Jain, A. C. Nica, T. Bosc, Y. Bengio, and N. Malkin. Learning GFlowNets from partial episodes for improved convergence and stability. In International Conference on Machine Learning (ICML), 2022.   \n[36] C. J. Maddison, A. Mnih, and Y. W. Teh. The concrete distribution: A continuous relaxation of discrete random variables. In International Conference on Learning Representations (ICLR), 2017.   \n[37] N. Malkin, M. Jain, E. Bengio, C. Sun, and Y. Bengio. Trajectory balance: Improved credit assignment in GFlowNets. In Advances in Neural Information Processing Systems (NeurIPS), 2022.   \n[38] N. Malkin, S. Lahlou, T. Deleu, X. Ji, E. Hu, K. Everett, D. Zhang, and Y. Bengio. GFlowNets and variational inference. International Conference on Learning Representations (ICLR), 2023.   \n[39] M. McCloskey and N. J. Cohen. Catastrophic interference in connectionist networks: The sequential learning problem. In Psychology of Learning and Motivation, volume 24. Academic Press, 1989.   \n[40] S. Mittal, N. L. Bracher, G. Lajoie, P. Jaini, and M. A. Brubaker. Exploring exchangeable dataset amortization for Bayesian posterior inference. In ICML 2023 Workshop on Structured Probabilistic Inference / Generative Modeling, 2023.   \n[41] A. Mnih and D. Rezende. Variational inference for Monte Carlo objectives. In International Conference on Machine Learning (ICML), 2016.   \n[42] S. Mohamed, M. Rosca, M. Figurnov, and A. Mnih. Monte Carlo gradient estimation in machine learning. Journal of Machine Learning Research (JMLR), 21(132), 2020.   \n[43] M. Newman. Networks. Oxford University Press, 2018.   \n[44] L. Pan, N. Malkin, D. Zhang, and Y. Bengio. Better training of GFlowNets with local credit and incomplete trajectories. In International Conference on Machine Learning (ICML), 2023.   \n[45] L. Pan, D. Zhang, M. Jain, L. Huang, and Y. Bengio. Stochastic generative flow networks. In Conference on Uncertainty in Artificial Intelligence (UAI), 2023.   \n[46] M. Papini, D. Binaghi, G. Canonaco, M. Pirotta, and M. Restelli. Stochastic variance-reduced policy gradient. In International Conference on Machine Learning (ICML), 2018.   \n[47] A. Paszke, S. Gross, F. Massa, A. Lerer, J. Bradbury, G. Chanan, T. Killeen, Z. Lin, N. Gimelshein, L. Antiga, A. Desmaison, A. Kopf, E. Yang, Z. DeVito, M. Raison, A. Tejani, S. Chilamkurthy, B. Steiner, L. Fang, J. Bai, and S. Chintala. PyTorch: An imperative style, high-performance deep learning library. In Advances in Neural Information Processing Systems (NeurIPS), 2019.   \n[48] L. Richter and J. Berner. Improved sampling via learned diffusions. arXiv preprint arxiv:2307.01198, 2023.   \n[49] L. Richter, A. Boustati, N. Nüsken, F. Ruiz, and O. D. Akyildiz. Vargrad: a low-variance gradient estimator for variational inference. Advances in Neural Information Processing Systems (NeurIPS), 33, 2020.   \n[50] A. RoyChoudhury, A. Willis, and J. Bunge. Consistency of a phylogenetic tree maximum likelihood estimator. Journal of Statistical Planning and Inference, 161, 2015.   \n[51] R. Schaeffer, Y. Du, G. K. Liu, and I. Fiete. Streaming inference for infinite feature models. In International Conference on Machine Learning (ICML), 2022.   \n[52] M. Sendera, M. Kim, S. Mittal, P. Lemos, L. Scimeca, J. Rector-Brooks, A. Adam, Y. Bengio, and N. Malkin. On diffusion models for amortized inference: Benchmarking and improving stochastic control and sampling. arXiv preprint arxiv:2307.01198, 2024.   \n[53] M. W. Shen, E. Bengio, E. Hajiramezanali, A. Loukas, K. Cho, and T. Biancalani. Towards understanding and improving GFlowNet training. In International Conference on Machine Learning (ICML), 2023.   \n[54] A. M. Walker. On the asymptotic behaviour of posterior distributions. Journal of the Royal Statistical Society: Series B (Methodological), 31(1), 1969.   \n[55] M. T. Wojnowicz, S. Aeron, E. L. Miller, and M. Hughes. Easy variational inference for categorical models via an independent binary approximation. In International Conference on Machine Learning (ICML), 2022.   \n[56] K. Xu, W. Hu, J. Leskovec, and S. Jegelka. How powerful are graph neural networks? International Conference on Learning Representations (ICLR), 2019.   \n[57] P. Xu, F. Gao, and Q. Gu. An improved convergence analysis of stochastic variance-reduced policy gradient. In Conference on Uncertainty in Artificial Intelligence (UAI), 2020.   \n[58] Z. Yang. Molecular Evolution: A Statistical Approach. Oxford University Press, 2014.   \n[59] C. Zhang and F. A. Matsen, IV. Variational Bayesian phylogenetic inference. In International Conference on Learning Representations (ICLR), 2019.   \n[60] D. Zhang, N. Malkin, Z. Liu, A. Volokhova, A. Courville, and Y. Bengio. Generative flow networks for discrete probabilistic modeling. In International Conference on Machine Learning (ICML), 2022.   \n[61] D. Zhang, H. Dai, N. Malkin, A. Courville, Y. Bengio, and L. Pan. Let the flows tell: Solving graph combinatorial optimization problems with GFlowNets. In Advances in Neural Information Processing Systems (NeurIPS), 2023.   \n[62] Y. Zhao, J. Nassar, I. Jordan, M. Bugallo, and I. M. Park. Streaming variational Monte Carlo. IEEE Transactions on Pattern Analysis and Machine Intelligence, 45(1), 2023.   \n[63] M. Y. Zhou, Z. Yan, E. Layne, N. Malkin, D. Zhang, M. Jain, M. Blanchette, and Y. Bengio. PhyloGFN: Phylogenetic inference with generative flow networks. In International Conference on Learning Representations (ICLR), 2024.   \nRequire: $\\left(\\mathscr{D}_{t}\\right)_{T\\geq t\\geq1}$ streaming data sets, $f(\\cdot\\vert x)$ a likelihood model parametrized by $x$ , $\\pi(x)$ a prior distribution over $\\bar{\\mathcal X}$   \nEnsure: $G_{T}$ samples proportionally to $\\left(\\prod_{t=1}^{T}f(\\mathcal{D}_{t}|x)\\right)\\pi(x)$ $\\begin{array}{r l}{G_{1}\\gets(p_{F}^{1},p_{B}^{1},Z_{1}):=\\underset{\\substack{\\eta_{F},\\,\\eta_{B},Z}}{\\mathrm{arg\\,min}}\\,\\mathbb{E}_{\\tau\\sim\\xi}\\,[\\mathcal{L}_{T B}(\\tau;p_{F},p_{B},Z)]}&{\\,\\,\\triangleright\\,\\mathrm{Roughly\\,\\,minimize}\\,\\,\\mathcal{L}_{T B}\\,\\,\\mathrm{via}\\,\\mathbb{S}}\\end{array}$ GD pF ,pB,Z for $t$ in $\\{2,\\ldots,T\\}$ do $\\triangleright$ Roughly minimize $\\mathcal{L}_{S B}$ via SGD $G_{t}\\gets(p_{F}^{(t)},p_{B}^{(t)},Z_{t}):=\\underset{p_{F},p_{B},Z}{\\arg\\operatorname*{min}}~\\mathbb{E}_{\\tau\\sim p_{\\top}^{(t-1)}}\\left[\\mathcal{L}_{S B}(\\tau;p_{F},p_{B},Z;G_{t-1})\\right]$ ", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "", "page_idx": 13}, {"type": "text", "text": "", "page_idx": 14}, {"type": "equation", "text": "", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "A Training of SB-GFlowNets ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Algorithm 1 outlines the training of a SB-GFlowNet by minimizing the SB loss. As we described in the text, the first GFlowNet is trained conventionally by approximately minimizing either the TB loss or the KL divergence between the forward and backward policies. Then, the subsequent models are trained by the approximate minimization of either the SB loss or streaming balance criterion. Notably, the problem of streaming update may be framed as the learning of GFlowNets with stochastic rewards [45], which are not determistically associated to the terminal states. ", "page_idx": 14}, {"type": "text", "text": "B Proofs ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "B.1 Proof of Proposition 1 ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "We are assuming that $p_{\\top}^{(t)}\\propto\\pi_{t}$ and that $\\mathbb{E}_{\\tau\\sim\\xi}[\\mathcal{L}_{S B}(\\tau)]=0$ for a distribution $\\xi$ of full support. Thus, $\\mathcal{L}_{S B}(\\tau)=0$ for all $\\tau$ . As a consequence, ", "page_idx": 14}, {"type": "equation", "text": "$$\np_{F}^{(t+1)}(\\tau)=\\left(\\frac{p_{B}^{(t+1)}(\\tau|x)}{p_{B}^{(t)}(\\tau|x)}\\right)\\cdot\\frac{Z_{t}}{Z_{t+1}}\\cdot p_{F}^{(t)}(\\tau)f(\\mathcal{D}_{t+1}|x).\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "By assumption, $(p_{F}^{(t)},p_{B}^{(t)},Z_{t})$ satisfy the trajectory balance condition with respect to $\\pi_{t}$ , therefore, $Z_{t}\\cdot p_{F}^{(t)}(\\tau)=p_{B}^{(t)}(\\tau|x)\\pi_{t}(x)$ . Thus, ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\frac{p_{F}^{(t+1)}(\\tau)}{p_{B}^{(t+1)}(\\tau|x)}=Z_{t+1}\\pi_{t}(x)f(\\mathcal{D}_{t+1}|x).\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "Finally, by summing over $\\tau\\rightsquigarrow x$ : ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{p_{\\top}^{(t+1)}(x):=\\mathbb{E}_{\\tau\\sim p_{B}^{(t+1)}(\\cdot\\vert x)}\\left[\\frac{p_{F}^{(t+1)}(\\tau)}{p_{B}^{(t+1)}(\\tau\\vert x)}\\right]\\propto\\pi_{t}(x)f(\\mathcal{D}_{t+1}\\vert x)}\\\\ &{\\qquad\\qquad\\propto\\pi_{t+1}(x).}\\end{array}\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "B.2 Proof of Proposition 2 ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Firstly, we note that $\\delta_{L S}^{\\xi}(p,q)$ is a metric. Thus, by the triangle inequality, ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\delta_{L S}^{\\pi_{t+1}}\\left(p_{\\top}^{(t+1)},\\pi_{t+1}\\right)\\leq\\delta_{L S}^{\\pi_{t+1}}\\left(p_{\\top}^{(t+1)},\\hat{p}_{\\top}^{(t+1)}\\right)+\\delta_{L S}^{\\pi_{t+1}}\\left(\\hat{p}_{\\top}^{(t+1)},\\pi_{t+1}\\right).}\\end{array}\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "The first term of the right-hand-side of the preceding equation corresponds to the estimation error associated to the GFlowNet’s learning problem. For the second term, note that $\\hat{p}_{\\top}^{(t+1)}(x)=$ $\\begin{array}{r}{\\frac{Z_{t}}{\\hat{Z}_{t+1}}p_{\\top}^{(t)}(x)f(\\mathcal{D}_{t+1}\\vert x)}\\end{array}$ by assumption $(\\hat{p}_{\\top}^{(t+1)}$ satisfies the SB condition). Thus, ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\log\\hat{p}_{\\top}^{(t+1)}(x)-\\log\\pi_{t+1}(x)=\\log\\displaystyle\\frac{Z_{t}}{\\hat{Z}_{t+1}}+\\log p_{\\top}^{(t)}(x)f(\\mathcal{D}_{t+1}|x)-\\log\\displaystyle\\frac{Z_{t}^{\\star}\\pi_{t}(x)}{Z_{t+1}^{\\star}}f(\\mathcal{D}_{t+1}|x)}\\\\ &{\\qquad\\qquad\\qquad\\qquad\\qquad\\qquad=\\log\\displaystyle\\frac{Z_{t+1}^{\\star}}{\\hat{Z}_{t+1}}+\\log\\displaystyle\\frac{Z_{t}}{Z_{t}^{\\star}}+\\log\\displaystyle\\frac{p_{\\top}^{(t)}(x)}{\\pi_{t}(x)}.}\\end{array}\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "The result follows by a further application of the triangle inequality to δπLtS+1 $\\delta_{L S}^{\\pi_{t+1}}\\left(p_{\\top}^{(t+1),\\star},\\pi_{t+1}\\right)$ namely, ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\delta_{L S}^{\\pi_{t+1}}\\left(\\hat{p}_{\\top}^{(t+1)},\\pi_{t+1}\\right)=\\mathbb{E}_{x\\sim\\pi_{t+1}}\\left[\\left(\\log\\frac{Z_{t+1}^{\\star}}{\\hat{Z}_{t+1}}+\\log\\frac{Z_{t}}{Z_{t}^{\\star}}+\\log\\frac{p_{\\top}^{(t)}(x)}{\\pi_{t}(x)}\\right)^{2}\\right]^{1/2}}\\\\ &{\\qquad\\qquad\\leq\\left|\\log\\frac{\\hat{Z}_{t+1}}{Z_{t+1}^{\\star}}\\right|+\\left|\\log\\frac{Z_{t}}{Z_{t}^{\\star}}\\right|+\\delta_{L S}^{\\pi_{t+1}}\\left(p_{\\top}^{(t)},\\pi_{t}\\right).}\\end{array}\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "Proposition 2 is obtained by plugging Equation 15 into Equation 14. ", "page_idx": 15}, {"type": "text", "text": "B.3 Proof of Proposition 3 ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "This result, which follows from reasoning similar to the one in Proposition 2 above, aims to show the dependence of the model’s performance on the newly observed dataset. In this sense, notice that ", "page_idx": 15}, {"type": "equation", "text": "$$\nT V\\left(p_{\\top}^{(t+1)},\\pi_{t+1}\\right)\\leq T V\\left(p_{\\top}^{(t+1)},\\hat{p}_{\\top}^{(t+1)}\\right)+T V\\left(\\hat{p}_{\\top}^{(t+1)},\\pi_{t+1}\\right).\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "Thus, since $\\begin{array}{r}{\\hat{p}_{\\top}^{(t+1)}(x)=\\frac{Z_{t}}{\\hat{Z}_{t+1}}p_{\\top}^{(t)}(x)f(\\mathcal{D}_{t+1}\\vert x).}\\end{array}$ ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\begin{array}{l}{{\\displaystyle T V\\left(\\hat{p}_{\\top}^{(t+1)},\\pi_{t}\\right)=\\frac{1}{2}\\sum_{x\\in\\mathcal{X}}\\left|p_{\\top}^{(t+1)}(x)-\\pi_{t+1}(x)\\right|}}\\\\ {{\\displaystyle\\qquad\\qquad\\qquad=\\frac{1}{2}\\sum_{x\\in\\mathcal{X}}f(\\mathcal{D}_{t+1}|x)\\left|\\frac{Z_{t}}{\\hat{Z}_{t+1}}p_{\\top}^{(t)}(x)-\\frac{Z_{t}^{\\star}}{Z_{t+1}^{\\star}}\\pi_{t}(x)\\right|}}\\\\ {{\\displaystyle\\qquad\\qquad\\qquad\\leq\\frac{1}{2}f(\\mathcal{D}_{t+1}|\\hat{x})\\sum_{x\\in\\mathcal{X}}\\left|\\frac{Z_{t}}{\\hat{Z}_{t+1}}p_{\\top}^{(t)}(x)-\\frac{Z_{t}^{\\star}}{Z_{t+1}^{\\star}}\\pi_{t}(x)\\right|.}}\\end{array}\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "The result follows by plugging Equation 17 into Equation 16. ", "page_idx": 15}, {"type": "text", "text": "B.4 Proof of Proposition 4 ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "This result follows from the successive application of the triangle, Pinsker‘s [10] and Jensen’s inequality applied to the KL divergence. More specifically, first note that the optimal distribution under the KL streaming criterion satisfies $\\hat{p}_{\\top}^{(t+1)}\\propto p_{\\top}^{(t)}f(D_{t+1}|x)$ . Then, by the triangle inequality, ", "page_idx": 15}, {"type": "equation", "text": "$$\nT V\\left(p_{\\top}^{(t+1)},\\pi_{t+1}\\right)\\leq T V\\left(p_{\\top}^{(t+1)},\\hat{p}_{\\top}^{(t+1)}\\right)+T V\\left(\\hat{p}_{\\top}^{(t+1)},\\pi_{t+1}\\right).\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "For the first term, note that ", "page_idx": 15}, {"type": "equation", "text": "$$\nT V\\left(p_{\\top}^{(t+1)},\\hat{p}_{\\top}^{(t+1)}\\right)\\leq\\frac{1}{2}\\sqrt{\\mathcal{D}_{K L}\\left[p_{\\top}^{(t+1)}||\\hat{p}_{\\top}^{(t+1)}\\right]}\\leq\\frac{1}{2}\\sqrt{\\mathcal{D}_{K L}\\left[p_{F}^{(t+1)}||p\\right]},\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "since pˆF $\\hat{p}_{F}^{(t+1)}\\propto p$ by definition; recall that $p(\\tau)=p_{F}^{(t)}(\\tau)f(\\mathcal{D}_{t+1}\\vert x)$ . Here, the first inequality follows from Pinsker’s inequality and the second one, from the data-processing inequality. For the second term, note that ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\hat{p}_{\\top}^{(t+1)}(x)=\\frac{p_{\\top}^{(t)}(x)f(\\mathcal{D}_{t+1}|x)}{\\sum_{y\\in\\mathcal{X}}p_{\\top}^{(t)}(y)f(\\mathcal{D}_{t+1}|y)}=\\frac{p_{\\top}^{(t)}(x)f(\\mathcal{D}_{t+1}|x)}{\\mathbb{E}_{y\\in p_{\\top}^{(t)}}\\left[f(\\mathcal{D}_{t+1}|x)\\right]},\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "with a corresponding representation of $\\pi_{t+1}$ as a function of $\\pi_{t}$ and $f(\\mathcal{D}_{t+1}|x)$ . The result follows by pluggin Equation 20 and Equation 19 into Equation 18. ", "page_idx": 15}, {"type": "text", "text": "C Experimental details ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "We provide below details for reproducing our experiments for each considered generative task. To approximately solve the optimization problem outlined in Algorithm 1, we employed the Adam optimizer [27] with a learning rate of $10^{-3}$ for the $p_{F}$ ’s parameters and $10^{-1}$ for $\\log{Z_{t}}$ , following recommendations from [37]. Also, we linearly decreased the learning rate during training. Experiments were run in a cluster equipped with A100 and V100 GPUs, using a single GPU per run. ", "page_idx": 15}, {"type": "image", "img_path": "Nv0Vvz588D/tmp/e720a885c36c70014b14642daf8af8caf04578034d993fa59168a8c64519b776.jpg", "img_caption": ["Figure 7: Illustration of the task of generating sets of size $|S|\\,=\\,2$ with elements in $\\{1,2,3\\}$ . On each streaming update, a novel reward function $R_{i}^{(\\alpha)}$ is observed; a small value of $\\alpha$ entails a more sparse and harder-to-sample-from distribution. Terminal states $\\mathcal{X}$ are illustrated in green and non-terminal states are depicted in blue. At the tth iteration, we learn a generative model $p_{\\top}^{(t)}$ sampling $S\\in\\mathcal{X}$ proportionally to $\\textstyle\\prod_{1\\leq i\\leq t}R_{t}^{(\\alpha)}(S)$ . "], "img_footnote": [], "page_idx": 16}, {"type": "text", "text": "C.1 Set generation ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Experimental setup. We fixed $d=24$ and $S=18$ . To parameterize the forward policy, we implemented an two-layer neural network with a 128-dimensional latent embedding. For the streaming updates, we fixed $\\alpha=1$ and randomly sampled the objects’ utilities at each novel iteration. We trained the model by minimizing the KL streaming criterion. ", "page_idx": 16}, {"type": "text", "text": "GFlowNet’s design. To generate a set $x\\in\\mathscr{X}$ , we iteratively add elements randomly sampled from $\\mathcal{T}$ to an initially empty $x$ until $x$ has size $S$ ; see Figure 7. The forward policy is parameterized as a two-layer neural network and the backward policy is fixed as an uniform distribution. ", "page_idx": 16}, {"type": "text", "text": "C.2 Linear preference learning with integer-valued features ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Experimental setup. We assume that $x\\in[[0,4]]^{d}$ and $d=24$ and that the data was simulated from the observational model. At each streaming round, a novel and independent data set was simulated and the model was trained by minimizing the SB loss. To parameterize the forward policy, we implemented an MLP with $2\\,64$ -dimensional layers receiving the padded parameter $x$ as an input and returning a probability distribution over $[[0,4]]$ . ", "page_idx": 16}, {"type": "text", "text": "GFlowNet’s design. The generative process implemented by the GFlowNet consists of, starting at an initially empty state $x_{o}$ , iteratively sampling a value from $[[0,10]]$ and appending this value to the current state until its length reaches $d$ . To parameterize the forward policy, we use an MLP with two 64-dimensional layers that receives the padded state as a fixed-size input. ", "page_idx": 16}, {"type": "text", "text": "C.3 Online Bayesian phylogenetic inference ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Experimental setup. We assume the observational data follow the J&C69 mutation model with an instantaneous mutation rate of $\\lambda=5\\cdot10^{-3}$ . The data was synthetically generated from the corresponding observational model conditioned on a randomly sampled tree with 7 leaves, and this process was repeated at each streaming round. To illustrate the computational gains enacted by the implementation of SB-GFlowNets in Table 2, we considered updating a GFlowNet trained on an initially large data set according to the newly observed and relatively small biological sequences, which is a common challenge faced by practitioners. Then, by avoiding the additional log-likelihood evaluations, we achieved significantly faster inference. ", "page_idx": 16}, {"type": "text", "text": "GFlowNet’s design. A state consists of a forest of complete binary trees. Initially, all leaves are roots of their own singleton trees and, at each iteration of the generative process, we select two trees and join their roots to a newly added unlabelled node. This procedure is finished when all leaves are connected; see [63, Figure 1] for an illustration of this generative process. To parameterize $p_{F}$ , we use a graph isomorphism network (GIN; [56]); the backward policy is fixed as uniform. ", "page_idx": 16}, {"type": "text", "text": "C.4 Bayesian structure learning ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Experimental setup. We sample each component of the error terms $\\epsilon$ from a zero-centered Gaussian distribution with standard deviation $\\sigma=5\\cdot^{\\circ}10^{-2}$ . Also, we select a random Bayesian network from a directed configuration model [43] and draw the components $\\beta$ from a corresponding standard Gaussian distribution to define the true data-generating process. To parameterize the policy network, we use an MLP with 2 128-dimensional layers receiving the DAG’s flattened adjacency matrix as input. ", "page_idx": 16}, {"type": "text", "text": "GFlowNet’s design. We adopt Deleu et al. [11]’s DAG-GFlowNet. In a nutshell, the generative process starts at an edgeless graph and each transition either adds an edge to the current state or triggers a stop. To ensure the acyclicity of the generated samples, we follow [11, Appendix C] and iteratively update a binary vector $\\mathbf{m}\\in\\{1,0\\}^{\\breve{d}\\times d}$ indicating which edges in the adjacency matrix can be safely added to the current state without forming cycles. ", "page_idx": 17}, {"type": "text", "text": "D On the permutation invariance of SB-GFlowNets ", "text_level": 1, "page_idx": 17}, {"type": "image", "img_path": "Nv0Vvz588D/tmp/42379bc46a5ca01dbb86cc92c46649568768fb468ea02c6651f27357eb6f0996.jpg", "img_caption": ["Figure 8: Permutation invariance of SB-GFlowNets for phylogenetics (a) and set generation (b). When the first GFlowNet is not adequately trained, the learned distribution after two streaming updates depends on the ordering of the observed datasets (left (a), left (b)). In contrast, when both the first and second GFlowNets are accurate, the resulting distribution is approximately invariant to the data permutation (right (a), right (b)). "], "img_footnote": [], "page_idx": 17}, {"type": "text", "text": "Exchangeability is a natural property of each case study we presented in the main text. We thus ask: are SB-GFlowNets permutation invariant? Clearly, the distribution learned by a SB-GFlowNet does not depend on the order in which the data sets are observed when the SB condition is satisfied at each streaming update; this is a direct consequence of Proposition 1. On the other hand, permutation invariance is not guaranteed when the learning objectives are only imperfectly minimized; see Figure 8 for an extreme example. To the best of our knowledge, however, this sensibility to data ordering is a property of every approximate streaming Bayesian inference method, e.g., [6, 13]. ", "page_idx": 17}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 18}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 18}, {"type": "text", "text": "Justification: Our claims are supported by proofs in Appendix B and experiments in Section 5. ", "page_idx": 18}, {"type": "text", "text": "Guidelines: ", "page_idx": 18}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 18}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 18}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Justification: The middle paragraph in Section 7 discusses limitations. ", "page_idx": 18}, {"type": "text", "text": "Guidelines: ", "page_idx": 18}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 18}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 19}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 19}, {"type": "text", "text": "Justification: Assumptions are clearly stated in the statements, and Appendix B. ", "page_idx": 19}, {"type": "text", "text": "Guidelines: ", "page_idx": 19}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 19}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 19}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 19}, {"type": "text", "text": "Justification: Details are provided in Appendix C. ", "page_idx": 19}, {"type": "text", "text": "Guidelines: ", "page_idx": 19}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce ", "page_idx": 19}, {"type": "text", "text": "the model (e.g., with an open-source dataset or instructions for how to construct the dataset). ", "page_idx": 20}, {"type": "text", "text": "(d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 20}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 20}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 20}, {"type": "text", "text": "Justification: Provided in a zip file. ", "page_idx": 20}, {"type": "text", "text": "Guidelines: ", "page_idx": 20}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 20}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 20}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 20}, {"type": "text", "text": "Justification: Provided in Appendix C. ", "page_idx": 20}, {"type": "text", "text": "Guidelines: ", "page_idx": 20}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 20}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 21}, {"type": "text", "text": "Justification: In general, plots count on error bars and tables count on standard deviation. Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 21}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 21}, {"type": "text", "text": "Justification: First paragraph of Appendix C. ", "page_idx": 21}, {"type": "text", "text": "Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 21}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 21}, {"type": "text", "text": "Justification: Our submission follows the NeurIPS ethical guidelines. Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 22}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 22}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 22}, {"type": "text", "text": "Justification: We provide a perspective on broader impacts in Section 7, but do not foresee any direct negative societal impact. ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed.   \n• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 22}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 22}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 22}, {"type": "text", "text": "Justification: We do not foresee any direct risk stemming from our work. ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images. ", "page_idx": 22}, {"type": "text", "text": "• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 23}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 23}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 23}, {"type": "text", "text": "Justification: All code was made by the authors ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 23}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 23}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 23}, {"type": "text", "text": "Justification: No new assets. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 23}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 23}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 23}, {"type": "text", "text": "Justification: No experiments with human subjects. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 24}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 24}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 24}, {"type": "text", "text": "Justification: No experiments with human subjects. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 24}]