[{"figure_path": "4wgzkAyi2D/figures/figures_0_1.jpg", "caption": "Figure 1: The main cause of the Janus Problem in SDS-based text-to-3D methods is their reliance on high-certainty 2D priors for 3D representation, which can result in heads appearing from multiple viewpoints. To address this, we introduced the LCGen method, using low-certainty generation to align viewpoints with the optimization direction.", "description": "This figure illustrates the core problem that the paper addresses: the Janus Problem.  The Janus Problem causes inconsistencies in 3D model generation from text prompts, specifically resulting in multiple views of the same feature (e.g., a head appearing from multiple angles).  The figure uses a visual example to demonstrate how the model prioritizes high-certainty areas in 2D representations, leading to the Janus Problem.  The solution proposed by the authors, LCGen, is introduced as a way to use low-certainty generation to address this issue by better aligning viewpoints with optimization direction.", "section": "1 Introduction"}, {"figure_path": "4wgzkAyi2D/figures/figures_3_1.jpg", "caption": "Figure 2: Analysis of the Janus Problem in Text-to-3D. Due to the discrete encoding of viewpoints, there is a high probability of multiple heads appearing at different positions b on the sphere.", "description": "This figure analyzes the Janus Problem in text-to-3D models.  It demonstrates how discrete viewpoint encoding leads to shared distributions that result in multiple heads appearing at various positions. Panel (a) illustrates the discretization of the sphere representing viewpoints and the resulting shared text guidance. Panel (b) shows how this leads to probability density functions for head positions, with peaks indicating where heads are most likely to appear. Panel (c) expands this to a two-dimensional representation. Panel (d) shows the resulting probability distribution in 3D space, with peaks clearly highlighting the Janus Problem (multiple heads).", "section": "3 Analysis of Janus Problem in Text-to-3D"}, {"figure_path": "4wgzkAyi2D/figures/figures_4_1.jpg", "caption": "Figure 3: Overview of LCGen. LCGen can be embedded into any SDS-based text-to-3D method, providing different guidance for various viewpoints by constraining the generation certainty, thus alleviating Janus Problem.", "description": "This figure illustrates the architecture of the Low Certainty Generation (LCGen) method.  LCGen is designed to be integrated into existing SDS-based text-to-3D models. The diagram shows how LCGen takes in a text prompt and camera parameters (c), processes these inputs through a text encoder and LCGen module, and then uses the output to guide a pre-trained diffusion model (Φ). The process generates a 3D representation (Θ), which is then rendered into 2D images from various viewpoints.  These images are compared against the diffusion model’s predictions via a Score Distillation Sampling (SDS) loss (LSDS), and the entire system is trained end-to-end. A key aspect is LCGen's constraint on generation certainty, ensuring that different viewpoints receive appropriately varied guidance, thereby reducing the inconsistencies associated with the Janus Problem.", "section": "4 LCGen: Low Certainty Generation"}, {"figure_path": "4wgzkAyi2D/figures/figures_5_1.jpg", "caption": "Figure 4: Results of Qualitative Comparison. The areas enclosed in red boxes are where the Janus Problem occurs.", "description": "This figure shows a qualitative comparison of the results from three different text-to-3D methods (DreamFusion, Magic3D, and ProlificDreamer) with and without the proposed LCGen method.  The images show different views (0°, 90°, 180°, 270°) of 3D models generated from two text prompts: \"a beagle in a detective's outfit\" and \"a fox playing the cello\". Red boxes highlight areas where the Janus Problem (inconsistencies in viewpoints) is present in the original methods. The LCGen method significantly reduces the occurrence of this problem, resulting in more consistent and realistic 3D models.", "section": "5.2 Results of LCGen"}, {"figure_path": "4wgzkAyi2D/figures/figures_7_1.jpg", "caption": "Figure 7: The impact of different choices of G(c).", "description": "This figure shows the ablation study of the hyperparameter G(c) in LCGen.  G(c) controls the preference for low-certainty generation. Three different functions for G(c) are tested: (a) a piecewise function that emphasizes low certainty when the azimuth |φ| is larger than π/6; (b) a function that emphasizes low certainty by squaring the azimuth, (φ/π)²; and (c) a linear function that simply uses |φ|/π. The results show how different choices of G(c) influence the generated images across different steps of the diffusion process.", "section": "Ablation Study"}, {"figure_path": "4wgzkAyi2D/figures/figures_7_2.jpg", "caption": "Figure 8: Visualization of Certainty after Generation w/o and w/ LCGen. The upper half of the 3D scatter plot has the camera view parameters (θ, φ) on the x and y axes, and Certainty on the z-axis. The lower half depicts the generation results from different views, along with their θ and the Certainty colors as represented in the scatter plot.", "description": "This figure visualizes the effect of LCGen on the certainty of generated images from different viewpoints. The top half shows a 3D scatter plot where the x and y axes represent camera view parameters (azimuth and elevation), and the z-axis represents certainty.  The bottom half displays images generated from various viewpoints, color-coded according to their certainty values shown in the scatter plot above. This visualization helps to understand how LCGen influences certainty across different views, aiming to mitigate the Janus problem by ensuring more consistent certainty for various viewpoints of the same object.", "section": "5.4 Visual Visualization"}, {"figure_path": "4wgzkAyi2D/figures/figures_8_1.jpg", "caption": "Figure 9: Visualization of Certainty after Generation w/o and w/ LCGen. The upper half of the 3D scatter plot has the camera view parameters (θ, φ) on the x and y axes, and Certainty on the z-axis. The lower half depicts the generation results from different views, along with their θ and the Certainty colors as represented in the scatter plot.", "description": "This figure visualizes the impact of LCGen on the certainty of generated images from different viewpoints. The top half shows 3D scatter plots illustrating the certainty (z-axis) across different camera views (θ and φ on x and y axes) for both the original method and the LCGen method. The bottom half presents generated images corresponding to various viewpoints, color-coded according to their certainty levels shown in the top half.  The visualization highlights how LCGen leads to more consistent certainty across viewpoints, thus improving view consistency of the generated images.", "section": "5.4 Visual Visualization"}, {"figure_path": "4wgzkAyi2D/figures/figures_13_1.jpg", "caption": "Figure 2: Analysis of the Janus Problem in Text-to-3D. Due to the discrete encoding of viewpoints, there is a high probability of multiple heads appearing at different positions b on the sphere.", "description": "This figure analyzes the Janus Problem, a common issue in text-to-3D methods where multiple heads appear on the same 3D object due to the use of discrete viewpoint encoding and shared priors in 2D lifting.  The figure shows how the discrete encoding of viewpoints leads to a high probability of heads appearing at different positions on the sphere, visualized through probability density functions. This problem is related to the reliance on high-certainty 2D priors for 3D representation, leading to inconsistencies in the generated 3D model. The figure illustrates the causes of this problem and how it affects the generation of text-to-3D models.", "section": "3 Analysis of Janus Problem in Text-to-3D"}, {"figure_path": "4wgzkAyi2D/figures/figures_14_1.jpg", "caption": "Figure 11: Camera geometry in 3D space.", "description": "This figure illustrates the camera geometry in 3D space, showing how the camera parameters (lookat, up, and position) are defined on the unit sphere using spherical coordinates. The lookat vector is shown pointing towards the center of the sphere, representing the direction the camera is facing. The up vector is perpendicular to the lookat vector and indicates the camera's orientation. The position of the camera is represented by the point c on the sphere. The angles θ (elevation) and φ (azimuth) are used to specify the position of the camera on the sphere.", "section": "C Detailed Analysis of Janus Problem"}, {"figure_path": "4wgzkAyi2D/figures/figures_15_1.jpg", "caption": "Figure 2: Analysis of the Janus Problem in Text-to-3D. Due to the discrete encoding of viewpoints, there is a high probability of multiple heads appearing at different positions b on the sphere.", "description": "This figure analyzes the Janus Problem, a common issue in text-to-3D methods where multiple heads appear from different viewpoints.  It demonstrates how discrete viewpoint encoding leads to shared distributions, increasing the likelihood of the Janus problem.  Subfigure (a) illustrates how the sphere of viewpoints is divided into discrete regions, (b) shows probability distributions for head position based on viewpoint, (c) extends the model to a two-dimensional distribution considering both viewpoint and head position, and (d) depicts the resulting probability distribution of head positions, highlighting peaks indicating high probability of multiple heads at different locations.", "section": "3 Analysis of Janus Problem in Text-to-3D"}, {"figure_path": "4wgzkAyi2D/figures/figures_19_1.jpg", "caption": "Figure 4: Results of Qualitative Comparison. The areas enclosed in red boxes are where the Janus Problem occurs.", "description": "This figure shows a qualitative comparison of the original methods and the proposed LCGen method on three different SDS-based text-to-3D models (DreamFusion, Magic3D, and ProlificDreamer).  The red boxes highlight regions where the Janus Problem (view inconsistency) is present in the original methods, while the LCGen results show improved view consistency and a reduction in the Janus Problem.", "section": "5.2 Results of LCGen"}, {"figure_path": "4wgzkAyi2D/figures/figures_20_1.jpg", "caption": "Figure 1: The main cause of the Janus Problem in SDS-based text-to-3D methods is their reliance on high-certainty 2D priors for 3D representation, which can result in heads appearing from multiple viewpoints. To address this, we introduced the LCGen method, using low-certainty generation to align viewpoints with the optimization direction.", "description": "The figure illustrates the Janus Problem in Score Distillation Sampling (SDS)-based text-to-3D methods.  The problem occurs because these methods rely on high-certainty 2D priors, leading to inconsistencies in the 3D model's representation from different viewpoints (e.g., a head appearing in multiple places). The proposed LCGen method aims to solve this by utilizing low-certainty generation to better align viewpoints with the optimization direction, thus creating more consistent 3D models.", "section": "Introduction"}]