[{"figure_path": "mGz3Jux9wS/tables/tables_6_1.jpg", "caption": "Table 1: Comparisons with state-of-the-art methods on COCO (Mask R-CNN with R50-FPN).", "description": "This table compares the performance of different object detection methods on the COCO dataset using Mask R-CNN with a ResNet-50 Feature Pyramid Network (FPN) backbone.  The methods are categorized by their backbone initialization (from scratch or ImageNet pre-trained) and their performance is measured using several metrics: AP (average precision), AP50 (AP at an IoU threshold of 50%), AP75 (AP at an IoU threshold of 75%), APmk (average precision for masks), APmk50, and APmk75.  The table highlights the superior performance of the proposed method, particularly in improving mAP.", "section": "4.2 Quantitative Results"}, {"figure_path": "mGz3Jux9wS/tables/tables_6_2.jpg", "caption": "Table 2: Comparisons with pre-trained methods on LVIS v1.0 with a 1× scheduler using Mask R-CNN.", "description": "This table compares the performance of the proposed 2DRCL method against several pre-trained methods on the LVIS v1.0 dataset using the Mask R-CNN framework with a 1x scheduler. It shows the Average Precision (APbb) for different categories of objects (rare, common, frequent) and the overall APbb score. The results demonstrate the superiority of 2DRCL in handling long-tailed distributions in object detection, significantly outperforming other pre-trained models, particularly in detecting rare objects.", "section": "4.2 Quantitative Results"}, {"figure_path": "mGz3Jux9wS/tables/tables_7_1.jpg", "caption": "Table 3: Comparisons with state-of-the-art methods on LVIS v1.0 with a 2× schedule. (a) Faster R-CNN with R50-FPN. (b) Mask R-CNN with ResNet-50/101.", "description": "This table compares the proposed 2DRCL method with other state-of-the-art methods on the LVIS v1.0 dataset using two different backbones (ResNet-50 and ResNet-101) and two different detectors (Faster R-CNN and Mask R-CNN) with 2x training schedule.  The results show the Average Precision (AP) scores for the overall dataset (APbb), rare classes (APbb r), common classes (APbb c), and frequent classes (APbb f) for each method. This table demonstrates the effectiveness of 2DRCL, particularly on tail classes.", "section": "4.2 Quantitative Results"}, {"figure_path": "mGz3Jux9wS/tables/tables_7_2.jpg", "caption": "Table 3: Comparisons with state-of-the-art methods on LVIS v1.0 with a 2× schedule.", "description": "This table presents a comparison of the proposed 2DRCL method with several state-of-the-art methods on the LVIS v1.0 dataset using Faster R-CNN and Mask R-CNN with ResNet-50 and ResNet-101 backbones.  The results show the AP, APr, APc, APf, and APbb scores for each method, illustrating the effectiveness of 2DRCL, particularly in improving the performance on tail classes.", "section": "4.2 Quantitative Results"}, {"figure_path": "mGz3Jux9wS/tables/tables_8_1.jpg", "caption": "Table 1: Comparisons with state-of-the-art methods on COCO (Mask R-CNN with R50-FPN).", "description": "This table compares the performance of the proposed method with other state-of-the-art methods on the COCO dataset using Mask R-CNN with a ResNet50-FPN backbone.  It shows the Average Precision (AP) for bounding boxes (APbb) at different Intersection over Union (IoU) thresholds (50 and 75) and for masks (APmk). The comparison is broken down into methods initialized from scratch and those using an ImageNet pre-trained backbone.  The table highlights the superior performance of the proposed method.", "section": "4.2 Quantitative Results"}, {"figure_path": "mGz3Jux9wS/tables/tables_8_2.jpg", "caption": "Table 2: Comparisons with pre-trained methods on LVIS v1.0 with a 1× scheduler using Mask R-CNN.", "description": "This table compares the performance of the proposed Dynamic Rebalancing Contrastive Learning with Dual Reconstruction (2DRCL) method against several state-of-the-art pre-trained methods on the LVIS v1.0 dataset.  The comparison uses the Mask R-CNN framework and a 1× scheduler.  The table highlights the performance on different classes (rare, common, frequent) as measured by Average Precision (APbb) scores.  It shows how 2DRCL improves upon existing pre-training methods, particularly for tail classes (rare classes).", "section": "4.2 Quantitative Results"}, {"figure_path": "mGz3Jux9wS/tables/tables_8_3.jpg", "caption": "Table 5: Ablations for various components in our 2DRCL on LVIS v1.0.", "description": "This ablation study analyzes the impact of each component of the proposed 2DRCL model on the LVIS v1.0 dataset.  It shows the effect of using Holistic Contrastive Learning (HCL), Local Contrastive Learning (LCL), Dynamic Rebalancing (DRB), Appearance Reconstruction (AR), and Semantic Reconstruction (SR), both individually and in combination, on the object detection performance, specifically measuring Average Precision (AP) for different object frequency categories (rare, common, and frequent).", "section": "4.3 Further Analysis"}, {"figure_path": "mGz3Jux9wS/tables/tables_14_1.jpg", "caption": "Table 3: Comparisons with state-of-the-art methods on LVIS v1.0 with a 2× schedule. (a) Faster R-CNN with R50-FPN. (b) Mask R-CNN with ResNet-50/101.", "description": "This table presents a comparison of the proposed 2DRCL method with other state-of-the-art methods on the LVIS v1.0 dataset using Faster R-CNN and Mask R-CNN with ResNet-50/101 backbones.  It shows the performance using a 2x training schedule (24 epochs) and the results are broken down by AP scores for rare, common, and frequent classes, as well as overall APbb and AP scores.", "section": "4.2 Quantitative Results"}, {"figure_path": "mGz3Jux9wS/tables/tables_14_2.jpg", "caption": "Table A.2: One-stage object detection results on LVIS v1.0 validation set. We compare different methods with ResNet-50 backbone on 2× schedule using ATSS.", "description": "This table presents a comparison of one-stage object detection methods (using the ATSS framework) on the LVIS v1.0 validation set. The comparison is limited to methods using the ResNet-50 backbone and trained with a 2x schedule.  The table shows the average precision (AP) and average precision for different categories of objects (rare, common, and frequent). It highlights the performance improvements achieved by the proposed 2DRCL method compared to baseline approaches such as Focal Loss and ECM Loss. ", "section": "A.2 Quantitative Results"}, {"figure_path": "mGz3Jux9wS/tables/tables_15_1.jpg", "caption": "Table A.3: Results on COCO-LT dataset. All experiments were conducted using the Mask R-CNN framework with a ResNet-50-FPN backbone and a 1× training schedule.", "description": "This table presents a comparison of different long-tailed object detection methods on the COCO-LT dataset.  The methods are evaluated based on their average precision (AP) across all classes and across four different class frequency groups (AP1, AP2, AP3, and AP4).  The groups represent classes with increasing numbers of training instances, allowing assessment of how well the methods perform on classes with varying levels of data imbalance.  The table showcases how the proposed 2DRCL method performs against other state-of-the-art methods for long-tailed object detection.", "section": "A.2 Additional Experiment"}, {"figure_path": "mGz3Jux9wS/tables/tables_15_2.jpg", "caption": "Table A.4: Efficiency evaluation of Mask R-CNN with ResNet50-FPN.", "description": "This table compares the VRAM usage, training time, and the performance of different methods for long-tailed object detection.  The results show a trade-off between resource usage and performance gains.  The method combining 2DRCL with AlignDet achieves the highest AP and APbb, but requires more VRAM and training time compared to other approaches.", "section": "A.2 Additional Experiment"}]