[{"figure_path": "ojLIEQ0j9T/figures/figures_1_1.jpg", "caption": "Figure 1: Schematic of a recurrent circuit with N = 2 primary neurons and K = 3 interneurons. Left: Scatter plot of a 2D input signals s = (s1, s2) with s ~ ps. Center: Primary neurons (black circles), with outputs r = (r1, r2), receive external feedforward inputs, s, and recurrent feedback from an auxiliary population of interneurons (purple circles), –Wn, where n = (n1, n2, n3) are the interneuron outputs. Projection vectors {W1, W2, W3} encode feedforward synaptic weights connecting primary neurons to interneurons i = 1, 2, 3, with symmetric feedback connections. Inset: The ith interneuron (here i = 1) receives weighted inputs zi := r. wi, which is fed through the activation function f(θi, zi) and scaled by the gain gi to generate the output ni := gif(θi, zi). Right: Scatter plot of the 2D circuit responses r = (r1, r2) with r ~ Ptarget.", "description": "This figure schematically shows a recurrent neural circuit model with two primary neurons and three interneurons. The left panel shows the distribution of 2D input signals. The center panel depicts the circuit architecture, illustrating how primary neurons receive feedforward input and recurrent feedback from interneurons.  An inset highlights the processing within a single interneuron. The right panel displays the resulting distribution of 2D circuit responses after processing by the circuit.", "section": "1 Introduction"}, {"figure_path": "ojLIEQ0j9T/figures/figures_5_1.jpg", "caption": "Figure 1: Schematic of a recurrent circuit with N = 2 primary neurons and K = 3 interneurons. Left: Scatter plot of a 2D input signals s = (s1, s2) with s ~ ps. Center: Primary neurons (black circles), with outputs r = (r1, r2), receive external feedforward inputs, s, and recurrent feedback from an auxiliary population of interneurons (purple circles), –Wn, where n = (n1, n2, n3) are the interneuron outputs. Projection vectors {W1, W2, W3} encode feedforward synaptic weights connecting primary neurons to interneurons i = 1, 2, 3, with symmetric feedback connections. Inset: The ith interneuron (here i = 1) receives weighted inputs zi := r. wi, which is fed through the activation function f(θi, zi) and scaled by the gain gi to generate the output ni := gif(θi, zi). Right: Scatter plot of the 2D circuit responses r = (r1, r2) with r ~ Ptarget.", "description": "This figure schematically depicts a recurrent neural circuit model comprising two primary neurons and three interneurons.  The left panel shows the input signal distribution, the center panel illustrates the circuit architecture with feedforward and feedback connections between primary and interneuron populations, and the right panel displays the target response distribution. The inset highlights the internal workings of a single interneuron, illustrating how it receives weighted input, processes this via an activation function, and produces a scaled output that feeds back to the primary neurons.", "section": "2 Circuit objective"}, {"figure_path": "ojLIEQ0j9T/figures/figures_6_1.jpg", "caption": "Figure 2: Gaussianization of local filter responses. A) Three example natural images from the Kodak dataset. B) Histograms of local filter responses (black lines) and fitted generalized Gaussian density (red dashed lines) with scale α and shape β. C) Learned interneuron activations gf(θ, z), with f(θ, z) defined as in eq. (6) and learned g and θ, and D) corresponding stimulus-response transforms r = T(s). The optimal activations and transforms are shown as thick gray curves. E) Histograms of the circuit responses (black lines) and the Gaussian density (red dashed lines).", "description": "This figure demonstrates the Gaussianization of local filter responses through the learned circuit transformation.  It shows three examples of natural images (A), their corresponding local filter response histograms with generalized Gaussian fits (B), the learned interneuron activation functions (C), the learned stimulus-response transformations (D), and finally the histograms of the circuit responses showing near-Gaussian distributions (E). Each row represents a different image with varying parameters α and β illustrating the model's adaptation to diverse input statistics.", "section": "4 Gaussianization of natural image statistics"}, {"figure_path": "ojLIEQ0j9T/figures/figures_7_1.jpg", "caption": "Figure 3: Evenly spaced contours for the spherical Gaussian distribution are depicted as dashed red circles. For spatial offsets d = 2, 8, 32, the contour plots for (A) the local filter responses, (B) ZCA whitened local filter responses, and (CDE) learned circuit responses (with K = 2, 3, 4 interneurons) are depicted (in the respective column) as black curves along with the estimated mutual information between coordinates. The learned column vectors of W are indicated by the faint gray lines.", "description": "This figure visualizes the effect of the proposed algorithm on pairs of local filter responses at different spatial offsets (d=2, 8, 32). It compares the original responses (A), ZCA-whitened responses (B), and responses generated by the model with different numbers of interneurons (C-E).  The contours represent the probability density, illustrating how the algorithm transforms the data towards a spherical Gaussian distribution.  Mutual information values quantify the reduction in statistical dependencies between the response coordinates.", "section": "4 Gaussianization of natural image statistics"}, {"figure_path": "ojLIEQ0j9T/figures/figures_8_1.jpg", "caption": "Figure 4: For spatial offsets between d = 2 and d = 64, the estimated mutual information (using bin size 0.5) of the signal with 95% confidence intervals (estimated across 23 images), ZCA whitened signal, and learned circuit responses (with K = 2, 3, 4 interneurons).", "description": "This figure shows how mutual information between pairs of local filter responses changes with spatial offset. It compares the original signal, the signal after ZCA whitening, and the signals processed by the neural circuit model with varying numbers of interneurons (K=2, 3, and 4). The results demonstrate the circuit's ability to reduce statistical dependencies between neural responses.", "section": "4 Gaussianization of natural image statistics"}, {"figure_path": "ojLIEQ0j9T/figures/figures_18_1.jpg", "caption": "Figure 2: Gaussianization of local filter responses. A) Three example natural images from the Kodak dataset. B) Histograms of local filter responses (black lines) and fitted generalized Gaussian density (red dashed lines) with scale α and shape β. C) Learned interneuron activations gf(θ, z), with f(θ, z) defined as in eq. (6) and learned g and θ, and D) corresponding stimulus-response transforms r = T(s). The optimal activations and transforms are shown as thick gray curves. E) Histograms of the circuit responses (black lines) and the Gaussian density (red dashed lines).", "description": "This figure demonstrates the Gaussianization process achieved by the model. It shows three example images (A), their corresponding local filter response histograms compared with fitted generalized Gaussian densities (B), the learned interneuron activation functions (C), the learned stimulus-response transformations (D), and finally, histograms of the circuit responses compared with the Gaussian density (E). The goal is to show how the model transforms the input distribution (heavy-tailed) into a Gaussian distribution.", "section": "4 Gaussianization of natural image statistics"}, {"figure_path": "ojLIEQ0j9T/figures/figures_19_1.jpg", "caption": "Figure 3: Evenly spaced contours for the spherical Gaussian distribution are depicted as dashed red circles. For spatial offsets d = 2, 8, 32, the contour plots for (A) the local filter responses, (B) ZCA whitened local filter responses, and (CDE) learned circuit responses (with K = 2, 3, 4 interneurons) are depicted (in the respective column) as black curves along with the estimated mutual information between coordinates. The learned column vectors of W are indicated by the faint gray lines.", "description": "This figure shows contour plots visualizing the distribution of local filter responses for different spatial offsets (d=2, 8, 32). It compares the original signal distribution, ZCA-whitened responses, and the circuit's learned responses using 2, 3, and 4 interneurons. The mutual information between coordinates is quantified for each case, demonstrating the effect of the circuit in reducing statistical dependencies.", "section": "4 Gaussianization of natural image statistics"}]