[{"figure_path": "HYwfZEhyK4/figures/figures_3_1.jpg", "caption": "Figure 1: The framework overview of smileGeo. It contains the process of review mechanism in agent discussions along with a dynamic learning strategy of agent collaboration social networks. The first part deploys a review mechanism for LVLMs to discuss and share their knowledge anonymously, which could enhance the overall performance of geo-localization tasks. The second one mainly utilizes the GNN-based learning module to improve efficiency by reducing unnecessary discussions among agents while showing the process of updating the agent collaboration social network during the training process.", "description": "This figure illustrates the smileGeo framework, which consists of two main components: a review mechanism for multi-agent discussion and a dynamic learning strategy for optimizing agent collaboration.  The review mechanism uses a three-stage process to allow agents to reach a consensus on the location of an image.  The dynamic learning strategy uses a graph neural network (GNN) to learn optimal agent collaboration patterns, improving efficiency by reducing unnecessary discussions. The figure also shows how the GNN updates the agent collaboration network during training based on the accuracy of the agents' predictions.", "section": "3 Methodology"}, {"figure_path": "HYwfZEhyK4/figures/figures_8_1.jpg", "caption": "Figure 2: Results of model performance in relation to the number of agents.", "description": "This figure displays the impact of the number of agents on the accuracy of various geo-localization frameworks, including smileGeo.  Subfigure (a) shows the results when using the same LVLM API for all agents, while subfigure (b) shows the results when using diverse LVLMs. The results indicate that smileGeo outperforms other frameworks, especially when using diverse LVLMs. An optimal number of agents exists for best accuracy, beyond which performance may decrease. This highlights the importance of selecting an appropriate number of agents and diversity for optimal performance.", "section": "4.3 Ablation Study"}, {"figure_path": "HYwfZEhyK4/figures/figures_8_2.jpg", "caption": "Figure 3: Results under different K and R.", "description": "This figure shows a heatmap visualizing the performance of the smileGeo framework under different combinations of hyperparameters K and R.  K represents the number of answer agents, while R represents the number of review agents. The heatmap shows that accuracy (Acc, displayed in percentage) peaks at lower values of K and R. This suggests that while increasing agent numbers may seem beneficial, it actually decreases the efficiency and accuracy of the model.  Optimal performance is achieved with a balance between enough agents to facilitate discussion and avoiding unnecessary computational overhead.", "section": "4.3 Ablation Study"}, {"figure_path": "HYwfZEhyK4/figures/figures_13_1.jpg", "caption": "Figure 1: The framework overview of smileGeo. It contains the process of review mechanism in agent discussions along with a dynamic learning strategy of agent collaboration social networks. The first part deploys a review mechanism for LVLMs to discuss and share their knowledge anonymously, which could enhance the overall performance of geo-localization tasks. The second one mainly utilizes the GNN-based learning module to improve efficiency by reducing unnecessary discussions among agents while showing the process of updating the agent collaboration social network during the training process.", "description": "This figure illustrates the smileGeo framework, which consists of two main parts: a review mechanism for multi-agent collaboration and a dynamic learning strategy for optimizing the collaboration network.  The review mechanism facilitates knowledge sharing and consensus-building among multiple Large Vision-Language Models (LVLMs) through a three-stage process. The dynamic learning strategy uses a Graph Neural Network (GNN) to optimize agent selection and communication patterns, enhancing efficiency and accuracy.", "section": "3 Methodology"}, {"figure_path": "HYwfZEhyK4/figures/figures_15_1.jpg", "caption": "Figure 1: The framework overview of smileGeo. It contains the process of review mechanism in agent discussions along with a dynamic learning strategy of agent collaboration social networks. The first part deploys a review mechanism for LVLMs to discuss and share their knowledge anonymously, which could enhance the overall performance of geo-localization tasks. The second one mainly utilizes the GNN-based learning module to improve efficiency by reducing unnecessary discussions among agents while showing the process of updating the agent collaboration social network during the training process.", "description": "This figure illustrates the smileGeo framework, highlighting its two main components: a review mechanism for multi-agent discussion and a dynamic learning strategy for optimizing agent collaboration.  The review mechanism uses a three-stage process to refine geo-localization accuracy through discussion and consensus-building among agents. The dynamic learning strategy leverages a graph neural network (GNN) to learn optimal communication patterns, enhancing efficiency by minimizing redundant interactions.", "section": "3 Methodology"}, {"figure_path": "HYwfZEhyK4/figures/figures_16_1.jpg", "caption": "Figure 1: The framework overview of smileGeo. It contains the process of review mechanism in agent discussions along with a dynamic learning strategy of agent collaboration social networks. The first part deploys a review mechanism for LVLMs to discuss and share their knowledge anonymously, which could enhance the overall performance of geo-localization tasks. The second one mainly utilizes the GNN-based learning module to improve efficiency by reducing unnecessary discussions among agents while showing the process of updating the agent collaboration social network during the training process.", "description": "This figure illustrates the smileGeo framework, highlighting its two main components: a review mechanism for multi-agent discussion and a dynamic learning strategy for optimizing agent collaboration.  The review mechanism involves a three-stage process of answer agent election, review agent selection, and final answer conclusion, promoting collaborative knowledge sharing among multiple Large Vision-Language Models (LVLMs).  The dynamic learning strategy uses a Graph Neural Network (GNN) to optimize agent collaboration by reducing unnecessary discussions and improving efficiency. The figure visually depicts the flow of information and interactions between agents during the geo-localization process.", "section": "3 Methodology"}]