[{"figure_path": "3XLQp2Xx3J/tables/tables_5_1.jpg", "caption": "Table 1: Comparison of the PSNR(dB) performance of the original and hidden message scenes. We also report the average storage size of 3DGS point cloud files and the weights of decoders (if any). We are not directly comparing with 3DGS. In fact, 3DGS is the ideal upper limit of our performance.", "description": "This table compares the Peak Signal-to-Noise Ratio (PSNR) in dB for original and hidden scenes using different methods: 3DGS, 3DGS+SH, 3DGS+Decoder, and GS-Hider.  It also shows the average storage size (in MB) for each method and the size of the decoder weights (if applicable).  The results show that GS-Hider achieves high PSNR for both original and hidden scenes while maintaining a relatively small file size.", "section": "4.2 Property Study #1: Fidelity"}, {"figure_path": "3XLQp2Xx3J/tables/tables_5_2.jpg", "caption": "Table 2: Rendering time (s) of our proposed GS-Hider.", "description": "This table presents the rendering time in seconds for each of the nine scenes used in the GS-Hider experiments.  The rendering times are broken down by scene (Bicycle, Flowers, Garden, Stump, Treehill, Room, Counter, Kitchen, Bonsai) and show the average rendering time across all scenes.  The data reflects the efficiency of the GS-Hider algorithm in generating images in real-time.", "section": "4.2 Property Study #1: Fidelity"}, {"figure_path": "3XLQp2Xx3J/tables/tables_7_1.jpg", "caption": "Table 3: Robustness analysis under different pruning methods. PSNRS, SSIMs and LPIPS are used to evaluate the fidelity of the original scene, and PSNRM and SSIMM are for the hidden scene.", "description": "This table presents the results of a robustness study on the GS-Hider method. Two pruning methods (sequential and random) were used to degrade the Gaussians in the 3D scene, and the impact on the fidelity of both the original and hidden scenes was evaluated using PSNR, SSIM, and LPIPS metrics. The results show that the GS-Hider method is robust to both sequential and random pruning, with minimal impact on the fidelity of both the original and hidden scenes, even with up to 25% of the Gaussians pruned.", "section": "4.4 Property Study #3: Robustness"}, {"figure_path": "3XLQp2Xx3J/tables/tables_7_2.jpg", "caption": "Table 3: Robustness analysis under different pruning methods. PSNRS, SSIMs and LPIPS are used to evaluate the fidelity of the original scene, and PSNRM and SSIMM are for the hidden scene.", "description": "This table presents the robustness analysis of the proposed GS-Hider method under different pruning methods.  It shows the performance (PSNR, SSIM, LPIPS) for both the original and hidden scenes with different ratios (5%, 10%, 15%, and 25%) of sequential and random pruning of Gaussians. This analysis evaluates how well the method maintains its fidelity and quality even when some Gaussian points are removed.", "section": "4.4 Property Study #3: Robustness"}, {"figure_path": "3XLQp2Xx3J/tables/tables_7_3.jpg", "caption": "Table 4: Ablation studies on some key hyper-parameters of the proposed GS-Hider.", "description": "This ablation study investigates the effects of key hyperparameters on the performance of the GS-Hider.  It shows the impact of balancing weight (λ), feature dimension (M), and the number of convolutional layers in the decoder networks on the fidelity of both the original and hidden scenes (measured using PSNR, SSIM, and LPIPS). The results help to determine optimal hyperparameter settings for the best balance between original scene fidelity and hidden message capacity and security.", "section": "4.5 Ablation Studies"}, {"figure_path": "3XLQp2Xx3J/tables/tables_14_1.jpg", "caption": "Table 6: Copyright Extraction Accuracy of Arbitrary 2D Viewpoints.", "description": "This table presents the Peak Signal-to-Noise Ratio (PSNR) values for the original scene (PSNRs), hidden message (PSNRM), and watermarked image extracted from an arbitrary 2D RGB viewpoint (PSNRw).  The results demonstrate the effectiveness of the GS-Hider method in extracting copyright information from limited viewpoints, even when the complete 3DGS point cloud file is unavailable.  The PSNR values represent the fidelity of the image reconstruction compared to the original.", "section": "4.6 Further Applications"}, {"figure_path": "3XLQp2Xx3J/tables/tables_15_1.jpg", "caption": "Table 7: Correspondence between hidden and original scenes. Since for most scenes, “playroom", "description": "This table shows the correspondence between the original and hidden scenes used in the GS-Hider experiments.  Note that for some scenes (Playroom and Bicycle), there are repeated entries because those scenes had fewer \"illegal\" views. This ensured sufficient data for training the GS-Hider model.", "section": "C Limitations and Future Works"}, {"figure_path": "3XLQp2Xx3J/tables/tables_17_1.jpg", "caption": "Table 8: Rendering performance of the proposed GS-Hider without hiding messages.", "description": "This table presents the Peak Signal-to-Noise Ratio (PSNR), Structural Similarity Index (SSIM), and Learned Perceptual Image Patch Similarity (LPIPS) metrics for the original scenes rendered by the GS-Hider without any hidden message embedded.  It shows the fidelity of the rendered original scenes, which is compared against the results with hidden messages in the paper.", "section": "4.2 Property Study #1: Fidelity"}, {"figure_path": "3XLQp2Xx3J/tables/tables_17_2.jpg", "caption": "Table 1: Comparison of the PSNR(dB) performance of the original and hidden message scenes. We also report the average storage size of 3DGS point cloud files and the weights of decoders (if any). We are not directly comparing with 3DGS. In fact, 3DGS is the ideal upper limit of our performance.", "description": "This table presents a comparison of Peak Signal-to-Noise Ratio (PSNR) values for original and hidden message scenes, obtained using different methods. It also shows the average storage size of 3D Gaussian Splatting (3DGS) point cloud files and the decoder weights for each method.  The table highlights that 3DGS represents the ideal upper limit of performance for the methods evaluated.", "section": "4.2 Property Study #1: Fidelity"}, {"figure_path": "3XLQp2Xx3J/tables/tables_17_3.jpg", "caption": "Table 10: Comparison between the proposed GS-Hider and 3DGS+StegaNeRF.", "description": "This table compares the performance of the proposed GS-Hider method with the 3DGS+StegaNeRF method.  It shows a quantitative comparison of the Peak Signal-to-Noise Ratio (PSNR), Structural Similarity Index (SSIM), and Learned Perceptual Image Patch Similarity (LPIPS) metrics for both the original scene (S) and the hidden message (M).  The results demonstrate the fidelity of the original scene and the quality of the hidden message produced by each method.", "section": "4.2 Property Study #1: Fidelity"}, {"figure_path": "3XLQp2Xx3J/tables/tables_17_4.jpg", "caption": "Table 11: Rendering quality of the extension to Mip-3DGS, namely Mip-GSHider.", "description": "This table presents a comparison of rendering quality metrics between Mip-Splatting and Mip-GSHider.  Mip-GSHider is an extension of the GS-Hider method to work with Mip-Splatting. The metrics shown are PSNR, SSIM, and LPIPS for both the original scene (S) and the hidden message (M).  The results demonstrate that while incorporating the GS-Hider's steganography capabilities into Mip-Splatting does reduce rendering quality, the fidelity of both the original and hidden scenes remains relatively high.", "section": "4. Experiments"}]