[{"figure_path": "pnmUiVAGnv/figures/figures_1_1.jpg", "caption": "Figure 1: Left: Long-tailed curve of the category and the number of available cases that can be obtained in the medical field. Right: Tumors in different cancer staging with diverse shapes and sizes.", "description": "This figure illustrates two key challenges in medical image segmentation. The left panel shows a long-tailed distribution of organ and tumor categories in medical datasets.  There are many rare cases, making it difficult to train robust models.  The right panel shows colon tumors at different cancer stages (T-Stage III and T-Stage IV). These tumors exhibit significant variation in shape, size, and density, posing a further challenge for accurate segmentation.", "section": "1 Introduction"}, {"figure_path": "pnmUiVAGnv/figures/figures_3_1.jpg", "caption": "Figure 2: (a) CAT follows the query-based segmentation architecture. 3D cropped volumes according to the anatomical structure are utilized as anatomical prompts. Texts enhanced by professional knowledge are adopted as textual prompts. Learnable queries and both prompts are utilized for the final prediction via ShareRefiner and PromptRefer. (b) The case of colon tumor in Stage-IV invading the intestine. (c) Attention masks in PromptRefer for assigning specific prompts to queries.", "description": "This figure illustrates the CAT model's architecture and workflow.  Panel (a) shows the overall architecture, highlighting the use of both anatomical (3D cropped volumes) and textual prompts (enhanced with medical knowledge) which are processed by separate encoders to generate prompt queries. These queries, along with segmentation queries, are refined by the Share Refiner module before being integrated by the PromptRefer module for final mask prediction. Panel (b) shows an example case of a Stage-IV colon tumor invading the intestine, illustrating a complex scenario the model handles.  Panel (c) visualizes the attention masks within PromptRefer, demonstrating how it selectively assigns prompt queries to influence specific segmentation queries.", "section": "3 Method"}, {"figure_path": "pnmUiVAGnv/figures/figures_7_1.jpg", "caption": "Figure 3: Qualitative visualizations of the proposed model and other prompting methods on organ/tumor segmentation. The segmentation results presented from rows one to five correspond, in order, to the duodenum, liver tumors, pancreas tumors, colon tumors, and colon tumors in Stage-IV.", "description": "This figure shows a qualitative comparison of the proposed CAT model's segmentation performance against other state-of-the-art methods.  Each row displays a different organ or tumor type (duodenum, liver tumor, pancreas tumor, colon tumor, Stage IV colon tumor) and shows ground truth segmentations alongside results from CAT, Universal, and SegVol. The visual comparison highlights CAT's superior ability to accurately segment the target structures, particularly in complex scenarios like Stage IV colon tumors where the tumor invades nearby tissue.", "section": "4.1 Main Results"}, {"figure_path": "pnmUiVAGnv/figures/figures_8_1.jpg", "caption": "Figure 4: T-SNE visualization of the distribution of Features. Left: Two types of prompt embedding before and after refinement. Right: Segmentation query features with and without contrastive alignment. (1-9: right kidney, left kidney, liver, pancreas, colon, kidney tumor, liver tumor, pancreas tumor, colon tumor).", "description": "This figure uses t-SNE to visualize the distribution of features before and after applying different refinement techniques to the prompt embeddings.  The left panels show the initial and refined embeddings for anatomical and textual prompts separately, illustrating how the refinement process improves the separation of features in the embedding space. The right panels compare the segmentation query features with and without contrastive learning.  The visualization helps to demonstrate that the refinement and contrastive learning steps effectively disentangle the different feature representations, which enhances the model's ability to accurately segment organs and tumors.", "section": "3.2 ShareRefiner"}, {"figure_path": "pnmUiVAGnv/figures/figures_9_1.jpg", "caption": "Figure 3: Qualitative visualizations of the proposed model and other prompting methods on organ/tumor segmentation. The segmentation results presented from rows one to five correspond, in order, to the duodenum, liver tumors, pancreas tumors, colon tumors, and colon tumors in Stage-IV.", "description": "This figure shows a qualitative comparison of the proposed CAT model's segmentation performance against other prompting methods (Universal, SegVol) on various organ and tumor types.  Each row displays a different organ or tumor, illustrating the model's ability to segment challenging cases such as tumors invading adjacent organs. The results highlight CAT's superior performance in accurately segmenting complex and diverse anatomical structures compared to alternative approaches.", "section": "4.1 Main Results"}, {"figure_path": "pnmUiVAGnv/figures/figures_16_1.jpg", "caption": "Figure 3: Qualitative visualizations of the proposed model and other prompting methods on organ/tumor segmentation. The segmentation results presented from rows one to five correspond, in order, to the duodenum, liver tumors, pancreas tumors, colon tumors, and colon tumors in Stage-IV.", "description": "This figure presents a qualitative comparison of the proposed CAT model's performance against other state-of-the-art prompting methods for organ and tumor segmentation.  It showcases the results for five different cases: duodenum, liver tumors, pancreas tumors, colon tumors, and stage IV colon tumors.  Each row shows the ground truth segmentation alongside the results from CAT and other methods (Universal and SegVol). The comparison highlights CAT's superior ability to accurately segment various organs and tumors with complex shapes and varying appearances, particularly in challenging scenarios involving tumor invasion into nearby tissues.", "section": "4.1 Main Results"}]