[{"figure_path": "v9RqRFSLQ2/figures/figures_2_1.jpg", "caption": "Figure 1: Robustness verification on using intervals (MEYER [47]) and zonotopes (ZORRO).", "description": "This figure compares the robustness verification results of the proposed method (ZORRO) and Meyer et al.'s method (MEYER) across different uncertainty levels in training datasets. Robustness is measured as the fraction of test data points with prediction intervals smaller than a specified threshold.  The results show that ZORRO consistently achieves higher robustness ratios than Meyer et al. across various uncertain data percentages and uncertainty radii, especially for higher uncertainty settings.  The plots demonstrate ZORRO's improved ability to certify model robustness in the presence of uncertainty in both training labels and features.", "section": "5 Experiments"}, {"figure_path": "v9RqRFSLQ2/figures/figures_4_1.jpg", "caption": "Figure 1: Robustness verification using intervals (MEYER [47]) and zonotopes (ZORRO).", "description": "This figure compares the robustness verification results of the proposed method (ZORRO) with the baseline method (MEYER [47]).  The robustness verification is performed for different levels of uncertainty in the data (uncertain data percentage and uncertainty radius).  The figure contains three subfigures (a, b, c) which show the robustness ratios for different datasets (MPG and Insurance) and types of uncertainty (uncertain labels and uncertain features). The y-axis represents the robustness ratio, while the x-axis shows the uncertain data percentage. The results demonstrate that ZORRO consistently achieves higher robustness ratios compared to MEYER.", "section": "5 Experiments"}, {"figure_path": "v9RqRFSLQ2/figures/figures_4_2.jpg", "caption": "Figure 1: Robustness verification on using intervals (MEYER [47]) and zonotopes (ZORRO).", "description": "This figure compares the robustness verification results of ZORRO and MEYER on two datasets, MPG and Insurance. The robustness ratio is used as a metric, representing the fraction of test samples receiving robust predictions.  Different subfigures show results for varying uncertainty radii and percentages of uncertain data for both label and feature uncertainties.  ZORRO consistently demonstrates higher robustness ratios, particularly with higher uncertainty radii, showcasing the benefit of using zonotopes over intervals for over-approximating uncertainties.", "section": "Experiments"}, {"figure_path": "v9RqRFSLQ2/figures/figures_6_1.jpg", "caption": "Figure 1: Robustness verification on using intervals (MEYER [47]) and zonotopes (ZORRO).", "description": "The figure compares the robustness verification results between MEYER's approach which uses intervals and ZORRO's approach which uses zonotopes. It shows the robustness ratio (fraction of test data points with robust predictions) under different conditions of uncertain data percentage and uncertainty radius. The plots show that ZORRO consistently certifies higher robustness ratios than MEYER, especially for uncertain labels, and handles uncertainty in features. The comparison is done on MPG and Insurance datasets.", "section": "Experiments"}, {"figure_path": "v9RqRFSLQ2/figures/figures_7_1.jpg", "caption": "Figure 1: Robustness verification on using intervals (MEYER [47]) and zonotopes (ZORRO).", "description": "This figure presents the results of robustness verification experiments using two methods: Meyer et al.'s interval-based approach and the proposed ZORRO method using zonotopes.  The experiments evaluate the impact of data uncertainty on the robustness of linear regression models. The plots show the robustness ratio (fraction of test samples with robust predictions) against the uncertain data percentage and uncertainty radius. ZORRO demonstrates superior performance in certifying robustness compared to MEYER, particularly when uncertainty is high.  The results are separated into panels showing uncertainty in labels for MPG and Insurance datasets, and uncertainty in features for the MPG dataset.", "section": "5 Experiments"}, {"figure_path": "v9RqRFSLQ2/figures/figures_8_1.jpg", "caption": "Figure 2: Applying ZORRO to causal inference. The intercept (y-axis) is the model's bias term, the treatment effect (x-axis) is the coefficient for the treatment variable.", "description": "This figure shows the results of applying the ZORRO method to causal inference.  Three scenarios are presented, each demonstrating different relationships between the intercept (model bias) and the treatment effect (coefficient of the treatment variable).  The blue shaded regions represent the range of possible values for the intercept and treatment effect computed by ZORRO, accounting for data uncertainty. The red squares represent ground truth values from a complete dataset, and the green triangles represent results from KNN imputation. The figure highlights ZORRO's ability to provide a range of plausible values rather than a single point estimate, demonstrating the impact of uncertainty on the model parameters.", "section": "Experiments"}, {"figure_path": "v9RqRFSLQ2/figures/figures_8_2.jpg", "caption": "Figure 1: Robustness verification on using intervals (MEYER [47]) and zonotopes (ZORRO).", "description": "This figure presents the results of robustness verification experiments comparing two methods: Meyer et al. (using intervals) and ZORRO (using zonotopes). The experiments vary the uncertainty radius and the percentage of uncertain data in the training set for two different datasets (MPG and Insurance).  The robustness ratio, shown on the y-axis, represents the fraction of test data points that receive robust predictions (predictions with a range smaller than a specified threshold). The x-axis represents the percentage of uncertain data in the training set.  The plots show that ZORRO consistently achieves higher robustness ratios than Meyer et al., particularly when the uncertainty radius or percentage of uncertain data is high. This indicates that ZORRO's zonotope-based approach provides tighter prediction intervals and more reliable robustness certifications.", "section": "5 Experiments"}, {"figure_path": "v9RqRFSLQ2/figures/figures_9_1.jpg", "caption": "Figure 1: Robustness verification on using intervals (MEYER [47]) and zonotopes (ZORRO).", "description": "This figure compares the robustness verification results of the proposed ZORRO approach with the MEYER baseline [47]. The robustness verification is performed under various conditions of uncertain data, including both uncertain labels and uncertain features.  The robustness ratio, which is the fraction of the test data receiving robust predictions, is used as the evaluation metric. The figure shows that ZORRO consistently certifies higher robustness ratios compared to MEYER, especially when the uncertainty radius is higher.", "section": "5 Experiments"}, {"figure_path": "v9RqRFSLQ2/figures/figures_16_1.jpg", "caption": "Figure 1: Robustness verification on using intervals (MEYER [47]) and zonotopes (ZORRO).", "description": "This figure compares the robustness verification results of the proposed ZORRO method with the baseline method MEYER [47] using heatmaps. The heatmaps show the robustness ratios (fraction of robust predictions) across different uncertainty radii and percentages of uncertain data. The results demonstrate ZORRO's ability to certify significantly higher robustness ratios, particularly when uncertainty is high, indicating its effectiveness in handling data uncertainty. The plots (a) and (b) show results for uncertain labels in MPG and insurance data, while plot (c) shows results for uncertain features in MPG data.", "section": "5 Experiments"}, {"figure_path": "v9RqRFSLQ2/figures/figures_22_1.jpg", "caption": "Figure 1: Robustness verification on using intervals (MEYER [47]) and zonotopes (ZORRO).", "description": "This figure compares the robustness verification results of the proposed ZORRO method with the baseline method MEYER [47] on two datasets, MPG and Insurance.  The robustness is assessed under various conditions of uncertainty in training labels and features.  The x-axis represents the percentage of uncertain data, while the y-axis represents the robustness ratio, which is the fraction of test data points receiving robust predictions (prediction intervals smaller than a threshold).  The subfigures show robustness results under different uncertainty radii for labels (a, b) and features (c).  ZORRO consistently demonstrates superior robustness compared to MEYER, especially as the uncertainty in the training data increases.  This is because MEYER uses interval arithmetic, which ignores correlations between model weights, while ZORRO leverages zonotopes to more accurately capture the impact of data uncertainty.", "section": "5 Experiments"}, {"figure_path": "v9RqRFSLQ2/figures/figures_36_1.jpg", "caption": "Figure 1: Robustness verification using intervals (MEYER [47]) and zonotopes (ZORRO).", "description": "This figure compares the robustness verification results between the proposed method (ZORRO) and the baseline method (MEYER) under different uncertainty settings. The robustness ratio, which is the fraction of the test data receiving robust predictions, is used as the metric. The results demonstrate that ZORRO consistently certifies significantly higher robustness ratios than MEYER across various uncertainty levels (uncertainty radius and uncertain data percentage). This highlights the effectiveness of ZORRO in providing more reliable robustness guarantees.", "section": "5 Experiments"}, {"figure_path": "v9RqRFSLQ2/figures/figures_38_1.jpg", "caption": "Figure 5: Robustness verification under label errors using intervals (MEYER [47]) or zonotopes (ZORRO).", "description": "This figure compares the robustness verification results of the proposed ZORRO method with the MEYER method on datasets with uncertain labels.  The heatmaps show the robustness ratio (percentage of test data points with robust predictions) under varying uncertainty radius (percentage of error in labels) and uncertain data percentage (percentage of instances with uncertain labels).  ZORRO consistently shows higher robustness ratios than MEYER, demonstrating its effectiveness in handling label uncertainty.  The results highlight that ZORRO offers more robust performance than MEYER especially when uncertainty is high.", "section": "5 Experiments"}, {"figure_path": "v9RqRFSLQ2/figures/figures_38_2.jpg", "caption": "Figure 1: Robustness verification on using intervals (MEYER [47]) and zonotopes (ZORRO).", "description": "This figure compares the robustness verification results obtained using intervals (MEYER) and zonotopes (ZORRO) for three different scenarios: uncertain labels in MPG data, uncertain labels in insurance data, and uncertain features in MPG data.  For each scenario, the robustness ratio (the fraction of test data points receiving robust predictions) is plotted against the percentage of uncertain data for various uncertainty radii. The results show that ZORRO consistently certifies higher robustness ratios than MEYER, especially when the uncertainty radius is high.  This demonstrates the effectiveness of ZORRO's zonotope-based approach in handling uncertainties and providing tighter bounds on prediction ranges.", "section": "5 Experiments"}, {"figure_path": "v9RqRFSLQ2/figures/figures_39_1.jpg", "caption": "Figure 1: Robustness verification on using intervals (MEYER [47]) and zonotopes (ZORRO).", "description": "This figure compares the robustness verification results of the proposed ZORRO method with the baseline MEYER method [47] under different uncertainty settings.  The x-axis represents the percentage of uncertain data in the training dataset, and the y-axis represents the robustness ratio, which is the fraction of test data points for which the model produces robust predictions (i.e., predictions within a specified threshold).  Three subfigures show results for uncertain labels in MPG and insurance datasets and uncertain features in the MPG dataset, respectively. The results demonstrate that ZORRO consistently achieves higher robustness ratios than MEYER, highlighting its effectiveness in handling data uncertainty.", "section": "5 Experiments"}, {"figure_path": "v9RqRFSLQ2/figures/figures_39_2.jpg", "caption": "Figure 1: Robustness verification on using intervals (MEYER [47]) and zonotopes (ZORRO).", "description": "This figure compares the robustness verification results of the proposed ZORRO method with the baseline method MEYER [47] under different uncertainty settings.  The robustness ratio, defined as the fraction of test data points that receive robust predictions (the prediction interval is less than a given threshold), is plotted against the uncertain data percentage for various uncertainty radii (percentage of instances with uncertain features/labels).  ZORRO consistently demonstrates higher robustness ratios, especially when the uncertainty radius is large, due to its more accurate and less conservative approximation of the prediction range compared to MEYER's interval arithmetic approach.  The figure includes separate subfigures showing results for uncertain labels for the MPG dataset, uncertain labels for the insurance dataset, and uncertain features for the MPG dataset.", "section": "5 Experiments"}, {"figure_path": "v9RqRFSLQ2/figures/figures_40_1.jpg", "caption": "Figure 1: Robustness verification on using intervals (MEYER [47]) and zonotopes (ZORRO).", "description": "This figure compares the robustness verification results of the proposed method (ZORRO) with the baseline method (Meyer et al. [47]) under different uncertainty settings.  It shows robustness ratios (fraction of test samples with robust predictions) for varying uncertainty radius (percentage of deviation from the true values) and uncertain data percentage (percentage of samples with uncertain values) for two datasets (MPG and Insurance).  The plots visualize the impact of training data uncertainty on model robustness, demonstrating that the ZORRO method, which leverages zonotopes, provides superior robustness certification results compared to Meyer et al.'s approach, which utilizes interval arithmetic. The results showcase ZORRO's efficacy in computing prediction ranges and robustness.", "section": "5 Experiments"}, {"figure_path": "v9RqRFSLQ2/figures/figures_40_2.jpg", "caption": "Figure 1: Robustness verification on using intervals (MEYER [47]) and zonotopes (ZORRO).", "description": "This figure compares the robustness verification results of the proposed method, ZORRO, against a baseline method, MEYER [47], under different uncertainty conditions. The robustness is evaluated using two metrics: (a) and (b) show robustness verification results with uncertain labels on MPG and Insurance datasets, respectively. (c) demonstrates the robustness verification results with uncertain features on the MPG dataset.  In each subfigure, the x-axis represents the uncertain data percentage, and the y-axis represents the robustness ratio, which is the fraction of test data points with robust predictions (the size of the prediction interval is below a certain threshold).  ZORRO consistently outperforms MEYER across all scenarios, showcasing its ability to handle data uncertainty more effectively and provide tighter prediction ranges.", "section": "5 Experiments"}, {"figure_path": "v9RqRFSLQ2/figures/figures_40_3.jpg", "caption": "Figure 1: Robustness verification on using intervals (MEYER [47]) and zonotopes (ZORRO).", "description": "This figure compares the robustness verification results of the proposed method (ZORRO) with the baseline method (Meyer et al. [47]) under different uncertainty settings. The robustness is evaluated using the robustness ratio, which is the fraction of the test data receiving robust predictions. The results show that ZORRO consistently certifies significantly higher robustness ratios than MEYER, especially when the uncertainty radius is high.  The plots show the robustness ratios for varying levels of uncertain data percentage and uncertainty radius for both uncertain labels and uncertain features (MPG and Insurance datasets).", "section": "5 Experiments"}]