[{"figure_path": "HFS800reZK/figures/figures_0_1.jpg", "caption": "Figure 1: A transitively closed directed tree with branching factor 2 and depth 2, with the associated adjacency matrix.", "description": "This figure shows a small directed acyclic graph (DAG) that is transitively closed, meaning if there is a path from node A to node B, then there is also a direct edge from A to B. The graph has a root node connected to two intermediate nodes (A and B), which in turn are each connected to two leaf nodes.  The adjacency matrix alongside the graph visually represents the connections between nodes; a \"1\" indicates a direct edge, and a \"0\" indicates the absence of an edge.", "section": "1 Introduction"}, {"figure_path": "HFS800reZK/figures/figures_4_1.jpg", "caption": "Figure 4: Negative edges removable according to Proposition 2.", "description": "This figure illustrates Proposition 2, which states conditions under which negative edges can be removed from a transitively closed digraph while maintaining the ability to uniquely distinguish the graph.  The left side shows a digraph with two negative edges (red dashed arrows). The right side shows that if there's a positive edge (black arrow) from the tail of one negative edge to the head of another (and vice versa), the negative edge between those same nodes can be removed (as indicated by the removal of one of the red dashed edges). This pruning operation preserves the unique representation of the graph within the class of transitively closed DAGs.", "section": "3.2 Distinguishing Transitively-Closed Digraphs"}, {"figure_path": "HFS800reZK/figures/figures_8_1.jpg", "caption": "Figure 3: An adjacency matrix (a) and a representation of the edges in the associated sidigraph (b), where a + in position (i, j) indicates (ij) ∈ E+ and a -indicates (ij) ∈ E¯. The minimal sidigraph (c) formally captures the fact that Figure 2 has the minimal set of entries in the adjacency matrix to uniquely distinguish G among all transitively-closed DAGs.", "description": "This figure shows three representations of a sample graph. The first is its adjacency matrix, the second its equivalent sidigraph, and the third its minimal sidigraph. The minimal sidigraph shows the smallest set of entries needed in the adjacency matrix to uniquely identify the graph within the set of transitively-closed DAGs.", "section": "3.2 Distinguishing Transitively-Closed Digraphs"}, {"figure_path": "HFS800reZK/figures/figures_8_2.jpg", "caption": "Figure 5: Convergence measured using AUF1C on three graph types for SIM-VEC and GT-BOX models with the full or reduced set of positive and negative edges provided during training, respectively. Pos. = (resp. implies usage of transitive closure (resp. transitive reduction). Analogously, for Neg., the symbols imply usage of the set of the edge complement E and EH*, respectively.", "description": "This figure compares the area under the F1 vs total examples curve (AUF1C) for SIM-VEC and GT-BOX models trained on different sets of positive and negative edges.  The positive edges are sampled either from the transitive reduction (Etr) or the transitive closure (Etc) of the graph, while the negative edges are sampled from either the edge complement (E) or the minimal set of negative edges (EH*) identified by the algorithm.  The results demonstrate that using the reduced set of edges (EH*) significantly improves convergence for GT-BOX, a model with transitivity bias, but harms SIM-VEC, which lacks such bias.", "section": "6.1 Results and Discussion"}, {"figure_path": "HFS800reZK/figures/figures_8_3.jpg", "caption": "Figure 3: An adjacency matrix (a) and a representation of the edges in the associated sidigraph (b), where a + in position (i, j) indicates (ij) ∈ E+ and a -indicates (ij) ∈ E¯. The minimal sidigraph (c) formally captures the fact that Figure 2 has the minimal set of entries in the adjacency matrix to uniquely distinguish G among all transitively-closed DAGs.", "description": "This figure shows an adjacency matrix of a sample graph, its equivalent sidigraph representation, and the minimal sidigraph required to uniquely identify the graph among all transitively-closed DAGs.  The sidigraph uses + and - to represent positive and negative edges, respectively, providing a compact way to represent the minimal set of entries necessary for graph identification. ", "section": "3.2 Distinguishing Transitively-Closed Digraphs"}, {"figure_path": "HFS800reZK/figures/figures_9_1.jpg", "caption": "Figure 8: While GT-BOX (black squares) with a transitivity bias takes full advantage of the hierarchy-aware EH*, SIM-VEC, which does not have a transitivity bias, falls apart under this negative sampling procedure. The reduction in negative examples from using the pruned negative edges for this particular graph is 95.83%. Negative ratio k = 4 throughout.", "description": "This figure compares the performance of GT-BOX and SIM-VEC models on the MeSH 2020 dataset with k=4 and using only the transitive closure for positive edges.  The key difference is that GT-BOX leverages transitivity bias, while SIM-VEC does not.  The results show that GT-BOX effectively uses the hierarchy-aware negative sampling (EH*)  with a 95.83% reduction in the number of negative examples, demonstrating significant improvements in convergence and accuracy.  In contrast, SIM-VEC's performance degrades when using this reduced negative sample set.", "section": "Experiments"}, {"figure_path": "HFS800reZK/figures/figures_16_1.jpg", "caption": "Figure 4: Negative edges removable according to Proposition 2.", "description": "This figure illustrates two scenarios where negative edges can be removed from a transitively closed DAG while still maintaining the ability to uniquely distinguish the graph among all transitively closed DAGs.  Proposition 2 formally describes these pruning rules.  In (a), if (a→b) and (a→d) are positive edges, and (b→d) is a negative edge, then (b→d) can be removed.  Similarly in (b), if (a→d) is a positive edge, (c→d) is a positive edge and (a→c) is a negative edge, then (a→c) can be removed.", "section": "3.2 Distinguishing Transitively-Closed Digraphs"}, {"figure_path": "HFS800reZK/figures/figures_17_1.jpg", "caption": "Figure 3: An adjacency matrix (a) and a representation of the edges in the associated sidigraph (b), where a + in position (i, j) indicates (ij) ∈ E+ and a -indicates (ij) ∈ E¯. The minimal sidigraph (c) formally captures the fact that Figure 2 has the minimal set of entries in the adjacency matrix to uniquely distinguish G among all transitively-closed DAGs.", "description": "This figure shows three representations of the same transitively-closed DAG. (a) is the adjacency matrix of the graph, with 1 denoting an edge and 0 denoting no edge. (b) is the equivalent sidigraph, using + for positive edges (present in the graph) and - for negative edges (absent in the graph). This representation explicitly highlights the edges required for uniquely identifying the graph. Finally, (c) depicts the minimal sidigraph H*, which includes only a subset of the edges necessary to uniquely identify the graph among other transitively-closed DAGs. This minimal representation underlines the effectiveness of focusing on a subset of edges during model training.", "section": "3 Distinguishing Digraphs via Sidigraphs"}, {"figure_path": "HFS800reZK/figures/figures_22_1.jpg", "caption": "Figure 3: An adjacency matrix (a) and a representation of the edges in the associated sidigraph (b), where a + in position (i, j) indicates (ij) ∈ E+ and a -indicates (ij) ∈ E¯. The minimal sidigraph (c) formally captures the fact that Figure 2 has the minimal set of entries in the adjacency matrix to uniquely distinguish G among all transitively-closed DAGs.", "description": "This figure shows an adjacency matrix of a graph, its equivalent sidigraph representation, and the minimal sidigraph needed to uniquely identify the graph amongst all transitively-closed DAGs. The sidigraph uses + and - to represent the positive and negative edges respectively, while the minimal sidigraph highlights the smallest set of entries required for unique identification.", "section": "3.2 Distinguishing Transitively-Closed Digraphs"}]