[{"figure_path": "h3BdT2UMWQ/figures/figures_1_1.jpg", "caption": "Figure 1: Illustration of DDSR constructing fuzzy sets and incorporating semantic IDs to enhance sequential recommendations. In real-world scenarios, a user's final choice often reflects their immediate interests (left subfigure). We reconstruct the true evolution of interests by constructing fuzzy sets for each item in the interaction sequence (middle subfigure). The right subfigure provides an overview of the process of generating semantic IDs for recommendations based on item-related descriptions.", "description": "This figure illustrates the DDSR model's core components and processes. The left panel depicts how a user's interest might be diffuse and uncertain before a final selection.  The middle panel shows how DDSR uses discrete diffusion to model the evolution of interests as fuzzy sets of items. Finally, the right panel explains how item descriptions are converted into semantic IDs for more efficient processing and to alleviate cold-start problems.", "section": "Introduction"}, {"figure_path": "h3BdT2UMWQ/figures/figures_9_1.jpg", "caption": "Figure 1: Illustration of DDSR constructing fuzzy sets and incorporating semantic IDs to enhance sequential recommendations. In real-world scenarios, a user's final choice often reflects their immediate interests (left subfigure). We reconstruct the true evolution of interests by constructing fuzzy sets for each item in the interaction sequence (middle subfigure). The right subfigure provides an overview of the process of generating semantic IDs for recommendations based on item-related descriptions.", "description": "This figure illustrates the DDSR model's key components and how it addresses the challenges of sequential recommendation.  The left panel shows how a user's interests may be fuzzy and not clearly defined until a final choice is made. The middle panel depicts how DDSR models these fuzzy interests using sets of interaction sequences. Finally, the right panel outlines the process of using semantic IDs (instead of item IDs) to improve efficiency and address cold-start problems.", "section": "1 Introduction"}]