[{"type": "text", "text": "Natural Counterfactuals With Necessary Backtracking ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Guang-Yuan $\\mathbf{Ha0}^{1,5*}$ , Jiji $\\mathbf{Zhang^{1*}}$ , Biwei Huang2, Hao Wang3, Kun Zhang4,5 1Chinese University of Hong Kong, 2University of California San Diego, 3Rutgers University 4Carnegie Mellon University, 5Mohamed bin Zayed University of Artificial Intelligence guangyuanhao@outlook.com, jijizhang@cuhk.edu.hk bih007@ucsd.edu, hw488@cs.rutgers.edu, kunz1@cmu.edu ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Counterfactual reasoning is pivotal in human cognition and especially important for providing explanations and making decisions. While Judea Pearl’s influential approach is theoretically elegant, its generation of a counterfactual scenario often requires too much deviation from the observed scenarios to be feasible, as we show using simple examples. To mitigate this difficulty, we propose a framework of natural counterfactuals and a method for generating counterfactuals that are more feasible with respect to the actual data distribution. Our methodology incorporates a certain amount of backtracking when needed, allowing changes in causally preceding variables to minimize deviations from realistic scenarios. Specifically, we introduce a novel optimization framework that permits but also controls the extent of backtracking with a “naturalness” criterion. Empirical experiments demonstrate the effectiveness of our method. The code is available at https: //github.com/GuangyuanHao/natural_counterfactuals. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Counterfactual reasoning, which aims to answer what a feature of the world would have been if some other features had been different, is often used in human cognition, to perform self-reflection, provide explanations, and inform decisions [29, 6]. For AI systems to achieve human-like abilities of reflection and decision-making, incorporating counterfactual reasoning is crucial. Judea Pearl’s structural approach to counterfactual modeling and reasoning [26] has been especially influential in recent decades. Within this framework, counterfactuals are conceptualized as being generated by surgical interventions on the variables to be changed, while leaving its causally upstream variables intact and all downstream causal mechanisms invariant. These counterfactuals are thoroughly nonbacktracking in that the desired change is supposed to happen without tracing back to changes in causally preceding variables. Reasoning about these counterfactuals can yield valuable insights into the consequences of hypothetical actions. Consider a scenario: a sudden brake of a high-speed bus caused Tom to fall and injure Jerry. Non-backtracking counterfactuals would tell us that if Tom had stood still (despite the sudden braking), then Jerry would not have been injured. Pearl’s approach supplies a principled machinery to reason about conditionals of this sort, which are usually useful for explanation, planning, and responsibility allocation. ", "page_idx": 0}, {"type": "text", "text": "However, such surgical interventions are sometimes so removed from what are or can be observed that it is difficult or even impossible to learn from data the consequences of such interventions. In the previous example, preventing Tom’s fall in a sudden braking scenario requires defying mechanisms that are difficult or even physically impossible to disrupt. As a result, there are likely to be no data points in the reservoir of observed scenarios that are consistent with a person standing still during a sudden braking. If so, it can be very challenging to learn to generate such a counterfactual from the available data, as we will demonstrate in our experiments.2 ", "page_idx": 0}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "In this paper, we introduce a notion of “natural counterfactuals” to address the above issue with non-backtracking counterfactuals. Our notion will allow a certain amount of backtracking, to keep the counterfactual scenario “natural” with respect to the available observations. For example, rather than the unrealistic scenario where Tom does not fall at a sudden bus stop, a more natural counterfactual scenario to realize the change to not-falling would involve changing at the same time some causally preceding events, such as changing the sudden braking to gradually slowing down. On the other hand, our notion also constrains the extent of backtracking; in addition to a naturalness criterion, we formulate an optimization scheme to encourage minimizing backtracking while meeting the naturalness criterion. ", "page_idx": 1}, {"type": "text", "text": "As we will show empirically, this new notion of counterfactual is especially useful from a machine learning perspective. When interventions lead to unrealistic scenarios relative to the training data, predicting counterfactual outcomes in such scenarios can be highly uncertain and inaccurate [13]. This issue becomes particularly pronounced when non-parametric models are employed, as they often struggle to generalize to unseen, out-of-distribution data [31]. The risk of relying on such counterfactuals is thus substantial, especially in high-stake applications like healthcare and autonomous driving. In contrast, our approach amounts to searching for feasible changes that keep generated counterfactuals within its original distribution, employing backtracking when needed. This strategy effectively reduces the risk of inaccurate predictions and ensures more reliable results. ", "page_idx": 1}, {"type": "text", "text": "In short, our approach aims to achieve the goal of ensuring that counterfactual scenarios remain sufficiently realistic with respect to the actual data distribution by permitting minimal yet necessary backtracking. It is designed with two major elements. First, we need criteria to determine the feasibility of interventions, ensuring they are realistic with respect to the actual data distribution. Second, we appeal to backtracking when and only when it is necessary to avoid infeasible interventions, and need to develop an optimization framework to realize this strategy. To be clear, our aim is not to propose a uniquely correct semantics for counterfactuals or to show that our notion of counterfactuals is superior to others for all purposes. Rather, our goal is to develop a notion of counterfactual that is theoretically well-motivated and practically useful in some contexts and for certain purposes. There may in the end be a general semantics to unify fruitfully our notion and other notions of counterfactual in the literature, but we will not attempt that in this paper. Our working assumption is that there can be different but equally coherent notions of counterfactuals, and we aim to show that the notion developed in this paper is particularly useful for generating counterfactual instances that are feasible with respect to data. ", "page_idx": 1}, {"type": "text", "text": "The key contributions of this paper include: ", "page_idx": 1}, {"type": "text", "text": "• Developing a more flexible and realistic notion of natural counterfactuals, addressing the limitations of non-backtracking reasoning while keeping its merits as far as possible.   \n• Introducing an innovative and feasible optimization framework to generate natural counterfactuals.   \n• Detailing a machine learning approach to produce counterfactuals within this framework, with empirical results from simulated and real data showcasing the superiority of our method compared to non-backtracking counterfactuals. ", "page_idx": 1}, {"type": "text", "text": "2 Related Work ", "text_level": 1, "page_idx": 1}, {"type": "text", "text": "Non-backtracking Counterfactual Generation. As will become clear, our theory is presented in the form of counterfactual sampling or generation. [28, 18, 8, 30] use the deep generative models to learn a causal model from data given a causal graph, and then use the model to generate non-backtracking counterfactuals. Our experiments will examine some of these models and demonstrate their difficulties in dealing with interventions that are unrealistic relative to training data, due to the fact that the causal model learned from data is not reliable in handling inputs that are out-of-distribution. ", "page_idx": 1}, {"type": "text", "text": "Backtracking Counterfactuals. Backtracking in counterfactual reasoning has drawn plenty of attention in philosophy [14], psychology [9], and cognitive science [12]. [14] proposes a theory that is in spirit similar to ours, in which backtracking is allowed but limited by some requirement of matching as much causal upstream as possible. [12] shows that people use both backtracking and non-backtracking counterfactuals in practice and tend to use backtracking counterfactuals when explicitly required to explain causes for the supposed change in a counterfactual. [35] is the first work, as far as we know, to formally introduce backtracking counterfactuals in the framework of structural causal models. The main differences between this work and ours are that [35] requires “full” backtracking given a causal model, all the way back to exogenous noise terms, and measures closeness in terms of these noise terms, whereas we limit backtracking to what is needed to render the counterfactual “natural”, and the measure of closeness in our framework can be defined directly on endogenous, observed variables, which is arguably desirable because changes to the unobserved variables are by definition outside of our control and not actionable. More detailed comparisions can be found in Sec. F of the Appendix. ", "page_idx": 2}, {"type": "text", "text": "Algorithmic Recourse and Counterfactual Explanations. Algorithmic recourse (AR) [16] and counterfactual explanations (CE) [36, 10, 23, 3, 24, 34, 32, 37] represent two leading strategies within explainable AI that heavily exploit counterfactual reasoning or reasoning about intervention effects. Various studies [16, 1, 27, 15, 37] explore concepts of feasibility akin to that of “naturalness” in this work, though apply them in quite different contexts. The objectives of CE and AR are to pinpoint minimal alterations to an input (in CE) or minimal interventions (in AR) that would either induce a desirable output from a predictive model (in CE) or lead to an desirable outcome (in AR). In contrast, our work here focuses primarily on generating counterfactuals. While this paper does not directly address CE or AR, our notion of natural counterfactuals is likely to be very relevant to these tasks. ", "page_idx": 2}, {"type": "text", "text": "3 Preliminaries ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "In this section, we begin by outlining various basic concepts in causal inference, followed by an introduction to non-backtracking counterfactuals. ", "page_idx": 2}, {"type": "text", "text": "Structural Causal Models (SCM). We assume there is an underlying recursive SCM [26] of the following sort to represent the data generating process. A SCM $\\mathcal{M}:=\\langle\\bar{\\mathbf{U}},\\mathbf{V},\\mathbf{f},p(\\mathbf{U})\\rangle$ consists of exogenous (noise) variables $\\mathbf{U}=\\{\\mathbf{U}_{1},...,\\mathbf{U}_{N}\\}$ , endogenous (observed) variables $\\dot{\\mathbf V}=\\{\\mathbf V_{1},...,\\mathbf V_{N}\\}$ , functions $\\mathbf{f}=\\{f_{1},...,f_{N}\\}$ , and a joint distribution $p(\\mathbf{U})$ of noise variables, which are assumed to be jointly independent. Each function, $f_{i}\\in\\mathbf{f}$ , specifies how an endogenous variable $\\mathbf{V}_{i}$ is determined by its parents $\\mathbf{P}\\mathbf{A}_{i}\\subseteq\\mathbf{V}$ : ", "page_idx": 2}, {"type": "equation", "text": "$$\n\\mathbf{V}_{i}:=f_{i}(\\mathbf{PA}_{i},\\mathbf{U}_{i}),\\quad i=1,...,N\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "Such a SCM entails a (causal) Bayesian network over the observed variables, consisting of the directed acyclic graph over $\\mathbf{V}$ in which there is an arrow from each member of $\\mathbf{PA}_{i}$ to $\\mathbf{V}_{i}$ , and the joint distribution of $\\mathbf{V}$ induced by $\\mathbf{f}$ and $p(\\mathbf{U})$ . In our setting, we assume this causal graph is known and samples from this joint distribution are available, but f and $p(\\mathbf{U})$ are not given, though some assumptions on f and $p(\\mathbf{U})$ will be needed for identifiability. ", "page_idx": 2}, {"type": "text", "text": "Local Mechanisms. Functions in $\\mathbf{f}$ are usually regarded as representing local mechanisms. In this paper, however, we will use the term “local mechanism” to refer to the conditional distribution of an endogenous variable given its parent variables, i.e., $p(\\mathbf{V}_{i}|\\mathbf{P}\\mathbf{A}_{i})$ for $i=1,...,N$ , which can be estimated from the available information. Note that a local mechanism in this sense implicitly encodes the properties of the corresponding noise variable; given a fixed value of $\\mathbf{PA}_{i}$ , the noise $\\mathbf{U}_{i}$ determines the probability distribution of $\\mathbf{V}_{i}$ [26]. Hence, the term “local mechanism” will also be used sometimes to refer to the distribution of the noise variable $p(\\mathbf{U}_{i})$ . ", "page_idx": 2}, {"type": "text", "text": "Intervention. Given a SCM, an intervention on a set of endogenous variables $\\mathbf A\\subseteq\\mathbf V$ is represented by replacing the functions for members of A with constant functions $X=x^{*}$ , where $X\\in\\mathbf{A}$ and $x^{*}$ is the target value of $X$ , and leaving the functions for other variables intact [26].3 ", "page_idx": 2}, {"type": "text", "text": "Non-Backtracking Counterfactuals. Let A, B, and $\\mathbf{E}$ be sets of endogenous variables. A general counterfactual question takes the following form: given evidence $\\mathbf{E}=\\mathbf{e}$ , what would the value of $\\mathbf{B}$ have been if A had taken the value setting $\\mathbf{a}^{*}\\mathbf{\\phi}^{\\dagger}$ In this paper, we focus on a special case of this question in which ${\\bf E}={\\bf V}$ , i.e., the evidence is a complete data point covering all observed variables. ", "page_idx": 2}, {"type": "text", "text": "That is, given an actual date point, we consider what the data point would have been if a variable had taken a different value than its actual value. The Pearlian, non-backtracking reading of this question takes the counterfactual supposition of $\\mathbf{A}=\\mathbf{a}^{*}$ to be realized by an intervention on A [26]. This means that in the envisaged counterfactual scenario, all variables in the causal upstream of A keep their actual values while A takes a different value. As mentioned, a potential problem is that such a scenario is outside of the support of available data, and so it is often unreliable to make inferences about the downstream variables in the scenario based on the available data. ", "page_idx": 3}, {"type": "text", "text": "4 A Framework for Natural Counterfactuals ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "$D o(\\cdot)$ and $C h a n g e(\\cdot)$ Operators. Using Pearl’s influential do-operator, the non-backtracking mode appeals to $d o(\\mathbf{A}=\\mathbf{a}^{*})$ , an intervention to set the value $\\mathbf{A}$ to $\\mathbf{a}^{*}$ , to generate a counterfactual instance. However, in our framework, the counterfactual supposition is not necessarily realized by an intervention on A, while keeping all its causal upstream intact. Instead, when $d o(\\mathbf{A}=\\mathbf{a}^{*})$ results in a counterfactual setting that violates a naturalness criterion, some backtracking will be invoked. To differentiate from the intervention $d o(\\mathbf{A}=\\mathbf{a}^{*})$ , we will often use change $\\langle\\cdot\\rangle$ and write change( $\\mathbf{A}=$ $\\mathbf{a}^{*}$ ) to denote a desired modification in A. Different semantics for counterfactuals correspond to different interpretations of the change-operator. In this paper, we explore an interpretation that connects the change-operator to the do-operator in a relatively straightforward manner. ", "page_idx": 3}, {"type": "text", "text": "The basic idea is that $c h a n g e(\\mathbf{A}\\;=\\;\\mathbf{a}^{*})$ will correspond to $d o(\\mathbf{C}\\;=\\;\\mathbf{c}^{*})$ for some set $\\mathbf{C}$ that includes A and possibly some of A’s causal ancestors. When ${\\bf C}=\\{{\\bf A}\\}$ , this is equivalent to a non-backtracking interpretation. In general, however, some variables in A’s causal upstream need to change together with A in order to keep the counterfactual scenario within the relevant support. A central component of our approach is to design a way to determine $\\mathbf{C}$ and $\\mathbf{c}^{*}$ , given a request of change( $\\mathbf{\\bar{A}}=\\mathbf{\\bar{a}}^{*},$ . We will call the resulting $\\bar{d o}(\\mathbf{C}=\\bar{\\mathbf{c}}^{*})$ the least-backtracking feasible (LBF) intervention for change $\\mathbf{\\left[A_{\\lambda}=a^{*}\\right)}$ . Once the LBF intervention is determined, inferences can be made in the same fashion as in Pearl’s approach [26]. ", "page_idx": 3}, {"type": "text", "text": "To determine the LBF intervention for $c h a n g e(\\mathbf{A}=\\mathbf{a}^{*})$ , we formulate it as an optimization problem to search for a minimal change of $\\mathbf{A}$ ’s causal ancestors that, together with changing $\\mathbf{A}$ to $\\mathbf{a}^{*}$ , satisfy a “naturalness” criterion. Let $\\bar{\\bf A}{\\bf N}({\\bf A})$ denote the set of $\\mathbf{A}$ ’s ancestors in the given causal graph together with $\\mathbf{A}$ itself. We define the optimization framework, Feasible Intervention Optimization (FIO), as follows: ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\begin{array}{r l}{\\underset{a n(\\mathbf{A})^{*}}{\\mathrm{minimize}}}&{D(a n(\\mathbf{A}),a n(\\mathbf{A})^{*})}\\\\ {\\mathrm{s.t.}\\;\\;\\;\\;\\;\\;\\;\\;}&{\\mathbf{A}=\\mathbf{a}^{*},}\\\\ &{g_{n}(a n(\\mathbf{A})^{*})>\\epsilon.}\\end{array}\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "where $a n(\\mathbf A)$ and $a n(\\mathbf{A})^{*}$ represent the actual value setting and the counterfactual value setting of $\\mathbf{AN}(\\mathbf{A})$ respectively (note that $\\mathbf{A}\\subseteq\\mathbf{AN}(\\mathbf{A}))$ . $g_{n}(\\cdot)$ measures the naturalness of the counterfactual value setting of $\\mathbf{AN}(\\mathbf{A})$ and $\\epsilon$ is a small constant. So the optimization has a naturalness criterion as a constraint. On the other hand, $D(\\cdot)$ is a distance metric designed to encourage the counterfactual value setting to invoke the least amount of backtracking. Below we develop these two components in Sec. 4.1 and Sec. 4.2, respectively. Once we obtain the counterfactual value $a n(\\mathbf{A})^{*}$ by FIO, the variable set for the LBF intervention includes A and other variables corresponding to the difference between $a n(\\mathbf{A})^{*}$ and $a n(\\mathbf{A})$ , i.e., $\\mathbf{A}$ is always included in $\\mathbf{C}$ even when $a\\bar{n}(\\mathbf{A})^{*}\\stackrel{}{=}a n(\\mathbf{A})$ . ", "page_idx": 3}, {"type": "text", "text": "4.1 Naturalness Constraints ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "As indicated previously, the intended purpose of the naturalness constraint is to confine the counterfactual instance sufficiently within the support of the data distribution. Roughly and intuitively, the more frequently a value occurs, the more it is considered to be “natural”. Moreover, we would like to use a measure of naturalness that takes into account local mechanisms according to the given causal graph rather than just the joint distribution. Therefore, we propose to assess naturalness by examining the distribution characteristics, such as density, of each variable’s value $\\mathbf{V}_{j}=\\mathbf{v}_{j}^{*}$ given the variable’s local mechanism $p(\\mathbf{V}_{j}|p a_{j}^{*})$ , where $\\mathbf{V}_{j}\\in\\mathbf{AN}(\\mathbf{A})$ and $p a_{j}^{*}$ denotes its parental value setting.4 ", "page_idx": 3}, {"type": "text", "text": "4.1.1 Local Naturalness Criteria ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "We start by proposing some measures of the naturalness of one variable’s value, $\\mathbf{v}_{j}^{*}$ , within the counterfactual data point $a n(\\mathbf{A})^{*}$ in this section, followed by defining a measure of the overall naturalness of $a n(\\mathbf{A})^{*}$ in the next. ", "page_idx": 4}, {"type": "text", "text": "Informally, a value satisfies the criterion of local $\\epsilon$ -natural generation if it is a natural outcome of its local mechanism. The proposed measures of naturalness will depend on the specific value $\\mathbf{V}_{j}=\\mathbf{v}_{j}^{*}$ , alongside its parent value $\\mathbf{P}\\mathbf{A}_{j}=p a_{j}^{*}$ , noise value $\\mathbf{U}_{j}=\\mathbf{u}_{j}^{*}$ , and the corresponding local mechanism, expressed by $p(\\mathbf{V}_{j}|\\mathbf{PA}_{j}=p a_{j}^{*})$ or $p(\\mathbf{U}_{j})$ . The cumulative distribution function (CDF) for noise variable $\\mathbf{{U}}_{j}$ at $\\mathbf{U}_{j}=\\mathbf{u}_{j}^{*}$ is $\\begin{array}{r}{F(\\mathbf{u}_{j}^{*})=\\int_{-\\infty}^{\\mathbf{u}_{j}^{*}}p(\\mathbf{U}_{j})d\\mathbf{U}_{j}}\\end{array}$ , and for the conditional distribution $p(\\mathbf{V}_{j}|\\mathbf{P}\\mathbf{A}_{j}=p a_{j}^{*})$ at $\\mathbf{V}_{j}=\\mathbf{v}_{j}^{*}$ is $\\begin{array}{r}{F({\\bf V}_{j}|p a_{j}^{*})=\\int_{-\\infty}^{{\\bf v}_{j}^{*}}p({\\bf V}_{j}={\\bf v}_{j}^{*}|p a_{j}^{*})d{\\bf V}_{j}.}\\end{array}$ ", "page_idx": 4}, {"type": "text", "text": "We propose the following potential criteria based on entropy-normalized density, CDF of exogenous variables, and CDF of conditional distributions, respectively. The entropy-normalized naturalness measure evaluates the naturalness of $\\mathbf{v}_{j}^{*}$ in relation to its local mechanism $p(\\mathbf{V}_{j}|\\mathbf{P}\\mathbf{A}_{j}=p a_{j}^{*})$ . The CDF-based measures, namely the latter two criteria, consider data points in the tails to be less natural. Each of these criteria has its own intuitive appeal, and their relative merits will be discussed subsequently. Below, we use $g_{l}(\\mathbf{v}_{j}^{*})$ to represent a (local) naturalness measure of $\\mathbf{v}_{j}^{*}$ . We consider the following three possible measures: ", "page_idx": 4}, {"type": "text", "text": "(1) Entropy-Normalized Measure: $g_{l}(\\mathbf{v}_{j}^{*})~=~p(\\mathbf{v}_{j}^{*}|p a_{j}^{*})e^{H(\\mathbf{V}_{j}|p a_{j}^{*})}$ , where $H({\\bf V}_{j}\\vert p a_{j}^{*})~=~~$ $\\mathbb{E}[-\\log p(\\mathbf{V}_{j}|p a_{j}^{*})]$ ;   \n(2) Exogenous CDF Measure: $g_{l}(\\mathbf{v}_{j}^{*})=\\operatorname*{min}(F(\\mathbf{u}_{j}^{*}),1-F(\\mathbf{u}_{j}^{*}))$ ;   \n(3) Conditional CDF Measure: $g_{l}(\\mathbf{v}_{j}^{*})=\\operatorname*{min}(F(\\mathbf{v}_{j}^{*}|p a_{j}^{*}),1-F(\\mathbf{v}_{j}^{*}|p a_{j}^{*}));$ ; ", "page_idx": 4}, {"type": "text", "text": "where the function $\\operatorname*{min}(\\cdot)$ returns the minimum of the given values. When $g_{l}(\\mathbf{v}_{j}^{*})>\\epsilon$ , we say the $\\mathbf{v}_{j}^{*}$ given its causal parents’ values satisfies the criterion of local $\\epsilon$ -natural generation. ", "page_idx": 4}, {"type": "text", "text": "Some comments on these choices are in order: ", "page_idx": 4}, {"type": "text", "text": "Choice (1): Entropy-Normalized Measure. Specifically, Choice (1), $p(\\mathbf{v}_{j}^{*}|p a_{j}^{*})e^{H(\\mathbf{V}_{j}|p a_{j}^{*})}$ , can be rewritten as $e^{\\log p(\\mathbf{v}_{j}^{\\ast}|p a_{j}^{\\ast})+\\mathbb{E}[-\\log p(\\mathbf{V}_{j}|p a_{j}^{\\ast})]}$ , where $-\\log p(\\mathbf{v}_{j}^{*}|{p a}_{j}^{*})$ can be seen as the measure of surprise of $\\mathbf{v}_{j}^{*}$ given $p a_{j}^{*}$ and $\\mathbb{E}[-\\log p(\\mathbf{V}_{j}|p a_{j}^{*})]$ can be considered as the expectation of surprise of the local mechanism $p(\\mathbf{V}_{j}\\vert p a_{j}^{*})$ [2]. Hence, the measure quantifies the relative naturalness (i.e., negative surprise) of $\\mathbf{V}_{j}$ . Implementing this measure is usually straightforward when employing a parametric SCM where the conditional distributions can be explicitly represented. ", "page_idx": 4}, {"type": "text", "text": "Choice (2): Exogenous CDF Measure. If using a parametric SCM, we might directly measure differences on exogenous variables. However, in a non-parametric SCM, exogenous variables are in general not identifiable, and different noise variables may have different distributions. Still, we may consider using the CDF of exogenous variables to align the naturalness of different distributions, based on a common assumption for non-parametric SCMs in the machine learning system. The assumption is that the support of the local mechanism $p(\\mathbf{V}_{j}|\\mathbf{P}\\mathbf{A}_{j}=p a_{j}^{*})$ does not contain disjoint sets, the function $f_{j}$ in the SCM is monotonically increasing with respect to the noise variable $\\mathbf{{U}}_{j}$ , which is assumed to follow a standard Gaussian distribution [20]. Data points from the tails of a standard Gaussian can be thought of as improbable events. Hence, $\\mathbf{V}_{j}=\\mathbf{v}_{j}^{*}$ satisfies local $\\epsilon$ -natural generation when its exogenous CDF $F(\\mathbf{u}_{j}^{*})$ falls within the range $(\\epsilon,1-\\epsilon)$ . In practice, for a single variable, $\\mathbf{{U}}_{j}$ is a one-dimensional variable, and it is easier to enforce the measure than Choice (1), which involves conditional distributions. ", "page_idx": 4}, {"type": "text", "text": "Choice (3): Conditional CDF Measure. The measure treats a particular value in the tails of local mechanism $p(\\mathbf{V}_{j}|p a_{j}^{*})$ as unnatural. Hence, $\\mathbf{V}_{j}=\\mathbf{v}_{j}^{*}$ meets local $\\epsilon$ -natural generation when $F(\\mathbf{V}_{j}\\,=,\\mathbf{v}_{j}^{*}|p a_{j}^{*})$ falls within the range $(\\epsilon,1-\\epsilon)$ instead of tails. This measure can be used in parametric models where the conditional distribution can be explicitly represented. It can also be easily used in non-parametric models and the measure is equivalent to Choice (2) when those models satisfy the assumption mentioned in Choice (2), since the CDF $F(\\mathbf{V}_{j}|p a_{j}^{*})$ has a one-to-one mapping with the CDF $F(\\mathbf{U}_{j})$ , i.e., $F(\\mathbf{v}_{j}^{*}|p a_{j}^{*})=F(\\mathbf{u}_{j}^{*})$ , when $\\mathbf{v}_{j}^{*}=f(p a_{j}^{*},\\mathbf{u}_{j}^{*}\\bar{)}$ . ", "page_idx": 4}, {"type": "text", "text": "", "page_idx": 5}, {"type": "text", "text": "4.1.2 Global Naturalness Criteria ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "Given a local naturalness measure $g_{l}$ , we simply define a global naturalness measure for $a n(\\mathbf{A})^{*}$ as ", "page_idx": 5}, {"type": "equation", "text": "$$\ng_{n}(a n(\\mathbf{A})^{*})=\\operatorname*{min}_{\\mathbf{v}_{j}^{*}\\in a n(\\mathbf{A})^{*}}(g_{l}(\\mathbf{v}_{j}^{*})).\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "That is, $g_{n}(a n(\\mathbf{A})^{*})$ returns the smallest local naturalness value among members of $\\mathbf{AN}(\\mathbf{A})$ . Finally, we can define a criterion of $\\epsilon$ -natural generation to assess whether the counterfactual value $a n(\\mathbf{A})^{*}$ is sufficiently natural. ", "page_idx": 5}, {"type": "text", "text": "Definition 1 ( $\\epsilon$ -Natural Generation). Given a SCM containing a set A, let $\\mathbf{AN}(\\mathbf{A})$ contain all ancestors of A and A itself. A value setting $\\mathbf{AN}(\\mathbf{A})=a n(\\mathbf{A})^{*}$ satisfies $\\epsilon$ -natural generation, if and only if, $g_{n}(a n(\\mathbf{A})^{*})>\\epsilon$ and $\\epsilon$ is a small constant. ", "page_idx": 5}, {"type": "text", "text": "Obviously, a larger value of $\\epsilon$ implies a higher standard for the naturalness of the counterfactual value setting $a n(\\mathbf{A})^{*}$ . To consider only feasible interventions, we require $a n(\\mathbf{A})^{*}$ to meet $\\epsilon$ -natural generation, which is a constraint used in FIO. ", "page_idx": 5}, {"type": "text", "text": "4.2 Distance Measure to Limit Backtracking ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "We now turn to the distance measure in Eqn. 2 of the FIO framework. We considered two distinct distance measures in this work. The first prioritizes minimizing changes in the observed causal ancestors of the target variable of the desired change. The second focuses on reducing alterations in local mechanisms, regarding them as inherent costs of an intervention. Due to space limitations, we will introduce here only the simpler measure in terms of minimal changes in the observable causal ancestors. A discussion of the other measure can be found in Sec. G. ", "page_idx": 5}, {"type": "text", "text": "For our purpose, the $L^{1}$ norm is a good choice, as it encourage sparse changes and thus sparse backtracking: ", "page_idx": 5}, {"type": "equation", "text": "$$\nD(a n(\\mathbf{A}),a n(\\mathbf{A})^{*})=\\|a n(\\mathbf{A})^{*}-a n(\\mathbf{A})\\|_{1}\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $a n(\\mathbf{A})$ and $a n(\\mathbf{A})^{*}$ represent the actual value and counterfactual value of A’s ancestors $\\mathbf{AN}(\\mathbf{A})$ respectively, where $\\mathbf{A}\\in\\mathbf{AN}(\\mathbf{A})$ . Because endogenous variables may vary in scale, e.g., a normal distribution with a range of $(-\\infty,\\infty)$ versus a uniform distribution over the interval [0, 1], we standardize each endogenous variable before computing the distance. This normalization ensures a consistent and fair evaluation of changes. ", "page_idx": 5}, {"type": "text", "text": "Implicitly, this distance metric favors changes in variables that are proximal to A, since altering a more remote variable typically results in changes to more downstream variables. In the extreme case, when the value $a n(\\mathbf{A})^{*}$ corresponding to $d o(\\mathbf{A}\\,=\\,\\mathbf{a}^{*})$ , i.e., the one corresponding to the non-backtracking counterfactual, already meets the $\\epsilon$ -natural generation criterion, the distance metric $D(a n(\\mathbf{A}),a n(\\bar{\\mathbf{A}})^{*})$ will achieve the minimal value $\\left|\\mathbf{a}-\\mathbf{a}^{*}\\right|$ . In such a case, no backtracking is needed and the non-backtracking counterfactual will be generated. However, If $d o(\\mathbf{A}=\\mathbf{a}^{*})$ does not meet the $\\epsilon_{}$ -natural generation criterion, it becomes necessary to backtrack. ", "page_idx": 5}, {"type": "text", "text": "4.3 Identifiablity of Natural Counterfactuals ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "As said, we assume we do not have prior knowledge of the functions of the SCM and so noise variables are in general not identifiable from the observed variables. However, if we assume the SCM satisfies the conditions of the following theorem, then the counterfactual instance resulting from a LBF intervention is identifiable. ", "page_idx": 5}, {"type": "text", "text": "Theorem 4.1 (Identifiable Natural Counterfactuals). Given the causal graph and the joint distribution over $\\mathbf{V}$ , suppose $\\mathbf{V}_{i}$ satisfies the following structural causal model: $\\mathbf{V}_{i}:=f_{i}(\\mathbf{PA}_{i},\\mathbf{U}_{i})$ for any $\\mathbf{V}_{i}\\,\\in\\,\\mathbf{V}$ , assume every $f_{i},$ , though unknown, is smooth and strictly monotonic w.r.t. $\\mathbf{U}_{i}$ for fixed values of $\\mathbf{PA}_{i}$ . Then, given an actual data point ${\\bf V}={\\bf v},$ , with a $L B F$ intervention $d o(\\mathbf{C}\\,=\\,\\mathbf{c}^{*})$ (satisfying the criterion of $\\epsilon$ -natural generation), the counterfactual instance $\\mathbf{V}=\\mathbf{v}^{*}$ is identifiable: ${\\bf V}={\\bf v}^{*}|d o({\\bf C}={\\bf c}^{*}),{\\bf V}={\\bf v}.$ . ", "page_idx": 5}, {"type": "text", "text": "This theorem confirms the identifiability of our natural counterfactuals from the causal graph and the joint distribution over the observed variables.5Specifically, since $d o(\\mathbf{C}=\\mathbf{c}^{*})$ satisfies the criterion of $\\epsilon$ -natural generation, it guarantees that the resulting counterfactual instance falls within the support of the observed joint distribution. Then, building on Theorem 1 from [20], we can demonstrate that using the actual data distribution allows for the inference of natural counterfactuals without knowing the functions or the noise distributions of the SCM. ", "page_idx": 6}, {"type": "text", "text": "5 A Practical Method for Generating Natural Counterfactuals ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "In this section, we provide a practical method for solving (approximately) the FIO problem described in the last section. We assume that we are given data sampled from the joint distribution of the endogenous variables and a causal graph, and that the underlying SCM satisfies the assumptions in Theorem 4.1. We learn a generative model for the endogenous variables from data, serving as an estimated SCM to generate natural counterfactuals: $\\mathbf{V}_{i}:=\\hat{f}_{i}(\\mathbf{PA}_{i},\\mathbf{U}_{i})$ for $i=1,...,N$ , where $\\hat{f}_{i}$ is assumed to be reversible given $\\mathbf{PA}_{i}$ . Note that, unlike the functions in the true SCM, these learned functions in general do not generalize well to out-of-distribution data, as demonstrated in the experiments, which, recall, is a main motivation for employing natural counterfactuals instead. For simplicity, we assume the noise distribution is standard Gaussian, though the identifiability of natural counterfactuals only requires that noise variables are continuous and does not depend on the specific form of the noise distribution. The specific FIO problem we target plugs the distance measure (Eqn. 4) and the naturalness measure from Choice (3) in Sec. 4.1.1 (or Choice (2), which is equivalent to Choice (3) given the assumptions) into Eqn. 2: ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\underset{a n(\\mathbf{A})^{*}}{\\mathrm{minimize}}\\,\\|a n(\\mathbf{A})^{*}-a n(\\mathbf{A})\\|_{1}}\\\\ &{s.t.\\quad\\mathbf{A}=\\mathbf{a}^{*},}\\\\ &{\\quad\\epsilon<F(\\mathbf{V}_{j}=\\mathbf{v}_{j}^{*}|p a_{j}^{*})<1-\\epsilon,\\forall\\mathbf{V}_{j}\\in\\mathbf{AN}(\\mathbf{A}).}\\end{array}\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "Again, in theory, there may be no solution for $a n(A)^{*}$ if the naturalness criterion is demanding. In the extreme case, for example, even when $\\mathbf{a}^{*}=\\mathbf{a}$ , if $\\epsilon$ is set so high that the actual instance does not satisfy the condition of $\\epsilon$ -natural generation, then no solution exists. ", "page_idx": 6}, {"type": "text", "text": "We propose to solve this optimization problem using the following approximate method. Since the estimated functions $\\hat{f}_{j}$ are assumed to be reversible, we can reformulate the problem of searching for optimal values of the endogenous variables as one of searching for optimal values of the exogenous noise variables. A feasible approach is to use the Lagrangian method [5] to minimize the following objective loss: ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathcal{L}(\\mathbf{u}_{\\mathbf{AN}(\\mathbf{A})}^{*})=\\displaystyle\\sum_{\\mathbf{u}_{j}^{*}\\in\\mathfrak{u}_{\\mathbf{AN}(\\mathbf{A})}^{*}}\\vert\\hat{f}_{j}(p a_{j}^{*},\\mathbf{u}_{j}^{*})-\\mathbf{v}_{j}\\vert+w_{\\epsilon}\\displaystyle\\sum_{\\mathbf{u}_{j}^{*}\\in\\mathfrak{u}_{\\mathbf{AN}(\\mathbf{A})}^{*}}\\lbrack\\operatorname*{max}(\\epsilon-F(\\mathbf{u}_{j}^{*}),0)+\\operatorname*{max}(\\epsilon+F(\\mathbf{u}_{j}^{*})-1,0)\\rbrack}\\\\ {\\textrm{s f}\\quad\\mathbf{u}^{*}=\\hat{f}_{-}^{-1}(m a^{*},\\mathbf{\\Lambda}_{\\mathbf{a}^{*}}^{\\mathbf{a}})}\\end{array}\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "where the optimization parameters are the counterfactual values of the noise variables corresponding to $\\mathbf{A}$ ’s ancestors, $\\mathbf{u}_{\\mathbf{AN}(\\mathbf{A})}^{*}$ , and the function $\\operatorname*{max}(\\cdot)$ returns the maximum between two values. The first term is the distance measure in the FIO problem, while the second term implements the constraint of $\\epsilon$ -natural generation. The hyperparameter $w_{\\epsilon}$ serves to modulate the penalty imposed on nonnatural values. Notice that, in order to ensure the hard constraint $\\mathbf{A}=\\mathbf{a}^{*}$ , A’s noise value $\\mathbf{u_{A}^{*}}$ is not optimized explicitly, since the value $\\mathbf{pa_{A}^{*}}$ is fully determined by $\\mathbf{a}^{*}$ and other noise values. Hence, only noise values other than $\\mathbf{u}_{\\mathbf{A}}^{*}$ are optimized. Further details are provided in Sec. D. ", "page_idx": 6}, {"type": "text", "text": "For simplicity, we have focused on the case of “full evidence” in presenting our framework and method. But it is straightforward to extend the approach to address cases of “partial evidence”, i.e., $\\mathbf{E}\\neq\\mathbf{V}$ . In such cases, for the generative task, we can simply sample from $p(\\mathbf{V}|\\mathbf{E})$ , treating it as full evidence, and obtain a natural counterfactual from the resulting sample. ", "page_idx": 6}, {"type": "table", "img_path": "N6zJ8DclC2/tmp/90bdb51eda732659ce26a54775a90c2aada39f41d8c2d762bc96c267bd200a41.jpg", "table_caption": ["Table 1: MAE Results on Toy $^{\\,l}$ to Toy 4 (Lower MAE is better). To save room, we also write “do” for “change” for natural counterfactuals. "], "table_footnote": [], "page_idx": 7}, {"type": "image", "img_path": "N6zJ8DclC2/tmp/2280fe2911aff7e4c9da8797d4364747bec4d64ba9dda7ff929bd1d78b740c7a.jpg", "img_caption": ["Figure 1: The Visualization Results on Toy $^{\\,I}$ (View the enlarged figure in Fig. 3 in the Appendix). "], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "6 Experiments ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "In this section, we evaluate the effectiveness of our method through empirical experiments on four synthetic datasets and two real-world datasets. ", "page_idx": 7}, {"type": "text", "text": "We propose using the deviations between generated and ground-truth outcomes as a measure of performance. We expect our natural counterfactuals to significantly reduce errors compared to non-backtracking counterfactuals. This advantage can be attributed to the effectiveness of our method in performing necessary backtracking that identifies feasible interventions, keeping counterfactual values within the data distribution, so that the learned functions are applicable. On the other hand, non-backtracking counterfactuals often produce out-of-distribution values [13, 31], posing challenges for generalization using the learned functions. ", "page_idx": 7}, {"type": "text", "text": "6.1 Simulation Experiments ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "We start with four simulation datasets, which we use designed SCMs to generate. Please refer to the Appendix for more details about these datasets. Let’s first look at Toy $^{\\,l}$ , which contains three variables $(n_{1},n_{2},n_{3})$ . $n_{1}$ is the confounder of $n_{2}$ and $n_{3}$ , and $n_{1}$ and $n_{2}$ cause $n_{3}$ . ", "page_idx": 7}, {"type": "text", "text": "Experimental Settings. Again, we assume data and a causal graph are known, but not the groundtruth SCM. We employ normalizing flows to learn a generative model of variables $(n_{1},n_{2},n_{3})$ compatible with the causal order. Given the pretrained causal model and a data point from the test set as evidence, we set $n_{1}$ or $n_{2}$ as $\\mathbf{A}$ and randomly sample values from test dataset as counterfactual values of the target variable $n_{1}$ or $n_{2}$ . In our natural counterfactuals, we use Eqn. 6 to determine LBF interventions, with $\\epsilon=10^{-4}$ and $w_{\\epsilon}=10^{4}$ , while in non-backtracking counterfactuals, $n_{1}$ or $n_{2}$ is directly intervened on. We report the Mean Absolute Error (MAE) between our learned counterfactual outcomes and ground-truth outcomes on $n_{2}$ or/and $n_{3}$ with multiple random seeds. Notice there may be no feasible interventions for some changes, as we mentioned in Sec. 5, and thus we only report outcomes with feasible interventions, which are within the scope of our natural counterfactuals. ", "page_idx": 7}, {"type": "text", "text": "Visualization of Counterfactuals on a Single Sample. We assess the counterfactual outcomes for a sample $(n_{1},n_{2},n_{3})=(-0.59,0.71,-0.37)$ , given the desired alteration change $(n_{2}=0.19)$ . For natural counterfactuals, it is necessary to backtrack to $n_{1}$ to realize the change. This step ensures that the pair $(n_{1},n_{2})$ remains within a high-density area of the data distribution. In essence, our intervention targets the composite variable $C=(n_{1}^{\\bar{1}},n_{2})$ . On the other hand, for non-backtracking counterfactual, the intervention simply modifies $n_{2}$ to 0.19 without adjusting $n_{1}$ , making $(n_{1},n_{2})$ out of data support. In Fig. 1 (a), we depict the original data point (yellow), the non-backtracking counterfactual (purple), and the natural counterfactual (green) for $(n_{1},n_{2})$ . The ground-truth support for these variables is shown as a blue scatter plot. ", "page_idx": 7}, {"type": "text", "text": "", "page_idx": 8}, {"type": "text", "text": "$(I)$ Feasible Intervention VS Hard Intervention. Non-backtracking counterfactuals apply a hard intervention on $n_{2}$ $\\dot{a}o(n_{2}=0.19)$ ), shifting the evidence (yellow) to the post-intervention point (purple), which lies outside the support of $(n_{1},n_{2})$ . This shows that direct interventions can result in unnatural values. Conversely, our natural counterfactual (green) remains within the support of $(n_{1},n_{2})$ due to backtracking and the LBF intervention on $(n_{1},n_{2})$ . ", "page_idx": 8}, {"type": "text", "text": "(2) Outcome Error. We calculate the absolute error between $n_{3}$ ’s model prediction and ground-truth value using either the green or purple point as input for the model $p(n_{3}|n_{1},n_{2})$ . The error for the green point is significantly lower at 0.03, compared to 2.31 for the purple point. This lower error with the green point is because it stays within the data distribution after a LBF intervention, allowing for better model generalization than the out-of-distribution purple point. ", "page_idx": 8}, {"type": "text", "text": "Counterfactuals on Whole Test Set. In Fig. 1 (b), we illustrate the superior performance of our counterfactual method on the test set, notably outperforming non-backtracking counterfactuals. This is evident as many outcomes from non-backtracking counterfactuals for $n_{3}$ significantly diverge from the $y=x$ line, showing a mismatch between predicted and ground-truth values. In contrast, our method’s outcomes largely align with this line, barring few exceptions possibly due to learned model’s imperfections. This alignment is attributed to our method’s consistent and feasible interventions, enhancing prediction accuracy, while non-backtracking counterfactuals often lead to infeasible results. Table 1 supports these findings, demonstrating that our approach exhibits a MAE reduction of $61.6\\%$ when applied to $n_{2}$ , compared with the non-backtracking method. Furthermore, our method excels even when intervening in the case of $n_{1}$ , a root cause, by excluding points that do not meet the $\\epsilon$ -natural generation criteria, further demonstrating its effectiveness. ", "page_idx": 8}, {"type": "text", "text": "Additional Causal Graph Structures. Our method also shows superior performance on three other simulated datasets with varied causal graph structures (Toy 2 to Toy 4), as demonstrated in Table 1. ", "page_idx": 8}, {"type": "text", "text": "6.2 MorphoMNIST ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "As depicted in Fig. 4 (a) of Appendix, $t$ (digit stroke thickness) causes both $i$ (stroke intensity) and $x$ (images), with $i$ being the direct cause of $x$ in MorphoMNIST. In this experiment, mirroring those in Section 6.1, we incorporate two key changes. First, we utilize two advanced deep learning models, V-SCM [25] and H-SCM [28]. Although both models are referred to as “SCM,” they only learn the conditional distributions of endogenous variables and, in theory, do not capture the functional relationships for out-of-distribution inputs. Second, due to the absence of ground-truth SCM for assessing outcome error, we adopt the counterfactual effec", "page_idx": 8}, {"type": "table", "img_path": "N6zJ8DclC2/tmp/8c4e0ae70f105f1dbc1f0c3021f9e14951858f13022de9760c2a1701852667d2.jpg", "table_caption": ["Table 2: Ablation Study on $\\epsilon$ (Lower MAE is better) "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "tiveness metric from [28, 22]. This involves   \ntraining a predictor on the dataset to estimate parent values $(\\hat{t},\\hat{i})$ from a counterfactual image $x$ generated by model $p(\\boldsymbol{x}|t,i)$ with the input $(t,i)$ , and then computing the absolute error $|t-\\hat{t}|$ or $|i-\\hat{i}|$ . ", "page_idx": 8}, {"type": "text", "text": "Ablation Study on Naturalness Threshold $\\epsilon$ . Table 2 demonstrates that our error decreases with increasing $\\epsilon$ , regardless of whether V-SCM or H-SCM is used. This trend suggests that a larger $\\epsilon$ sets a stricter standard for naturalness in counterfactuals, enhancing the feasibility of interventions and consequently lowering prediction errors. This improvement is due to that deep-learning models are more adept at generalizing to high-frequency data [11]. ", "page_idx": 8}, {"type": "text", "text": "6.3 3DIdentBOX ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "In this study, we employ two practical public datasets from 3DIdentBOX [4], namely Weak-3DIdent and Strong-3DIdent, where each image contains a teapot. Both datasets share the same causal graph, as depicted in Fig. 7 (b) of the Appendix, which includes an image variable $x$ and its seven parent variables, with a single variable $b$ and three pairs of variables: $(h,d)$ , $(v,\\beta)$ , and $(\\alpha,\\gamma)$ , where one ", "page_idx": 9}, {"type": "table", "img_path": "N6zJ8DclC2/tmp/49ae2301580ad363ee5bd1c952e2b4ecee5502e1f82cc1070b5d4c9d276b7330.jpg", "table_caption": ["Table 3: MAE Results on Weak-3DIdent and Strong-3DIdent (abbreviated as “Weak” “Strong” for simplicity). Lower MAE is better. For clarity, we use “Non” to denote Nonbacktracking. "], "table_footnote": [], "page_idx": 9}, {"type": "text", "text": "is the direct cause of the other in each pair. The primary distinction between Weak-3DIdent and Strong-3DIdent lies in the strength of the causal relationships between each variable pair, with Weak-3DIdent exhibiting weaker connections (Fig. 7 (c)) compared to Strong-3DIdent (Fig. 7 (d)). Our approach mirrors the MorphoMNIST experiments, using H-SCM as the pretrained causal model with $\\epsilon=10^{-3}$ . ", "page_idx": 9}, {"type": "text", "text": "Influence of Causal Strength. As Table 3 reveals, our method outperforms non-backtracking on both datasets, with a notably larger margin in Strong-3DIdent. This increased superiority is due to a higher incidence of infeasible hard interventions in non-backtracking counterfactuals within the Strong-3DIdent dataset. ", "page_idx": 9}, {"type": "text", "text": "See Appendix for More Details. Please refer to the Appendix for information on datasets, generated samples on MorphoMNIST and 3DIdentBox, standard deviation of results, settings of model training and FIO, differences between our natural counterfactuals and related works, and more. ", "page_idx": 9}, {"type": "text", "text": "7 Conclusion ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "Given a non-parametric SCM learned from data and a causal graph, non-backtracking counterfactual inference or generation may be highly unreliable because the corresponding non-backtracking intervention can result in a scenario that is far removed from the data based on which the SCM is learned. To address this issue, we have proposed a notion of natural counterfactuals, which incorporates a naturalness constraint and aims to keep the counterfactual supposition within the support of the training data distribution with minimal backtracking. We also developed a practical method for the generation or inference of natural counterfactuals, the effectiveness of which was demonstrated by empirical results. ", "page_idx": 9}, {"type": "text", "text": "In case it is not already transparent, we have not shown, nor did we intend to argue, that natural counterfactuals are superior to non-backtracking counterfactuals for all purposes. Non-backtracking counterfactuals, when correctly inferred, have clear advantages in revealing causal relations between events and the effects of specific actions. However, as we showed in this paper, in the context of datadriven counterfactual reasoning, inference or generation of non-backtracking counterfactuals often go astray due to the challenges of out-of-distribution generalization. Although correct information about non-backtracking counterfactuals has considerable action-guiding values, using unreliable information for that purpose is epistemologically and ethically dubious. We intend our framework of natural counterfactuals to mitigate this kind of risk, though it may appear less elegant theoretically. ", "page_idx": 9}, {"type": "text", "text": "Our current method is based on the assumption that the learned functions are invertible. One purpose of using the assumption is to ensure the identifiability of natural counterfactuals when one only has access to endogenous variables. If the assumption does not hold, identifiability is not guaranteed. For example, suppose $Y=X U_{1}+U_{2}$ where $Y$ and $X$ are endogenous variables and $U_{1}$ and $U_{2}$ are exogenous noises, then the counterfactual outcome will not be identifiable. However, if we also assume a known distribution of exogenous variables, then our method can be generalized without assuming invertible functions or independent exogenous variables. ", "page_idx": 9}, {"type": "text", "text": "Finally, we hasten to reiterate that we do not claim that the particular distance measures and naturalness measures used in this paper are the only choices or among the best. It will be interesting to study and compare alternative implementations in future work. ", "page_idx": 9}, {"type": "text", "text": "Acknowledgment ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "This material is based upon work supported by the RGC of Hong Kong under GRF13602720, NSF Award No. 2229881, AI Institute for Societal Decision Making (AI-SDM), the National Institutes of Health (NIH) under Contract R01HL159805, and grants from Salesforce, Apple Inc., Quris AI, and Florin Court Capital. ", "page_idx": 10}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "[1] André Artelt and Barbara Hammer. Convex density constraints for computing plausible counterfactual explanations. In Artificial Neural Networks and Machine Learning–ICANN 2020: 29th International Conference on Artificial Neural Networks, Bratislava, Slovakia, September 15–18, 2020, Proceedings, Part I 29, pages 353–365. Springer, 2020.   \n[2] Robert B Ash. Information theory. Courier Corporation, 2012.   \n[3] Solon Barocas, Andrew D. Selbst, and Manish Raghavan. The hidden assumptions behind counterfactual explanations and principal reasons. In FAT, 2020. [4] Alice Bizeul, Imant Daunhawer, Emanuele Palumbo, Bernhard Schölkopf, Alexander Marx, and Julia E Vogt. 3didentbox: A toolbox for identifiability benchmarking. 2023.   \n[5] Stephen P Boyd and Lieven Vandenberghe. Convex optimization. Cambridge university press, 2004.   \n[6] Ruth MJ Byrne. Counterfactual thought. Annual review of psychology, 67:135–157, 2016.   \n[7] Michelle R Conde. Necessity defined: A new role in the criminal defense system. UCLA L. Rev., 29:409, 1981.   \n[8] Saloni Dash, Vineeth N Balasubramanian, and Amit Sharma. Evaluating and mitigating bias in image classifiers: A causal perspective using counterfactuals. In Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision, pages 915–924, 2022.   \n[9] Morteza Dehghani, Rumen Iliev, and Stefan Kaufmann. Causal explanation and fact mutability in counterfactual reasoning. Mind & Language, 27(1):55–85, 2012.   \n[10] Amit Dhurandhar, Pin-Yu Chen, Ronny Luss, Chun-Chen Tu, Paishun Ting, Karthikeyan Shanmugam, and Payel Das. Explanations based on the missing: Towards contrastive explanations with pertinent negatives. In NeurIPS, 2018.   \n[11] Logan Engstrom, Andrew Ilyas, Hadi Salman, Shibani Santurkar, and Dimitris Tsipras. Robustness (python library), 2019. License: MIT.   \n[12] Tobias Gerstenberg, Christos Bechlivanidis, and David A Lagnado. Back on track: Backtracking in counterfactual reasoning. In Proceedings of the Annual Meeting of the Cognitive Science Society, volume 35, 2013.   \n[13] Negar Hassanpour and Russell Greiner. Learning disentangled representations for counterfactual regression. In International Conference on Learning Representations, 2019.   \n[14] Eric Hiddleston. A causal theory of counterfactuals. Noûs, 39(4):632–657, 2005.   \n[15] Shalmali Joshi, Oluwasanmi Koyejo, Warut Vijitbenjaronk, Been Kim, and Joydeep Ghosh. Towards realistic individual recourse and actionable explanations in black-box decision making systems. arXiv preprint arXiv:1907.09615, 2019.   \n[16] Amir-Hossein Karimi, Bernhard Schölkopf, and Isabel Valera. Algorithmic recourse: from counterfactual explanations to interventions. In Proceedings of the 2021 ACM conference on fairness, accountability, and transparency, pages 353–362, 2021.   \n[17] Diederik Kingma and Max Welling. Auto-encoding variational bayes. In ICLR, 2014.   \n[18] Murat Kocaoglu, Christopher Snyder, Alexandros G Dimakis, and Sriram Vishwanath. Causalgan: Learning causal implicit generative models with adversarial training. In International Conference on Learning Representations.   \n[19] Ilya Loshchilov and Frank Hutter. Decoupled weight decay regularization. In International Conference on Learning Representations, 2018.   \n[20] Chaochao Lu, Biwei Huang, Ke Wang, José Miguel Hernández-Lobato, Kun Zhang, and Bernhard Schölkopf. Sample-efficient reinforcement learning via counterfactual-based data augmentation. arXiv preprint arXiv:2012.09092, 2020.   \n[21] Lars Maaløe, Marco Fraccaro, Valentin Liévin, and Ole Winther. Biva: A very deep hierarchy of latent variables for generative modeling. Advances in neural information processing systems, 32, 2019.   \n[22] Miguel Monteiro, Fabio De Sousa Ribeiro, Nick Pawlowski, Daniel C Castro, and Ben Glocker. Measuring axiomatic soundness of counterfactual image models. arXiv preprint arXiv:2303.01274, 2023.   \n[23] Ramaravind K. Mothilal, Amit Sharma, and Chenhao Tan. Explaining machine learning classifiers through diverse counterfactual explanations. In FAccT, 2020.   \n[24] Nick Pawlowski, Daniel Coelho de Castro, and Ben Glocker. Deep structural causal models for tractable counterfactual inference. In NeurIPS, 2020.   \n[25] Nick Pawlowski, Daniel Coelho de Castro, and Ben Glocker. Deep structural causal models for tractable counterfactual inference. Advances in Neural Information Processing Systems, 33:857–869, 2020.   \n[26] Judea Pearl. Causality. Cambridge university press, 2009.   \n[27] Rafael Poyiadzi, Kacper Sokol, Raul Santos-Rodriguez, Tijl De Bie, and Peter Flach. Face: feasible and actionable counterfactual explanations. In Proceedings of the AAAI/ACM Conference on AI, Ethics, and Society, pages 344–350, 2020.   \n[28] Fabio De Sousa Ribeiro, Tian Xia, Miguel Monteiro, Nick Pawlowski, and Ben Glocker. High fidelity image counterfactuals with probabilistic causal models. 2023.   \n[29] Neal J Roese. Counterfactual thinking. Psychological bulletin, 121(1):133, 1997.   \n[30] Pedro Sanchez and Sotirios A Tsaftaris. Diffusion causal models for counterfactual estimation. In First Conference on Causal Learning and Reasoning.   \n[31] Bernhard Schölkopf, Francesco Locatello, Stefan Bauer, Nan Rosemary Ke, Nal Kalchbrenner, Anirudh Goyal, and Yoshua Bengio. Toward causal representation learning. Proceedings of the IEEE, 109(5):612–634, 2021.   \n[32] Lisa Schut, Oscar Key, Rory McGrath, Luca Costabello, Bogdan Sacaleanu, Medb Corcoran, and Yarin Gal. Generating interpretable counterfactual explanations by implicit minimisation of epistemic and aleatoric uncertainties. In AISTATS, 2021.   \n[33] Jonathan Vandenburgh. Backtracking through interventions: An exogenous intervention model for counterfactual semantics. Mind & Language, 38(4):981–999, 2023.   \n[34] Sahil Verma, John P. Dickerson, and Keegan Hines. Counterfactual explanations for machine learning: A review. arXiv preprint, arXiv:2010.10596, 2020.   \n[35] Julius von Kügelgen, Abdirisak Mohamed, and Sander Beckers. Backtracking counterfactuals. arXiv preprint arXiv:2211.00472, 2022.   \n[36] Sandra Wachter, Brent Mittelstadt, and Chris Russell. Counterfactual explanations without opening the black box: Automated decisions and the GDPR. Harvard Journal of Law & Technology, 2018.   \n[37] Jingquan Yan and Hao Wang. Self-interpretable time series prediction with counterfactual explanations. In ICML, 2023. ", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "image", "img_path": "N6zJ8DclC2/tmp/56acefde0a9e0c00d13c993420be13b396efa24eddf07198eb14489574e5ac49.jpg", "img_caption": [], "img_footnote": [], "page_idx": 12}, {"type": "text", "text": "Figure 2: Causal graphs and Scatter Plot Matrices of Toy 1-4. Figure (a) (c) (e) and (g) show causal graphs of Toy 1-4 respectively. Figure (b) (d) (f) and (h) indicate scatter plot matrices of variables in Toy 1-4 respectively. ", "page_idx": 12}, {"type": "text", "text": "A Datasets and More Experimental Results ", "text_level": 1, "page_idx": 12}, {"type": "text", "text": "In this section, we first provide detailed datasets settings and additional experimental results. Subsequently, we present the standard deviation of all experimental outcomes in Sec. A. ", "page_idx": 12}, {"type": "text", "text": "A.1 Toy Datasets ", "text_level": 1, "page_idx": 12}, {"type": "text", "text": "We design four simulation datasets, Toy 1-4, and use the designed SCMs to generate $10,000$ data points as a training dataset and another $10,000$ data points as a test set for each dataset. Fig. 2 shows causal graphs of Toy $^{1-4}$ and scatter plot matrices of test datasets in each dataset. The ground-truth SCMs of each dataset are listed below. ", "page_idx": 12}, {"type": "text", "text": "Toy $^{\\,l}$ ", "page_idx": 12}, {"type": "equation", "text": "$$\n\\begin{array}{l l}{{n_{1}=u_{1}\\,,}}&{{u_{1}\\sim\\mathcal{N}(0,1)\\,,}}\\\\ {{n_{2}=-n_{1}+{\\displaystyle\\frac{1}{3}}u_{2}\\,,}}&{{u_{2}\\sim\\mathcal{N}(0,1)\\,,}}\\\\ {{n_{3}=\\sin\\left[0.25\\pi(0.5n_{2}+n_{1})\\right]+0.2u_{3}\\,,}}&{{u_{3}\\sim\\mathcal{N}(0,1)\\,,}}\\end{array}\n$$", "text_format": "latex", "page_idx": 12}, {"type": "text", "text": "where there are three endogenous variables $(n_{1},n_{2},n_{3})$ and three noise variables $(u_{1},u_{2},u_{3})$ . $n_{1}$ is the confounder of $n_{2}$ and $n_{3},\\,n_{1}$ and $n_{2}$ cause $n_{3}$ . ", "page_idx": 12}, {"type": "text", "text": "Toy 2. ", "page_idx": 12}, {"type": "equation", "text": "$$\n\\begin{array}{l l}{n_{1}=u_{1}\\,,}&{u_{1}\\sim\\mathcal{N}(0,1)\\,,}\\\\ {n_{2}=\\sin\\left[0.2\\pi(n_{2}+2.5)\\right]+0.2u_{2}\\,,}&{u_{2}\\sim\\mathcal{N}(0,1)\\,,}\\end{array}\n$$", "text_format": "latex", "page_idx": 12}, {"type": "text", "text": "where there are two endogenous variables $(n_{1},n_{2})$ and two noise variables $(u_{1},u_{2})$ . $n_{1}$ causes $n_{2}$ .   \nToy 3. ", "page_idx": 12}, {"type": "equation", "text": "$$\n\\begin{array}{l l}{{n_{1}=u_{1}\\,,}}&{{u_{1}\\sim\\mathcal{N}(0,1)\\,,}}\\\\ {{n_{2}=-n_{1}+\\displaystyle\\frac{1}{3}u_{2}\\,,}}&{{u_{2}\\sim\\mathcal{N}(0,1)\\,,}}\\\\ {{n_{3}=\\sin\\left[0.1\\pi(n_{2}+2.0)\\right]+0.2u_{3}\\,,}}&{{u_{3}\\sim\\mathcal{N}(0,1)\\,,}}\\\\ {{n_{4}=\\sin\\left[0.25\\pi(n_{3}-n_{1}+2.0)\\right]+0.2u_{4}\\,,}}&{{u_{4}\\sim\\mathcal{N}(0,1)\\,,}}\\end{array}\n$$", "text_format": "latex", "page_idx": 12}, {"type": "text", "text": "where there are four endogenous variables $(n_{1},n_{2},n_{3},n_{4})$ and four noise variables $(u_{1},u_{2},u_{3},u_{4})$ .   \n$n_{1}$ is the confounder of $n_{2}$ and $n_{4}$ . $(n_{2},n_{3},n_{4})$ is a chain, i.e., $n_{2}$ causes $n_{3}$ , followed by $n_{4}$ .   \nToy 4. ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\begin{array}{l l}{{n_{1}=u_{1}\\,,}}&{{u_{1}\\sim{\\mathcal N}(0,1)\\,,}}\\\\ {{n_{2}=-n_{1}+{\\frac{1}{3}}u_{2}\\,,}}&{{u_{2}\\sim{\\mathcal N}(0,1)\\,,}}\\\\ {{n_{3}=\\sin\\left[0.3\\pi(n_{2}+2.0)\\right]+0.2u_{3}\\,,}}&{{u_{3}\\sim{\\mathcal N}(0,1)\\,,}}\\end{array}\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "where there are three endogenous variables $(n_{1},n_{2},n_{3})$ and three noise variables $(u_{1},u_{2},u_{3})$ .   \n$(n_{1},n_{2},n_{3})$ is a chain, i.e., $n_{1}$ causes $n_{2}$ , followed by $n_{3}$ . ", "page_idx": 13}, {"type": "table", "img_path": "N6zJ8DclC2/tmp/36a47f5389c5e424c9d44482bffe5b4950b1fc4a4872531d6a1fc0e777b075e4.jpg", "table_caption": ["Table 4: MAE Results on Toy $^{\\,l}$ to Toy 4. For simplicity, we use $d o$ operator in the table to save room, and when natural counterfactuals are referred to, $d o$ means change. "], "table_footnote": [], "page_idx": 13}, {"type": "text", "text": "In the main paper, we have explain experiments on Toy $^{\\,l}$ in details. As shown in Table 4, our performance on Toy 2-4 shows big margin compared with non-backtracking counterfactuals since natural counterfactuals consistently make interventions feasible, while part of hard interventions may not feasible in non-backtracking counterfactuals. ", "page_idx": 13}, {"type": "text", "text": "Visualization Results on Toy 1. In Fig. 3, larger figures are displayed, which are identical to those shown in Fig. 1, with the only difference being their size. ", "page_idx": 13}, {"type": "text", "text": "A.2 MorphoMNIST ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "The MorphoMNIST comes from [25], where there are 60000 images as training set and 10,000 images as test dataset. Fig. 4 (a) shows the causal graph for generating MorphoMNIST; specifically, stroke thickness $t$ causes the brightness intensity $i$ , and both thickness $t$ and intensity $i$ cause the digit $x$ . Fig. 4 (b) show some samples from MorphoMNIST. The ground-truth SCM is as follows: ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\begin{array}{r l r l}&{t=0.5+u_{t}\\,,}&&{\\qquad\\qquad u_{t}\\sim\\Gamma(10,5)\\,,}\\\\ &{i=191\\cdot\\sigma(0.5\\cdot u_{i}+2\\cdot t-5)+64\\,,}&&{\\qquad\\qquad u_{i}\\sim\\mathcal{N}(0,1)\\,,}\\\\ &{x=\\mathrm{SetIntensity}(\\mathrm{SetThickness}(u_{x};t);i)\\,,}&&{\\qquad\\qquad u_{x}\\sim\\mathrm{MNIST}\\,,}\\end{array}\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "where $u_{t},\\,u_{i}$ , and $u_{x}$ are noise variables, and $\\sigma$ is the sigmoid function. SetThickness $(\\,\\cdot\\,;t)$ and SetIntensity $(\\,\\cdot\\,;i)$ are the operations to set an MNIST digit $u_{x}$ ’s thickness and intensity to $i$ and $t$ respectively, and $x$ is the generated image. ", "page_idx": 13}, {"type": "table", "img_path": "N6zJ8DclC2/tmp/6df5945bc838aa7c5a01b4920ed7f1ddfb22de851b1d33f826d6a647580c7887.jpg", "table_caption": ["Table 5: MorphoMNIST results of change $(i)$ or $d o(i)$ using V-SCM ", "Quantitative Results of change $(i)$ or $d o(i)$ . We use V-SCM to do counterfactual task of change(i) (where $\\epsilon=10^{-3}$ ) or $d o(i)$ with multiple random seeds on test set. In Table 5, the first column shows "], "table_footnote": [], "page_idx": 13}, {"type": "image", "img_path": "N6zJ8DclC2/tmp/8e4d83fd07e03e7836e9221face8be67b087aaa2ac8e3b9f59bd3cefda317df2.jpg", "img_caption": ["(a) Outcome error on a single sample "], "img_footnote": [], "page_idx": 14}, {"type": "image", "img_path": "N6zJ8DclC2/tmp/a1665df8477bb633b906d556d44dbd402dd6ac98c4d0748e770c18ff290a1aae.jpg", "img_caption": ["Figure 3: The Visualization Results on Toy $^{\\,I}$ . ", "(b) Groudtruth-Prediction Scatter Plot "], "img_footnote": [], "page_idx": 14}, {"type": "text", "text": "the MAE of $(t,i)$ , indicating our results outperform that of non-backtracking, since our approach consistently determine LBF interventions. ", "page_idx": 14}, {"type": "text", "text": "The Effectiveness of FIO. Next, we focus on the rest four-column results. In both types of counterfactuals, we use the same value $i$ in $d o(i)$ and $c h a n g e(i)$ . We can calculate which image satisfies $\\epsilon$ -natural generation. In the table, “NC” indicates the set of counterfactuals after FIO. Notice that “NC” set does not mean the results of natural counterfactuals, since some results do still not satisfy $\\epsilon_{}$ -natural generation after FIO. $\\mathrm{\\bf\\hat{NC}}{=}1^{\\,\\circ}$ mean the set containing data points satisfying $\\epsilon$ -natural generation and $\\mathrm{{}^{\\circ}N C=0^{\\circ}}$ contains data not satisfying $\\epsilon_{}$ -natural generation after FIO. Similarly, $\\begin{array}{r}{\\mathrm{~\\ddot{~}N B{=}1\\,\\ddot{~}^{\\circ}~}}\\end{array}$ means the set containing data points satisfying naturalness criteria in nonbacktracking counterfactuals. $\\mathrm{(NC}{=}1$ , $\\scriptstyle\\mathrm{NB}=1$ ) presents the intersection of $\\mathrm{^{\\bullet}N C}{=}1\\,^{\\circ}$ and $\\mathbf{\\partial}^{\\bullet}\\mathbf{NB}{=}1^{\\,\\circ}$ . Similar logic is adopted to the other three combinations. The number of counterfactual data points are 10, 000 in two types of counterfactuals. ", "page_idx": 14}, {"type": "text", "text": "In $\\mathrm{NC}{=}1$ , $\\scriptstyle\\mathrm{NB}=1$ ) containing 5865 data points, our performance is similar to the non-backtracking, since FIO does not do backtracking when hard interventions have satisfied $\\epsilon_{}$ -natural generation. ", "page_idx": 14}, {"type": "image", "img_path": "N6zJ8DclC2/tmp/2bb1d373f9b3c1f9ee1d30f17c2b17760094f9f698db2e2020b55b2b08254ed5.jpg", "img_caption": ["Figure 4: Causal Graph and samples of MorphoMNIST. "], "img_footnote": [], "page_idx": 15}, {"type": "text", "text": "In $\\mathrm{NC}{=}1$ , $\\mathrm{NB}{=}0$ ), there are 3159 data points, which are “unnatural” points in non-backtracking counterfactuals. After FIO, this huge amount of data points becomes “natural”. Here, our approach significantly reduces errors, achieving a $62.8\\%$ reduction in thickness $t$ and $49.8\\%$ in intensity $i$ , the most substantial improvement among the four sets in Table 5. The number of points in $\\mathrm{NC}{=}0$ , $\\mathrm{NB}{=}1$ ) is zero, showing the stability of our algorithm since our FIO framework will change the hard, feasible intervention into unfeasible intervention. Two types of counterfactuals perform similarly in the set ( $\\mathrm{NC}{=}0$ , $\\mathrm{NB}{=}0$ ), also showing the stability of our approach. ", "page_idx": 15}, {"type": "table", "img_path": "N6zJ8DclC2/tmp/ea665ec3cac3cd8c49257b17e3f81e234c25ba1f5c3c3633682b70b80ec96090.jpg", "table_caption": ["Table 6: Unfeasible solutions per 10,000 instances on MorphoMNIST "], "table_footnote": [], "page_idx": 15}, {"type": "text", "text": "Ablation Study on ϵ. In Table 6 provided, we report the frequency of unfeasible solutions per 10,000 instances on MorphoMNIST, following optimization within the V-SCM framework. The data reveals a consistent trend: as the value of $\\epsilon$ increases, the frequency of unfeasible solutions also rises. This pattern occurs because a higher $\\epsilon$ corresponds to a stricter standard of naturalness, making it more challenging to achieve feasible outcomes. ", "page_idx": 15}, {"type": "text", "text": "Visualization of Counterfactual Images. Fig. 5 shows counterfactual images (second row), based on the evidence images (first row), with intended changes on $i$ . The third row illustrates the differences between evidence and counterfactual images. Focusing on the first counterfactual image from nonbacktracking and natural counterfactuals respectively, in non-backtracking, despite $\\bar{d}o(i)$ where thickness value 4.2 should remain unchanged, the counterfactual image shows reduced thickness, consistent with the measured counterfactual thickness of 2.6. In contrast, natural counterfactuals yield an estimated counterfactual thickness $t^{*}$ in MS) closely matching original counterfactual thickness $t^{*}$ in CF), due to backtracking for a LBF intervention on the earlier causal variable $t$ , thereby maintaining $(t,i)$ within the data distribution. Observing other images also shows larger errors in non-backtracking counterfactual images. ", "page_idx": 15}, {"type": "text", "text": "A.3 3DIdentBOX ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "The 3DIdentBOX datasets, first introduced in [4], come with official code for generating customized versions of these datasets. They consist of images created with Blender, each depicting a teapot with seven attributes, such as position, rotation, and hue, determined by seven ground-truth variables. ", "page_idx": 15}, {"type": "text", "text": "In our experiment with the 3DIdentBOX, which comprises six datasets, we focus on the positionsrotations-hue dataset. We expand this into two datasets, Weak-3DIdent and Strong-3DIdent. Each dataset includes seven variables, besides the image variable $x$ , with specifics outlined in Table 7. Every image features a teapot, with variables categorized into three groups: positions $(x,y,z)$ , rotations $(\\gamma,\\alpha,\\beta)$ , and hue $b$ , representing seven teapot attributes, as depicted in 7 (a). Fig. 7 (b) illustrates that both datasets share the same causal graph. It is important to note a distinction between ", "page_idx": 15}, {"type": "image", "img_path": "N6zJ8DclC2/tmp/6d50c66ed610ca1a3afe3395eeb72c8277db7e07985393402d4205e69aeca835.jpg", "img_caption": ["(a) Results of Non-backtracking Counterfactuals "], "img_footnote": [], "page_idx": 16}, {"type": "image", "img_path": "N6zJ8DclC2/tmp/2e020ae609c8ba5bdac6e86c4cc481b2ef5eef32dbfab77f3f9a29d3e526a8d2.jpg", "img_caption": ["(b) Results of Natural Counterfactuals "], "img_footnote": [], "page_idx": 16}, {"type": "text", "text": "Figure 5: Visualization Results on MorphoMNIST: “F” stands for factual values, “CF” for counterfactual values, and “MS” for estimated counterfactual values of $(t,i)$ . $(\\Delta t,\\Delta i)$ represents the absolute errors between counterfactual and estimated counterfactual values of $(t,i)$ . ", "page_idx": 16}, {"type": "table", "img_path": "N6zJ8DclC2/tmp/515504f06395d477253c429e46c1326df2d42dcf0afe1874a70889dcbe35d596.jpg", "table_caption": ["Table 7: Details of variables in 3DIndentBOX. Object refers to teapot in each image. The support of each variable is $[-1,1]$ . The real visual range are listed in the column Visual Range. "], "table_footnote": [], "page_idx": 16}, {"type": "text", "text": "Weak-3DIdent and Strong-3DIdent. In Weak-3DIdent, there exists a weak causal relationship between the variables of each pair, as shown in Fig. 7 (c), whereas in Strong-3DIdent, the causal relationship is stronger, as depicted in Fig. 7 (d). The distributions of several parent variables of image $x$ in these datasets are detailed in Table 8. ", "page_idx": 16}, {"type": "text", "text": "Visualization on Strong-3DIdent. Fig. 6 displays counterfactuals, with the text above the evidence images (first row) indicating errors for the counterfactual images (second row). In Fig. 6 (a), it is evident that some images (second, third and fifth images in particular), generated by non-backtracking counterfactuals are less recognizable and have larger errors. Conversely, our counterfactual images exhibit better visual clarity and more distinct shapes, as our natural counterfactuals consistently ensure feasible interventions, resulting in more natural-looking images. ", "page_idx": 16}, {"type": "text", "text": "Table 8: Distributions in Weak-3DIdent and Strong-3DIdent. $\\mathcal{N}_{w t}(y,1)$ refers to a normal distribution truncated to the interval $[-1,1]$ and $\\mathcal{N}_{s t}(y,1)$ means a normal distribution truncated to the interval $[\\operatorname*{min}(1,y+0.2),\\operatorname*{max}(-1,y-0.2)]$ , where min and max indicate operations that select smaller and bigger values respectively. $\\mathcal{N}_{w t}(\\alpha,1)$ and $\\mathcal{N}_{s t}(\\alpha,1)$ are identical to $\\ensuremath{\\mathcal{N}}_{w t}(y,1)$ and $\\mathcal{N}_{s t}(y,1)$ respectively. $U$ refers to uniform distribution. ", "page_idx": 17}, {"type": "table", "img_path": "N6zJ8DclC2/tmp/e26cfd9d094cb8cf81c572cbf55b60fa4b79d3f63167a802cefcbfd0a2890c34.jpg", "table_caption": [], "table_footnote": [], "page_idx": 17}, {"type": "image", "img_path": "N6zJ8DclC2/tmp/bdae9781661c011376d68cd49b10e78f0245c0c62895973cdfa88683ecd81a62.jpg", "img_caption": ["(a) Results of Non-backtracking Counterfactuals "], "img_footnote": [], "page_idx": 17}, {"type": "image", "img_path": "N6zJ8DclC2/tmp/d718116112d40a0ef816284a806f205da80794cd035db1d8a079f471d1b1f29e.jpg", "img_caption": ["(b) Results of Natural Counterfactuals Figure 6: Visualization Results on Stong-3DIdent. "], "img_footnote": [], "page_idx": 17}, {"type": "text", "text": "A.4 Standard Deviation of Experimental Results ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "This section presents the standard deviation of all experimental results, demonstrating that the standard deviation for our natural counterfactuals is generally lower. This indicates the increased reliability of our approach, achieved by necessary backtracking to ensure counterfactuals remain within data distributions. ", "page_idx": 17}, {"type": "table", "img_path": "N6zJ8DclC2/tmp/567217906c3ac9553222dd66dd0e341f9828dec5db4302d32bb6fa1d207f4dec.jpg", "table_caption": ["Table 9: Standard Deviation of Results on Toy $^{\\,I}$ to Toy 4. "], "table_footnote": [], "page_idx": 17}, {"type": "image", "img_path": "N6zJ8DclC2/tmp/7bc50e6f7c5b88e39ede3774a4f986960fd1847168cb2241476f1af2b44236ab.jpg", "img_caption": ["Figure 7: Samples, Causal Graph, Scatter Plot Matrices of Weak-3DIdent and Strong-3DIdent. "], "img_footnote": [], "page_idx": 18}, {"type": "table", "img_path": "N6zJ8DclC2/tmp/c376680a5970f3de4eb860405cd0ea452cabdaa238cf3a21c670b5eb4e58f7dc.jpg", "table_caption": ["Table 10: Standard Deviation of Results on MorphoMNIST "], "table_footnote": [], "page_idx": 18}, {"type": "table", "img_path": "N6zJ8DclC2/tmp/7ede5470a03d87bb183eb59804570be958288eb9cd1db3aa0e161568970697af.jpg", "table_caption": ["Table 11: Standard Deviation of Ablation Study on $\\epsilon$ Using MorphoMNIST "], "table_footnote": [], "page_idx": 18}, {"type": "table", "img_path": "N6zJ8DclC2/tmp/363a51ea5e194dbaa6ec93c31355b56fa64e83bdf78c25434001bb2c5ce0364e.jpg", "table_caption": ["Table 12: Standard Deviation of Results on Weak-3DIdent and Stong-3DIdent "], "table_footnote": [], "page_idx": 18}, {"type": "text", "text": "B Proof for Theorem 4.1 ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Theorem 4.1 shows that our natural counterfactuals are identifiable given certain conditions. We unitize Theorem 1 from [20] to assistant us to prove it, shown as below. ", "page_idx": 19}, {"type": "text", "text": "Theorem B.1 (Identifiable Counterfactuals). Given actual distribution $p(\\mathbf{PA}_{i},\\mathbf{U}_{i})$ , Suppose $\\mathbf{V}_{i}$ satisfies the following function: ", "page_idx": 19}, {"type": "equation", "text": "$$\n\\mathbf{V}_{i}:=f_{i}(\\mathbf{PA}_{i},\\mathbf{U}_{i})\n$$", "text_format": "latex", "page_idx": 19}, {"type": "text", "text": "where $\\mathbf{U}_{i}\\perp\\mathbf{P}\\mathbf{A}_{i}$ and assume unknown $f_{i}$ is smooth and strictly monotonic w.r.t. $\\mathbf{U}_{i}$ for fixed values of $\\mathbf{PA}_{i}$ , If we have observed $\\mathbf{V}_{i}=\\mathbf{v}_{i}$ and $\\mathbf{P}\\mathbf{A}_{i}=p a_{i}$ , with an intervention $d o(\\mathbf{PA}_{i}=p a_{i}^{*})$ ), where $p a_{i}^{*}$ is within the support of $p(\\mathbf{PA}_{i})$ , the counterfactual outcome is identifiable: ", "page_idx": 19}, {"type": "equation", "text": "$$\n\\mathbf{V}_{i}|d o(\\mathbf{PA}_{i}=p a_{i}^{*}),\\mathbf{V}_{i}=\\mathbf{v}_{i},\\mathbf{PA}_{i}=p a_{i}\n$$", "text_format": "latex", "page_idx": 19}, {"type": "text", "text": "The theorem is not identical to Theorem 1 from [20], as we incorporate additional assumptions from [20] in our proof to express it strictly. The proof is as below. ", "page_idx": 19}, {"type": "text", "text": "Proof. Step 1. Identifiability of $\\mathbf{AN}(\\mathbf{C})$ : Given an intervention $d o(\\mathbf{C}=\\mathbf{c}^{*})$ on the set of variables $\\mathbf{C}$ , where $\\mathbf{AN}(\\mathbf{C})$ denotes the ancestors of $\\mathbf{C}$ including $\\mathbf{C}$ itself. By definition of the intervention and the causal graph structure, the value of $\\mathbf{AN}(\\mathbf{C})$ under the intervention $d o(\\mathbf{C}=\\mathbf{c}^{*})$ can be uniquely determined. This is because the values of ancestors and $\\mathbf{C}$ are directly set by the intervention, making their values identifiable. ", "page_idx": 19}, {"type": "text", "text": "Step 2. Identifiability of $\\mathbf{V}\\setminus\\mathbf{AN}(\\mathbf{C})$ : There are two subsets in $\\mathbf{V}\\setminus\\mathbf{AN}(\\mathbf{C})$ . (1) ND: Variables in $\\mathbf{V}\\setminus\\bar{\\mathbf{A}}\\mathbf{N}(\\mathbf{C})$ that are not descendants of $\\mathbf{AN}(\\mathbf{C})$ . These variables retain their values from the actual observed data since they are not influenced by the changes in $\\mathbf{AN}(\\mathbf{C})$ due to the causal independence. (2) DS: Variables in $\\dot{\\bf V}\\setminus{\\bf A N}({\\bf C})$ that are descendants of $\\mathbf{AN}(\\mathbf{C})$ . The values of these variables might change as a result of the intervention due to their causal dependency on $\\mathbf{AN}(\\mathbf{C})$ . ", "page_idx": 19}, {"type": "text", "text": "Identifiability of ND: The counterfactual values of variables in ND remain as their observed values in the actual data, as they are causally independent from $\\mathbf{AN}(\\mathbf{C})$ . Thus, their values are trivially identifiable. ", "page_idx": 19}, {"type": "text", "text": "Identifiability of DS: The counterfactual values of variables in DS depend on the values of their parents. For variable set $\\mathbf{DS}_{1}$ in DS whose parents only come from $\\mathbf{ND}\\cup\\mathbf{AN}(\\mathbf{C})$ , their counterfactual values are identifiable since, by Theorem B.1, counterfactual values of their parent variables are within the support of the joint distribution. Now, the the set of identifiable variables is $\\ensuremath{\\mathbf{D}}\\ensuremath{\\mathbf{S}}_{1}\\cup\\ensuremath{\\mathbf{N}}\\ensuremath{\\mathbf{D}}\\cup\\ensuremath{\\mathbf{A}}\\ensuremath{\\mathbf{N}}(\\ensuremath{\\mathbf{C}})$ . This allows us to recursively expand the set of identifiable variables. By incorporating variables from DS whose counterfactual values are identifiable into the set $\\mathbf{ND}\\cup\\mathbf{AN}(\\mathbf{C})$ , we iteratively enlarge this set. This process is repeated until all variables in $\\mathbf{V}$ are included in the set of identifiable variables, thus establishing the identifiability of their values under the counterfactual scenario induced by the intervention $d o(\\mathbf{C}=\\mathbf{c}^{*})$ . ", "page_idx": 19}, {"type": "text", "text": "Conclusion: By proving the identifiability of both $\\mathbf{AN}(\\mathbf{C})$ and all variables in $\\mathbf{V}\\setminus\\mathbf{AN}(\\mathbf{C})$ (split into ND and DS), we establish that the entire set of endogenous variables $\\mathbf{V}$ under the intervention $d o(\\mathbf{C}=\\mathbf{c}^{*})$ is identifiable. This means the values of all variables in $\\mathbf{V}$ can be determined uniquely from the intervention and the observed data distribution. ", "page_idx": 19}, {"type": "text", "text": "C Causal Model Training ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Our study focuses on counterfactual inference and we directly use two state-of-the-art deep-learning SCM models to learn conditional distributions among variables using a dataset, i.e., V-SCM [25] and H-SCM [28]. Specifically, we use code of [28] containing the implementation of V-SCM and H-SCM. Take MorphoMNIST as an example, in both two models, normalizing flows are firstly trained to learn causal mechanisms for all variables except image $x$ , i.e., $(t,i)$ , and a conditional VAE is used to model image $x$ given its parents $(t,i)$ . For V-SCM, the conditional VAE uses normal VAE framework, while H-SCM uses hierarchical VAE structure [21] to better capture the distribution of images. ", "page_idx": 19}, {"type": "text", "text": "Toy Experiments. In the case of four toy experiments, we exclusively employed normalizing flows due to the fact that all variables are one-dimensional. Our training regimen for the flow-based model ", "page_idx": 19}, {"type": "text", "text": "spanned 2000 epochs, utilizing a batch size of 100 in conjunction with the AdamW optimizer [19].   \nWe initialized the learning rate to $10^{-3}$ , set $\\beta_{1}$ to 0.9, $\\beta_{2}$ to 0.9. ", "page_idx": 20}, {"type": "text", "text": "MorphoMNIST. We first train normalized flows to learn causal mechanisms of thickness and intensity $(t,i)$ . Other hyper-parameters are similar to those of toy experiments. Then, we train two VAE-based models (V-SCM and H-SCM) to learn $x$ given $(t,i)$ respectively. The architectures of the two models are identical to [28]. V-SCM and H-SCM underwent training for 160 epochs. We employed a batch size of 32 and utilized the AdamW optimizer. The initial learning rate was set to $1e\\!-\\!3$ and underwent a linear warmup consisting of 100 steps. We set $\\beta_{1}$ to 0.9, $\\beta_{2}$ to 0.9, and applied a weight decay of 0.01. Furthermore, we implemented gradient clipping at a threshold of 350 and introduced a gradient update skipping mechanism, with a threshold set at 500 based on the $L^{2}$ norm. During the testing, i.e., counterfactual inference, we test performance on both models respectively, with the normalized flows. ", "page_idx": 20}, {"type": "text", "text": "3DIdentBOX. Similar to experiments on MorphoMNIST, we first train normalized flows. Compared with V-SCM, H-SCM is more powerful to model complex data like 3DIdentBOX, of which the size of the image is $64\\times64\\times4$ . Then, we train H-SCM to capture the distribution of $x$ given its parents for 500 epochs with a batch size of 32. The hyper-parameters are the same as experiments on MorphoMNIST. ", "page_idx": 20}, {"type": "text", "text": "All the experiments above were run on NVIDIA RTX 4090 GPUs. ", "page_idx": 20}, {"type": "text", "text": "D Feasible Intervention Optimization ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "To implement a particular method, we plug the distance measure (Eqn. 4) and a naturalness constraint (we use Choice (3) in Sec. 4.1.1 in the experiments) into Eqn. 2 of the FIO framework: ", "page_idx": 20}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\underset{a n(\\mathbf{A})^{*}}{\\mathrm{minimize}}\\,\\|a n(\\mathbf{A})^{*}-a n(\\mathbf{A})\\|_{1}}\\\\ &{s.t.\\quad\\mathbf{A}=\\mathbf{a}^{*},}\\\\ &{\\quad\\epsilon<F(\\mathbf{V}_{j}=\\mathbf{v}_{j}^{*}|p a_{j}^{*})<1-\\epsilon,\\forall\\mathbf{V}_{j}\\in\\mathbf{AN}(\\mathbf{A}).}\\end{array}\n$$", "text_format": "latex", "page_idx": 20}, {"type": "text", "text": "According to the properties of reversible functions in the causal model, endogenous value $a n(\\mathbf{A})^{*}$ is reversible to noise values $\\mathbf{u}_{\\mathbf{AN}(\\mathbf{A})}^{*}$ of $\\mathbf{AN}(\\mathbf{A})^{*}$ ’s corresponding noise variables. Hence, optimizing endogenous value is equivalent to optimizing noise value. Then we have: ", "page_idx": 20}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\displaystyle\\operatorname*{minimize}_{\\mathbf{u}_{\\mathbf{A}\\mathbf{N}(\\mathbf{A})}^{*}}\\displaystyle\\sum_{\\mathbf{u}_{j}^{*}\\in\\mathbf{u}_{\\mathbf{AN}(\\mathbf{A})}^{*}}\\vert\\hat{f}(p a_{\\mathbf{A}}^{*},\\mathbf{u}_{j}^{*})-\\mathbf{v}_{j}\\vert}\\\\ &{s.t.\\quad\\mathbf{u}_{\\mathbf{A}}^{*}=\\hat{f}_{\\mathbf{A}}^{-1}(p a_{\\mathbf{A}}^{*},\\mathbf{a}^{*}),}\\\\ &{\\displaystyle\\qquad\\epsilon<F(\\mathbf{u}_{j}^{*})<1-\\epsilon,\\forall\\mathbf{U}_{j}\\in\\mathbf{U}_{\\mathbf{AN}(\\mathbf{A})}.}\\end{array}\n$$", "text_format": "latex", "page_idx": 20}, {"type": "text", "text": "We finally use the Lagrangian method [5] optimize our objective loss to get the counterfactual value given actual value and expected change $\\mathbf{A}=\\mathbf{a}^{*}$ as below: ", "page_idx": 20}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathcal{L}(\\mathbf{u}_{\\mathbf{AN}(\\mathbf{A})}^{*})=\\displaystyle\\sum_{\\mathbf{u}_{j}^{*}\\in\\mathfrak{u}_{\\mathbf{AN}(\\mathbf{A})}^{*}}|\\hat{f}_{j}(\\mathbf{u}_{j}^{*},p a_{j}^{*})-\\mathbf{v}_{j}|+w_{\\epsilon}\\displaystyle\\sum_{\\mathbf{u}_{j}^{*}\\in\\mathfrak{u}_{\\mathbf{AN}(\\mathbf{A})}^{*}}\\left[\\operatorname*{max}(\\epsilon-F(\\mathbf{u}_{j}^{*}),0)+\\operatorname*{max}(\\epsilon+F(\\mathbf{u}_{j}^{*})-1,0)\\right]}\\\\ {\\mathrm{s.t.}\\quad\\ \\mathbf{u}_{\\mathbf{A}}^{*}=\\hat{f}_{*}^{-1}(p a_{\\mathbf{A}}^{*},\\mathbf{a}^{*})}\\end{array}\n$$", "text_format": "latex", "page_idx": 20}, {"type": "text", "text": "where the optimization parameters are the counterfactual noise values of $\\mathbf{A}$ ’s ancestors, $\\mathbf{u}_{\\mathbf{AN}(\\mathbf{A})}^{*}$ , and the function $\\operatorname*{max}(\\cdot)$ returns the maximum value between two given values. The first term represents the measure of distance between two distinct worlds, while the second term enforces the constraint of $\\epsilon$ -natural generation. Here, the constant hyperparameter $w_{\\epsilon}$ serves to penalize noise values situated in the tails of noise distributions. For simplicity, we use A as subscript as indicator of terms related to $\\mathbf{A}$ , instead of number subscript. Notice that, in order to ensure hard constraint $\\mathbf{A}=\\mathbf{a}^{*}$ , A’s noise value $\\mathbf{u}_{\\mathbf{A}}^{*}$ is not optimized explicitly, since the value $\\mathbf{pa_{A}^{*}}$ is fully determined by $\\mathbf{a}^{*}$ and other noise values. ", "page_idx": 20}, {"type": "text", "text": "Hyper-parameters for Optimization and Judgment for Non-solution Cases. The loss’s parameter is thus $\\mathbf{u}_{\\mathbf{AN}}^{*}$ , which fully determines the value $a n(\\mathbf{A})^{*}$ using the pretrained causal model, as explained in Sec. C. In all experiments, we optimized $\\mathbf{u}_{\\mathbf{AN}}^{*}$ using the AdamW optimizer at a learning rate of ", "page_idx": 20}, {"type": "text", "text": "$10^{-3}$ for $50,000$ steps. This approach’s effectiveness is validated by the MorphoMNIST experiments, as shown in Table 5. As $\\hat{f}$ is not perfectly invertible in practice, it is important to ensure that $|p a_{\\mathbf{A}}^{*}-\\hat{f}_{\\mathbf{A}}(\\mathbf{u}_{\\mathbf{A}}^{*},\\mathbf{a}^{*})|$ (where $\\mathbf{u}_{\\mathbf{A}}^{*}=\\hat{f}_{\\mathbf{A}}^{-1}(p\\dot{a}_{\\mathbf{A}}^{*},\\mathbf{a}^{*}))$ remains sufficiently small, ideally on the order of $10^{-8}$ according to our experience, to satisfy the constraint condition in Eqn. 10. In our experience, this deviation $|p\\bar{a}_{\\mathbf{A}}^{*}-\\hat{f}_{\\mathbf{A}}(\\mathbf{u}_{\\mathbf{A}}^{*},\\mathbf{a}^{*})|$ is typically sufficiently small throughout most of the optimization process. If not, please adjust hyperparameters, such as the learning rate and $w_{\\epsilon}$ , to achieve the desired accuracy. Assuming $|\\bar{p^{}}a_{\\mathbf{A}}^{*}-\\hat{f}_{\\mathbf{A}}(\\mathbf{u}_{\\mathbf{A}}^{*},\\mathbf{a}^{*})|$ is sufficiently small after optimization, if  uj∗ ∈u∗AN(A)[ $\\begin{array}{r}{\\sum_{\\mathbf{u}_{j}^{*}\\in\\mathbf{u}_{\\mathrm{AN}(\\mathbf{A})}^{*}}[\\operatorname*{max}(\\epsilon-F(\\mathbf{u}_{j}^{*}),0)\\bar{+}\\operatorname*{max}(\\epsilon+\\dot{F}(\\mathbf{\\dot{u}}_{j}^{*})-1,0)]>0}\\end{array}$ holds, this indicates that the case does not have a solution. ", "page_idx": 21}, {"type": "text", "text": "Computational Complexity of FIO. The complexity scales linearly with both the size of the causal graph, specifically the number of ancestors of $A$ , and the dataset size. Formally, for one counterfactual query, the overall complexity is $O(K P T)$ , where $K$ is the number of ancestors of $A$ , $P$ is the number of parameters in the neural networks, and $T$ is the number of optimization steps. If we use each instance of a whole dataset as evidence and answer one counterfactual query for each instance, the overall complexity becomes $O(K P T M)$ , where $M$ is the number of data points in the dataset. This linear scaling indicates that FIO is reasonably scalable, making it suitable for large causal graphs and datasets. ", "page_idx": 21}, {"type": "text", "text": "E Differences between Natural Counterfactuals and Non-Backtracking Counterfactuals [26] or Prior-Based Backtracking Counterfactuals [35] ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "E.1 Differences between Non-backtracking Counterfactuals and Ours ", "page_idx": 21}, {"type": "text", "text": "Non-backtracking counterfactuals only do a direct intervention on A, while our natural counterfactuals do backtracking when the direct intervention is infeasible. Notice that when the direct intervention on A is already feasible, our procedure of natural counterfactuals will be automatically distilled to the non-backtracking counterfactuals. In this sense, non-backtracking counterfactual reasoning is our special case. ", "page_idx": 21}, {"type": "text", "text": "E.2 Differences between Prior-Based Backtracking Counterfactuals and Ours ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "(1) Intervention Approach and Resulting Changes: ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Prior-based Backtracking Counterfactuals: These counterfactuals directly intervene on noise/exogenous variables, which can lead to unnecessary changes in the counterfactual world.6 Consequently, the similarity between the actual data point and its counterfactual counterpart tends to be lower. In short, prior-based backtracking counterfactuals may introduce changes that are not needed. ", "page_idx": 21}, {"type": "text", "text": "Natural Counterfactuals: In contrast, our natural counterfactuals only engage in necessary backtracking when direct intervention is infeasible. This approach aims to ensure that the counterfactual world results from minimal alterations, maintaining a higher degree of fidelity to the actual world. ", "page_idx": 21}, {"type": "text", "text": "(2) Counterfactual Worlds: ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Prior-based Backtracking Counterfactuals: This approach assigns varying weights to the numerous potential counterfactual worlds capable of effecting the desired change. The weight assigned to each world is directly proportional to its similarity to the actual world. it is worth noting that among this array of counterfactual worlds, some may exhibit minimal resemblance to the actual world, even when equipped with complete evidence, including the values of all endogenous variables. This divergence arises because by sampling from the posterior distribution of exogenous variables, even highly dissimilar worlds may still be drawn. ", "page_idx": 21}, {"type": "text", "text": "Natural Counterfactuals: In contrast, our natural counterfactuals prioritize the construction of counterfactual worlds that closely emulate the characteristics of the actual world through an optimization process. As a result, in most instances, one actual world corresponds to a single counterfactual world when employing natural counterfactuals with full evidence. ", "page_idx": 22}, {"type": "text", "text": "(3) Implementation Practicality: ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Prior-based Backtracking Counterfactuals: The practical implementation of prior-based backtracking counterfactuals can be a daunting challenge. To date, we have been prevented from conducting a comparative experiment with this approach due to uncertainty about its feasibility in practical applications. Among other tasks, the computation of the posterior distribution of exogenous variables can be a computationally intensive endeavor. Furthermore, it is worth noting that the paper [35] provides only rudimentary examples without presenting a comprehensive algorithm or accompanying experimental results. ", "page_idx": 22}, {"type": "text", "text": "Natural Counterfactuals: In stark contrast, our natural counterfactuals have been meticulously designed with practicality at the forefront. We have developed a user-friendly algorithm that can be applied in real-world scenarios. Rigorous experimentation, involving four simulation datasets and two public datasets, has confirmed the efficacy and reliability of our approach. This extensive validation underscores the accessibility and utility of our algorithm for tackling specific problems, making it a valuable tool for practical applications. ", "page_idx": 22}, {"type": "text", "text": "F Observations about the Prior-Based Backtracking Counterfactuals [35] ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "F.1 Possibility of Gratuitous Changes ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "A theory of backtracking counterfactuals was recently proposed by [35], which utilizes a prior distribution $p(\\mathbf{U},\\mathbf{U}^{*})$ to establish a connection between the actual model and the counterfactual model. This approach allows for the generation of counterfactual results under any condition by considering paths that backtrack to exogenous noises and measuring closeness in terms of noise terms. As a result, for any given values of ${\\bf E}={\\bf e}$ and $\\mathbf{A}^{*}=\\mathbf{a}^{*}$ , it is possible to find a sampled value ( $\\mathbf{U}=\\mathbf{u}$ , $\\mathbf{U}^{*}=\\mathbf{u}^{*}$ ) from $p(\\mathbf{U},\\mathbf{U}^{*})$ such that $\\mathbf{E}_{\\mathcal{M}(\\mathbf{u})}=\\mathbf{e}$ and $\\mathbf{A}_{\\mathcal{M}^{\\ast}(\\mathbf{u}^{\\ast})}^{\\ast}=\\mathbf{a}^{\\ast}$ , as described in [35]. This holds true even in cases where $\\mathbf{V}\\setminus\\mathbf{E}=\\emptyset$ and $\\mathbf{V}^{*}\\setminus\\mathbf{A}^{*}=\\emptyset$ , implying that any combination of endogenous values ${\\bf E}={\\bf e}$ and $\\mathbf{A}^{*}=\\mathbf{a}^{*}$ can co-occur in the actual world and the counterfactual world, respectively. In essence, there always exists a path $(\\mathbf{v}\\rightarrow\\mathbf{u}\\rightarrow\\mathbf{u}^{*}\\rightarrow\\mathbf{v}^{*})$ ) that connects $\\mathbf{V}=\\mathbf{v}$ and $\\mathbf{V}^{*}=\\mathbf{v}^{*}$ through a value $\\mathbf{\\^U}\\mathbf{U}=\\mathbf{u},\\mathbf{U}^{*}=\\mathbf{u}^{*},$ ), where $\\mathbf{v}$ and $\\mathbf{v}^{*}$ represent any values sampled from $p_{\\mathcal{M}}(\\mathbf{V})$ and $p_{\\mathcal{M}^{\\ast}}(\\mathbf{V}^{\\ast})$ , respectively. ", "page_idx": 22}, {"type": "text", "text": "However, thanks to this feature, this understanding of counterfactuals may allow for what appears to be gratuitous changes in realizing a counterfactual supposition. This occurs when there exists a value assignment $\\mathbf{U}^{*}=\\mathbf{u}^{*}$ that satisfies $\\mathbf{E}_{\\mathcal{M}^{\\ast}(\\mathbf{u}^{\\ast})}^{\\ast}=\\mathbf{e}$ and $\\mathbf{A}_{\\mathcal{M}^{\\ast}(\\mathbf{u}^{\\ast})}^{\\ast}=\\mathbf{a}^{\\ast}$ in the same world. In such a case, intuitively we ought to expect that $\\mathbf{E}^{*}=\\mathbf{e}$ should be maintained in the counterfactual world (as in the factual one). However, there is in general a positive probability for $\\mathbf{E}^{*}\\neq\\mathbf{e}$ . This is due to the existence of at least one “path\" from ${\\bf E}={\\bf e}$ to any value $\\mathbf{v}^{*}$ sampled from $p_{\\mathcal{M}^{\\ast}}(\\mathbf{V}^{\\ast}|\\mathbf{A}^{\\ast}=\\mathbf{a}^{\\ast})$ by means of at least one value $\\mathbf{\\^U}\\mathbf{U}=\\mathbf{u},\\mathbf{U}^{*}=\\mathbf{u}^{*})$ ), allowing $\\mathbf{E}^{*}$ to take any value in the support of $\\dot{p_{\\mathcal{M}^{*}}}(\\mathbf{E}^{*}|\\mathbf{A}^{*}=\\mathbf{a}^{*})$ . ", "page_idx": 22}, {"type": "text", "text": "In the case where $\\mathbf{A}^{*}=\\varnothing$ , an interesting observation is that $\\mathbf{E}^{*}$ can take any value within the support of $p_{\\mathcal{M}^{\\ast}}(\\mathbf{E}^{\\ast})$ . Furthermore, when examining the updated exogenous distribution, we find that in Pearl’s non-backtracking framework, it is given by $p_{\\mathcal{M}^{\\ast}}(\\mathbf{U}^{\\ast}|\\mathbf{E}^{\\ast}=\\mathbf{e})$ . However, in [35]’s backtracking framework, the updated exogenous distribution becomes $\\begin{array}{r}{p_{B}(\\mathbf{U}^{*}|\\mathbf{E}=\\mathbf{e})=\\int p(\\mathbf{U}^{*}|\\mathbf{U})p_{\\mathcal{M}}(\\mathbf{U}|\\mathbf{E}=}\\end{array}$ $\\mathbf{e})\\mathbf{d}(\\mathbf{U})\\neq p_{\\mathcal{M}^{\\ast}}(\\mathbf{U}^{\\ast}|\\mathbf{E}^{\\ast}=\\mathbf{e})$ , since using $\\mathbf{u}^{*}$ sampled from $p(\\mathbf{U}^{*}|\\mathbf{U}=\\mathbf{u})$ (where $\\mathbf{u}$ is any value of $\\mathbf{U}$ ) can result in any value of all endogenous variables $\\mathbf{V}^{*}$ . Therefore, [35]’s backtracking counterfactual does not reduce to Pearl’s counterfactual even when $\\mathbf{A}^{*}=\\varnothing$ . ", "page_idx": 22}, {"type": "text", "text": "F.2 Issues with the Distance Measure ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "In Equation 3.16 of [35], Mahalanobis distance is used for real-valued $\\textbf{U}\\in\\mathbb{R}^{m}$ , defined as $d(\\mathbf{u}^{*},\\mathbf{\\dot{u}})={\\textstyle\\frac{1}{2}}(\\mathbf{u}^{*}-\\mathbf{u})^{\\mathrm{T}}{\\boldsymbol{\\Sigma}}^{-1}(\\mathbf{u}^{*}-\\mathbf{u})$ . However, it should be noted that the exogenous variables are not identifiable. There are several issues with using the Mahalanobis distance in this context. ", "page_idx": 22}, {"type": "text", "text": "Firstly, selecting different exogenous distributions would result in different distances. This lack of identifiability makes the distance measure sensitive to the choice of exogenous distributions. ", "page_idx": 23}, {"type": "text", "text": "Secondly, different noise variables may have different scales. By using the Mahalanobis distance, the variables with larger scales would dominate the distribution changes, which may not accurately reflect the changes in each variable fairly. ", "page_idx": 23}, {"type": "text", "text": "Thirdly, even if the Mahalanobis distance $d(\\mathbf{u}^{*},\\mathbf{u})$ is very close to 0, it does not guarantee that the values of the endogenous variables are similar. This means that the Mahalanobis distance alone may not capture the similarity or dissimilarity of the endogenous variables adequately. ", "page_idx": 23}, {"type": "text", "text": "G Another Type of Minimal Change: Minimal Change in Local Causal Mechanisms. ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Changes in local mechanisms are the price we pay to do interventions, since interventions are from outside the model and sometimes are imposed on a model by us. Hence, we consider minimal change in local causal mechanisms in $\\mathbf{A}$ ’s ancestor set $\\mathbf{AN}(\\mathbf{A})$ . With $L^{1}$ norm, the total distance of mechanisms in $\\mathbf{AN}(\\mathbf{A})$ , called mechanism distance, is defined as: ", "page_idx": 23}, {"type": "equation", "text": "$$\nD(\\mathbf{u}_{a n(\\mathbf{A})},\\mathbf{u}_{a n(\\mathbf{A})^{*}})=\\sum_{\\mathbf{u}_{j}\\in\\mathbf{u}_{a n(\\mathbf{A})},\\mathbf{u}_{j}^{*}\\in\\mathbf{u}_{a n(\\mathbf{A})^{*}}}w_{j}|F(\\mathbf{u}_{j})-F(\\mathbf{u}_{j}^{*})|\n$$", "text_format": "latex", "page_idx": 23}, {"type": "text", "text": "where $\\mathbf{u}_{a n(\\mathbf{A})}$ is the value of $\\mathbf{A}$ ’s exogenous ancestor set $\\mathbf{U_{AN(A)}}$ when $\\mathbf{AN}(\\mathbf{A})=a n(\\mathbf{A})$ in the actual world. ${\\bf u}_{a n}({\\bf A})^{*}$ is the value of $\\mathbf{U_{AN(A)}}$ when $\\mathbf{AN}(\\mathbf{A})=a n(\\mathbf{A})^{*}$ in the counterfactual world. $D(\\mathbf{u}_{a n(\\mathbf{A})},\\mathbf{u}_{a n(\\mathbf{A})^{*}})$ represents the distance between actual world and counterfactual world. $w_{j}$ represents a fixed weight, and $F(\\cdot)$ is the Cumulative Distribution Function (CDF). We employ the CDF of noise variables to normalize distances across various noise distributions, ensuring these distances fall within the range of $[0,1]$ , as noise distributions are not identifiable. ", "page_idx": 23}, {"type": "text", "text": "Weights in the Distance. The noise variables are independent of each other and thus, unlike in perception distance, the change of causal earlier noise variables will not lead the change of causal later noise nodes. Therefore, if the weight on difference of each noise variable is the same, the distance will not prefer less change on variables closer to A. To achieve backtracking as less as possible, we set a weight $w_{j}$ for each node $\\mathbf{{U}}_{j}$ , defined as the number of endogenous decedents of $\\mathbf{V}_{j}$ denoted as $N D(\\mathbf{V}_{j})$ . Generally speaking, for all variables causally earlier than A, one way is to use the number of variables influenced by particular intervention as the measure of the changes caused by the intervention. Hence, the number of variables influenced by a variable’s intervention can be treated as the coefficient of distance. For example, in a causal graph where where B causes A and $\\mathbf{C}$ is the confounder of A and $\\mathbf{B}$ . If change $\\mathbf{\\nabla}\\mathbf{A}=\\mathbf{a}^{*})$ ), $\\mathbf{u_{A}}$ ’s and $\\mathbf{u_{B}}$ ’s weight is 1 and 2 respectively. In this way, variables (e.g., $\\mathbf{u_{B}}$ ) with bigger influence on other variables possess bigger weights and thus tend to change less, reflecting necessary backtracking. ", "page_idx": 23}, {"type": "text", "text": "G.1 Concretization of Natural Counterfactuals: An Example Methodology ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "A Method Based on Mechanism Distance. We plugin mechanism distance Eqn. 11 into FIO framework Eqn. 2. Below is the equation of optimization: ", "page_idx": 23}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\displaystyle\\operatorname*{min}_{\\mathbf{u}_{a n}(\\mathbf{A})^{*}}\\sum_{\\mathbf{u}_{j}\\in\\mathbf{u}_{a n(\\mathbf{A})},\\mathbf{u}_{j}^{*}\\in\\mathbf{u}_{a n(\\mathbf{A})}\\ast}w_{j}\\vert F(\\mathbf{u}_{j})-F(\\mathbf{u}_{j}^{*})\\vert}\\\\ &{s.t.\\quad\\mathbf{a}^{*}=f_{A}(p a_{\\mathbf{A}}^{*},\\mathbf{u}_{\\mathbf{A}}^{*})}\\\\ &{s.t.\\quad\\epsilon<F(\\mathbf{u}_{j}^{*})<1-\\epsilon,\\forall\\mathbf{u}_{j}^{*}\\in u_{a n(\\mathbf{A})^{*}}}\\end{array}\n$$", "text_format": "latex", "page_idx": 23}, {"type": "text", "text": "Where the first constraint is to achieve $c h a n g e(\\mathbf{A}=\\mathbf{a}^{*})$ , the second constraint require counterfactual data point to satisfy $\\epsilon$ -natural generation given the optional naturalness criteria (3) in Sec. 4.1, and the optimization parameter is the value ${\\bf u}_{a n}({\\bf A})^{*}$ of noise variable set $\\mathbf{U_{AN(A)}}$ given $\\mathbf{AN}(\\mathbf{A})=a n(\\mathbf{A})^{*}$ . For simplicity, we use A as subscript as indicator of terms related to $\\mathbf{A}$ , instead of number subscript. ", "page_idx": 23}, {"type": "text", "text": "In practice, the Lagrangian method is used to optimize our objective function. The loss is as below: ", "page_idx": 24}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathcal{L}=\\displaystyle\\sum_{\\mathbf{u}_{j}\\in\\mathbf{u}_{a n(\\mathbf{A})},\\mathbf{u}_{j}^{*}\\in\\mathbf{u}_{a n(\\mathbf{A})}\\ast}w_{j}\\vert F(\\mathbf{u}_{j})-F(\\mathbf{u}_{j}^{*})\\vert}\\\\ &{\\,\\,\\,\\,\\,\\,\\,\\,\\,\\,\\displaystyle+w_{\\epsilon}\\sum_{\\mathbf{u}_{j}\\in\\mathbf{u}_{a n(\\mathbf{A})},\\mathbf{u}_{j}^{*}\\in\\mathbf{u}_{a n(\\mathbf{A})}\\ast}\\operatorname*{max}((\\epsilon-F(\\mathbf{u}_{j}^{*}),0)+\\operatorname*{max}(\\epsilon+F(\\mathbf{u}_{j}^{*})-1,0))}\\\\ &{\\,\\,\\,\\,\\,\\,\\,\\,\\,\\displaystyle\\mathbf{s}.t.\\,\\,\\,\\,\\,\\,\\displaystyle\\sum_{\\mathbf{u}_{\\mathbf{A}}^{*}=f_{A}^{-1}(\\mathbf{a}^{*},p a_{\\mathbf{A}}^{*})}}\\end{array}\n$$", "text_format": "latex", "page_idx": 24}, {"type": "text", "text": "In the next section, we use Eqn. 13 for feasible intervention optimization across multiple machine learning case studies, showing that mechanism distance is as effective as perception distance, as discussed in the main paper. ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "G.2 Case Study ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "G.2.1 MorphoMNIST ", "text_level": 1, "page_idx": 24}, {"type": "table", "img_path": "N6zJ8DclC2/tmp/ccf701753ef37957caee8d9ce97e983dcb82cd2109ec3d54e9faf9030274822e.jpg", "table_caption": ["Table 13: MorphoMNIST results of change(i) or $d o(i)$ using V-SCM "], "table_footnote": [], "page_idx": 24}, {"type": "text", "text": "In this section, we study two types of counterfactuals on the dataset called MorphoMNIST, which contains three variables $(t,i,x)$ . From the causal graph shown in Fig. 8 (a), $t$ (the thickness of digit stroke) is the cause of both $i$ (intensity of digit stroke) and $x$ (images) and $i$ is the direct cause of $x$ . Fig. 8 (b) shows a sample from the dataset. The dataset contains 60000 images as the training set and 10000 as the test set. ", "page_idx": 24}, {"type": "text", "text": "We follow the experimental settings of simulation experiments in Sec. 6.1, except for two differences. One is that we use two state-of-the-art deep learning models, namely V-SCM [25] and H-SCM [28], as the backbones to learn counterfactuals. They use normalizing flows to learn causal relationships among $x$ ’s parent nodes, e.g., $(t,i)$ in MorphoMNIST. Further, to learn $p(\\boldsymbol{x}|t,i)$ , notice that V-SCM uses VAE [17] and HVAE [21]. Another difference is that, instead of estimating the outcome with MAE, we follow the same metric called counterfactual effectiveness in [28] developed by [22], First, trained on the dataset, parent predictors given a value of $x$ can predict parent values, i.e., $(t,i)$ ’s, and then measure the absolute error between parent values after hard intervention or LBF intervention and their predicted values, which is measured on image the pretrained causal model generates given the input of $(t,i)$ . ", "page_idx": 24}, {"type": "table", "img_path": "N6zJ8DclC2/tmp/d52297571509a965e33b7e3a28b8383def3fcdbbb14f132373b619106a8c147d.jpg", "table_caption": ["Table 14: Ablation Study on $\\epsilon$ "], "table_footnote": [], "page_idx": 24}, {"type": "image", "img_path": "N6zJ8DclC2/tmp/9c9b93a85985a58cf7f717da655ae9e3d76b3b6590ec658b81f1e634c360ca13.jpg", "img_caption": ["Figure 8: Causal Graph and samples of MorphoMNIST. "], "img_footnote": [], "page_idx": 25}, {"type": "text", "text": "shows the MAE of $(t,i)$ , indicating our results outperform that of non-backtracking. Next, we focus on the rest four-column results. In both types of counterfactuals, we use the same value $i$ in $d o(i)$ and change(i). Hence, after inference, we know which image satisfying $\\epsilon$ -natural generation in the two types of counterfactuals. In $\"\\mathrm{NC}{=}1\"$ of the table, NC indicates the set of counterfactuals after feasible intervention optimization. Notice that NC set does not mean the results of natural counterfactuals, since some results do still not satisfy $\\epsilon$ -natural generation after feasible intervention optimization. $\\mathrm{\\DeltaNC}{=}1\"$ mean the set containing data points satisfying $\\epsilon_{}$ -natural generation and $\\mathrm{{}^{\\bullet}N C{=}0\"}$ contains data not satisfying $\\epsilon$ -natural generation after feasible intervention optimization. Similarly, $\\sqrt[\\circ]{\\B{=}1\"}$ means the set containing data points satisfying naturalness criteria. $\\mathrm{NC}{=}1$ , $\\scriptstyle\\mathrm{NB}=1$ ) presents the intersection of $\\mathrm{{}^{\\circ}N C}{=}1\"$ and $\\mathrm{^{\\bullet}N B=1\"}$ . Similar logic is adopted to the other three combinations. The number of counterfactual data points are 10000 in two types of counterfactuals. ", "page_idx": 25}, {"type": "text", "text": "In $\\mathrm{NC}{=}1$ , $\\mathrm{NB}{=}1$ ) containing 5841 data points, our performance is similar to the non-backtracking, showing feasible intervention optimization tends to backtrack as less as possible when hard interventions have satisfied $\\epsilon$ -natural generation. In $\\mathrm{NC}{=}1$ , $\\scriptstyle\\mathrm{NB}=0$ ), there are 3064 data points, which are “unnatural” points in non-backtracking counterfactuals. After natural counterfactual optimation, this huge amount of data points become “natural”. In this set, our approach contributes to the maximal improvement compared to the other three sets in Table 13, improving $55.4\\%$ and $41.6\\%$ on thickness $t$ and intensity $i$ . The number of points in ( $\\mathrm{NC}{=}0$ , $\\scriptstyle\\mathrm{NB}=1$ ) is zero, showing the stability of our algorithm since our approach will not move the hard, feasible intervention into an unfeasible intervention. Two types of counterfactuals perform similarly in the set $\\mathrm{NC}{=}0$ , $\\mathrm{NB}{=}0$ ), also showing the stability of our approach. ", "page_idx": 25}, {"type": "text", "text": "Ablation Study on Naturalness Threshold $\\epsilon$ . We use two models,V-SCM and H-SCM, to do counterfactuals with different values of $\\epsilon$ . As shown in Table 14, our error is reduced as the $\\epsilon$ increases using the same inference model, since the higher $\\epsilon$ will select more feasible interventions. ", "page_idx": 25}, {"type": "image", "img_path": "N6zJ8DclC2/tmp/a955f9c5fcc404c5970fa86fc3258b85cc5955a68a02b177ffbeea47810f17a7.jpg", "img_caption": ["Figure 9: Causal graph of 3DIdent and the causal relationships of variables $(d,h)$ in Weak-3DIdent and Strong-3DIdent respectively. "], "img_footnote": [], "page_idx": 25}, {"type": "text", "text": "G.2.2 3DIdentBOX ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "In this task, we utilize practical public datasets called 3DIdentBOX, which encompass multiple datasets [4]. Specifically, we employ Weak-3DIdent and Strong-3DIdent, both of which share the same causal graph depicted in Fig. 9 (b), consisting of an image variable denoted as $x$ and seven ", "page_idx": 25}, {"type": "image", "img_path": "N6zJ8DclC2/tmp/4e79a7a23e0456626a43df56279dfcf589b3e56ac2c006889a0c190c3992daeb.jpg", "img_caption": ["(a) Results of Non-backtracking Counterfactuals "], "img_footnote": [], "page_idx": 26}, {"type": "image", "img_path": "N6zJ8DclC2/tmp/24851aa3b3d856c854906a21b82d5af36d3aaa55b55bb200e37e04b79b571340.jpg", "img_caption": ["(b) Results of Natural Counterfactuals "], "img_footnote": [], "page_idx": 26}, {"type": "text", "text": "Figure 10: Visualization Results on Stong-3DIdent. ", "page_idx": 26}, {"type": "table", "img_path": "N6zJ8DclC2/tmp/cf3bb37d50a1d74bee3ffb650e215218fa352e805cefa887799fdff8244a0022.jpg", "table_caption": ["Table 15: Results on Weak-3DIdent and Stong-3DIdent "], "table_footnote": [], "page_idx": 26}, {"type": "text", "text": "parent variables. These parent variables, denoted as $(d,h,v)$ , control the depth, horizon position, and vertical position of the teapot in image $x$ respectively. Additionally, the variables $(\\gamma,\\alpha,\\beta)$ govern three types of angles associated with the teapot within images, while variable $b$ represents the background color of the image. As illustrated in Fig. 9 (a), causal relationships exist among three pairs of parent variables, i.e., $(h,d)$ , $(v,\\beta)$ and $(\\alpha,\\gamma)$ . It is important to note a distinction between Weak-3DIdent and Strong-3DIdent. In Weak-3DIdent, there exists a weak causal relationship between the variables of each pair, as shown in Fig. 9 (b), whereas in Strong-3DIdent, the causal relationship is stronger, as depicted in Fig. 9 (c). ", "page_idx": 26}, {"type": "text", "text": "We follow the same experimental setup as in the MophoMNIST experiments. Using an epsilon value of $\\epsilon=10^{-3}$ we employ the H-SCM as the inference model. We conduct interventions or changes on the variables $(d,\\beta,\\gamma)$ and the results are presented in Table 15. In both datasets, our approach outperforms the non-backtracking method, with Strong-3DIdent exhibiting a more significant margin over the non-backtracking method. This is because the non-backtracking method encounters more unfeasible interventions when performing hard interventions using Strong-3DIdent. ", "page_idx": 26}, {"type": "text", "text": "Additionally, we perform visualizations on Strong-3DIdent. In Fig. 10, we display counterfactual outcomes in (a) and (b), where the text above each image in the first row (evidence) indicates the error in the corresponding counterfactual outcome shown in the second row. In Fig. 10 (a), we present counterfactual images that do not meet the $\\epsilon$ -natural generation criteria in the non-backtracking approach. In contrast, Fig. 10 (b) showcases our results, which are notably more visually effective. This demonstrates that our solution can alleviate the challenges posed by hard interventions in the non-backtracking method. ", "page_idx": 27}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 28}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 28}, {"type": "text", "text": "Justification: Sec. 1 ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 28}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 28}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 28}, {"type": "text", "text": "Justification: Sec. 7 ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 28}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 28}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 28}, {"type": "text", "text": "Justification: Sec. 4.4 and Sec. B ", "page_idx": 29}, {"type": "text", "text": "Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 29}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 29}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 29}, {"type": "text", "text": "Justification: Sec. A, C, and D ", "page_idx": 29}, {"type": "text", "text": "Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 29}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 29}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 30}, {"type": "text", "text": "Justification: Data are described in Sec. A and The code is available at https://github.   \ncom/GuangyuanHao/natural_counterfactuals. ", "page_idx": 30}, {"type": "text", "text": "Guidelines: ", "page_idx": 30}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 30}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 30}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 30}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 30}, {"type": "text", "text": "Justification: Sec. C and D ", "page_idx": 30}, {"type": "text", "text": "Guidelines: ", "page_idx": 30}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 30}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 30}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 30}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 30}, {"type": "text", "text": "Justification: Sec. A.4 ", "page_idx": 30}, {"type": "text", "text": "Guidelines: ", "page_idx": 30}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 30}, {"type": "text", "text": "", "page_idx": 31}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 31}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 31}, {"type": "text", "text": "Justification: Sec. C Guidelines: ", "page_idx": 31}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 31}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 31}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 31}, {"type": "text", "text": "Justification: The research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics. ", "page_idx": 31}, {"type": "text", "text": "Guidelines: ", "page_idx": 31}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 31}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 31}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 31}, {"type": "text", "text": "Justification: The paper focuses on fundamental perspectives in causality and emphasizes on conceptual innovation. ", "page_idx": 31}, {"type": "text", "text": "Guidelines: ", "page_idx": 31}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed.   \n• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 31}, {"type": "text", "text": "", "page_idx": 32}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 32}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 32}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 32}, {"type": "text", "text": "Justification: NA ", "page_idx": 32}, {"type": "text", "text": "Guidelines: ", "page_idx": 32}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 32}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 32}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 32}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 32}, {"type": "text", "text": "Justification: We have cited the original paper that produced the code package or dataset. Guidelines: ", "page_idx": 32}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided. ", "page_idx": 32}, {"type": "text", "text": "• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 33}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 33}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 33}, {"type": "text", "text": "Answer: [NA] Justification: NA Guidelines: ", "page_idx": 33}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 33}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 33}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 33}, {"type": "text", "text": "Answer: [NA] Justification: NA ", "page_idx": 33}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 33}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 33}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 33}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 33}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 33}]