[{"figure_path": "zuwpeRkJNH/figures/figures_1_1.jpg", "caption": "Figure 1: Illustratsion of video-language pretraining with hierarchical video-text pairs. At phase- and video-level, one parent-level text is paired to multiple child-level texts.", "description": "This figure illustrates the hierarchical video-language pretraining approach used in the paper.  It shows three levels of pairing between video segments and text descriptions.  (a) Clip-level pairing matches short video clips with their corresponding narration sentences. (b) Phase-level pairing links a longer video segment representing a surgical phase with both an overarching phase description (parent-level) and more detailed step-by-step instructions within that phase (child-level).  (c) Video-level pairing shows how an entire surgical video is associated with both a summary (parent-level) and a sequence of phase-level descriptions (child-level). This hierarchical structure aims to capture the multi-level temporal dependencies inherent in surgical procedures.", "section": "3.3 Procedure-aware Surgical Video-language Pretraining"}, {"figure_path": "zuwpeRkJNH/figures/figures_3_1.jpg", "caption": "Figure 1: Illustratsion of video-language pretraining with hierarchical video-text pairs. At phase- and video-level, one parent-level text is paired to multiple child-level texts.", "description": "This figure illustrates the hierarchical video-language pretraining approach used in the PeskaVLP framework.  It shows how video clips are paired with text at three levels: clip-level (short video segments paired with short descriptions), phase-level (longer segments paired with descriptions of a surgical phase), and video-level (entire video paired with a summary). The hierarchical structure helps the model learn temporal relationships and understand the overall surgical procedure.", "section": "3 Approach"}, {"figure_path": "zuwpeRkJNH/figures/figures_4_1.jpg", "caption": "Figure 3: The pretraining pipeline of different hierarchies. We combine language supervision and visual self-supervision at clip-level pretraining. We conduct the procedure-aware contrastive learning at phase/video-level pretraining.", "description": "This figure illustrates the PeskaVLP framework's pretraining pipeline across three hierarchical levels: clip, phase, and video.  Clip-level pretraining uses contrastive learning with both language supervision (matching video clips to their narration texts) and visual self-supervision (maximizing similarity between two augmented views of the same clip). Phase and video-level pretraining use a procedure-aware contrastive learning approach which incorporates a Dynamic Time Warping (DTW) based loss function to account for temporal relationships between video frames and text sequences.  Hard negative samples are generated by reversing the temporal order of the text sequences, making the model learn the correct temporal alignment. This hierarchical approach is designed to efficiently learn multi-modal surgical representations from a relatively small dataset.", "section": "3.3 Procedure-aware Surgical Video-language Pretraining"}, {"figure_path": "zuwpeRkJNH/figures/figures_19_1.jpg", "caption": "Figure 3: The pretraining pipeline of different hierarchies. We combine language supervision and visual self-supervision at clip-level pretraining. We conduct the procedure-aware contrastive learning at phase/video-level pretraining.", "description": "This figure illustrates the PeskaVLP framework's hierarchical video-language pretraining process.  It shows three levels: clip-level, phase-level, and video-level.  Clip-level pretraining uses both language supervision (matching video clips with their narration texts) and visual self-supervision (maximizing similarity between two augmented views of the same clip). Phase- and video-level pretraining focus on procedure awareness, using a Dynamic Time Warping (DTW)-based loss function to align video frames and texts, considering their temporal order.  The figure visually represents the different components and connections within the framework, illustrating how the model learns multi-modal representations at multiple levels of detail.", "section": "3.3 Procedure-aware Surgical Video-language Pretraining"}, {"figure_path": "zuwpeRkJNH/figures/figures_20_1.jpg", "caption": "Figure 1: Illustratsion of video-language pretraining with hierarchical video-text pairs. At phase- and video-level, one parent-level text is paired to multiple child-level texts.", "description": "This figure illustrates the hierarchical video-language pretraining approach used in the PeskaVLP framework.  It shows how video clips are paired with multiple levels of textual descriptions. At the clip level, short video segments are paired with single sentences describing the action. At the phase level, longer video segments are paired with multiple sentences describing different key steps within a surgical phase. At the video level, the entire video is paired with a summary of the entire procedure. This hierarchical approach allows the model to learn both short-term and long-term temporal relationships between visual and textual information in surgical videos.", "section": "3.3 Procedure-aware Surgical Video-language Pretraining"}, {"figure_path": "zuwpeRkJNH/figures/figures_20_2.jpg", "caption": "Figure 1: Illustratsion of video-language pretraining with hierarchical video-text pairs. At phase- and video-level, one parent-level text is paired to multiple child-level texts.", "description": "This figure illustrates the hierarchical video-language pretraining approach used in the PeskaVLP framework.  It shows three levels of pairing: clip-level (short video segments paired with single sentences), phase-level (longer video segments paired with multiple sentences describing a phase of the procedure), and video-level (the entire video paired with a summary).  This hierarchical structure allows the model to learn relationships between visual information and text at different granularities, improving understanding of complex surgical procedures.", "section": "3.3 Procedure-aware Surgical Video-language Pretraining"}]