{"importance": "This paper is crucial for researchers in federated learning and vision-language models.  It offers **a novel theoretical framework and a practical algorithm (PromptFolio)**, advancing our understanding of prompt-based federated learning and providing a solution to improve model performance in heterogeneous data scenarios. This work bridges the gap between theory and practice, impacting future research directions and applications.", "summary": "PromptFolio optimizes federated learning of vision-language models by combining global and local prompts, improving generalization and personalization, as proven theoretically and empirically.", "takeaways": ["A novel theoretical framework analyzes prompt-based federated learning using feature learning theory.", "PromptFolio, a novel algorithm, enhances performance by creating a portfolio of global and local prompts.", "Theoretical and empirical results demonstrate that PromptFolio balances generalization and personalization, particularly in heterogeneous data settings."], "tldr": "Federated learning (FL) struggles with communication costs and data heterogeneity, especially when using large vision-language models.  Prompt-based FL reduces these issues, but lacks theoretical understanding. This limits optimization and efficient algorithm design.  Existing methods like CoOp (local prompt) and PromptFL (global prompt) individually offer either strong personalization or generalization but not both.\nThis paper introduces a theoretical framework analyzing prompt-based FL via feature learning theory.  It then presents PromptFolio, an algorithm combining global and local prompts to create a 'prompt portfolio'.  This approach balances generalization and personalization, improving performance significantly.  The optimal prompt mixing coefficient is derived and empirically validated, demonstrating a clear performance advantage over existing techniques. **The theoretical framework and PromptFolio algorithm offer a valuable advancement in prompt-based FL.**", "affiliation": "ShanghaiTech University", "categories": {"main_category": "Multimodal Learning", "sub_category": "Vision-Language Models"}, "podcast_path": "Y4L8GQXZZO/podcast.wav"}