[{"type": "text", "text": "Subject-driven Text-to-Image Generation via Preference-based Reinforcement Learning ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Yanting Miao ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "William Loh ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Department of Computer Science University of Waterloo, Vector Institute y43miao@uwaterloo.ca ", "page_idx": 0}, {"type": "text", "text": "Depart of Computer Science University of Waterloo, Vector Institute wmloh@uwaterloo.ca ", "page_idx": 0}, {"type": "text", "text": "Pascal Poupart ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Suraj Kothawade Google skothawade@google.com ", "page_idx": 0}, {"type": "text", "text": "Depart of Computer Science University of Waterloo, Vector Institute ppoupart@uwaterloo.ca ", "page_idx": 0}, {"type": "text", "text": "Abdullah Rashwan ∗ Google arashwan@google.com ", "page_idx": 0}, {"type": "text", "text": "Yeqing Li Google yeqing@google.com ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Text-to-image generative models have recently attracted considerable interest, enabling the synthesis of high-quality images from textual prompts. However, these models often lack the capability to generate specific subjects from given reference images or to synthesize novel renditions under varying conditions. Methods like DreamBooth and Subject-driven Text-to-Image (SuTI) have made significant progress in this area. Yet, both approaches primarily focus on enhancing similarity to reference images and require expensive setups, often overlooking the need for efficient training and avoiding overfitting to the reference images. In this work, we present the $\\lambda$ -Harmonic reward function, which provides a reliable reward signal and enables early stopping for faster training and effective regularization. By combining the Bradley-Terry preference model, the $\\lambda$ -Harmonic reward function also provides preference labels for subject-driven generation tasks. We propose Reward Preference Optimization (RPO), which offers a simpler setup (requiring only $3\\%$ of the negative samples used by DreamBooth) and fewer gradient steps for fine-tuning. Unlike most existing methods, our approach does not require training a text encoder or optimizing text embeddings and achieves text-image alignment by fine-tuning only the U-Net component. Empirically, $\\lambda$ -Harmonic proves to be a reliable approach for model selection in subject-driven generation tasks. Based on preference labels and early stopping validation from the $\\lambda$ -Harmonic reward function, our algorithm achieves a state-of-the-art CLIP-I score of 0.833 and a CLIP-T score of 0.314 on DreamBench. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "In the evolving field of generative AI, text-to-image diffusion models [28, 13, 26, 29, 27, 23, 24] have demonstrated remarkable abilities in rendering scenes that are both imaginative and contextually appropriate. However, these models often struggle with tasks that require the portrayal of specific subjects within text prompts. For instance, if provided with a photo of your cat, current diffusion models are unable to generate an image of your cat situated in the castle of your childhood dreams. This challenge necessitates a deep understanding of subject identity. Consequently, subject-driven text-to-image generation has attracted considerable interest within the community. Chen et al. [7] have noted that this task requires complex transformations of reference images. Additionally, Ruiz et al. [23] have highlighted that detailed and descriptive prompts about specific objects can lead to varied appearances in subjects. Thus, traditional image editing approaches and existing text-to-image models are ill-suited for subject-driven tasks. ", "page_idx": 0}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/e16e06a80e1481d0b7055b0888fa63c64e8d80c4ad41670d41b4ce2d9c51f18a.jpg", "img_caption": ["Figure 1: We illustrate the $\\lambda$ -Harmonic reward function applied to the subject-driven generation task. Leveraging preference labels produced by the $\\lambda$ -Harmonic reward function, alongside a few reference images, our preference-based algorithm efficiently generates unseen scenes that are both faithful to the reference images and the textual prompts. "], "img_footnote": [], "page_idx": 1}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "Current subject-driven text-to-image generation methods are less expressive and expensive. Textual Inversion [12] performs poorly due to the limited expressiveness of frozen diffusion models. Imagic [15] is both time-consuming and resource-intensive during the fine-tuning phase. It requires textembedding optimization for each prompt, fine-tuning of diffusion models, and interpolation between optimized and target prompts. The training process is complex and slow. These text-based methods require 30 to 70 minutes to fine-tune their models, which is not scalable for real applications. SuTI [7] proposes an in-context learning method for subject-driven tasks. However, SuTI demands half a million expert models for each different subject, making it prohibitively expensive. Although SuTI can perform in-context learning during inference, the setup of expert models remains costly. DreamBooth [23] provides a simpler method for handling subject-driven tasks. Nevertheless, DreamBooth requires approximately 1000 negative samples and 1000 gradient steps, and also needs fine-tuning of the text encoder to achieve state-of-the-art performance. Therefore, it is worthwhile to explore more efficient training methods: the setup should be as simple as possible. First, training should not include multiple optimization phases. Second, text-to-image alignment should fine-tune as few components as possible such as the UNet, but not the text encoder for each prompt. Third, faster evaluation and regularization should be enabled by early stopping based on model selection. ", "page_idx": 1}, {"type": "text", "text": "In this paper, we propose a $\\lambda$ -Harmonic reward function that enables early stopping and accelerates training. In addition, we incorporate the Bradley-Terry preference model to generate preference labels. We utilize preference-based reinforcement learning algorithms to finetune pre-trained diffusion models and to achieve text-to-image alignment without optimizing any text encoder or text embedding. The whole finetuning process including setup, training, validation, and model saving only takes 5 to 20 minutes on Cloud TPU V4. Our method, Reward Preference Optimization (RPO), only requires a few input reference images and the finetuned diffusion model can generate images that preserve the identity of a specific subject while aligning well with textual prompts (Figure 1). ", "page_idx": 1}, {"type": "text", "text": "", "page_idx": 2}, {"type": "text", "text": "To show the effectiveness of our $\\lambda$ -Harmonic reward function, we evaluate RPO on diverse subjects and text prompts on DreamBench [23] and we report the DINO and CLIP-I/CLIP-T of RPO’s generated images on this benchmark and compare them with existing methods. Surprisingly, our method requires a simple setup $3\\%$ of DreamBooth configuration) and with fewer gradient steps, but the experimental results outperform or match SOTA. ", "page_idx": 2}, {"type": "text", "text": "In summary, our contributions are as follows: ", "page_idx": 2}, {"type": "text", "text": "• We introduce the $\\lambda$ -Harmonic reward function, which permits early-stopping to alleviate overfitting in subject-driven generation tasks and to accelerate the finetuning process. • By combining the $\\lambda$ -Harmonic reward function and a preference model, we present RPO, which only requires a cheap setup, but still can provide high quality results. • We evaluate RPO and show the effectiveness of the $\\lambda$ -Harmonic function with diverse subjects and various prompts on DreamBench. We achieve results comparable to SOTA. ", "page_idx": 2}, {"type": "text", "text": "2 Related Works ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Ruiz et al. [23] formulated a class of problems called subject-driven generation, which refers to preserving the appearance of a subject contextualized in different settings. DreamBooth [23] solves the issue of preserving the subject by binding it in textual space with a unique identifier for the subject in the reference images, and simultaneously generating diverse backgrounds by leveraging prior class-specific information previously learned. A related work that could possibly perform the same task is textual inversion [12]. However, its original objective is to produce a modification of the subject or property marked by a unique token in the text. While it can be used to preserve the subject and change the background or setting, the performance is underwhelming compared to DreamBooth in various metrics [23]. ", "page_idx": 2}, {"type": "text", "text": "The prevalent issue in DreamBooth and textual inversion is the long training time [23, 12] since gradient-based optimization has to be performed on their respective models for each subject. Subjectdriven text-to-image generator (SuTI) by [7] aims to alleviate this issue by employing apprenticeship learning. By scraping millions of images online, many expert models are trained for different clusters of images centered around different subjects, which allows an apprentice to learn quickly from the experts [7]. However, this is an incredibly resource intensive task with massive computational overhead during training. ", "page_idx": 2}, {"type": "text", "text": "In the field of natural language processing, direct preference optimization has found great success in large language models (LLM) [21]. By bypassing reinforcement learning from human feedback and directly maximizing likelihoods using preference data, LLMs benefit from more stable training and reduced dependency on an external reward model. Subsequently, this inspired Diffusion-DPO by [30], which applies a similar technique to diffusion models. However, this relies on a preference labelled dataset, which can be expensive to collect or not publicly available for legal reasons. ", "page_idx": 2}, {"type": "text", "text": "Fortunately, there are reward models that can serve as functional substitutes such as CLIP [19] and ALIGN [14]. ALIGN has a dual encoder architecture that was trained on a large dataset. The encoders can produce text and image embeddings, which allows us to obtain pairwise similarity scores by computing cosine similarity. There are also diffusion modelling techniques that can leverage reward models. An example is denoising diffusion policy optimization (DDPO) by Black et al. [3] that uses a policy gradient reinforcement learning method to encourage generations that lead to higher rewards. ", "page_idx": 2}, {"type": "text", "text": "3 Preliminary ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "In this section, we introduce the notation and some key concepts about text-to-image diffusion models and reinforcement learning. ", "page_idx": 2}, {"type": "text", "text": "Text-to-Image Diffusion Models. Diffusion models [13, 26, 28, 29, 27] are a family of latent variable models of the form $\\begin{array}{r}{p_{\\theta}(\\mathbf{x}_{0})=\\int_{\\mathcal{X}}p_{\\theta}(\\mathbf{x}_{0:T})d\\mathbf{x}_{1:T}}\\end{array}$ , where the $\\mathbf{x}_{1},\\ldots,\\mathbf{x}_{T}$ are noised latent variables of the same dimensionality as the input data $\\mathbf{x}_{0}\\sim q(\\mathbf{x}_{0})$ . The diffusion or forward process ", "page_idx": 2}, {"type": "text", "text": "is often a Markov chain that gradually adds Gaussian noise to the input data and each intermediate sample $\\mathbf{x}_{t}$ can be written as ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\mathbf{x}_{t}=\\sqrt{\\alpha_{t}}\\mathbf{x}_{0}+\\sqrt{1-\\alpha_{t}}\\epsilon_{t},\\quad\\mathrm{for}\\;\\mathrm{all}\\;t\\in\\{1,\\dots,T\\},}\\end{array}\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "where $\\alpha_{t}$ refers to the variance schedule and $\\mathbf{\\boldsymbol{\\epsilon}}_{t}\\sim\\mathcal{N}(\\mathbf{0},\\mathbf{I})$ . Given a conditioning tensor c (often a text embedding), the core premise of text-to-image diffusion models is to use a neural network $\\epsilon_{\\theta}(\\mathbf{x}_{t},\\mathbf{c},t)$ that iteratively refines the current noised sample $\\mathbf{x}_{t}$ to obtain the previous step sample $\\mathbf x_{t-1}$ , This network can be trained by optimizing a simple denoising objective function, which is the time coefficient weighted mean squared error, the derivation is shown in Appendix A.1: ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\mathbb{E}_{\\mathbf{x}_{0},\\mathbf{c},t,\\epsilon_{t}}\\left[\\omega(t)\\lVert\\epsilon_{\\theta}(\\mathbf{x}_{t},\\mathbf{c},t)-\\epsilon_{t}\\rVert_{2}^{2}\\right],\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "where $t$ is uniformly sampled from $\\{1,\\ldots,T\\}$ and $\\omega(t)$ is a time dependent weight that can be simplified to 1 according to [13, 27, 22]. ", "page_idx": 3}, {"type": "text", "text": "Reinforcement Learning and Diffusion DPO Reinforcement Learning for diffusion models [3, 11, 30] aims to solve the following optimization problem: ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\mathbb{E}_{\\mathbf{x}_{0:T}\\sim p_{\\theta}(\\mathbf{x}_{0:T}|\\mathbf{c})}\\left[\\sum_{t=1}^{T}R(\\mathbf{x}_{t},\\mathbf{x}_{t-1},\\mathbf{c})-\\beta\\mathbb{D}_{\\mathrm{KL}}(p_{\\theta}(\\mathbf{x}_{t-1}\\mid\\mathbf{x}_{t},\\mathbf{c})||p_{\\mathrm{base}}(\\mathbf{x}_{t-1}\\mid\\mathbf{x}_{t},\\mathbf{c}))\\right],\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "where $\\beta$ is a hyperparameter controlling the KL-divergence between the finetuned model $p_{\\theta}$ and the pre-trained base model $p_{\\mathrm{{base}}}$ . In Equation (14) from Diffusion-DPO [30], the optimal $p_{\\theta}$ can be approximated by minimizing the negative log-likelihood: ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathbb{E}_{\\mathbf{x}_{0}^{+},\\mathbf{x}_{0}^{-},t,\\mathbf{x}_{t}^{+},\\mathbf{x}_{t}^{-}}\\Bigg[-\\log\\sigma\\bigg(\\beta\\big(\\|\\epsilon_{\\mathrm{base}}(\\mathbf{x}_{t}^{+},\\mathbf{c},t)-\\epsilon_{t}^{+}\\|_{2}^{2}-\\|\\epsilon_{\\theta}(\\mathbf{x}_{t}^{+},\\mathbf{c},t)-\\epsilon^{+}\\|_{2}^{2}}\\\\ &{\\qquad\\qquad\\qquad\\qquad-\\left(\\|\\epsilon_{\\mathrm{base}}(\\mathbf{x}_{t}^{-},\\mathbf{c},t)-\\epsilon_{t}^{-}\\|_{2}^{2}-\\|\\epsilon_{\\theta}(\\mathbf{x}_{t}^{-},\\mathbf{c},t)-\\epsilon^{-}\\|_{2}^{2}\\right)\\!\\bigg)\\Bigg],}\\end{array}\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "where $\\epsilon^{+}$ and $\\epsilon^{-}$ are independent samples from a Gaussian distribution, $\\mathbf{x}_{t}^{+}$ and $\\mathbf{x}_{t}^{-}$ are perturbed versions of $\\mathbf{x}_{0}^{+}$ and $\\mathbf{x}_{0}^{-}$ that depend on $\\epsilon^{+}$ and $\\epsilon^{-}$ , and $\\mathbf{x}_{0}^{+}$ is preferred to $\\mathbf{x}_{0}^{-}$ . A detailed description is given in Appendix A.1. ", "page_idx": 3}, {"type": "text", "text": "Additional notation. We use ${\\bf x}_{\\mathrm{ref}}$ and $\\mathbf{x}_{\\mathrm{gen}}$ to represent the reference image and generated image, respectively. ${\\mathcal{Z}}_{\\mathrm{ref}}$ denotes the set of reference images, and ${\\mathcal{T}}_{\\mathrm{gen}}$ is the set of generated images. $\\mathbb{P}(\\mathbf{x}\\succ\\tilde{\\mathbf{x}})$ represents the probability that $\\mathbf{x}$ is more preferred than $\\tilde{\\bf x}$ . ", "page_idx": 3}, {"type": "text", "text": "4 Method ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "We present our $\\lambda$ -Harmonic reward function that provides reward signals for subject-driven tasks to reduce the risk that the learned model will overfit to the reference images. Based on this reward function, we use the Bradley-Terry model to sample preference labels and a preference algorithm to finetune the diffusion model by optimizing both a similarity loss and a preference loss. ", "page_idx": 3}, {"type": "text", "text": "4.1 Reward Preference Optimization ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "In contrast to other fine-tuning applications [30, 18, 21, 20], there is no human feedback in the subject-driven text-to-image generation task. The model only receives a few reference images and a prompt with a specific subject. Hence, we first propose the $\\lambda$ -Harmonic reward function that can leverage the ALIGN model [14] to provide feedback based on the generated image fidelity: similarity to the given reference images and faithfulness to the text prompts. ", "page_idx": 3}, {"type": "text", "text": "$\\lambda$ -Harmonic Reward Function. The normalized ALIGN-I and ALIGN-T scores can be denoted as ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathrm{ALIGN-I}(\\mathbf{x},\\mathcal{Z}_{\\mathrm{ref}}):=\\displaystyle\\frac{1}{|\\mathcal{Z}_{\\mathrm{ref}}|}\\sum_{\\widetilde{\\mathbf{x}}\\in\\mathcal{Z}_{\\mathrm{ref}}}\\frac{\\mathbb{C}\\mathrm{os}\\mathrm{Sim}(f_{\\phi}(\\mathbf{x}),f_{\\phi}(\\widetilde{\\mathbf{x}}))+1}{2}}\\\\ &{\\mathrm{ALIGN-T}(\\mathbf{x},\\mathbf{c}):=\\displaystyle\\frac{\\mathrm{Cos}\\mathrm{Sim}(f_{\\phi}(\\mathbf{x}),g_{\\phi}(\\mathbf{c}))+1}{2}}\\end{array}\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "where CosSim is the cosine similarity, $f_{\\phi}(\\mathbf{x})$ is the image feature extractor and $g_{\\phi}(\\mathbf{c})$ is the text encoder in the ALIGN model. Given a reference image set ${\\mathcal{Z}}_{\\mathrm{ref}}$ , the $\\lambda$ -Harmonic reward function can be defined by a weighted harmonic mean of the ALIGN-I and ALIGN-T scores, ", "page_idx": 4}, {"type": "equation", "text": "$$\nr(\\mathbf{x},\\mathbf{c};\\lambda,\\mathcal{Z}_{\\mathrm{ref}}):=\\frac{1}{\\frac{\\lambda}{\\mathrm{ALIGN}\\mathrm{-}\\mathrm{I}(\\mathbf{x},\\mathcal{Z}_{\\mathrm{ref}})}+\\frac{1-\\lambda}{\\mathrm{ALIGN}\\mathrm{-}\\mathrm{T}(\\mathbf{x},\\mathbf{c})}}.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Compared to the arithmetic mean, there are two advantages to using the harmonic mean: (1) according to AM-GM-HM inequalities [10], the harmonic mean is a lower bound of the arithmetic mean and maximizing this “pessimistic” reward can also improve the arithmetic mean of ALIGN-I and ALIGNT scores; (2) the harmonic mean is more sensitive to the smaller of the two scores, i.e., a larger reward is only achieved when both scores are relatively large. ", "page_idx": 4}, {"type": "text", "text": "For a simple example, consider $\\lambda=0.5$ . If there are two images, $\\mathbf{x}$ and $\\tilde{\\bf x}$ , where the first image achieves an ALIGN-I score of 0.9 and an ALIGN-T score of 0.01, and the second image receives an ALIGN-I score of 0.7 and an ALIGN-T score of 0.21, we may prefer the second image because it has high similarity to the reference images and is faithful to the text prompts. However, using the arithmetic mean would assign both images the same reward of 0.455. In contrast, the harmonic mean would assign the first image a reward of 0.020 and the second image a reward of 0.323, aligning with our preferences. During training, we set $\\lambda_{\\mathrm{train}}=0$ , which means the reward model will focus solely on text-to-image alignment because the objective function consists only of a loss for image-to-image alignment. Note that we set $\\lambda_{\\mathrm{val}}$ to a different value for validation, which evaluates the fidelity of the subject and faithfulness of the prompt. Details can be found in Section 5. ", "page_idx": 4}, {"type": "text", "text": "Dataset. The set of images for subject-driven generative tasks can usually be represented as ${\\mathcal{T}}={\\mathcal{T}}_{\\mathrm{ref}}\\cup{\\mathcal{T}}_{\\mathrm{gen}}$ , where ${\\mathcal{T}}_{\\mathrm{gen}}$ is the image set generated by the base model. DreamBooth [23] requires two different prompts, c and $\\mathbf{c_{\\mathrm{pr}}}$ , where c includes a reference to the subject while $\\mathbf{c_{pr}}$ refers to the prior class of the subject but not the subject. For example, c can be $\\mathfrak{s}\\mathfrak{a}$ photo of [V] ${\\tt d o g^{\\prime}}\\,$ and $\\mathbf{c_{pr}}$ can be $\\bullet\\bullet_{\\mathtt{a}}$ photo of a $\\mathsf{d o g}^{,}$ , where $\\bullet\\,[\\nabla]\\,^{,,}$ is a unique token that refers to the subject and dog is the prior class of the subject. DreamBooth then uses $\\mathbf{c_{pr}}$ to generate a variety of images ${\\mathcal{T}}_{\\mathrm{gen}}$ in the prior class to avoid overfitting to the reference images via a regularizer. Typically, the size of the set of generated images is around 1000, i.e., $\\bar{\\vert\\mathcal{Z}_{\\mathrm{gen}}\\vert}=1000$ , which is time-consuming and space-intensive in real applications. However, the diffusion model can only maximize the similarity score and still receives a high reward based on this uninformative prompt $\\mathbf{c_{pr}}$ . Our method aims to balance the trade-off between similarity and faithfulness. Thus, for efficiency, we introduce 8 novel training prompts, $\\bf{c}_{\\mathrm{mod}}$ of the form $\\mathfrak{s}\\mathfrak{a}$ [V] [class noun] [modification]” where modification includes artistic style transfer, re-contextualization, and accessorization. For example, $\\bf{c}_{\\mathrm{mod}}$ can be $\\bullet\\bullet_{\\mathtt{a}}$ [V] dog is on the Moon”. These training prompts can be pre-specified or generated by other Large Language Models2. The full list of training prompts is provided in the supplementary material (Figure 6). We feed these training prompts to the base model and generate 4 images for each training prompt, i.e., $\\left\\vert Z_{\\mathrm{gen}}\\right\\vert=32$ . ", "page_idx": 4}, {"type": "text", "text": "Once we obtain reward signals, we adopt the Bradley-Terry model [4] to generate preference labels. In particular, given a tuple $\\left(\\mathbf{x}_{\\mathrm{ref}},\\mathbf{x}_{\\mathrm{gen}},\\mathbf{c}_{\\mathrm{mod}}\\right)$ , we sample preference labels $y$ from the following probability model: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\mathbb{P}(\\mathbf{x}_{\\mathrm{ref}}\\succ\\mathbf{x}_{\\mathrm{gen}}):=\\frac{\\exp(r(\\mathbf{x}_{\\mathrm{ref}},\\mathbf{c}_{\\mathrm{mod}};\\lambda,\\mathcal{Z}_{\\mathrm{ref}}))}{\\exp(r(\\mathbf{x}_{\\mathrm{ref}},\\mathbf{c}_{\\mathrm{mod}};\\lambda,\\mathcal{Z}_{\\mathrm{ref}}))+\\exp(r(\\mathbf{x}_{\\mathrm{gen}},\\mathbf{c}_{\\mathrm{mod}};\\lambda,\\mathcal{Z}_{\\mathrm{ref}}))}.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Learning. The learning objective function consists of two parts — similarity loss and preference loss. The similarity loss is designed to minimize the KL divergence between the distribution of reference images and the learned distribution $p_{\\theta}(\\mathbf{x})$ , which is equivalent to minimizing: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\mathcal{L}_{\\mathrm{sim}}(\\theta):=\\mathbb{E}_{\\mathbf{x}_{\\mathrm{ref}},\\mathbf{c},t,\\epsilon_{\\mathrm{ref}}}\\left[\\|\\epsilon_{\\theta}(\\mathbf{x}_{\\mathrm{ref},t},\\mathbf{c},t)-\\epsilon_{\\mathrm{ref}}\\|_{2}^{2}\\right],\\quad t\\sim\\mathcal{U}\\{1,\\dots,T\\},\\quad\\epsilon_{\\mathrm{ref}}\\sim\\mathcal{N}(\\mathbf{0},\\mathbf{I}).}\\end{array}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "The preference loss aims to capture the preference signals and fit the preference model, Eq. (6). Therefore, we use binary cross-entropy as the objective function for the preference loss. Combining ", "page_idx": 4}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/32ce72cd7a0169acf1db8a1c4761ece48704c399b309454063a6b5e5ae7bfb23.jpg", "img_caption": [], "img_footnote": [], "page_idx": 5}, {"type": "text", "text": "Figure 2: Overview of the finetuning phase for RPO. First, the base diffusion model generates a few images based on novel training prompts. Second, we compute the rewards for both reference and generated images using Equation (5). Then, preference labels are sampled according to the preference distribution, as defined in Equation (6). Finally, the diffusion model is trained by minimizing both the similarity loss (Equation (7)) and preference loss (Equation (8)). ", "page_idx": 5}, {"type": "text", "text": "the DPO objective function in Eq. 4, the loss function can be written as follows: ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathcal{L}_{\\mathrm{pref}}(\\theta):=\\mathbb{E}_{\\mathbf{x}_{\\mathrm{ref}},\\mathbf{x}_{\\mathrm{gn}},\\mathbf{c}_{\\mathrm{nod}},\\boldsymbol{y},t,\\epsilon_{\\mathrm{ref}},\\epsilon_{\\mathrm{gen}}}\\Bigg[y\\log\\sigma\\Bigg(\\beta\\ell_{\\theta}(\\mathbf{x}_{\\mathrm{ref}},\\mathbf{x}_{\\mathrm{gen}},\\mathbf{c}_{\\mathrm{mod}},y,t,\\epsilon_{\\mathrm{ref}},\\epsilon_{\\mathrm{gen}})\\Bigg)}\\\\ &{\\qquad\\quad+\\left(1-y\\right)\\log\\sigma\\Bigg(-\\beta\\ell_{\\theta}(\\mathbf{x}_{\\mathrm{ref}},\\mathbf{x}_{\\mathrm{gen}},\\mathbf{c}_{\\mathrm{mod}},y,t,\\epsilon_{\\mathrm{ref}},\\epsilon_{\\mathrm{gen}})\\Bigg)\\Bigg],}\\end{array}\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\theta\\big(\\mathbf{x}_{\\mathrm{ref}},\\mathbf{x}_{\\mathrm{gen}},\\ \\mathbf{c}_{\\mathrm{mod}},y,t,\\epsilon_{\\mathrm{ref}},\\epsilon_{\\mathrm{gen}}\\big):=\\big\\|\\epsilon_{\\mathrm{base}}\\big(\\mathbf{x}_{\\mathrm{ref},t},\\mathbf{c}_{\\mathrm{mod}},t\\big)-\\epsilon_{\\mathrm{ref}}\\big\\|_{2}^{2}-\\big\\|\\epsilon_{\\theta}\\big(\\mathbf{x}_{\\mathrm{ref},t},\\mathbf{c}_{\\mathrm{mod}},t\\big)-\\epsilon_{\\mathrm{ref}}\\big\\|_{2}^{2}}\\\\ &{\\qquad\\qquad\\qquad\\qquad\\qquad\\qquad-\\left(\\big\\|\\epsilon_{\\mathrm{base}}\\big(\\mathbf{x}_{\\mathrm{gen},t},\\mathbf{c}_{\\mathrm{mod}},t\\big)-\\epsilon_{\\mathrm{gen}}\\big\\|_{2}^{2}-\\big\\|\\epsilon_{\\theta}\\big(\\mathbf{x}_{\\mathrm{gen},t},\\mathbf{c}_{\\mathrm{mod}},t\\big)-\\epsilon_{\\mathrm{gen}}\\big\\|_{2}^{2}\\right)}\\end{array}\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "and $t\\sim\\mathcal{U}\\{1,\\ldots,T\\}$ and $\\epsilon_{\\mathrm{ref}},\\epsilon_{\\mathrm{gen}}\\,\\sim\\mathcal{N}(\\mathbf{0},\\mathbf{I})$ . Combining these two loss functions together, the objective function for finetuning is written as ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\mathcal{L}(\\pmb{\\theta})=\\mathcal{L}_{\\mathrm{sim}}(\\pmb{\\theta})+\\mathcal{L}_{\\mathrm{pref}}(\\pmb{\\theta})\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "Figure 2 presents an overview of the training method, which includes the base model generated samples, the ALIGN reward model, and the preference loss. Note that $\\mathcal{L}_{\\mathrm{pref}}$ serves as a regularizer for approximating the text-to-image alignment policy. Conversely, DreamBooth [23] adopts $\\mathbb{D}_{\\mathrm{KL}}\\big(p_{\\mathrm{base}}(\\mathbf{x}_{t-1}\\mid\\mathbf{x}_{t},\\mathbf{c})\\big|p_{\\theta}(\\mathbf{x}_{t-1}\\mid\\mathbf{x}_{t},\\mathbf{c})\\big)$ as its regularizer, which cannot guarantee faithfulness to the text-prompt. Based on this loss function and preference model, we only need a few hundred gradient steps and a small set size of $|{\\mathcal{T}}_{\\mathrm{gen}}|$ to achieve results that are comparable to, or even better than, the state of the art. The fine-tuning process, which includes generating images, training, and validation, takes about 5 to 20 minutes on a single Google Cloud Platform TPUv4-8 (32GB) for Stable Diffusion. ", "page_idx": 5}, {"type": "text", "text": "5 Experiments ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "In this section, we present the experimental results demonstrated by RPO. We investigate several questions. First, can our algorithm learn to generate images that are faithful both to the preference images and to the textual prompts, according to preference labels? Second, if RPO can generate high-quality images, which part is the key component of RPO: the reference loss or the early stopping by the $\\lambda$ -Harmonic reward function? Third, how do different $\\lambda_{\\mathrm{val}}$ values used during validation affect performance in RPO? We refer readers to Appendix A.2 for details on the experimental setup, Appendix A.7 for the skill set of RPO, Appendix A.4 for the limitations of the RPO algorithm, and Appendix A.5 for future work involving RPO. ", "page_idx": 5}, {"type": "text", "text": "5.1 Dataset and Evaluation ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "DreamBench. In this work, we use the DreamBench dataset proposed by DreamBooth [23]. This dataset contains 30 different subject images including backpacks, sneakers, boots, cats, dogs, and toy, etc. DreamBench also provides 25 various prompt templates for each subject and these prompts are requiring the learned models to have the following abilities: re-contextualization, accessorization, property modification, and attribute editing. ", "page_idx": 6}, {"type": "text", "text": "Evaluation Metrics. We follow DreamBooth [23] and SuTI [7] to report DINO $[5]^{3}$ and CLIP-I [19] for evaluating image-to-image similarity score and CLIP-T [19] for evaluating the text-to-image similarity score. We also use our $\\lambda$ -Harmonic reward as a evaluation metric for the overall fidelity and the default value of $\\lambda=0.3$ . For evaluation, we follow DreamBooth [23] and SuTI [7] to generate 4 images per prompt, 3000 images in total, which provides a robust evaluation. ", "page_idx": 6}, {"type": "text", "text": "Baseline algorithms. DreamBooth [23]: A test-time fine-tuning method. This algorithm requires approximately $\\lvert Z_{\\mathrm{gen}}\\rvert=1000$ and 1000 gradient steps to finetune the UNet and text-encoder components. SuTI [7]: A pre-trained method that requires half a million expert models and introduces cross-attention layers into the original diffusion models. Textual Inversion [12]: A text-based method that optimizes the text embedding but freezes the diffusion models. Re-Imagen [8]: An information retrieval-based algorithm that modifies the backbone network architectures and introduces crossattention layers into the original diffusion models. DisenBooth [6]: A test-time fine-tuning method that generates subject-driven images by optimizing textual identity-preserving embeddings. Custom Diffusion [16]: a test-time fine-tuning method, focused on efficient training by optimizing the key and value projection matrices in the cross-attention layers of diffusion models. ELITE [31]: A test-time fine-tuning approach consisting of two stages: one for training the textual embeddings and another for preserving identity. IP-Adapter [32]: a pretrained method where the decoupled cross-attention layer captures the textual signal while integrating reference images. SSR-Encoder [33]: also a pretrained method that highlights selective regions and extracts detailed features for subject-driven image generation. ", "page_idx": 6}, {"type": "text", "text": "5.2 Results ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "Quantitative Results. We begin by addressing the first question. We use a quantitative evaluation to compare RPO with other existing methods on three metrics (DINO, CLIP-I, CLIP-T) in DreamBench to validate the effectiveness of RPO. The experimental results on DreamBench is shown in Table 1. We observe that RPO can perform better or on par with existing works on all three metrics. Compared to DreamBooth, RPO only requires $3\\%$ of the negative samples, but RPO can outperform DreamBooth on the CLIP-I and CLIP-T scores by $3\\%$ given the same backbone. Our method outperforms all baseline algorithms in the CLIP-T score, establishing a new SOTA result. This demonstrates that RPO, by solely optimizing UNet through preference labels from the $\\lambda$ -Harmonic reward function, can generate images that are faithful to the input prompts. Similarly, our CLIP-I score is also the highest, which indicates that RPO can generate images that preserve the subject’s visual features. In terms of the DINO score, our method is almost the same as DreamBooth when using the same backbone. We conjecture that the reason RPO achieves higher CLIP scores and lower DINO score is that the $\\lambda$ -Harmonic reward function prefers to select images that are semantically similar to the textual prompt, which may result in the loss of some unique features in the pixel space. ", "page_idx": 6}, {"type": "text", "text": "Qualitative Results. We use the same prompt as SuTI [7], and the generated images are shown in Figure 3. RPO generates images that are faithful to both reference images and textual prompts. We noticed a semantic mistake in the first prompt used by SuTI [7]; it should be A dog eating a cherry from a bowl. Furthermore, each reference bowl image contains blueberries, and the ambiguous prompt caused the RPO-trained model to become confused during the inference phase. However, RPO still preserves the unique appearance of the bowl. For instance, while the text on the bowl is incorrect or blurred in the SuTI and DreamBooth results, RPO accurately retains the words Bon Appetit from the reference bowl images. Although existing methods can produce images highly faithful to the reference images, they may not align as well with the textual prompts. We also provide an example in Appendix A.3 that shows how RPO can handle the failure case observed in DreamBooth and SuTI. Additionally, we find that the RPO model can generate reasonable images even for highly imaginative prompts, as shown in Appendix A.7 (Figure 16 and Figure 17). These images demonstrate that the RPO-trained model does not overfit the training data. Instead, the $\\lambda$ -Harmonic function provides a method for selecting a model capable of text-to-image alignment, even when the textual prompts are highly imaginative. ", "page_idx": 6}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/6731e8f0a52798b4c66bf0989ee08dfac78d8ece6fdbf14eba0785a4d81ca419.jpg", "img_caption": ["Figure 3: Qualitative comparison with other subject-driven text-to-image methods, adapted from [7] "], "img_footnote": [], "page_idx": 7}, {"type": "table", "img_path": "TWeVQ5meMW/tmp/d06e0a23d702745d022d6600319aef43c3f53cb74143017109ce8561116cb011.jpg", "table_caption": ["Table 1: Quantitative comparison for the number of iterations, subject fidelity and prompt fidelity. "], "table_footnote": [], "page_idx": 7}, {"type": "table", "img_path": "TWeVQ5meMW/tmp/c8830a9e55951f4d7b1199c7ab3cb27454d74360e8c7008d53c45c7be9fcf681.jpg", "table_caption": ["Table 2: Ablation study on regularization to evaluate fidelity across multiple subjects and prompts. Standard deviation is included. "], "table_footnote": [], "page_idx": 8}, {"type": "table", "img_path": "TWeVQ5meMW/tmp/66c1515904b02fcaa7673bb31939bd726d19864ccd392ee122846324448f9467.jpg", "table_caption": ["Table 3: Different validation $\\lambda_{\\mathrm{val}}$ -Harmonic reward comparison for evaluating fidelity over multiple subjects and prompts. Standard deviation is included. "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "", "page_idx": 8}, {"type": "text", "text": "5.3 Ablation Study and Method Analysis ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "Preference Loss and $\\lambda$ -Harmonic Ablation. We investigate the second question through an ablation study. Two regularization components are introduced into RPO: reference loss as a regularizer and early stopping by $\\lambda_{\\mathrm{val}}$ -Harmonic reward function. Consequently, we compare four methods: (1) Pure $\\ensuremath{\\mathcal{L}}_{\\mathrm{sim}}$ , which only minimizes the image-to-image similarity loss $\\mathcal{L}_{\\mathrm{sim}}$ ; (2) $\\mathcal{L}_{\\mathrm{pref}}$ w/o early stopping, which employs $\\mathcal{L}_{\\mathrm{pref}}$ as a regularizer but omits early stopping by $\\lambda_{\\mathrm{val}}$ -Harmonic reward function; (3) Early stopping w/o $\\mathcal{L}_{\\mathrm{pref}}$ , which uses $\\lambda_{\\mathrm{val}}$ -Harmonic reward function as a regularization method but excludes $\\mathcal{L}_{\\mathrm{pref}}$ ; (4) Full RPO, which utilizes both $\\mathcal{L}_{\\mathrm{pref}}$ and early stopping by the $\\lambda_{\\mathrm{val}}$ -Harmonic reward function. We choose the default value $\\lambda_{\\mathrm{val}}=0.\\dot{3}$ in this ablation study. ", "page_idx": 8}, {"type": "text", "text": "Table 2 lists the evaluation results of these four methods on DreamBench. We observe that without early stopping, $\\mathcal{L}_{\\mathrm{pref}}$ can still prevent overfitting to the reference images and improve text-to-image alignment, though the regularization effect is weak. Specifically, the 0.3-Harmonic only shows a marginal improvement of 0.003 over pure $\\mathcal{L}_{\\mathrm{sim}}$ and 0.001 over early stopping without $\\mathcal{L}_{\\mathrm{pref}}$ . The early stopping facilitated by the $\\lambda_{\\mathrm{val}}$ -Harmonic reward function plays a crucial role in counteracting overfitting, helping the diffusion models retain the ability to generate high-quality images aligned with textual prompts. To provide a deeper understanding of the $\\lambda$ -Harmonic reward validation, we present two examples from during training in Figure 4, covering both objects and live subjects. We found that the model tends to overfit at a very early stage, i.e., within 200 gradient steps, where $\\lambda$ -Harmonic can provide correct reward signals for the generated images. For the backpack subject, the generated image receives a low reward at gradient step 80 due to its lack of fidelity to the reference images. However, at gradient step 400, the image is overftited to the reference images, and the model fails to align well with the input text, resulting in another low reward. $\\lambda$ -Harmonic assigns a high reward to images that are faithful to both the reference image and textual prompts. ", "page_idx": 8}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/88c5bd59f4eab4cf861272c47fa5a75e12f4f609b2111f14cca08339b0fc4bac.jpg", "img_caption": ["Figure 4: Changes in the 0.3-Harmonic reward value during RPO training process. "], "img_footnote": [], "page_idx": 8}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/4940140fbf18ac363174967500631c5e1efa7d4790399f97cb6a975b0e44b17b.jpg", "img_caption": ["Figure 5: Different $\\lambda_{\\mathrm{val}}$ ’s will lead to different results. A small $\\lambda_{\\mathrm{val}}$ assigns a higher a weight for text-to-image alignment and leads to diverse generation. A large $\\lambda_{\\mathrm{val}}$ may also cause overfitting. "], "img_footnote": [], "page_idx": 9}, {"type": "text", "text": "", "page_idx": 9}, {"type": "text", "text": "Impact of ${\\lambda}_{\\mathbf{val}}$ . We examine the third question by selecting different $\\lambda_{\\mathrm{val}}$ values from the set $\\{0.3,0.5,0.7\\}$ as the validation parameters for the $\\lambda$ -Harmonic reward. According to Equation 5, we believe that as $\\lambda_{\\mathrm{val}}$ increases, the $\\lambda$ -Harmonic reward function will give higher weight to the image-to-image similarity score. This will make the generated images more closely resemble the reference images, however, there is also a risk of overfitting. Table 3 shows the results of three different $\\lambda_{\\mathrm{val}}$ values on DreamBench. As we expected, a larger $\\lambda_{\\mathrm{val}}$ makes the images better preserve the characteristics of the reference images, but it also reduces the text-to-image alignment score. Figure 5 shows us an example. In this example, different $\\lambda_{\\mathrm{val}}$ values lead to different outcomes due to varying strengths of regularization. A smaller $\\lambda_{\\mathrm{val}}=0.3$ can generate more varied results, but seems somewhat off from the reference images. $\\lambda_{\\mathrm{val}}=0.5$ preserves some characteristics beyond the original subject, such as the sofa, but also maintains alignment between text and image. However, when $\\lambda_{\\mathrm{val}}=0.7$ is chosen as an excessively large value, the model actually overfits to the reference images, ignoring the prompts. We have additional comparisons, including different $\\lambda_{\\mathrm{train}}$ ’s, different Pythagorean means, and aesthetic scores [25] in Appendix A.3. ", "page_idx": 9}, {"type": "text", "text": "6 Conclusion ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "We introduce the $\\lambda$ -Harmonic reward function to derive preference labels and employ RPO to finetune the diffusion model for subject-driven text-to-image generation tasks. Additionally, the $\\lambda$ -Harmonic reward function serves as a validation method, enabling early stopping to mitigate overfitting to reference images and speeding up the finetuning process. ", "page_idx": 9}, {"type": "text", "text": "Acknowledgments and Disclosure of Funding ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "We thank Shixin Luo and Hongliang Fei for providing constructive feedback. This work was supported by a Google grant with Cloud TPUs from Google’s TPU Research Cloud (TRC). We also thank the Vector Institute, the Canada CIFAR AI Chair program and the Natural Sciences and Engineering Research Council of Canada for their support. ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "[1] Yuntao Bai, Andy Jones, Kamal Ndousse, Amanda Askell, Anna Chen, Nova DasSarma, Dawn Drain, Stanislav Fort, Deep Ganguli, Tom Henighan, et al. Training a helpful and harmless ", "page_idx": 9}, {"type": "text", "text": "assistant with reinforcement learning from human feedback. arXiv preprint arXiv:2204.05862, 2022.   \n[2] Charlotte Bird, Eddie Ungless, and Atoosa Kasirzadeh. Typology of risks of generative text-toimage models. In Proceedings of the 2023 AAAI/ACM Conference on AI, Ethics, and Society, pages 396–410, 2023.   \n[3] Kevin Black, Michael Janner, Yilun Du, Ilya Kostrikov, and Sergey Levine. Training diffusion models with reinforcement learning. arXiv preprint arXiv:2305.13301, 2023. [4] Ralph Allan Bradley and Milton E Terry. Rank analysis of incomplete block designs: I. the method of paired comparisons. Biometrika, 39(3/4):324–345, 1952.   \n[5] Mathilde Caron, Hugo Touvron, Ishan Misra, Hervé Jégou, Julien Mairal, Piotr Bojanowski, and Armand Joulin. Emerging properties in self-supervised vision transformers. In Proceedings of the IEEE/CVF international conference on computer vision, pages 9650–9660, 2021.   \n[6] Hong Chen, Yipeng Zhang, Simin Wu, Xin Wang, Xuguang Duan, Yuwei Zhou, and Wenwu Zhu. Disenbooth: Identity-preserving disentangled tuning for subject-driven text-to-image generation. arXiv preprint arXiv:2305.03374, 2023.   \n[7] Wenhu Chen, Hexiang Hu, Yandong Li, Nataniel Ruiz, Xuhui Jia, Ming-Wei Chang, and William W Cohen. Subject-driven text-to-image generation via apprenticeship learning. Advances in Neural Information Processing Systems, 36, 2024.   \n[8] Wenhu Chen, Hexiang Hu, Chitwan Saharia, and William W Cohen. Re-imagen: Retrievalaugmented text-to-image generator. arXiv preprint arXiv:2209.14491, 2022.   \n[9] Aakanksha Chowdhery, Sharan Narang, Jacob Devlin, Maarten Bosma, Gaurav Mishra, Adam Roberts, Paul Barham, Hyung Won Chung, Charles Sutton, Sebastian Gehrmann, et al. Palm: Scaling language modeling with pathways. Journal of Machine Learning Research, 24(240):1– 113, 2023.   \n[10] Dušan Djukic´, Vladimir Jankovic´, Ivan Matic´, and Nikola Petrovic´. The IMO compendium: a collection of problems suggested for the International Mathematical Olympiads: 1959-2004, volume 119. Springer, 2006.   \n[11] Ying Fan, Olivia Watkins, Yuqing Du, Hao Liu, Moonkyung Ryu, Craig Boutilier, Pieter Abbeel, Mohammad Ghavamzadeh, Kangwook Lee, and Kimin Lee. Reinforcement learning for finetuning text-to-image diffusion models. In Thirty-seventh Conference on Neural Information Processing Systems, 2023.   \n[12] Rinon Gal, Yuval Alaluf, Yuval Atzmon, Or Patashnik, Amit H Bermano, Gal Chechik, and Daniel Cohen-Or. An image is worth one word: Personalizing text-to-image generation using textual inversion. arXiv preprint arXiv:2208.01618, 2022.   \n[13] Jonathan Ho, Ajay Jain, and Pieter Abbeel. Denoising diffusion probabilistic models. Advances in neural information processing systems, 33:6840–6851, 2020.   \n[14] Chao Jia, Yinfei Yang, Ye Xia, Yi-Ting Chen, Zarana Parekh, Hieu Pham, Quoc Le, Yun-Hsuan Sung, Zhen Li, and Tom Duerig. Scaling up visual and vision-language representation learning with noisy text supervision. In International conference on machine learning, pages 4904–4916. PMLR, 2021.   \n[15] Bahjat Kawar, Shiran Zada, Oran Lang, Omer Tov, Huiwen Chang, Tali Dekel, Inbar Mosseri, and Michal Irani. Imagic: Text-based real image editing with diffusion models. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 6007–6017, 2023.   \n[16] Nupur Kumari, Bingliang Zhang, Richard Zhang, Eli Shechtman, and Jun-Yan Zhu. Multiconcept customization of text-to-image diffusion. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 1931–1941, 2023.   \n[17] Ilya Loshchilov and Frank Hutter. Decoupled weight decay regularization. arXiv preprint arXiv:1711.05101, 2017.   \n[18] Long Ouyang, Jeffrey Wu, Xu Jiang, Diogo Almeida, Carroll Wainwright, Pamela Mishkin, Chong Zhang, Sandhini Agarwal, Katarina Slama, Alex Ray, et al. Training language models to follow instructions with human feedback. Advances in neural information processing systems, 35:27730–27744, 2022.   \n[19] Alec Radford, Jong Wook Kim, Chris Hallacy, Aditya Ramesh, Gabriel Goh, Sandhini Agarwal, Girish Sastry, Amanda Askell, Pamela Mishkin, Jack Clark, et al. Learning transferable visual models from natural language supervision. In International conference on machine learning, pages 8748–8763. PMLR, 2021.   \n[20] Rafael Rafailov, Joey Hejna, Ryan Park, and Chelsea Finn. From $r$ to $q^{*}$ : Your language model is secretly a q-function. arXiv preprint arXiv:2404.12358, 2024.   \n[21] Rafael Rafailov, Archit Sharma, Eric Mitchell, Christopher D Manning, Stefano Ermon, and Chelsea Finn. Direct preference optimization: Your language model is secretly a reward model. Advances in Neural Information Processing Systems, 36, 2024.   \n[22] Robin Rombach, Andreas Blattmann, Dominik Lorenz, Patrick Esser, and Björn Ommer. Highresolution image synthesis with latent diffusion models. In Proceedings of the IEEE/CVF conference on computer vision and pattern recognition, pages 10684–10695, 2022.   \n[23] Nataniel Ruiz, Yuanzhen Li, Varun Jampani, Yael Pritch, Michael Rubinstein, and Kfir Aberman. Dreambooth: Fine tuning text-to-image diffusion models for subject-driven generation. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 22500–22510, 2023.   \n[24] Chitwan Saharia, William Chan, Saurabh Saxena, Lala Li, Jay Whang, Emily L Denton, Kamyar Ghasemipour, Raphael Gontijo Lopes, Burcu Karagol Ayan, Tim Salimans, et al. Photorealistic text-to-image diffusion models with deep language understanding. Advances in neural information processing systems, 35:36479–36494, 2022.   \n[25] Christoph Schuhmann, Romain Beaumont, Richard Vencu, Cade Gordon, Ross Wightman, Mehdi Cherti, Theo Coombes, Aarush Katta, Clayton Mullis, Mitchell Wortsman, et al. Laion5b: An open large-scale dataset for training next generation image-text models. Advances in Neural Information Processing Systems, 35:25278–25294, 2022.   \n[26] Jascha Sohl-Dickstein, Eric Weiss, Niru Maheswaranathan, and Surya Ganguli. Deep unsupervised learning using nonequilibrium thermodynamics. In International conference on machine learning, pages 2256–2265. PMLR, 2015.   \n[27] Jiaming Song, Chenlin Meng, and Stefano Ermon. Denoising diffusion implicit models. In International Conference on Learning Representations, 2021.   \n[28] Yang Song and Stefano Ermon. Generative modeling by estimating gradients of the data distribution. Advances in neural information processing systems, 32, 2019.   \n[29] Yang Song, Jascha Sohl-Dickstein, Diederik P Kingma, Abhishek Kumar, Stefano Ermon, and Ben Poole. Score-based generative modeling through stochastic differential equations. arXiv preprint arXiv:2011.13456, 2020.   \n[30] Bram Wallace, Meihua Dang, Rafael Rafailov, Linqi Zhou, Aaron Lou, Senthil Purushwalkam, Stefano Ermon, Caiming Xiong, Shafiq Joty, and Nikhil Naik. Diffusion model alignment using direct preference optimization. arXiv preprint arXiv:2311.12908, 2023.   \n[31] Yuxiang Wei, Yabo Zhang, Zhilong Ji, Jinfeng Bai, Lei Zhang, and Wangmeng Zuo. Elite: Encoding visual concepts into textual embeddings for customized text-to-image generation. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 15943– 15953, 2023.   \n[32] Hu Ye, Jun Zhang, Sibo Liu, Xiao Han, and Wei Yang. Ip-adapter: Text compatible image prompt adapter for text-to-image diffusion models. arXiv preprint arXiv:2308.06721, 2023. ", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "[33] Yuxuan Zhang, Yiren Song, Jiaming Liu, Rui Wang, Jinpeng Yu, Hao Tang, Huaxia Li, Xu Tang, Yao Hu, Han Pan, et al. Ssr-encoder: Encoding selective subject representation for subjectdriven generation. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 8069–8078, 2024. ", "page_idx": 12}, {"type": "text", "text": "A Appendix ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "A.1 Background ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "Reinforcement Learning. In Reinforcement Learning (RL), the environment can be formalized as a Markov Decision Process (MDP). An MDP is defined by a tuple $(S,A,P,R,\\rho_{0},T)$ , where $\\boldsymbol{S}$ is the state space, $\\boldsymbol{\\mathcal{A}}$ is the action space, $P$ is the transition function, $R$ is the reward function, $\\rho_{0}$ is the distribution over initial states, and $T$ is the time horizon. At each timestep $t$ , the agent observes a state $\\mathbf{s}_{t}$ and selects an action ${\\bf a}_{t}$ according to a policy $\\pi(\\mathbf{a}_{t}|\\mathbf{s}_{t})$ , and obtains a reward $R(\\mathbf{s}_{t},\\mathbf{a}_{t})$ , and then transit to a next state $\\mathbf{s}_{t+1}\\sim P(\\mathbf{s}_{t+1}|\\mathbf{s}_{t},\\mathbf{a}_{t})$ . As the agent interacts with the MDP, it produces a sequence of states and actions, which is denoted as a trajectory $\\tau=(\\mathbf{s}_{0},\\mathbf{a}_{0},\\mathbf{s}_{1},\\mathbf{a}_{1},\\ldots,\\mathbf{s}_{T-1},\\mathbf{a}_{T-1})$ . The RL objective is to maximize the expected value of cumulative reward over the trajectories sample from its policy: ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\mathbb{E}_{\\tau\\sim p^{\\pi}(\\pmb{\\tau})}\\left[\\sum_{t=0}^{T-1}R(\\mathbf{s}_{t},\\mathbf{a}_{t})\\right]\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "Diffusion models. [26, 13, 29] consider a variance schedule $\\{\\beta_{t}\\}_{t=1}^{T}$ . For each data point $\\mathbf{x}_{0}\\mathbf{\\Sigma}\\sim\\ p_{\\mathrm{data}}(\\mathbf{x}_{0})$ , a Markov chain is constructed by transition prob√ability $\\begin{array}{r l r}{p(\\mathbf{x}_{t}}&{{}|}&{\\mathbf{x}_{t-1})}&{=}\\end{array}$ $\\mathcal{N}(\\mathbf{x}_{t};\\sqrt{1-\\beta_{t}}\\mathbf{x}_{t-1},\\beta_{t}\\mathbf{I})$ . Consequently, $\\begin{array}{r}{p_{\\alpha_{t}}(\\mathbf{x}_{t}\\mid\\mathbf{\\dot{\\deltax}_{0}})\\;=\\;\\mathcal{N}(\\bar{\\mathbf{x}}_{t};\\sqrt{\\alpha_{t}}\\mathbf{x}_{0},(1-\\mathbf{\\dot{\\delta}}\\alpha_{t})\\mathbf{I})}\\end{array}$ , where $\\begin{array}{r}{\\alpha_{t}\\,=\\,\\prod_{t^{\\prime}=1}^{t}(1\\,-\\,\\beta_{t})}\\end{array}$ . [28, 29] show that training diffusion models, $\\epsilon_{\\theta}(\\mathbf{x}_{t},t)$ , is equivalent to score matching, i.e., training a score function $\\mathbf{s}_{\\theta}(\\mathbf{x}_{t},t)$ : ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\begin{array}{r l}&{\\quad\\mathbb{E}_{t\\sim\\mathcal{U}\\{1,\\dots,T\\},\\mathbf{x}_{0}\\sim p_{\\mathrm{dat}},\\mathbf{x}_{t}\\sim p_{\\alpha_{t}}(\\mathbf{x}_{t})}\\left[\\|\\nabla_{\\mathbf{x}_{t}}\\log p_{\\alpha_{t}}(\\mathbf{x}_{t}\\mid\\mathbf{x}_{0})-\\mathbf{s}_{\\theta}(\\mathbf{x}_{t},t)\\|_{2}^{2}\\right]}\\\\ &{=\\!\\mathbb{E}_{t\\sim\\mathcal{U}\\{1,\\dots,T\\},\\mathbf{x}_{0}\\sim p_{\\mathrm{dat}},\\mathbf{x}_{t}\\sim p_{\\alpha_{t}}(\\mathbf{x}_{t}|\\mathbf{x}_{0})}\\left[\\left\\|-\\frac{1}{1-\\alpha_{t}}(\\mathbf{x}_{t}-\\sqrt{\\alpha_{t}}\\mathbf{x}_{0})-\\mathbf{s}_{\\theta}(\\mathbf{x}_{t},t)\\right\\|_{2}^{2}\\right]}\\\\ &{=\\!\\mathbb{E}_{t\\sim\\mathcal{U}\\{1,\\dots,T\\},\\mathbf{x}_{0}\\sim p_{\\mathrm{dat}},\\epsilon\\sim\\mathcal{N}(\\mathbf{0},\\mathbf{I})}\\left[\\left\\|-\\sqrt{1-\\alpha_{t}}\\epsilon-\\mathbf{s}_{\\theta}(\\mathbf{x}_{t},t)\\right\\|_{2}^{2}\\right]\\cdot\\mathbf{\\hat{x}}_{t}=\\sqrt{\\alpha_{t}}\\mathbf{x}_{0}+\\sqrt{1-\\alpha_{t}}\\epsilon}\\\\ &{=\\!\\mathbb{E}_{t\\sim\\mathcal{U}\\{1,\\dots,T\\},\\mathbf{x}_{0}\\sim p_{\\mathrm{dat}},\\epsilon\\sim\\mathcal{N}(\\mathbf{0},\\mathbf{I})}\\left[\\left(1-\\alpha_{t}\\right)\\|\\epsilon_{\\theta}(\\mathbf{x}_{t},t)-\\epsilon\\right\\|_{2}^{2}\\right]\\quad\\mathrm{let}\\,\\epsilon_{\\theta}(\\mathbf{x}_{t},t):=-\\frac{\\mathbf{s}_{\\theta}(\\mathbf{x}_{t},t)}{\\sqrt{1-\\alpha_{t}}}}\\\\ &{=\\!\\mathbb{E}_{t\\sim\\mathcal{U}\\{1,\\dots,T\\},\\mathbf{x}_{0}\\sim p_{\\mathrm{dat}},\\epsilon\\sim\\mathcal{N}(\\mathbf{0},\\mathbf{I})}\\left[\\omega(t)\\right\\|\\epsilon_{\\theta}(\\mathbf{x}_{t},t)-\\epsilon\\|_{2}^{2}\\right],\\quad\\\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "Diffusion MDP We formalize the denoising process as the following Diffusion MDP: ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\mathbf{s}_{T-t}=(\\mathbf{x}_{t},\\mathbf{c}),\\quad\\mathbf{a}_{T-t}=\\mathbf{x}_{t-1},\\quad\\pi_{\\theta}(\\mathbf{a}_{T-t}\\mid\\mathbf{s}_{T-t})=p_{\\theta}(\\mathbf{x}_{t-1}\\mid\\mathbf{x}_{t},\\mathbf{c}),}\\end{array}\n$$", "text_format": "latex", "page_idx": 13}, {"type": "equation", "text": "$$\n\\rho_{0}=p(\\mathbf{c})\\times\\mathcal{N}(\\mathbf{0},\\mathbf{I}),\\quad R(\\mathbf{s}_{T-t},\\mathbf{a}_{T-t})=R(\\mathbf{x}_{t},\\mathbf{x}_{t-1},\\mathbf{c})=\\binom{r(\\mathbf{x}_{0},\\mathbf{c})}{0}\\times\\mathbf{\\sigma}_{\\mathrm{otherwise}}^{\\mathrm{if}}\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "where $r(\\mathbf{x}_{0},\\mathbf{c})$ can be a reward signal for the denoised image. The transition kernel is deterministic, i.e., $\\begin{array}{r}{\\mathbf{\\Pi}^{P}(\\mathbf{s}_{T-t+1}\\mid\\mathbf{s}_{T-t},\\mathbf{a}_{T-t})=(\\mathbf{a}_{T-t},\\mathbf{c})=(\\mathbf{x}_{t-1},\\mathbf{c})}\\end{array}$ . For brevity, the trajectory $\\tau$ is defined by $(\\mathbf{x}_{0},\\mathbf{x}_{1},\\dots,\\mathbf{x}_{T})$ . Hence, the trajectory distribution for given diffusion models can be denoted as the joint distribution $p_{\\pmb{\\theta}}(\\mathbf{x}_{0:T}\\mid\\mathbf{c})$ . In particular, the RL objective function for finetuning diffusion models can be re-written as the following optimization problem: ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\mathbb{E}_{\\mathbf{x}_{0:T}\\sim p_{\\theta}(\\mathbf{x}_{0:T}|\\mathbf{c})}\\left[\\sum_{t=1}^{T}R(\\mathbf{x}_{t},\\mathbf{x}_{t-1},\\mathbf{c})-\\beta\\mathbb{D}_{\\mathrm{KL}}(p_{\\theta}(\\mathbf{x}_{t-1}\\mid\\mathbf{x}_{t},\\mathbf{c})||p_{\\mathrm{base}}(\\mathbf{x}_{t-1}\\mid\\mathbf{x}_{t},\\mathbf{c}))\\right],\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "where $\\beta$ is a hyperparameter controlling the KL-divergence between the finetune model $p_{\\theta}$ and the base model $p_{\\mathrm{{base}}}$ . This constraint prevents the learned model from losing generation diversity and falling into ’mode collapse’ due to a single high cumulative reward result. In practice, this KL-divergence has become a standard constraint in large language model finetuning [1, 18, 21]. ", "page_idx": 13}, {"type": "text", "text": "Given preference labels and following the Direct Preference Optimization (DPO) framework [30, 21, 20], we can approximate the optimal policy $p^{*}$ by minimizing the upper bound: ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathbb{E}_{\\mathbf{x}_{0}^{+},\\mathbf{x}_{0}^{-},t,\\mathbf{x}_{t}^{+},\\mathbf{x}_{t}^{-}}\\Bigg[-\\log\\sigma\\bigg(\\beta\\big(\\|\\epsilon_{\\mathrm{base}}(\\mathbf{x}_{t}^{+},\\mathbf{c},t)-\\epsilon_{t}^{+}\\|_{2}^{2}-\\|\\epsilon_{\\theta}(\\mathbf{x}_{t}^{+},\\mathbf{c},t)-\\epsilon^{+}\\|_{2}^{2}}\\\\ &{\\qquad\\qquad\\qquad\\qquad-\\left(\\|\\epsilon_{\\mathrm{base}}(\\mathbf{x}_{t}^{-},\\mathbf{c},t)-\\epsilon_{t}^{-}\\|_{2}^{2}-\\|\\epsilon_{\\theta}(\\mathbf{x}_{t}^{-},\\mathbf{c},t)-\\epsilon^{-}\\|_{2}^{2}\\right)\\!\\bigg)\\Bigg],}\\end{array}\n$$", "text_format": "latex", "page_idx": 13}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/902b82d6422ff6ebc6f908528d6aee6f4404ccbe4e5b3dfee26492f9c371ef45.jpg", "img_caption": ["Figure 6: Training prompts for objects and live subjects. "], "img_footnote": [], "page_idx": 14}, {"type": "table", "img_path": "TWeVQ5meMW/tmp/abb5276711de3ab7b59d603b78ac91cc75d6bedd5e483e59a5727738e79c811f.jpg", "table_caption": ["Table 4: RPO Hyperparameters "], "table_footnote": [], "page_idx": 14}, {"type": "text", "text": "where $\\epsilon^{+}$ and $\\epsilon^{-}$ are independent samples from a Gaussian distribution, $\\mathbf{x}_{t}^{+}$ and $\\mathbf{x}_{t}^{-}$ are perturbed versions of $\\mathbf{x}_{0}^{+}$ and $\\mathbf{x}_{t}^{-}$ that depend on $\\epsilon^{+}$ and $\\epsilon^{-}$ , and $\\mathbf{x}_{0}^{+}$ is preferred to $\\mathbf{x}_{0}^{-}$ . A detailed derivation can be found in [30]. ", "page_idx": 14}, {"type": "text", "text": "A.2 Experimental Details ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Training Prompts. We collect 8 training prompts: 6 re-contextualization, 1 property modification and 1 artistic style transfer for objects. 5 re-contextualization, 1 attribute editing, 1 artistic style transfer and 1 accessorization for live subjects. The trainig prompts are shown in Figure 6. ", "page_idx": 14}, {"type": "text", "text": "Experimental Setup During training we use $\\lambda_{\\mathrm{train}}=0$ for the $\\lambda$ -Harmonic reward function to generate the preference labels. We evaluate the model performance by $\\lambda_{\\mathrm{val}}$ -Harmonic per 40 gradient steps during training time and save the checkpoint that achieve the highest validation reward. Table 4 lists the common hyperparameters used in the generating skill set and the $\\lambda_{\\mathrm{val}}$ used in the default setting. ", "page_idx": 14}, {"type": "text", "text": "A.3 Additional Comparisons ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Comparison to DreamBooth and SuTI. We observe RPO that can be faithful to both reference images and the input prompt. To investigate whether RPO can provide better quality than DreamBooth and SuTI, we follow SuTI paper and pick the robot toy as an example to demonstrate the effectiveness of RPO (Figure 7). In this example, DreamBooth is faithful to the reference image but it does not provide a good text-to-image alignment. SuTI provides an result that is fidelty to textual prompt. However, SuTI lacks fidelity to the reference image, i.e., the robot should stand with its wheels instead of legs. [7] use DreamBooth to finetune SuTI (Dream-SuTI) further to solve this failure case. Instead, RPO can generate an image not only faithful to the reference images but also align well with the input prompts. ", "page_idx": 14}, {"type": "text", "text": "Comparison to different ${\\lambda}_{\\mathbf{val}}$ . We have also added more samples for comparison of different $\\lambda_{\\mathrm{val}}$ values (see Figure 8). We find that $\\lambda_{\\mathrm{val}}=0.5$ encourages the learned model to retain output diversity while still aligning with textual prompts. However, the generated images invariably contain a sofa, which is unrelated to the subject images. This occurs because every training image includes a sofa. A large $\\lambda_{\\mathrm{val}}$ weakens the regularization strength and leads to overftiting. Nevertheless, a small value of $\\lambda_{\\mathrm{val}}$ can potentially eliminate background bias. We highlight that this small $\\lambda_{\\mathrm{val}}$ not only encourages diversity but also mitigates background bias in identity preservation and enables the model to focus on the subject. ", "page_idx": 14}, {"type": "table", "img_path": "TWeVQ5meMW/tmp/7197d3c6ccc720bd4ea094274b1213143ec61015a9c28b4d4c94b7fb277b94dc.jpg", "table_caption": ["Table 5: Different $\\lambda_{\\mathrm{train}}$ -Harmonic reward comparison for evaluating fidelity over multiple subjects and prompts. "], "table_footnote": [], "page_idx": 15}, {"type": "table", "img_path": "TWeVQ5meMW/tmp/8d4e734eebe874d7ae68b058a9a4dd59b80f7c62b2f874484b5b3ea0a3f266f7.jpg", "table_caption": ["Table 6: Comparison for harmonic mean and arithmetic mean reward function. "], "table_footnote": [], "page_idx": 15}, {"type": "text", "text": "", "page_idx": 15}, {"type": "text", "text": "Comparison to different $\\lambda_{\\mathbf{train}}$ . During our experiments, we use the default value for $\\lambda_{\\mathrm{train}}=0$ . Thus, we also investigate how different $\\lambda_{\\mathrm{train}}$ will effect the performance of RPO. We test three different values of $\\lambda_{\\mathrm{train}}\\,=\\,\\{0.3,0.5,0.7\\}$ and report their results in DreamBench (Table 5). We observe that the image-to-image alignment increases with larger , but the text-to-image alignment decreases because the preference model tends to favor alignment with reference images and ignores the prompt alignment. ", "page_idx": 15}, {"type": "text", "text": "Comparison to different Pythagorean means. Further, we examine different Pythagorean means of ALIGN-I and ALIGN-T scores. We replace the harmonic mean as the arithmetic mean and test three different $\\lambda_{\\mathrm{val}}=\\{0.3,0.5,0.7\\}$ . We report the results of the arithmetic mean reward in Table 6. The arithmetic mean is not very sensitive to smaller values; it tends to maximize higher values to achieve a better final score. In practice, ALIGN-I will receive a higher value (this effect can be seen from CLIP-I and CLIP-T in Tables 1 to 3). Thus, the model will tend to optimize image-to-image alignment and achieve good results on DINO and CLIP-I but have a lower score for text-to-image alignment. ", "page_idx": 15}, {"type": "text", "text": "Comparison to DPO The original DPO is not suitable for subject-driven tasks because the datasets do not contain preference labels. We introduce the $\\lambda$ -harmonic function and design a variant of DPO for this task. We implement a DPO diffusion [30] (without similarity loss) using preference labels for image-to-image similarity and text-to-image alignment. We choose $\\lambda_{\\mathrm{train}}\\,=\\,0.5$ since this value assigns equal weights to the image-to-image similarity and text-to-image alignment. For a fair comparison, we also repost the results from RPO with the same $\\lambda_{\\mathrm{train}}$ value. The results on DreamBench for these two methods are shown in Table 7. These results show that DPO can capture the text-to-image alignment from the preference labels. However, without $\\mathcal{L}_{\\mathrm{sim}}$ , DPO faces a significant overftiting problem; i.e., it achieves high text-to-image alignment but cannot preserve the subject’s unique features. ", "page_idx": 15}, {"type": "text", "text": "Aesthetic comparison. Limited evaluation metrics are a common issue in subject-driven tasks. In Table 8, we report the average aesthetic scores [25] of the real reference images in DreamBench and the average aesthetic scores obtained with the best CLIP I/T $\\lambda$ configuration $\\lambda_{\\mathrm{val}}\\,=\\,0.5)$ in DreamBench. We observe that RPO does not decrease the quality of images. Instead, the generated images achieve slightly better quality than the reference images. ", "page_idx": 15}, {"type": "text", "text": "Table 7: DPO comparison for evaluating fidelity over multiple subjects and prompts on DreamBench ", "page_idx": 16}, {"type": "table", "img_path": "TWeVQ5meMW/tmp/0ec94a0ffaddb399632c16326923daec9dc911e866c23b768c160d0238648d50.jpg", "table_caption": [], "table_footnote": [], "page_idx": 16}, {"type": "text", "text": "Table 8: Aesthetic score comparison for the real reference images and RPO generated images ", "page_idx": 16}, {"type": "table", "img_path": "TWeVQ5meMW/tmp/7f7914efe4a8488ed353ac13fd6934344c4621907f7deae857b540f12cac8ba8.jpg", "table_caption": [], "table_footnote": [], "page_idx": 16}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/86e08d2fdca5eedc0d6f87c037e37648439c565c0cd860f7d861e5222bc3cdf5.jpg", "img_caption": ["Figure 7: Comparison between DreamBooth, SuTI, Dream-SuTI, and RPO, adapted from [7] "], "img_footnote": [], "page_idx": 16}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/364db4a0bf661e8bd82d19f95fbde104cca207a22316f9d074fd67a9cb07e649.jpg", "img_caption": ["Figure 8: Additional samples of different $\\lambda_{\\mathrm{val}}$ . A small $\\lambda_{\\mathrm{val}}$ leads to more diverse generated images. "], "img_footnote": [], "page_idx": 16}, {"type": "text", "text": "A.4 Limitations ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Figure 9 illustrates some failure examples of RPO. The first issue is context-appearance entanglement. In Figure 9, the learned model correctly understands the keyword blue house; however, the appearance of the subject is also altered by this context, e.g. the color of the backpack has changed, and there is a house pattern on the backpack. The second issue is incorrect contextual integration. We conjecture that this failure is due to the rarity of the textual prompt. For instance, imagining a cross between a chow chow and a tiger is challenging, even for humans. Third, although RPO provides regularization, it still cannot guarantee the avoidance of overfitting. As shown in Figure 9, this may be because, to some extent, the visual appearance of sand and bed sheets is similar, which has led to overfitting issues in the model. ", "page_idx": 17}, {"type": "text", "text": "A.5 Future Work ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "The overfitting failure case leads to a future work direction: can online RL improve regularization and avoid overftiting? The second direction for future work involves implementing the LoRA version for RPO and comparing it to LoRA DreamBooth. Last but not least, we aim to identify or construct open-source, subject-driven datasets for comparison. Currently, DreamBench is the only open-source dataset we can access and evaluate for model performance. Nevertheless, we should create a larger dataset that includes more diverse subjects to verify the effectiveness of different algorithms. ", "page_idx": 17}, {"type": "text", "text": "A.6 Broader Impacts ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "The nature of generative image models is inherently subjected to criticism on the issue of privacy, security and ethics in the presence of nefarious actors. However, the core of this paper remains purely on an academic mission to extend the boundaries of generative models. The societal consequences of democratizing such powerful generative models is more thoroughly discussed in other papers. For example, Bird et al. outlines the classes of risks in text-to-image models [2] in greater detail and should be directed to such papers. Nevertheless, we play our part in the management of such risks by avoiding the use of identifiable parts of humans in the reference sets. ", "page_idx": 17}, {"type": "text", "text": "A.7 Skill Set ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "The skill set of the RPO-trained model is varied and includes re-contextualization (Figure 10), artistic style generation (Figure 11), expression modification (Figure 12), subject accessorization (Figure 13), color editing (Figure 14), multi-view rendering (Figure 15), novel hybrid synthesis (Figure 16), and novel prompt generation (Figure 17). ", "page_idx": 17}, {"type": "text", "text": "Context-apperance entanglement ", "text_level": 1, "page_idx": 18}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/c5ac5127af671d8884b619d57b8eff9a3d6f20aec1349e230e234ed50e9bca40.jpg", "img_caption": ["Incorrect contextual integration "], "img_footnote": [], "page_idx": 18}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/3716d2f751cea9ebc0380016b583fd21b1cef7e0bb029e09bd8e038ca30b65e0.jpg", "img_caption": ["Figure 9: RPO’s failure modes include: (1) The context and the appearance of the subject becoming entangled. (2) The trained model failing to generate an image with respect to the input prompt. (3) The trained model still overfitting to the training set. "], "img_footnote": [], "page_idx": 18}, {"type": "text", "text": "Reference Images ", "text_level": 1, "page_idx": 19}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/450744f579b2e729e5ed5ac951506630f5e8f2b1cd6abbaebd4bd06b8ee01511.jpg", "img_caption": ["Figure 10: Re-contextualization samples from the RPO algorithm. RPO is able to generate images of specific subjects in unseen environments while preserving the identity and details of the subjects and be faithful to the input prompts. Reference images are shown on the left. We display the generated images along with their textual prompts on the right. "], "img_footnote": [], "page_idx": 19}, {"type": "text", "text": "Reference Images ", "text_level": 1, "page_idx": 19}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/191f4de7a1945db67581cb85b2945615ef7286fbed3c4811fbc300e5f90cfa44.jpg", "img_caption": [], "img_footnote": [], "page_idx": 19}, {"type": "text", "text": "Figure 11: Artistic style rendition samples from the RPO algorithm. These art renditions can be applied to a dog given a prompt of $\\bullet\\bullet_{\\mathtt{a}}$ [painter] styled painting of a [V] ${\\tt d o g^{,}}^{,}$ . The identity of the subject is preserved and faithfully imitates the style of famous painters. ", "page_idx": 19}, {"type": "text", "text": "Reference Images ", "text_level": 1, "page_idx": 19}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/a36b0e2a61e2a3f0eee90bd03fc285985fb9bbc8f72178127493ed1174897583.jpg", "img_caption": [], "img_footnote": [], "page_idx": 19}, {"type": "text", "text": "Figure 12: Expression modification samples from the RPO algorithm. RPO can integrate subject with various unseen expressions in the reference images. We also notice the pose of generated images, e.g., a [V] sleepy dog, were not displayed in the training set. ", "page_idx": 19}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/f0e4a1a0bf98bbec73f67d37ab1d4b38789874886b763fd50265f15f7024d8a4.jpg", "img_caption": [], "img_footnote": [], "page_idx": 20}, {"type": "text", "text": "Figure 13: Accessories samples from the RPO algorithm. Conditioned the prompts, $\\mathfrak{s}\\mathfrak{a}$ [V] chow chow wearing a [target outfit]”, the generated images retains the unique features of the reference images, e.g., the hair color and breed of the subject dog. The interaction between subject dog and the outfits is realistic. ", "page_idx": 20}, {"type": "text", "text": "", "text_level": 1, "page_idx": 20}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/cee5cb2884a0610e08642552499407affb2b0053418047274570a080ddbd6057.jpg", "img_caption": [], "img_footnote": [], "page_idx": 20}, {"type": "text", "text": "Figure 14: Color editing samples from the RPO algorithm. We display color modifications using prompts such as $\\bullet\\bullet_{\\mathtt{a}}$ [target color] [V] monster toy”. The identity of the subject is preserved. ", "page_idx": 20}, {"type": "text", "text": "Reference Images ", "text_level": 1, "page_idx": 20}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/8e917383a3d7a626a284ddfb748470d14c74cc6a881ff8ed2ebead6e3fb8dc28.jpg", "img_caption": [], "img_footnote": [], "page_idx": 20}, {"type": "text", "text": "Figure 15: Multi-view samples from the RPO algorithm. We generate images from specified viewpoints of the subject. For the top and bottom views, we use the prompts $\\bullet\\bullet_{\\mathtt{a}}$ [V] cat looking up/down at the camera”. For the back and side views, we apply the prompts $\\bullet\\bullet_{\\mathtt{a}}$ back/side view of a [V] cat”. ", "page_idx": 20}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/4a6920373ef9da4a9816b57d4feb2172a1e594517b08c387c94e15559ae098bc.jpg", "img_caption": [], "img_footnote": [], "page_idx": 21}, {"type": "text", "text": "Figure 16: Novel hybrid synthesis samples from the RPO algorithm. We apply the prompts $\\mathfrak{s}\\mathfrak{a}$ cross of a [V] chow chow and [target species]” to the RPO-trained model to generate these images. We highlight that RPO can synthesize new hybrids that retain the identity of the subject chow chow and perform property modifications. ", "page_idx": 21}, {"type": "image", "img_path": "TWeVQ5meMW/tmp/6719d165e729809c09e4dcc1b0c26b3737d4765a5eaf088c61d4ff81c3fd3524.jpg", "img_caption": ["avibrantcoralreefsurroundedbyexoticmarinelife\" "], "img_footnote": [], "page_idx": 21}, {"type": "text", "text": "Figure 17: Novel prompts results from the RPO-trained model. We use ChatGPT to create 4 different highly imaginative prompts for a specific dog. We select 4 images for each prompt. The results demonstrate the generalization capability of RPO for handling novel prompts. ", "page_idx": 21}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "The checklist is designed to encourage best practices for responsible machine learning research, addressing issues of reproducibility, transparency, research ethics, and societal impact. Do not remove the checklist: The papers not including the checklist will be desk rejected. The checklist should follow the references and follow the (optional) supplemental material. The checklist does NOT count towards the page limit. ", "page_idx": 22}, {"type": "text", "text": "Please read the checklist guidelines carefully for information on how to answer these questions. For each question in the checklist: ", "page_idx": 22}, {"type": "text", "text": "• You should answer [Yes] , [No] , or [NA] .   \n• [NA] means either that the question is Not Applicable for that particular paper or the relevant information is Not Available.   \n• Please provide a short (1–2 sentence) justification right after your answer (even for NA). ", "page_idx": 22}, {"type": "text", "text": "The checklist answers are an integral part of your paper submission. They are visible to the reviewers, area chairs, senior area chairs, and ethics reviewers. You will be asked to also include it (after eventual revisions) with the final version of your paper, and its final version will be published with the paper. ", "page_idx": 22}, {"type": "text", "text": "The reviewers of your paper will be asked to use the checklist as one of the factors in their evaluation. While \"[Yes] \" is generally preferable to \"[No] \", it is perfectly acceptable to answer \"[No] \" provided a proper justification is given (e.g., \"error bars are not reported because it would be too computationally expensive\" or \"we were unable to find the license for the dataset we used\"). In general, answering \"[No] \" or \"[NA] \" is not grounds for rejection. While the questions are phrased in a binary way, we acknowledge that the true answer is often more nuanced, so please just use your best judgment and write a justification to elaborate. All supporting evidence can appear either in the main paper or the supplemental material, provided in appendix. If you answer [Yes] to a question, in the justification please point to the section(s) where related material for the question can be found. ", "page_idx": 22}, {"type": "text", "text": "IMPORTANT, please: ", "page_idx": 22}, {"type": "text", "text": "• Delete this instruction block, but keep the section heading “NeurIPS paper checklist\", • Keep the checklist subsection headings, questions/answers and guidelines below. • Do not modify the questions and only use the provided macros for your answers. ", "page_idx": 22}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 22}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Justification: The scope and contributions are clearly defined in the abstract and introduction. Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 22}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? Answer: [Yes] ", "page_idx": 22}, {"type": "text", "text": "Justification: The limitations of our technique is discussed in the Appendix where we show certain cases that are not desirable. ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 23}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 23}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 23}, {"type": "text", "text": "Justification: Our works focus on the experimental/empirical performance of subject-driven generation only. Due to the page constraints and the scope, we decided not to pursue theoretical results for now. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 23}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: The details are mentioned in the Appendix A.2 where it states specific configurations needed to reproduce the main experiments, including the prompts. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 24}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Justification: Our paper uses the DreamBench dataset for the experiments, which is publicly available for anyone interested in reproducing the main results. The code will be submitted as a ZIP file. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why. ", "page_idx": 24}, {"type": "text", "text": "• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable). • Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 25}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "Justification: The details are mentioned in the Appendix A.2. In Table 3, the $\\lambda$ which is an important hyperparameter in our experiments, is stated along with the metrics. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 25}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "Justification: Experiments are conducted for each subject across various prompts, where a metric is computed individually. The standard deviation over all prompts and subjects is provided in the ablation study in the experiment section. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 25}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "Justification: The compute resources used in this paper is described in Method section. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 26}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 26}, {"type": "text", "text": "Justification: For our research and experiments, we use public datasets and models that have been used in prior published works. Our research does not involve direct interaction with human subjects. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 26}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Justification: Given the nature of our research, it necessitates the general discussion of the potential negative societal impacts which takes place in Appendix A.6. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed.   \n• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 26}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 27}, {"type": "text", "text": "Answer: [No] ", "page_idx": 27}, {"type": "text", "text": "Justification: Safeguards would fall outside the scope of our research and we mainly focus on subjects that are inanimate. No experiments explicitly use personally identifiable features of humans as a subject. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 27}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 27}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 27}, {"type": "text", "text": "Justification: The authors of Stable Diffusion, DreamBench and SuTI are cited and credited in this paper. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 27}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 27}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 27}, {"type": "text", "text": "Justification: The asset mainly consist of code which contains instruction on how to run it. Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets. • Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc. ", "page_idx": 27}, {"type": "text", "text": "• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 28}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 28}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 28}, {"type": "text", "text": "Justification: We do not crowdsource images by ourselves; we use images from DreamBench which has been vetted through. ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 28}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 28}, {"type": "text", "text": "Answer: [NA] ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Justification: As mentioned previously, there is no crowdsourcing involved. ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 28}]