[{"figure_path": "lpxdG0hk4H/tables/tables_7_1.jpg", "caption": "Table 1: Quantitative results of our approach compared with SOTAs. Our method achieves the best performance on image quality, temporal consistency, and motion precision.", "description": "This table presents a quantitative comparison of the proposed ShowMaker model against several state-of-the-art (SOTA) methods for 2D human video generation.  The comparison uses several metrics to evaluate the performance, including SSIM (Structural Similarity Index) and PSNR (Peak Signal-to-Noise Ratio) for image quality, FID (Fréchet Inception Distance) and FVD (Fréchet Video Distance) for video quality and temporal consistency, and three separate metrics (Lbody, Lface, Lhand) for the accuracy of body, face and hand motion respectively.  The results demonstrate ShowMaker's superiority across all aspects of 2D human video generation.", "section": "4.2 Comparison with Other Methods"}, {"figure_path": "lpxdG0hk4H/tables/tables_8_1.jpg", "caption": "Table 2: Ablation analysis of HM, FR, and two-stage training.", "description": "This table presents the ablation study results by removing different components in the proposed ShowMaker framework.  The metrics used are FVD (Fréchet Video Distance), Lface (mean Euclidean distance between face keypoints), and Lhand (mean Euclidean distance between hand keypoints). Removing the Key Point-based Fine-grained Hand Modeling module (HM) increases the FVD and Lhand.  Removing the Face Recapture module (FR) increases Lface.  Omitting the two-stage training significantly increases the FVD. The results demonstrate the effectiveness of each component in improving the overall performance of the model.", "section": "4.3 Ablation Study"}, {"figure_path": "lpxdG0hk4H/tables/tables_8_2.jpg", "caption": "Table 1: Quantitative results of our approach compared with SOTAs. Our method achieves the best performance on image quality, temporal consistency, and motion precision.", "description": "This table presents a quantitative comparison of the proposed ShowMaker method against several state-of-the-art (SOTA) approaches for 2D human video generation.  The comparison uses several metrics to evaluate different aspects of video generation quality.  SSIM and PSNR measure image quality; FID and FVD assess the quality and temporal consistency of the generated videos; and Lbody, Lface, and Lhand quantify the accuracy of body, face, and hand motion in the generated videos. The results demonstrate that ShowMaker outperforms the SOTA methods across all metrics, particularly in terms of motion accuracy and temporal consistency. ", "section": "4.2 Comparison with Other Methods"}, {"figure_path": "lpxdG0hk4H/tables/tables_14_1.jpg", "caption": "Table 4: Dataset details. ID1-7 are datasets recorded indoors. Seth and Oliver belong to the talkshow dataset. All training and test sets do not overlap.", "description": "This table shows the number of video clips used for training and testing in the ShowMaker experiment.  Seven indoor datasets (ID1-ID7) and two talkshow datasets (Seth and Oliver) were used.  The table indicates that the training and testing sets are mutually exclusive and do not share any overlapping data.", "section": "4.1 Experimental Settings"}]