[{"figure_path": "8JmUmTgKiY/figures/figures_0_1.jpg", "caption": "Figure 1: A schematic depiction of how the Generalized Kolmogorov-Smirnov (KS) distance between target IPF and approximate IPG distributions with respect to critic co is computed. The critic is evaluated on samples XF (1) and x (1) from the target and approximate distributions respectively. The A threshold moves from -∞ to +∞ establishing a stack of level sets. At each level, the fraction of datapoints (and) below the threshold is calculated for each distribution independently. This produces the PF (Γc₄ (λ)) and PG (Γε₄(λ)) curves. The Generalized KS distance is the largest absolute difference between the curves shown as in the right figure. Best viewed in color.", "description": "This figure shows how the generalized Kolmogorov-Smirnov distance is calculated between the target and generated distributions.  It illustrates the process of evaluating a critic function on samples from both distributions to determine the cumulative distribution functions. The KS distance is then derived as the largest difference between these cumulative functions.", "section": "Abstract"}, {"figure_path": "8JmUmTgKiY/figures/figures_14_1.jpg", "caption": "Figure 2: Squared population MMD between approximate and test distribution as a function of the number of training instances. Solid lines denote the average over five random initializations, and the shaded area represents the two-σ interval. Best viewed in color.", "description": "This figure shows how the squared population MMD (a measure of similarity between two probability distributions) changes as the number of training instances increases for three different generative models: GAN, WGAN-GP, and KSGAN.  The x-axis represents the number of training instances, and the y-axis represents the squared population MMD.  Each line represents the average MMD for a particular model across multiple random initializations, while the shaded area indicates the two-standard-deviation interval around the average, showing the variability of the results.  The figure allows for a comparison of the convergence speed and stability of these models.", "section": "D Extended results"}, {"figure_path": "8JmUmTgKiY/figures/figures_15_1.jpg", "caption": "Figure 3: Histograms of samples from distributions denoted on the top. Heatmap colors are shared for all figures in each row. Best viewed in color.", "description": "This figure compares the performance of different generative models (GAN, WGAN-GP, and KSGAN) on eight different synthetic 2D datasets. Each dataset is represented by a row, and each column shows the histograms of samples generated by a different model. The real data distribution is shown in the first column, and the heatmap colors are shared for all figures in each row. The figure shows that the KSGAN model outperforms other models in terms of generating samples from distributions that are similar to the real data distribution.", "section": "D Extended results"}, {"figure_path": "8JmUmTgKiY/figures/figures_16_1.jpg", "caption": "Figure 1: A schematic depiction of how the Generalized Kolmogorov-Smirnov (KS) distance between target IPF and approximate IPG distributions with respect to critic cθ is computed. The critic is evaluated on samples XF~(1) and XG~(1) from the target and approximate distributions respectively. The λ threshold moves from -∞ to +∞ establishing a stack of level sets. At each level, the fraction of datapoints (XF~(1) and XG~(1)) below the threshold is calculated for each distribution independently. This produces the PF(Γcθ(λ)) and PG(Γcθ(λ)) curves. The Generalized KS distance is the largest absolute difference between the curves shown as in the right figure. Best viewed in color.", "description": "This figure shows how the Kolmogorov-Smirnov Generative Adversarial Network (KSGAN) calculates the Generalized Kolmogorov-Smirnov (KS) distance between the target distribution and the generated distribution. It uses a critic to evaluate samples from both distributions, and the KS distance is calculated based on the cumulative distribution functions (CDFs) of these samples.", "section": "1 Introduction"}, {"figure_path": "8JmUmTgKiY/figures/figures_16_2.jpg", "caption": "Figure 1: A schematic depiction of how the Generalized Kolmogorov-Smirnov (KS) distance between target P<sub>F</sub> and approximate P<sub>G</sub> distributions with respect to critic c<sub>θ</sub> is computed. The critic is evaluated on samples x<sup>F</sup>(i) and x<sup>G</sup>(i) from the target and approximate distributions respectively. The λ threshold moves from -∞ to +∞ establishing a stack of level sets. At each level, the fraction of datapoints (PF and PG) below the threshold is calculated for each distribution independently. This produces the P<sub>F</sub>(Γ<sub>cθ</sub>(λ)) and P<sub>G</sub>(Γ<sub>cθ</sub>(λ)) curves. The Generalized KS distance is the largest absolute difference between the curves shown as in the right figure. Best viewed in color.", "description": "This figure shows how the Kolmogorov-Smirnov distance is calculated between the true and generated distributions.  The KS distance is calculated using the quantile function. The figure visualizes the process using level sets, showing the cumulative distribution functions of both distributions and illustrating how the maximum absolute difference between the curves corresponds to the KS distance.", "section": "Abstract"}, {"figure_path": "8JmUmTgKiY/figures/figures_16_3.jpg", "caption": "Figure 1: A schematic depiction of how the Generalized Kolmogorov-Smirnov (KS) distance between target IPF and approximate IPG distributions with respect to critic cθ is computed. The critic is evaluated on samples XF~(1) and XG~(1) from the target and approximate distributions respectively. The λ threshold moves from -∞ to +∞ establishing a stack of level sets. At each level, the fraction of datapoints (XF and XG) below the threshold is calculated for each distribution independently. This produces the PF(Γcθ(λ)) and PG(Γcθ(λ)) curves. The Generalized KS distance is the largest absolute difference between the curves shown as in the right figure. Best viewed in color.", "description": "This figure shows how the Generalized Kolmogorov-Smirnov (KS) distance is computed between the true and generated data distributions.  The KS distance is calculated using the quantile function which is represented by the critic. The key idea is to compare the cumulative distribution functions (CDFs) of the true and generated distributions and calculate the maximum difference between them across all thresholds (λ). This maximum difference represents the KS distance.", "section": "1 Introduction"}, {"figure_path": "8JmUmTgKiY/figures/figures_17_1.jpg", "caption": "Figure 5: Samples from the respective models trained on the CIFAR-10 dataset. Best viewed in color.", "description": "This figure shows samples generated by GAN, WGAN-GP, and KSGAN models trained on the CIFAR-10 dataset.  Each model's generated images are displayed in a grid format, allowing for visual comparison of the image quality and diversity produced by each method. The caption indicates that the images are best viewed in color to fully appreciate the details.", "section": "D.3 CIFAR-10"}]