[{"figure_path": "QiCJomIW3l/tables/tables_7_1.jpg", "caption": "Table 1: Quantitative comparison of the existing methods on the synthetic test data. The spatial resolution of the input and output is 16×16 and 128×128, respectively. The best in bold. The second with underline. Note that only methods with gray annotation are designed for reconstruction from under-scanning measurements.", "description": "This table presents a quantitative comparison of different methods for non-line-of-sight (NLOS) imaging reconstruction using synthetic data.  It shows the performance of various methods (LCT, RSD, FK, LFE, I-K, CSA, USM, Ours-S, and Ours) in terms of intensity (PSNR, SSIM, RMSE) and depth (RMSE, MAD) metrics. The input resolution is 16x16 and the output resolution is upscaled to 128x128. The methods using under-scanning measurements are highlighted in gray.  The best performing method for each metric is shown in bold, and the second-best is underlined.", "section": "5.2 Synthetic Results"}, {"figure_path": "QiCJomIW3l/tables/tables_8_1.jpg", "caption": "Table 2: Ablation results on the loss items and spatial-temporal Mamba mechanism.", "description": "This table presents the ablation study results, analyzing the impact of different loss functions and the spatial-temporal Mamba mechanism on the model's performance.  It shows the PSNR, SSIM, RMSE, and MAD metrics for intensity and depth estimation across various model configurations.  The configurations systematically remove or include specific loss components (Lint,dep, Lt, Lpf, Lis,tv) and different parts of the Mamba mechanism (spatial, temporal, or both). This allows for a quantitative assessment of each component's contribution to the overall reconstruction quality.", "section": "5.3 Ablation Studies"}, {"figure_path": "QiCJomIW3l/tables/tables_12_1.jpg", "caption": "Table 3: Ablation studies on causality and different modules. * denotes that the method possesses the same number of SSMs as our final method.", "description": "This table presents the results of ablation studies conducted to evaluate the impact of causality and different module choices on the overall performance of the proposed dynamic NLOS reconstruction method.  It compares various configurations, systematically varying the encoder (Mamba or Vision Transformer), fusion method (Mamba or Vision Transformer), and the inclusion of causality in the model. The performance metrics used for comparison are Peak Signal-to-Noise Ratio (PSNR), Structural Similarity Index (SSIM), Root Mean Squared Error (RMSE), and Mean Absolute Difference (MAD), for both intensity and depth components of the reconstruction.  The results show the importance of causality and the optimal choice of components for achieving the best performance.", "section": "A.1 Ablation studies on causality and different modules"}, {"figure_path": "QiCJomIW3l/tables/tables_14_1.jpg", "caption": "Table 4: The inference time and memory of different models. Note that only methods with gray annotation are specifically designed for NLOS imaging from under-scanning measurement.", "description": "This table compares the inference time and memory usage of different methods for non-line-of-sight (NLOS) imaging.  It highlights the trade-off between speed and resource consumption.  The methods are categorized, showing those specifically designed for under-scanning measurements.  The time is measured in seconds, and memory is in megabytes (M).", "section": "A.5 Computational Memory and Inference Time"}]