[{"figure_path": "ebBnKVxMcZ/figures/figures_4_1.jpg", "caption": "Figure 1: Reliability diagrams for ResNet-50 and ViT-B/16 when using Temperature Scaling (TS), Vector Scaling (VS), and Histogram Binning (HB) on ImageNet. The subscript TVA signifies that the TvA reformulation was used, and reg means our regularization (6) was applied. Red bars show the differences between bin accuracy (blue bar) and accuracy for perfect calibration (dashed red line). As the methods improve the calibration, these differences are reduced and the average confidence (vertical dotted line) will get closer to the global accuracy (vertical dashed line).", "description": "This figure shows reliability diagrams for two different models (ResNet-50 and ViT-B/16) trained on the ImageNet dataset, using several calibration methods (Temperature Scaling, Vector Scaling, and Histogram Binning).  Each diagram displays the relationship between predicted confidence and the actual accuracy for each confidence bin. The effect of the Top-versus-All (TvA) approach and a regularization technique are shown by comparing the results with and without these methods.  The goal is to visually demonstrate how well the calibrated confidence scores reflect the actual probability of a correct prediction.", "section": "Experiments"}, {"figure_path": "ebBnKVxMcZ/figures/figures_6_1.jpg", "caption": "Figure 1: Reliability diagrams for ResNet-50 and ViT-B/16 when using Temperature Scaling (TS), Vector Scaling (VS), and Histogram Binning (HB) on ImageNet. The subscript TVA signifies that the TvA reformulation was used, and reg means our regularization (6) was applied. Red bars show the differences between bin accuracy (blue bar) and accuracy for perfect calibration (dashed red line). As the methods improve the calibration, these differences are reduced and the average confidence (vertical dotted line) will get closer to the global accuracy (vertical dashed line).", "description": "This figure displays reliability diagrams for two different models, ResNet-50 and ViT-B/16, trained on the ImageNet dataset.  It showcases the impact of various calibration methods (Temperature Scaling, Vector Scaling, and Histogram Binning) with and without the Top-versus-All (TvA) reformulation and regularization. Each diagram shows the relationship between predicted confidence and actual accuracy across different confidence intervals. The red bars represent the difference between the accuracy within a confidence interval and the ideal accuracy (perfect calibration).  The goal is to minimize the height of these red bars, indicating better calibration.  The vertical dotted line represents the average confidence, which ideally should approach the global accuracy (dashed line) as calibration improves.", "section": "Experiments"}, {"figure_path": "ebBnKVxMcZ/figures/figures_8_1.jpg", "caption": "Figure 1: Reliability diagrams for ResNet-50 and ViT-B/16 when using Temperature Scaling (TS), Vector Scaling (VS), and Histogram Binning (HB) on ImageNet. The subscript TVA signifies that the TvA reformulation was used, and reg means our regularization (6) was applied. Red bars show the differences between bin accuracy (blue bar) and accuracy for perfect calibration (dashed red line). As the methods improve the calibration, these differences are reduced and the average confidence (vertical dotted line) will get closer to the global accuracy (vertical dashed line).", "description": "This figure shows reliability diagrams for two different model architectures (ResNet-50 and ViT-B/16) trained on the ImageNet dataset.  Reliability diagrams plot the relationship between predicted confidence and the actual accuracy.  The plots illustrate the impact of different calibration methods (Temperature Scaling, Vector Scaling, and Histogram Binning) and the Top-versus-All (TvA) approach, with and without regularization.  Perfect calibration is represented by the dashed red line. The closer the plotted line is to this line, the better the calibration. The red bars highlight the differences between bin accuracy and average confidence within each confidence bin.", "section": "Experiments"}, {"figure_path": "ebBnKVxMcZ/figures/figures_8_2.jpg", "caption": "Figure 1: Reliability diagrams for ResNet-50 and ViT-B/16 when using Temperature Scaling (TS), Vector Scaling (VS), and Histogram Binning (HB) on ImageNet. The subscript TVA signifies that the TvA reformulation was used, and reg means our regularization (6) was applied. Red bars show the differences between bin accuracy (blue bar) and accuracy for perfect calibration (dashed red line). As the methods improve the calibration, these differences are reduced and the average confidence (vertical dotted line) will get closer to the global accuracy (vertical dashed line).", "description": "This figure presents reliability diagrams for ResNet-50 and ViT-B/16 models on the ImageNet dataset.  It compares several calibration methods: Temperature Scaling (TS), Vector Scaling (VS), and Histogram Binning (HB), both with and without the Top-versus-All (TvA) reformulation and regularization. The diagrams visualize the relationship between confidence (x-axis) and accuracy (y-axis), illustrating how well the predicted confidence score reflects the true probability of correctness.  The red bars represent the calibration error (difference between accuracy and confidence within each bin).  The aim is for the red bars to shrink, indicating improved calibration, and for the average confidence to closely match the overall accuracy.", "section": "Experiments"}, {"figure_path": "ebBnKVxMcZ/figures/figures_21_1.jpg", "caption": "Figure 1: Reliability diagrams for ResNet-50 and ViT-B/16 when using Temperature Scaling (TS), Vector Scaling (VS), and Histogram Binning (HB) on ImageNet. The subscript TVA signifies that the TvA reformulation was used, and reg means our regularization (6) was applied. Red bars show the differences between bin accuracy (blue bar) and accuracy for perfect calibration (dashed red line). As the methods improve the calibration, these differences are reduced and the average confidence (vertical dotted line) will get closer to the global accuracy (vertical dashed line).", "description": "This figure displays reliability diagrams for two different models (ResNet-50 and ViT-B/16) trained on the ImageNet dataset.  It compares the performance of several calibration methods (Temperature Scaling, Vector Scaling, and Histogram Binning) with and without the Top-versus-All (TvA) reformulation and regularization. Each subplot shows the relationship between confidence and accuracy for a specific method, illustrating how well the predicted confidence reflects the actual probability of a correct classification. The red bars represent the difference between bin accuracy and perfect calibration, providing a visual measure of the calibration error.  As calibration improves, the red bars decrease, and the average confidence approaches the global accuracy.", "section": "Experiments"}]