[{"type": "text", "text": "MemVLT: Vision-Language Tracking with Adaptive Memory-based Prompts ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Xiaokun Feng1,2 Xuchen $\\mathbf{Li}^{1,2}$ Shiyu $\\mathbf{H}\\mathbf{u}^{5}$ Dailing Zhang1,2   \nMeiqi $\\mathbf{W}\\mathbf{u}^{3}$ Jing Zhang2 Xiaotang Chen1,2,4 Kaiqi Huang1,2,4 ", "page_idx": 0}, {"type": "text", "text": "1School of Artificial Intelligence, University of Chinese Academy of Sciences 2Institute of Automation, Chinese Academy of Sciences ", "page_idx": 0}, {"type": "text", "text": "3School of Computer Science and Technology, University of Chinese Academy of Sciences 4Center for Excellence in Brain Science and Intelligence Technology, Chinese Academy of Sciences ", "page_idx": 0}, {"type": "text", "text": "{fengxiaokun2022, lixuchen2024} $@$ ia.ac.cn, shiyu.hu $@$ ntu.edu.sg, zhangdailing $2023\\,\\@$ ia.ac.cn wumeiqi18 $@$ mails.ucas.ac.cn, jing_zhang $@$ ia.ac.cn, {xtchen,kaiqi.huang} $@$ nlpr.ia.ac.cn ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Vision-language tracking (VLT) enhances traditional visual object tracking by integrating language descriptions, requiring the tracker to flexibly understand complex and diverse text in addition to visual information. However, most existing visionlanguage trackers still overly rely on initial fixed multimodal prompts, which struggle to provide effective guidance for dynamically changing targets. Fortunately, the Complementary Learning Systems (CLS) theory suggests that the human memory system can dynamically store and utilize multimodal perceptual information, thereby adapting to new scenarios. Inspired by this, (i) we propose a Memorybased Vision-Language Tracker (MemVLT). By incorporating memory modeling to adjust static prompts, our approach can provide adaptive prompts for tracking guidance. (ii) Specifically, the memory storage and memory interaction modules are designed in accordance with CLS theory. These modules facilitate the storage and flexible interaction between short-term and long-term memories, generating prompts that adapt to target variations. (iii) Finally, we conduct extensive experiments on mainstream VLT datasets (e.g., MGIT, TNL2K, LaSOT and $\\mathrm{LaSOT}_{e x t}$ ). Experimental results show that MemVLT achieves new state-of-the-art performance. Impressively, it achieves $69.4\\%$ AUC on the MGIT and $63.3\\%$ AUC on the TNL2K, improving the existing best result by $8.4\\%$ and $4.7\\%$ , respectively. The code and models will be released at: https://github.com/XiaokunFeng/MemVLT. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "The vision-language tracking (VLT) task [1] aims to locate a user-defined object in a video sequence using multimodal prompts, which comprise a template patch and a language description. As an extension of traditional visual single object tracking (SOT) task [2, 3, 4], VLT can harness the complementary advantages of multiple modalities. Therefore, vision-language trackers (VLTs) have the potential to achieve more promising tracking performance, which has recently attracted widespread attention [5, 6, 7, 8]. ", "page_idx": 0}, {"type": "text", "text": "Similar to SOT, VLT still adopts the one-shot setting [9], providing prompts only at the initial moment. However, these fixed prompts struggle to provide continuous reference for targets in video sequences due to their inherent dynamic variability [10]. As shown in Fig. 1 (a), the initial prompts depict a gun placed on a table. However, when the target is subsequently picked up, there is a significant deviation in the target’s state from given prompts. Regarding the target state in different frames, we quantitatively evaluate its consistency with the initial multimodal prompts (implementation details are introduced in Sec. B.1). It is evident that the consistency is poor most of the time, indicating that the initial prompts are ineffective as a reference. ", "page_idx": 0}, {"type": "image", "img_path": "ZK1CZXKgG5/tmp/a2df993d2bc0f488e747f59cca132b7171f8e40974a46b1258939f2768cca1eb.jpg", "img_caption": ["Figure 1: (a) Illustration of a video sequence. Given the initial prompts, we respectively plot consistency curves between prompts of two modalities and the subsequent searched target. (b) Framework of previous vision-language trackers (VLTs). They primarily obtain tracking results by matching the search image with the initial prompts based on similarity. (c) Framework of our proposed MemVLT (left) by modeling Complementary Learning Systems (CLS) Theory (right). MemVLT effectively models the storage and interaction of long-term and short-term memories, resulting in prompts that adapt to the search image. "], "img_footnote": [], "page_idx": 1}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "Despite this, most existing VLTs [11, 12, 13, 14, 15, 16] overly rely on these static prompts. As illustrated in Fig. 1 (b), they identify the target in each frame that is most similar to the initial prompts as the tracking result. Despite achieving some success, the difficulty lies in the limited generalizability of static prompts to subsequent frames, thereby impacting tracking performance. ", "page_idx": 1}, {"type": "text", "text": "Unlike existing VLTs, humans can adaptively locate a target, even when the target appears in a form vastly different from its initial perception state [17]. Neuroscientists have long been interested in this ability and have conducted studies using the visual search task [18, 19], which is similar to the VLT. Numerous research findings reveal that human adaptive visual search capability can be attributed to the sophisticated memory mechanisms [20, 21]. ", "page_idx": 1}, {"type": "text", "text": "The Complementary Learning Systems (CLS) theory [22], as a well-known memory model, has recently revealed the relationship between human generalization adaptability and memory [23]. Generally speaking, humans continuously adjust their memory by integrating perceived information to better adapt to the environment. As shown in Fig. 1 (c), the human brain achieves memory through two complementary systems: the hippocampus and the neocortex. The hippocampus plays a primary role in short-term memory, which is subsequently consolidated into long-term memory stored in the neocortex [24, 23]. The interaction between short-term and long-term memories enables humans to adapt to different environments [23, 8]. Given the advantages of this memory mechanism, a critical question arises: How can we incorporate it into the design of trackers? ", "page_idx": 1}, {"type": "text", "text": "To achieve that, we propose a Memory-based Visual-Language Tracker named MemVLT. As depicted in Fig. 1 (c), the core insight of MemVLT lies in efficiently adapting to the dynamic changes of the target by emulating the storage and interaction of memory information, thereby enabling effective tracking. Specifically, (i) we first develop a memory storage module to simulate the functioning of short-term and long-term memory systems. Inspired by the system consolidation process [23], we introduce an efficient long-term memory storage method named section-top. (ii) Drawing upon the stored memory, we incorporate a memory interaction module to emulate the interaction between short-term and long-term memories [25], generating adaptive visual and textual prompts. These adaptive prompts then guide subsequent tracking by integrating with the search feature. Through these modules, MemVLT facilitates adaptive tracking by utilizing memory information. ", "page_idx": 1}, {"type": "text", "text": "In summary, our contributions are as follows: (i) Inspired by the CLS theory, we introduce a novel tracker named MemVLT. Leveraging memory mechanism modeling, this approach facilitates the generation of adaptive prompts to effectively guide the tracking process. (ii) In the proposed MemVLT, we incorporate memory storage and memory interaction modules. They faithfully model the storage and flexible interaction processes between short-term and long-term memories in the human brain, yielding multimodal prompts that adapt to dynamically evolving targets. (iii) We evaluate the performance of MemVLT on the MGIT [5], TNL2K [26], LaSOT [27] and $\\mathrm{LaSOT}_{e x t}$ [28] and achieve state-of-the-art tracking results. Notably, MemVLT achieves $69.4\\%$ AUC on MGIT and $63.3\\%$ AUC on TNL2K, improving the existing best result by $8.4\\%$ and $4.7\\%$ , respectively. ", "page_idx": 1}, {"type": "text", "text": "2 Related Work ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "2.1 Vision-Language Tracking ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Vision-language tracking is an emerging multimodal task that aims to achieve tracking by utilizing a given language description and an initial template patch. Adhering to the principle of similaritymatching [9], most existing VLTs [11, 12, 13, 14, 15, 16] leverage the static given prompts as reference to identify the most similar target in the search frame. Among them, SNLT [11] introduces a universal language region proposal network, which improves tracking performance through a dynamic aggregation module. MMTrack [16] designs an effective tracking pipeline that treats the VLT as a token generation task. While these VLTs perform well in simple scenes, they overlook the dynamic nature of targets, making it challenging to track when targets undergo significant changes. ", "page_idx": 2}, {"type": "text", "text": "To address this limitation, certain VLTs attempt to utilize temporal information to obtain the dynamic reference. GTI [29] and AdaSwitcher [26] locate the target by integrating tracking and grounding results at each time step. Their reliance on pre-defined threshold can lead to error accumulation. JointNLT [14] incorporates temporal information in the form of a temporal query during the prediction stage. Since the length of the query tokens is much shorter than that of the static prompt tokens, it indicates that static prompts still dominate the tracking process. Differing from them, we depart from human memory mechanisms to utilize temporal information. Building upon initial static prompts, we inject dynamic features by incorporating memory information, which not only avoids the error accumulation but also generates prompts adapted to the dynamic changes of the target. ", "page_idx": 2}, {"type": "text", "text": "By treating temporal information as memory, some trackers [30, 31, 32] have incorporated memory mechanism modeling. Extensive previous studies confirm that memory modeling is a viable approach, which is the paradigm our work follows. Distinguishing our work from existing research, to our knowledge, MemVLT is the first to apply CLS theory to tracker design. Recent research in CLS theory [33, 23] underscores the importance of the interaction between long and short-term memories. Motivated by this insight, we develop the memory interaction module to generate adaptive prompts. In contrast, existing approaches, such as DecoupleTNL [32], focus solely on modeling long and short-term memories but overlook the interaction process. In addition to memory interaction, we propose the section-top memory storage method, which is inspired by the system consolidation process [23, 24] within the CLS theory. Compared to the sliding window storage method commonly used by existing trackers [14, 32], it demonstrates more effective tracking performance (see Sec. 4.3). ", "page_idx": 2}, {"type": "text", "text": "2.2 Prompt Learning ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "In the natural language processing field, prompt learning [34] refers to the automatic learning of instructions in the form of sentences, thereby enabling better task understanding. Considering the significant advantages of this approach in enhancing model adaptability, recent studies have extended it to vision-language tasks [35, 36]. CoOp [35] efficiently fine-tunes CLIP [37] for few-shot transfer by constructing language branch inputs using a set of learnable vectors. Bahng [36] performs prompt tuning on CLIP by prompting on the vision branch. In this work, we exploit the core idea of prompt learning by introducing learnable vectors to model the memory information. These vectors are used to adjust the initial static prompts, making them adaptive to the dynamic changes of the target. ", "page_idx": 2}, {"type": "text", "text": "Recently, several vision-only trackers [38, 39, 40] have attempted to model temporal information using learnable vectors. These vectors, also referred to as temporal queries, are utilized to capture global information at each moment and guide the subsequent tracking process. What sets us apart is that, (i) we focus on the vision-language multimodal scenario, not only modeling temporal queries but also emphasizing their adjustment to static prompts to comprehensively leverage temporal information. (ii) We design a novel multimodal query storage method called section-top to enhance the existing sliding window storage approach. ", "page_idx": 2}, {"type": "text", "text": "3 Methodology ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "3.1 Overview ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "The framework of MemVLT is depicted in Fig. 2 (a). Given two static prompts (text description and template patch) and the search image at a general time step $(t>0)$ ), the text and vision encoders first ", "page_idx": 2}, {"type": "image", "img_path": "ZK1CZXKgG5/tmp/01c0dcb317405bb96a90dc3a36b6d7ffd28e43a6102ee8666124d20c5330d10c.jpg", "img_caption": ["Search Language Template Textual query Visual query $\\bigcirc$ Textual short-term Visual short-term $\\diamondsuit$ Adaptive textual $\\diamond$ Adaptive visual Textual long-term Visual long-term Static prompt token Query token Short-term memory unit token Adaptive prompt token Long-term memory unit token "], "img_footnote": [], "page_idx": 3}, {"type": "text", "text": "Figure 2: (a) Framework of our proposed MemVLT. Given a language description and a template patch as references, MemVLT tracks the target in search images at time $t$ . The input is first encoded using text and vision encoders. Subsequently, the memory interaction module processes static prompt features based on stored memory, generating adaptive prompts. After incorporating these prompts, the search features are fed into the prediction head to obtain the tracking results. Additionally, the memory storage module utilizes processed data to represent and store memory information. (b) Diagram of memory interaction. To illustrate the process of memory interaction, we organize the memory information from the perspectives of long-term and short-term memories. Through the interaction between these memories, adaptive visual and textual prompts are obtained. ", "page_idx": 3}, {"type": "text", "text": "embed them into specific feature spaces, denoted as $f_{l}^{t},f_{z}^{t}$ , and $f_{x}^{t}$ , respectively. Concurrently, we obtain the global visual and textual semantic representation tokens (i.e., $f_{g v}^{t}$ and $f_{g l}^{t})$ . Subsequently, these encoded features, along with the memory information $M^{t-1}$ obtained from the memory storage module (MSM), are fed into the memory interaction module (MIM). Through the mutual interaction of long-term and short-term memories, we obtain the latest visual and textual short-term memories (i.e., $m_{v}^{t}$ and $m_{l.}^{t}$ ), as well as the adaptive prompts (i.e., $f_{a v}^{t}$ and $f_{a l}^{t})$ ). These adaptive prompts then undergo feature fusion with the search feature, yielding the target-related feature $f_{r}^{{\\bar{t}}}$ . Next, $f_{r}^{t}$ is fed into the prediction head to obtain the tracking result and its corresponding confidence score $p_{c}^{t}$ . Finally, $p_{c}^{t}$ and the short-term memory are used to update the MSM, providing memory information $M^{t}$ for tracking in the next time step $(t+1)$ . In the following sections, we will provide detailed introductions to each module and the dimensions of the above variables. ", "page_idx": 3}, {"type": "text", "text": "3.2 Input Encoder ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Vision Encoder. For the visual input of the search image and template patch, we adopt the encoding paradigm of the one-stream network [41], implementing it with the HiViT [42, 39, 40]. Specifically, the template patch $z\\in\\mathbb{R}^{3\\times H_{z}\\times W_{z}}$ and search image $\\bar{\\boldsymbol{x}}_{t}\\in\\mathbb{R}^{3\\times H_{x}\\times W_{x}}$ are first projected into the feature space and flattened to produce token embeddings. Additionally, we introduce a [CLS] token1 to capture global semantic feature [43]. This token is concatenated with the template-search tokens and then fed into transformer layers for feature modeling. Finally, we obtain the search feature $f_{x}^{t}\\in\\mathbb{R}^{N_{x}\\times D}$ , template feature $f_{z}^{\\bar{t}}\\in\\mathbb{R}^{N_{z}\\times D}$ , and global visual feature $f_{g v}^{t}\\in\\mathbb{R}^{1\\times D}$ . ", "page_idx": 3}, {"type": "text", "text": "Text Encoder. Since being proposed, the BETR [43] series models have been widely used for text representation. Therefore, we utilize RoBERTa [44], a classic pre-trained model, as our text encoder. Specifically, for a given input sentence, we tokenize it into a sequence of text tokens. The token sequences then are fed into the RoBERTa to extract the text embedding feature $f_{l}^{t}\\in\\mathbb{R}^{N_{l}\\times D}$ . Additionally, we perform pooling on $f_{l}^{t}$ to obtain the sentence-level global feature $f_{g l}^{t}\\in\\mathbb{R}^{1\\times D}$ . ", "page_idx": 3}, {"type": "text", "text": "3.3 Memory Interaction Module ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Due to the constraints of initial static visual-textual prompts, the $f_{l}^{t}$ and $f_{z}^{t}$ derived from them face challenges in offering consistent references for dynamically changing targets [9]. To alleviate this limitation, MIM attempts to leverage the long-term memory $\\stackrel{\\cdot}{M^{t-1}}$ stored in MSM to inject dynamic feature reflecting target variations into the static prompts, thereby better guiding the tracking. As shown in Fig. 2 (a), under the influence of long-term memories (i.e., $M_{l}^{\\bar{t}-1}$ and $M_{v}^{t-1})$ , we first integrate with the current features to acquire the latest short-term memories (i.e., $m_{l}^{t}$ and $m_{v}^{t}$ ). Then, through the interaction between the memory information $m^{t}$ and the initial prompts, we obtain adaptive prompts and fuse them with the search features $f_{x}^{t}$ , yielding target-related features $f_{r}^{t}$ . ", "page_idx": 3}, {"type": "text", "text": "", "page_idx": 4}, {"type": "text", "text": "Corresponding to the two modal prompts of given cues, we utilize both modalities to represent memory. Before explaining the specific construction of memory, we reiterate the short-term and e. d Hbeyr e,M d  aans $\\boldsymbol{M}^{t}=\\left\\{\\boldsymbol{m}^{i}\\right\\}_{i=1}^{L_{m}}$ p, riet sceonnt stihset $L_{m}$ rsth-toerrt-mte vrims umale amnodr tye xutnuitasl $m^{i}=(m_{v}^{i},m_{l}^{i})$ $m_{v}^{i}\\in\\mathbb{R}^{1\\times D}$ $m_{l}^{i}\\in\\mathbb{R}^{1\\times D}$ $i$   \nmemory, respectively. Additionally, we also consider the initial given prompts as a form of long-term memory due to their role throughout the tracking process. ", "page_idx": 4}, {"type": "text", "text": "3.3.1 The Acquisition of the Short-Term Memory ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "To begin with, we introduce the generation of short-term memory under the influence of long-term memory. Initially, we concatenate the long-term visual memory $\\{m_{v}^{i}\\}_{i=1}^{L_{m}}$ and textual memory $\\left\\{m_{l}^{i}\\right\\}_{i=1}^{L_{m}}$ with the current global semantic features $f_{g v}^{t}$ and $f_{g l}^{t}$ respectively. This process yields more comprehensive visual and textual memory information, $H_{v}^{t-1}\\in\\mathbb{R}^{(L_{m}+1)\\times D}$ and $H_{l}^{t-1}\\in$ (Lm+1)×D. ", "page_idx": 4}, {"type": "equation", "text": "$$\nH_{v}^{t-1}=[{}^{*}M_{v}^{t-1};f_{g v}^{t}]=[m_{v}^{1};\\ldots;m_{v}^{L_{m}};f_{g v}^{t}],\n$$", "text_format": "latex", "page_idx": 4}, {"type": "equation", "text": "$$\nH_{l}^{t-1}=[^{*}M_{l}^{t-1};f_{g l}^{t}]=[m_{l}^{1};\\cdot\\cdot\\cdot;m_{l}^{L_{m}};f_{g l}^{t}].\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where ∗denotes extracting all elements in the set, and $[;]$ indicates concatenation along the first dimension. Following this, we introduce the memory query to associate long-term memory with the current information, enabling the generated short-term memory to consider both historical and current features simultaneously. ", "page_idx": 4}, {"type": "text", "text": "Considering the remarkable capability of the transformer network in feature interaction [45], we design the short-term memory generation (SMG) layer by modifying it. In each SMG layer, the memory query sequentially interacts with long-term memory information and corresponding modality features to generate short-term memory. Taking the visual branch as an example, the computational process of the visual query $q_{v}^{0}\\in\\mathbb{R}^{1\\times\\check{D}}$ is as follows: ", "page_idx": 4}, {"type": "equation", "text": "$$\nq_{v^{\\prime}}^{k}=N o r m(q_{v}^{k}+\\Phi_{C A}(q_{v}^{k},H_{v}^{t-1})),\n$$", "text_format": "latex", "page_idx": 4}, {"type": "equation", "text": "$$\nq_{v^{\\prime\\prime}}^{k}=N o r m(q_{v^{\\prime}}^{k}+\\Phi_{C A}(q_{v^{\\prime}}^{k},[f_{z}^{t};f_{x}^{t}])),\n$$", "text_format": "latex", "page_idx": 4}, {"type": "equation", "text": "$$\nq_{v}^{k+1}=N o r m(q_{v^{\\prime\\prime}}^{k}+F F N(q_{v^{\\prime\\prime}}^{k})).\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Here, $\\Phi_{C A}(\\cdot,\\cdot)$ denotes the cross-attention operation where the first element serves as $Q$ and the second element serves to obtain $K$ and $V$ [46]. Norm represents the layer normalization operation and $F F N$ denotes the feed-forward network. $\\bar{q}_{v}^{k}$ denotes the query after being processed by the $k$ -th layer. For brevity, we omit the positional encoding. ", "page_idx": 4}, {"type": "text", "text": "After passing through $L_{v}$ stacked SMG layers, we obtain the visual short-term memory $m_{v}^{t}=q_{v}^{L_{v}}$ Similarly, we utilize the textual query $q_{l}^{0}\\in\\mathbf{\\bar{R}}^{1\\times D}$ to obtain the textual short-term memory $m_{l}^{t}=q_{v}^{L_{l}}$ ", "page_idx": 4}, {"type": "equation", "text": "$$\nq_{l^{\\prime}}^{k}=N o r m(q_{l}^{k}+\\Phi_{C A}(q_{l}^{k},H_{l}^{t-1})),\n$$", "text_format": "latex", "page_idx": 4}, {"type": "equation", "text": "$$\nq_{l^{\\prime\\prime}}^{k}=N o r m(q_{l^{\\prime}}^{k}+\\Phi_{C A}(q_{l^{\\prime}}^{k},[f_{l}^{t};f_{x}^{t}])),\n$$", "text_format": "latex", "page_idx": 4}, {"type": "equation", "text": "$$\nq_{l}^{k+1}=N o r m(q_{l^{\\prime\\prime}}^{k}+F F N(q_{l^{\\prime\\prime}}^{k})).\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "3.3.2 The Generation and Fusion of the Adaptive Prompts ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "Based on the acquired short-term memory (i.e., $m^{t}=(m_{v}^{t},m_{l}^{t}))$ ), on one hand, we feed it into MSM to update the long-term memory (see Sec. 3.4). On the other hand, we utilize it to modulate the long-term memory represented by the initial visual-textual prompts, enabling them to adapt to the ", "page_idx": 4}, {"type": "text", "text": "variations of the target. For the textual branch, we first utilize $m_{l}^{t}$ to modulate the initial textual feature $f_{l}^{t}$ , then use the adjusted textual feature to guide the search feature $f_{x}^{t}$ . ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\begin{array}{r}{f_{a l}^{t}=T r a n s_{D e c}(f_{l}^{t},m_{l}^{t}),}\\\\ {\\ }\\\\ {f_{x l}^{t}=T r a n s_{D e c}(f_{x}^{t},f_{a l}^{t}).}\\end{array}\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "Where $T r a n s_{D e c}$ denotes the vanilla transformer decoder layer [46] (see Sec. A.2 for detailed computation process). $f_{x l}^{t}$ represents the search features fused with the adaptive textual prompts $f_{a l}^{t}$ . ", "page_idx": 5}, {"type": "text", "text": "For the visual branch, we adopt a similar approach. As shown in Eq.11 and Eq.12, we ultimately obtain the search feature $f_{x l v}^{t}$ integrated with adaptive visual and textual prompts, simplified as $f_{r}^{\\bar{t}}$ . We treat $f_{r}^{t}$ as the target-related features fed into the prediction head. ", "page_idx": 5}, {"type": "equation", "text": "$$\nf_{a v}^{t}=T r a n s_{D e c}(f_{z}^{t},m_{v}^{t}),\n$$", "text_format": "latex", "page_idx": 5}, {"type": "equation", "text": "$$\nf_{r}^{t}=f_{x v l}^{t}=T r a n s_{D e c}(f_{x}^{t},f_{a v}^{t}).\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "3.4 Memory Storage Module ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "In this section, we will introduce the construction of long-term memory $M^{t}$ . Given a video sequence of length $T$ , MIM generates a short-term memory $m^{\\bar{t}}$ at each time step. Typically, due to the computational burden of integrating all short-term memories, $L_{m}$ is much smaller than $T$ . Therefore, the key to long-term memory storage is to design a short-term memory selection mechanism. ", "page_idx": 5}, {"type": "text", "text": "Prior trackers, e.g., JointNLT and AQATrack, commonly use the sliding window approach to store temporal information, which can be considered a form of long-term memory. Specifically, when $t>L_{m}$ , short-term memories are selected from the most recent $L_{m}$ frames (i.e., from $t\\!-\\!L_{m}$ to $t\\!-\\!1$ ) for storage. While achieving some effectiveness, the redundancy of video frames leads to redundant memories being stored, and it can only consider a limited temporal range. The CLS theory refers to the process of integrating short-term memory into long-term memory as system consolidation [24]. Relevant studies [33, 23] indicate the long-term memory system primarily stores short-term memory conducive to generalization. We adhere to this principle to propose a novel long-term memory storage method called section-top. It first uniformly divides past time intervals into $L_{m}$ sections and then stores the most representative short-term memory within each section. ", "page_idx": 5}, {"type": "text", "text": "To establish a short-term memory selection criterion, we design a confidence prediction module to obtain the confidence score $p_{c}^{t}\\in[0,1]$ corresponding to the tracking result, which will be introduced in Sec. 3.5. Intuitively, a higher confidence score suggests that the current tracking result is more conducive for subsequent tracking and should thus be stored. The thorough storage process is provided in Sec. A.3. Compared to the sliding window, this method can consider a longer temporal range. Additionally, the stored memories are not adjacent to each other, which reduces redundancy. ", "page_idx": 5}, {"type": "text", "text": "3.5 Prediction Head and Loss ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "Based on the target-related search feature $f_{r}^{t}\\in\\mathbb{R}^{N_{x}\\times D}$ , the prediction head is used to predict the final bounding box $b^{t}$ and its corresponding confidence score $p_{c}^{t}$ . We employ a classic CNN-based tracking head [41, 40]. First, $f_{r}^{t}$ is transformed into a 2D spatial feature map. Subsequently, after passing through the stacked Conv-BN-ReLU layers, we obtain a classification score map $P\\in[0,1]^{1\\times{\\dot{H}}_{s}\\times W_{s}^{\\bullet}}$ , the size of the bounding box $B\\in[0,\\dot{1}]^{2}{^\\times}H_{s}\\times W_{s}$ , and the offset size $O\\in[\\bar{0},1)^{2\\times{\\cal H}_{s}\\times{\\cal W}_{s}}$ . Based on these features, we predict the centroid position and scale of the target, yielding the predicted bounding box $b^{t}$ . Additionally, we employ an additional CNN-based branch to predict $p_{c}^{t}$ . ", "page_idx": 5}, {"type": "text", "text": "For the $b^{t}$ , we employ the focal loss $L_{c l s}$ [47], $L_{1}$ loss, and the generalized IoU loss $L_{i o u}$ [48] for supervision, which are widely used in tracker design. Regarding the confidence score $p_{c}^{t}$ , we first calculate the IoU value between the tracking result and the ground truth, and utilize the $L_{2}$ loss between IoU and $p_{c}^{t}$ for supervision. The overall loss function is formulated as follows: ", "page_idx": 5}, {"type": "equation", "text": "$$\n{\\cal L}_{a l l}=\\lambda_{L_{c l s}}{\\cal L}_{c l s}+\\lambda_{i o u}{\\cal L}_{i o u}+\\lambda_{L_{1}}{\\cal L}_{1}+\\lambda_{L_{2}}{\\cal L}_{2},\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $\\lambda_{L_{c l s}}=1,\\lambda_{i o u}=2,\\lambda_{L_{1}}=5$ and $\\lambda_{L_{2}}=1$ are the regularization parameters. ", "page_idx": 5}, {"type": "table", "img_path": "ZK1CZXKgG5/tmp/7d2481bdf948d009dfbf8ba7ac305cfb6e8bd012f2997fa176a426150f571577.jpg", "table_caption": ["Table 1: Comparison with state-of-the-arts on four popular benchmarks: MGIT [5], TNL2K [26], LaSOT [27] and $\\mathrm{LaSOT}_{e x t}$ [28]. The best two results are highlighted in red and blue, respectively. "], "table_footnote": [], "page_idx": 6}, {"type": "text", "text": "4 Experiments ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "4.1 Implementation Details ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "We use RoBERTa-Base [44] as our text encoder and HiViT-Base [42, 39, 40] as our vision encoder, with the token dimension $D$ set to 512. The sizes of template patches and search images are $192\\times192$ and $384\\times384$ , respectively. For the acquisition of short-term memory, both the visual and textual branches consist of three SMG layers. For the generation and fusion of adaptive prompts, all $T r a n s_{D e c}$ operations are conducted using a single transformer decoder layer. Additionally, in the memory storage module, the default length for long-term memory is set to eight. ", "page_idx": 6}, {"type": "text", "text": "We use the training splits of LaSOT [27], TNL2K [26], RefCOCOg [49], and OTB99-Lang [1] to train our model. Each training sample consists of a text description, along with one template patch and eight search frames from the same video sequence. Utilizing the text description and template patch as prompts, we iteratively train the model by selecting one search image at a time. We employ the AdamW to optimize the network parameters and conduct a total of 200 training epochs. 20,000 image pairs are randomly sampled in each epoch. The model is trained on a server with four A5000 GPUs and tested on an RTX-3090 GPU. The tracking speed is about 32 FPS. ", "page_idx": 6}, {"type": "text", "text": "4.2 Comparison with State-of-the-art ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "We evaluate MemVLT on four benchmarks, including MGIT [5], TNL2K [26], LaSOT [27] and $\\mathrm{LaSOT}_{e x t}$ [28]. MemVLT is compared with existing state-of-the-art (SOTA) VLTs, which share the similar task setting and training datasets configuration to ensure a fair comparison. ", "page_idx": 6}, {"type": "text", "text": "MGIT. MGIT is a novel large-scale benchmark [2, 5] specifically tailored for the VLT task. Each sequence contains complex spatio-temporal causal relationships and is annotated with language descriptions at three levels of granularity: action, activity, and story [5]. As shown in Tab. 1, MemVLT demonstrates superior performance compared to other VLTs at the action granularity. Particularly, MemVLT excels over the SOTA tracker JointNLT [14], surpassing it by $8.4\\%$ , $2.7\\%$ , and $19.2\\%$ in area under the curve (AUC), normalized precision $(\\mathrm{P_{Norm}})$ , and precision score (P), respectively. Although JointNLT is equipped with a temporal module, this temporal information does not interact with the initial prompts. In other words, the initial static prompts still dominate the tracking process. These results highlight that the utilization of adaptive prompts plays a crucial role in complex scenarios. Additionally, our model also achieves optimal performance under the activity and story text settings (see Tab. A1). ", "page_idx": 6}, {"type": "table", "img_path": "ZK1CZXKgG5/tmp/b51d28781455bd767be146a6d117f2049cb7dce303da79e5d5e0c2a4e391ef86.jpg", "table_caption": ["Table 3: Ablation study on important model components. The best results are shown in red. "], "table_footnote": [], "page_idx": 7}, {"type": "table", "img_path": "ZK1CZXKgG5/tmp/f0fb054b059e25b84aa8446af72ded4b7c86665cc4d52d1899efc0ee0a9e41c2.jpg", "table_caption": ["Table 4: Comparison of different longterm memory storage methods. "], "table_footnote": [], "page_idx": 7}, {"type": "text", "text": "TNL2K. TNL2K is designed for the VLT task, and the introduction of attributes such as \"adversarial samples\", \"modality switch\" and \"cross-camera\" significantly adds to the challenges[26]. In Tab. 1, our proposed framework demonstrates superior performance compared to existing VLTs. When compared with SOTA tracker MMTrack [16], which doesn’t utilize the temporal information, our approach achieves gains of $4.7\\%$ , $5.7\\%$ , and $8.0\\%$ in AUC, $\\mathrm{P_{Norm}}$ , and P, respectively. These results underscore the effectiveness of leveraging memory information for providing adaptive prompts. ", "page_idx": 7}, {"type": "text", "text": "LaSOT and $\\mathbf{LaSOT}_{e x t}$ . LaSOT and $\\mathrm{LaSOT}_{e x t}$ are extensions of traditional long-term visual tracking benchmarks [27, 55] by adding language annotations. In addition to the challenges in long-term tracking, sequences in $\\mathrm{LaSOT}_{e x t}$ also include many similar distractors, further complicating the tracking task. Nevertheless, our method still achieves outstanding performance, as demonstrated in Tab. 1. For instance, our model outperforms the SOTA algorithms in ", "page_idx": 7}, {"type": "table", "img_path": "ZK1CZXKgG5/tmp/48a655aa33aeb4f4b525766b494bc4f20a988fcb189beb9e9912618e8b4e303d.jpg", "table_caption": ["Table 2: Results of efficiency analysis. "], "table_footnote": [], "page_idx": 7}, {"type": "text", "text": "LaSOT and $\\mathrm{LaSOT}_{e x t}$ by $1.7\\%$ and $2.7\\%$ in terms of AUC, respectively. The strong performance across multiple benchmarks also reflects the generalization capability of MemVLT to diverse video environments and corresponding linguistic annotation styles. ", "page_idx": 7}, {"type": "text", "text": "Efficiency analysis. In Tab. 2, we compare MemVLT with the two latest VLTs in terms of efficiency (Params and Speed) and performance (AUC and P on TNL2K). Compared to JointNLT [14], which only introduces temporal features in the decoder phase, MemVLT fully leverages memory information during the feature fusion stage. Despite the increased number of parameters, the model performance is significantly improved without compromising tracking speed. As for MMTrack [16], the absence of temporal modeling accelerates its forward process but limits tracking performance. These results underscore the trade-off between efficiency and performance achieved by MemVLT. ", "page_idx": 7}, {"type": "text", "text": "4.3 Ablation Study ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "In this section, we conduct comprehensive ablation studies on the TNL2K [26] benchmark. ", "page_idx": 7}, {"type": "text", "text": "Study on important model components. The core insight of our proposed model lies in the modeling and utilization of memory information, which adjusts initial static visual-textual prompts to adapt to the dynamic changes of the target. To investigate the effect of different model components, we conduct ablation analyses based on whether the incorporation of memory information is utilized to generate the adaptive visual or textual prompts, corresponding to the $V i s i o n_{a d a p}$ and $T e x t_{a d a p}$ entries in Tab. 3. Tab. 3 (#1) presents the performance without utilizing the memory information. Comparing it with the results in Tab. 3 (#2, #3), we observe that utilizing memory information in any single modality can enhance performance. For example, adaptive visual or textual prompts lead to a $3.3\\%$ and $3.4\\%$ increase in AUC, respectively. Additionally, Tab. 3 (#4) further demonstrates that, under the joint influence of adaptive visual-textual prompts, the model achieves optimal performance. ", "page_idx": 7}, {"type": "text", "text": "Study on memory interaction. The MIM plays a crucial role in the forward process, and we conduct ablation analysis on specific model designs. Tab. 5 (#2) indicates that global visual and textual tokens (i.e., $f_{g v}^{t}$ and $f_{g l}^{t})$ are excluded from the construction of memory information. Comparing with the baseline (Tab. 5 (#1)), it is evident that the inclusion of global tokens enhances tracking performance. Tab. 5 (#3) shows that directly integrating search features with short-term memories significantly reduces the model’s performance. This indicates the importance of the adaptive prompts generation process. ", "page_idx": 7}, {"type": "table", "img_path": "ZK1CZXKgG5/tmp/2691d89f0b6d413e22081eeddb6ffffefb376a084a44dba79f148da3667504cd.jpg", "table_caption": ["Table 5: Ablation study on memory interaction. "], "table_footnote": [], "page_idx": 8}, {"type": "table", "img_path": "ZK1CZXKgG5/tmp/6af205fc483209fa48669090c4716a191a586a61013f6a8530ea493b10d6e4d0.jpg", "table_caption": ["Table 6: Generalizability analysis on SOT. "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "", "page_idx": 8}, {"type": "text", "text": "Study on long-term memory lengths. we employ a buffer $M^{t}$ with a length of $L_{m}$ to represent longterm memory. Here, we analyze the model’s performance under different buffer lengths. As shown in Tab. 7, we observe that as the buffer length increases, the model’s performance initially rises and then stabilizes. Notably, the model achieves optimal performance when the buffer length is set to 8. ", "page_idx": 8}, {"type": "text", "text": "Study on long-term memory storage method. For our proposed section-top method, we compare it with other storage methods. As shown in Tab. 4, sliding window is commonly adapted by recent trackers involving temporal saving [14, 30, 31, 32]; top- $L$ prioritizes storing the top $L$ short-term memories with the highest confidence; section- $.L$ divides historical memory into $L$ sections, with each section storing the latest short-term memory. It can be observed that the performance of top- $.L$ is superior to sliding window, highlighting the significance of storing important short-term memories. Additionally, section- $.L$ outperforms top- $.L$ , indicating the benefits of considering a longer temporal range. By combining the advantages of section- $.L$ and top- $L$ , section-top achieves optimal performance. ", "page_idx": 8}, {"type": "table", "img_path": "ZK1CZXKgG5/tmp/0f1d3ff4c0f291e3c5c3ccffa46938d787a3d1d5a3853e1e9db1f8111ff4d1c2.jpg", "table_caption": ["Table 7: Ablation study on longterm memory lengths. "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "Generalizability of our memory mechanism. Given that our proposed memory mechanism modeling significantly enhances the performance of vision-language trackers, a natural question arises: can this memory mechanism generalize to vision-only taskers? To explore this, it is necessary to conduct relevant experimental analysis. Specifically, we remove the text-related components from MemVLT, seamlessly converting it into a vision-only tracker. As shown in Tab. 6, our proposed Memory Interaction Module (MIM) and Memory Storage Module (MSM) progressively improve the performance of the vision-only tracker, demonstrating the strong generalizability of our method. ", "page_idx": 8}, {"type": "text", "text": "For more detailed implementation specifics and further comparative analysis, please refer to Sec. B and Sec. C. ", "page_idx": 8}, {"type": "image", "img_path": "ZK1CZXKgG5/tmp/eadcaae3bc26587ab1adfebad2d8ac6536ea5f8acc820dfc208c2bc9fdc48c79.jpg", "img_caption": ["Figure 3: (a)-(c): Heatmaps obtained during the forward Figure 4: Comparison between conprocess of MemVLT, integrating various adaptive prompts. fidence prediction and IoU values (d): Heatmap guided solely by the initial fixed prompts. (taking the \"advSamp_INF_bus6\" The above process diagrams depict the types and sequence sequence as an Example). of feature integration. We also illustrate the tracked result bbox and groundtruth bbox. Better viewed with zoom-in. "], "img_footnote": [], "page_idx": 8}, {"type": "text", "text": "4.4 Qualitative Analysis. ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "Fig. 3 (a)-(c) depict the variations of heatmaps over the search region during the forward process. Through the integration of adaptive prompts, the model ultimately directs its focus towards the tracking target. Compared to merely fusing initial fixed multimodal prompts (Fig. 3 (d)), MemVLT demonstrates improved capability in scenarios where the target state deviates from the given static prompts. ", "page_idx": 9}, {"type": "text", "text": "Taking the \"advSamp_INF_bus6\" sequence from TNL2K as an example, we showcase the model’s confidence prediction scores against the actual IoU values in Fig. 4. It can be observed that their variations align closely, indicating the effectiveness of our confidence prediction module. ", "page_idx": 9}, {"type": "text", "text": "", "page_idx": 9}, {"type": "image", "img_path": "ZK1CZXKgG5/tmp/013384fb605c91b3d4d9aeee35438c7aedbe9f5880ba27502992ffb42e0c28d9.jpg", "img_caption": ["Figure 5: Qualitative comparison results of our tracker with other two latest VLTs (i.e., JointNLT [14] and MMTrack [16]) on three challenging sequences from TNL2K [26] benchmark. The first column indicates the provided initial template information. Better viewed in color with zoom-in. "], "img_footnote": [], "page_idx": 9}, {"type": "text", "text": "This facilitates the utilization of the confidence prediction score as criteria for selecting short-term memory. ", "page_idx": 9}, {"type": "text", "text": "As shown in Fig. 5, we visualize the tracking results of our model and the previous two SOTA models on three challenging sequences from TNL2K [26]. In these sequences, the scenes contain distractors, and the state of the target undergoes significant changes. It is evident that our model exhibits greater robustness [56] compared to others. This validates that our adaptive prompts contribute to addressing these challenges, further demonstrating the efficacy of our proposed model. ", "page_idx": 9}, {"type": "text", "text": "5 Conclusion ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "We propose a novel vision-language tracker, MemVLT, which models memory mechanisms to provide adaptive multimodal prompts for tracking guidance. Drawing from the Complementary Learning Systems theory, we emphasize the importance of storing and interacting between short-term and longterm memories for generalized adaptation. Therefore, we incorporate memory storage and memory interaction modules. By comprehensively leveraging memory information to generate adaptive prompts, MemVLT provides consistent references for dynamically changing targets, thus achieving effective tracking performance. Extensive experiments demonstrate that our method achieves new state-of-the-art performance on four widely used benchmarks, showcasing its generalization ability across various video environments and linguistic annotation styles. ", "page_idx": 9}, {"type": "text", "text": "Limitations. Our proposed method leverages learnable queries to implicitly construct the relationship between historical target information and the current situation, resulting in short-term memory representations of the target. The notable results obtained demonstrate the effectiveness of this memory modeling mechanism. However, these memory representations lack explicit supervision, which diminishes their interpretability. To address this limitation, we believe that incorporating tracking result data (such as target and background information at various time steps) into the memory representation could be beneficial. This integration could enhance the comprehensiveness of the memory representations and facilitate the design of diverse loss functions for explicit supervision. We consider this approach a promising direction for our future research. ", "page_idx": 9}, {"type": "text", "text": "Acknowledgments and Disclosure of Funding ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "This work is jointly supported by the National Science and Technology Major Project (No.2022ZD0116403), the National Natural Science Foundation of China (No.62176255), and the Strategic Priority Research Program of Chinese Academy of Sciences (No.XDA27010201). ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "[1] Zhenyang Li, Ran Tao, Efstratios Gavves, Cees GM Snoek, and Arnold WM Smeulders. Tracking by natural language specification. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 6495–6503, 2017.   \n[2] Shiyu Hu, Xin Zhao, Lianghua Huang, and Kaiqi Huang. Global instance tracking: Locating target more like humans. IEEE Transactions on Pattern Analysis and Machine Intelligence, 45(1):576–592, 2023.   \n[3] Shiyu Hu, Xin Zhao, and Kaiqi Huang. Sotverse: A user-defined task space of single object tracking. International Journal of Computer Vision, 132:872–930, 2024.   \n[4] Xin Zhao, Shiyu Hu, Yipei Wang, Jing Zhang, Yimin Hu, Rongshuai Liu, Haibin Ling, Yin Li, Renshu Li, Kun Liu, and Jiadong Li. Biodrone: A bionic drone-based single object tracking benchmark for robust vision. International Journal of Computer Vision, 132:1659–1684, 2024.   \n[5] Shiyu Hu, Dailing Zhang, Meiqi Wu, Xiaokun Feng, Xuchen Li, Xin Zhao, and Kaiqi Huang. A multi-modal global instance tracking benchmark (mgit): Better locating target in complex spatio-temporal and causal relationship. In Thirty-seventh Conference on Neural Information Processing Systems Datasets and Benchmarks Track, 2023.   \n[6] Xuchen Li, Xiaokun Feng, Shiyu Hu, Meiqi Wu, Dailing Zhang, Jing Zhang, and Kaiqi Huang. Dtllm-vlt: Diverse text generation for visual language tracking based on llm. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 7283–7292, 2024.   \n[7] Xuchen Li, Shiyu Hu, Xiaokun Feng, Dailing Zhang, Meiqi Wu, Jing Zhang, and Kaiqi Huang. Dtvlt: A multi-modal diverse text benchmark for visual language tracking based on llm. arXiv preprint arXiv:2410.02492, 2024.   \n[8] Xuchen Li, Shiyu Hu, Xiaokun Feng, Dailing Zhang, Meiqi Wu, Jing Zhang, and Kaiqi Huang. Visual language tracking with multi-modal interaction: A robust benchmark. arXiv preprint arXiv:2409.08887, 2024.   \n[9] Alper Yilmaz, Omar Javed, and Mubarak Shah. Object tracking: A survey. Acm computing surveys (CSUR), 38(4):13–es, 2006.   \n[10] Pengyu Zhang, Dong Wang, and Huchuan Lu. Multi-modal visual tracking: Review and experimental comparison. Computational Visual Media, 10(2):193–214, 2024.   \n[11] Qi Feng, Vitaly Ablavsky, Qinxun Bai, and Stan Sclaroff. Siamese natural language tracker: Tracking by natural language descriptions with siamese trackers. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 5847–5856, 2021.   \n[12] Yihao Li, Jun Yu, Zhongpeng Cai, and Yuwen Pan. Cross-modal target retrieval for tracking by natural language. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 4931–4940, 2022.   \n[13] Mingzhe Guo, Zhipeng Zhang, Heng Fan, and Liping Jing. Divert more attention to visionlanguage tracking. In S. Koyejo, S. Mohamed, A. Agarwal, D. Belgrave, K. Cho, and A. Oh, editors, Proceedings of the Advances in Neural Information Processing Systems, volume 35, pages 4446–4460, 2022.   \n[14] Li Zhou, Zikun Zhou, Kaige Mao, and Zhenyu He. Joint visual grounding and tracking with natural language specification. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 23151–23160, 2023.   \n[15] Rong Wang, Zongheng Tang, Qianli Zhou, Xiaoqian Liu, Tianrui Hui, Quange Tan, and Si Liu. Unified transformer with isomorphic branches for natural language tracking. IEEE Transactions on Circuits and Systems for Video Technology, 2023.   \n[16] Yaozong Zheng, Bineng Zhong, Qihua Liang, Guorong Li, Rongrong Ji, and Xianxian Li. Towards unified token learning for vision-language tracking. IEEE Transactions on Circuits and Systems for Video Technology, 2023.   \n[17] Daniel L Schacter, Donna Rose Addis, and Randy L Buckner. Remembering the past to imagine the future: the prospective brain. Nature reviews neuroscience, 8(9):657–661, 2007.   \n[18] John Duncan and Glyn Humphreys. Beyond the search surface: visual search and attentional engagement. Journal of Experimental Psychology: Human Perception and Performance, 1992.   \n[19] Timothy J Vickery, Li-Wei King, and Yuhong Jiang. Setting up the target template in visual search. Journal of vision, 5(1):8–8, 2005.   \n[20] Christian NL Olivers, Judith Peters, Roos Houtkamp, and Pieter R Roelfsema. Different states in visual working memory: When it guides attention and when it does not. Trends in cognitive sciences, 15(7):327–334, 2011.   \n[21] Geoffrey F Woodman, Steven J Luck, and Jeffrey D Schall. The role of working memory representations in the control of attention. Cerebral cortex, 17(suppl_1):i118–i124, 2007.   \n[22] James L McClelland, Bruce L McNaughton, and Randall C O’Reilly. Why there are complementary learning systems in the hippocampus and neocortex: insights from the successes and failures of connectionist models of learning and memory. Psychological review, 102(3):419, 1995.   \n[23] Weinan Sun, Madhu Advani, Nelson Spruston, Andrew Saxe, and James E Fitzgerald. Organizing memories for generalization in complementary learning systems. Nature neuroscience, 26(8):1438–1448, 2023.   \n[24] Pablo Alvarez and Larry R Squire. Memory consolidation and the medial temporal lobe: a simple network model. Proceedings of the national academy of sciences, 91(15):7041–7045, 1994.   \n[25] Sepp Hochreiter and Jürgen Schmidhuber. Long short-term memory. Neural computation, 9(8):1735–1780, 1997.   \n[26] Xiao Wang, Xiujun Shu, Zhipeng Zhang, Bo Jiang, Yaowei Wang, Yonghong Tian, and Feng Wu. Towards more flexible and accurate object tracking with natural language: Algorithms and benchmark. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 13763–13773, 2021.   \n[27] Heng Fan, Liting Lin, Fan Yang, Peng Chu, Ge Deng, Sijia Yu, Hexin Bai, Yong Xu, Chunyuan Liao, and Haibin Ling. Lasot: A high-quality benchmark for large-scale single object tracking. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 5369–5378, 2019.   \n[28] Heng Fan, Hexin Bai, Liting Lin, Fan Yang, Peng Chu, Ge Deng, Sijia Yu, Harshit, Mingzhen Huang, Juehuan Liu, et al. Lasot: A high-quality large-scale single object tracking benchmark. International Journal of Computer Vision, 129:439–461, 2021.   \n[29] Zhengyuan Yang, Tushar Kumar, Tianlang Chen, Jingsong Su, and Jiebo Luo. Groundingtracking-integration. IEEE Transactions on Circuits and Systems for Video Technology, 31(9):3433–3443, 2021.   \n[30] Martin Danelljan, Goutam Bhat, Fahad Shahbaz Khan, and Michael Felsberg. Atom: Accurate tracking by overlap maximization. In Proceedings of the IEEE/CVF conference on computer vision and pattern recognition, pages 4660–4669, 2019.   \n[31] Zhihong Fu, Qingjie Liu, Zehua Fu, and Yunhong Wang. Stmtrack: Template-free visual tracking with space-time memory networks. In Proceedings of the IEEE/CVF conference on computer vision and pattern recognition, pages 13774–13783, 2021.   \n[32] Ding Ma and Xiangqian Wu. Tracking by natural language specification with long short-term context decoupling. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 14012–14021, 2023.   \n[33] Dharshan Kumaran, Demis Hassabis, and James L McClelland. What learning systems do intelligent agents need? complementary learning systems theory updated. Trends in cognitive sciences, 20(7):512–534, 2016.   \n[34] Xiang Lisa Li and Percy Liang. Prefix-tuning: Optimizing continuous prompts for generation. arXiv preprint arXiv:2101.00190, 2021.   \n[35] Kaiyang Zhou, Jingkang Yang, Chen Change Loy, and Ziwei Liu. Learning to prompt for vision-language models. International Journal of Computer Vision, 130(9):2337–2348, 2022.   \n[36] Hyojin Bahng, Ali Jahanian, Swami Sankaranarayanan, and Phillip Isola. Visual prompting: Modifying pixel space to adapt pre-trained models. arXiv preprint arXiv:2203.17274, 3:11–12, 2022.   \n[37] Alec Radford, Jong Wook Kim, Chris Hallacy, Aditya Ramesh, Gabriel Goh, Sandhini Agarwal, Girish Sastry, Amanda Askell, Pamela Mishkin, Jack Clark, et al. Learning transferable visual models from natural language supervision. In International conference on machine learning, pages 8748–8763. PMLR, 2021.   \n[38] Yaozong Zheng, Bineng Zhong, Qihua Liang, Zhiyi Mo, Shengping Zhang, and Xianxian Li. Odtrack: Online dense temporal token learning for visual tracking. arXiv preprint arXiv:2401.01686, 2024.   \n[39] Liangtao Shi, Bineng Zhong, Qihua Liang, Ning Li, Shengping Zhang, and Xianxian Li. Explicit visual prompts for visual object tracking. arXiv preprint arXiv:2401.03142, 2024.   \n[40] Jinxia Xie, Bineng Zhong, Zhiyi Mo, Shengping Zhang, Liangtao Shi, Shuxiang Song, and Rongrong Ji. Autoregressive queries for adaptive tracking with spatio-temporaltransformers. arXiv preprint arXiv:2403.10574, 2024.   \n[41] Botao Ye, Hong Chang, Bingpeng Ma, Shiguang Shan, and Xilin Chen. Joint feature learning and relation modeling for tracking: A one-stream framework. In Proceedings of the European Conference on Computer Vision, pages 341–357, 2022.   \n[42] Xiaosong Zhang, Yunjie Tian, Lingxi Xie, Wei Huang, Qi Dai, Qixiang Ye, and Qi Tian. Hivit: A simpler and more efficient design of hierarchical vision transformer. In The Eleventh International Conference on Learning Representations, 2022.   \n[43] Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. Bert: Pre-training of deep bidirectional transformers for language understanding. arXiv preprint arXiv:1810.04805, 2018.   \n[44] Yinhan Liu, Myle Ott, Naman Goyal, Jingfei Du, Mandar Joshi, Danqi Chen, Omer Levy, Mike Lewis, Luke Zettlemoyer, and Veselin Stoyanov. Roberta: A robustly optimized bert pretraining approach. arXiv preprint arXiv:1907.11692, 2019.   \n[45] Alexey Dosovitskiy, Lucas Beyer, Alexander Kolesnikov, Dirk Weissenborn, Xiaohua Zhai, Thomas Unterthiner, Mostafa Dehghani, Matthias Minderer, Georg Heigold, Sylvain Gelly, et al. An image is worth 16x16 words: Transformers for image recognition at scale. arXiv preprint arXiv:2010.11929, 2020.   \n[46] Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz Kaiser, and Illia Polosukhin. Attention is all you need. Proceedings of the Advances in Neural Information Processing Systems, 30, 2017.   \n[47] Hei Law and Jia Deng. Cornernet: Detecting objects as paired keypoints. In Proceedings of the European conference on computer vision (ECCV), pages 734–750, 2018.   \n[48] Hamid Rezatofighi, Nathan Tsoi, JunYoung Gwak, Amir Sadeghian, Ian Reid, and Silvio Savarese. Generalized intersection over union: A metric and a loss for bounding box regression. In Proceedings of the IEEE/CVF conference on computer vision and pattern recognition, pages 658–666, 2019.   \n[49] Junhua Mao, Jonathan Huang, Alexander Toshev, Oana Camburu, Alan L Yuille, and Kevin Murphy. Generation and comprehension of unambiguous object descriptions. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 11–20, 2016.   \n[50] Xiao Wang, Chenglong Li, Rui Yang, Tianzhu Zhang, Jin Tang, and Bin Luo. Describe and attend to track: Learning natural language guided structural representation and visual attention for object tracking. arXiv preprint arXiv:1811.10014, 2018.   \n[51] Qi Feng, Vitaly Ablavsky, Qinxun Bai, and Stan Sclaroff. Robust visual object tracking with natural language region proposal network. arXiv preprint arXiv:1912.02048, 1(7):8, 2019.   \n[52] Qi Feng, Vitaly Ablavsky, Qinxun Bai, Guorong Li, and Stan Sclaroff. Real-time visual object tracking with natural language description. In Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision, pages 700–709, 2020.   \n[53] Haojie Zhao, Xiao Wang, Dong Wang, Huchuan Lu, and Xiang Ruan. Transformer visionlanguage tracking via proxy token guided cross-modal fusion. Pattern Recognition Letters, 168:10–16, 2023.   \n[54] Yanyan Shao, Shuting He, Qi Ye, Yuchao Feng, Wenhan Luo, and Jiming Chen. Context-aware integration of language and visual references for natural language tracking. arXiv preprint arXiv:2403.19975, 2024.   \n[55] Yi Wu, Jongwoo Lim, and Ming-Hsuan Yang. Object tracking benchmark. IEEE Transactions on Pattern Analysis and Machine Intelligence, 37(09):1834–1848, 2015.   \n[56] Honghao Chen, Yurong Zhang, Xiaokun Feng, Xiangxiang Chu, and Kaiqi Huang. Revealing the dark secrets of extremely large kernel convnets on robustness. arXiv preprint arXiv:2407.08972, 2024.   \n[57] Yutao Cui, Cheng Jiang, Limin Wang, and Gangshan Wu. Mixformer: End-to-end tracking with iterative mixed attention. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 13608–13618, 2022.   \n[58] Mingzhe Guo, Zhipeng Zhang, Heng Fan, Liping Jing, Yilin Lyu, Bing Li, and Weiming Hu. Learning target-aware representation for visual tracking via informative interactions. arXiv preprint arXiv:2201.02526, 2022.   \n[59] Shenyuan Gao, Chunluan Zhou, Chao Ma, Xinggang Wang, and Junsong Yuan. Aiatrack: Attention in attention for transformer visual tracking. In European Conference on Computer Vision, pages 146–164. Springer, 2022.   \n[60] Boyu Chen, Peixia Li, Lei Bai, Lei Qiao, Qiuhong Shen, Bo Li, Weihao Gan, Wei Wu, and Wanli Ouyang. Backbone is all your need: A simplified architecture for visual object tracking. In European Conference on Computer Vision, pages 375–392. Springer, 2022.   \n[61] Shenyuan Gao, Chunluan Zhou, and Jun Zhang. Generalized relation modeling for transformer tracking. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 18686–18695, 2023.   \n[62] Xin Chen, Houwen Peng, Dong Wang, Huchuan Lu, and Han Hu. Seqtrack: Sequence to sequence learning for visual object tracking. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 14572–14581, 2023.   \n[63] Xing Wei, Yifan Bai, Yongchao Zheng, Dahu Shi, and Yihong Gong. Autoregressive visual tracking. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 9697–9706, 2023.   \n[64] Xin Li, Yuqing Huang, Zhenyu He, Yaowei Wang, Huchuan Lu, and Ming-Hsuan Yang. Citetracker: Correlating image and text for visual tracking. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 9974–9983, 2023.   \n[65] Qiangqiang Wu, Tianyu Yang, Ziquan Liu, Baoyuan Wu, Ying Shan, and Antoni B Chan. Dropmae: Masked autoencoders with spatial-attention dropout for tracking tasks. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 14561–14571, 2023.   \n[66] Yidong Cai, Jie Liu, Jie Tang, and Gangshan Wu. Robust object modeling for visual tracking. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 9589–9600, 2023.   \n[67] Dawei Yang, Jianfeng He, Yinchao Ma, Qianjin Yu, and Tianzhu Zhang. Foregroundbackground distribution modeling transformer for visual object tracking. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 10117–10127, 2023.   \n[68] Yifan Bai, Zeyang Zhao, Yihong Gong, and Xing Wei. Artrackv2: Prompting autoregressive tracker where to look and how to describe. arXiv preprint arXiv:2312.17133, 2023.   \n[69] Wenrui Cai, Qingjie Liu, and Yunhong Wang. Learning historical status prompt for accurate and robust visual tracking. arXiv preprint arXiv:2311.02072, 2023.   \n[70] Yuqing Huang, Xin Li, Zikun Zhou, Yaowei Wang, Zhenyu He, and Ming-Hsuan Yang. Rtracker: Recoverable tracking via pn tree structured memory. arXiv preprint arXiv:2403.19242, 2024.   \n[71] Lingyi Hong, Shilin Yan, Renrui Zhang, Wanyun Li, Xinyu Zhou, Pinxue Guo, Kaixun Jiang, Yiting Chen, Jinglun Li, Zhaoyu Chen, et al. Onetracker: Unifying visual object tracking with foundation models and efficient tuning. arXiv preprint arXiv:2403.09634, 2024.   \n[72] Huanlong Zhang, Jingchao Wang, Jianwei Zhang, Tianzhu Zhang, and Bineng Zhong. Onestream vision-language memory network for object tracking. IEEE Transactions on Multimedia, 26:1720–1730, 2023.   \n[73] Chunhui Zhang, Xin Sun, Yiqian Yang, Li Liu, Qiong Liu, Xi Zhou, and Yanfeng Wang. All in one: Exploring unified vision-language tracking with multi-modal alignment. In Proceedings of the 31st ACM International Conference on Multimedia, pages 5552–5561, 2023. ", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "", "page_idx": 13}, {"type": "text", "text": "", "page_idx": 14}, {"type": "text", "text": "Appendices ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "A More Details on the MemVLT Model ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "In the following sections, we will provide comprehensive details on the implementation of MemVLT. ", "page_idx": 15}, {"type": "text", "text": "A.1 Input Encoder ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "Vision Encoder. As discussed in Sec. 3.2, our vision encoder is based on HiVit [42], which is constructed by stacking a series of transformer network layers. To obtain global semantic features, we introduce the [CLS] token [43] in the last two layers. Specifically, the initial template and search image tokens are concatenated and jointly modeled, aligning with the existing one-stream network architecture [41]. After obtaining the initial encoded template-search features, we introduce the [CLS] token. The [CLS] token is then concatenated with the obtained template-search features. This concatenated feature is fed into the last two layers for further feature extraction and relationship modeling. Finally, we obtain the search feature $\\bar{f}_{x}^{t}\\in\\mathbb{R}^{N_{x}\\times D}$ , template feature $f_{z}^{t}\\in\\mathbb{R}^{N_{z}\\times D}$ , and the global visual feature $f_{g v}^{t}\\in\\mathbb{R}^{1\\times D}$ . ", "page_idx": 15}, {"type": "text", "text": "Text Encoder. We employ the RoBERTa [44] model as our text encoder. Existing VLTs typically set a maximum text truncation length, e.g., JointNLT supports a maximum text length of 40. However, for datasets providing detailed descriptions of target states, such as the MGIT dataset[5], the text length often exceeds this threshold. Simply truncating the text would diminish its utility for the tracker. Therefore, we do not set a maximum text truncation length and use sinusoidal position encoding to accommodate variable text lengths. ", "page_idx": 15}, {"type": "text", "text": "A.2 Memory Interaction Module ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "As shown in Fig. 2, the Memory Interaction module mainly consists of two types of networks: the short-term memory generation (SMG) layer and the transformer decoder layer. To facilitate a better understanding of their specific computational processes, we illustrate their diagram in Fig. A1. ", "page_idx": 15}, {"type": "text", "text": "For the transformer decoder layer [46], we illustrate the detailed computation process corresponding to $T r a n s_{d e c}$ (as shown in Eq. 9, Eq. 10, Eq. 11, Eq. 12) as follows: ", "page_idx": 15}, {"type": "equation", "text": "$$\nx^{\\prime}=N o r m(x+\\Phi_{C A}(x,y)),\n$$", "text_format": "latex", "page_idx": 15}, {"type": "equation", "text": "$$\nz=N o r m(x^{\\prime}+F F N(x^{\\prime})).\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "Here, $\\Phi_{C A}(\\cdot,\\cdot)$ denotes the cross-attention operation where the first element serves as $Q$ and the second element serves to obtain $K$ and $V$ [46]. Norm represents the layer normalization operation and $F F N$ denotes the feed-forward network. For brevity, we omit the positional encoding. ", "page_idx": 15}, {"type": "text", "text": "Compared to the standard transformer decoder layer [46], we omit the initial self-attention operation.   \nThis helps reduce computational overhead. ", "page_idx": 15}, {"type": "text", "text": "A.3 Memory Storage Module ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "For the section-top long-term memory storage method proposed in this work, the basic approach is to first uniformly divide past time intervals into $L_{m}$ sections and then select the most representative short-term memory within each section to save. ", "page_idx": 15}, {"type": "text", "text": "To achieve this goal, we introduce two buffers, $B^{t}$ and $B_{c}^{t}$ , which are used to store all memory units up to time $t$ and their corresponding confidence scores, respectively. We initialize $B^{t}$ and $B_{c}^{t}$ as empty sets. For the long-term memory information $M^{t}$ that we aim to obtain, we initialize each memory unit with $\\mathbf{0}\\in\\mathbb{R}^{1\\breve{\\times}D}$ . At time $t$ $\\left(t\\geq1\\right)$ ), the detailed computation process is illustrated in Algorithm 1. ", "page_idx": 15}, {"type": "text", "text": "A.4 Prediction Head ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "The prediction head is used to predict the final bounding box $b^{t}$ and its corresponding confidence score $p_{c}^{t}$ . We employ a CNN-based tracking head [41, 40], which is widely adopted in tracker design. Firstly, the target-related search feature $f_{r}^{\\bar{t}}\\in\\mathbb{R}^{N_{x}\\times D}$ is transformed into a 2D spatial feature map. Subsequently, after passing through $L_{h}$ stacked Conv-BN-ReLU layers, we obtain a classification ", "page_idx": 15}, {"type": "image", "img_path": "ZK1CZXKgG5/tmp/a605932e9f45fb40c1cfff9289c5ed60062dca883132cf8963bfaafcfcdf116c.jpg", "img_caption": ["(a) Short-term Memory Generation Layer "], "img_footnote": [], "page_idx": 16}, {"type": "image", "img_path": "ZK1CZXKgG5/tmp/365698d1a4cfa2c8cdbce1007b7dfda82673e7899764ef86246faf525d5e982b.jpg", "img_caption": ["(b) Transformer Decoder Layer "], "img_footnote": [], "page_idx": 16}, {"type": "text", "text": "Figure A1: (a) The diagram of the short-term memory generation (SMG) Layer. Depending on the input modality data, this module is capable of generating short-term memories for either visual or textual inputs. (b) The diagram of the transformer decoder layer. It primarily consists of a crossattention operation and a fully connected operation. ", "page_idx": 16}, {"type": "text", "text": "score map $P\\in[0,1]^{1\\times H_{s}\\times W_{s}}$ , the size of the bounding box $B\\in[0,1]^{2\\times H_{s}\\times W_{s}}$ , and the offset size O ∈[0, 1)2×Hs×Ws. ", "page_idx": 16}, {"type": "text", "text": "Based on these features, we calculate the tracking bounding box $b^{t}$ and the confidence score $p_{c}^{t}$ through two branches. On one hand, the position with the highest classification score is considered to be the target position, i.e., $(x_{d},y_{d})=\\arg\\operatorname*{max}_{(x,y)}P_{x y}$ . The final target bounding box is obtained as: ", "page_idx": 16}, {"type": "equation", "text": "$$\n(x,y,w,h)=(x_{d}+O(0,x_{d},y_{d}),y_{d}+O(1,x_{d},y_{d}),S(0,x_{d},y_{d}),S(1,x_{d},y_{d})).\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "On the other hand, we employ an additional branch to predict $p_{c}^{t}$ . We first concatenate $P,B$ , and $O$ along the first dimension. Then, this concatenated feature is processed through stacked Conv-BNReLU layers. Finally, the processed features are flattened and passed through a softmax function to produce a regression prediction value within the range [0,1]. ", "page_idx": 16}, {"type": "text", "text": "B More Implementation Details on Experimental Analysis ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "In the following sections, we will present the implementation details of our experimental analysis, including the consistency analysis between search images and prompts, as well as the implementation methods for various model variants in the ablation study. ", "page_idx": 16}, {"type": "text", "text": "B.1 Consistency Analysis ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "As shown in Fig. 1 (a), to quantitatively analyze the consistency between multimodal prompts and the search target, we calculate and plot the consistency curves. For determining the consistency between the search target and the language description, we manually evaluate whether the target state matches the language description, assigning a consistency value of 1 or 0 accordingly. For computing the consistency between the search target and the template patch, we first crop the search target from the search image based on the groundtruth bounding box. Then, we input both the cropped target ", "page_idx": 16}, {"type": "text", "text": "Algorithm 1 Section-Top Long-term Memory Storage Algorithm ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Input: $B^{t-1}$ , $B_{c}^{t-1}$ , $M^{t-1}$ , $m^{t}$ , $p_{c}^{t}$ at time $t$   \nOutput: $M^{t}$   \n1: $\\%$ save the latest memory unit and its corresponding confidence score.   \n2: $B^{t}=B^{t-1}$ .append $^{\\mathrm{\\,}}(m^{t})$ , $B_{c}^{t}=B_{c}^{t-1}$ .append $^{\\mathrm{\\Delta}}(p_{c}^{t})$   \n3: M t = M t−1   \n4: if $t\\leq L_{m}$ then   \n5: $\\%$ select the latest memory to save.   \n6: $M^{t}[t]=m^{t}$   \n7: else   \n8: $\\begin{array}{r}{\\boldsymbol{\\mathbf{\\rho}}_{n}=t\\;\\mathrm{mod}\\;L_{m},t_{d}=\\lfloor\\frac{t}{L_{m}}\\rfloor}\\end{array}$   \n9: $I_{\\mathrm{start}}=(t_{d}+1)\\times(t_{m}-1)+1,I_{\\mathrm{end}}=I_{\\mathrm{start}}+t_{d}$   \n10: $\\%$ select most representative memory unit in each section   \n11: for $i$ in $t_{m}$ to $L_{m}$ do   \n12: $\\begin{array}{r l}&{S e c_{m}=\\bar{B}^{t}[I_{\\mathrm{start}}:I_{\\mathrm{end}}],S e c_{c}=\\mathcal{B}_{c}^{t}[I_{\\mathrm{start}}:I_{\\mathrm{end}}]}\\\\ &{I_{\\mathrm{max}}=\\mathrm{MaxIndex}(S e c_{c})}\\\\ &{M^{t}[i]=\\mathcal{B}^{t}[I_{\\mathrm{max}}]}\\\\ &{I_{\\mathrm{start}}=I_{\\mathrm{end}}+1,I_{\\mathrm{end}}=I_{\\mathrm{start}}+t_{d}-1}\\end{array}$   \n13:   \n14:   \n15:   \n16: end for   \n17: end if   \n18: return $M^{t}$ ", "page_idx": 17}, {"type": "text", "text": "and the template patch into a pretrained ResNet backbone network for feature encoding. Finally, the consistency value is obtained by calculating the cosine similarity between the encoded features. ", "page_idx": 17}, {"type": "text", "text": "B.2 Effectiveness Analysis of Different Model Components ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Corresponding to Tab. 3, we conduct ablation analyses to investigate the effect of different model components, based on whether the incorporation of memory information is utilized to generate adaptive visual or textual prompts. When adaptive visual prompts are not used (i.e., $V i s i o n_{a d a p}$ is not selected), the MIM module neither generates short-term visual memory nor subsequent adaptive visual prompts. Instead, the search feature interacts only with the initial template feature, replacing Eq. 3, Eq. 4, Eq. 5, Eq. 9 and Eq. 10 with Eq. A4. Additionally, to ensure a fair comparison, we set the number of network layers used in Eq. A4 to be the sum of the network layers in Eq. 3, Eq. 4, Eq. 5, Eq. 9 and Eq. 10. ", "page_idx": 17}, {"type": "equation", "text": "$$\nf_{x l}^{t}=T r a n s_{D e c}(f_{x}^{t},f_{l}^{t}).\n$$", "text_format": "latex", "page_idx": 17}, {"type": "text", "text": "Additionally, not selecting $V i s i o n_{a d a p}$ means that no short-term visual memory is stored in the MSM module. Similarly, by not selecting $T e x t_{a d a p}$ , we can achieve this by replacing Eq. 6, Eq. 7, Eq. 8, Eq. 11 and Eq. 11 with the following equation: ", "page_idx": 17}, {"type": "equation", "text": "$$\nf_{r}^{t}=T r a n s_{D e c}(f_{x l}^{t},f_{z}^{t}).\n$$", "text_format": "latex", "page_idx": 17}, {"type": "text", "text": "B.3 Variants of Memory Interaction Module ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Corresponding to Tab. 5, we conduct ablation analyses on the relevant model designs in MIM. The \"remove global tokens\" setting means that the global visual and textual tokens (i.e., $f_{g v}^{t}$ and $f_{g l}^{t})$ are excluded from the construction of memory information. Specifically, the modified expressions for $H_{v}^{t-1}$ and $H_{l}^{t-1}$ are as follows: ", "page_idx": 17}, {"type": "equation", "text": "$$\n\\begin{array}{r}{H_{v}^{t-1}=[^{*}M_{v}^{t-1}]=[m_{v}^{1};\\ldots;m_{v}^{L_{m}}].}\\\\ {H_{l}^{t-1}=[^{*}M_{l}^{t-1}]=[m_{l}^{1};\\ldots;m_{l}^{L_{m}}].}\\end{array}\n$$", "text_format": "latex", "page_idx": 17}, {"type": "text", "text": "The \"remove adaptive prompts\" setting means directly integrating search features with short-term memories, which removes the generation of adaptive prompts and their subsequent fusion with the ", "page_idx": 17}, {"type": "text", "text": "Algorithm 2 Sliding Window Long-term Memory Storage Algorithm ", "page_idx": 18}, {"type": "text", "text": "Input: $M^{t-1}$ , $m^{t}$ , $p_{c}^{t}$ at time $t$   \nOutput: $M^{t}$   \n1: M t = M t−1   \n2: if $t\\leq L_{m}$ then   \n3: $\\%$ select the latest memory to save.   \n4: $M^{t}[t]=m^{t}$   \n5: else   \n6: $\\%$ sliding window process.   \n7: $M^{t}[1:(\\bar{L}_{m}-1)]\\stackrel{\\cdot}{=}M^{t}[2:L_{m}]$   \n8: $M^{t}\\bigl[L_{m}\\bigr]=m^{t}$   \n9: end if   \n10: return $M^{t}$ ", "page_idx": 18}, {"type": "text", "text": "Algorithm 3 Section- $L$ Long-term Memory Storage Algorithm ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Input: $B^{t-1}$ , $M^{t-1}$ , $m^{t}$ , $p_{c}^{t}$ at time $t$   \nOutput: $M^{t}$   \n1: $\\%$ save the latest memory unit.   \n2: $B^{t}=B^{t-1}$ .append(mt)   \n3: M t = M t−1   \n4: if $t\\leq L_{m}$ then   \n5: $\\%$ select the latest memory to save.   \n6: $M^{t}[t]=m^{t}$   \n7: else   \n8: $\\begin{array}{r}{t_{m}=t\\;\\mathrm{mod}\\;L_{m},t_{d}=\\lfloor\\frac{t}{L_{m}}\\rfloor}\\end{array}$   \n9: $I_{s t a r t}=(t_{d}+1)\\times(t_{m}-\\dot{1})+1.$ , $I_{e n d}=I_{s t a r t}+t_{d}$   \n10: $\\%$ select the latest memory unit in each section   \n11: for $i$ in $t_{m}$ to $L_{m}$ do   \n12: $\\begin{array}{l}{M^{t}[i]\\stackrel{\\_}{=}B^{t}[I_{e n d}^{\\_}]}\\\\ {I_{s t a r t}=I_{e n d}+1,I_{e n d}=I_{s t a r t}+t_{d}-1}\\end{array}$   \n13:   \n14: end for   \n15: end if   \n16: return $M^{t}$ ", "page_idx": 18}, {"type": "text", "text": "search features. For the visual branch, we replace Eq. 9 and Eq. 10 with Eq. A8. Similarly, for the textual branch, we replace Eq. 11 and Eq. 12 with Eq. A9 ", "page_idx": 18}, {"type": "equation", "text": "$$\nf_{x l}^{t}=T r a n s_{D e c}(f_{x}^{t},m_{l}^{t}),\n$$", "text_format": "latex", "page_idx": 18}, {"type": "equation", "text": "$$\nf_{r}^{t}=T r a n s_{D e c}(f_{x l}^{t},m_{v}^{t}).\n$$", "text_format": "latex", "page_idx": 18}, {"type": "text", "text": "Additionally, to ensure a fair comparison, we set the number of network layers used in Eq. A8 to be the sum of the network layers in Eq. 9 and Eq. 10, and set the number of network layers used in Eq. A9 to be the sum of the network layers in Eq. 11 and Eq. 12. ", "page_idx": 18}, {"type": "text", "text": "B.4 Variants of Memory Storage Module ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Corresponding to Tab. 4, we conduct ablation analyses on different long-term memory storage methods in MSM. In addition to the section-top long-term memory storage method shown in Algorithm 1, we also present the implementation processes of three other storage methods in Algorithm 2, Algorithm 3, and Algorithm 4. For top- $L$ method, we introduce a new variable $M_{c}^{t}$ , which stores the confidence store corresponding to each memory unit in $M^{t}$ . ", "page_idx": 18}, {"type": "text", "text": "Algorithm 4 Top- $L$ Long-term Memory Storage Algorithm ", "page_idx": 19}, {"type": "image", "img_path": "ZK1CZXKgG5/tmp/de49aca30ac5930d909362c77d126633b76017a77cd59d5ea1cd752c51817a4a.jpg", "img_caption": [], "img_footnote": [], "page_idx": 19}, {"type": "text", "text": "Figure A2: Screenshot of the Latest MGIT Leaderboard for action granularity, activity granularity, and story granularity. Better viewed with zoom-in. ", "page_idx": 19}, {"type": "text", "text": "C Additional Experimental Analysis ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "C.1 Experimental Results of All Granularities on MGIT ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "MGIT is the latest large-scale benchmark specifically tailored for the VLT task, focusing on long-term challenges with complex spatio-temporal causal relationships. Each sequence is annotated with language descriptions at three levels of granularity: action, activity, and story [5]. Due to space constraints, we only present the experimental results for the action granularity in Tab. 1. We have anonymously submitted results for all three granularities on the official testing platform. As shown in Fig. A2, our model achieves state-of-the-art performance across nearly all metrics for all three granularities. Specifically, MemVLT surpasses the existing best results by $9\\%$ , $8\\%$ , and $3\\%$ in area under the curve for the three granularities, respectively. We expect that our proposed MemVLT can serve as a solid baseline. ", "page_idx": 19}, {"type": "text", "text": "C.2 Comparison with Visual-only Trackers ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "In line with the prevailing paradigm of vision-language tracking models [13, 14, 16], we provide additional comparisons with visual-only trackers to comprehensively showcase the performance of our model. As shown in Tab. A1, we organize and present the results of visual-only tracking models to supplement Sec. 4.2. ", "page_idx": 19}, {"type": "text", "text": "TNL2K. Despite being proposed for the VLT task, TNL2K has become a commonly used benchmark for the visual tracking task (as shown in Tab. A1). The primary intention of TNL2K is to exploit the complementarity of visual and textual modalities to achieve robust tracking performance, especially in challenging video sequences where the target state changes drastically [26]. However, recent vision-language trackers [14, 16] have shown inferior performance compared to vision-only trackers [38, 70]. In contrast, our model outperforms SOTA vision-language trackers and visual-only trackers. Specifically, we achieve improvements of $4.7\\ \\%$ in AUC over MMTrack [16] and $1.6\\;\\%$ in AUC over RTracker [38]. These results highlight the importance of the various adaptive prompts (visual and textual) we incorporated in addressing complex scenarios. ", "page_idx": 19}, {"type": "table", "img_path": "ZK1CZXKgG5/tmp/53ca8e3446efa5873a2dba43968833ca1f77a5a431461fb0f0d1b567cde82ad1.jpg", "table_caption": ["Table A1: Comparison with state-of-the-arts on three popular benchmarks: TNL2K [26], LaSOT [27] and $\\mathrm{LaSOT}_{e x t}$ [28]. The vision-only type of methods are evaluated by bounding box initialization, while the vision-language (VL) type of methods are evaluated by joint bounding box and natural language initialization. The best two results are highlighted in red and blue, respectively. "], "table_footnote": [], "page_idx": 20}, {"type": "text", "text": "", "page_idx": 20}, {"type": "text", "text": "LaSOT and $\\mathbf{LaSOT}_{e x t}$ . As the mainstream benchmarks for visual tracking tasks, LaSOT [27] and $\\mathrm{LaSOT}_{e x t}$ [28] are extended to the VLT task by incorporating language annotations. As shown in Tab. A1, our proposed MemVLT outperforms existing vision-language trackers on these two benchmarks. Compared to SOTA tracker MMTrack [16], our model surpasses it by $2.9\\ \\%$ and $2.7~\\%$ in area under the curve , respectively. However, we also notice that the performance of MemVLT does not surpass existing SOTA visual-only trackers [38, 70]. We speculate that this may be related to the quality of some language descriptions on these two benchmarks. For instance, some descriptions may be too vague to effectively locate the target [14, 26], leading to misleading guidance instead of facilitating tracking. ", "page_idx": 20}, {"type": "text", "text": "", "page_idx": 21}, {"type": "text", "text": "C.3 Comparison with All-in-one and OVLM ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "As emphasized in Sec. 4.2, MemVLT is compared with existing state-of-the-art VLTs that share similar task settings and training dataset configurations to ensure a fair comparison. As shown in Tab. 1 and Tab. A1, the VLTs we compare against are primarily trained using the LaSOT [27], TNL2K [26], RefCOCOg [49], and OTB99-Lang [1] datasets. In addition, two recent VLTs, namely OVLM [72] and All-in-one ", "page_idx": 21}, {"type": "table", "img_path": "ZK1CZXKgG5/tmp/87b0321b837bc72ee352346f291ea09465b618089f3c0c39e582f3e6daa86ad4.jpg", "table_caption": ["Table A2: Comparison with the OVLM. "], "table_footnote": [], "page_idx": 21}, {"type": "text", "text": "[73], utilize training dataset configurations that differ significantly from ours. Therefore, we conduct a separate comparison with these two VLTs. ", "page_idx": 21}, {"type": "text", "text": "OVLM. The comparison results are shown in Tab. A2. Our MemVLT significantly outperforms OVLM on LaSOT (AUC $+5.2\\%$ ) but slightly falls short on TNL2K (AUC $-1.4\\%$ ). Overall, our model demonstrates superior average performance (AUC $+2.4\\%$ ). Besides, although OVLM involves memory mechanism modeling, there are key differences between our method: ", "page_idx": 21}, {"type": "text", "text": ". Memory Representation: OVLM assumes the text prompt is a precise long-term cue, using vision and text features to represent short and long-term memories, respectively. However, it overlooks the misalignment between text information and video targets (see Fig. 1 (a)), which can mislead the tracker [14]. Our method addresses this by using both text and vision features to comprehensively represent short and long-term memories, and modulate them with dynamic information. ", "page_idx": 21}, {"type": "text", "text": "2. Memory Interaction: OVLM focuses solely on the unidirectional modulation of short-term memory features by textual long-term memory, whereas our method achieves bidirectional modulation between long-term and short-term memories. The importance of bidirectional interaction has been highlighted by recent research [23]. ", "page_idx": 21}, {"type": "text", "text": "In summary, our model provides a more comprehensive representation and interaction of memory information, resulting in superior performance. ", "page_idx": 21}, {"type": "text", "text": "All-in-one. As shown in Tab. A3, our tracker significantly outperforms All-in-one on all benchmarks except $\\mathrm{LaSOT}_{e x t}$ . Overall, the average performance of our model far exceeds that of All-in-one (AUC $+4.5\\%$ ). Although All-in-one uses a larger training dataset to align text and vision modalities, it neglects the modeling ", "page_idx": 21}, {"type": "table", "img_path": "ZK1CZXKgG5/tmp/9f497417d9bf0316e38b7ff623c4fe92ebb4585727725aa6d82117c3721c23a7.jpg", "table_caption": ["Table A3: Comparison with the All-in-one. "], "table_footnote": [], "page_idx": 21}, {"type": "text", "text": "of dynamic temporal information. In contrast, MemVLT effectively models temporal information through the memory mechanism, resulting in superior tracking performance. ", "page_idx": 21}, {"type": "text", "text": "C.4 Effect of the Confidence Prediction Module ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "To predict the confidence score $p_{c}^{t}$ , we introduce a confidence prediction module and supervise it using the $L_{2}$ loss between $p_{c}^{t}$ and the IoU value. As shown in Tab. A4, we analyze the impact of this module on the model’s performance using the TNL2K dataset. Without confidence scores, we lack a criterion for short-term memory selection. Therefore, we conduct tests using the sliding window storage method (Tab. A4 (#1)). When the confidence prediction module is introduced but the sliding window method is still used (Tab. A4 (#2)), we observe no significant change in performance. However, when the section-top storage method is employed, we see a significant improvement in model performance (Tab. A4 (#3)). This demonstrates that our proposed long-term memory storage method effectively leverages the confidence prediction information. ", "page_idx": 21}, {"type": "table", "img_path": "ZK1CZXKgG5/tmp/92a92d478fb879aa8e4b5ea5f6cfb621af6860c1991a71ad054f9187347666b3.jpg", "table_caption": ["Table A4: Study on the Effect of the Confidence Prediction Module. Results are tested on TNL2K. The best results are highlighted in red. "], "table_footnote": [], "page_idx": 22}, {"type": "table", "img_path": "ZK1CZXKgG5/tmp/5991fef975262b5808969f810bfeb2f7d3112fa6e3479b13e1bb65569c24aaab.jpg", "table_caption": ["Table A5: Study on the length of visual queries. Results are tested on TNL2K. "], "table_footnote": [], "page_idx": 22}, {"type": "table", "img_path": "ZK1CZXKgG5/tmp/4a68ddc5b1107ff2efdffd9eb49c15ba66ac34b50988479c583831d04a9c1686.jpg", "table_caption": ["Table A6: Study on the length of textual queries. Results are tested on TNL2K. "], "table_footnote": [], "page_idx": 22}, {"type": "text", "text": "", "page_idx": 22}, {"type": "text", "text": "C.5 The Impact of Query Length ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "In the process of generating short-term memories, we draw inspiration from the widely acknowledged paradigm of prompt learning [35], which introduces learnable query tokens to understand and represent corresponding features. Specifically, in the generation of visual and textual short-term memories $m_{v}^{t}$ and $m_{l}^{t}$ , we incorporate corresponding query tokens $q_{v}$ and $q_{l}$ , respectively. ", "page_idx": 22}, {"type": "text", "text": "As shown in Tab. A5 and Tab. A6, we conduct the ablation analysis on the lengths of these query tokens. Under the setting of a long-term memory length of 4, we test the influence of different lengths of visual and textual queries on the model performance. The results indicate that there is no substantial variation in model performance with changes in query length. This underscores the adequacy of a query length of 1. Consequently, we default to a query length of 1 in the experiments presented in the paper. ", "page_idx": 22}, {"type": "text", "text": "C.6 Ablation Study on the Backbone and Image Resolution ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "In Sec. 4, all our experiments are conducted using the HiViT-Base backbone and a $384\\!\\times\\!384$ image resolution. To provide a more comprehensive understanding of our model’s performance, we perform ablation studies by evaluating the model under the ViT-Base backbone and a $256\\!\\times\\!256$ resolution. ", "page_idx": 22}, {"type": "text", "text": "In Tab. A7, we not only evaluate the model’s performance using two different backbones but also analyze the impact of our proposed memory mechanism. Comparing #1 and $\\#2$ , it is evident that the introduction of our memory mechanism improves the AUC by $4.3\\%$ . Comparing #1 and $\\#3$ , we observe that the HiViT backbone provides an AUC improvement of $1.1\\%$ , which is consistent with previous research findings [40, 39]. Furthermore, the performance boost brought by our memory mechanism surpasses that of the HiViT-based backbone, indicating that the superior performance of our work primarily originates from the memory mechanism rather than the HiViT-based backbone. ", "page_idx": 22}, {"type": "text", "text": "In Tab. A8, we evaluate the performance of our model under two different search image resolutions. As expected, reducing the image resolution slightly degrades performance. However, MemVLT256 still significantly outperforms several recent models with larger resolutions, such as MMTrack [16] $(384\\!\\times\\!384)$ and QueryNLT [54] $(320\\!\\times\\!320)$ (see Tab. 4.2). This demonstrates that our method maintains strong performance even at lower resolutions. ", "page_idx": 22}, {"type": "text", "text": "C.7 Ablation Study on the Number of SMG Layers ", "text_level": 1, "page_idx": 22}, {"type": "table", "img_path": "ZK1CZXKgG5/tmp/b79efea82b3f3692d0e0bf8c6b71d81dc8612f77e36138b76e8ec6fbd6704a62.jpg", "table_caption": ["Table A7: Ablation study on the backbone and our memory mechanism. Results are tested on TNL2K. "], "table_footnote": [], "page_idx": 23}, {"type": "table", "img_path": "ZK1CZXKgG5/tmp/edda05612a258108a1dabcc942352e3fc2ab92deb70304e0482a439a315352ef.jpg", "table_caption": ["Table A8: Ablation study on the image resolution. Results are tested on TNL2K. "], "table_footnote": [], "page_idx": 23}, {"type": "text", "text": "In our proposed MemVLT, the SMG module, responsible for generating short-term memory, plays a critical role. To investigate its impact, we conduct ablation experiments on the number of SMG layers. Specifically, we test the performance of SMG with 1 and 5 layers, and compare the results with the existing model using 3 layers. ", "page_idx": 23}, {"type": "text", "text": "As shown in Tab. A9, it is observed that using too few layers (comparing #1 and #2) significantly harms the model’s performance, while increasing the number of layers (comparing #2 and #3) further does not provide noticeable performance gains. Therefore, our model effectively demonstrates performance convergence. ", "page_idx": 23}, {"type": "table", "img_path": "ZK1CZXKgG5/tmp/02cfaf70d45c6b38c64346630e6d40b1eeebbb8bee6ce420b7e01bc15f3e8ced.jpg", "table_caption": ["Table A9: Ablation study on the number of SMG layers. Results are tested on TNL2K. "], "table_footnote": [], "page_idx": 23}, {"type": "text", "text": "D Broader Impact ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "In this paper, we introduce a novel vision-language tracker named MemVLT. Inspired by the Complementary Learning Systems (CLS) theory, this model emulates human memory systems to adapt given static prompts to dynamically changing targets, thereby achieving effective tracking. Generic object tracking is one of the fundamental problems in computer vision with numerous applications such as video surveillance, robotics, and autonomous vehicles. The vision-language tracking task extends this field by incorporating text modality. Besides providing a new type of human-machine interaction, this task leverages the complementary advantages of visual and language modalities to achieve more promising tracking results. Our research can improve tracking performance while maintaining a reasonable running speed (32 FPS). However, it is of particular concern that this tracker could be misused for illegal surveillance and positioning. Despite achieving promising results, applying this technology to real-world scenarios, such as autonomous driving, remains challenging. To mitigate the risks associated with using MemVLT, we encourage researchers to thoroughly understand the implications of using trackers in specific real-world scenarios. ", "page_idx": 23}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 24}, {"type": "text", "text": "Justification: The main claims in the abstract and introduction accurately summarize the key contributions and scope of this paper. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 24}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Justification: The limitations of our work are discussed in detail in Sec. 5 ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 24}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 24}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 24}, {"type": "text", "text": "Justification: This paper does not include theoretical results. The effectiveness of the model is analyzed and validated through experiments. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 25}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "Justification: We provide a detailed description of the proposed model in Sec. 3 and Sec. A.   \nThese sections contain sufficient information to reproduce our model. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 25}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 26}, {"type": "text", "text": "Justification: The data used in this paper are open-source datasets, which can be accessed through the references provided. The details for constructing the model are thoroughly described in Sec. 3 and Sec. A. For the code and models, they will be released at: https://github.com/XiaokunFeng/MemVLT. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 26}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Justification: We provide a detailed description of the implementation details in Sec. 4.1. Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 26}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 26}, {"type": "text", "text": "Answer: [No] ", "page_idx": 26}, {"type": "text", "text": "Justification: To the best of our knowledge, almost all tracker test results are based on models that have been fully trained, typically requiring numerous iterations (e.g., several hundred epochs) to converge. Considering the high cost of a single training process, the expense of conducting multiple trainings for subsequent statistical analysis is prohibitive. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper. ", "page_idx": 26}, {"type": "text", "text": "• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 27}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 27}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 27}, {"type": "text", "text": "Justification: We provide this information in Sec. 4.1. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 27}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 27}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 27}, {"type": "text", "text": "Justification: We carefully review the NeurIPS Code of Ethics and ensure that the research aligns with it in all aspects. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 27}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 27}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 27}, {"type": "text", "text": "Justification: We discuss the broader impacts of this paper in Sec. D. Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed. ", "page_idx": 27}, {"type": "text", "text": "• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 28}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 28}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 28}, {"type": "text", "text": "Justification: This paper focuses on the video tracking task, which does not pose such high risks. ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 28}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 28}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 28}, {"type": "text", "text": "Justification: We properly credit the creators or original owners of all assets used in the paper, and cite the relevant papers for each asset. ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 28}, {"type": "text", "text": "", "page_idx": 29}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 29}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 29}, {"type": "text", "text": "Justification: We have not yet released the model proposed in this paper. ", "page_idx": 29}, {"type": "text", "text": "Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 29}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 29}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 29}, {"type": "text", "text": "Justification: This paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 29}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 29}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 29}, {"type": "text", "text": "Justification: This paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects. ", "page_idx": 29}, {"type": "text", "text": "• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 30}]