[{"figure_path": "RGnjY6l2HT/tables/tables_7_1.jpg", "caption": "Table 1: Quantitative comparison with state-of-the-art video editing techniques.", "description": "This table presents a quantitative comparison of UniEdit against several state-of-the-art video editing techniques across various metrics.  These metrics evaluate the performance of each method concerning frame consistency, textual alignment, frame quality (aesthetic imaging, subject quality), and temporal quality (temporal consistency, smoothness, and flickering).  The metrics are evaluated using CLIP scores and user preferences, providing a comprehensive assessment of the video editing capabilities of each method.", "section": "5.1 Comparison with State-of-the-Art Methods"}, {"figure_path": "RGnjY6l2HT/tables/tables_7_2.jpg", "caption": "Table 2: Impact of various components.", "description": "This table presents the ablation study results, showing the effectiveness of each component in UniEdit.  It demonstrates that combining content preservation, motion injection, and spatial structure control leads to significant improvements in frame similarity, textual alignment, and temporal consistency when compared to using only a subset of these components.  The metrics used are Frame Similarity (how similar the frames are to the original source video), Textual Alignment (how well the video matches the text prompt), and Frame Consistency (temporal consistency of the video).", "section": "4.1 Tuning-Free Video Motion Editing"}, {"figure_path": "RGnjY6l2HT/tables/tables_15_1.jpg", "caption": "Table 3: Quantitative comparison on hyper-parameter selection.", "description": "This table presents the results of an ablation study on the hyper-parameters  to (the number of feature injection steps in the spatial self-attention modules) and L (the number of feature injection steps in the temporal self-attention modules) used in UniEdit. It shows how different values of to and L affect the model's performance on three metrics: Frame Similarity, Textual Alignment, and Frame Consistency.", "section": "B.2 Quantitative Ablation on Hyper-parameter Selection"}, {"figure_path": "RGnjY6l2HT/tables/tables_15_2.jpg", "caption": "Table 4: Quantitative comparison on hyper-parameter selection.", "description": "This table presents the results of an ablation study on the hyper-parameters  in UniEdit. Specifically, it shows the impact of varying the hyper-parameters  t1 (the number of steps to blend the value features from reconstruction branch) on the Frame Similarity, Textual Alignment, and Frame Consistency. The results are presented for three different values of t1 (20, 25, and 30), offering insights into finding the optimal balance between content preservation and motion editing.", "section": "B.2 Quantitative Ablation on Hyper-parameter Selection"}, {"figure_path": "RGnjY6l2HT/tables/tables_16_1.jpg", "caption": "Table 1: Quantitative comparison with state-of-the-art video editing techniques.", "description": "This table presents a quantitative comparison of UniEdit against several state-of-the-art video editing techniques.  The metrics used are CLIP scores for both textual alignment and user preference, along with frame quality, temporal quality, and aesthetic quality.  UniEdit consistently outperforms other methods across all metrics, demonstrating its superior performance in video editing.", "section": "5.1 Comparison with State-of-the-Art Methods"}, {"figure_path": "RGnjY6l2HT/tables/tables_19_1.jpg", "caption": "Table 1: Quantitative comparison with state-of-the-art video editing techniques.", "description": "This table presents a quantitative comparison of UniEdit against several state-of-the-art video editing techniques.  The metrics used for comparison include CLIP score and user preference for both textual alignment and frame consistency, along with Frame Quality, Temporal Quality, Aesthetic Quality, Subject Quality, Motion Quality, Temporal Consistency, Smoothness, and Flickering.  The table allows for a detailed comparison of UniEdit's performance relative to other methods across various aspects of video editing.", "section": "5.1 Comparison with State-of-the-Art Methods"}]