[{"figure_path": "uBVCPAMDGk/figures/figures_13_1.jpg", "caption": "Figure 1: Top: Images generated by Consistency Models trained on ImageNet 64x64. Bottom: Refined images by applying our algorithm.", "description": "This figure shows a comparison of images generated by Consistency Models and the same images after being processed by the algorithm proposed in the paper.  The top row displays original images generated by the Consistency Models, exhibiting some artifacts and lack of fine detail. The bottom row presents the refined images which have improved visual quality, exhibiting sharper details and more realistic textures. This visual improvement demonstrates the effectiveness of the proposed post-processing technique.", "section": "D Supplementary Results"}, {"figure_path": "uBVCPAMDGk/figures/figures_13_2.jpg", "caption": "Figure 1: Top: Images generated by Consistency Models trained on ImageNet 64x64. Bottom: Refined images by applying our algorithm.", "description": "This figure shows a comparison of images generated by Consistency Models before and after applying the proposed image refinement algorithm. The top row displays the original generated images, while the bottom row shows the same images after undergoing the algorithm's post-processing step. The goal of the algorithm is to enhance the realism and visual appeal of the generated images, making them more similar to real images from the ImageNet 64x64 dataset.  The visual difference highlights the improvements achieved by the algorithm, such as increased sharpness, better texture details, and more natural colors. Each pair of images showcases the refinement applied to a specific image.", "section": "Supplementary Results"}, {"figure_path": "uBVCPAMDGk/figures/figures_14_1.jpg", "caption": "Figure 1: Top: Images generated by Consistency Models trained on ImageNet 64x64. Bottom: Refined images by applying our algorithm.", "description": "This figure shows four pairs of images.  Each pair presents an image generated using a Consistency Model trained on the ImageNet 64x64 dataset (top) and the same image after being processed by the algorithm proposed in the paper (bottom). The algorithm aims to refine the generated image, improving its quality and realism. By comparing the top and bottom images in each pair, one can visually assess the effectiveness of the proposed refinement technique. The differences are subtle but noticeable; the refined images exhibit improved texture, sharpness, and overall visual quality.", "section": "Supplementary Results"}, {"figure_path": "uBVCPAMDGk/figures/figures_14_2.jpg", "caption": "Figure 1: Top: Images generated by Consistency Models trained on ImageNet 64x64. Bottom: Refined images by applying our algorithm.", "description": "This figure shows four pairs of images. Each pair consists of an image generated by a consistency model and a refined version of the same image after applying the proposed algorithm. The top row displays the original images, while the bottom row presents their refined counterparts. The improvements in image quality are evident in the refined images, which exhibit enhanced details, sharper edges, and more realistic textures.", "section": "D Supplementary Results"}]