[{"figure_path": "TBVLQjdFcA/tables/tables_6_1.jpg", "caption": "Table 1: Performance on S3DIS dataset using mean-IoU metric (%). S<sup>i</sup> represents the split i is used for testing. The best results are masked in bold. Our method consistently far exceeds SOTA.", "description": "This table presents the performance comparison of different few-shot 3D point cloud segmentation methods on the S3DIS dataset.  The mean Intersection over Union (mIoU) is used as the evaluation metric.  Results are shown for 2-way and 3-way classification tasks, with both 1-shot and 5-shot learning settings.  The table highlights the superiority of the proposed GPCPR method over state-of-the-art (SOTA) approaches.", "section": "4 Experiments"}, {"figure_path": "TBVLQjdFcA/tables/tables_6_2.jpg", "caption": "Table 2: Performance on ScanNet dataset using mean-IoU metric (%). S<sup>i</sup> represents the split i is used for testing. The best results are masked in bold. Our method consistently far exceeds SOTA.", "description": "This table presents the results of the proposed method and other state-of-the-art methods on the ScanNet dataset.  The mean Intersection over Union (mIoU) metric is used to evaluate the performance of different semantic segmentation methods. The results are shown for both 2-way and 3-way few-shot settings, with 1-shot and 5-shot scenarios for each way.  The table highlights the consistent superiority of the proposed method over existing methods, showcasing its significant improvement in accuracy.", "section": "4 Experiments"}, {"figure_path": "TBVLQjdFcA/tables/tables_7_1.jpg", "caption": "Table 3: Offline time cost on S3DIS and ScanNet under 2-way 1-shot setting.", "description": "This table shows the time taken for two phases of the offline process: Description Generation using the GPT-3.5-turbo model and Text Feature Extraction using the CLIP rn50 model.  The total time is also provided. The results are shown separately for the S3DIS and ScanNet datasets, indicating a substantially longer processing time for ScanNet compared to S3DIS.", "section": "4 Experiments"}, {"figure_path": "TBVLQjdFcA/tables/tables_7_2.jpg", "caption": "Table 4: Analysis of online computational cost and experimental results under 2-way 1-shot setting.", "description": "This table presents a comparison of the online computational cost and experimental results for four different methods (AttMPTI, QGPA, DPA, and the proposed method) under a 2-way 1-shot setting.  The metrics shown are the number of parameters (#Params), floating point operations (FLOPs), frames per second (FPS), inference time, and mean Intersection over Union (mIoU) on both the S3DIS and ScanNet datasets.  It highlights the trade-off between computational cost and performance, showing that the proposed method achieves superior performance (highest mIoU) with a reasonable computational cost.", "section": "4 Experiments"}, {"figure_path": "TBVLQjdFcA/tables/tables_8_1.jpg", "caption": "Table 5: Ablation study of key components on S3DIS dataset under 2-way 1-shot setting using mean-IoU metric (%).", "description": "This table presents the results of an ablation study conducted on the Stanford Large-Scale 3D Indoor Spaces (S3DIS) dataset.  The study investigates the impact of different components of the proposed method (Generated and Pseudo Content guided Prototype Refinement, or GPCPR) on the mean Intersection over Union (mIoU) metric for a 2-way 1-shot segmentation task. The components evaluated include the use of LLM-generated diverse descriptions (D), LLM-generated differentiated descriptions (D'), Pseudo Query Context-guided Prototype Refinement (PCPR), and the dual-distillation loss (DD loss) with its three components: prototype distillation (LTP), pseudo query distillation (LQP), and logit distillation (LQM). The table shows how the inclusion of each component affects the performance, measured by the mIoU, on both the S0 and S1 splits of the dataset.", "section": "4.3 Ablation Study"}, {"figure_path": "TBVLQjdFcA/tables/tables_9_1.jpg", "caption": "Table 6: Effects of different LLMs on S3DIS dataset under 2-way 1-shot setting.", "description": "This table shows the performance comparison of using different LLMs (gpt-3.5-turbo and gpt-40-mini) in the proposed GPCPR framework on the S3DIS dataset under the 2-way 1-shot setting. The results are presented in terms of mean IoU (%), and the comparison includes the state-of-the-art methods attMPTI, QGPA, and DPA. The table demonstrates the impact of different LLMs on the overall performance of the proposed method.", "section": "4 Experiments"}]