[{"figure_path": "3A5VgiH5Pw/tables/tables_7_1.jpg", "caption": "Table 1: Utility results. We conducted ten repeated experiments and calculated the average results for each metric. Red and blue indicate the best and the second-best result. Our approach outperforms the baseline backbone models while also providing interpretability. Our model exhibits significantly higher accuracy compared to other state-of-the-art interpretable models.", "description": "This table presents the performance comparison of the proposed Med-MICN model against several baseline and state-of-the-art interpretable models on four benchmark medical image datasets.  The results are evaluated using standard classification metrics (Accuracy, F1-score, etc.) demonstrating Med-MICN's superior performance and interpretability compared to other methods.", "section": "5.2 Model Utility Analysis"}, {"figure_path": "3A5VgiH5Pw/tables/tables_8_1.jpg", "caption": "Table 1: Utility results. We conducted ten repeated experiments and calculated the average results for each metric. Red and blue indicate the best and the second-best result. Our approach outperforms the baseline backbone models while also providing interpretability. Our model exhibits significantly higher accuracy compared to other state-of-the-art interpretable models.", "description": "This table presents the performance comparison of the proposed Med-MICN model against several baseline and state-of-the-art interpretable models across four benchmark medical image datasets.  The results demonstrate Med-MICN's superiority in terms of accuracy (ACC), F1-score, and other metrics while also maintaining its interpretability advantages.", "section": "5.2 Model Utility Analysis"}, {"figure_path": "3A5VgiH5Pw/tables/tables_15_1.jpg", "caption": "Table 1: Utility results. We conducted ten repeated experiments and calculated the average results for each metric. Red and blue indicate the best and the second-best result. Our approach outperforms the baseline backbone models while also providing interpretability. Our model exhibits significantly higher accuracy compared to other state-of-the-art interpretable models.", "description": "This table presents the results of experiments comparing the proposed Med-MICN model against several baseline and state-of-the-art models on four benchmark medical image datasets.  Performance is measured across multiple metrics (Accuracy, F1-score, etc.) for different backbone networks (ResNet50, VGG19, DenseNet169). The table highlights Med-MICN's superior accuracy and its unique combination of high performance and interpretability.", "section": "5.2 Model Utility Analysis"}, {"figure_path": "3A5VgiH5Pw/tables/tables_17_1.jpg", "caption": "Table 1: Utility results. We conducted ten repeated experiments and calculated the average results for each metric. Red and blue indicate the best and the second-best result. Our approach outperforms the baseline backbone models while also providing interpretability. Our model exhibits significantly higher accuracy compared to other state-of-the-art interpretable models.", "description": "This table presents the performance comparison between the proposed Med-MICN model and several baseline and state-of-the-art interpretable models on four medical image datasets.  The metrics used for evaluation include Accuracy, F1-score, and AUC.  The table highlights that Med-MICN achieves superior performance and interpretability compared to other methods.  Red and blue colors indicate the top two performing models for each metric.", "section": "5.2 Model Utility Analysis"}, {"figure_path": "3A5VgiH5Pw/tables/tables_18_1.jpg", "caption": "Table 1: Utility results. We conducted ten repeated experiments and calculated the average results for each metric. Red and blue indicate the best and the second-best result. Our approach outperforms the baseline backbone models while also providing interpretability. Our model exhibits significantly higher accuracy compared to other state-of-the-art interpretable models.", "description": "This table presents the performance comparison of the proposed Med-MICN model against several baseline and state-of-the-art interpretable models on four benchmark medical image datasets (COVID-CT, DDI, Chest X-Ray, and Fitzpatrick17k).  The results show that Med-MICN achieves superior performance in terms of accuracy (Acc), F1-score, and AUC, while also offering interpretability.  Different backbone models (ResNet50, VGG19, DenseNet169) are used to demonstrate Med-MICN's robustness.", "section": "5.2 Model Utility Analysis"}, {"figure_path": "3A5VgiH5Pw/tables/tables_18_2.jpg", "caption": "Table 1: Utility results. We conducted ten repeated experiments and calculated the average results for each metric. Red and blue indicate the best and the second-best result. Our approach outperforms the baseline backbone models while also providing interpretability. Our model exhibits significantly higher accuracy compared to other state-of-the-art interpretable models.", "description": "This table presents the performance comparison of the proposed Med-MICN model against various baseline and state-of-the-art interpretable models on four benchmark medical image datasets (COVID-CT, DDI, Chest X-Ray, and Fitzpatrick17k).  The results show Med-MICN's superior accuracy across different backbones (ResNet50, VGG19, DenseNet169) while maintaining interpretability.  The metrics used are Accuracy (Acc), F1-Score (F1), and AUC.  The interpretability column indicates whether a given model provides interpretable results.", "section": "5.2 Model Utility Analysis"}, {"figure_path": "3A5VgiH5Pw/tables/tables_18_3.jpg", "caption": "Table 1: Utility results. We conducted ten repeated experiments and calculated the average results for each metric. Red and blue indicate the best and the second-best result. Our approach outperforms the baseline backbone models while also providing interpretability. Our model exhibits significantly higher accuracy compared to other state-of-the-art interpretable models.", "description": "This table presents the performance comparison of the proposed Med-MICN model against various baseline models and other state-of-the-art interpretable models. It shows accuracy, F1 score, and other metrics across four benchmark datasets (COVID-CT, DDI, Chest X-Ray, and Fitzpatrick17k) for different backbones (ResNet50, VGG19, and DenseNet169).  The results highlight Med-MICN's superior performance and interpretability.", "section": "5.2 Model Utility Analysis"}, {"figure_path": "3A5VgiH5Pw/tables/tables_19_1.jpg", "caption": "Table 8: Effect of our individual concept filters on the final accuracy and number of concepts utilized by our models.", "description": "This table presents the results of an ablation study on the impact of concept filters used in the Med-MICN model.  It shows the accuracy and number of concepts used for COVID-CT and DDI datasets when applying different combinations of filters. The filters applied are: length (removing concepts longer than 30 characters), similarity (removing similar concepts), and projection (removing concepts that cannot be accurately projected).  The comparison shows the model's performance when all filters are used, when each filter is removed one at a time, and when no filter is applied.  This helps to assess the impact of each filter on the overall model performance and interpretability.", "section": "5.4 Ablation Study"}, {"figure_path": "3A5VgiH5Pw/tables/tables_21_1.jpg", "caption": "Table 1: Utility results. We conducted ten repeated experiments and calculated the average results for each metric. Red and blue indicate the best and the second-best result. Our approach outperforms the baseline backbone models while also providing interpretability. Our model exhibits significantly higher accuracy compared to other state-of-the-art interpretable models.", "description": "The table presents the performance comparison between Med-MICN and other methods (baseline models and other state-of-the-art interpretable models) across four benchmark datasets.  The results are given for several evaluation metrics (Accuracy, F1-Score, etc.) and the interpretability of the models is indicated. Med-MICN shows significantly better performance and interpretability than other models.", "section": "5.2 Model Utility Analysis"}]