[{"figure_path": "eUg64OsGDE/tables/tables_7_1.jpg", "caption": "Table 1: FSC-147 [42] comparison with the state-of-the-art text-only and visual exemplar-only open-world counting methods. Multi-modal COUNTGD trained and tested with both visual exemplars and text achieves state-of-the-art counting accuracy for open-world object counting, beating all text-only and visual exemplar-only approaches. COUNTGDtxt trained and tested with only text achieves comparable performance to state-of-the-art text-only counting approaches. * = correction of erroneous GT labels, as explained in section 4.1. GroundingREC [8], DAVEprm, and DAVE [40] are concurrent work. Lower MAE and RMSE values mean more accurate results.", "description": "This table compares the performance of COUNTGD with other state-of-the-art open-world object counting methods on the FSC-147 dataset.  It shows COUNTGD's superior accuracy when using both text and visual exemplars, and its comparable performance to the best text-only methods when only using text. The table highlights COUNTGD's advancement in open-world object counting.", "section": "4.3 Comparison to State-of-the-art on Standard Benchmarks"}, {"figure_path": "eUg64OsGDE/tables/tables_7_2.jpg", "caption": "Table 2: Comparison with state-of-the-art open-world counting methods. (top) On CARPK [20], we compare with text-only and visual exemplar-only methods. COUNTGD, trained with both visual exemplars and text on FSC-147 [42], achieves lower error values than all text-only and visual exemplar-only methods, without being trained on any images in CARPK, using either text-only or both text and two visual exemplars at inference. (bottom) On CountBench [39], we compare with currently the best publicly available text-only open-world counting method, CounTX [1]. COUNTGD (trained on both visual exemplars and text), given only text and zero-shot, achieves significantly lower errors than CounTX. Note, CountBench does not provide visual exemplars.", "description": "This table compares the performance of COUNTGD against other state-of-the-art open-world object counting methods on two benchmark datasets: CARPK and CountBench.  The top section shows results for CARPK, comparing COUNTGD's performance using only text and using both text and visual exemplars against other models using either method. The bottom section shows results for CountBench, comparing COUNTGD's zero-shot text-only performance against the best performing text-only method.", "section": "4.3 Comparison to State-of-the-art on Standard Benchmarks"}, {"figure_path": "eUg64OsGDE/tables/tables_13_1.jpg", "caption": "Table 5: Ablation study II: COUNTGD is tested with different inference procedures on FSC-147 [42]. TT-Norm refers to test-time normalization. Correction (1) refers to using only text for image 7171.jpg, and Correction (2) refers to correcting the incorrect text description for image 7611.jpg from “lego” to “yellow lego stud.”", "description": "This table presents the ablation study on the impact of different inference procedures on COUNTGD's performance.  The study includes the test-time normalization (TT-Norm) technique, a correction for incorrectly labeled visual exemplars in image 7171.jpg (using only text instead of both text and visual exemplars), and a correction for an incorrect text description in image 7611.jpg (changing \"lego\" to \"yellow lego stud\"). The results, measured by Mean Absolute Error (MAE) and Root Mean Squared Error (RMSE), are reported for both the validation and test sets of the FSC-147 dataset. The table shows how each correction or technique impacts model accuracy. ", "section": "4.3 Comparison to State-of-the-art on Standard Benchmarks"}, {"figure_path": "eUg64OsGDE/tables/tables_15_1.jpg", "caption": "Table 5: Ablation study II: COUNTGD is tested with different inference procedures on FSC-147 [42]. TT-Norm refers to test-time normalization. Correction (1) refers to using only text for image 7171.jpg, and Correction (2) refers to correcting the incorrect text description for image 7611.jpg from \"lego\" to \"yellow lego stud.\"", "description": "This table presents an ablation study on the COUNTGD model's performance using different inference methods.  It shows the impact of using the SAM TT-Norm for handling self-similarity, the use of adaptive cropping for managing a large number of objects, and corrections made to the dataset (correcting incorrect visual exemplars and text descriptions). The results are reported in terms of Mean Absolute Error (MAE) and Root Mean Squared Error (RMSE) on both the validation and test sets of the FSC-147 dataset.", "section": "4.3 Comparison to State-of-the-art on Standard Benchmarks"}, {"figure_path": "eUg64OsGDE/tables/tables_15_2.jpg", "caption": "Table 5: Ablation study II: COUNTGD is tested with different inference procedures on FSC-147 [42]. TT-Norm refers to test-time normalization. Correction (1) refers to using only text for image 7171.jpg, and Correction (2) refers to correcting the incorrect text description for image 7611.jpg from \"lego\" to \"yellow lego stud.\"", "description": "This table presents the ablation study on the COUNTGD model's performance using different inference procedures. It shows the impact of using SAM TT-Norm, adaptive cropping, and corrections to the FSC-147 dataset on the model's accuracy, measured by MAE and RMSE on both validation and test sets. The results demonstrate the effect of each modification individually and in combination.", "section": "4.3 Comparison to State-of-the-art on Standard Benchmarks"}, {"figure_path": "eUg64OsGDE/tables/tables_15_3.jpg", "caption": "Table 7: CountGD’s performance on 1-shot versus few-shot counting on FSC-147. Providing more exemplars in the prompt increases the accuracy of CountGD.", "description": "This table presents the results of a comparison between one-shot and few-shot counting experiments using the COUNTGD model on the FSC-147 dataset.  It shows that increasing the number of visual exemplars provided as input to the model improves counting accuracy, as measured by Mean Absolute Error (MAE) and Root Mean Squared Error (RMSE). The table highlights the trade-off between the number of exemplars used and the resulting counting accuracy.", "section": "4.4 Ablation Study"}, {"figure_path": "eUg64OsGDE/tables/tables_16_1.jpg", "caption": "Table 8: CountGD's performance on FSC-147 using different ratios of text versus exemplar training data. Providing more exemplar training data results in better performance overall, when given text only, exemplars only, or both at inference.", "description": "This table presents the results of an ablation study conducted to evaluate the impact of different training data ratios on the performance of the COUNTGD model. The model was trained with varying proportions of text-only and exemplar-only data. The test performance (measured by Mean Absolute Error or MAE) is reported for three different inference settings: using text only, using exemplars only, or using both text and exemplars.  The results demonstrate that increasing the proportion of exemplar-only data in the training set leads to improved overall performance, regardless of the inference setting.", "section": "4.4 Ablation Study"}]