[{"figure_path": "89fSR2gpxp/tables/tables_6_1.jpg", "caption": "Table 1: Offline behavior distillation performance on D4RL offline datasets. The result for Random Selection (Random) is obtained by repeating 10 times. For DBC, PBC, and Av-PBC, the results are averaged across five seeds and the last five evaluation steps. The best OBD result for each dataset is marked with bold scores, and orange-colored scores denote instances where OBD outperforms BC.", "description": "This table presents the results of offline behavior distillation experiments on nine D4RL datasets (three tasks with three data quality levels).  The table compares the performance of four different methods: Random Selection (baseline), Data-based Behavior Cloning (DBC), Policy-based Behavior Cloning (PBC), and Action-Value weighted Policy-based Behavior Cloning (Av-PBC).  The performance metric is normalized return, averaged over five random seeds and the last five evaluation steps. Bold numbers highlight the best performing method for each dataset. Orange highlights cases where offline behavior distillation outperforms standard Behavior Cloning. ", "section": "5.1 Main Results"}, {"figure_path": "89fSR2gpxp/tables/tables_7_1.jpg", "caption": "Table 2: Offline behavior distillation performance across various policy network architectures and optimizers (Optim). Red-colored scores and green-colored scores in brackets denote the performance degradation and improvement, respectively, compared to the default training setting. The results are averaged over five random seeds and the last five evaluation steps.", "description": "This table presents the results of offline behavior distillation using different network architectures (2-layer, 3-layer, 5-layer, 6-layer, Residual) and optimizers (Adam, AdamW, SGDm) across three D4RL environments (Halfcheetah, Hopper, Walker2D) and three dataset qualities (M-R, M, M-E).  The average performance across all settings is shown, with red indicating performance worse than the default and green indicating better performance.", "section": "5.1 Main Results"}, {"figure_path": "89fSR2gpxp/tables/tables_8_1.jpg", "caption": "Table 3: Offline behavior distillation performance on D4RL offline datasets with ensemble num of 10. Green-colored scores in brackets denote the performance improvement compared to the non-ensemble setting. The results are averaged over five random seeds and the last five evaluation steps.", "description": "This table shows the offline behavior distillation performance on D4RL datasets using ensemble methods.  It compares three different methods (DBC, PBC, and Av-PBC) across multiple environments and data qualities. The improvement in performance due to ensembling is highlighted with green-colored scores.  The results are averaged over five random seeds and the last five evaluation steps.", "section": "5.1 Main Results"}, {"figure_path": "89fSR2gpxp/tables/tables_13_1.jpg", "caption": "Table 4: The size and required training steps for convergence for each offline dataset. M denotes the million for simplicity. The size and step for synthetic data (Synset) are listed in the last column.", "description": "This table shows the size of the original offline datasets used for training in millions of data points and the number of training steps required for convergence for each dataset and environment. It also includes the size and number of steps for the synthetic dataset generated using the Av-PBC method.", "section": "C Training Time Comparison"}, {"figure_path": "89fSR2gpxp/tables/tables_14_1.jpg", "caption": "Table 5: The Av-PBC performance on D4RL offline datasets with different synthetic data sizes.", "description": "This table shows how the performance of the Av-PBC method changes when using different sizes of synthetic data.  The results are presented for three different D4RL datasets (Halfcheetah M-R, Hopper M-R, Walker2D M-R), each tested with five different sizes of synthetic data (16, 32, 64, 128, 256).  The numbers in the table represent the performance of the Av-PBC method under these conditions, allowing for an assessment of the impact of synthetic data size on performance.", "section": "5 Experiments"}]