[{"figure_path": "ioAlzcELTf/tables/tables_4_1.jpg", "caption": "Table 3: Generalized Nowcast. 60-min and 120-min are trained lead times, while 30-min and 90-min are generalized lead times. Gray represents the results obtained through the frame interpolation model, purple indicates the results obtained through our unified model without interpolating. For precipitation nowcasting, CSI (Critical Success Index) is the most important metric.", "description": "This table compares the performance of WeatherGFT and other models on a nowcasting task, specifically predicting precipitation at various lead times (30, 60, 90, and 120 minutes).  It highlights WeatherGFT's ability to generate 30-minute forecasts, which are not present in the training data, outperforming models that rely on frame interpolation to produce those finer-grained forecasts. The Critical Success Index (CSI) at thresholds of 0.5 and 1.5 are used to evaluate forecast accuracy.", "section": "4.3 Generalizing to Fine-grained Time Scale for Nowcasting"}, {"figure_path": "ioAlzcELTf/tables/tables_5_1.jpg", "caption": "Table 1: Datasets. NASA dataset only contains precipitation, which will be used as the ground truth for precipitation nowcast.", "description": "This table shows the datasets used in the paper. WeatherBench dataset is used for training and testing, with a time resolution of 1 hour. NASA dataset is only used for testing the 30-minute nowcasting task, providing ground truth precipitation data.", "section": "4.1 Experimental Setup"}, {"figure_path": "ioAlzcELTf/tables/tables_6_1.jpg", "caption": "Table 2: Atmospheric Variables Considered. The 13 levels are 50, 100, 150, 200, 250, 300, 400, 500, 600, 700, 850, 925, 1000 hPa.", "description": "This table lists the atmospheric variables used in the WeatherGFT model, along with the number of pressure levels associated with each variable.  The variables include surface-level measurements (wind speed and direction, temperature, and precipitation) and atmospheric profile data (geopotential, humidity, wind speed and direction, and temperature) across 13 pressure levels.  The pressure levels are specified in hectopascals (hPa).", "section": "4.1 Experimental Setup"}, {"figure_path": "ioAlzcELTf/tables/tables_7_1.jpg", "caption": "Table 3: Generalized Nowcast. 60-min and 120-min are trained lead times, while 30-min and 90-min are generalized lead times. Gray represents the results obtained through the frame interpolation model, purple indicates the results obtained through our unified model without interpolating. For precipitation nowcasting, CSI (Critical Success Index) is the most important metric.", "description": "This table presents the results of the generalized nowcasting experiments.  It compares the performance of WeatherGFT against other models at various lead times (30, 60, 90, and 120 minutes).  The Critical Success Index (CSI) at thresholds of 0.5 and 1.5, as well as the Root Mean Square Error (RMSE), are reported.  Results are shown for models with and without frame interpolation, highlighting WeatherGFT's ability to generalize to finer-grained timescales not present in its training data.", "section": "4.3 Generalizing to Fine-grained Time Scale for Nowcasting"}, {"figure_path": "ioAlzcELTf/tables/tables_9_1.jpg", "caption": "Table 4: Ablation Experiment.", "description": "This table presents the results of ablation experiments conducted to evaluate the impact of different components of the WeatherGFT model on the 30-minute nowcast and medium-range forecasting tasks.  The \"Attent Block\" row represents the baseline model using only the attention block without PDE kernels or multi-lead time training. Subsequent rows progressively add the PDE kernel and multi-lead time training, showing the performance improvements of each addition. The RMSE (root mean square error) values for surface temperature (t2m) and 500 hPa geopotential (z500) are provided for lead times of 1 hour, 6 hours, and 3 days.", "section": "4.5 Ablation Studies"}, {"figure_path": "ioAlzcELTf/tables/tables_17_1.jpg", "caption": "Table 5: Hyperparameters of the Model", "description": "This table lists the hyperparameters used in the WeatherGFT model, including the maximum number of training epochs, batch size, learning rate and schedule, patch size, embedding dimension, MLP ratio, activation function, and input/output dimensions for different time horizons.", "section": "3 Method"}, {"figure_path": "ioAlzcELTf/tables/tables_17_2.jpg", "caption": "Table 6: Datasets Information", "description": "This table details the datasets used in the paper's experiments. It lists the time period used for training, validation, and testing sets for both WeatherBench and NASA datasets.  It also specifies the time resolution (1 hour for WeatherBench and 30 minutes for NASA) and the variables included in each dataset. Note that the NASA dataset only contains precipitation data (tp), while WeatherBench includes a broader range of meteorological variables.", "section": "4.1 Experimental Setup"}]