[{"figure_path": "Wxc6KvQgLq/tables/tables_8_1.jpg", "caption": "Table 1: Coverage of numeric domain-independent, the new learning planners (hcost, hrankGNN, hGNN, hCCWLF, hCCWLF) with L = 1, and the best learner configuration score on each domain (Best Learner). Higher values are better (↑), with the top three scores in each row except the rightmost entry indicated by the cell colour intensity. All planner configurations except hMCUT are satisficing planners.", "description": "This table presents the performance comparison of various planners on eight numeric planning domains.  It shows the number of problems solved (coverage) by different planners, including domain-independent planners and the newly proposed learning-based planners. The table highlights the top three performing planners in each domain, using color coding to indicate performance intensity.  It also specifies that the evaluation metric is the number of solved problems, with higher values indicating better performance.  Importantly, it notes that all planners except for hMCUT are satisficing (finding any solution) planners, whereas hMCUT is an optimal planner.", "section": "6 Experiments"}, {"figure_path": "Wxc6KvQgLq/tables/tables_20_1.jpg", "caption": "Table 2: Coverage and median of expansions of solved problems for each CCWL and GNN model with varying number of iterations and layers. Higher values are better for coverage, and lower values are better for expansions. The best value per domain and metric coloured. OOM denotes that the training process exceeded the memory limit.", "description": "This table shows the performance of CCWL and GNN models with different numbers of iterations (for CCWL) and layers (for GNNs).  It presents the coverage (percentage of problems solved) and median number of expansions for each model across eight planning domains.  Higher coverage is better, while a lower median number of expansions indicates greater efficiency.  The best performing model for each metric (coverage and expansions) in each domain is highlighted.", "section": "6.2 Experimental setup"}, {"figure_path": "Wxc6KvQgLq/tables/tables_20_2.jpg", "caption": "Table 2: Coverage and median of expansions of solved problems for each CCWL and GNN model with varying number of iterations and layers. Higher values are better for coverage, and lower values are better for expansions. The best value per domain and metric coloured. OOM denotes that the training process exceeded the memory limit.", "description": "This table presents the performance of CCWL and GNN models with varying numbers of iterations (for CCWL) and layers (for GNN).  It shows the coverage (percentage of problems solved) and median number of node expansions for each model across different planning domains. Higher coverage indicates better performance, while lower expansions represent greater efficiency.", "section": "6.2 Experimental setup"}, {"figure_path": "Wxc6KvQgLq/tables/tables_20_3.jpg", "caption": "Table 2: Coverage and median of expansions of solved problems for each CCWL and GNN model with varying number of iterations and layers. Higher values are better for coverage, and lower values are better for expansions. The best value per domain and metric coloured. OOM denotes that the training process exceeded the memory limit.", "description": "This table shows the performance of CCWL and GNN models with different numbers of iterations (for CCWL) and layers (for GNN).  It presents the coverage (number of problems solved) and median number of node expansions for each model across eight planning domains.  The best performing model (highest coverage/lowest expansions) for each domain and metric is highlighted.", "section": "6 Experiments"}, {"figure_path": "Wxc6KvQgLq/tables/tables_20_4.jpg", "caption": "Table 2: Coverage and median of expansions of solved problems for each CCWL and GNN model with varying number of iterations and layers. Higher values are better for coverage, and lower values are better for expansions. The best value per domain and metric coloured. OOM denotes that the training process exceeded the memory limit.", "description": "This table shows the performance of different models (CCWL and GNN) with varying numbers of iterations/layers.  It presents the coverage (number of problems solved) and median number of node expansions for each model and domain.  The best performing model for each domain in terms of coverage and expansion is highlighted.", "section": "6 Experiments"}]