[{"figure_path": "G4vFNmraxj/figures/figures_3_1.jpg", "caption": "Figure 1: GEMCODE: a pipeline for generative co-crystal design consisting of models (LSTM-based GAN, T-VAE, T-CVAE) generating coformer candidates, gradient boosting (GB) classification models predicting the mechanical properties of co-crystals based on the generated coformers, an evolutionary algorithm producing additional coformer candidates with improved tabletability profiles, and a graph neural network (GNN) ranking co-crystals according to the probability of formation.", "description": "This figure illustrates the GEMCODE pipeline, which starts with a therapeutic molecule as input.  A generative model (GAN, T-VAE, or T-CVAE) generates potential coformers.  These coformers are then evaluated using gradient boosting (GB) models to predict their mechanical properties relevant to tabletability. An evolutionary optimization algorithm refines these coformers to improve tabletability, and finally, a graph neural network (GNN) ranks the resulting co-crystals based on their probability of formation and desired properties.  The process culminates in a ranked list of co-crystals suitable for chemical synthesis into tablets.", "section": "4 GEMCODE: Generative Evolution-based Method for Co-crystal Design"}, {"figure_path": "G4vFNmraxj/figures/figures_5_1.jpg", "caption": "Figure 2: Accuracy and F1 score metrics for the ML models predicting three mechanical properties of co-crystals. (a) Unobstructed planes. (b) Orthogonal planes. (c) H-bonds bridging. The performance of each model is shown before (\"Raw data\") and after (\"Processed data\") the feature engineering and feature selection steps.", "description": "This figure shows the performance of various machine learning models in predicting three mechanical properties related to co-crystal tabletability: Unobstructed planes, Orthogonal planes, and H-bonds bridging.  The performance is measured using Accuracy and F1-score, both before and after feature engineering and selection steps.  This allows comparison of model performance with and without data preprocessing.", "section": "4.1 Prediction of mechanical properties of co-crystals"}, {"figure_path": "G4vFNmraxj/figures/figures_19_1.jpg", "caption": "Figure 3: (a) Schematic representation of the mechanical properties of co-crystals. No slip plane and H-bond bridging are associated with low tabletability. The other two properties positively correlate with tabletability. (b) Schematic representation of the particle deformation during powder compression. (c) Number of coformer samples of each category per mechanical property.", "description": "This figure shows a schematic representation of the mechanical properties of co-crystals, illustrating how the presence or absence of slip planes and hydrogen bonds affects tabletability.  It also includes a schematic of particle deformation during powder compression and a bar chart showing the number of coformer samples for each mechanical property.", "section": "3 Data"}, {"figure_path": "G4vFNmraxj/figures/figures_19_2.jpg", "caption": "Figure 4: Molecular representation using the chemical structure of caffeine as an example in the form of SMILES, molecular fingerprints, and molecular descriptors.", "description": "This figure illustrates three different ways of representing molecules: SMILES (Simplified Molecular Input Line Entry System), molecular fingerprints, and molecular descriptors. SMILES notation is a string-based representation of a molecule's structure; molecular fingerprints are vectors representing the presence or absence of certain substructures; and molecular descriptors are numerical values describing various physicochemical properties.  The figure uses caffeine (C8H10N4O2) as an example to show how each method represents the molecule.", "section": "Data"}, {"figure_path": "G4vFNmraxj/figures/figures_20_1.jpg", "caption": "Figure 5: GAN training results on ChEMBL datasets and coformers: (a) plot of the growth of the valid chemical structures share in a batch, (b) t-SNE visualization of molecules from the ChEMBL dataset and coformers.", "description": "This figure shows the results of training a Generative Adversarial Network (GAN) on two datasets: ChEMBL and a smaller dataset of coformers.  Panel (a) is a plot showing the increase in the percentage of valid chemical structures generated by the GAN over the course of training. The validity increases significantly after the GAN is fine-tuned on the smaller coformer dataset. Panel (b) uses t-SNE to visualize the distribution of the molecules from both datasets in a lower-dimensional space. The plot shows a clear separation between the ChEMBL and coformer molecules, highlighting the distinct features and chemical spaces represented by each dataset.", "section": "D Generative models"}, {"figure_path": "G4vFNmraxj/figures/figures_22_1.jpg", "caption": "Figure 1: GEMCODE: a pipeline for generative co-crystal design consisting of models (LSTM-based GAN, T-VAE, T-CVAE) generating coformer candidates, gradient boosting (GB) classification models predicting the mechanical properties of co-crystals based on the generated coformers, an evolutionary algorithm producing additional coformer candidates with improved tabletability profiles, and a graph neural network (GNN) ranking co-crystals according to the probability of formation.", "description": "This figure illustrates the GEMCODE pipeline, which is a hybrid approach for designing cocrystals. It consists of several stages:  The first is the generation of coformer candidates using generative models (LSTM-based GAN, T-VAE, T-CVAE). Next, gradient boosting models predict the mechanical properties of potential cocrystals using the generated coformers. The pipeline then uses an evolutionary algorithm to improve the tabletability of the coformers. Finally, a graph neural network ranks the cocrystals based on the likelihood of formation, ultimately guiding chemical synthesis and tablet creation.", "section": "4 GEMCODE: Generative Evolution-based Method for Co-crystal Design"}, {"figure_path": "G4vFNmraxj/figures/figures_23_1.jpg", "caption": "Figure 7: How unique molecules created in different models intersect.", "description": "This Venn diagram shows the overlap between the sets of unique molecules generated by three different generative models (GAN, T-VAE, and T-CVAE).  Each circle represents the number of unique molecules generated by a single model. The overlapping areas show the number of molecules common to two or three models. The numbers in each section of the diagram indicate the count of unique molecules in that specific region.", "section": "5.2 Generation of coformers"}, {"figure_path": "G4vFNmraxj/figures/figures_24_1.jpg", "caption": "Figure 8: Tanimoto Similarity Histograms: (a) for generated molecules and real coformers, (b) for all generated molecules.", "description": "This figure presents two Tanimoto similarity histograms. The first histogram (a) shows the distribution of Tanimoto similarity scores between generated molecules and real coformers, providing insight into the novelty of the generated molecules.  The second histogram (b) displays the distribution of Tanimoto similarity scores among all generated molecules, indicating the diversity of the generated molecules.  Both histograms are broken down by GAN, VAE, and CVAE models, enabling a comparison of the different generative model's performance regarding novelty and diversity.", "section": "D.8 Similarity analysis of the generated molecules"}, {"figure_path": "G4vFNmraxj/figures/figures_25_1.jpg", "caption": "Figure 9: Scheme of the evolutionary algorithm that is used for fine-tuning of solutions.", "description": "This figure shows the flowchart of the evolutionary algorithm used to optimize the generated coformers. It starts with an initial population of molecules. These molecules undergo selection based on their fitness. The selected molecules are mutated by applying various mutation operators guided by a change advisor. The mutated molecules are then inherited to form a new population, undergoing further optimization until the stop criteria are met. During the process, the best individuals are selected and used for elitism. This iterative process improves the tabletability properties of the generated coformers.", "section": "E.2 Scheme of the algorithm"}, {"figure_path": "G4vFNmraxj/figures/figures_26_1.jpg", "caption": "Figure 10: Comparison of probability distributions for the presence of hydrogen bonds between the planes (H-bond bridging) for coformers generated by the neural models and optimized by evolution.", "description": "This violin plot shows the probability distributions of H-bond bridging between planes for coformers generated using different methods (GAN, T-VAE, T-CVAE) with and without evolutionary optimization.  The plot visually demonstrates how evolutionary optimization impacts this specific mechanical property of the generated coformers, enhancing the probability of hydrogen bond bridging.", "section": "5.3 Evolutionary optimization of coformers"}, {"figure_path": "G4vFNmraxj/figures/figures_26_2.jpg", "caption": "Figure 1: GEMCODE: a pipeline for generative co-crystal design consisting of models (LSTM-based GAN, T-VAE, T-CVAE) generating coformer candidates, gradient boosting (GB) classification models predicting the mechanical properties of co-crystals based on the generated coformers, an evolutionary algorithm producing additional coformer candidates with improved tabletability profiles, and a graph neural network (GNN) ranking co-crystals according to the probability of formation.", "description": "This figure illustrates the GEMCODE pipeline, a multi-stage process for designing co-crystals with enhanced tabletability. It starts with generating coformer candidates using various generative models (LSTM-based GAN, T-VAE, T-CVAE).  These candidates are then evaluated by gradient boosting (GB) models to predict mechanical properties. An evolutionary algorithm optimizes these properties, improving tabletability profiles. Finally, a graph neural network (GNN) ranks the co-crystals based on their probability of formation, leading to a final ranked list of potential co-crystals with the desired properties.", "section": "4 GEMCODE: Generative Evolution-based Method for Co-crystal Design"}, {"figure_path": "G4vFNmraxj/figures/figures_27_1.jpg", "caption": "Figure 1: GEMCODE: a pipeline for generative co-crystal design consisting of models (LSTM-based GAN, T-VAE, T-CVAE) generating coformer candidates, gradient boosting (GB) classification models predicting the mechanical properties of co-crystals based on the generated coformers, an evolutionary algorithm producing additional coformer candidates with improved tabletability profiles, and a graph neural network (GNN) ranking co-crystals according to the probability of formation.", "description": "The figure shows a flowchart of the GEMCODE pipeline. It starts with a therapeutic molecule as input. Three different generative models (LSTM-based GAN, T-VAE, T-CVAE) generate coformer candidates. Gradient boosting models predict the mechanical properties of the co-crystals formed by the therapeutic molecule and each coformer candidate. An evolutionary algorithm optimizes the coformers to improve their tabletability profiles. Finally, a graph neural network ranks the co-crystals according to the probability of formation. The top-ranked co-crystals are then synthesized and tested.", "section": "4 GEMCODE: Generative Evolution-based Method for Co-crystal Design"}, {"figure_path": "G4vFNmraxj/figures/figures_30_1.jpg", "caption": "Figure 1: GEMCODE: a pipeline for generative co-crystal design consisting of models (LSTM-based GAN, T-VAE, T-CVAE) generating coformer candidates, gradient boosting (GB) classification models predicting the mechanical properties of co-crystals based on the generated coformers, an evolutionary algorithm producing additional coformer candidates with improved tabletability profiles, and a graph neural network (GNN) ranking co-crystals according to the probability of formation.", "description": "The figure shows a schematic overview of GEMCODE, a pipeline for designing co-crystals. It starts with a user providing a therapeutic molecule. Then, several generative models (LSTM-based GAN, T-VAE, and T-CVAE) create potential coformer candidates.  A gradient boosting model and an evolutionary algorithm are used to predict and improve the mechanical properties (tabletability) of the co-crystals. Finally, a graph neural network ranks the co-crystals based on the likelihood of formation. The most promising candidates are then synthesized and tested to form tablets.", "section": "4 GEMCODE: Generative Evolution-based Method for Co-crystal Design"}, {"figure_path": "G4vFNmraxj/figures/figures_31_1.jpg", "caption": "Figure 1: GEMCODE: a pipeline for generative co-crystal design consisting of models (LSTM-based GAN, T-VAE, T-CVAE) generating coformer candidates, gradient boosting (GB) classification models predicting the mechanical properties of co-crystals based on the generated coformers, an evolutionary algorithm producing additional coformer candidates with improved tabletability profiles, and a graph neural network (GNN) ranking co-crystals according to the probability of formation.", "description": "The figure illustrates the GEMCODE pipeline, a multi-stage process for designing co-crystals with enhanced tabletability.  It starts with several generative models (GAN, T-VAE, T-CVAE) that propose coformer candidates. These are then evaluated using gradient boosting models to predict the mechanical properties of the resulting co-crystals. An evolutionary algorithm is used to optimize these candidates for improved tabletability. Finally, a graph neural network ranks the co-crystals based on their likelihood of formation. The successful candidates are then synthesized and tested experimentally.", "section": "4 GEMCODE: Generative Evolution-based Method for Co-crystal Design"}]