[{"figure_path": "3Z0LTDjIM0/tables/tables_1_1.jpg", "caption": "Table 1: Example GDEs with their corresponding propagation matrix M, coefficients ck, and source s.", "description": "This table lists several examples of Graph Diffusion Equations (GDEs), including their corresponding propagation matrix (M), the sequence of coefficients (ck) that determines the weight of each diffusion step, and the source vector (s) that initiates the diffusion process.  The GDEs listed are Personalized PageRank (PPR), Katz centrality (Katz), Heat kernel (HK), Inverse PageRank (IPR), and APPNP.", "section": "GDES, Localization, and Existing Local Solvers"}, {"figure_path": "3Z0LTDjIM0/tables/tables_2_1.jpg", "caption": "Table 1: Example GDEs with their corresponding propagation matrix M, coefficients ck, and source s.", "description": "This table lists four example graph diffusion equations (GDEs): Personalized PageRank (PPR), Katz centrality, Heat kernel (HK), and Inverse PageRank (IPR). For each GDE, the table provides the corresponding propagation matrix (M), the sequence of coefficients (ck), and the source vector (s) used in the general GDE equation f = Σk=0∞ ckMk s.", "section": "GDEs, Localization, and Existing Local Solvers"}, {"figure_path": "3Z0LTDjIM0/tables/tables_16_1.jpg", "caption": "Table 2: Speedup ratio of computing PPR vectors. Let TA and TLocalA be the number of operations of the standard algorithm A and the local solver LocalA, respectively. The speedup ratio = TA/TLocalA.", "description": "This table presents the speedup ratios achieved by using local solvers (LocalSOR, LocalGS, LocalGD, LocalCH) compared to their global counterparts (SOR, GS, GD, CH) for computing PPR vectors. The speedup ratio is calculated as the ratio of the number of operations required by the global solver to the number of operations required by the corresponding local solver.  The table shows that local solvers significantly outperform global solvers in terms of computational efficiency for various datasets.", "section": "5.1 Results on efficiency of local GDE solvers"}, {"figure_path": "3Z0LTDjIM0/tables/tables_26_1.jpg", "caption": "Table 2: Speedup ratio of computing PPR vectors. Let TA and TLocalA be the number of operations of the standard algorithm A and the local solver LocalA, respectively. The speedup ratio = TA/TLocalA.", "description": "This table presents the speedup ratios achieved by using local solvers (LocalSOR, LocalGS, LocalGD, and LocalCH) compared to their global counterparts (SOR, GS, GD, and CH) for computing Personalized PageRank (PPR) vectors. The speedup ratio is calculated as the number of operations of the global algorithm divided by the number of operations of the corresponding local algorithm.  Higher values indicate greater speedup from the local algorithms. The table includes results for several datasets (Citeseer, ogbn-arxiv, ogbn-products, wiki-talk, and ogbn-papers100M), showcasing the performance improvements across different graph sizes.", "section": "5.1 Results on efficiency of local GDE solvers"}, {"figure_path": "3Z0LTDjIM0/tables/tables_26_2.jpg", "caption": "Table 2: Speedup ratio of computing PPR vectors. Let TA and TLocalA be the number of operations of the standard algorithm A and the local solver LocalA, respectively. The speedup ratio = TA/TLocalA.", "description": "This table presents the speedup ratios achieved by using local solvers compared to their global counterparts for computing PPR vectors on various graph datasets. The speedup ratio is calculated as the number of operations of the standard algorithm divided by the number of operations of the corresponding local solver.  Higher speedup ratios indicate greater efficiency gains from using the local solvers.", "section": "5.1 Results on efficiency of local GDE solvers"}, {"figure_path": "3Z0LTDjIM0/tables/tables_27_1.jpg", "caption": "Table 3: Dataset Statistics sorted by n + m", "description": "This table presents the statistics of the 18 graph datasets used in the experiments.  For each dataset, it provides the number of nodes (n), the number of edges (m), and the sum of nodes and edges (n + m). The datasets are ordered by the value of n + m, ranging from smaller to larger graphs.", "section": "5 Experiments"}, {"figure_path": "3Z0LTDjIM0/tables/tables_27_2.jpg", "caption": "Table 4: Parameters of InstantGNN", "description": "This table presents the hyperparameters used in the InstantGNN model training experiments.  It shows the values for beta (β), alpha (α), epsilon (ε), learning rate (lr), batch size, dropout rate, hidden layer size, and number of layers used for the ogbn-arxiv and ogbn-products datasets.", "section": "5 Experiments"}, {"figure_path": "3Z0LTDjIM0/tables/tables_28_1.jpg", "caption": "Table 5: Unnormalized participation ratios for PPR (α = 0.1)", "description": "This table presents the unnormalized participation ratios for Personalized PageRank (PPR) with a damping factor α of 0.1, calculated for 18 different graphs.  For each graph, the table shows the number of vertices, the average degree, and the minimum, mean, median, and maximum participation ratios.  The participation ratio is a measure of the localization of the PPR vector, indicating how concentrated the vector's values are across the nodes of the graph.", "section": "5.1 Results on efficiency of local GDE solvers"}, {"figure_path": "3Z0LTDjIM0/tables/tables_28_2.jpg", "caption": "Table 5: Unnormalized participation ratios for PPR (α = 0.1)", "description": "This table presents the unnormalized participation ratios for the Personalized PageRank (PPR) algorithm with a damping factor α of 0.1.  For each of the 18 graphs listed, the table shows the average degree, minimum, mean, median, and maximum participation ratios. The participation ratio is a measure of the localization of the PPR vector, indicating how concentrated the vector's values are across the nodes of the graph.  Lower participation ratios generally imply greater localization of the PPR vector.", "section": "5.1 Results on efficiency of local GDE solvers"}, {"figure_path": "3Z0LTDjIM0/tables/tables_29_1.jpg", "caption": "Table 7: Unnormalized participation ratios for HK(τ = 10)", "description": "This table presents the unnormalized participation ratios for the Heat Kernel (HK) diffusion equation with a temperature parameter τ set to 10.  It shows the minimum, mean, median, and maximum participation ratios for each of the listed graphs, along with the average degree and the number of vertices in each graph. The participation ratio is a measure of the localization of the diffusion vector, indicating how concentrated the diffusion values are across the nodes of the graph. Lower participation ratios suggest higher localization.", "section": "5.1 Results on efficiency of local GDE solvers"}]