[{"figure_path": "yS9xU6ANiA/tables/tables_8_1.jpg", "caption": "Table 1: Comparison of RS, CEIS, NIS, and EXOM (ours) across 3 different SCMs, with |s| = 1,3,5. Among the three SCMs, SIMPSON-NLIN is Markovian diffeomorphic, NAPKIN is Semi-Markovian continuous, and FAIRNESS-XW is Regional canonical. The results are averaged over 5 runs. Higher ESP and lower FR indicate better performance.", "description": "This table compares the performance of four different counterfactual estimation methods (Rejection Sampling, Cross-Entropy Importance Sampling, Neural Importance Sampling, and the proposed Exogenous Matching) across three different types of Structural Causal Models (SCMs) and for different numbers of submodels (|s|).  The SCMs represent different levels of complexity and assumptions (Markovian diffeomorphic, Semi-Markovian continuous, and Regional canonical). The metrics used are Effective Sample Proportion (ESP) and Failure Rate (FR), which measure sampling efficiency and success rate, respectively. Higher ESP and lower FR values indicate better performance.", "section": "Experiments"}, {"figure_path": "yS9xU6ANiA/tables/tables_9_1.jpg", "caption": "Table 2: Estimation of counterfactual densities on CausalNF and counterfactual effects on NCM. Here, \"O\" represents the original SCM, and \"P\" represents the proxy SCM. For SIMPSON-NLIN, the proxy SCM is CausalNF, and the metric used is FR (\"-\" indicates FR equals 1); whereas for FAIRNESS, the proxy SCM is NCM, and the metric used is the average bias w.r.t. the ground truth. The subscript denotes the 95% CI error bound over 5 trials. For more details, see App. C.9", "description": "This table compares the performance of different methods (RS, EXOM[MAF], EXOM[NICE]) for estimating counterfactual densities and effects on two types of SCMs: SIMPSON-NLIN (using CausalNF as a proxy) and FAIRNESS (using NCM as a proxy).  It shows the average results for different counterfactual queries (ATE, ETT, NDE, CtfDE) across various numbers of submodels (|s| = 1, 3, 5). The metrics used are FR (Failure Rate, for SIMPSON-NLIN) and average bias (for FAIRNESS), with 95% confidence intervals reported.", "section": "Counterfactual Estimation on Proxy SCMs"}, {"figure_path": "yS9xU6ANiA/tables/tables_26_1.jpg", "caption": "Table 1: Comparison of RS, CEIS, NIS, and EXOM (ours) across 3 different SCMs, with |s| = 1,3,5. Among the three SCMs, SIMPSON-NLIN is Markovian diffeomorphic, NAPKIN is Semi-Markovian continuous, and FAIRNESS-XW is Regional canonical. The results are averaged over 5 runs. Higher ESP and lower FR indicate better performance.", "description": "This table compares the performance of four different counterfactual estimation methods (Rejection Sampling, Cross-Entropy Importance Sampling, Neural Importance Sampling, and the proposed Exogenous Matching) across three different types of Structural Causal Models (SCMs) with varying numbers of submodels.  The metrics used to evaluate performance are Effective Sample Proportion (ESP) and Failure Rate (FR). Higher ESP values and lower FR values indicate better performance.  The SCMs represent different levels of complexity in terms of their underlying causal structures and the nature of their variables.", "section": "Experiments"}, {"figure_path": "yS9xU6ANiA/tables/tables_26_2.jpg", "caption": "Table 2: Estimation of counterfactual densities on CausalNF and counterfactual effects on NCM. Here, \"O\" represents the original SCM, and \"P\" represents the proxy SCM. For SIMPSON-NLIN, the proxy SCM is CausalNF, and the metric used is FR (\"-\" indicates FR equals 1); whereas for FAIRNESS, the proxy SCM is NCM, and the metric used is the average bias w.r.t. the ground truth. The subscript denotes the 95% CI error bound over 5 trials. For more details, see App. C.9", "description": "This table compares the performance of different methods for estimating counterfactual densities and effects on two different types of proxy SCMs: CausalNF and NCM.  For SIMPSON-NLIN, it uses CausalNF as the proxy, and the failure rate (FR) is reported. For FAIRNESS, it uses NCM, reporting the average bias. Error bars (95% confidence intervals) are provided.  More details can be found in Appendix C.9 of the paper.", "section": "Experiments"}, {"figure_path": "yS9xU6ANiA/tables/tables_34_1.jpg", "caption": "Table 1: Comparison of RS, CEIS, NIS, and EXOM (ours) across 3 different SCMs, with |s| = 1,3,5. Among the three SCMs, SIMPSON-NLIN is Markovian diffeomorphic, NAPKIN is Semi-Markovian continuous, and FAIRNESS-XW is Regional canonical. The results are averaged over 5 runs. Higher ESP and lower FR indicate better performance.", "description": "This table compares the performance of four different counterfactual estimation methods (Rejection Sampling, Cross-Entropy based Importance Sampling, Neural Importance Sampling, and Exogenous Matching) across three different types of structural causal models (SCMs) and varying numbers of submodels (|s|). The SCMs represent different levels of complexity and assumptions.  Higher ESP (Effective Sample Proportion) values indicate better sampling efficiency, while lower FR (Failure Rate) values suggest a more robust and accurate estimation.", "section": "Experiments"}, {"figure_path": "yS9xU6ANiA/tables/tables_42_1.jpg", "caption": "Table 2: Estimation of counterfactual densities on CausalNF and counterfactual effects on NCM. Here, \"O\" represents the original SCM, and \"P\" represents the proxy SCM. For SIMPSON-NLIN, the proxy SCM is CausalNF, and the metric used is FR (\"-\" indicates FR equals 1); whereas for FAIRNESS, the proxy SCM is NCM, and the metric used is the average bias w.r.t. the ground truth. The subscript denotes the 95% CI error bound over 5 trials. For more details, see App. C.9", "description": "This table presents the results of counterfactual density and effect estimations using two different proxy SCMs (CausalNF and NCM).  For SIMPSON-NLIN, it compares the Failure Rate (FR) of the original and proxy SCMs using different estimation methods (RS, EXOM[MAF], EXOM[NICE]). For FAIRNESS, it compares the average bias (with 95% confidence intervals) of the original and proxy SCMs for four different types of counterfactual effects (ATE, ETT, NDE, CtfDE).  The results highlight the effectiveness of EXOM in both counterfactual density and effect estimations.", "section": "Counterfactual Estimation on Proxy SCMs"}, {"figure_path": "yS9xU6ANiA/tables/tables_43_1.jpg", "caption": "Table 2: Estimation of counterfactual densities on CausalNF and counterfactual effects on NCM. Here, \"O\" represents the original SCM, and \"P\" represents the proxy SCM. For SIMPSON-NLIN, the proxy SCM is CausalNF, and the metric used is FR (\"-\" indicates FR equals 1); whereas for FAIRNESS, the proxy SCM is NCM, and the metric used is the average bias w.r.t. the ground truth. The subscript denotes the 95% CI error bound over 5 trials. For more details, see App. C.9", "description": "This table presents the results of counterfactual density and effect estimations using two different proxy structural causal models (SCMs): CausalNF for SIMPSON-NLIN and NCM for FAIRNESS.  For SIMPSON-NLIN, the failure rate (FR) is reported, while for FAIRNESS, the average bias relative to the ground truth is shown.  The results are compared against the original SCMs and rejection sampling (RS). Error bounds are included, showing the average across five runs with different random seeds. Appendix C.9 provides additional details.", "section": "Counterfactual Estimation on Proxy SCMs"}, {"figure_path": "yS9xU6ANiA/tables/tables_43_2.jpg", "caption": "Table 2: Estimation of counterfactual densities on CausalNF and counterfactual effects on NCM. Here, \"O\" represents the original SCM, and \"P\" represents the proxy SCM. For SIMPSON-NLIN, the proxy SCM is CausalNF, and the metric used is FR (\"-\" indicates FR equals 1); whereas for FAIRNESS, the proxy SCM is NCM, and the metric used is the average bias w.r.t. the ground truth. The subscript denotes the 95% CI error bound over 5 trials. For more details, see App. C.9", "description": "This table presents the results of counterfactual estimation experiments using two different proxy structural causal models (SCMs): CausalNF for SIMPSON-NLIN and NCM for FAIRNESS.  For SIMPSON-NLIN, the failure rate (FR) is reported, indicating the proportion of samples that failed to satisfy the conditions of the counterfactual events. For FAIRNESS, the average bias of the estimations relative to the ground truth is shown, along with 95% confidence intervals. The results are separated into five different counterfactual queries (ATE, ETT, NDE, CtfDE) for fairness and different numbers of counterfactual events (|s|=1,3,5) for SIMPSON-NLIN.", "section": "Counterfactual Estimation on Proxy SCMs"}]