[{"figure_path": "JZHFRLoqDq/figures/figures_1_1.jpg", "caption": "Figure 1: Entropic barycenter Q* (5) of N = 4 von Mises distributions Pn on the sphere (see §5.1) estimated with our barycenter solver (Algorithm 1). The used transport costs are ck (xk, y) = ½ (arccos (xk, y))².", "description": "This figure visualizes the results of estimating the entropic barycenter of four von Mises distributions on a sphere using the proposed algorithm.  The figure shows the unfolded sphere and three different viewpoints of the sphere with the four distributions and the estimated barycenter. The color-coding distinguishes the four distributions and the barycenter. The transport cost used is based on the squared arccosine distance between points on the sphere.", "section": "5.1 Barycenters of Toy Distributions"}, {"figure_path": "JZHFRLoqDq/figures/figures_7_1.jpg", "caption": "Figure 2: 2D twister example: The true barycenter of 3 comets vs. the one computed by our solver with\n€ = 10−2. Two costs ck are considered: the twisted cost (2a, 2b) and l² (2c, 2d).", "description": "This figure shows a comparison of the true unregularized barycenter and the EOT barycenter computed by the proposed solver for a 2D twister example.  The true barycenters were computed for both a twisted cost and the standard l² cost. The figure visualizes how the proposed method's approximation of the barycenter compares to the ground truth barycenter in these two different cost function scenarios.", "section": "5.1 Barycenters of Toy Distributions"}, {"figure_path": "JZHFRLoqDq/figures/figures_7_2.jpg", "caption": "Figure 1: Entropic barycenter Q* (5) of N = 4 von Mises distributions Pn on the sphere (see §5.1) estimated with our barycenter solver (Algorithm 1). The used transport costs are ck (xk, y) = ½ (arccos (xk, y))².", "description": "This figure visualizes the results of estimating an entropic barycenter of four von Mises distributions on a sphere using the proposed algorithm.  Panel (a) shows the unfolded sphere. Panel (b) shows the sphere viewed from different angles, with each point representing a sample from one of the four von Mises distributions (P1-P4), and the barycenter (Q*). The color-coding helps distinguish the different distributions and the barycenter's position relative to them. The squared arccosine of the angle between points is used as the transport cost.", "section": "5.1 Barycenters of Toy Distributions"}, {"figure_path": "JZHFRLoqDq/figures/figures_8_1.jpg", "caption": "Figure 4: Experiment on the Ave, celeba! barycenter dataset. The plots compare the transported inputs xk ~ Pk to the barycenter learned by various solvers. The true unregularized l² barycenter of P1, P2, P3 are the clean celebrity faces, see [55, §5].", "description": "This figure compares the results of different barycenter solvers on the Ave, celeba! dataset. It shows the mappings from three different source distributions (P1, P2, P3) to the learned barycenter. The top row displays the input images from each distribution. The subsequent rows showcase the results produced by various solvers, including the ground truth, WIN, SCWB and the authors' proposed method (OURS) with and without manifold constraints. The ground truth consists of clean celebrity faces, as referenced in the cited work [55, §5]. The figure visually demonstrates the effectiveness of the proposed method in generating more realistic and less noisy barycenter images compared to other state-of-the-art approaches, particularly when the manifold constraint is applied.", "section": "5.3 Evaluation on the Ave, celeba! Dataset"}, {"figure_path": "JZHFRLoqDq/figures/figures_8_2.jpg", "caption": "Figure 5: Qualitative comparison of barycenters of MNIST 0/1 digit classes computed with barycenter solvers in the image space w.r.t. the pixel-wise l². Solvers SCWB and WIN only learn the unregularized barycenter (€ = 0) directly in the data space. In turn, our solver learns the EOT barycenter in data space as well as it can learn EOT barycenter restricted to the StyleGAN manifold (€ = 10-2).", "description": "This figure compares the results of different barycenter solvers on MNIST 0 and 1 digit classes.  It shows the learned transport maps from the input distributions (zeros and ones) to the barycenter. The comparison highlights the differences between solvers that operate directly in the image space versus those that utilize a StyleGAN manifold for learning the barycenter. The results showcase the ability of the proposed method to handle the e-regularized EOT barycenter problem and to leverage the pretrained StyleGAN generative model for generating a smoother, less noisy result.", "section": "5.2 Barycenters of MNIST Classes 0 and 1"}, {"figure_path": "JZHFRLoqDq/figures/figures_23_1.jpg", "caption": "Figure 1: Entropic barycenter Q* (5) of N = 4 von Mises distributions Pn on the sphere (see §5.1) estimated with our barycenter solver (Algorithm 1). The used transport costs are ck (xk, y) = ½ (arccos (xk, y))².", "description": "This figure shows the results of estimating the entropic barycenter of four von Mises distributions on a sphere using the proposed barycenter solver.  The barycenter Q* is visualized in panel (a) as an unfolded sphere, and in panel (b) from different viewpoints. The algorithm uses a specific cost function based on arccosine distance.", "section": "5.1 Barycenters of Toy Distributions"}, {"figure_path": "JZHFRLoqDq/figures/figures_26_1.jpg", "caption": "Figure 7: Experiment with averaging MNIST 0/1 digit classes. The plot shows additional examples of samples transported with our solver to the barycenter.", "description": "This figure shows additional examples of samples transported to the barycenter from the MNIST 0 and 1 digit classes.  The images illustrate the results of applying the proposed EOT barycenter solver to these classes. The top panel shows the samples transported from the class 0 (zeros) and the bottom panel shows the samples transported from the class 1 (ones). Each column represents a different sample from the input distributions, and each row represents a different sample from the transported distribution.", "section": "5.2 Barycenters of MNIST Classes 0 and 1"}, {"figure_path": "JZHFRLoqDq/figures/figures_27_1.jpg", "caption": "Figure 4: Experiment on the Ave, celeba! barycenter dataset. The plots compare the transported inputs xk ~ Pk to the barycenter learned by various solvers. The true unregularized l² barycenter of P1, P2, P3 are the clean celebrity faces, see [55, §5].", "description": "This figure compares the results of different continuous optimal transport (OT) barycenter solvers on the Ave, celeba! dataset.  It shows how different methods transport samples from three input distributions (P1, P2, P3) to the estimated barycenter.  The true barycenter, known beforehand for this dataset, consists of clean celebrity images. The figure highlights the visual differences in the mappings produced by various solvers, illustrating the effect of the chosen method on the quality and characteristics of the resulting barycenter.", "section": "5.3 Evaluation on the Ave, celeba! Dataset"}, {"figure_path": "JZHFRLoqDq/figures/figures_27_2.jpg", "caption": "Figure 1: Entropic barycenter Q* (5) of N = 4 von Mises distributions Pn on the sphere (see §5.1) estimated with our barycenter solver (Algorithm 1). The used transport costs are ck (xk, y) = ½ (arccos (xk, y))².", "description": "This figure visualizes the results of estimating the entropic barycenter of four von Mises distributions on a sphere using the proposed algorithm.  Panel (a) shows the unfolded sphere for better visualization. Panel (b) displays the sphere from various viewpoints, highlighting the four von Mises distributions (in different colors) and the estimated barycenter (in purple). The algorithm uses a cost function based on the squared arccosine distance between points on the sphere.", "section": "5.1 Barycenters of Toy Distributions"}, {"figure_path": "JZHFRLoqDq/figures/figures_28_1.jpg", "caption": "Figure 4: Experiment on the Ave, celeba! barycenter dataset. The plots compare the transported inputs xk ~ Pk to the barycenter learned by various solvers. The true unregularized l² barycenter of P1, P2, P3 are the clean celebrity faces, see [55, §5].", "description": "This figure compares the results of different optimal transport (OT) barycenter solvers on the Ave, celeba! dataset.  The dataset consists of three sets of degraded celebrity faces (P1, P2, P3). The goal is to find a barycenter, a representative average face.  The figure shows how input faces from each set (xk ~ Pk) are transformed (mapped) to the barycenter by each solver.  The 'true' unregularized l² barycenter (the clean celebrity faces) is used as a reference for comparison, allowing for a visual assessment of each solver's accuracy.", "section": "5.3 Evaluation on the Ave, celeba! Dataset"}, {"figure_path": "JZHFRLoqDq/figures/figures_29_1.jpg", "caption": "Figure 1: Entropic barycenter Q* (5) of N = 4 von Mises distributions Pn on the sphere (see §5.1) estimated with our barycenter solver (Algorithm 1). The used transport costs are ck (xk, y) = ½ (arccos (xk, y))².", "description": "This figure visualizes the result of estimating the entropic barycenter of four von Mises distributions on a sphere using the proposed algorithm.  Panel (a) shows the unfolded sphere, while panel (b) presents different viewpoints of the sphere with the four distributions and the estimated barycenter highlighted. The cost function used is based on the arccosine distance between points on the sphere.", "section": "5.1 Barycenters of Toy Distributions"}, {"figure_path": "JZHFRLoqDq/figures/figures_30_1.jpg", "caption": "Figure 2: 2D twister example: The true barycenter of 3 comets vs. the one computed by our solver with\n€ = 10−2. Two costs ck are considered: the twisted cost (2a, 2b) and l² (2c, 2d).", "description": "This figure shows a comparison of the true unregularized barycenter and the EOT barycenter computed using the proposed method for a 2D twister example.  The example involves three comet-shaped distributions. Two different cost functions are used for comparison: a twisted cost and the standard Euclidean l2 cost.  The plots visualize the distributions and their corresponding barycenters, illustrating the differences obtained when using different cost functions and regularization.", "section": "5.1 Barycenters of Toy Distributions"}]