[{"figure_path": "miO8odRzto/figures/figures_3_1.jpg", "caption": "Figure 1: A brief illustration of the proposed Online Relational Inference (ORI) framework.", "description": "The figure illustrates the Online Relational Inference (ORI) framework. It shows how the model processes streaming trajectory data to infer interaction graphs in real-time.  The process includes a trajectory mirror for data augmentation, a model-agnostic GNN for processing trajectories and predicting future states, and AdaRelation for adaptively adjusting the learning rate of the adjacency matrix based on the evolution of the system. The framework uses online backpropagation to update the model with each new data point, allowing it to adapt to changing environments.", "section": "3 Proposed Approach"}, {"figure_path": "miO8odRzto/figures/figures_6_1.jpg", "caption": "Figure 2: Prediction results of ORI with MPMr decoder and the baseline MPM in the springs system. (a) the relation accuracy in the two models throughout the training (top) and visualization of the target and predicted adjacency matrix in our model (bottom). (b) target and predicted trajectories in our model.", "description": "This figure shows the comparison between the proposed Online Relational Inference (ORI) method and the baseline method (MPM) in a spring system where the interaction graph evolves every 3000 iterations. The top panel of (a) presents the relation accuracy over training iterations, demonstrating ORI's superior performance in adapting to the evolving graph. The bottom panel of (a) visualizes the target and predicted adjacency matrices at different time points, illustrating ORI's ability to accurately infer the interaction graph. Panel (b) displays the target and predicted trajectories at specific iterations (15k and 18k-1), further showcasing ORI's accurate trajectory prediction.", "section": "4.1 Inferring Relation in Evolving Interaction Graph"}, {"figure_path": "miO8odRzto/figures/figures_7_1.jpg", "caption": "Figure 3: Prediction results of ORI with NRIr decoder in the charged system with evolving interaction and parameters (a) and ORI with MPMr decoder in the springs and charged systems with evolving interaction and dynamics (b). 1-st row compares the relation accuracy between constant learning rates and AdaRelation. 2-nd row shows changes in the relation learning rate throughout the training.", "description": "This figure demonstrates the performance of ORI in scenarios with evolving interaction graphs and dynamics.  Subfigure (a) shows results for a charged system where both the interaction graph and parameters change every 3000 iterations. Subfigure (b) shows results for both spring and charged systems where both the interaction graph and the dynamics change every 3000 iterations.  The top row of each subfigure displays the relation accuracy over time for ORI using different learning rate strategies: a constant learning rate, and the proposed adaptive learning rate (AdaRelation). The bottom row shows how the relation learning rate changes over time.  The results illustrate AdaRelation’s effectiveness in adapting to these dynamic scenarios.", "section": "4.2 Inferring Relation in Evolving Interaction Graph and Dynamics"}, {"figure_path": "miO8odRzto/figures/figures_7_2.jpg", "caption": "Figure 4: Comparison between ORI and existing methods with respect to the relation accuracy (a), variance in the adjacency matrix (b), and variance in the predicted trajectory (c) depending on encoder complexity. The number in the MPM (·) represents the dimension of hidden states in the encoder.", "description": "This figure compares ORI's performance against existing methods (MPM with varying encoder sizes and NRI, dNRI) across three key metrics: relation accuracy, variance in the adjacency matrix, and variance in the predicted trajectory.  Subfigure (a) shows that ORI achieves high relation accuracy with significantly fewer parameters than the other methods. Subfigure (b) demonstrates the stability of ORI's adjacency matrix updates compared to the others, which experience fluctuations. Finally, subfigure (c) highlights that ORI's trajectory predictions are highly sensitive to correct interaction information, further showcasing its robustness.", "section": "4.3 Discussion on Performance Gain in ORI"}, {"figure_path": "miO8odRzto/figures/figures_8_1.jpg", "caption": "Figure 5: Prediction results of ORI with MPMr decoder and MPM in CMU MoCap dataset. 1-st row represents the last frame in the predicted and target trajectory from ORI. 2-nd and 3-rd rows visualize the top-30 strongest interaction edges in the corresponding frame from ORI and MPM. Note that MPM allocate higher relation strengths in the front foot while ORI focuses on the foot behind.", "description": "This figure compares the performance of Online Relational Inference (ORI) and the baseline method (MPM) on the CMU MoCap dataset, focusing on a walking motion.  The top row shows a 3D visualization of the predicted and actual trajectories from both methods, highlighting the similarity between ORI's prediction and the ground truth. The middle and bottom rows provide a detailed view of the top 30 strongest inferred interactions (edges) between skeletal joints, visualized as lines connecting the joints.  The comparison shows that ORI focuses its attention on the foot behind during the walking motion, whereas MPM emphasizes the front foot. This suggests that ORI yields more nuanced and potentially more accurate estimations of the interactions in the human body during movement.", "section": "4.4 Real-world Application"}, {"figure_path": "miO8odRzto/figures/figures_13_1.jpg", "caption": "Figure 6: Correlation between the dissimilarity and the number of iterations required to reach 90% accuracy since the interaction graph evolves in ORI with MPMr decoder in the springs system.", "description": "This figure shows the correlation between the dissimilarity of interaction graphs and the number of iterations needed to achieve 90% accuracy in the springs system using the ORI model with the MPMr decoder.  The dissimilarity measures how different two interaction graphs are. The plots (a) demonstrate that for similar graphs, convergence is faster, while for dissimilar graphs, it takes more iterations to reach 90% accuracy.  Plot (b) displays this correlation using a scatter plot, illustrating the relationship between dissimilarity and the number of iterations.", "section": "4.1 Inferring Relation in Evolving Interaction Graph"}, {"figure_path": "miO8odRzto/figures/figures_13_2.jpg", "caption": "Figure 7: ORI with MPMr decoder in five different cases with irregular evolution in interaction. The system is based on springs system with 10 agents and consists of three 1k iterations, four 2k iterations, and three 3k iterations.", "description": "This figure shows the performance of the ORI model with MPMr decoder in five different scenarios with irregular evolution in interactions. Each scenario has a different pattern of interaction graph changes at varying intervals (1k, 2k, or 3k iterations). The x-axis represents the training iterations, and the y-axis represents the relation accuracy. The graph demonstrates how well the ORI model adapts to these different irregular interaction changes, showing that the model is able to quickly adapt and maintain high accuracy despite the irregular timing of changes. This highlights the model's robustness and ability to handle dynamic environments.", "section": "Additional Experimental Results"}]