[{"figure_path": "Kx8I0rP7w2/figures/figures_7_1.jpg", "caption": "Figure 1: Effect of sparsification on the performance of clustering algorithms on various data sets. We observe that the metric backbone and the spectral sparsification retain equally well the community structure across all data sets and for all clustering algorithms tested. Thresholding often yields several disconnected components of small sizes, impacting the performance of clustering algorithms on G⁰.", "description": "This figure compares the performance of three different graph clustering algorithms (Bayesian MCMC, Leiden, and Spectral Clustering) on four different real-world datasets after applying three different graph sparsification techniques: metric backbone, threshold subgraph, and spectral sparsifier.  The results show that both the metric backbone and the spectral sparsifier preserve the community structure well across all datasets and algorithms.  In contrast, the threshold subgraph often performs poorly due to the creation of many disconnected components.", "section": "4 Experimental Results"}, {"figure_path": "Kx8I0rP7w2/figures/figures_7_2.jpg", "caption": "Figure 2: Graphs obtained from Primary school data set, after taking the metric backbone (Figure 2a) and after thresholding (Figure 2b), are drawn using the same layout. Vertex colors represent the true clusters. Edges present in the metric backbone but not in the threshold graph are highlighted in red. Edges present in the threshold graph, but not in the metric backbone, are highlighted in blue.", "description": "This figure shows a comparison of the Primary school dataset's metric backbone and its thresholded subgraph.  The layout is consistent across both subgraphs to facilitate comparison.  Vertices are colored according to their true community assignment.  Red edges represent those present in the metric backbone but absent in the thresholded subgraph, which emphasizes the importance of inter-community connections preserved by the metric backbone. Blue edges, conversely, illustrate intra-community edges retained by thresholding but removed by the metric backbone process, underscoring the reduction of intra-community edges by the backbone.", "section": "Experimental Results"}, {"figure_path": "Kx8I0rP7w2/figures/figures_8_1.jpg", "caption": "Figure 1: Effect of sparsification on the performance of clustering algorithms on various data sets. We observe that the metric backbone and the spectral sparsification retain equally well the community structure across all data sets and for all clustering algorithms tested. Thresholding often yields several disconnected components of small sizes, impacting the performance of clustering algorithms on G⁰.", "description": "The figure shows the performance of three different clustering algorithms (Bayesian MCMC, Leiden, and Spectral Clustering) on various datasets after applying three different sparsification techniques: metric backbone, threshold subgraph, and spectral sparsifier.  The results are presented in terms of Adjusted Rand Index (ARI), a measure of the similarity between two data clusterings. The figure demonstrates that the metric backbone and spectral sparsifier preserve community structure well, while thresholding leads to poor performance due to graph fragmentation.", "section": "4 Experimental Results"}, {"figure_path": "Kx8I0rP7w2/figures/figures_8_2.jpg", "caption": "Figure 1: Effect of sparsification on the performance of clustering algorithms on various data sets. We observe that the metric backbone and the spectral sparsification retain equally well the community structure across all data sets and for all clustering algorithms tested. Thresholding often yields several disconnected components of small sizes, impacting the performance of clustering algorithms on Gº.", "description": "The figure displays the performance of three different graph clustering algorithms (Bayesian MCMC, Leiden, and Spectral Clustering) across three different real-world datasets (High School, Primary School, and DBLP) when applied to four different versions of the graphs: (1) the original graph, (2) the metric backbone, (3) the threshold subgraph, and (4) the spectral sparsifier.  The results show that both the metric backbone and the spectral sparsifier preserve the community structure effectively, while the threshold subgraph performs poorly due to the creation of disconnected components.", "section": "4 Experimental Results"}, {"figure_path": "Kx8I0rP7w2/figures/figures_25_1.jpg", "caption": "Figure 5: Graphs obtained from Primary school data set, after taking the metric backbone (Figure 5a) and after spectral sparsification (Figure 5b), are drawn using the same layout. Vertex colors represent the true clusters. Edges present in the metric backbone but not in the spectral sparsifier graph are highlighted in red. Similarly, edges present in the spectral sparsifier graph, but not in the metric backbone, are highlighted in blue.", "description": "This figure compares the metric backbone and the spectral sparsification of the Primary school data set.  The layout is the same for both subfigures, making comparison easy.  Vertex colors indicate the true community assignments.  Red edges exist in the metric backbone but not the spectral sparsifier; blue edges are in the spectral sparsifier but not the metric backbone. The figure illustrates that while both methods effectively maintain the community structure, they achieve this by preserving different sets of edges.", "section": "Experimental Results"}, {"figure_path": "Kx8I0rP7w2/figures/figures_25_2.jpg", "caption": "Figure 1: Effect of sparsification on the performance of clustering algorithms on various data sets. We observe that the metric backbone and the spectral sparsification retain equally well the community structure across all data sets and for all clustering algorithms tested. Thresholding often yields several disconnected components of small sizes, impacting the performance of clustering algorithms on Gº.", "description": "The figure shows the performance of three different graph clustering algorithms (Bayesian MCMC, Leiden, and Spectral Clustering) on various datasets after applying three different graph sparsification techniques: metric backbone, threshold subgraph, and spectral sparsifier.  The results demonstrate that the metric backbone and spectral sparsification methods effectively preserve the community structure, outperforming the threshold subgraph approach, which often creates many small disconnected components.", "section": "4 Experimental Results"}, {"figure_path": "Kx8I0rP7w2/figures/figures_26_1.jpg", "caption": "Figure 7: Number of edges in the q-nearest neighbour graph (built using Gaussian kernel similarity) and its metric backbone.", "description": "This figure shows the number of edges in the original q-nearest neighbor graphs and their corresponding metric backbones for three datasets: MNIST, FashionMNIST, and HAR.  The x-axis represents the value of q (number of nearest neighbors), and the y-axis shows the number of edges.  The plots demonstrate that the metric backbone consistently contains significantly fewer edges than the original graph across all values of q and datasets. The number of edges in the original graph increases almost linearly with q. In contrast, the number of edges in the metric backbone grows much more slowly.", "section": "5 Application to Graph Construction Using q-NN"}, {"figure_path": "Kx8I0rP7w2/figures/figures_26_2.jpg", "caption": "Figure 1: Effect of sparsification on the performance of clustering algorithms on various data sets. We observe that the metric backbone and the spectral sparsification retain equally well the community structure across all data sets and for all clustering algorithms tested. Thresholding often yields several disconnected components of small sizes, impacting the performance of clustering algorithms on Gº.", "description": "This figure compares the performance of three different graph clustering algorithms (Bayesian MCMC, Leiden, and Spectral Clustering) on four different real-world datasets (High School, Primary School, DBLP, and Amazon).  Each algorithm was run on the original graph and three sparsified versions of the graph: the metric backbone, a threshold subgraph, and a spectrally sparsed graph. The results show that the metric backbone and the spectrally sparsed graph generally preserve the community structure as well as, or better than, the original graph, while the threshold subgraph often performs worse, likely due to creating many disconnected components.", "section": "4 Experimental Results"}, {"figure_path": "Kx8I0rP7w2/figures/figures_26_3.jpg", "caption": "Figure 7: Number of edges in the q-nearest neighbour graph (built using Gaussian kernel similarity) and its metric backbone.", "description": "This figure shows the number of edges in the original q-nearest neighbor graph and its metric backbone for different values of q on three datasets: MNIST, FashionMNIST, and HAR.  It illustrates how the metric backbone significantly reduces the number of edges compared to the original graph while preserving the community structure.", "section": "5 Application to Graph Construction Using q-NN"}]