[{"figure_path": "YVXzZNxcag/tables/tables_4_1.jpg", "caption": "Table 1: Hit@10 of the Original and Circuit Standalone performance of knowledge circuit in GPT2-Medium. The result for Dval being 1.0 indicates that we select the knowledge for which the model provides the correct answer to build the circuit.", "description": "This table presents the results of an experiment evaluating the performance of knowledge circuits in the GPT2-Medium language model.  The Hit@10 metric measures how often the correct answer is within the top 10 predictions.  The table compares the original model's performance to a model using only the identified knowledge circuit, and also shows the performance of a random circuit for comparison.  The Dval column indicates whether the model successfully predicted the correct answer when constructing the circuit (1.0 means it did).  Different types of knowledge (Linguistic, Commonsense, Factual, Bias) are evaluated and the number of edges in each circuit is also provided.", "section": "3.3 Knowledge Circuits Experimental Settings"}, {"figure_path": "YVXzZNxcag/tables/tables_9_1.jpg", "caption": "Table 2: Performance change via ablating the newly appeared attention heads in the ICL circuit and random heads.", "description": "This table shows the performance change (Hit@10) when ablating the newly appeared attention heads in the In-Context Learning (ICL) circuit and when ablating random attention heads.  The results are broken down by knowledge type (Linguistic, Commonsense, Bias, Factual) and specific knowledge sub-type (e.g., adj_comparative, word_sentiment).  It demonstrates the importance of the newly emerged attention heads in ICL by comparing their ablation impact to that of ablating random heads.  A significant drop in performance is observed when ablating the ICL attention heads, especially for certain knowledge types, indicating their crucial role in the ICL process.", "section": "Knowledge Circuits Elucidate Internal Mechanisms for Knowledge Editing"}, {"figure_path": "YVXzZNxcag/tables/tables_17_1.jpg", "caption": "Table 1: Hit@10 of the Original and Circuit Standalone performance of knowledge circuit in GPT2-Medium. The result for Dval being 1.0 indicates that we select the knowledge for which the model provides the correct answer to build the circuit.", "description": "This table presents the Hit@10 scores, comparing the original GPT2-Medium model's performance with that of its isolated knowledge circuits. The Hit@10 metric indicates the percentage of times the correct answer was among the top 10 predictions.  A score of 1.0 means the model always produced the correct answer within the top 10 predictions for the given knowledge.  The table shows performance on different knowledge types (Linguistic, Commonsense, Factual, Bias) across original and circuit-only setups, highlighting the knowledge circuit's ability to maintain performance despite its smaller size.", "section": "3.3 Knowledge Circuits Experimental Settings"}, {"figure_path": "YVXzZNxcag/tables/tables_19_1.jpg", "caption": "Table 1: Hit@10 of the Original and Circuit Standalone performance of knowledge circuit in GPT2-Medium. The result for Dval being 1.0 indicates that we select the knowledge for which the model provides the correct answer to build the circuit.", "description": "This table presents the performance of knowledge circuits in GPT-2-Medium model.  It compares the original model's performance (Original(G)) against the performance when only the identified knowledge circuit (Circuit(C)) is used.  It also includes a comparison with a random circuit of the same size to demonstrate the significance of the discovered circuits. The 'Hit@10' metric indicates the percentage of times the correct answer is among the top 10 predictions made by the model.  The table is categorized by knowledge type (Linguistic, Commonsense, Factual, Bias), and each knowledge type has several specific knowledge examples. Dval represents the validation set where circuits are constructed. Dtest is the test set, where the circuits are evaluated.", "section": "3.3 Knowledge Circuits Experimental Settings"}, {"figure_path": "YVXzZNxcag/tables/tables_20_1.jpg", "caption": "Table 5: Hit@10 for different hop", "description": "This table presents the Hit@10 scores for different hop reasoning scenarios. The Hit@10 metric measures the proportion of times the correct entity is ranked among the top 10 predictions. The table compares the performance of single-hop reasoning, two-hop reasoning, and integrated reasoning, which combines information from both single and two-hop scenarios. Each reasoning type's performance is evaluated for both nodes and edges in the model's circuit.", "section": "3.3 Knowledge Circuits Experimental Settings"}, {"figure_path": "YVXzZNxcag/tables/tables_22_1.jpg", "caption": "Table 1: Hit@10 of the Original and Circuit Standalone performance of knowledge circuit in GPT2-Medium. The result for Dval being 1.0 indicates that we select the knowledge for which the model provides the correct answer to build the circuit.", "description": "This table presents the performance of knowledge circuits in GPT-2-Medium.  It shows the Hit@10 score (the percentage of times the correct answer is within the top 10 predictions) for both the original model and a standalone circuit model.  The 'Dval' column indicates whether the original model correctly predicted the knowledge in the validation set. A score of 1.0 in this column signifies that only knowledge which the model originally got correct was used to create the circuit, and then the circuit's performance is tested on unseen data.  Different types of knowledge are included (linguistic, commonsense, factual, and bias) to evaluate the generalizability of the circuits.", "section": "Knowledge Circuits Evaluation"}]