[{"figure_path": "ypEamFKu2O/figures/figures_1_1.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths in various time series forecasting models, including RNN, CNN, TCN, WITRAN, TimesNet, MICN, Modern TCN, Full-Attention, PatchTST, iTransformer, PGN, and TPGN.  It visually compares the length of the information propagation paths, highlighting the advantages of PGN and TPGN in capturing long-term dependencies due to their significantly shorter paths. The figure shows how information flows through different layers and mechanisms in each model and also visually indicates the methods for capturing short-term and long-term information.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_4_1.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths in various time series forecasting models, including RNN, CNN, TCN, etc. The figure highlights the differences in information flow among these models, emphasizing the long propagation paths in RNN and the more efficient paths in other models such as PGN. The figure visually represents how information is processed and transferred across time steps in each model, allowing for a clear comparison of their computational complexity and efficiency.  The figure also showcases the proposed TPGN method, highlighting its unique two-branch approach for capturing both long-term and short-term information. In the figure, darker colors represent more information, demonstrating the information retention across different models. The figure provides a valuable visual aid for understanding the core differences and advantages of various time series models.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_7_1.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths for various time series forecasting models, including RNN, CNN, TCN, WITRAN, MICN, TimesNet, Modern TCN, Full-Attention, PatchTST, PDF, iTransformer, PGN (the proposed model), and TPGN (the proposed temporal framework). It highlights the differences in information flow and receptive fields, showcasing how PGN and TPGN aim to improve upon the limitations of traditional recurrent models by drastically reducing information propagation paths.  The figure visually demonstrates the impact of different architectures on how information from past time steps is integrated to produce predictions at the current time step.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_7_2.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths of various time series forecasting models, including RNN, CNN, TCN, WITRAN, MICN, TimesNet, Modern TCN, Full-Attention, PatchTST, PDF, iTransformer, PGN (the model proposed in this paper), and TPGN (the temporal modeling framework built upon PGN).  The visualization highlights the differences in how each model handles information flow through time steps, emphasizing the advantages of PGN and TPGN in terms of shorter paths for improved long-term dependency capture. The darker colors represent more information.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_8_1.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths in various time series forecasting models, highlighting the differences in their efficiency and ability to capture long-term dependencies.  Models shown include RNN, CNN, TCN, WITRAN, MICN, TimesNet, Modern TCN, Full-Attention, PatchTST, PDF, iTransformer, PGN, and TPGN. The figure uses visual representations of information propagation (darker colors indicating more information) to show that methods like PGN and TPGN, which have O(1) and O(√L) complexity, respectively, offer substantially shorter paths than others like RNN (O(L)) and improve efficiency.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_15_1.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths in various time series forecasting models, including RNN, CNN, TCN, WITRAN, MICN, TimesNet, Modern TCN, Full-Attention, PatchTST, PDF, iTransformer, PGN, and TPGN.  The visualization helps to understand the differences in how information flows through these models, and how the proposed Parallel Gated Network (PGN) and its temporal extension TPGN achieve significantly shorter propagation paths, leading to improved efficiency and long-range dependency capture.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_15_2.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths in various time series forecasting models, including RNN, CNN, TCN, WITRAN, MICN, TimesNet, Full-Attention, PatchTST, PDF, iTransformer, and PGN.  It visually compares the length of the information propagation path, showing how the parallel nature of PGN (and TPGN) leads to a significantly shorter path compared to recurrent models like RNN. The figure highlights the advantages of PGN in capturing long-term dependencies by reducing the information propagation path to O(1).  It also shows how TPGN combines the long-term information capturing of PGN with patch-based short-term information capture.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_16_1.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths of various time series forecasting models, including RNN, CNN, TCN, WITRAN, MICN, TimesNet, Modern TCN, Full-Attention, PatchTST, PDF, iTransformer, PGN, and TPGN.  It visually compares the length and complexity of information flow for each model.  Models like PGN and TPGN aim to minimize this path length to improve efficiency and long-term dependency capture, which are limitations of the other models shown.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_16_2.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths of various time series forecasting models, including RNN, CNN, TCN, WITRAN, MICN, TimesNet, Full-Attention, PatchTST, PDF, iTransformer, PGN (proposed model), and TPGN (proposed framework).  The visualization helps compare the efficiency and effectiveness of different models in capturing both short-term and long-term information within time series data. Models with shorter paths are generally considered to be more efficient. The figure highlights the advantages of PGN and TPGN by exhibiting significantly shorter information propagation paths.", "section": "Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_18_1.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths of various time series forecasting models, including RNN, CNN, TCN, WITRAN, MICN, TimesNet, Modern TCN, Full-Attention, PatchTST, PDF, iTransformer, PGN, and TPGN.  It visually compares the length and complexity of information flow in each model, highlighting the advantages of PGN and TPGN in capturing long-term dependencies and efficiently processing information.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_18_2.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths in various time series forecasting models, including RNN, CNN, TCN, WITRAN, MICN, TimesNet, Modern TCN, Full-Attention, PatchTST, PDF, iTransformer, PGN, and TPGN.  The models are compared in terms of the length and complexity of their information propagation paths, highlighting the advantages of PGN and TPGN, which have significantly shorter paths due to their parallel processing architecture. The color intensity of the representations indicates the amount of information preserved during propagation.", "section": "Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_18_3.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths in various time series forecasting models, including RNN, CNN, TCN, WITRAN, MICN, TimesNet, Modern TCN, Full-Attention, PatchTST, PDF, iTransformer, PGN, and TPGN. The illustration highlights the differences in how each model captures information and propagates it through time. It demonstrates the advantages of PGN and TPGN in capturing long-term dependencies with significantly shorter information propagation paths.  The figure visually demonstrates how the proposed PGN and TPGN models significantly reduce the maximum information propagation path, addressing limitations of other models.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_19_1.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths in various time series forecasting models, including RNN, CNN, TCN, WITRAN, MICN, TimesNet, Modern TCN, Full-Attention, PatchTST, PDF, iTransformer, PGN, and TPGN.  It highlights the differences in how each model processes information across time steps, showing that models like PGN and TPGN have significantly shorter paths (O(1)) than RNN (O(L)), leading to potential improvements in capturing long-range dependencies.  The figure uses visual representations to show the flow of information and the receptive field for each model. This is crucial for understanding how each model addresses the challenges of long-range time series forecasting.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_19_2.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths of various time series forecasting models.  It visually compares models such as RNN, CNN, TCN, WITRAN, MICN, TimesNet, modern TCN, full-attention, PatchTST, PDF, and iTransformer, highlighting their respective strengths and weaknesses in capturing both short-term and long-term dependencies within time series data.  The key takeaway is the significant advantage of the proposed Parallel Gated Network (PGN) model which demonstrates a drastically reduced information propagation path (O(1)) compared to RNN-based models (O(L)).  The figure also provides context for the Temporal Parallel Gated Network (TPGN) model, showing how it leverages PGN’s efficiency and combines it with a patch-based approach to comprehensively capture both short and long-term information within time series.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_19_3.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths in various time series forecasting models, including RNN, CNN, TCN, WITRAN, MICN, TimesNet, Modern TCN, Full-Attention, PatchTST, PDF, iTransformer, PGN (the model proposed in this paper), and TPGN (a temporal modeling framework based on PGN). It highlights the differences in the length of information propagation paths and the level of parallelization, emphasizing PGN’s O(1) path length and high efficiency compared to others.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_20_1.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths in various time series forecasting models, including RNN, CNN, TCN, WITRAN, MICN, TimesNet, Modern TCN, Full-Attention, PatchTST, PDF, iTransformer, PGN, and TPGN. It visually compares the length of the information propagation paths, highlighting the efficiency of PGN and TPGN in capturing long-term dependencies.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_20_2.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure compares the information propagation paths of various time series forecasting models. It illustrates how different models, including RNNs, CNNs, TCNs, Transformers, and the proposed PGN, handle information flow across time steps.  The key difference highlighted is the path length for information propagation, with PGN showcasing a significantly shorter path (O(1)) compared to RNNs (O(L)).  The visualization helps to understand the efficiency and effectiveness of each model in capturing long-term dependencies.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_20_3.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths in different time series forecasting models, including RNN, CNN, TCN, WITRAN, MICN, TimesNet, Modern TCN, Full-Attention, PatchTST, PDF, iTransformer, PGN, and TPGN.  The diagrams show how information flows through the models and highlight the differences in receptive fields and maximum information propagation paths.  The main difference is in the information flow path length.  RNN is O(L), CNN is O(L), TCN is O(L), WITRAN is O(L), MICN is O(L), TimesNet is O(√L), Modern TCN is O(L), Full-Attention is O(L²), PatchTST is O((L/S)²), PDF is O(√L), iTransformer is O(√L), PGN is O(1), and TPGN is O(√L).", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_21_1.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths in various time series forecasting models. It visually compares RNN, CNN, TCN, WITRAN, MICN, TimesNet, Full-Attention, PatchTST, PDF, iTransformer, PGN (the model proposed in this paper), and TPGN (the framework proposed in this paper). It highlights that PGN and TPGN have significantly shorter information propagation paths than other models, leading to their effectiveness in long-range time series forecasting.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_21_2.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths in various time series forecasting models, highlighting the differences in complexity and efficiency.  Models shown include RNN, CNN, TCN, WITRAN, MICN, TimesNet, Modern TCN, Full-Attention, PatchTST, PDF, iTransformer, PGN (the authors' proposed model), and TPGN (the authors' temporal modeling framework). The figure visually compares the maximum path length for information propagation, contrasting the long paths in RNN with the shorter, often O(1) paths in the other models. This directly demonstrates the advantage of PGN and its impact on TPGN's efficiency.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_21_3.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths of various time series forecasting models, including RNN, CNN, TCN, WITRAN, MICN, TimesNet, Modern TCN, Full-Attention, PatchTST, PDF, iTransformer, PGN, and TPGN.  It highlights the differences in how these models capture short-term and long-term information, and showcases the advantages of the proposed PGN and TPGN models in terms of shorter information propagation paths (O(1) for PGN and O(√L) for TPGN).  The darker colors in the representations indicate a higher concentration of information.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_22_1.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths in various time series forecasting models, highlighting the differences in their computational efficiency and ability to capture long-term dependencies.  Models shown include RNN, CNN, TCN, WITRAN, MICN, TimesNet, Modern TCN, Full-Attention, PatchTST, PDF, iTransformer and the authors' proposed PGN and TPGN.  The figure visually compares the maximum temporal information propagation path length and the complexity of each method's architecture. This allows the reader to understand how PGN and TPGN aim to improve upon previous models by shortening the information propagation path and enabling parallel computation for faster execution.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_22_2.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths in various time series forecasting models, including RNN, CNN, TCN, WITRAN, MICN, TimesNet, Modern TCN, Full-Attention, PatchTST, PDF, iTransformer, PGN, and TPGN.  It visually compares the length and complexity of information flow across different model architectures, highlighting the advantages of the proposed PGN and TPGN models in capturing long-term dependencies with shorter paths.", "section": "1 Introduction"}, {"figure_path": "ypEamFKu2O/figures/figures_22_3.jpg", "caption": "Figure 1: The information propagation illustration of different models.", "description": "This figure illustrates the information propagation paths in various time series forecasting models, including RNN, CNN, TCN, WITRAN, MICN, TimesNet, ModernTCN, Full-Attention, PatchTST, PDF, iTransformer, PGN (the authors' proposed model), and TPGN (the authors' proposed framework).  The visualization highlights the maximum length of information propagation paths in each model, showcasing the efficiency and effectiveness of PGN and TPGN in capturing long-term dependencies. PGN, in particular, achieves a constant-time (O(1)) information propagation path, drastically reducing the long pathways present in other recurrent models, such as RNN.", "section": "1 Introduction"}]