[{"figure_path": "ypEamFKu2O/tables/tables_6_1.jpg", "caption": "Table 1: Long-range forecasting results. A lower MSE or MAE indicates a better prediction. The best results are highlighted in bold and the second best results are underlined.", "description": "This table presents the results of long-range time series forecasting experiments.  It compares the performance of the proposed TPGN model against eleven other state-of-the-art methods across five benchmark datasets (Electricity, Traffic, ETTh1, ETTh2, and Weather).  The results are organized by dataset, forecasting task (input length-output length), and metric (MSE and MAE).  Lower values for MSE and MAE indicate better forecasting accuracy. The best-performing model for each task is highlighted in bold, and the second-best is underlined.", "section": "4.1 Experimental Results"}, {"figure_path": "ypEamFKu2O/tables/tables_13_1.jpg", "caption": "Table 3: Comparison of strengths, complexities and the maximum information propagation paths of different models. G is superlinearly related to the sequence length L and S represents the stride.", "description": "This table compares several time series forecasting models across various characteristics.  It shows whether each model directly captures periodic semantic information, uses non-point-wise semantic information capturing, the maximum temporal information propagation path length, the computational complexity of the encoder per model layer, and whether the model enables parallel computation in the temporal dimension. The table highlights the advantages of the proposed PGN and TPGN models.", "section": "3.3 Complexity Analysis"}, {"figure_path": "ypEamFKu2O/tables/tables_14_1.jpg", "caption": "Table 1: Long-range forecasting results. A lower MSE or MAE indicates a better prediction. The best results are highlighted in bold and the second best results are underlined.", "description": "This table presents the results of long-range time series forecasting experiments on five benchmark datasets. It compares the performance of the proposed TPGN model against eleven other state-of-the-art methods across four different forecasting tasks (168-168, 168-336, 168-720, 168-1440), each varying in input length (168) and prediction length (168, 336, 720, 1440). The metrics used for evaluation are Mean Squared Error (MSE) and Mean Absolute Error (MAE). The best-performing model for each task is highlighted in bold, and the second-best is underlined.", "section": "4 Experiments"}, {"figure_path": "ypEamFKu2O/tables/tables_17_1.jpg", "caption": "Table 1: Long-range forecasting results. A lower MSE or MAE indicates a better prediction. The best results are highlighted in bold and the second best results are underlined.", "description": "This table presents the results of long-range time series forecasting experiments conducted on five benchmark datasets (ECL, Traffic, ETTh1, ETTh2, and Weather) using the proposed TPGN model and eleven other state-of-the-art methods.  Each row represents a specific forecasting task, identified by dataset and the lengths of input and output sequences (e.g., 168-168 indicates an input sequence of length 168 and an output sequence of length 168).  The columns show the Mean Squared Error (MSE) and Mean Absolute Error (MAE) for each model on each task.  Lower MSE and MAE values indicate better forecasting accuracy. The best-performing model for each task is highlighted in bold, and the second-best model is underlined, showcasing TPGN's superior performance.", "section": "4.1 Experimental Results"}, {"figure_path": "ypEamFKu2O/tables/tables_17_2.jpg", "caption": "Table 1: Long-range forecasting results. A lower MSE or MAE indicates a better prediction. The best results are highlighted in bold and the second best results are underlined.", "description": "This table presents the results of long-range time series forecasting experiments conducted on five benchmark datasets (ECL, Traffic, ETTh1, ETTh2, and Weather) using the proposed TPGN model and eleven baseline methods (WITRAN, SegRNN, ModernTCN, TimesNet, MICN, FITS, TimeMixer, DLinear, iTransformer, Basisformer, PatchTST, and FiLM).  For each dataset, four forecasting tasks (168-168, 168-336, 168-720, and 168-1440, representing input lengths and forecasting lengths) are performed. The table shows the Mean Squared Error (MSE) and Mean Absolute Error (MAE) for each method across all tasks.  The best-performing method for each task is highlighted in bold, while the second-best is underlined. This allows for a direct comparison of TPGN's performance against state-of-the-art methods.", "section": "4.1 Experimental Results"}]