[{"figure_path": "SYjxhKcXoN/tables/tables_5_1.jpg", "caption": "Table 1: Evaluations in DomainBed with default settings (3 random seeds each with 20 trials). Top5 and score count how often a method achieves the top 5 performance and outperforms ERM. Results with † are from the ResNet50 backbone and others are with ResNet18. Best and second bests results are highlighted. Results with SWAD are cited from [8], and all others are reevaluated in our device.", "description": "This table presents the results of domain generalization experiments on the DomainBed benchmark using ResNet18 and ResNet50 backbones.  It compares various domain generalization methods (MMD, IRM, DANN, etc.) against the Empirical Risk Minimization (ERM) baseline.  The table shows the average accuracy across five datasets (PACS, VLCS, OfficeHome, TerraIncognita, DomainNet) for each method, along with the number of times each method achieved a top-5 performance and outperformed ERM.  Results using SWAD (Stochastic Weight Averaging) are also included for comparison.", "section": "5.1 Generalization in Image classification"}, {"figure_path": "SYjxhKcXoN/tables/tables_6_1.jpg", "caption": "Table 2: Evaluations on the semantic segmentation task. Results with † are directly cited from [19], others are reevaluated in our device. Best results are colored as red.", "description": "This table presents the results of semantic segmentation experiments.  It compares the performance of different methods (Baseline, IBN-Net, RobustNet, PinMem, SD, and the proposed method, Ours) on three datasets: Cityscapes, BDD100K, and Mapillary.  The metrics used are mean Intersection over Union (mIoU) and mean accuracy (mAcc).  Results marked with † were taken directly from source [19], while others were re-evaluated on the authors' device.  The best results for each metric and dataset are highlighted in red.", "section": "5.2 Generalization in Semantic Segmentation"}, {"figure_path": "SYjxhKcXoN/tables/tables_7_1.jpg", "caption": "Table 1: Evaluations in DomainBed with default settings (3 random seeds each with 20 trials). Top5 and score count how often a method achieves the top 5 performance and outperforms ERM. Results with † are from the ResNet50 backbone and others are with ResNet18. Best and second bests results are highlighted. Results with SWAD are cited from [8], and all others are reevaluated in our device.", "description": "This table presents the results of domain generalization experiments conducted using the DomainBed benchmark.  It compares the performance of LFME against several state-of-the-art domain generalization methods across five different datasets (PACS, VLCS, OfficeHome, TerraIncognita, and DomainNet).  The table shows average accuracy, the number of times each method ranked among the top 5 performing methods, and whether it outperformed the Empirical Risk Minimization (ERM) baseline.  Different backbone networks (ResNet18 and ResNet50) were used for some methods.", "section": "5.1 Generalization in Image classification"}, {"figure_path": "SYjxhKcXoN/tables/tables_8_1.jpg", "caption": "Table 1: Evaluations in DomainBed with default settings (3 random seeds each with 20 trials). Top5 and score count how often a method achieves the top 5 performance and outperforms ERM. Results with † are from the ResNet50 backbone and others are with ResNet18. Best and second bests results are highlighted. Results with SWAD are cited from [8], and all others are reevaluated in our device.", "description": "This table presents the results of several domain generalization (DG) methods on the DomainBed benchmark.  The table compares the average accuracy of various methods across five different datasets (PACS, VLCS, OfficeHome, TerraIncognita, DomainNet), using ResNet18 and ResNet50 backbones.  The \"Top5\" and \"Score\" columns indicate how frequently a given method achieved a top-five ranking and outperformed the Empirical Risk Minimization (ERM) baseline, respectively.  Results using SWAD (Stochastic Weight Averaging) are referenced from prior work.", "section": "5.1 Generalization in Image classification"}, {"figure_path": "SYjxhKcXoN/tables/tables_9_1.jpg", "caption": "Table 1: Evaluations in DomainBed with default settings (3 random seeds each with 20 trials). Top5 and score count how often a method achieves the top 5 performance and outperforms ERM. Results with † are from the ResNet50 backbone and others are with ResNet18. Best and second bests results are highlighted. Results with SWAD are cited from [8], and all others are reevaluated in our device.", "description": "This table presents the results of the image classification task using the DomainBed benchmark with default settings. The results of several domain generalization methods are compared with the Empirical Risk Minimization (ERM) baseline.  The table shows the average accuracy (± standard deviation) across five datasets (PACS, VLCS, OfficeHome, TerraIncognita, and DomainNet) for each method using ResNet18 and ResNet50 backbones (indicated by †).  The \"Top5\" column indicates how many times a method achieved top-5 performance across the five datasets, and the \"Score\" column shows how many times each method outperformed the ERM baseline.", "section": "5.1 Generalization in Image classification"}, {"figure_path": "SYjxhKcXoN/tables/tables_9_2.jpg", "caption": "Table 1: Evaluations in DomainBed with default settings (3 random seeds each with 20 trials). Top5 and score count how often a method achieves the top 5 performance and outperforms ERM. Results with † are from the ResNet50 backbone and others are with ResNet18. Best and second bests results are highlighted. Results with SWAD are cited from [8], and all others are reevaluated in our device.", "description": "This table presents the results of domain generalization experiments conducted using the DomainBed benchmark.  It compares the performance of the proposed LFME method against various state-of-the-art domain generalization techniques across five different datasets (PACS, VLCS, OfficeHome, TerraIncognita, DomainNet).  The table includes metrics such as average accuracy across all datasets, how often each method ranks within the top 5, and how often it outperforms the standard Empirical Risk Minimization (ERM) baseline.  Different backbone networks (ResNet18 and ResNet50) are used, and some results incorporating the SWAD optimizer are also reported for comparison.", "section": "5.1 Generalization in Image classification"}, {"figure_path": "SYjxhKcXoN/tables/tables_16_1.jpg", "caption": "Table 1: Evaluations in DomainBed with default settings (3 random seeds each with 20 trials). Top5 and score count how often a method achieves the top 5 performance and outperforms ERM. Results with † are from the ResNet50 backbone and others are with ResNet18. Best and second bests results are highlighted. Results with SWAD are cited from [8], and all others are reevaluated in our device.", "description": "This table presents the results of domain generalization experiments using the DomainBed benchmark.  It compares the performance of LFME against various other domain generalization methods on four datasets (PACS, VLCS, OfficeHome, and TerraIncog). The table shows average accuracy, how often a method ranks among the top 5, and how often it outperforms the Empirical Risk Minimization (ERM) baseline.  Results are shown for both ResNet18 and ResNet50 backbones, and some results using the SWAD optimizer are included for comparison.", "section": "5.1 Generalization in Image classification"}, {"figure_path": "SYjxhKcXoN/tables/tables_19_1.jpg", "caption": "Table 1: Evaluations in DomainBed with default settings (3 random seeds each with 20 trials). Top5 and score count how often a method achieves the top 5 performance and outperforms ERM. Results with † are from the ResNet50 backbone and others are with ResNet18. Best and second bests results are highlighted. Results with SWAD are cited from [8], and all others are reevaluated in our device.", "description": "This table presents the results of domain generalization experiments conducted using the DomainBed benchmark.  It compares the performance of various domain generalization methods against the baseline Empirical Risk Minimization (ERM) method across five different datasets (PACS, VLCS, OfficeHome, TerraIncognita, and DomainNet). The table shows the average accuracy and indicates how frequently each method achieved top-5 performance and outperformed ERM.  ResNet18 and ResNet50 backbones were used in some experiments, and the results using SWAD (a specific optimization technique) are also included.", "section": "5.1 Generalization in Image classification"}, {"figure_path": "SYjxhKcXoN/tables/tables_19_2.jpg", "caption": "Table 1: Evaluations in DomainBed with default settings (3 random seeds each with 20 trials). Top5 and score count how often a method achieves the top 5 performance and outperforms ERM. Results with † are from the ResNet50 backbone and others are with ResNet18. Best and second bests results are highlighted. Results with SWAD are cited from [8], and all others are reevaluated in our device.", "description": "This table presents the results of domain generalization experiments on the DomainBed benchmark using different methods.  The table shows the average accuracy of each method across five datasets (PACS, VLCS, OfficeHome, TerraIncognita, and DomainNet) with three random seeds and 20 trials each.  The \"Top5\" column indicates how many times a method achieved top-5 accuracy, and \"Score↑\" counts the instances where a method outperformed the Empirical Risk Minimization (ERM) baseline. Results are separated for ResNet18 and ResNet50 backbones, with the latter indicated by †.  SWAD results are cited from a reference paper, while other results were reevaluated on the author's device.", "section": "5.1 Generalization in Image classification"}, {"figure_path": "SYjxhKcXoN/tables/tables_20_1.jpg", "caption": "Table 1: Evaluations in DomainBed with default settings (3 random seeds each with 20 trials). Top5 and score count how often a method achieves the top 5 performance and outperforms ERM. Results with † are from the ResNet50 backbone and others are with ResNet18. Best and second bests results are highlighted. Results with SWAD are cited from [8], and all others are reevaluated in our device.", "description": "This table presents the results of domain generalization experiments on the DomainBed benchmark using ResNet18 and ResNet50 backbones.  It compares the performance of the proposed LFME method against several other state-of-the-art domain generalization methods across five different datasets (PACS, VLCS, OfficeHome, TerraIncognita, DomainNet).  The table shows the average accuracy, the frequency of achieving top 5 performance, and the frequency of outperforming the Empirical Risk Minimization (ERM) baseline. The use of different backbones (ResNet18 vs. ResNet50) and the inclusion of SWAD (Stochastic Weight Averaging) are noted.", "section": "5.1 Generalization in Image classification"}, {"figure_path": "SYjxhKcXoN/tables/tables_20_2.jpg", "caption": "Table 1: Evaluations in DomainBed with default settings (3 random seeds each with 20 trials). Top5 and score count how often a method achieves the top 5 performance and outperforms ERM. Results with † are from the ResNet50 backbone and others are with ResNet18. Best and second bests results are highlighted. Results with SWAD are cited from [8], and all others are reevaluated in our device.", "description": "This table presents the results of domain generalization experiments conducted using the DomainBed benchmark.  It compares the performance of various domain generalization methods against the Empirical Risk Minimization (ERM) baseline.  The table shows the average accuracy across multiple trials for each method on four different datasets (PACS, VLCS, OfficeHome, TerraInc). It also indicates how frequently each method achieved top 5 performance and outperformed ERM. The results are categorized based on whether they used ResNet18 or ResNet50 as their backbone model and whether they included the SWAD optimization technique.", "section": "5.1 Generalization in Image classification"}, {"figure_path": "SYjxhKcXoN/tables/tables_21_1.jpg", "caption": "Table 1: Evaluations in DomainBed with default settings (3 random seeds each with 20 trials). Top5 and score count how often a method achieves the top 5 performance and outperforms ERM. Results with † are from the ResNet50 backbone and others are with ResNet18. Best and second bests results are highlighted. Results with SWAD are cited from [8], and all others are reevaluated in our device.", "description": "This table presents the results of domain generalization experiments on the DomainBed benchmark using different methods, including the proposed LFME approach.  It compares the average performance across five datasets (PACS, VLCS, OfficeHome, TerraIncognita, DomainNet) using ResNet18 and ResNet50 backbones.  The \"Top5\" and \"Score\" columns indicate how often each method ranks among the top five performers and surpasses the Empirical Risk Minimization (ERM) baseline, respectively.  Results are averaged over three random seeds, each with twenty trials, providing a comprehensive comparison of various domain generalization techniques.", "section": "5.1 Generalization in Image classification"}, {"figure_path": "SYjxhKcXoN/tables/tables_21_2.jpg", "caption": "Table 1: Evaluations in DomainBed with default settings (3 random seeds each with 20 trials). Top5 and score count how often a method achieves the top 5 performance and outperforms ERM. Results with † are from the ResNet50 backbone and others are with ResNet18. Best and second bests results are highlighted. Results with SWAD are cited from [8], and all others are reevaluated in our device.", "description": "This table presents the results of several domain generalization (DG) methods on the DomainBed benchmark.  It compares the performance of various methods against the Empirical Risk Minimization (ERM) baseline across five datasets (PACS, VLCS, OfficeHome, TerraIncognita, and DomainNet). The table shows average accuracy, the frequency of achieving top-5 performance, and how often each method outperforms ERM. Results are presented for both ResNet18 and ResNet50 backbones, with the latter indicated by a † symbol.", "section": "5.1 Generalization in Image classification"}, {"figure_path": "SYjxhKcXoN/tables/tables_22_1.jpg", "caption": "Table 1: Evaluations in DomainBed with default settings (3 random seeds each with 20 trials). Top5 and score count how often a method achieves the top 5 performance and outperforms ERM. Results with † are from the ResNet50 backbone and others are with ResNet18. Best and second bests results are highlighted. Results with SWAD are cited from [8], and all others are reevaluated in our device.", "description": "This table presents the results of domain generalization experiments using different methods on the DomainBed benchmark.  The table shows the average accuracy (± standard deviation) of each method across five datasets (PACS, VLCS, OfficeHome, TerraIncognita, DomainNet), using both ResNet18 and ResNet50 backbones.  The \"Top5\" and \"Score\" columns indicate how frequently a method achieved a top-five performance and outperformed the Empirical Risk Minimization (ERM) baseline, respectively.  Results using the SWAP algorithm are taken from prior work [8], and the remaining results were reproduced by the authors.", "section": "5.1 Generalization in Image classification"}, {"figure_path": "SYjxhKcXoN/tables/tables_22_2.jpg", "caption": "Table 1: Evaluations in DomainBed with default settings (3 random seeds each with 20 trials). Top5 and score count how often a method achieves the top 5 performance and outperforms ERM. Results with † are from the ResNet50 backbone and others are with ResNet18. Best and second bests results are highlighted. Results with SWAD are cited from [8], and all others are reevaluated in our device.", "description": "This table presents the results of domain generalization experiments on the DomainBed benchmark using ResNet18 and ResNet50 backbones.  It compares the performance of LFME against various other domain generalization methods across five datasets (PACS, VLCS, OfficeHome, TerraIncognita, DomainNet). The table shows the average accuracy and indicates how often a method achieved top-5 performance and outperformed the Empirical Risk Minimization (ERM) baseline.  The use of ResNet50 (marked with †) allows for a comparison with different backbone architectures.", "section": "5.1 Generalization in Image classification"}]