[{"figure_path": "YrAxxscKM2/tables/tables_14_1.jpg", "caption": "Table 1: Comparison of our work with closely related works on regression and implicit regularization phenomenon induced by noise in the algorithm.", "description": "This table compares the author's work to other closely related works on regression and implicit regularization.  It highlights the differences in loss functions, algorithms, and the type of implicit regularization achieved.  The comparison helps to situate the author's contributions within the existing literature on the topic.", "section": "A An additional comparison with related works"}, {"figure_path": "YrAxxscKM2/tables/tables_23_1.jpg", "caption": "Table 2: Test Error for Snapshot Ensemble and EMA for different values of learning rate (LR) and weight decay (WD).", "description": "This table presents the test error for both snapshot ensembles and exponential moving averages (EMA) across various learning rates (LR) and weight decay (WD) values.  It allows for a comparison of the two methods' performance under different hyperparameter settings. The results are used to support the conjecture proposed in the paper regarding the implicit regularization mechanism.", "section": "C.7 Empirical verification of the conjecture through snapshot ensembles"}, {"figure_path": "YrAxxscKM2/tables/tables_23_2.jpg", "caption": "Table 3: Total Variation Distance between softmax outputs of Ensemble and EMA.", "description": "This table presents the Total Variation Distance (TVD) between the softmax outputs of the snapshot ensemble and the exponential moving average (EMA) for various combinations of learning rates (LR) and weight decay (WD) parameters.  The TVD quantifies the difference in probability distributions between the ensemble and EMA predictions. Lower TVD values indicate a stronger agreement between the two methods, thus supporting the claim that the EMA closely tracks the behavior of the ensemble and represents a good approximation of the stationary distribution during training.", "section": "C.7 Empirical verification of the conjecture through snapshot ensembles"}]