[{"figure_path": "6PMfJT2O7G/figures/figures_13_1.jpg", "caption": "Figure 1: An two-player extensive-form game and the corresponding TFSDP of player 1. The TFSDP has decision point J = {A, B, C, D}. It has tree size ||Q||1 = 4 and leaf count ||Q||₁ = 2, both given by the pure strategy {A → 1, B → 3, C → 5}. Furthermore, The player 1 has |V| = 7 pure strategy profiles in total.", "description": "This figure shows a two-player extensive-form game and the corresponding tree-form sequential decision process (TFSDP) for player 1. The extensive-form game is represented as a game tree with nodes representing game states and branches representing actions. The TFSDP for player 1 simplifies the game by focusing solely on player 1's decisions and information sets.  Key features of the figure highlight the decision points (J), tree size (||Q||1), leaf count (||Q||1), and the number of pure strategy profiles for player 1 (|V|).  The pure strategy shown, {A → 1, B → 3, C → 5}, results in a tree size of 4 and a leaf count of 2 in the TFSDP.", "section": "3 Preliminaries"}, {"figure_path": "6PMfJT2O7G/figures/figures_15_1.jpg", "caption": "Figure 1: An two-player extensive-form game and the corresponding TFSDP of player 1. The TFSDP has decision point J = {A, B, C, D}. It has tree size ||Q||1 = 4 and leaf count ||Q||₁ = 2, both given by the pure strategy {A → 1, B → 3, C → 5}. Furthermore, The player 1 has |V| = 7 pure strategy profiles in total.", "description": "This figure shows a simple two-player extensive-form game and the corresponding tree-form sequential decision process (TFSDP) for player 1.  The extensive-form game is represented as a game tree, illustrating the sequence of actions and decisions. The TFSDP simplifies the representation from player 1's perspective, focusing on their decision points (information sets), actions, and the resulting observation points.  The caption highlights key metrics derived from the TFSDP: tree size, leaf count, and the number of pure strategy profiles.  These metrics quantify aspects of the game's complexity.", "section": "3 Preliminaries"}, {"figure_path": "6PMfJT2O7G/figures/figures_28_1.jpg", "caption": "Figure 1: An two-player extensive-form game and the corresponding TFSDP of player 1. The TFSDP has decision point J = {A, B, C, D}. It has tree size ||Q||1 = 4 and leaf count ||Q||₁ = 2, both given by the pure strategy {A → 1, B → 3, C → 5}. Furthermore, The player 1 has |V| = 7 pure strategy profiles in total.", "description": "This figure shows a two-player extensive-form game and its corresponding tree-form sequential decision process (TFSDP) for Player 1.  The extensive-form game is represented as a game tree with nodes representing game states and edges representing actions. The TFSDP simplifies Player 1's perspective, highlighting their decision points (J), the actions they can take at each point, and the resulting terminal nodes. Key metrics illustrating the game's complexity are also given: the tree size (||Q||1), the leaf count (||Q||1), and the number of pure strategy profiles for Player 1 (|V|).", "section": "3 Preliminaries"}]