[{"figure_path": "8wvH0RZPsG/tables/tables_8_1.jpg", "caption": "Table 1: Summary of real-world datasets for conformalized multiple testing", "description": "This table summarizes the characteristics of four real-world datasets used in the paper's experiments to evaluate the proposed selective conformal p-value method.  For each dataset, it lists the number of features, the number of instances (data points), and whether the task is regression (Reg) or classification (Cla).  These datasets represent diverse scenarios and data sizes to test the robustness and generalizability of the method.", "section": "4 Numerical studies"}, {"figure_path": "8wvH0RZPsG/tables/tables_9_1.jpg", "caption": "Table 2: Empirical FDR (%) and Power (%) with target FDR α = 10%. The bracket contains the standard error (%). The highest power among methods controlling the FDR is bolded.", "description": "This table presents the empirical False Discovery Rate (FDR) and power of several methods for multiple testing after data-dependent selection.  The methods compared are SCPV (the proposed method), OMT (ordinary multiple testing), and AMT (adjusted multiple testing) using both Benjamini-Hochberg (BH) and Benjamini-Yekutieli (BY) procedures.  Results are shown for three different selection rules (Exchangeable, Quantile, and Mean) across four real-world datasets (Abalone, Census, Credit, and Promotion).  The FDR is the expected proportion of false positives among rejected hypotheses, while power represents the proportion of correctly identified true positives among all true positives. The standard error is provided in parentheses for each metric.", "section": "4 Numerical studies"}, {"figure_path": "8wvH0RZPsG/tables/tables_18_1.jpg", "caption": "Table 3: Comparisons of empirical FDR (%) and Power (%) with target FDR level α = 10% by 500 repetitions.", "description": "This table presents the empirical False Discovery Rate (FDR) and power for three different methods (SCA, SCPV, and AMT) under two different data-generating scenarios (Case A and Case B) and two different selection rules (Quantile and Mean).  The target FDR level is set at 10%, and the results are based on 500 repetitions. The table compares the performance of the proposed selective conformal p-value method (SCPV) against two benchmark methods: the self-consistent/compliant adjustment (SCA) method and a method using adjusted p-values (AMT). The results show the effectiveness of SCPV in controlling FDR while maintaining high power across different scenarios and selection rules.", "section": "4 Numerical studies"}, {"figure_path": "8wvH0RZPsG/tables/tables_19_1.jpg", "caption": "Table 4: Comparisons of empirical FDR (%) and Power (%) with target FDR level α = 10% by 500 repetitions.", "description": "This table compares the empirical FDR and power of InfoSCOP and SCPV methods under two different data-generating scenarios (Case A and Case B).  The results show that both methods achieve close to the target FDR level of 10%, while SCPV shows slightly lower power. This comparison highlights the performance of the proposed SCPV method against an existing method with a similar objective (selective inference), demonstrating the effectiveness of the SCPV approach in controlling FDR under different scenarios.", "section": "4 Numerical studies"}, {"figure_path": "8wvH0RZPsG/tables/tables_20_1.jpg", "caption": "Table 5: Comparisons of empirical FDR (%) and Power (%) under different scenarios and thresholds with target FDR α = 10% and noise strength σ = 0.5. The sample sizes of the labeled set and the test set are fixed as n = m = 1200.", "description": "This table presents the empirical False Discovery Rate (FDR) and power of five different multiple testing methods under various scenarios and selection rules. The scenarios involve different data-generating processes and noise levels.  The selection rules include exchangeable, quantile, and mean selection. The methods being compared are SCPV (the proposed method), OMT (ordinary multiple testing), AMT(BH) (adjusted multiple testing with Benjamini-Hochberg procedure), AMT(BY) (adjusted multiple testing with Benjamini-Yekutieli procedure), and SCOP (selection conditional conformal prediction).  The results show the FDR and power for each method under each condition.", "section": "4.1 Results on synthetic data"}, {"figure_path": "8wvH0RZPsG/tables/tables_21_1.jpg", "caption": "Table 6: Comparisons of empirical FDR (%) and Power (%) with target FDR level α = 20% by 500 repetitions.", "description": "This table presents the empirical False Discovery Rate (FDR) and power achieved by several multiple testing methods under different selection rules (Constant, Exch, Quan) in a diabetes prediction task using real-world data. The results show that the proposed SCPV method maintains FDR control while achieving higher power compared to other methods, especially in the Exch and Quan scenarios.", "section": "4 Numerical studies"}, {"figure_path": "8wvH0RZPsG/tables/tables_21_2.jpg", "caption": "Table 7: Comparisons of empirical FDR (%) and Power (%) with target FDR level α = 20% by 500 repetitions.", "description": "This table presents the results of empirical FDR and power for two groups obtained by K-means clustering, with a target FDR level of 20%. The results are based on 500 repetitions and compare the performance of SCPV, OMT, AMT(BH), and AMT(BY) methods. Group A and Group B represent two distinct clusters.  The results show the FDR and Power for each method within each group.", "section": "4 Numerical studies"}, {"figure_path": "8wvH0RZPsG/tables/tables_22_1.jpg", "caption": "Table 8: Comparisons of empirical FDR (%) and Power (%) with target FDR level α = 10% by 100 repetitions.", "description": "This table presents the empirical False Discovery Rate (FDR) and power of five different multiple testing methods across three selection rules (Constant, Exch, Quan) in a breast cancer detection scenario using deep learning.  The target FDR level is set at 10%, and 100 repetitions were performed for each configuration.  The methods compared include the proposed Selective Conformal P-value (SCPV) method along with Ordinary Multiple Testing (OMT), and two adjusted multiple testing methods (AMT(BH) and AMT(BY)). The results show that SCPV effectively controls the FDR while maintaining reasonable power, outperforming the other methods.", "section": "4 Numerical studies"}]