[{"figure_path": "yBHbeSpwYS/tables/tables_7_1.jpg", "caption": "Table 1: Performance comparison in the common setting on the COCO-Stuff and DeepFashion datasets.", "description": "This table presents the performance comparison of different multi-label image recognition methods on the COCO-Stuff and DeepFashion datasets. The performance is evaluated under two different settings: \"Exclusive\", where labels that co-occur in the training set do not co-occur in the test set; and \"Co-occur\", where labels co-occur in both the training and test sets.  The table shows the mean Average Precision (mAP) for COCO-Stuff and top-3 recall for DeepFashion.  The \"All\" column represents the average performance across all categories.", "section": "5.2 Comparing to the State-of-the-arts"}, {"figure_path": "yBHbeSpwYS/tables/tables_7_2.jpg", "caption": "Table 2: mAP Performance comparison in the cross-dataset setting on the MS-COCO and NUS-WIDE datasets.", "description": "This table presents the results of the cross-dataset experiments, where the training set is from one dataset (either MS-COCO or NUS-WIDE) and the testing set is from the other dataset.  The goal is to evaluate the model's robustness to domain shift and contextual bias present in the cross-dataset setting. The mAP (mean Average Precision) is reported for all common classes across both datasets.  Comparing the performance on MS-COCO to NUS-WIDE with the reverse setting demonstrates the generalizability of the model in diverse situations. The baseline is included for comparison to highlight the effectiveness of the proposed approach in handling cross-dataset scenarios.", "section": "5.2 Comparing to the State-of-the-arts"}, {"figure_path": "yBHbeSpwYS/tables/tables_8_1.jpg", "caption": "Table 3: The impacts of different modules.", "description": "This table presents the ablation study results on the COCO-Stuff dataset by progressively integrating two essential modules: decoupling the label feature module and causal intervention module. It shows the impact of each module on the performance metrics, including \"Exclusive\", \"Co-occur\", and \"All\", demonstrating the effectiveness of the proposed approach in improving multi-label image recognition accuracy.", "section": "5.3 Ablation Studies"}, {"figure_path": "yBHbeSpwYS/tables/tables_8_2.jpg", "caption": "Table 4: The impacts of clustering center number.", "description": "This table shows the performance of the proposed model with different numbers of clustering centers for confounders.  The results suggest that there is an optimal number of clusters that balances model performance and computational cost, with diminishing returns for larger cluster counts.", "section": "5.3.2 Investigation of Confounders"}, {"figure_path": "yBHbeSpwYS/tables/tables_8_3.jpg", "caption": "Table 5: The impact of backbones for clustering.", "description": "This table presents the results of ablation studies conducted to evaluate the impact of different backbones used for extracting features to model confounders in the causal intervention branch.  Three different backbones, ResNet-50, ResNet-101, and BEIT3-Large, are compared. The table shows the performance (Exclusive, Co-occur, and All mAP) achieved using each backbone for the generation of confounders.  The results indicate whether selecting a stronger backbone for generating confounders leads to significantly improved performance.", "section": "5.3 Ablation Studies"}, {"figure_path": "yBHbeSpwYS/tables/tables_8_4.jpg", "caption": "Table 6: The impact of different modeling approaches for confounders.", "description": "This table presents the results of an ablation study that investigates the impact of different methods for modeling confounders on the performance of the proposed multi-label image recognition model. The study compares four different approaches for modeling confounders: Random, Early, Label, and K-means. The results are reported in terms of mAP (mean Average Precision) for three different test distributions: Exclusive, Co-occur, and All.", "section": "5.3.2 Investigation of Confounders"}, {"figure_path": "yBHbeSpwYS/tables/tables_9_1.jpg", "caption": "Table 7: Different implementations of Eq. 7.", "description": "This table compares different implementations of equation 7 from the paper, which is about calculating the final prediction confidence by merging predictions from different branches. The table shows that using a linear approach gives comparable results but the proposed approach achieves better performance. This highlights that the proposed cross-attention method in the paper is effective in capturing the long-range dependencies and causal correlations.", "section": "5.3.3 Different Implementations of Eq. 7"}, {"figure_path": "yBHbeSpwYS/tables/tables_13_1.jpg", "caption": "Table 1: Performance comparison in the common setting on the COCO-Stuff and DeepFashion datasets.", "description": "This table compares the performance of different multi-label image recognition methods on the COCO-Stuff and DeepFashion datasets.  The \"common setting\" implies that training and testing data come from the same dataset. Results are shown for different test distributions ('Exclusive', 'Co-occur', 'All'), reflecting how well the models generalize to cases where label co-occurrences in training and testing sets differ.  The metrics used are mAP (mean Average Precision) for COCO-Stuff and top-3 recall for DeepFashion.  The table helps illustrate the effectiveness of the proposed approach compared to several state-of-the-art methods.", "section": "5.2 Comparing to the State-of-the-arts"}, {"figure_path": "yBHbeSpwYS/tables/tables_13_2.jpg", "caption": "Table 9: The impacts of different backbones on COCO-Stuff.", "description": "This table shows the performance of the proposed multi-label image recognition method using different backbones (ResNet-50, ResNet-101, and BEIT3-Large) on the COCO-Stuff dataset.  The results are broken down by the test set distribution ('Exclusive', 'Co-occur', and 'All') to show the effectiveness under different scenarios.  The 'Ours' column indicates the performance of the proposed method, which incorporates causal intervention, while the other columns provide baseline ResNet results for comparison.", "section": "5.3 Ablation Studies"}]