[{"figure_path": "Tw9nfNyOMy/tables/tables_6_1.jpg", "caption": "Table 2: Comparison of prediction fidelity on nuScenes validation set. Vista achieves encouraging results that outperform the state-of-the-art driving world models with a significant performance gain.", "description": "This table compares the prediction fidelity of Vista against other state-of-the-art driving world models on the nuScenes validation set.  The metrics used are the Fréchet Inception Distance (FID) and the Fréchet Video Distance (FVD). Lower scores indicate better fidelity. Vista significantly outperforms all other models in both FID and FVD, demonstrating its superior prediction accuracy.", "section": "4.1 Comparisons of Generalization and Fidelity"}, {"figure_path": "Tw9nfNyOMy/tables/tables_9_1.jpg", "caption": "Table 3: Impacts of different action conditions and dynamic priors. By applying action conditions and dynamic priors, Vista can predict motion that is more consistent compared to the ground truth.", "description": "This table presents a quantitative comparison of the impact of different action conditions and dynamic priors on the accuracy of Vista's motion prediction.  The \"Average Trajectory Difference\" metric measures the difference between Vista's predicted trajectory and the ground truth trajectory. Lower values indicate better accuracy. The table shows that incorporating action conditions and dynamic priors significantly improves prediction accuracy across both the nuScenes and Waymo datasets.", "section": "4.4 Ablation Study"}, {"figure_path": "Tw9nfNyOMy/tables/tables_22_1.jpg", "caption": "Table 2: Comparison of prediction fidelity on nuScenes validation set. Vista achieves encouraging results that outperform the state-of-the-art driving world models with a significant performance gain.", "description": "This table presents a quantitative comparison of the prediction fidelity of Vista against other state-of-the-art driving world models on the nuScenes validation set.  Two metrics are used for comparison: the Fréchet Inception Distance (FID) and the Fréchet Video Distance (FVD). Lower scores indicate better performance. The table shows that Vista significantly outperforms all other models in both FID and FVD, demonstrating its superior prediction accuracy and high-fidelity video generation capabilities.", "section": "4.1 Comparisons of Generalization and Fidelity"}, {"figure_path": "Tw9nfNyOMy/tables/tables_22_2.jpg", "caption": "Table 3: Impacts of different action conditions and dynamic priors. By applying action conditions and dynamic priors, Vista can predict motion that is more consistent compared to the ground truth.", "description": "This table presents a quantitative comparison of Vista's motion prediction accuracy under various conditions.  It shows the average trajectory difference between Vista's predictions and ground truth trajectories. The \"Trajectory Difference\" metric quantifies the consistency of the predicted motion with the ground truth.  Different rows represent various action control modes used (action-free, with goal point, with command, with angle and speed, with trajectory) and the number of dynamic priors incorporated in the prediction (1 prior, 2 priors, 3 priors). Lower values in the table indicate better alignment between predicted and ground truth trajectories, suggesting improved motion prediction accuracy by using action conditions and dynamic priors.", "section": "4.4 Ablation Study"}, {"figure_path": "Tw9nfNyOMy/tables/tables_24_1.jpg", "caption": "Table 2: Comparison of prediction fidelity on nuScenes validation set. Vista achieves encouraging results that outperform the state-of-the-art driving world models with a significant performance gain.", "description": "This table presents a quantitative comparison of the prediction fidelity of Vista and other state-of-the-art driving world models on the nuScenes validation set.  The comparison uses two metrics: Fréchet Inception Distance (FID) and Fréchet Video Distance (FVD). Lower scores indicate better prediction fidelity. Vista significantly outperforms all other models in both FID and FVD, demonstrating its superior performance in generating high-fidelity predictions of driving scenarios.", "section": "4.1 Comparisons of Generalization and Fidelity"}]