[{"figure_path": "7PORYhql4V/tables/tables_16_1.jpg", "caption": "Table 1: The average Wasserstein distance E<sub>f(1),f(2)∈F(k)</sub>WD(S(f(1)),S(f(2)) ) with the standard deivation for all model families {CS,CL,RS,RL}×{10,20,40,80,160} over CIFAR-10/100 and TinyImagenet datasets. Note that here the baseline should be 2 since the cosine similarity lies in [-1,1]. It is observed that deeper models usually have larger distances (CS vs. CL, RS vs. RL). We deduce that this is because of the training for deeper models is more difficult.", "description": "This table presents the average Wasserstein distances between the salience distributions of different models within the same family, showing how the distance changes with model capacity (k) and architecture.  The baseline distance is 2, reflecting the range of cosine similarity values.  The table shows that deeper models (CL vs CS, RL vs RS) tend to have greater distances between their salience distributions, possibly due to increased training difficulty.", "section": "3.2 The Decreasing Spherical Variance with k (H1)"}, {"figure_path": "7PORYhql4V/tables/tables_18_1.jpg", "caption": "Table 1: The average Wasserstein distance E<sub>f(1),f(2)∈F(k)</sub>WD(S(f(1)),S(f(2))) with the standard deivation for all model families {CS,CL,RS,RL} × {10,20,40,80,160} over CIFAR-10/100 and TinyImagenet datasets. Note that here the baseline should be 2 since the cosine similarity lies in [-1,1]. It is observed that deeper models usually have larger distances (CS vs. CL, RS vs. RL). We deduce that this is because of the training for deeper models is more difficult.", "description": "This table presents the average Wasserstein distances between the individual similarity distributions of pairs of models within the same family.  The Wasserstein distance measures the dissimilarity between the distributions of cosine similarities across the testing set for each model.  The table shows these distances for different model families (CNNSmall, CNNLarge, ResNetSmall, ResNetLarge) and varying model capacities (k).  Larger distances suggest greater dissimilarity between the models' salience. The results highlight that deeper models (e.g., ResNet) exhibit larger dissimilarities compared to shallower models (e.g., CNN). This observation is attributed to the increased difficulty in training deeper models.", "section": "3.2 The Decreasing Spherical Variance with k (H1)"}, {"figure_path": "7PORYhql4V/tables/tables_19_1.jpg", "caption": "Table 1: The average Wasserstein distance Ef(1),f(2)∈F(k)WD(S(f(1)),S(f(2))) with the standard deivation for all model families {CS,CL,RS,RL}×{10,20,40,80,160} over CIFAR-10/100 and TinyImagenet datasets. Note that here the baseline should be 2 since the cosine similarity lies in [−1,1]. It is observed that deeper models usually have larger distances (CS vs. CL, RS vs. RL). We deduce that this is because of the training for deeper models is more difficult.", "description": "This table shows the average Wasserstein distance between the salience similarity distributions of different models within the same family, with varying model capacities.  The standard deviation is also provided.  It highlights that deeper models tend to have larger distances, potentially due to the increased difficulty in training deeper networks.", "section": "3.2 The Decreasing Spherical Variance with k (H1)"}]