[{"figure_path": "R7w68Z5iqf/tables/tables_6_1.jpg", "caption": "Table 1: Quantitative comparison for hybrid-degradation restoration tasks. The best and the second best results are in red and blue.", "description": "This table presents a quantitative comparison of different methods for image restoration on hybrid degradation tasks.  The tasks involve restoring images degraded by a combination of low resolution and either noise or JPEG compression. The table shows the PSNR and SSIM metrics for various methods on different benchmark datasets (Set5, Set14, BSDS100, Urban100, Manga109), along with the number of trainable parameters used by each method. The best and second-best results for each metric and dataset are highlighted in red and blue, respectively. This allows for a direct comparison of the performance and efficiency of each approach.", "section": "4.2 Comparison on Hybrid Degradation Tasks"}, {"figure_path": "R7w68Z5iqf/tables/tables_7_1.jpg", "caption": "Table 2: Comparison with all-in-one image restoration methods under single-task setting. The 'training time' of AdaptIR refers to the downstream fine-tuning time excluding the pre-training stage.", "description": "This table compares the performance of AdaptIR against two other all-in-one image restoration methods (AirNet and PromptIR) on single image restoration tasks.  It shows the number of parameters, training time, GPU memory usage, PSNR, and SSIM for each method on light deraining and denoising tasks using different datasets. The training time for AdaptIR only reflects the time spent fine-tuning the pre-trained model for each task, excluding the initial pre-training phase.", "section": "4.3 Comparison with All-in-One Methods"}, {"figure_path": "R7w68Z5iqf/tables/tables_7_2.jpg", "caption": "Table 3: Comparison with all-in-one image restoration methods under multi-task setting.", "description": "This table compares the proposed AdaptIR method with two other all-in-one image restoration methods (AirNet and PromptIR) across multiple image restoration tasks.  It shows the number of parameters, GPU memory usage, training time, and performance metrics (PSNR/SSIM) for light deraining, denoising (σ=25), and denoising (σ=30) tasks.  The results highlight AdaptIR's efficiency in achieving superior or comparable performance with significantly fewer parameters and training time compared to the other all-in-one methods.", "section": "4.3 Comparison with All-in-One Methods"}, {"figure_path": "R7w68Z5iqf/tables/tables_8_1.jpg", "caption": "Table 1: Quantitative comparison for hybrid-degradation restoration tasks. The best and the second best results are in red and blue.", "description": "This table presents a quantitative comparison of different parameter-efficient transfer learning (PETL) methods and a fully fine-tuned model on hybrid degradation restoration tasks.  The tasks involve restoring images degraded by a combination of low-resolution and either Gaussian noise or JPEG compression artifacts.  The table shows the PSNR and SSIM scores for each method on five different benchmark datasets (Set5, Set14, BSDS100, Urban100, and Manga109). The number of trainable parameters (#param) for each method is also provided.  The best and second-best results for each dataset are highlighted in red and blue, respectively, to help visualize the performance differences between methods.  This data helps assess the effectiveness and efficiency of different PETL approaches in handling complex, multiple-degradation scenarios.", "section": "4.2 Comparison on Hybrid Degradation Tasks"}, {"figure_path": "R7w68Z5iqf/tables/tables_8_2.jpg", "caption": "Table 5: Ablation of different design choices on PSNR(dB). 'Baseline' refers to the setting of depth-separable projection in LIM and FAM, as well as the channel-spatial orthogonal modeling.", "description": "This table presents the ablation study results on the impact of different design choices in AdaptIR on PSNR(dB).  The baseline setting uses depth-separable projection in LIM and FAM, along with channel-spatial orthogonal modeling. The table compares the baseline against several variations, including removing the adaptive feature ensemble, removing depth-separable operations in LIM or FAM, and removing both the CGM and depth-separable operations. The results highlight the contribution of each component to the overall performance.", "section": "4.5 Ablation Study"}, {"figure_path": "R7w68Z5iqf/tables/tables_8_3.jpg", "caption": "Table 6: Ablation experiments of different components on PSNR(dB).", "description": "This table presents the ablation study results on the performance of AdaptIR with different components (LIM, FAM, and CGM). The results show that using all three components leads to the best performance on PSNR across different datasets (Set5, Set14, and Urban100). Removing any single component or combination of components significantly reduces the performance, indicating their importance for achieving the best results.", "section": "4.5 Ablation Study"}, {"figure_path": "R7w68Z5iqf/tables/tables_8_4.jpg", "caption": "Table 7: Ablation for different insertion positions and forms on PSNR(dB).", "description": "This table presents the ablation study on different insertion positions (MLP or Attention) and forms (parallel or sequential) of the AdaptIR module.  The results, measured in PSNR(dB), show the impact of these design choices on performance across three benchmark datasets (Set5, Set14, and Urban100). The goal is to determine the optimal location and method for integrating the AdaptIR module for the best performance gains.", "section": "4.5 Ablation Study"}, {"figure_path": "R7w68Z5iqf/tables/tables_13_1.jpg", "caption": "Table 8: Comparison with prompt-based restoration methods.", "description": "This table compares AdaptIR with other prompt-based methods on denoising and deraining tasks.  It shows that AdaptIR achieves comparable or better performance with significantly lower adaptation costs and faster adaptation time.  The table highlights AdaptIR's efficiency and effectiveness compared to other prompt-based approaches.", "section": "4.3 Comparison with All-in-One Methods"}, {"figure_path": "R7w68Z5iqf/tables/tables_14_1.jpg", "caption": "Table 1: Quantitative comparison for hybrid-degradation restoration tasks. The best and the second best results are in red and blue.", "description": "This table presents a quantitative comparison of different parameter-efficient transfer learning (PETL) methods and a fully fine-tuned model for image restoration on hybrid degradation tasks.  The hybrid degradation tasks involve combining low-resolution with either additive Gaussian noise or JPEG compression artifacts.  The table shows the PSNR and SSIM scores achieved by each method on five standard image restoration datasets (Set5, Set14, BSDS100, Urban100, Manga109).  The best and second-best performing methods for each dataset are highlighted in red and blue, respectively.  The number of trainable parameters (#param) for each method is also included, demonstrating the parameter efficiency of the PETL approaches compared to the fully fine-tuned model.", "section": "4.2 Comparison on Hybrid Degradation Tasks"}, {"figure_path": "R7w68Z5iqf/tables/tables_14_2.jpg", "caption": "Table 1: Quantitative comparison for hybrid-degradation restoration tasks. The best and the second best results are in red and blue.", "description": "This table presents a quantitative comparison of different methods for image restoration on hybrid degradation tasks.  It shows the Peak Signal-to-Noise Ratio (PSNR) and Structural Similarity Index (SSIM) metrics for various methods, including the proposed AdaptIR, on two types of hybrid degradation: low-resolution images with added noise (LR4&Noise30) and low-resolution images with JPEG compression artifacts (LR4&JPEG30).  The results are shown for different datasets (Set5, Set14, BSDS100, Urban100, Manga109) and the number of trainable parameters (#param) used by each method is included. The best and second-best performing methods are highlighted in red and blue respectively, indicating AdaptIR's superior performance.", "section": "4.2 Comparison on Hybrid Degradation Tasks"}, {"figure_path": "R7w68Z5iqf/tables/tables_14_3.jpg", "caption": "Table 1: Quantitative comparison for hybrid-degradation restoration tasks. The best and the second best results are in red and blue.", "description": "This table presents a quantitative comparison of different parameter-efficient transfer learning (PETL) methods and a fully fine-tuned model on two hybrid image degradation tasks: LR4&Noise30 (low-resolution x4 and noise with σ=30) and LR4&JPEG30 (low-resolution x4 and JPEG compression with quality factor q=30).  The metrics used for evaluation are PSNR and SSIM on standard image restoration datasets (Set5, Set14, BSDS100, Urban100, and Manga109). The table highlights the best and second-best performing methods for each dataset and degradation type, indicating the superiority of the proposed AdaptIR method in terms of both PSNR and SSIM, especially when dealing with limited parameters.", "section": "4.2 Comparison on Hybrid Degradation Tasks"}, {"figure_path": "R7w68Z5iqf/tables/tables_14_4.jpg", "caption": "Table 1: Quantitative comparison for hybrid-degradation restoration tasks. The best and the second best results are in red and blue.", "description": "This table presents a quantitative comparison of different parameter-efficient transfer learning (PETL) methods and a fully fine-tuned model on two hybrid degradation tasks: LR4&Noise30 (low-resolution x4 and noise with σ=30) and LR4&JPEG30 (low-resolution x4 and JPEG compression with quality factor q=30).  The metrics used for evaluation are PSNR and SSIM on five standard datasets (Set5, Set14, BSDS100, Urban100, Manga109).  The table highlights the best and second-best performing methods for each dataset and degradation type, indicating the superior performance of the proposed AdaptIR method in handling hybrid degradation.", "section": "4.2 Comparison on Hybrid Degradation Tasks"}, {"figure_path": "R7w68Z5iqf/tables/tables_15_1.jpg", "caption": "Table 1: Quantitative comparison for hybrid-degradation restoration tasks. The best and the second best results are in red and blue.", "description": "This table presents a quantitative comparison of different parameter-efficient transfer learning (PETL) methods and a full fine-tuning approach on hybrid image degradation restoration tasks.  The table shows PSNR and SSIM scores for various methods on different benchmark datasets (Set5, Set14, BSDS100, Urban100, Manga109) under two types of hybrid degradation: LR4&Noise30 (low resolution and noise) and LR4&JPEG30 (low resolution and JPEG compression).  The number of trainable parameters (#param) for each method is also indicated. The best and second-best results for each metric and dataset are highlighted in red and blue, respectively. The purpose of the table is to demonstrate the superiority of the proposed AdaptIR method, which achieves better performance with significantly fewer parameters than other methods, particularly on hybrid degradation tasks.", "section": "4.2 Comparison on Hybrid Degradation Tasks"}, {"figure_path": "R7w68Z5iqf/tables/tables_15_2.jpg", "caption": "Table 1: Quantitative comparison for hybrid-degradation restoration tasks. The best and the second best results are in red and blue.", "description": "This table presents a quantitative comparison of different parameter-efficient transfer learning (PETL) methods and a fully fine-tuned model on two hybrid degradation tasks: LR4&Noise30 (x4 low-resolution and noise with σ=30) and LR4&JPEG30 (x4 low-resolution and JPEG compression with quality factor q=30).  The metrics used for evaluation are PSNR and SSIM on several benchmark datasets (Set5, Set14, BSDS100, Urban100, Manga109).  The table highlights the best and second-best performing methods for each task and dataset, indicating the superior performance of the proposed AdaptIR method, particularly in achieving stability and high performance in hybrid degradation scenarios.", "section": "4.2 Comparison on Hybrid Degradation Tasks"}, {"figure_path": "R7w68Z5iqf/tables/tables_15_3.jpg", "caption": "Table 15: Results on real-world denoising tasks with SIDD datasets.", "description": "This table compares the performance of different parameter-efficient transfer learning (PETL) methods on a real-world denoising task using the SIDD dataset.  The methods compared include AdaptFor, LoRA, Adapter, FacT, MoE, and the proposed AdaptIR. The table shows the number of parameters (#param) for each method and the peak signal-to-noise ratio (PSNR) achieved.  AdaptIR demonstrates superior performance compared to other PETL methods.", "section": "4.3 Comparison with All-in-One Methods"}, {"figure_path": "R7w68Z5iqf/tables/tables_18_1.jpg", "caption": "Table 1: Quantitative comparison for hybrid-degradation restoration tasks. The best and the second-best results are in red and blue.", "description": "This table presents a quantitative comparison of different methods for image restoration on hybrid degradation tasks, specifically LR4&Noise30 and LR4&JPEG30.  The metrics used for comparison are PSNR and SSIM, calculated for various datasets (Set5, Set14, BSDS100, Urban100, and Manga109). The table also includes the number of trainable parameters (#param) for each method. The best and second-best results for each metric and dataset are highlighted in red and blue respectively, allowing for easy comparison of the different methods' performance.", "section": "4.2 Comparison on Hybrid Degradation Tasks"}]