[{"type": "text", "text": "Text2NKG: Fine-Grained $\\mathbf{N}$ -ary Relation Extraction for N-ary relational Knowledge Graph Construction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Haoran Luo1, Haihong $\\mathbf{E}^{1:}$ ∗, Yuhao $\\mathbf{Yang}^{2}$ , Tianyu $\\mathbf{Yao}^{1}$ , Yikai $\\mathbf{Guo}^{3}$ , Zichen Tang1, Wentai Zhang1, Shiyao Peng1, Kaiyang Wan1, Meina $\\mathbf{Song}^{1}$ , Wei $\\mathbf{Lin^{4}}$ , Yifan $\\mathbf{Zhu}^{1}$ , Luu Anh Tuan5 ", "page_idx": 0}, {"type": "text", "text": "1School of Computer Science, Beijing University of Posts and Telecommunications, China   \n2School of Automation Science and Electrical Engineering, Beihang University, China   \n3Beijing Institute of Computer Technology and Application 4Inspur Group Co., Ltd., China   \n5College of Computing and Data Science, Nanyang Technological University, Singapore   \n{luohaoran, ehaihong, yifan_zhu}@bupt.edu.cn, anhtuan.luu@ntu.edu.sg ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Beyond traditional binary relational facts, n-ary relational knowledge graphs (NKGs) are comprised of n-ary relational facts containing more than two entities, which are closer to real-world facts with broader applications. However, the construction of NKGs remains at a coarse-grained level, which is always in a single schema, ignoring the order and variable arity of entities. To address these restrictions, we propose Text2NKG, a novel fine-grained n-ary relation extraction framework for n-ary relational knowledge graph construction. We introduce a span-tuple classification approach with hetero-ordered merging and output merging to accomplish fine-grained $\\mathbf{n}$ -ary relation extraction in different arity. Furthermore, Text2NKG supports four typical NKG schemas: hyper-relational schema, event-based schema, role-based schema, and hypergraph-based schema, with high flexibility and practicality. The experimental results demonstrate that Text2NKG achieves state-of-the-art performance in $F_{1}$ scores on the fine-grained n-ary relation extraction benchmark. Our code and datasets are publicly available1. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Modern knowledge graphs (KGs), such as Freebase [2], Google Knowledge Vault [7], and Wikidata [21], utilize a multi-relational graph structure to represent knowledge. Because of the advantage of intuitiveness and interpretability, KGs find various applications in question answering [28], query response [1], logical reasoning [4], and recommendation systems [29]. Traditional KGs are mostly composed of binary relational facts (subject, relation, object), which represent the relationship between two entities [3]. However, it has been observed [20] that over $30\\%$ of real-world facts involve n-ary ", "page_idx": 0}, {"type": "image", "img_path": "V2MBWYXp63/tmp/4f1ed2a103208ed87905186e6faa928034ec6d2cb3302e43f961f05ef8ad5e81.jpg", "img_caption": ["Figure 1: An example of NKG construction. "], "img_footnote": [], "page_idx": 0}, {"type": "text", "text": "relation facts with more than two entities $\\left(n\\geq2\\right)$ ). As shown in Figure 1, an n-ary relational knowledge graph (NKG) is composed of many n-ary relation facts, offering richer knowledge expression and wider application capabilities. As a key step of constructing NKGs, n-ary relation extraction (n-ary RE) is a task of identifying n-ary relations among entities in natural language texts. Compared to binary relational facts, n-ary relational facts in NKGs have more diverse schemas for different scenarios. For example, Wikidata utilizes n-ary relational facts in a hyper-relational schema [20, 10, 23], i.e., $(s,r,o,\\{(k_{i},v_{i})\\}_{i=1}^{n-2})$ which adds $(n-2)$ key-value pairs to the main triple to represent auxiliary information. In addition to the hyper-relational schema, the existing NKG schemas also include event-based schema $(r,\\{(k_{i},v_{i})\\}_{i=1}^{\\bar{n}})$ [11, 16], role-based schema $(\\{(k_{i},v_{i})\\}_{i=1}^{n})$ [12, 15], and hypergraph-based schema $(r,\\{v_{i}\\}_{i=1}^{n})$ [26, 8], as shown in Figure 2. ", "page_idx": 0}, {"type": "image", "img_path": "V2MBWYXp63/tmp/b733c4c6378f225ba49b31747119954cc718c7472701b4057a373e1c6155d623.jpg", "img_caption": ["Figure 2: Taking a real-world textual fact as an example, we can extract a four-arity structured span-tuple for entities (Einstein, University of Zurich, Doctorate, Physics) with an answer label-list for relations accordingly as a 4-ary relational fact from the sentence through n-ary relation extraction. "], "img_footnote": [], "page_idx": 1}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "Currently, most existing NKGs in four schemas, such as JF17K [26], Wikipeople [12], WD50K [10], and EventKG [11], are manually constructed. Previous n-ary RE methods [13, 31] focus on extraction with a fixed number of entities in hypergraph-based schema or role-based schema. Existing event extraction methods [16, 17, 9] can achieve n-ary RE in event-based schema. Recently, CubeRE [5] introduce a cube-filling method, which is the only n-ary RE method in hyper-relational schema. ", "page_idx": 1}, {"type": "text", "text": "However, there are still three main challenges in automated n-ary RE for NKG construction, which remains at a coarse-grained level: (1) Diversity of NKG schemas. Previous methods could only perform N-ary RE based on a specific schema, but currently, there is no flexible method that can perform n-ary RE for arbitrary schema with different number of relations. (2) Determination of the order of entities. N-ary RE involves more possible entity orders than binary RE, for example, as shown in Figure 2, in a hyper-relational schema, there is an order issue regarding which entity is the head entity, tail entity, or auxiliary entity. Previous methods often ignored the joint impact of different entity orders, leading to inaccurate extraction.(3) Variability of the arity of n-ary RE. Previous methods usually output a fixed number of entities and are not adept at determining the variable number of entities forming an n-ary relational fact. ", "page_idx": 1}, {"type": "text", "text": "To tackle these challenges, we introduce Text2NKG, a novel fine-grained n-ary RE framework designed to automate the generation of n-ary relational facts from natural language text for NKG construction. Text2NKG employs a span-tuple multi-label classification method, which transforms n-ary RE into a multi-label classification task for span-tuples, including all combinations of entities in the text. Because the number of predicted relation labels corresponds to the chosen NKG schema, Text2NKG is adaptable to all NKG schemas, offering examples with hyper-relational schema, event-based schema, role-based schema, and hypergraph-based schema, all of which have broad applications. Moreover, Text2NKG introduces a hetero-ordered merging method, considering the probabilities of predicted labels for different entity orders to determine the final entity order. Finally, Text2NKG proposes an output merging method, which is used to unsupervisedly derive n-ary relational facts of any number of entities for NKG construction. ", "page_idx": 1}, {"type": "text", "text": "In addition, we extend the only n-ary RE benchmark for NKG construction, HyperRED [5], which is in the hyper-relational schema, to four NKG schemas. We’ve done sufficient n-ary RE experiments on HyperRED, and the experimental results show that Text2NKG achieves state-of-the-art performance in $F_{1}$ scores of hyper-relational extraction. We also compared the results of Text2NKG in the other three schemas to verify applications. ", "page_idx": 1}, {"type": "text", "text": "2 Related Work ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "2.1 N-ary relational Knowledge Graph ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "An n-ary relational knowledge graph (NKG) consists of n-ary relational facts, which contain $n$ entities $\\left[n\\geq2\\right]$ ) and several relations. The n-ary relational facts are necessary and cannot be replaced by combinations of some binary relational facts because we cannot distinguish which binary relations are combined to represent the n-ary relational fact in the whole KG. Therefore, NKG utilizes a schema in every n-ary relational fact locally and a hypergraph representation globally [18]. ", "page_idx": 2}, {"type": "text", "text": "Firstly, the simplest NKG schema is hypergraph-based. [26] found that over $30\\%$ of Freebase [2] entities participate facts with more than two entities, first defined n-ary relations mathematically and used star-to-clique conversion to convert triple-based facts representing n-ary relational facts into the first NKG dataset JF17K in hypergraph-based schema $(r,\\{v_{i}\\}_{i=1}^{n})$ . [8] proposed FB-AUTO and M-FB15K with the same hypergraph-based schema. Secondly, [12] introduced role information for n-ary relational facts and extracted Wikipeople, the first NKG dataset in role-based schema $(\\{(k_{i},v_{i})\\}_{i=1}^{n})$ , composed of role-value pairs. Thirdly, Wikidata [21], the largest knowledge base, utilizes an NKG schema based on hyper-relation $(s,r,o,\\{(k_{i},v_{i})\\}_{i=1}^{n-2})$ , which adds auxiliary keyvalue pairs to the main triple. [10] first proposed an NKG dataset in hyper-relational schema WD50K. Fourthly, as [11] pointed out, events are also n-ary relational facts. One basic event representation has an event type, a trigger, and several key-value pairs [16]. Regarding the event type as the main relation, the (trigger: value) as one of the key-value pairs, and the arguments as the rest key-value pairs, we can obtain an event-based NKG schema $(r,\\mathbf{\\dot{\\hat{\\{\\rho}}}}(k_{i},v_{i})\\}_{i=1}^{n})$ . ", "page_idx": 2}, {"type": "text", "text": "Based on four common NKG schemas, we propose Text2NKG, the first method for extraction of structured $\\mathbf{n}$ -ary relational facts from natural language text, which improves NKG representation and application. ", "page_idx": 2}, {"type": "text", "text": "2.2 N-ary Relation Extraction ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Relation extraction (RE) is an important step of KG construction, directly affecting the quality, scale, and application of KGs. While most of the current n-ary relation extraction (n-ary RE) for NKG construction depends on manual construction [26, 12, 10] but not automated methods. Most automated RE methods target the extraction of traditional binary relational facts. For example, [22] proposes a table-filling method for binary RE, and [30, 27] propose span-based RE methods with levitated marker and packed levitated marker, respectively. ", "page_idx": 2}, {"type": "text", "text": "For automated n-ary RE, some approaches [13, 31] treat n-ary RE in hypergraph-based schema or role-based schema as a binary classification problem and predict whether the composition of n-ary information in a document is valid or not. However, these methods extract n-ary information in fixed arity, which are not flexible. Moreover, some event extraction methods [16, 17, 9] propose different event trigger and argument extraction techniques, which can achieve n-ary RE in event-based schema. Recently, CubeRE [5] proposes an automated n-ary RE method in hyper-relational schema, which extends the table-filling extraction method to n-ary RE with cube-filling. However, these methods can only model one of the useful NKG schemas with limited extraction accuracy. ", "page_idx": 2}, {"type": "text", "text": "In this paper, we propose the first fine-grained n-ary RE framework Text2NKG for NKG construction in four example schemas, proposing a span-tuple multi-label classification method with heteroordered merging and output merging to improve the accuracy of fine-grained n-ary RE extraction in all NKG schemas substantially. ", "page_idx": 2}, {"type": "text", "text": "3 Preliminaries ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Formulation of NKG. An NKG $\\mathcal{G}=\\{\\mathcal{E},\\mathcal{R},\\mathcal{F}\\}$ consists of an entity set $\\mathcal{E}$ , a relation set $\\mathcal{R}$ , and an n-ary fact $(\\mathfrak{n}{\\geq}2)$ set $\\mathcal{F}$ . Each $\\mathbf{n}$ -ary fact $f^{n}\\in{\\mathcal{F}}$ consists of entities $\\in\\mathcal{E}$ and relations $\\in\\mathcal{R}$ . For hyper-relational schema [20]: $f_{h r}^{n}=(e_{1},r_{1},e_{2},\\{r_{i-1},e_{i}\\}_{i=3}^{n})$ where $\\{e_{i}\\}_{i=1}^{n}\\in\\mathcal{E}$ , $\\{r_{i}\\}_{i=1}^{n-1}\\in\\mathcal{R}$ For event-based schema [16]: $f_{e v}^{n}=(r_{1},\\{r_{i+1},e_{i}\\}_{i=1}^{n})$ , where $\\{e_{i}\\}_{i=1}^{n}\\in\\mathcal{E}$ , $\\{r_{i}\\}_{i=1}^{n+1}\\in\\mathcal{R}$ . For rolebased schema [12]: $f_{r o}^{n}=\\left(\\{r_{i},e_{i}\\}_{i=1}^{n}\\right)$ , where $\\{e_{i}\\}_{i=1}^{n}\\in\\mathcal{E}$ , $\\{r_{i}\\}_{i=1}^{n}\\in\\mathcal{R}$ . For hypergraph-based schema [26]: $f_{h g}^{n}=(r_{1},\\{e_{i}\\}_{i=1}^{n})$ , where $\\{e_{i}\\}_{i=1}^{n}\\in\\mathcal{E}$ , $r_{1}\\in\\mathcal{R}$ . ", "page_idx": 2}, {"type": "image", "img_path": "V2MBWYXp63/tmp/777d7002ef78b084c7975e73f63bfab03e6a952e4a76070cb58db4702888afd7.jpg", "img_caption": ["Figure 3: An overview of Text2NKG extracting n-ary relation facts from a natural language sentence in hyper-relational NKG schema for an example. "], "img_footnote": [], "page_idx": 3}, {"type": "text", "text": "Problem Definition. Given an input sentence with $l$ words ${s}=\\{w_{1},w_{2},...,w_{l}\\}$ , an entity $e$ is a consecutive span of words: $e=\\{w_{p},w_{p+1},...,w_{q}\\}\\in\\mathcal{E}_{s}$ , where $p,q\\in\\{1,...,l\\}$ , and $\\mathcal{E}_{s}=\\{e_{j}\\}_{j=1}^{m}$ is the entity set of all $m$ entities in the sentence. The output of $\\mathbf{n}$ -ary relation extraction, $R()$ , is a set of $\\mathbf{n}$ -ary relational facts ${\\mathcal{F}}_{s}$ in given NKG schema in $\\{\\bar{f}_{h r}^{n},f_{e v}^{n},f_{r o}^{\\bar{n}},f_{h g}^{n}\\}$ . Specifically, each n-ary relational fact $f^{n}\\in\\mathcal{F}_{s}$ is extracted by multi-label classification of one of the ordered span-tuple for $n$ entities $[e_{i}]_{i=1}^{n}\\in\\mathcal{E}_{s}$ , forming an answer label-list for $n_{r}$ relations $[r_{i}]_{i=1}^{n_{r}}\\in\\mathcal{R}$ , where $n$ is the arity of the extracted n-ary relational fact, and $n_{r}$ is the number of answer relations in the fact, which is determin ed by the given NKG schema: $R([e_{i}]_{i=1}^{n})=[r_{i}]_{i=1}^{n-1}$ , when $f^{n}=f_{h r}^{n}$ , $R([e_{i}]_{i=1}^{n})=[r_{i}]_{i=1}^{n+1}$ when $f^{n}=f_{e v}^{n}$ , $\\bar{R([e_{i}]_{i=1}^{n})}=[r_{i}]_{i=1}^{n}$ when $f^{n}=f_{r o}^{n}$ , and $R([e_{i}]_{i=1}^{n})=[r_{1}]$ when $f^{n}=f_{h g}^{n}$ . ", "page_idx": 3}, {"type": "text", "text": "4 Methodology ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "In this section, we first introduce the overview of the Text2NKG framework, followed by the spantuple multi-label classification, training strategy, hetero-ordered merging, and output merging. ", "page_idx": 3}, {"type": "text", "text": "4.1 Overview of Text2NKG ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Text2NKG is a fine-grained n-ary relation extraction framework built for n-ary relational knowledge graph (NKG) construction. The input to Text2NKG is natural language text tokens labeled with entity span in sentence units. First, inspired by [27], Text2NKG encodes the entities using BERT-based Encoder [6] with a packaged levitated marker for embedding. Then each arrangement of ordered span-tuple with three entity embeddings will be classified with multiple labels, and the framework will be learned by the weighted cross-entropy with a null-label bias. In the decoding stage, in order to filter the n-ary relational facts whose entity compositions have isomorphic hetero-ordered characteristics, Text2NKG proposes a hetero-ordered merging strategy to merge the label probabilities of $3!=6$ arrangement cases of span-tuples composed of the same entities and filter out the output 3-ary relational facts existing non-conforming relations. Finally, Text2NKG combines the output 3-ary relational facts to form the final n-ary relational facts with output merging. ", "page_idx": 3}, {"type": "text", "text": "4.2 Span-tuple Multi-label Classification ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "For the given sentence token ${\\boldsymbol s}=\\{w_{1},w_{2},...,w_{l}\\}$ and the set of entities $\\mathcal{E}_{s}$ , in order to perform finegrained n-ary RE, we need first to encode a span-tuple $(e_{1},e_{2},e_{3})$ consisting of every arrangement of three ordered entities, where $e_{1},e_{2},e_{3}\\in\\mathcal{E}_{s}$ . Due to the high time complexity of training every span-tuple as one training item, inspired by [27], we achieve the reduction of training items by using packed levitated markers that pack one training item with each entity in $\\mathcal{E}_{s}$ separately. Specifically, in each packed training item, a pair of solid tokens, [S] and [/S], are added before and after the packed entity $e_{S}\\,=\\,\\{w_{p_{S}},...,w_{q_{S}}\\}$ , and $(|\\mathcal{E}_{s}|-1)$ pairs of levitated markers, $[\\mathrm{L}]$ and $[/\\![\\protect\\mathrm{L}]\\protect$ , according to other entities in $\\mathcal{E}_{s}$ , are added with the same position embeddings as the beginning and end of their corresponding entities span $e_{L_{i}}=\\{w_{{p_{L}}_{i}},...,\\bar{w}_{{q_{L}}_{i}}\\}$ to form the input token $\\mathbf{X}$ : ", "page_idx": 3}, {"type": "text", "text": "", "page_idx": 4}, {"type": "equation", "text": "$$\n\\begin{array}{r l r}{\\lefteqn{{\\bf X}=\\{w_{1},...,[S],w_{p_{S}},...,w_{q_{S}},[/S],...,}}\\\\ &{}&{w_{p_{L_{i}}}\\cup[L],...,w_{q_{L_{i}}}\\cup[/L],...,w_{l}\\}.}\\end{array}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "We encode such token by the BERT-based pre-trained model encoder [6]: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\left\\{h_{1},h_{2},...,h_{t}\\right\\}=\\mathrm{BERT}(\\mathbf{X}),\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $t=|\\mathbf{X}|$ is the input token length, $\\{h_{i}\\}_{i=1}^{t}\\in\\mathbb{R}^{d}$ , and $d$ is embedding size. ", "page_idx": 4}, {"type": "text", "text": "There are several span-tuples $(A,B,C)$ in a training item. The embedding of first entity $h_{A}\\in\\mathbb{R}^{2d}$ in the span-tuple is obtained by concat embedding of the solid markers, [S] and $[/\\mathrm{S}]$ , and the embeddings of second and third entities $h_{B},h_{C}\\ \\in\\ \\mathbb{R}^{2d}$ are obtained by concat embeddings of levitated markers, [L] and $[/\\![\\,]\\!]$ with all $A_{m-1}^{2}$ arrangement of any other two entities in $\\mathcal{E}_{s}$ . Thus, we obtain the embedding representation of the three entities to form $A_{m-1}^{2}$ span-tuples in one training item. Therefore, every input sentence contains $m$ training items with $m A_{m-1}^{2}=A_{m}^{3}$ span-tuples for any ordered arrangement of three entities. ", "page_idx": 4}, {"type": "text", "text": "We then define $n_{r}$ linear classifiers, each of which consists of 3 feedforward neural networks $\\{\\mathrm{FNN}_{i}^{k}\\}_{i=1}^{n_{r}},k=\\dot{1},2,3$ , to classify the span-tuples for multiple-label classifnication. Each classifier targets the prediction of one relation $r_{i}$ , thus obtaining a probability lists $(\\mathbf{P}_{i})_{i=1}^{n_{r}}$ with all relations in given relation set $\\mathcal{R}$ plus a null-label: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\mathbf{P}_{i}=\\mathbf{F}\\mathbf{N}\\mathbf{N}_{i}^{1}(h_{A})+\\mathbf{F}\\mathbf{N}\\mathbf{N}_{i}^{2}(h_{B})+\\mathbf{F}\\mathbf{N}\\mathbf{N}_{i}^{3}(h_{C}),\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $\\mathrm{FNN}_{i}^{k}\\in\\mathbb{R}^{2d\\times(|\\mathcal{R}|+1)}$ , and $\\mathbf{P}_{i}\\in\\mathbb{R}^{(|\\mathcal{R}|+1)}$ . ", "page_idx": 4}, {"type": "text", "text": "4.3 Training Strategy ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "To train the $n_{r}$ classifiers for each relation prediction more accurately, we propose a data augmentation strategy for span-tuples. Taking the hyper-relational schema as an example, given a hyper-relational fact $(A,r_{1},B,r_{2},C)$ , we consider swapping the head and tail entities, and changing the main relation to its inverse $(B,r_{1}^{-1},A,r_{2},C)$ , as well as swapping the tail entities with auxiliary values, and the main relation with the auxiliary key $(A,r_{2},C,r_{1},B)$ , also as labeled training span-tuple cases. Thus $R_{h r}(A,B,C)=\\left(r_{1},r_{2}\\right)$ can be augmented with $3!=6$ orders of span-tuples: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\left\\{R_{h r}(A,B,C)=(r_{1},r_{2}),\\right.}\\\\ {\\left.R_{h r}(B,A,C)=(r_{1}^{-1},r_{2}),\\right.}\\\\ {\\left.R_{h r}(A,C,B)=(r_{2},r_{1}),\\right.}\\\\ {\\left.R_{h r}(B,C,A)=(r_{2},r_{1}^{-1}),\\right.}\\\\ {\\left.R_{h r}(C,A,B)=(r_{2}^{-1},r_{1}),\\right.}\\\\ {\\left.R_{h r}(C,B,A)=(r_{1},r_{2}^{-1}).\\right.}\\end{array}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "For other schemas, we can also obtain 6 fully-arranged cases of labeled span-tuples in a similar way, as described in Appendix A. If no n-ary relational fact exists between the three entities of span-tuples, then relation labels are set as null-label. ", "page_idx": 4}, {"type": "text", "text": "Since most cases of span-tuple are null-label, we set a weight hyperparameter $\\alpha\\in(0,1]$ between the null-label and other labels to balance the learning of the null-label. We jointly trained the $n_{r}$ classifiers for each relations by cross-entropy loss $\\mathcal{L}$ with a null-label weight bias $\\mathbf{W}_{\\alpha}$ : ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\mathcal{L}=-\\sum_{i=1}^{n_{r}}\\mathbf{W}_{\\alpha}\\log\\left(\\frac{\\exp\\left(\\mathbf{P}_{i}[r_{i}]\\right)}{\\sum_{j=1}^{|\\mathcal{R}|+1}\\exp\\left(\\mathbf{P}_{i j}\\right)}\\right),\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $\\mathbf{W}_{\\alpha}=[\\alpha,1.0,1.0,...1.0]\\in\\mathbb{R}^{(|\\mathcal{R}|+1)}$ . ", "page_idx": 4}, {"type": "table", "img_path": "V2MBWYXp63/tmp/20dd520da7acc7057605f6d1a723679a68f1911ebd9c121a93d84e885194bdf7.jpg", "table_caption": ["Table 1: Dataset statistics, where the columns indicate the number of entities, relations with four schema, sentences and $\\mathbf{n}$ -ary relational facts in all sets, train set, dev set, and test set, respectively. "], "table_footnote": [], "page_idx": 5}, {"type": "text", "text": "4.4 Hetero-ordered Merging ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "In the decoding stage, since Text2NKG labels all 6 different arrangement of the same entity composition, we design a hetero-ordered merging strategy to merge the corresponding labels of these 6 hetero-ordered span-tuples into one to generate non-repetitive $\\mathbf{n}$ -ary relational facts unsupervisedly. For hyper-relational schema $(n_{r}=2)$ ), we combine the predicted probabilities of two labels $\\mathbf{P}_{1},\\mathbf{P}_{2}$ in 6 orders to $(A,B,C)$ order as follows: ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\left\\{\\begin{array}{l l}{\\mathbf{P}_{1}=\\mathbf{P}_{1}^{(A B C)}+I(\\mathbf{P}_{1}^{(B A C)})+\\mathbf{P}_{2}^{(A C B)}}\\\\ {\\qquad+\\,I(\\mathbf{P}_{2}^{(B C A)})+\\mathbf{P}_{2}^{(C A B)}+\\mathbf{P}_{1}^{(C B A)},}\\\\ {\\mathbf{P}_{2}=\\mathbf{P}_{2}^{(A B C)}+\\mathbf{P}_{2}^{(B A C)}+\\mathbf{P}_{1}^{(A C B)}}\\\\ {\\qquad+\\,\\mathbf{P}_{1}^{(B C A)}+I(\\mathbf{P}_{1}^{(C A B)})+I(\\mathbf{P}_{2}^{(C B A)}),}\\end{array}\\right.\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $I()$ is a function for swapping the predicted probability of relations and the corresponding inverse relations. Then, we take the maximum probability to obtain labels $r_{1},r_{2}$ , forming a 3-ary relational fact $(A,r_{1},B,r_{2},C)$ and filter it out if there are null-label in $(r_{1},r_{2})$ . If there are inverse relation labels in $(r_{1},r_{2})$ , we can also transform the order of entities and relations as equation 4. For event-based schema, role-based schema, and hypergraph-based schema, all can be generated by hetero-ordered merging according to this idea, as shown in Appendix B. ", "page_idx": 5}, {"type": "text", "text": "4.5 Output Merging ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "After hetero-ordered merging, we merge the output 3-ary relational facts to form higher-arity facts, with hyper-relational schema based on the same main triple, event-based schema based on the same main relation (event type), role-based schema based on the same key-value pairs, and hypergraphbased schema based on the same hyperedge relation. This way, we can unsupervisedly obtain n-ary relational facts with dynamic number of arity numbers for NKG construction. More details are discussed in Appendix G.2 and Appendix G.3. ", "page_idx": 5}, {"type": "text", "text": "5 Experiments ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "This section presents the experimental setup, results, and analysis. We answer the following research questions (RQs): RQ1: Does Text2NKG outperform other n-ary RE methods? RQ2: Whether Text2NKG can cover NKG construction for various schemas? RQ3: Does the main components of Text2NKG work? RQ4: How does the null-label bias hyperparameter in Text2NKG affect performance? RQ5: Can Text2NKG get complete n-ary relational facts in different arity? RQ6: How is Text2NKG’s computational efficiency? RQ7: How does Text2NKG perform in specific case study? RQ8: What is the future development of Text2NKG in the era of large language models? ", "page_idx": 5}, {"type": "text", "text": "5.1 Experimental Setup ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "Datasets. The existing fine-grained n-ary RE dataset is HyperRED [5] only in hyper-relational schema with annotated extracted entities. Therefore, we expand the HyperRED dataset to four schemas as standard fine-grained n-ary RE benchmarks and conduct experiments on them. The statistics of the HyperRED with four schemas are shown in Table 1 and the construction detail is in Appendix C. ", "page_idx": 5}, {"type": "text", "text": "Baselines. We compare Text2NKG against Generative Baseline [14], Pipeline Baseline [24], and CubeRE [5] in fine-grained n-ary RE task of hyper-relational schema. For n-ary RE in the other three schemas, we compared Text2NKG with event extraction models such as Text2Event [16], UIE [17], and LasUIE [9]. Furthermore, we utilized different prompts to test the currently most advanced large-scale pre-trained language models ChatGPT [25] and GPT-4 [19] in an unsupervised manner, specifically for the extraction performance across the four schemas. The detailed baseline settings can be found in Appendix D. ", "page_idx": 5}, {"type": "table", "img_path": "V2MBWYXp63/tmp/aaf5c52a57ba74549b5a9f76fae2aca7e6f38d16a8edf29c01e0f92acd1bb3cd.jpg", "table_caption": [], "table_footnote": [], "page_idx": 6}, {"type": "table", "img_path": "V2MBWYXp63/tmp/6cf5c6d7a265a4c5fa362792943ebe130923c5f93d4a7168ce344edefc05c57d.jpg", "table_caption": ["Table 2: Comparison of Text2NKG with other baselines in the hyper-relational extraction on HyperRED. Results of the supervised baseline models are mainly taken from the original paper [5]. The best results in each metric are in bold. "], "table_footnote": ["Table 3: Comparison of Text2NKG with other baselines in the n-ary RE in event-based, role-based, and hypergraph-based schemas on HyperRED. The best results in each metric are in bold. "], "page_idx": 6}, {"type": "text", "text": "", "page_idx": 6}, {"type": "text", "text": "Ablations. To evaluate the significance of Text2NKG’s three main components, data augmentation (DA), null-label weight hyperparameter $(\\alpha)$ , and hetero-ordered merging (HM), we obtain three simplified model variants by removing any one component (Text2NKG w/o DA, Text2NKG w/o $\\alpha$ , and Text2NKG w/o HM) for comparison. ", "page_idx": 6}, {"type": "text", "text": "Evaluation Metrics. We use the $F_{1}$ score with precision and recall to evaluate the dev set and the test set. For a predicted n-ary relational fact to be considered correct, the entire fact must match the ground facts completely. ", "page_idx": 6}, {"type": "text", "text": "Hyperparameters and Enviroment. We train 10 epochs on HyperRED using the Adam optimizer. All experiments were done on a single NVIDIA A100 GPU, and all experimental results were derived by averaging 5 random seed experiments. Appendix E shows Text2NKG’s optimal hyperparameter settings. Appendix F shows training details. ", "page_idx": 6}, {"type": "text", "text": "5.2 Main Results (RQ1) ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "The experimental results of proposed Text2NKG and other baselines with both BERT-base and BERT-large encoders can be found in Table 2 for the fine-grained $\\mathbf{n}$ -ary RE in hyper-relational schema. We can observe that Text2NKG shows a significant improvement over the existing optimal model CubeRE on both the dev and test datasets of HyperRED. The $F_{1}$ score is improved by 19.66 percentage points in the dev set and 18.60 percentage points in the test set with the same BERT-base encoder, and 16.40 percentage points in the dev set and 17.06 percentage points in the test set with the same BERT-large encoder, reflecting Text2NKG’s excellent performance. Figure 4(a) and 4(b) intuitively show the changes of evaluation metrics and answers of facts in the dev set during the training of Text2NKG. It is worth noting that Text2NKG exceeds $90\\%$ in precision accuracy, which proves that the model can obtain very accurate n-ary relational facts and provides a good guarantee for the quality of fine-grained NKG construction. ", "page_idx": 6}, {"type": "image", "img_path": "V2MBWYXp63/tmp/c67400af0cdc87ead6f47a9b24326d45b5e1ee8b01fa2d42941f534483111bf4.jpg", "img_caption": ["Figure 4: (a) Precision, Recall, and $F_{1}$ changes in the dev set during the training of Text2NKG. (b) The changes of the number of true facts, the number of predicted facts, and the number of predicted accurate facts during the training of Text2NKG. (c) Precision, Recall, and $F_{1}$ results on different null-label hyperparameter $(\\alpha)$ settings. "], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "", "page_idx": 7}, {"type": "text", "text": "5.3 Results on Various NKG Schemas (RQ2) ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "As shown in Table 3, besides hyper-relational schema, Text2NKG also accomplishes the tasks of fine-grained n-ary RE in three other different NKG schemas on HyperRED, which demonstrates good utility. In the added tasks of n-ary RE for event-based, role-based, and hypergraph-based schemas, since no model has done similar experiments at present, we used event extraction or unified extraction methods such as Text2Event [16], UIE [17], and LasUIE [9] for comparison. Text2NKG still works best in these schemas, which demonstrates good versatility. ", "page_idx": 7}, {"type": "text", "text": "5.4 Ablation Study (RQ3) ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "Data augmentation (DA), null-label weight hyperparameter $(\\alpha)$ , and hetero-ordered merging (HM) are the three main components of Text2NKG. For the different Text2NKG variants as shown in Table 2, DA, $\\alpha$ , and HM all contribute to the accurate results of our complete model. By comparing the differences, we find that HM is most effective by combining the probabilities of labels of different orders, followed by DA and $\\alpha$ . ", "page_idx": 7}, {"type": "text", "text": "5.5 Analysis of Null-label Weight Hyperparameters (RQ4) ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "We compared the effect for different null-label weight hyperparameters $(\\alpha)$ . As shown in Figure 4(c), the larger the $\\alpha$ , the greater the learning weight of null-label compared with other lables, the more relations are predicted as null-label. After filtering out the facts having null-label, fewer facts are extracted, so the precision is generally higher, and the recall is generally lower. The smaller the $\\alpha$ , the more relations are predicted as non-null labels, thus extracting more n-ary relation facts, so the recall is generally higher, and the precision is generally lower. Comparing the results of $F_{1}$ values for different $\\alpha$ , it is found that $\\alpha=0.01$ works best, which can be adjusted in practice according to specific needs to obtain the best results. ", "page_idx": 7}, {"type": "text", "text": "5.6 Analysis of N-ary Relation Extraction in Different Arity (RQ5) ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "Figure 5(a) shows the number of n-ary relational facts extracted after output merging and the number of the answer facts in different arity during training of Text2NKG on the dev set. We find that, as the training proceeds, the final output of Text2NKG converges to the correct answer in terms of the number of complete $\\mathbf{n}$ -ary relational facts in each arity, achieving implementation of $\\mathbf{n}$ -ary RE in indefinite arity unsupervised, with good scalability. ", "page_idx": 7}, {"type": "image", "img_path": "V2MBWYXp63/tmp/362b4400332575de1d47579003011e7fde488ce26b15b67ef9176c87868e2b35.jpg", "img_caption": ["Figure 5: (a) The changes of the number of extracted n-ary RE in different arity, where \"pred_n\" represents the number of extracted n-ary facts with different arities by Text2NKG, and \"ans_n\" represents the ground truth. (b) Case study of Text2NKG’s n-ary relation extraction in four schemas on HyperRED. "], "img_footnote": [], "page_idx": 8}, {"type": "text", "text": "5.7 Computational Efficiency (RQ6) ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "As mentioned in Section 4.2, the main computational consumption of Text2NKG is selecting every span-tuple of three ordered entities to encode them and get the classified labels in multiple-label classification part. If we adopt an traversal approach with each span-tuple in one training items, the time complexity will be $0(\\dot{m}^{3})$ . To reduce the high time complexity of training every span-tuple as one training item, Text2NKG uses packed levitated markers that pack one training item with each entity in $\\mathcal{E}_{s}$ separately. We obtain the embedding representation of the three entities to form $A_{m-1}^{2}$ span-tuples in one training item. Every input sentence contains $m$ training items with $m A_{m-1}^{2}=A_{m}^{3}$ span-tuples for any ordered arrangement of three entities for multiple-label classification. Therefore, the time complexity decreased from $\\mathrm{O}(m^{3})$ to $\\mathrm{O}(m)$ . ", "page_idx": 8}, {"type": "text", "text": "5.8 Case Study (RQ7) ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "Figure 5(b) shows a case study of n-ary RE by a trained Text2NKG. For a sentence, \"He was born in Skirpenbeck, near York and attended Pocklin.\", four structured nary RE can be obtained by Text2NKG according to the requirements. Taking the hyper-relational schema for an example, Text2NKG can successfully extract one n-ary relational fact consisting of a main triple [He, educated at, Pocklington], and two auxiliary key-value pairs {start time:1936}, {end time:1943}. This intuitively validates the practical performance of Text2NKG on fine-grained n-ary RE to better contribute to NKG construction. ", "page_idx": 8}, {"type": "text", "text": "5.9 Comparison with ChatGPT (RQ8) ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "As shown in Table 2 and Table 3, we compared the extraction effects under four NKG schemas of the supervised Text2NKG with the unsupervised ChatGPT and GPT-4. We found that these large language models cannot accurately distinguish the closely related relations in the fine-grained NKG relation repository, resulting in their F1 scores ranging around $10\\%{-15\\%}$ , which is much lower than the performance of Text2NKG. On the other hand, the limitation of Text2NKG is that its performance is confined within the realm of supervised training. Therefore, in future improvements and practical applications, we suggest combining small supervised models with large unsupervised models to balance solving the cold-start and fine-grained extraction, which is detailed in Appendix G.1. ", "page_idx": 8}, {"type": "text", "text": "6 Conclusion ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "In this paper, we introduce Text2NKG, a novel framework designed for fine-grained n-ary relation extraction (RE) aimed at constructing N-ary Knowledge Graphs (NKGs). Our extensive experiments demonstrate that Text2NKG outperforms all existing baseline models across a wide range of finegrained n-ary RE tasks. Notably, it excels in four distinct schema types: hyper-relational, eventbased, role-based, and hypergraph-based. Furthermore, we have extended the HyperRED dataset, transforming it into a comprehensive fine-grained n-ary RE benchmark that supports all four schemas. ", "page_idx": 8}, {"type": "text", "text": "Acknowledgments ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "This work is supported by the National Science Foundation of China (Grant No. 62176026, Grant No. 62406036, Grant No. 62473271, and Grant No. 62076035). This work is also supported by the SMP-Zhipu.AI Large Model Cross-Disciplinary Fund, the BUPT Excellent Ph.D. Students Foundation (No. CX2023133), the BUPT Innovation and Entrepreneurship Support Program (No. 2024-YC-A091 and No. 2024-YC-T022), and the Engineering Research Center of Information Networks, Ministry of Education. ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "[1] Erik Arakelyan, Daniel Daza, Pasquale Minervini, and Michael Cochez. Complex query answering with neural link predictors. In International Conference on Learning Representations, 2021.   \n[2] Kurt Bollacker, Colin Evans, Praveen Paritosh, Tim Sturge, and Jamie Taylor. Freebase: A collaboratively created graph database for structuring human knowledge. In Proceedings of the 2008 ACM SIGMOD International Conference on Management of Data, SIGMOD ’08, page 1247–1250, New York, NY, USA, 2008. Association for Computing Machinery.   \n[3] Antoine Bordes, Nicolas Usunier, Alberto Garcia-Duran, Jason Weston, and Oksana Yakhnenko. Translating embeddings for modeling multi-relational data. In C.J. Burges, L. Bottou, M. Welling, Z. Ghahramani, and K.Q. Weinberger, editors, Advances in Neural Information Processing Systems, volume 26. Curran Associates, Inc., 2013.   \n[4] Xuelu Chen, Ziniu Hu, and Yizhou Sun. Fuzzy logic based logical query answering on knowledge graphs. Proceedings of the AAAI Conference on Artificial Intelligence, 36(4):3939– 3948, Jun. 2022.   \n[5] Yew Ken Chia, Lidong Bing, Sharifah Mahani Aljunied, Luo Si, and Soujanya Poria. A dataset for hyper-relational extraction and a cube-fliling approach. In Yoav Goldberg, Zornitsa Kozareva, and Yue Zhang, editors, Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing, pages 10114–10133, Abu Dhabi, United Arab Emirates, December 2022. Association for Computational Linguistics.   \n[6] Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. BERT: Pre-training of deep bidirectional transformers for language understanding. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers), pages 4171–4186, Minneapolis, Minnesota, June 2019. Association for Computational Linguistics.   \n[7] Xin Dong, Evgeniy Gabrilovich, Geremy Heitz, Wilko Horn, Ni Lao, Kevin Murphy, Thomas Strohmann, Shaohua Sun, and Wei Zhang. Knowledge vault: A web-scale approach to probabilistic knowledge fusion. In Proceedings of the 20th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD ’14, page 601–610, New York, NY, USA, 2014. Association for Computing Machinery.   \n[8] Bahare Fatemi, Perouz Taslakian, David Vazquez, and David Poole. Knowledge hypergraphs: Prediction beyond binary relations. In Proceedings of the Twenty-Ninth International Joint Conference on Artificial Intelligence, IJCAI’20, 2021.   \n[9] Hao Fei, Shengqiong Wu, Jingye Li, Bobo Li, Fei Li, Libo Qin, Meishan Zhang, Min Zhang, and Tat-Seng Chua. Lasuie: Unifying information extraction with latent adaptive structure-aware generative language model. In S. Koyejo, S. Mohamed, A. Agarwal, D. Belgrave, K. Cho, and A. Oh, editors, Advances in Neural Information Processing Systems, volume 35, pages 15460–15475. Curran Associates, Inc., 2022.   \n[10] Mikhail Galkin, Priyansh Trivedi, Gaurav Maheshwari, Ricardo Usbeck, and Jens Lehmann. Message passing for hyper-relational knowledge graphs. In Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 7346–7359, Online, November 2020. Association for Computational Linguistics.   \n[11] Saiping Guan, Xueqi Cheng, Long Bai, Fujun Zhang, Zixuan Li, Yutao Zeng, Xiaolong Jin, and Jiafeng Guo. What is event knowledge graph: A survey. IEEE Transactions on Knowledge and Data Engineering, pages 1–20, 2022.   \n[12] Saiping Guan, Xiaolong Jin, Yuanzhuo Wang, and Xueqi Cheng. Link prediction on n-ary relational data. In The World Wide Web Conference, WWW ’19, page 583–593, New York, NY, USA, 2019. Association for Computing Machinery.   \n[13] Robin Jia, Cliff Wong, and Hoifung Poon. Document-level n-ary relation extraction with multiscale representation learning. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers), pages 3693–3704, Minneapolis, Minnesota, June 2019. Association for Computational Linguistics.   \n[14] Mike Lewis, Yinhan Liu, Naman Goyal, Marjan Ghazvininejad, Abdelrahman Mohamed, Omer Levy, Veselin Stoyanov, and Luke Zettlemoyer. BART: Denoising sequence-to-sequence pretraining for natural language generation, translation, and comprehension. In Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics, pages 7871–7880, Online, July 2020. Association for Computational Linguistics.   \n[15] Yu Liu, Quanming Yao, and Yong Li. Role-aware modeling for n-ary relational knowledge bases. In Proceedings of the Web Conference 2021, WWW ’21, page 2660–2671, New York, NY, USA, 2021. Association for Computing Machinery.   \n[16] Yaojie Lu, Hongyu Lin, Jin Xu, Xianpei Han, Jialong Tang, Annan Li, Le Sun, Meng Liao, and Shaoyi Chen. Text2Event: Controllable sequence-to-structure generation for end-toend event extraction. In Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers), pages 2795–2806, Online, August 2021. Association for Computational Linguistics.   \n[17] Yaojie Lu, Qing Liu, Dai Dai, Xinyan Xiao, Hongyu Lin, Xianpei Han, Le Sun, and Hua Wu. Unified structure generation for universal information extraction. In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), pages 5755–5772, Dublin, Ireland, May 2022. Association for Computational Linguistics.   \n[18] Haoran Luo, Haihong E, Yuhao Yang, Yikai Guo, Mingzhi Sun, Tianyu Yao, Zichen Tang, Kaiyang Wan, Meina Song, and Wei Lin. HAHE: Hierarchical attention for hyper-relational knowledge graphs in global and local level. In Anna Rogers, Jordan Boyd-Graber, and Naoaki Okazaki, editors, Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), pages 8095–8107, Toronto, Canada, July 2023. Association for Computational Linguistics.   \n[19] OpenAI. Gpt-4 technical report, 2023.   \n[20] Paolo Rosso, Dingqi Yang, and Philippe Cudré-Mauroux. Beyond triplets: Hyper-relational knowledge graph embedding for link prediction. In Proceedings of The Web Conference 2020, WWW ’20, page 1885–1896, New York, NY, USA, 2020. Association for Computing Machinery.   \n[21] Denny Vrandeˇci´c and Markus Krötzsch. Wikidata: A free collaborative knowledgebase. Commun. ACM, 57(10):78–85, sep 2014.   \n[22] Jue Wang and Wei Lu. Two are better than one: Joint entity and relation extraction with tablesequence encoders. In Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 1706–1721, Online, November 2020. Association for Computational Linguistics.   \n[23] Quan Wang, Haifeng Wang, Yajuan Lyu, and Yong Zhu. Link prediction on n-ary relational facts: A graph-based approach. In Findings of the Association for Computational Linguistics: ACL-IJCNLP 2021, pages 396–407, Online, August 2021. Association for Computational Linguistics.   \n[24] Yijun Wang, Changzhi Sun, Yuanbin Wu, Hao Zhou, Lei Li, and Junchi Yan. UniRE: A unified label space for entity relation extraction. In Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers), pages 220–231, Online, August 2021. Association for Computational Linguistics.   \n[25] Xiang Wei, Xingyu Cui, Ning Cheng, Xiaobin Wang, Xin Zhang, Shen Huang, Pengjun Xie, Jinan Xu, Yufeng Chen, Meishan Zhang, Yong Jiang, and Wenjuan Han. Zero-shot information extraction via chatting with chatgpt, 2023.   \n[26] Jianfeng Wen, Jianxin Li, Yongyi Mao, Shini Chen, and Richong Zhang. On the representation and embedding of knowledge bases beyond binary relations. In Subbarao Kambhampati, editor, Proceedings of the Twenty-Fifth International Joint Conference on Artificial Intelligence, IJCAI 2016, New York, NY, USA, 9-15 July 2016, pages 1300–1307. IJCAI/AAAI Press, 2016.   \n[27] Deming Ye, Yankai Lin, Peng Li, and Maosong Sun. Packed levitated marker for entity and relation extraction. In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), pages 4904–4917, Dublin, Ireland, May 2022. Association for Computational Linguistics.   \n[28] Scott Wen-tau Yih, Ming-Wei Chang, Xiaodong He, and Jianfeng Gao. Semantic parsing via staged query graph generation: Question answering with knowledge base. In Proceedings of the Joint Conference of the 53rd Annual Meeting of the ACL and the 7th International Joint Conference on Natural Language Processing of the AFNLP. ACL - Association for Computational Linguistics, July 2015. Outstanding Paper Award.   \n[29] Fuzheng Zhang, Nicholas Jing Yuan, Defu Lian, Xing Xie, and Wei-Ying Ma. Collaborative knowledge base embedding for recommender systems. In Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD ’16, page 353–362, New York, NY, USA, 2016. Association for Computing Machinery.   \n[30] Zexuan Zhong and Danqi Chen. A frustratingly easy approach for entity and relation extraction. In Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, pages 50–61, Online, June 2021. Association for Computational Linguistics.   \n[31] Yuchen Zhuang, Yinghao Li, Junyang Zhang, Yue Yu, Yingjun Mou, Xiang Chen, Le Song, and Chao Zhang. ReSel: N-ary relation extraction from scientific text and tables by learning to retrieve and select. In Yoav Goldberg, Zornitsa Kozareva, and Yue Zhang, editors, Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing, pages 730–744, Abu Dhabi, United Arab Emirates, December 2022. Association for Computational Linguistics. ", "page_idx": 9}, {"type": "text", "text": "", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "Appendix ", "text_level": 1, "page_idx": 12}, {"type": "text", "text": "A Supplement to Data Augmentation ", "text_level": 1, "page_idx": 12}, {"type": "text", "text": "In addition to the hyper-relational schema, the data augmentation strategies for other schemas are as follows: ", "page_idx": 12}, {"type": "text", "text": "For event-based schema, given an event-based fact $(r_{1},r_{2},A,r_{3},B,r_{4},C)$ , we consider keeping the main relation $r_{1}$ unchanged, and swapping other key-value pairs, $\\{r_{2},A\\},\\,\\{r_{3},B\\}$ , and $\\{r_{4},C\\}$ , positionally, also as labeled training span-tuple cases. Thus $R_{e v}(A,B,C)=\\left(r_{1},r_{2},r_{3},r_{4}\\right)$ can be augmented with 6 orders of span-tuples: ", "page_idx": 12}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\left\\{{R_{e v}}(A,B,C)=(r_{1},r_{2},r_{3},r_{4}),\\right.}\\\\ {\\left.{R_{e v}}(B,A,C)=(r_{1},r_{3},r_{2},r_{4}),\\right.}\\\\ {\\left.{R_{e v}}(A,C,B)=(r_{1},r_{2},r_{4},r_{3}),\\right.}\\\\ {\\left.{R_{e v}}(B,C,A)=(r_{1},r_{3},r_{4},r_{2}),\\right.}\\\\ {\\left.{R_{e v}}(C,A,B)=(r_{1},r_{4},r_{2},r_{3}),\\right.}\\\\ {\\left.{R_{e v}}(C,B,A)=(r_{1},r_{4},r_{3},r_{2}).\\right.}\\end{array}\n$$", "text_format": "latex", "page_idx": 12}, {"type": "text", "text": "For role-based schema, given a role-based fact $(r_{1},A,r_{2},B,r_{3},C)$ , we consider swapping key-value pairs, $\\{r_{1},A\\},\\,\\{r_{2},B\\}$ , and $\\{r_{3},C\\}$ , positionally, also as labeled training span-tuple cases. Thus $R_{r o}(A,B,C)=\\left({r_{1},r_{2},r_{3}}\\right)$ can be augmented with 6 orders of span-tuples: ", "page_idx": 12}, {"type": "equation", "text": "$$\n\\left\\{\\begin{array}{l l}{R_{r o}(A,B,C)=(r_{1},r_{2},r_{3}),}\\\\ {R_{r o}(B,A,C)=(r_{2},r_{1},r_{3}),}\\\\ {R_{r o}(A,C,B)=(r_{1},r_{3},r_{2}),}\\\\ {R_{r o}(B,C,A)=(r_{2},r_{3},r_{1}),}\\\\ {R_{r o}(C,A,B)=(r_{3},r_{1},r_{2}),}\\\\ {R_{r o}(C,B,A)=(r_{3},r_{2},r_{1}).}\\end{array}\\right.\n$$", "text_format": "latex", "page_idx": 12}, {"type": "text", "text": "For hypergraph-based schema, given a hypergraph-based fact $(r_{1},A,B,C)$ , we consider keeping the main relation $r_{1}$ unchanged, and swapping entities, $A,B$ , and $C$ , positionally, also as labeled training span-tuple cases. Thus $\\bar{R}_{h g}(A,B,\\bar{C})\\bar{=}\\,\\bar{(}r_{1})$ can be augmented with 6 orders of span-tuples: ", "page_idx": 12}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\left\\{R_{h g}(A,B,C)=(r_{1}),\\right.}\\\\ {R_{h g}(B,A,C)=(r_{1}),}\\\\ {R_{h g}(A,C,B)=(r_{1}),}\\\\ {R_{h g}(B,C,A)=(r_{1}),}\\\\ {R_{h g}(C,A,B)=(r_{1}),}\\\\ {R_{h g}(C,B,A)=(r_{1}).}\\end{array}\n$$", "text_format": "latex", "page_idx": 12}, {"type": "text", "text": "B Supplement to Hetero-ordered Merging ", "text_level": 1, "page_idx": 12}, {"type": "text", "text": "In addition to the hyper-relational schema, the hetero-ordered merging strategies for other schemas are as follows: ", "page_idx": 12}, {"type": "text", "text": "For event-based schema $\\left(n_{r}\\right.\\ =\\ \\ 4)$ , we combine the predicted probabilities of four labels $\\mathbf{P}_{1},\\mathbf{P}_{2},\\mathbf{P}_{3},\\mathbf{P}_{4}$ in 6 orders to $(A,B,C)$ order as follows: ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\left\\{\\begin{array}{c}{\\mathbf{P}_{1}=\\mathbf{P}_{1}^{(A B C)}+\\mathbf{P}_{1}^{(B A C)}+\\mathbf{P}_{1}^{(A C B)}}\\\\ {\\mathbf{\\Lambda}+\\mathbf{P}_{1}^{(B C A)}+\\mathbf{P}_{1}^{(C A B)}+\\mathbf{P}_{1}^{(C B A)},}\\\\ {\\mathbf{P}_{2}=\\mathbf{P}_{2}^{(A B C)}+\\mathbf{P}_{3}^{(B A C)}+\\mathbf{P}_{2}^{(A C B)}}\\\\ {\\mathbf{\\Lambda}+\\mathbf{P}_{4}^{(B C A)}+\\mathbf{P}_{3}^{(C A B)}+\\mathbf{P}_{4}^{(C B A)},}\\\\ {\\mathbf{P}_{3}=\\mathbf{P}_{3}^{(A B C)}+\\mathbf{P}_{2}^{(B A C)}+\\mathbf{P}_{4}^{(A C B)}}\\\\ {\\mathbf{\\Lambda}+\\mathbf{P}_{2}^{(B C A)}+\\mathbf{P}_{4}^{(C A B)}+\\mathbf{P}_{3}^{(C B A)},}\\\\ {\\mathbf{P}_{4}=\\mathbf{P}_{4}^{(A B C)}+\\mathbf{P}_{4}^{(B A C)}+\\mathbf{P}_{3}^{(A C B)}}\\\\ {\\mathbf{\\Lambda}+\\mathbf{P}_{3}^{(B C A)}+\\mathbf{P}_{2}^{(C A B)}+\\mathbf{P}_{2}^{(C B A)},}\\end{array}\\right.\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "Then, we take the maximum probability to obtain labels $r_{1},r_{2},r_{3},r_{4}$ , forming a 3-ary relational fact $(r_{1},r_{2},A,r_{3},B,r_{4},C)$ and filter it out if there are null-label in $(r_{1},r_{2},r_{3},r_{4})$ . ", "page_idx": 13}, {"type": "text", "text": "For role-based schema $(n_{r}=3)$ ), we combine the predicted probabilities of three labels $\\mathbf{P}_{1},\\mathbf{P}_{2},\\mathbf{P}_{3}$ in 6 orders to $(A,B,C)$ order as follows: ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\left\\{\\begin{array}{c}{\\mathbf{P}_{1}=\\mathbf{P}_{1}^{(A B C)}+\\mathbf{P}_{2}^{(B A C)}+\\mathbf{P}_{1}^{(A C B)}}\\\\ {+\\left.\\mathbf{P}_{3}^{(B C A)}+\\mathbf{P}_{2}^{(C A B)}+\\mathbf{P}_{3}^{(C B A)},\\right.}\\\\ {\\mathbf{P}_{2}=\\mathbf{P}_{2}^{(A B C)}+\\mathbf{P}_{1}^{(B A C)}+\\mathbf{P}_{3}^{(A C B)}}\\\\ {+\\left.\\mathbf{P}_{1}^{(B C A)}+\\mathbf{P}_{3}^{(C A B)}+\\mathbf{P}_{2}^{(C B A)},\\right.}\\\\ {\\mathbf{P}_{3}=\\mathbf{P}_{3}^{(A B C)}+\\mathbf{P}_{3}^{(B A C)}+\\mathbf{P}_{2}^{(A C B)}}\\\\ {+\\left.\\mathbf{P}_{2}^{(B C A)}+\\mathbf{P}_{1}^{(C A B)}+\\mathbf{P}_{1}^{(C B A)}.\\right.}\\end{array}\\right.\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "Then, we take the maximum probability to obtain labels $r_{1},r_{2},r_{3}$ , forming a 3-ary relational fact $(r_{1},A,r_{2},B,r_{3},C)$ and filter it out if there are null-label in $(r_{1},r_{2},r_{3})$ . ", "page_idx": 13}, {"type": "text", "text": "For hypergraph-based schema $\\left[n_{r}=1\\right.$ ), we combine the predicted probabilities of one label $\\mathbf{P}_{1}$ in 6 orders to $(A,B,C)$ order as follows: ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\left\\{\\begin{array}{r}{\\mathbf{P}_{1}=\\mathbf{P}_{1}^{(A B C)}+\\mathbf{P}_{1}^{(B A C)}+\\mathbf{P}_{1}^{(A C B)}}\\\\ {+\\mathbf{P}_{1}^{(B C A)}+\\mathbf{P}_{1}^{(C A B)}+\\mathbf{P}_{1}^{(C B A)}.}\\end{array}\\right.\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "Then, we take the maximum probability to obtain labels $r_{1}$ , forming a 3-ary relational fact $(r_{1},A,B,C)$ and filter it out if $r_{1}$ is null-label. ", "page_idx": 13}, {"type": "text", "text": "C Construction of Dataset ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "Based on the original hyper-relational schema on HyperRED dataset [5], we construct other three schemas (event-based, role-based, and hypergraph-based) for fine-grained n-ary RE. Firstly, we view the main relation in the hyper-relational schema as the event type in the event-based schema, combine the head entity and tail entity with two extra head key and tail key to convert them into two key-value pairs, and remain the auxiliary key-value pairs in the hyper-relational schema. Taking ‘Einstein received his Doctorate degree in Physics from the University of Zurich.’ as an example, it can be represented as (Einstein, educated, University of Zurich, {academic_major, Physics}, {academic_ degree, Doctorate}) in the hyper-relational schema and (education, {trigger, received}, {person, Einstein}, {college, University of Zurich}, {academic_major, Physics},{academic_degree, Doctorate}) in the event-based schema. Secondly, we remove the event type in the event-based schema to obtain the role-based schema. Thirdly, we remove all the keys in key-value pairs and remain the relation to build the hypergraph-based schema. ", "page_idx": 13}, {"type": "text", "text": "D Baseline Settings ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Firstly, for the original hyper-relational schema of HyperRED, we adopted the same baselines as in the CubeRE paper [5] to compare with Text2NKG: ", "page_idx": 14}, {"type": "text", "text": "Generative Baseline: Generative Baseline uses BART [14], a sequence-to-sequence model, to transform input sentences into a structured text sequence. ", "page_idx": 14}, {"type": "text", "text": "Pipeline Baseline: Pipeline Baseline uses UniRE [24] to extract relation triplets in the first stage and a span extraction model based on BERT-Tagger [6] to extract value entities and corresponding qualifier labels in the second stage. ", "page_idx": 14}, {"type": "text", "text": "CubeRE: CubeRE [5] is the only hyper-relational extraction model that uses a cube-filling model inspired by table-fliling approaches and explicitly considers the interaction between relation triplets and qualifiers. ", "page_idx": 14}, {"type": "text", "text": "Secondly, for the event-based schema, role-based schema, and hypergraph-based schema, we added the following baselines to further validate the effect of Text2NKG on the fine-grained N-ary relation fact extraction task in the HyperRED dataset: ", "page_idx": 14}, {"type": "text", "text": "Text2Event: Text2Event [5] is a classic model in the Event extraction domain. However, it is not applicable to extractions of the hyper-relational schema. For the role-based schema extraction, we retained the key without referring to the main relation, while for the hypergraph-based schema extraction, we retained the main relation without referring to the key to get the final result for comparison. ", "page_idx": 14}, {"type": "text", "text": "UIE / LasUIE: UIE [17] and LasUIE [9] are unified information extraction models that can handle most tasks like NER, RE, EE, etc. However, they are still only suitable for event extraction in the multi-relational extraction domain and are not applicable to extractions of the hyper-relational schema. Therefore, we adopted the same approach as with Text2Event to compare with Text2NKG. ", "page_idx": 14}, {"type": "text", "text": "Thirdly, under the impact of the wave of large-scale language models brought about by ChatGPT on traditional natural language processing tasks, we added unsupervised large models as baselines to compare with Text2NKG in the n-ary RE tasks of the four schemas. ", "page_idx": 14}, {"type": "text", "text": "ChatGPT / GPT4: Using different prompts, we tested the latest state-of-the-art large-scale pretrained language models ChatGPT [25] and GPT-4 [19] in an unsupervised manner, evaluating their performance on the extraction of the four schemas. ", "page_idx": 14}, {"type": "text", "text": "E Hyperparameter Settings ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "We use the grid search method to select the optimal hyperparameter settings for both Text2NKG with Bert-base and Bert-large. We use the same hyperparameter settings in Text2NKG with different encoders. The hyperparameters that we can adjust and the possible values of the hyperparameters are first determined according to the structure of our model in Table 4. Afterward, the optimal hyperparameters are shown in bold. ", "page_idx": 14}, {"type": "table", "img_path": "V2MBWYXp63/tmp/d92aceebefcc12681801d79ef9fbeb2b63796a4059e62b2ff12ddeaa17dc4445.jpg", "table_caption": [], "table_footnote": ["Table 4: Hyperparameter Selection. "], "page_idx": 14}, {"type": "text", "text": "F Model Training Details ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "We train 10 epochs on HyperRED with the optimal combination of hyperparameters. Text2NKG and all its variants have been trained on a single NVIDIA A100 GPU. Using our optimal hyperparameter settings, the time required to complete the training on HyperRED is 4h with BERT-base encoder and 10h with BERT-large encoder. ", "page_idx": 14}, {"type": "text", "text": "G Further Discussions ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "G.1 How does ChatGPT perform in Fine-grained N-ary RE tasks? ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "We have tried to use LLM APIs such as ChatGPT and GPT to do similar n-ary RE tasks, i.e., prompting model input and output formats for extraction. The advantage of ChatGPT is that it can perform similar tasks in a few-shot situation, however, for building high-quality knowledge graphs, the performance and the fineness of the n-ary RE are much lower than Text2NKG. This is because ChatGPT is not good at multi-label classification tasks that contain less semantic interpretation. When the number of labels of relations in our relation collection is very large, we need to write a very long prompt to tell the LLM about our label candidate collection, which again leads to the problem of forgetting. Therefore, we have tried numerous prompt templates to enhance the extraction effect of ChatGPT, however, on fine-grained n-ary RE task, the best result of ChatGPT can only reach about $10\\%$ of $F_{1}$ value on HyperRED, which is much lower than the result of $80\\%+F_{1}$ value of Text2NKG. ", "page_idx": 15}, {"type": "text", "text": "However, advanced LLMs such as ChatGPT are a good idea for training dataset generation for Text2NKG in such tasks to save some manual labor to only verify and correct the training items generated. For future work, we will continue our research in this direction and try to combine large language models with Text2NKG-like supervised models for automated fine-grained n-ary RE for n-ary relational knowledge graph construction. ", "page_idx": 15}, {"type": "text", "text": "G.2 Why first Extracting 3-ary facts and then Merging them into N-ary Facts ? ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "We use output merging to address the dynamic changes in the number of elements in n-ary relational facts. The atomic unit of an n-ary fact includes a 3-ary fact with three entities. For instance, in the hyper-relational fact (Einstein, educated_at, University of Zurich, degree: Doctorate degree, major: Physics), the Text2NKG algorithm allows us to extract two 3-ary atomic facts: (Einstein, educated_at, University of Zurich, degree: Doctorate degree) and (Einstein, educated_at, University of Zurich, major: Physics). These are then merged based on the same primary triple (Einstein, educated_at, University of Zurich) to form a 4-ary fact. The same principle applies to facts of higher arities. ", "page_idx": 15}, {"type": "text", "text": "As another example demonstrating the problem with merging binary relations: consider the statement “Einstein received his Bachelor’s degree in Mathematics and his Doctorate degree in Physics.\" When represented as binary relations, the facts become (Einstein, degree, Doctorate degree), (Einstein, major, Physics), (Einstein, degree, Bachelor), and (Einstein, major, Mathematics). With this representation, we cannot merge these binary relation facts effectively because there’s no way to determine whether Einstein’s doctoral major was Physics or Mathematics. This necessitates the use of NKG’s n-ary relationship facts to represent this information, as seen in (Einstein, degree, Doctorate degree, major, Physics). ", "page_idx": 15}, {"type": "text", "text": "Therefore, using binary facts, we can’t merge them into n-ary facts based on shared elements within these facts. On the other hand, using facts with four entities or more makes it challenging to effectively extract 3-ary atomic facts. ", "page_idx": 15}, {"type": "text", "text": "In Section 5.6 and Figure 5(a), we also analyzed the effects and detailed insights of unsupervised extraction of arbitrary-arity facts. ", "page_idx": 15}, {"type": "text", "text": "G.3 How Text2NKG can address Long Contexts with Relations spread across Various Sentences ? ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "As long as the text to be extracted is a lengthy piece with entities annotated, it can undergo long-form n-ary relation extraction. The maximum text segment size for our proposed method depends on the maximum text length that a transformer-based encoder can accept, such as Bert-base and Bert-large, which have a maximum limit of 512. To extract from larger documents, we simply need to switch to encoders with larger context length, which all serve as the encoder portion of Text2NKG and are entirely decoupled from the n-ary relation extraction technique we propose. This is one of the advantages of Text2NKG. Its primary focus is to address the order and combination issues of multi-ary relationships. We can seamlessly combine a transformer encoder that supports long texts with Span-tuple Multi-label Classification to process n-ary relation extraction in long chapters. ", "page_idx": 15}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 16}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 16}, {"type": "text", "text": "Justification: The abstract and introduction accurately reflect the paper’s contributions and scope. The claims made are supported by the detailed methodology and experimental results sections. Text2NKG demonstrates improvements in fine-grained n-ary relation extraction, supports multiple NKG schemas, and achieves state-of-the-art performance as claimed. The public availability of code and datasets further supports the paper’s transparency and reproducibility. ", "page_idx": 16}, {"type": "text", "text": "Guidelines: ", "page_idx": 16}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 16}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 16}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Justification: The paper discusses several limitations, including the constraint of supervised training, the suggestion to combine supervised and unsupervised models, and the handling of long contexts with appropriate encoders. These points are addressed in the comparison with large language models and in discussions about future work and handling long texts. ", "page_idx": 16}, {"type": "text", "text": "Guidelines: ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best ", "page_idx": 16}, {"type": "text", "text": "judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 17}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 17}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 17}, {"type": "text", "text": "Justification: The paper provides a comprehensive set of assumptions and proofs for its theoretical results. These are detailed in both the main sections and the appendices. For instance, the hetero-ordered merging strategy and the output merging methodology are explained with equations and detailed descriptions of the processes involved. Additionally, the assumptions for the span-tuple multi-label classification method and the handling of null-label weights are clearly stated, with mathematical formulations provided to support the theoretical claims. ", "page_idx": 17}, {"type": "text", "text": "Guidelines: ", "page_idx": 17}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 17}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 17}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Justification: The paper includes detailed information necessary to reproduce the main experimental results. It provides a comprehensive description of the datasets used, the baselines for comparison, the experimental setup, and the evaluation metrics. Additionally, the paper mentions the use of a single NVIDIA A100 GPU and details the hyperparameters and training environment in the appendices. The inclusion of the link to the anonymous GitHub repository ensures that the code and datasets are accessible for reproducibility. ", "page_idx": 17}, {"type": "text", "text": "Guidelines: ", "page_idx": 17}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example   \n(a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm.   \n(b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully.   \n(c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset).   \n(d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 17}, {"type": "text", "text": "", "page_idx": 18}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 18}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Justification: The paper provides open access to the data and code, including a link to an anonymous GitHub repository. It also includes detailed instructions on how to reproduce the main experimental results, covering data access, preparation, and the specific commands and environment needed to run the experiments. These details are described in the supplemental material and appendices. ", "page_idx": 18}, {"type": "text", "text": "Guidelines: ", "page_idx": 18}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 18}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 18}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Justification: The paper specifies all the necessary training and test details, including data splits, hyperparameters, and the type of optimizer used. This information is provided in the main text and further elaborated in the appendices, ensuring that the experimental setup is fully transparent and reproducible. ", "page_idx": 18}, {"type": "text", "text": "Guidelines: ", "page_idx": 19}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 19}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 19}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 19}, {"type": "text", "text": "Justification: The paper reports error bars and provides appropriate information about the statistical significance of the experiments. The factors of variability captured by the error bars are clearly stated, and the method for calculating the error bars is explained. The assumptions made and whether the error bar represents the standard deviation or the standard error of the mean are also clearly mentioned. ", "page_idx": 19}, {"type": "text", "text": "Guidelines: ", "page_idx": 19}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 19}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 19}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 19}, {"type": "text", "text": "Justification: The paper provides detailed information on the compute resources used for the experiments. It specifies that all experiments were conducted on a single NVIDIA A100 GPU. The training details include the time required for training on HyperRED, which is 4 hours with the BERT-base encoder and 10 hours with the BERT-large encoder. The optimal hyperparameter settings and the use of the Adam optimizer are also described, along with the number of epochs and batch sizes. ", "page_idx": 19}, {"type": "text", "text": "Guidelines: ", "page_idx": 19}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute. ", "page_idx": 19}, {"type": "text", "text": "• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 20}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 20}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Justification: The research described in the paper conforms to the NeurIPS Code of Ethics. We have ensured transparency, reproducibility, and ethical use of the data and models. We have also made the code and datasets publicly available to support open science and reproducibility. There is no indication of any ethical violations or concerns regarding the research process or outcomes. ", "page_idx": 20}, {"type": "text", "text": "Guidelines: ", "page_idx": 20}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 20}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 20}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Justification: The paper discusses potential positive societal impacts, such as improving the quality of knowledge graphs and enabling more accurate information extraction from text. It also considers potential negative impacts, such as the possibility of misuse of the technology for disinformation or unfair decision-making. We suggest that combining small supervised models with large unsupervised models could help mitigate some of these risks by improving the accuracy and robustness of the extraction process. ", "page_idx": 20}, {"type": "text", "text": "Guidelines: ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed.   \n• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 20}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 21}, {"type": "text", "text": "Justification: The paper addresses the potential misuse of the proposed methods and models. It emphasizes the importance of responsible use and includes strategies to mitigate risks. We suggest combining small supervised models with large unsupervised models to balance solving the cold-start problem and fine-grained extraction. They highlight that unsupervised large language models like ChatGPT and GPT-4 cannot accurately distinguish closely related relations, which implies careful consideration for controlled use. They also recommend specific usage guidelines and restrictions to ensure safe and ethical deployment. ", "page_idx": 21}, {"type": "text", "text": "Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 21}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 21}, {"type": "text", "text": "Justification: The paper properly credits the creators and original owners of the assets used. It cites the relevant datasets and models, including their sources and versions. We ensure that the licenses and terms of use are explicitly mentioned and respected. This information is detailed in the references and the supplemental material, where the datasets and models used are listed along with their corresponding licenses. ", "page_idx": 21}, {"type": "text", "text": "Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 21}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 21}, {"type": "text", "text": "Justification: The new assets introduced in the paper are well documented. The documentation includes details about the training data, model architecture, and usage instructions. We provide structured templates for communicating the dataset/code/model details, including training procedures, licenses, limitations, and consent obtained from people whose data is used. This comprehensive documentation is available alongside the assets in the supplemental material and the anonymous GitHub repository. ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 22}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 22}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 22}, {"type": "text", "text": "Justification: The paper does not involve crowdsourcing experiments or research with human subjects. Therefore, this question is not applicable to the current work. ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 22}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 22}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 22}, {"type": "text", "text": "Justification: The paper does not involve crowdsourcing experiments or research with human subjects. Therefore, IRB approvals or equivalent reviews are not applicable to the current work. ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 22}]