[{"figure_path": "iYzyTmd3Jd/tables/tables_5_1.jpg", "caption": "Table 1: This table presents our results for single-agent and two-agent carrying of the Box object. \"CooHOI\" refers to the policy trained using the complete CooHOI framework in both single-agent and two-agent settings. “CooHOI+WeightAug\" indicates that we applied the same weight augmentation design as InterPhys [7].", "description": "This table presents quantitative results of single-agent and two-agent box-carrying experiments.  It compares the performance of the proposed CooHOI method against the baseline InterPhys method, both with and without weight augmentation.  The metrics reported include success rate and precision (how closely the final object position matches the target).", "section": "4.2 Evaluation on Object Carrying Tasks"}, {"figure_path": "iYzyTmd3Jd/tables/tables_6_1.jpg", "caption": "Table 2: The trained policy exhibits the ability to handle various object categories encountered in daily life with simple fine-tuning. We tested the performance of our policy model across different objects.", "description": "This table presents the success rate and precision of the trained policy model on different object categories (Table, Armchair, HighStool, and Sofa) for both single-agent and two-agent carrying tasks.  The distance to the destination is also specified for each scenario. The results demonstrate the generalizability of the model across various object types and agent numbers.", "section": "4.2 Evaluation on Object Carrying Tasks"}, {"figure_path": "iYzyTmd3Jd/tables/tables_15_1.jpg", "caption": "Table 1: This table presents our results for single-agent and two-agent carrying of the Box object. \"CooHOI\" refers to the policy trained using the complete CooHOI framework in both single-agent and two-agent settings. “CooHOI+WeightAug\" indicates that we applied the same weight augmentation design as InterPhys [7].", "description": "This table compares the performance of different methods for single-agent and two-agent object carrying tasks.  The methods include InterPhys [7], CooHOI with and without weight augmentation, and a baseline model trained from scratch. Results are evaluated using weight of objects, distance to destination, success rate, and precision. The table demonstrates that the CooHOI framework achieves high success rates and precision, especially when weight augmentation is used, outperforming the baseline and demonstrating adaptability to multi-agent scenarios.", "section": "4.2 Evaluation on Object Carrying Tasks"}, {"figure_path": "iYzyTmd3Jd/tables/tables_16_1.jpg", "caption": "Table 1: This table presents our results for single-agent and two-agent carrying of the Box object. \"CooHOI\" refers to the policy trained using the complete CooHOI framework in both single-agent and two-agent settings. “CooHOI+WeightAug\" indicates that we applied the same weight augmentation design as InterPhys [7].", "description": "This table presents the quantitative results of single-agent and two-agent box-carrying experiments.  It compares the performance of the proposed CooHOI method against the baseline InterPhys method, showing success rates and precision (distance error) under varying conditions (weight and distance to target). The table also includes results using a modified CooHOI method with weight augmentation.", "section": "4.2 Evaluation on Object Carrying Tasks"}]