[{"figure_path": "r6tnDXIkNS/tables/tables_6_1.jpg", "caption": "Table 1: Numerical comparisons in terms of CD on DTU dataset. Best results are highlighted as 1st, 2nd and 3rd.", "description": "This table presents a quantitative comparison of different methods for 3D surface reconstruction on the DTU dataset.  The metric used is Chamfer Distance (CD), a measure of the geometric difference between the reconstructed surface and the ground truth. Lower CD values indicate better reconstruction accuracy.  The table shows the average CD across multiple scenes in the DTU dataset, with best results highlighted for each scene and overall mean.", "section": "4.2 Comparisons"}, {"figure_path": "r6tnDXIkNS/tables/tables_6_2.jpg", "caption": "Table 2: Numerical comparisons on Tanks And Temples dataset. Best results are highlighted as 1st, 2nd and 3rd.", "description": "This table presents a quantitative comparison of different methods for 3D reconstruction on the Tanks and Temples dataset.  The metrics used are the average F-score across various scenes in the dataset.  Lower values indicate better performance.  The table also lists the training time for each method. The methods compared include several state-of-the-art techniques using 3D Gaussian splatting as well as a more traditional neural radiance field approach (NeuS).  The 'Ours' row represents the performance of the proposed method.", "section": "4.2 Comparisons"}, {"figure_path": "r6tnDXIkNS/tables/tables_7_1.jpg", "caption": "Table 3: Quantitative evaluations of rendering quality on Mip-NeRF 360 [1] dataset. Best results are highlighted as 1st, 2nd and 3rd.", "description": "This table presents a quantitative comparison of the rendering quality achieved by different methods on the Mip-NeRF 360 dataset.  The metrics used are PSNR (Peak Signal-to-Noise Ratio), SSIM (Structural Similarity Index), and LPIPS (Learned Perceptual Image Patch Similarity). Higher PSNR and SSIM values indicate better rendering quality, while a lower LPIPS value indicates better perceptual similarity to the ground truth images. The table shows the results for both indoor and outdoor scenes, allowing for a comprehensive comparison of the methods' performance across different environments and scene complexities.", "section": "4.2 Comparisons"}, {"figure_path": "r6tnDXIkNS/tables/tables_8_1.jpg", "caption": "Table 4: Ablation studies on DTU dataset.", "description": "This table presents the ablation study results on the DTU dataset, evaluating the impact of different components of the proposed method on the Chamfer Distance (CD) metric.  The columns represent different configurations: pulling Gaussian primitives to centers vs. the zero level set; excluding specific loss terms (thin, tangent, orthogonal); and using different surface extraction methods (TSDF fusion, Poisson reconstruction). The full model represents the complete method.", "section": "4.3 Ablation Studies"}]