[{"figure_path": "tLWoxftJVh/figures/figures_1_1.jpg", "caption": "Figure 1: An illustration of Consistency Purification framework.", "description": "The figure illustrates the Consistency Purification framework.  It shows how a Gaussian noise augmented image is purified using a fine-tuned consistency model. This purified image is then passed to an off-the-shelf classifier for robust prediction. The framework also includes a Consistency Fine-tuning step using LPIPS loss to optimize the parameters of the consistency model for better semantic alignment between purified and original images.  The process is depicted with both a pig and a hummingbird as example images.", "section": "1 Introduction"}, {"figure_path": "tLWoxftJVh/figures/figures_5_1.jpg", "caption": "Figure 2: Transport between purified images and clean images with noise level σ∈ {0.25, 0.5, 0.75, 1.0}.", "description": "This figure shows the transport (a measure of distance between probability distributions) between purified images generated by different methods (onestep-DDPM, Consistency Purification, and Consistency Fine-tuning) and clean images at various noise levels (sigma).  Lower transport indicates better purification, as it implies the purified samples are closer to the original clean images in terms of semantic meaning and are less likely to deviate from the data manifold.", "section": "3 Theoretical Analysis"}, {"figure_path": "tLWoxftJVh/figures/figures_7_1.jpg", "caption": "Figure 3: Certified Accuracy of Consistency Purification with fine-grained radius \nε. The left figure shows results on CIFAR-10, the right figure shows results on ImageNet-64. The lines demonstrate the certified accuracy of various radius ε under different Gaussian noise levels σ.", "description": "This figure shows the certified accuracy of the Consistency Purification method and the onestep-DDPM baseline at different noise levels (σ) and certified radii (ε) on CIFAR-10 and ImageNet-64 datasets. The lines represent the certified accuracy for various radii under each noise level. The figure demonstrates the superior performance of Consistency Purification over the baseline, achieving higher certified accuracy across various radii and noise levels.", "section": "5.2 Main Results"}, {"figure_path": "tLWoxftJVh/figures/figures_8_1.jpg", "caption": "Figure 4: Visualization of purified images after the diffusion purification by applying onestep-DDPM and Consistency Purification on CIFAR-10 with σ = 0.5 noise level. Identical noise patterns are applied to images at corresponding locations. A green border indicates that the purified image is correctly classified, while a red border denotes misclassification by the classifier.", "description": "This figure compares the results of purification using onestep-DDPM and Consistency Purification on CIFAR-10 dataset with a noise level of σ = 0.5.  The images show that Consistency Purification produces higher-quality purified images, leading to better classification accuracy than onestep-DDPM.  Green borders indicate correctly classified images, while red borders indicate misclassified images after purification.", "section": "5.3 Ablation Studies"}, {"figure_path": "tLWoxftJVh/figures/figures_8_2.jpg", "caption": "Figure 4: Visualization of purified images after the diffusion purification by applying onestep-DDPM and Consistency Purification on CIFAR-10 with σ = 0.5 noise level. Identical noise patterns are applied to images at corresponding locations. A green border indicates that the purified image is correctly classified, while a red border denotes misclassification by the classifier.", "description": "This figure compares the results of image purification using onestep-DDPM and Consistency Purification methods on the CIFAR-10 dataset with a noise level of σ = 0.5.  It visually demonstrates the superior quality of images produced by Consistency Purification, which also leads to improved classification accuracy.  Each pair of images shows the same noised input image purified by each method, with a green border indicating correct classification and a red border indicating misclassification by the classifier.", "section": "5.3 Ablation Studies"}, {"figure_path": "tLWoxftJVh/figures/figures_15_1.jpg", "caption": "Figure 4: Visualization of purified images after the diffusion purification by applying onestep-DDPM and Consistency Purification on CIFAR-10 with σ = 0.5 noise level. Identical noise patterns are applied to images at corresponding locations. A green border indicates that the purified image is correctly classified, while a red border denotes misclassification by the classifier.", "description": "This figure compares the results of image purification using onestep-DDPM and Consistency Purification methods on the CIFAR-10 dataset with a noise level of σ = 0.5.  Identical noise patterns were applied to the same locations in each image pair. The green border indicates that the classifier correctly identified the purified image, while a red border indicates misclassification.", "section": "5.3 Ablation Studies"}, {"figure_path": "tLWoxftJVh/figures/figures_15_2.jpg", "caption": "Figure 4: Visualization of purified images after the diffusion purification by applying onestep-DDPM and Consistency Purification on CIFAR-10 with σ = 0.5 noise level. Identical noise patterns are applied to images at corresponding locations. A green border indicates that the purified image is correctly classified, while a red border denotes misclassification by the classifier.", "description": "This figure compares the results of purifying images using onestep-DDPM and Consistency Purification methods on CIFAR-10 dataset with a noise level of σ = 0.5.  Identical noise patterns were added to the same locations in each original image.  The purified images are shown, with green borders indicating correct classification by a classifier after purification and red borders indicating misclassification. This visual comparison highlights the difference in the quality of purified images produced by each method and their impact on classification accuracy.", "section": "5.3 Ablation Studies"}]