[{"figure_path": "GN2GXjPyN8/tables/tables_6_1.jpg", "caption": "Table 1: Summary of AAR, RMSD, CDR Etotal, CDR-Ag AG (kcal/mol), pLL, PHR, and Nsuccess of antibodies designed by our model and baselines. (↓) / (↑) denotes a smaller / larger number is better.", "description": "This table presents a comparison of the performance of different antibody design methods, including the proposed ABDPO and several baselines.  The metrics used to evaluate the methods include Amino Acid Recovery (AAR), Root Mean Square Deviation (RMSD), total CDR energy (CDR Etotal), antigen-binding energy (CDR-Ag AG), pseudo log-likelihood (pLL), percent of hydrophobic residues (PHR), and the number of successfully designed antibodies (Nsuccess). Lower values are preferred for RMSD, CDR Etotal, CDR-Ag AG, and PHR, while higher values are preferred for AAR, pLL, and Nsuccess. The table shows that ABDPO achieves state-of-the-art performance on several of the key metrics.", "section": "4.2 Main Results"}, {"figure_path": "GN2GXjPyN8/tables/tables_9_1.jpg", "caption": "Table 2: Comparison of ABDPO and supervised fine-tuning (SFT) on 1a14.", "description": "This table compares the performance of ABDPO and supervised fine-tuning (SFT) on a single antibody-antigen complex (PDB ID: 1a14).  It shows the average and median values of CDR Etotal and CDR-Ag AG (in kcal/mol) for both methods.  ABDPO demonstrates significantly lower values for both metrics than SFT.", "section": "4.3 Ablation Studies"}, {"figure_path": "GN2GXjPyN8/tables/tables_17_1.jpg", "caption": "Table 1: Summary of AAR, RMSD, CDR Etotal, CDR-Ag AG (kcal/mol), pLL, PHR, and Nsuccess of antibodies designed by our model and baselines. (↓) / (↑) denotes a smaller / larger number is better.", "description": "This table presents a comparison of the performance of different antibody design methods, including the proposed ABDPO method and several baselines, across various metrics.  The metrics assess different aspects of the generated antibodies, including amino acid recovery (AAR), root mean square deviation (RMSD), total energy of the CDR (CDR Etotal), change in Gibbs free energy upon binding to the antigen (CDR-Ag AG), pseudo log-likelihood (pLL), percentage of hydrophobic residues (PHR), and the number of successfully designed antibodies (Nsuccess).  Lower values are better for RMSD, CDR Etotal, CDR-Ag AG, and PHR, while higher values are better for AAR, pLL, and Nsuccess.", "section": "4.2 Main Results"}, {"figure_path": "GN2GXjPyN8/tables/tables_18_1.jpg", "caption": "Table 1: Summary of AAR, RMSD, CDR Etotal, CDR-Ag AG (kcal/mol), pLL, PHR, and Nsuccess of antibodies designed by our model and baselines. (↓) / (↑) denotes a smaller / larger number is better.", "description": "This table summarizes the performance of different antibody design methods, including the proposed ABDPO and several baselines (HERN, MEAN, dyMEAN, DiffAb).  The metrics used to evaluate performance are amino acid recovery (AAR), root mean square deviation (RMSD), total energy of the CDR (CDR Etotal), change in Gibbs free energy between the bound and unbound states of the CDR-antigen complex (CDR-Ag AG), pseudo log-likelihood (pLL), percent of hydrophobic residues (PHR), and the number of successfully designed antibodies (Nsuccess).  Lower is better for RMSD, CDR Etotal, and CDR-Ag AG; higher is better for AAR, pLL, and Nsuccess; and lower is better for PHR. The table highlights the superior performance of ABDPO compared to the baselines across multiple evaluation metrics.", "section": "4.2 Main Results"}, {"figure_path": "GN2GXjPyN8/tables/tables_19_1.jpg", "caption": "Table 1: Summary of AAR, RMSD, CDR Etotal, CDR-Ag AG (kcal/mol), pLL, PHR, and Nsuccess of antibodies designed by our model and baselines. (↓) / (↑) denotes a smaller / larger number is better.", "description": "This table presents a comparison of the performance of different antibody design methods, including the proposed ABDPO method and several baselines (HERN, MEAN, dyMEAN, DiffAb).  The performance is evaluated using several metrics, including amino acid recovery (AAR), root mean square deviation (RMSD), total CDR energy (CDR Etotal), antigen-binding energy (CDR-Ag AG), pseudo log-likelihood (pLL), percent of hydrophobic residues (PHR), and the number of successfully designed antibodies (Nsuccess).  Lower values are generally preferred for RMSD, CDR Etotal, and CDR-Ag AG, while higher values are better for AAR, pLL, and Nsuccess.", "section": "4.2 Main Results"}, {"figure_path": "GN2GXjPyN8/tables/tables_20_1.jpg", "caption": "Table 1: Summary of AAR, RMSD, CDR Etotal, CDR-Ag AG (kcal/mol), pLL, PHR, and Nsuccess of antibodies designed by our model and baselines. (↓) / (↑) denotes a smaller / larger number is better.", "description": "This table presents a comparison of the performance of several antibody design methods, including the authors' proposed method (ABDPO), and several baselines (HERN, MEAN, dyMEAN, DiffAb).  The metrics used for comparison include amino acid recovery (AAR), root mean square deviation (RMSD), total energy of the CDR (CDR Etotal), change in Gibbs free energy between the bound and unbound states of the CDR and antigen (CDR-Ag AG), pseudo log-likelihood (pLL), percent of hydrophobic residues (PHR), and the number of successfully designed antibodies (Nsuccess).  Lower values are better for RMSD, CDR Etotal, CDR-Ag AG, and PHR, while higher values are preferred for AAR, pLL, and Nsuccess.", "section": "4.2 Main Results"}, {"figure_path": "GN2GXjPyN8/tables/tables_21_1.jpg", "caption": "Table 1: Summary of AAR, RMSD, CDR Etotal, CDR-Ag AG (kcal/mol), pLL, PHR, and Nsuccess of antibodies designed by our model and baselines. (↓) / (↑) denotes a smaller / larger number is better.", "description": "This table summarizes the performance of various antibody design methods, including the proposed ABDPO method and several baselines (HERN, MEAN, dyMEAN, DiffAb), across multiple evaluation metrics. These metrics assess different aspects of antibody quality, such as sequence similarity to natural antibodies (AAR), structural similarity (RMSD), total energy of the CDR region (CDR Etotal), binding affinity (CDR-Ag AG), pseudo log-likelihood (pLL), percent of hydrophobic residues (PHR), and the number of successfully designed antibodies (Nsuccess).  The table allows for a comparison of the methods' performance in terms of both rationality and functionality of the generated antibodies.", "section": "4.2 Main Results"}]