[{"figure_path": "ygDl8q02gA/figures/figures_5_1.jpg", "caption": "Figure 1: The lattice of problems considered in this paper. Algorithmic results propagate from left to right while lower bound results propagate right to left.", "description": "This figure shows the hierarchy of problems discussed in the paper.  The simplest problem is learning partitions without errors, which serves as a baseline. From there, three increasingly complex variations are introduced: the l-PL problem (with both false positive and false negative errors), the l-PLFP problem (with only false positive errors), and the l-PLFN problem (with only false negative errors).  The weighted l-PL problem is a generalization that incorporates different penalties for false positives and false negatives. The arrows represent the relationship between these problems in terms of algorithmic and lower bound implications. Algorithmic results flow from left to right, meaning that an algorithm for a more complex problem implies an algorithm for simpler ones. Lower bound results, on the other hand, flow from right to left, demonstrating that lower bounds for a simpler problem apply to more complex problems.", "section": "A hierarchy of problems"}, {"figure_path": "ygDl8q02gA/figures/figures_17_1.jpg", "caption": "Figure 1: The lattice of problems considered in this paper. Algorithmic results propagate from left to right while lower bound results propagate right to left.", "description": "This figure shows the hierarchy of problems studied in the paper, illustrating the relationships between different variants of the l-PL problem (learning partitions with faulty oracles).  The problems are arranged in a lattice structure, where arrows indicate implications about the relative difficulty of problems. For example, the weighted l-PL problem is shown as the most general problem, from which the simpler l-PL problem, l-PLFP, and l-PLFN problems can be derived by setting parameters appropriately.  The direction of the arrows indicates how algorithmic results (upper bounds) and lower bound results flow through the hierarchy; upper bound results for more general problems usually apply to more specific problems, while lower bound results for more specific problems generally extend to more general problems.", "section": "A hierarchy of problems"}, {"figure_path": "ygDl8q02gA/figures/figures_24_1.jpg", "caption": "Figure 2: The partition C* used in the (k – 1) responder strategy.", "description": "This figure illustrates the (k-1)-partition C* used in the (k-1)-groups responder strategy for the RUCCFP game.  The set V is partitioned into k-1 subsets.  k-2 elements are each in their own singleton set. The remaining elements form a single set containing the rest of the elements in V.", "section": "F.2 A responder strategy for the RUCCFP"}]