{"importance": "This paper is crucial for researchers in 3D graphics and computer vision because **it introduces a novel, robust framework for hiding information in 3D Gaussian Splatting (3DGS) point clouds**. This addresses a critical need for copyright protection and secure communication in the increasingly prevalent field of real-time 3D rendering.  The findings open avenues for further research into high-capacity, secure, and flexible steganography methods tailored to explicit 3D representations.", "summary": "GS-Hider: A novel framework secures 3D Gaussian Splatting by embedding messages in a coupled, secured feature attribute, enabling invisible data hiding and accurate extraction.", "takeaways": ["GS-Hider is the first 3DGS steganography framework, offering invisible message embedding and accurate extraction.", "The method boasts strong security and high fidelity, effectively concealing messages without impacting rendering quality.", "GS-Hider demonstrates high versatility and capacity, capable of hiding multimodal messages (images and 3D scenes)."], "tldr": "3D Gaussian Splatting (3DGS) has become a popular method for 3D rendering, but the lack of effective copyright protection for 3D assets is a significant issue.  Classical 3D steganography methods are not suitable for 3DGS because of its explicit 3D representation and real-time rendering speed.  Previous methods that try to modify 3DGS either compromised rendering quality or were insecure.\nThis paper introduces GS-Hider, a new steganography framework designed specifically for 3DGS.  **GS-Hider uses a coupled secured feature attribute to replace the original spherical harmonics coefficients, creating a robust system that hides both images and 3D scenes while preserving rendering quality**. The use of a coupled feature with parallel scene and message decoders ensures both high security and high fidelity.  Extensive experiments demonstrate GS-Hider's effectiveness in various scenarios.", "affiliation": "Peking University", "categories": {"main_category": "Computer Vision", "sub_category": "3D Vision"}, "podcast_path": "3XLQp2Xx3J/podcast.wav"}