[{"figure_path": "rTONicCCJm/figures/figures_4_1.jpg", "caption": "Figure 1: The framework of the proposed OPCR.", "description": "This figure illustrates the framework of the proposed One-step Propagation and Confidence-based Refinement (OPCR) method.  It shows a two-stage process. The first stage involves independent learning of spatial and temporal representations for spatio-temporal points using sparse attention mechanisms. These representations are then used for one-step imputation of missing data.  The second stage refines the imputation results by assigning confidence levels based on correlations between data points and then performing weighted spatio-temporal propagation to address potential biases. The figure visually represents the flow of information through the model, highlighting the key components such as input data, sparse attention modules, imputation steps, confidence-based refinement, and final predictions.", "section": "5.1 Sparse Attention-based One-step Propagation"}, {"figure_path": "rTONicCCJm/figures/figures_8_1.jpg", "caption": "Figure 2: Imputation performance (in terms of MAE) with increasing point missing rate.", "description": "This figure displays the Mean Absolute Error (MAE) for imputation on four different datasets (PEMS-BAY, METR-LA, PV-US, and CER-E) across various missing rates (25%, 50%, 75%, 95%).  It compares the performance of the proposed OPCR model against several baseline methods (PriSTI, IGNNK, BRITS, SPIN-H, and SAITS). The graph allows for a visual comparison of the different imputation methods' robustness to increasing data sparsity in point-level missing scenarios.", "section": "6.3.2 Imputation with Increasing Missing Rate"}, {"figure_path": "rTONicCCJm/figures/figures_8_2.jpg", "caption": "Figure 3: Imputation performance (in terms of MAE) with increasing spatial missing rate.", "description": "This figure displays the Mean Absolute Error (MAE) for imputation across four different datasets (PEMS-BAY, METR-LA, PV-US, and CER-E) at various missing rates (25%, 50%, 75%, 95%).  The performance of six different imputation methods (OPCR, PriSTI, IGNNK, SPIN-H, BRITS, and SAITS) is compared, showing how their MAE changes with increasing spatial data sparsity.  The results highlight the relative performance of each imputation method under different levels of missing spatial data.", "section": "6.3.2 Imputation with Increasing Missing Rate"}, {"figure_path": "rTONicCCJm/figures/figures_9_1.jpg", "caption": "Figure 1: The framework of the proposed OPCR.", "description": "This figure illustrates the framework of the One-step Propagation and Confidence-based Refinement (OPCR) model.  The model consists of two main stages. The first stage involves independent learning of spatial and temporal representations for spatio-temporal points using sparse attention mechanisms.  These separate representations are then used for one-step imputation to directly propagate information from observed to missing data points. The second stage assigns confidence levels to these initial imputations by correlating missing and valid data points, and refines these imputations through spatio-temporal dependencies using a weighted propagation method. This framework is designed to handle highly sparse spatio-temporal data efficiently and accurately by avoiding the error accumulation and information loss often associated with iterative imputation methods.", "section": "5.1 Sparse Attention-based One-step Propagation"}, {"figure_path": "rTONicCCJm/figures/figures_9_2.jpg", "caption": "Figure 4: The effect of each component.", "description": "This figure displays the results of an ablation study, evaluating the impact of different components on the model's performance.  The left panel shows the performance impact by changing the size of hidden layers in both the spatial and temporal modules, for datasets with point and spatial missing data.  The right panel shows the results of varying the number of layers in the refinement stage of the model, also for datasets with point and spatial missing data. The results help demonstrate the contribution of each component (spatial module, temporal module, and refinement) to the overall imputation performance.", "section": "5.1 Sparse Attention-based One-step Propagation"}]