{"references": [{"fullname_first_author": "Eric Arazo", "paper_title": "Unsupervised label noise modeling and loss correction", "publication_date": "2019-00-00", "reason": "This paper proposes a method for unsupervised label noise modeling and loss correction, which is a key topic in learning with noisy labels and is directly relevant to the current paper’s focus on handling noise."}, {"fullname_first_author": "Pengfei Chen", "paper_title": "Beyond class-conditional assumption: A primary attempt to combat instance-dependent label noise", "publication_date": "2021-00-00", "reason": "This paper addresses the limitation of traditional methods that often assume class-conditional noise and focuses on instance-dependent noise, a more realistic and challenging scenario directly relevant to the current paper’s focus."}, {"fullname_first_author": "Jacob Goldberger", "paper_title": "Training deep neural-networks using a noise adaptation layer", "publication_date": "2016-00-00", "reason": "This paper introduces a noise adaptation layer for training deep neural networks, which provides a novel approach for addressing label noise and is related to the current paper’s exploration of robust training methods."}, {"fullname_first_author": "Dan Hendrycks", "paper_title": "A baseline for detecting misclassified and out-of-distribution examples in neural networks", "publication_date": "2016-00-00", "reason": "This paper establishes a baseline for detecting misclassified and out-of-distribution examples, which is highly relevant to the current paper’s investigation of open-set noise detection mechanisms."}, {"fullname_first_author": "Wen Li", "paper_title": "WebVision database: Visual learning and understanding from web data", "publication_date": "2017-00-00", "reason": "This paper introduces the WebVision dataset, a large-scale dataset with significant open-set noise, which is used as a benchmark in the current paper and is crucial for validating the proposed methods."}]}