[{"figure_path": "bxDok3uaK6/figures/figures_2_1.jpg", "caption": "Figure 1: The overview of our experiments. Six visual cortical regions of the mouse and the long-range feedback spiking network receive the same original movie stimuli to generate the representation matrices. TSRSA is applied to two representation matrices to measure representational similarity. In addition, the network receives two modified versions of the movie stimuli (one with broken temporal structures and the other with varied static textures), while the visual cortex still receives the original movie. These two additional experiments are used to quantify the effects of dynamic (temporal) and static (textural) information on representational similarity. See Section 3 for details.", "description": "This figure illustrates the experimental setup to compare the model's representation of movie stimuli with that of the mouse visual cortex. Six visual cortical regions are shown receiving the same movie.  The long-range feedback spiking network also receives the same movie, producing its own representation. Representational Similarity Analysis (RSA) compares the model and biological representations. To isolate the effect of dynamic and static information, the network also receives modified movie versions (shuffled frames and noise images), while the biological input remains unchanged.", "section": "3 Methods"}, {"figure_path": "bxDok3uaK6/figures/figures_3_1.jpg", "caption": "Figure 1: The overview of our experiments. Six visual cortical regions of the mouse and the long-range feedback spiking network receive the same original movie stimuli to generate the representation matrices. TSRSA is applied to two representation matrices to measure representational similarity. In addition, the network receives two modified versions of the movie stimuli (one with broken temporal structures and the other with varied static textures), while the visual cortex still receives the original movie. These two additional experiments are used to quantify the effects of dynamic (temporal) and static (textural) information on representational similarity. See Section 3 for details.", "description": "This figure illustrates the experimental setup.  Six visual cortical regions of a mouse brain and the LoRaFB-SNet model are both shown receiving the same movie stimuli.  The model's generated representations are then compared to the brain's representations using Time-Series Representational Similarity Analysis (TSRSA) to quantify the similarity. To understand the effects of temporal and textural information, two altered versions of the movie (one with temporally shuffled frames and one with altered textures) are given to the model while the original movie remains the input to the visual cortex. Comparing similarities in all three conditions (original, shuffled, and texture-altered) provides insights into how dynamic and static information affect neural representations.", "section": "3 Methods"}, {"figure_path": "bxDok3uaK6/figures/figures_5_1.jpg", "caption": "Figure 1: The overview of our experiments. Six visual cortical regions of the mouse and the long-range feedback spiking network receive the same original movie stimuli to generate the representation matrices. TSRSA is applied to two representation matrices to measure representational similarity. In addition, the network receives two modified versions of the movie stimuli (one with broken temporal structures and the other with varied static textures), while the visual cortex still receives the original movie. These two additional experiments are used to quantify the effects of dynamic (temporal) and static (textural) information on representational similarity. See Section 3 for details.", "description": "This figure illustrates the experimental setup used to compare the model's representations with those of the mouse visual cortex.  Six visual cortical areas receive the same movie, and their responses are compared to a model's responses using Time-Series Representational Similarity Analysis (TSRSA).  To further analyze the impact of dynamic and static information, modified movie stimuli (shuffled frames and noise image replacements) are fed into the network, while the visual cortex continues to receive the original movie. The results help to understand the relative contributions of temporal and static factors in visual processing.", "section": "1 Introduction"}, {"figure_path": "bxDok3uaK6/figures/figures_7_1.jpg", "caption": "Figure 4: A. The TSRSA score curves of LoRaFB-SNet and SEW-ResNet trained on UCF101 with different levels of chaos (the main plot) and the drop rate curves of experimental scores compared with the original score (the subplot). The horizontal coordinates in both plots are the level of chaos. In the main plot, the dashed horizontal lines indicate the original scores between models and the mouse visual cortex under the original movie. Each large point on the curve indicates the average result of a set of experiments, and each small point indicates the result of one trial in a set. The vertical error bar is the 99% confidence interval of the score over 10 trials, while the horizontal error bar is the 99% confidence interval of the level of chaos. In the subplot, the curves show the average drop rate and the average level of chaos over 10 trials for all experimental sets. LoRaFB-SNet shows a large drop in scores while SEW-ResNet shows a small drop. B. The TSRSA score curves of LoRaFB-SNet trained on UCF101/ImageNet with different ratios of replacement. The elements in the main plot indicate similar content as in A. LoRaFB-SNet trained on UCF101 and ImageNet both exhibit a similar decreasing trend in scores. C. The TSRSA scores of feedback/feedforward spiking networks trained on UCF101/ImageNet for the neural dataset under natural scene stimuli.", "description": "This figure demonstrates the effect of disrupting temporal structure (A) and static texture (B) of movie stimuli on the representational similarity between model and mouse visual cortex.  Panel A shows that LoRaFB-SNet is much more sensitive to changes in temporal structure than SEW-ResNet. Panel B shows that both models are negatively affected by changes in static texture, but LoRaFB-SNet maintains higher similarity than SEW-ResNet.  Panel C compares the performance on natural scene images.", "section": "4.3.2 Experiments to Analyze the Effects of Dynamic and Static Information"}, {"figure_path": "bxDok3uaK6/figures/figures_14_1.jpg", "caption": "Figure 2: A. The schematic of six visual cortical regions in the mouse. For brevity, we show parts of the cross-regional feedforward and feedback connections reported from physiological research. B. The schematic of LoRaFB-SNet with the embedded recurrent module. See Section 3.1 for details.", "description": "Figure 2A shows a schematic representation of the six visual cortical areas in a mouse brain, highlighting the feedforward and feedback connections between them.  Figure 2B illustrates the architecture of the LoRaFB-SNet model, focusing on the recurrent module which incorporates feedforward, long-range feedback, and fusion components. This recurrent module mimics the top-down connections between cortical areas in the brain. More details on this architecture are provided in Section 3.1 of the paper.", "section": "3 Methods"}, {"figure_path": "bxDok3uaK6/figures/figures_16_1.jpg", "caption": "Figure 1: The overview of our experiments. Six visual cortical regions of the mouse and the long-range feedback spiking network receive the same original movie stimuli to generate the representation matrices. TSRSA is applied to two representation matrices to measure representational similarity. In addition, the network receives two modified versions of the movie stimuli (one with broken temporal structures and the other with varied static textures), while the visual cortex still receives the original movie. These two additional experiments are used to quantify the effects of dynamic (temporal) and static (textural) information on representational similarity. See Section 3 for details.", "description": "This figure illustrates the experimental design used to evaluate the proposed LoRaFB-SNet model. Six visual cortical regions of a mouse brain and the model receive the same movie as input.  Representational Similarity Analysis (RSA) is used to compare the representations generated by both the model and the brain.  Two additional control experiments are performed where the model receives altered movie stimuli (shuffled frames and noise-replaced frames) to isolate the effects of temporal and static information on representation similarity.", "section": "1 Introduction"}, {"figure_path": "bxDok3uaK6/figures/figures_16_2.jpg", "caption": "Figure 4: A. The TSRSA score curves of LoRaFB-SNet and SEW-ResNet trained on UCF101 with different levels of chaos (the main plot) and the drop rate curves of experimental scores compared with the original score (the subplot). The horizontal coordinates in both plots are the level of chaos. In the main plot, the dashed horizontal lines indicate the original scores between models and the mouse visual cortex under the original movie. Each large point on the curve indicates the average result of a set of experiments, and each small point indicates the result of one trial in a set. The vertical error bar is the 99% confidence interval of the score over 10 trials, while the horizontal error bar is the 99% confidence interval of the level of chaos. In the subplot, the curves show the average drop rate and the average level of chaos over 10 trials for all experimental sets. LoRaFB-SNet shows a large drop in scores while SEW-ResNet shows a small drop. B. The TSRSA score curves of LoRaFB-SNet trained on UCF101/ImageNet with different ratios of replacement. The elements in the main plot indicate similar content as in A. LoRaFB-SNet trained on UCF101 and ImageNet both exhibit a similar decreasing trend in scores. C. The TSRSA scores of feedback/feedforward spiking networks trained on UCF101/ImageNet for the neural dataset under natural scene stimuli.", "description": "This figure shows the results of experiments designed to quantify the effects of dynamic and static information on representational similarity.  Panel A compares the impact of disrupting the temporal order (introducing chaos) of movie stimuli on the representational similarity of LoRaFB-SNet and SEW-ResNet models. Panel B examines the effect of replacing frames in the movie with noise images (varying static information) on the representational similarity.  Panel C shows the models' performance on a natural scene stimuli.", "section": "3.3 Quantifying Effects of Dynamic and Static Information on Representational Similarity"}]