[{"figure_path": "zuwLGhgxtQ/tables/tables_1_1.jpg", "caption": "Table 1: Separation for Proximal Samplers: Gaussian vs. practical Stable oracles (a=1): Upper and lower iteration complexity bounds to generate an ɛ-accurate sample in x²-divergence from the generalized Cauchy target densities with degrees of freedom v, i.e. π, x (1 + |x|2)-(d+v)/2. Here, Ñ, Õ hide constants depending on v and polylog(d, 1/8). For the proximal sampler with a general a-Stable oracle (Algorithm 2), the upper bound for v ∈ (0, 1) is O(log(1/ε)) when a = ν. The lower bounds are from Corollary 2 via 2TV² < x².", "description": "This table summarizes the upper and lower complexity bounds for generating an ɛ-accurate sample using proximal samplers with Gaussian vs. stable oracles.  The target distribution is a generalized Cauchy distribution with varying degrees of freedom (ν). The table shows a separation in complexity between the Gaussian and stable oracles, highlighting the superior performance of stable oracles, especially for heavy-tailed distributions (ν ∈ (0,1)).  The complexity is measured in terms of the number of iterations needed to achieve ɛ-accuracy, expressed using Big O notation.", "section": "1 Introduction"}, {"figure_path": "zuwLGhgxtQ/tables/tables_3_1.jpg", "caption": "Table 1: Separation for Proximal Samplers: Gaussian vs. practical Stable oracles (a=1): Upper and lower iteration complexity bounds to generate an ɛ-accurate sample in x²-divergence from the generalized Cauchy target densities with degrees of freedom v, i.e. π, x (1 + |x|2)-(d+v)/2. Here, Ñ, Õ hide constants depending on v and polylog(d, 1/8). For the proximal sampler with a general a-Stable oracle (Algorithm 2), the upper bound for v ∈ (0, 1) is O(log(1/ε)) when a = ν. The lower bounds are from Corollary 2 via 2TV² < x².", "description": "This table summarizes the upper and lower bounds on the iteration complexity for proximal samplers using Gaussian and stable oracles to generate an ɛ-accurate sample from generalized Cauchy distributions.  It highlights a separation result, showing that Gaussian oracles only achieve low-accuracy guarantees (polynomial dependence on 1/ɛ), while stable oracles achieve high-accuracy guarantees (logarithmic dependence on 1/ɛ) for certain parameter ranges.  The complexity is measured in terms of χ²-divergence.", "section": "1 Introduction"}, {"figure_path": "zuwLGhgxtQ/tables/tables_5_1.jpg", "caption": "Table 1: Separation for Proximal Samplers: Gaussian vs. practical Stable oracles (a=1): Upper and lower iteration complexity bounds to generate an ɛ-accurate sample in x²-divergence from the generalized Cauchy target densities with degrees of freedom v, i.e. π, x (1 + |x|2)-(d+v)/2. Here, Ñ, Õ hide constants depending on v and polylog(d, 1/8). For the proximal sampler with a general a-Stable oracle (Algorithm 2), the upper bound for v ∈ (0, 1) is O(log(1/ε)) when a = ν. The lower bounds are from Corollary 2 via 2TV² < x².", "description": "This table summarizes the upper and lower complexity bounds for generating an Ɛ-accurate sample using proximal samplers with Gaussian and stable oracles.  The target distribution is a generalized Cauchy distribution with varying degrees of freedom (ν). The table highlights a separation in complexity between Gaussian and stable oracles, showing that stable oracles can achieve significantly lower complexity (O(log(1/Ɛ)) in some cases) compared to Gaussian oracles (poly(1/Ɛ)) for heavy-tailed sampling.", "section": "3 Stable Proximal Sampler and the Restricted a-Stable Oracle"}, {"figure_path": "zuwLGhgxtQ/tables/tables_6_1.jpg", "caption": "Table 1: Separation for Proximal Samplers: Gaussian vs. practical Stable oracles (a=1): Upper and lower iteration complexity bounds to generate an ɛ-accurate sample in x²-divergence from the generalized Cauchy target densities with degrees of freedom v, i.e. π, x (1 + |x|2)-(d+v)/2. Here, Ñ, Õ hide constants depending on v and polylog(d, 1/ε). For the proximal sampler with a general a-Stable oracle (Algorithm 2), the upper bound for v ∈ (0, 1) is O(log(1/ε)) when a = ν. The lower bounds are from Corollary 2 via 2TV² < x².", "description": "This table compares the upper and lower bounds on the iteration complexity of proximal samplers using Gaussian vs. Stable oracles to obtain an ε-accurate sample from a generalized Cauchy distribution.  The complexity is measured in terms of the chi-squared divergence.  The table shows that Stable oracles achieve significantly better complexity (O(log(1/ε))) than Gaussian oracles, especially for heavy-tailed distributions (small v).", "section": "3 Stable Proximal Sampler and the Restricted a-Stable Oracle"}]