{"importance": "This paper is crucial for researchers working on multi-agent reinforcement learning and human-computer interaction.  It presents a novel approach to bridge the gap between artificial and human communication in collaborative tasks, **opening new avenues for developing more effective and human-interpretable AI systems**. The findings advance understanding of emergent communication in both artificial and human teams, which is relevant to various fields including robotics, human-computer interaction, and social sciences.", "summary": "LangGround: MARL agents learn human-interpretable communication via LLM-grounded training, enabling effective human-agent collaboration.", "takeaways": ["Human-interpretable communication protocols for multi-agent reinforcement learning were developed by grounding agent communication on synthetic data generated by embodied Large Language Models (LLMs).", "The proposed method, LangGround, not only maintains task performance but also accelerates communication emergence and exhibits zero-shot generalization in ad-hoc teamwork.", "LangGround facilitates effective collaboration between artificial agents and humans in real-world teamwork settings."], "tldr": "Multi-agent reinforcement learning (MARL) often results in communication protocols unintelligible to humans. This limits applications in real-world, ad-hoc teamwork scenarios. Existing approaches trying to align agent communication with human language face challenges due to the vast amount of data required for training and the inherent differences between human and machine languages. \nThe paper introduces LangGround, a novel computational pipeline leveraging Large Language Models (LLMs) to generate synthetic data grounding agent communication in natural language. LangGround aligns agent communication with human language through supervised learning from LLM-generated data and reinforcement learning signals from task environments. This approach enables human-interpretable communication, improves learning speed, and achieves zero-shot generalization to unseen scenarios. The results showcase the effectiveness of LangGround in various tasks, demonstrating that this innovative method bridges the gap between artificial and human communication for effective teamwork.", "affiliation": "University of Pittsburgh", "categories": {"main_category": "Natural Language Processing", "sub_category": "Human-AI Interaction"}, "podcast_path": "DUHX779C5q/podcast.wav"}