[{"figure_path": "I3kIEjoON6/tables/tables_6_1.jpg", "caption": "Table 1: Validation metrics on generation task", "description": "This table presents the validation metrics obtained for different generative models on the crystal structure generation task. The metrics are based on the accuracy of the generated crystal structures when compared against the target structures using a specialized matcher.  Four models are evaluated: DDPM, DDIM, and CFM (with both normal and uniform noise distributions). The results show that the DDIM model outperforms the others, achieving the highest accuracy of 82%.", "section": "6 Experiment Results"}, {"figure_path": "I3kIEjoON6/tables/tables_6_2.jpg", "caption": "Table 2: Validation metrics on modification task", "description": "This table presents the validation accuracy achieved by three different models on the crystal structure modification task.  The models are: Ordinary Model, Diffusion model, and Conditional Flow Matching (CFM).  The accuracy is a measure of how well the generated structures match the target structures using the Pymatgen StructureMatcher.  The results show that the Ordinary Model has the highest accuracy at 41.48%.", "section": "6 Experiment Results"}, {"figure_path": "I3kIEjoON6/tables/tables_8_1.jpg", "caption": "Table 3: Inference results. Each matrix element corresponds to either the minimal energy above the hull achieved in an experiment or the energy above the hull of structures with energies below the hull.", "description": "This table presents the results of inference experiments conducted using two different models (Diffusion and Flow-Matching) under various conditions. For each model, three different sets of formation energy conditions were tested (energy step = 0.01, energy gap = 0; energy step = 0.1, energy gap = 0; energy step = 0.01, energy gap = 1), and three chemical compositions were considered (Ta1W1B6, Ta1W2B5, Ta2W1B5). The values in the table represent the minimum energy (in meV/atom) above the convex hull that was achieved in each experiment, indicating the relative stability of generated structures. Negative values indicate structures with energy below the convex hull, suggesting potential stability.", "section": "7 Inference"}]