[{"figure_path": "Ex3rPvEct8/figures/figures_1_1.jpg", "caption": "Figure 1: Reference-based vs. reference-free scores on two datasets of Stable Diffusion XL generated elephant images. FID, Recall, and Coverage scores (colored orange) are reference-based, whereas VENDI and RKE scores (colored blue) are reference-free. Inception.V3 is used as the backbone embedding. Reference-based metrics use 'Indian elephant' samples in ImageNet as reference data.", "description": "This figure compares reference-based and reference-free evaluation metrics for Stable Diffusion XL-generated elephant images.  Two datasets are shown: one with \"regular\" elephants and one with colored elephants.  Reference-based metrics (FID, Recall, Coverage) use ImageNet's Indian elephant images as a reference, while reference-free metrics (VENDI, RKE) assess diversity without a reference set.  The figure demonstrates a discrepancy between reference-based and reference-free scores, particularly in the colored elephant dataset where reference-free metrics show substantially higher diversity despite comparable reference-based scores.", "section": "1 Introduction"}, {"figure_path": "Ex3rPvEct8/figures/figures_7_1.jpg", "caption": "Figure 2: RFF-based identified clusters used in FKEA Evaluation in single-colored MNIST [46] dataset with pixel embedding, Fourier feature dimension 2r = 4000 and bandwidth σ = 7. The graphs indicate increase in FKEA RKE/VENDI diversity metrics with increasing number of labels.", "description": "This figure shows the top 10 modes identified by FKEA in a single-colored MNIST dataset.  Each mode represents a cluster of similar images.  The plots show how the reference-free diversity metrics (RKE and VENDI) increase as the number of labels (i.e., the number of distinct digit classes present in the generated samples) increases.  The images in each mode illustrate the types of digits that are grouped together by the algorithm.", "section": "6 Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_8_1.jpg", "caption": "Figure 2: RFF-based identified clusters used in FKEA Evaluation in single-colored MNIST [46] dataset with pixel embedding, Fourier feature dimension 2r = 4000 and bandwidth σ = 7. The graphs indicate increase in FKEA RKE/VENDI diversity metrics with increasing number of labels.", "description": "This figure demonstrates the results of applying the Fourier-based Kernel Entropy Approximation (FKEA) method to the single-colored MNIST dataset.  The method identifies clusters within the data based on the eigenvectors of a proxy kernel matrix calculated using random Fourier features.  The figure shows the top 10 identified clusters (modes) and plots showing how the FKEA-based RKE and VENDI diversity metrics increase with the number of labels (classes) in the dataset.  This illustrates the scalability and interpretability of FKEA in evaluating the diversity of generated samples.", "section": "6 Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_8_2.jpg", "caption": "Figure 4: FKEA metrics behavior under different truncation factor ψ of StyleGAN3 [47] generated FFHQ samples.", "description": "This figure shows how FKEA metrics (FKEA-VENDI-1.0, FKEA-VENDI-1.5, and FKEA-RKE) change with different truncation factors (ψ) applied to StyleGAN3 generated FFHQ samples.  The plots illustrate the increasing trend of the scores with increasing truncation factor values, indicating how this parameter affects the diversity assessment by FKEA. The image grids below the plots show samples from the top clusters with the highest scores for each truncation factor, giving a visual representation of the clustering behavior. ", "section": "6 Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_9_1.jpg", "caption": "Figure 2: RFF-based identified clusters used in FKEA Evaluation in single-colored MNIST [46] dataset with pixel embedding, Fourier feature dimension 2r = 4000 and bandwidth σ = 7. The graphs indicate increase in FKEA RKE/VENDI diversity metrics with increasing number of labels.", "description": "This figure visualizes the clusters identified by the Fourier-based Kernel Entropy Approximation (FKEA) method in a single-colored version of the MNIST dataset.  The FKEA method uses random Fourier features to approximate the kernel matrix, making it computationally efficient for large datasets.  The plots in the figure show the increase in the RKE and VENDI diversity metrics as the number of labels increases.  The identified modes, or clusters, are visually represented, demonstrating how FKEA groups similar images together.", "section": "6 Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_9_2.jpg", "caption": "Figure 2: RFF-based identified clusters used in FKEA Evaluation in single-colored MNIST [46] dataset with pixel embedding, Fourier feature dimension 2r = 4000 and bandwidth σ = 7. The graphs indicate increase in FKEA RKE/VENDI diversity metrics with increasing number of labels.", "description": "This figure shows the top 10 modes identified by the FKEA method in a single-colored MNIST dataset.  Each mode represents a cluster of similar images. The RFF (Random Fourier Features) method was used with 4000 features and a bandwidth of 7. As the number of labels (representing different digits) increases, the diversity metrics (RKE and VENDI) also increase, indicating that the model generates more diverse images.", "section": "6 Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_18_1.jpg", "caption": "Figure 7: RFF-based identified clusters used in FKEA Evaluation in ImageNet dataset with DinoV2 embeddings and bandwidth σ = 25 at varying number of samples n", "description": "This figure shows the top 4 clusters identified by the Fourier-based Kernel Entropy Approximation (FKEA) method on the ImageNet dataset using DinoV2 embeddings and a Gaussian kernel with bandwidth σ = 25.  The results are displayed for four different sample sizes: 10k, 50k, 100k, and 250k. The images within each cluster visually represent the types of images that are grouped together by the algorithm. As the number of samples increases, the clusters become more coherent and the algorithm's ability to group similar images improves, demonstrating the scalability of the FKEA method.", "section": "6 Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_19_1.jpg", "caption": "Figure 2: RFF-based identified clusters used in FKEA Evaluation in single-colored MNIST [46] dataset with pixel embedding, Fourier feature dimension 2r = 4000 and bandwidth σ = 7. The graphs indicate increase in FKEA RKE/VENDI diversity metrics with increasing number of labels.", "description": "This figure visualizes the top 10 modes identified by the Fourier-based Kernel Entropy Approximation (FKEA) method in a single-colored MNIST dataset.  It shows how the FKEA method identifies clusters of similar images (modes), and demonstrates that the diversity metrics (RKE and VENDI) increase as the number of distinct image classes (labels) in the dataset grows. Each mode displays a representative set of images belonging to that specific cluster, highlighting the method's ability to capture and quantify the diversity of generated samples.", "section": "6 Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_20_1.jpg", "caption": "Figure 8: RFF-based identified clusters used in FKEA Evaluation in FFHQ dataset with DinoV2 embeddings and bandwidth σ = 20", "description": "This figure shows the top 8 clusters identified by the Fourier-based Kernel Entropy Approximation (FKEA) method in the FFHQ dataset.  The FKEA method uses random Fourier features to efficiently approximate the kernel covariance matrix, enabling scalable evaluation of generative models. Each cluster represents a mode identified by FKEA and showcases a set of images belonging to that mode. The images illustrate the diversity of generated samples that fall into each of the identified clusters in the FFHQ dataset. DinoV2 embeddings and a bandwidth (σ) of 20 were used in the FKEA evaluation.", "section": "Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_20_2.jpg", "caption": "Figure 2: RFF-based identified clusters used in FKEA Evaluation in single-colored MNIST [46] dataset with pixel embedding, Fourier feature dimension 2r = 4000 and bandwidth σ = 7. The graphs indicate increase in FKEA RKE/VENDI diversity metrics with increasing number of labels.", "description": "This figure shows the top 10 modes identified by FKEA in a single-colored MNIST dataset.  Each mode represents a cluster of similar images.  The graphs illustrate how the RKE and VENDI diversity scores increase as the number of distinct digit labels in the dataset grows, demonstrating that FKEA can effectively capture and quantify the diversity of generated data.", "section": "6 Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_21_1.jpg", "caption": "Figure 7: RFF-based identified clusters used in FKEA Evaluation in ImageNet dataset with DinoV2 embeddings and bandwidth σ = 25 at varying number of samples n", "description": "This figure shows the top 4 modes identified by FKEA in the ImageNet dataset using DinoV2 embeddings and a Gaussian kernel with bandwidth σ = 25.  Each mode represents a cluster of images with similar visual characteristics. The figure demonstrates the effect of the number of samples (n) on the quality and distinctness of these clusters, illustrating improved cluster separation with larger sample sizes.", "section": "6 Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_21_2.jpg", "caption": "Figure 11: RFF-based identified clusters used in FKEA Evaluation in FASHION-MNIST [50] dataset with pixel embeddings and bandwidth σ = 15.", "description": "This figure shows the top 8 clusters identified by the Fourier-based Kernel Entropy Approximation (FKEA) method on the Fashion-MNIST dataset.  Each cluster represents a distinct mode identified by FKEA, visually demonstrating the diversity of the generated samples according to the method.  The use of pixel embeddings and a bandwidth (σ) of 15 are specified parameters of the FKEA process for this dataset. ", "section": "C.1 Real Image Dataset Modes"}, {"figure_path": "Ex3rPvEct8/figures/figures_23_1.jpg", "caption": "Figure 2: RFF-based identified clusters used in FKEA Evaluation in single-colored MNIST [46] dataset with pixel embedding, Fourier feature dimension 2r = 4000 and bandwidth σ = 7. The graphs indicate increase in FKEA RKE/VENDI diversity metrics with increasing number of labels.", "description": "This figure shows the top 10 modes identified by FKEA in a single-colored MNIST dataset.  Each mode represents a cluster of similar images. The figure demonstrates that as the number of labels (i.e., the number of distinct digit classes considered) increases, the FKEA-based RKE and VENDI diversity scores also increase, indicating that the model generates more diverse samples.  The visualizations help illustrate how FKEA identifies modes (clusters) in the data.", "section": "6 Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_23_2.jpg", "caption": "Figure 2: RFF-based identified clusters used in FKEA Evaluation in single-colored MNIST [46] dataset with pixel embedding, Fourier feature dimension 2r = 4000 and bandwidth σ = 7. The graphs indicate increase in FKEA RKE/VENDI diversity metrics with increasing number of labels.", "description": "This figure visualizes the top 10 modes identified by the Fourier-based Kernel Entropy Approximation (FKEA) method on a single-colored version of the MNIST dataset.  The visualization shows the identified image clusters for each mode, indicating that FKEA captures distinct visual patterns.  The accompanying plots illustrate a trend of increasing diversity metrics (RKE and VENDI) as the number of labels increases, suggesting that FKEA effectively captures the diversity of the generated data. Pixel embeddings were used, along with a Fourier feature dimension of 4000 and a bandwidth of 7.", "section": "6 Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_24_1.jpg", "caption": "Figure 2: RFF-based identified clusters used in FKEA Evaluation in single-colored MNIST [46] dataset with pixel embedding, Fourier feature dimension 2r = 4000 and bandwidth σ = 7. The graphs indicate increase in FKEA RKE/VENDI diversity metrics with increasing number of labels.", "description": "This figure shows the top 10 modes identified by FKEA in the colored MNIST dataset. Each mode represents a cluster of similar images. The number of labels increases from 2 to 10, showing how the diversity metrics (RKE and VENDI) increase with the number of distinct clusters.", "section": "6 Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_24_2.jpg", "caption": "Figure 2: RFF-based identified clusters used in FKEA Evaluation in single-colored MNIST [46] dataset with pixel embedding, Fourier feature dimension 2r = 4000 and bandwidth σ = 7. The graphs indicate increase in FKEA RKE/VENDI diversity metrics with increasing number of labels.", "description": "This figure shows the top 10 modes identified by the FKEA method in a single-colored MNIST dataset.  Each mode represents a cluster of similar images, and the figure demonstrates how the diversity metrics (RKE and VENDI) increase as the number of distinct image classes (labels) increases.  The results visually showcase how the FKEA method successfully identifies and separates distinct clusters of images based on visual characteristics.", "section": "6 Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_25_1.jpg", "caption": "Figure 7: RFF-based identified clusters used in FKEA Evaluation in ImageNet dataset with DinoV2 embeddings and bandwidth σ = 25 at varying number of samples n.", "description": "This figure shows the top 4 modes identified by FKEA in the ImageNet dataset using DinoV2 embeddings and a Gaussian kernel with a bandwidth of 25.  It demonstrates how the quality of the identified clusters improves as the number of samples (n) increases, progressing from noisy and merged clusters at n=10k to more coherent and meaningful clusters at n=250k. This highlights the importance of sample size for accurate entropy estimation using FKEA.", "section": "6 Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_25_2.jpg", "caption": "Figure 7: RFF-based identified clusters used in FKEA Evaluation in ImageNet dataset with DinoV2 embeddings and bandwidth σ = 25 at varying number of samples n", "description": "This figure shows the top 4 modes identified by the FKEA method in the ImageNet dataset using DinoV2 embeddings and a Gaussian kernel with bandwidth σ = 25.  It demonstrates the impact of the number of samples (n) on the quality and coherence of the resulting clusters.  As the number of samples increases from 10k to 250k, the clusters become increasingly refined and semantically meaningful, highlighting the scalability of the FKEA approach for large datasets.", "section": "6 Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_26_1.jpg", "caption": "Figure 19: Summary of diversity convergence with r = 12000 and sample size n = 20000.", "description": "This figure displays the convergence behavior of diversity metrics (VENDI and RKE, both with and without FKEA approximation) across various text and image embeddings.  The left panels show results for different text embeddings (text-embedding-3-large, text-embedding-3-small, Gemini, BERT) on a synthetic dataset with an increasing number of countries. The right panels showcase similar results for different image embeddings (DinoV2, CLIP, InceptionV3, SwAV) on the ImageNet dataset with an increasing number of classes.  The plots illustrate how the diversity metrics evolve as the number of data samples increases, demonstrating the convergence properties of the FKEA method.", "section": "6 Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_26_2.jpg", "caption": "Figure 19: Summary of diversity convergence with r = 12000 and sample size n = 20000.", "description": "This figure displays the convergence behavior of diversity metrics (VENDI-1.0, FKEA-VENDI-1.0, RKE, and FKEA-RKE) across different embedding spaces (DinoV2, CLIP, InceptionV3, and SwAV) and datasets (synthetic countries and ImageNet). The x-axis represents the number of classes, while the y-axis shows the diversity score. The plots illustrate how the diversity scores converge as the number of classes increases, demonstrating the scalability of FKEA across various embedding spaces and datasets.", "section": "6 Numerical Results"}, {"figure_path": "Ex3rPvEct8/figures/figures_28_1.jpg", "caption": "Figure 2: RFF-based identified clusters used in FKEA Evaluation in single-colored MNIST [46] dataset with pixel embedding, Fourier feature dimension 2r = 4000 and bandwidth σ = 7. The graphs indicate increase in FKEA RKE/VENDI diversity metrics with increasing number of labels.", "description": "This figure shows the results of applying the Fourier-based Kernel Entropy Approximation (FKEA) method to the single-colored MNIST dataset.  The FKEA method identifies clusters within the data and calculates diversity scores (RKE and VENDI). The graphs demonstrate that as the number of labels (classes) increases, so does the diversity, indicating that the FKEA method effectively captures the diversity of generated data.", "section": "6 Numerical Results"}]