[{"figure_path": "SXy1nVGyO7/figures/figures_7_1.jpg", "caption": "Figure 1: Visual results on synthetic data for reconstruction and prediction performances.", "description": "The figure displays visual results comparing the performance of three different models (APHYNITY, Hybrid-VAE, and Meta-Hybrid-VAE) on two synthetic datasets: Forced Damped Pendulum and Double Pendulum.  For each dataset, the figure shows two subplots: reconstruction and generation. The reconstruction subplots show the model's ability to reconstruct the observed data, while the generation subplots show the model's ability to generate new data points. The ground truth data is also included for comparison. The purpose of the figure is to show visually that even when the reconstruction performance is similar across the models, the new Meta-Hybrid-VAE model significantly outperforms the other models in prediction tasks by generating trajectories closer to the ground truth.", "section": "6.1 Results on Synthetic Data"}, {"figure_path": "SXy1nVGyO7/figures/figures_8_1.jpg", "caption": "Figure 2: (Left) The performance of predictions over longer time domains; (Right) A visual example of forced damped pendulum system. The dark part is the training time domain, and the light part is the time domain outside training (longer time domain).", "description": "This figure visualizes the prediction performance of three different models (APHYNITY, Hybrid-VAE, and Meta-Hybrid-VAE) on three different datasets (Forced Damped Pendulum, Advection-Diffusion System, and Double Pendulum) over extended time periods. The left panel shows the MSE (Mean Squared Error) for each model across the three datasets, demonstrating the performance degradation as the prediction horizon extends beyond the training data. The right panel shows a visual representation of these prediction results on the Forced Damped Pendulum dataset, highlighting the performance differences of the models.", "section": "6.1 Results on Synthetic Data"}, {"figure_path": "SXy1nVGyO7/figures/figures_8_2.jpg", "caption": "Figure 3: (left) Results of OOD; (right) Results of the condition for identifiability.", "description": "This figure presents results regarding out-of-distribution (OOD) performance and the verification of the condition for identifiability.  The left panel shows a bar chart comparing the performance of three models (APHYNITY, Hybrid-VAE, and Meta-Hybrid-VAE) in both in-distribution (ID) and OOD settings, focusing on MSE of the physics latent variables (zp) and MCC of the abstract latent variables (zn).  The right panel displays a line chart illustrating the relationship between the MCC metric and the number of tasks in the meta-learning process.  This empirically verifies the theoretical condition for identifiability, showing a clear increase in MCC as the number of tasks reaches a threshold.", "section": "6 Experiments and Results"}, {"figure_path": "SXy1nVGyO7/figures/figures_9_1.jpg", "caption": "Figure 1: Visual results on synthetic data for reconstruction and prediction performances.", "description": "This figure compares the reconstruction and prediction performance of three different models (APHYNITY, Hybrid-VAE, and Meta-Hybrid-VAE) on synthetic datasets. The top row shows the ground truth data, while the subsequent rows display the results from each model.  The left-hand side shows reconstruction performance, where the models attempt to reconstruct observed data points. The right-hand side shows prediction performance, where the models attempt to predict data points outside the training domain. The models are evaluated across three different datasets: Forced Damped Pendulum, Double Pendulum, and Advection-Diffusion System.  The figure visually demonstrates that the Meta-Hybrid-VAE model shows superior prediction performance compared to the other models, especially for more complex systems like the Double Pendulum.", "section": "6.1 Results on Synthetic Data"}, {"figure_path": "SXy1nVGyO7/figures/figures_15_1.jpg", "caption": "Figure 5: Visual samples of learned latent variables between different runs.", "description": "This figure visualizes the learned latent variables from two different runs of the Hybrid-VAE and Meta-Hybrid-VAE models.  The top row shows the results for the Hybrid-VAE, while the bottom row shows the results for the Meta-Hybrid-VAE. Each column represents a different latent variable (Zp, ZN1, ZN2, ZN3). The plots show the relationship between the learned latent variables across the two different runs. The goal is to show the differences in the identifiability of the latent variables between the two models, with the Meta-Hybrid-VAE showing a clearer and more consistent relationship across different runs, indicating better identifiability.", "section": "6.1 Results on Synthetic Data"}]