[{"figure_path": "5tIG2KZogL/tables/tables_9_1.jpg", "caption": "Table 1: Accuracy and runtime comparison on real-world data. Each cell represents mean ± standard error across 100 trials.", "description": "This table compares the performance of different Kernel Ridge Regression methods on two real-world datasets: California Housing and SUSY.  The metrics presented are Mean Squared Error (MSE), training time, and prediction time.  The methods compared include the full KRR, standard-thinned KRR, RPCHOLESKY, and the proposed KT-KRR. The results show that KT-KRR achieves a good balance between accuracy and computational efficiency.", "section": "5 Experimental results"}, {"figure_path": "5tIG2KZogL/tables/tables_9_2.jpg", "caption": "Table 1: Accuracy and runtime comparison on real-world data. Each cell represents mean ± standard error across 100 trials.", "description": "This table compares the performance of different Kernel Ridge Regression (KRR) methods on two real-world datasets: California Housing and SUSY.  The methods compared include FULL-KRR (the standard KRR), ST-KRR (standard thinning), RPCHOLESKY-KRR (using the RPCHOLESKY algorithm for coreset selection), and KT-KRR (the proposed method using Kernel Thinning). The table shows the test error (in percentage) and the training time (in seconds) for each method.  The results demonstrate the computational efficiency of KT-KRR compared to FULL-KRR, while maintaining competitive accuracy.", "section": "5.2 Real data experiments"}, {"figure_path": "5tIG2KZogL/tables/tables_12_1.jpg", "caption": "Table 1: Accuracy and runtime comparison on real-world data. Each cell represents mean ± standard error across 100 trials.", "description": "This table compares the performance of different kernel ridge regression methods on two real-world datasets: California Housing and SUSY.  The metrics reported are Mean Squared Error (MSE) for regression and Test Error for classification, along with training and prediction times. The methods compared include the full kernel ridge regression (FULL-KRR), standard thinning based KRR (ST-KRR), RPCHOLESKY-KRR, and the proposed kernel-thinned KRR (KT-KRR).  The table demonstrates the computational efficiency of KT-KRR while maintaining competitive accuracy compared to other methods.", "section": "5 Experimental results"}, {"figure_path": "5tIG2KZogL/tables/tables_12_2.jpg", "caption": "Table 1: Accuracy and runtime comparison on real-world data. Each cell represents mean ± standard error across 100 trials.", "description": "This table compares the performance of different kernel ridge regression methods on two real-world datasets: California Housing and SUSY.  The metrics reported include Mean Squared Error (MSE) for regression and Test Error for classification. Training and prediction times are also provided to illustrate the computational efficiency of each method.  The results demonstrate the trade-off between accuracy and runtime for various approaches, highlighting the effectiveness of the proposed KT-KRR method in balancing both.", "section": "5 Experimental results"}]