[{"figure_path": "tAlMAcqK9s/figures/figures_3_1.jpg", "caption": "Figure 1: Error vs sample complexity for the theoretically hard instance (See Sec. E).", "description": "This figure shows the error rate (y-axis) of three different closeness testing algorithms plotted against the number of samples used (x-axis). The three algorithms are: the standard closeness tester, the augmented closeness tester (the algorithm proposed in the paper), and the CRS'15 algorithm (an existing algorithm that uses very accurate predictions).  The graph demonstrates the superior performance of the augmented tester, particularly at lower sample counts.  The CRS'15 algorithm shows consistently high error, indicating a lack of robustness to less-than-perfect predictions.", "section": "Our empirical Results"}, {"figure_path": "tAlMAcqK9s/figures/figures_21_1.jpg", "caption": "Figure 2: A diagram indicating the valid answer for the augmented tester A based on the total variation distances of p from q and p̂ assuming d ≤ α. The standard tester requires to output accept if p = q, the green dot, and reject if ||p - q||TV ≥ ε, the red shaded region, with high probability. In addition, the augmented tester may output inaccurate information for when ||p - q||TV ≥ ε and ||p - p̂||TV ≥ α.", "description": "This figure illustrates the decision boundaries for an augmented tester (A) in a hypothesis testing problem concerning two distributions, p and q.  The total variation distance between the true distribution p and the predicted distribution p̂ is denoted as d. The parameter α represents the suggested accuracy level of the prediction and ε represents the minimum distance for which the algorithm can conclusively state that p and q are different. The figure shows that if the predicted distribution p̂ is within α distance of p, and p is equal to q, then the tester will output 'accept'. If p and q are more than ε apart, the algorithm will output 'reject'. If the prediction is not accurate enough, the algorithm might output 'inaccurate information'.", "section": "C.2 Lower bound for uniformity testing when a ≥ d"}, {"figure_path": "tAlMAcqK9s/figures/figures_23_1.jpg", "caption": "Figure 2: A diagram indicating the valid answer for the augmented tester A based on the total variation distances of p from q and p̂ assuming d ≤ α. The standard tester requires to output accept if p = q, the green dot, and reject if ||p - q||TV ≥ ε, the red shaded region, with high probability. In addition, the augmented tester may output inaccurate information for when ||p - q||TV ≥ ε and ||p - p̂||TV ≥ α.", "description": "This figure illustrates the valid answers for an augmented tester A in the identity testing problem.  The green dot represents the case where p = q, requiring an 'accept' output from the standard tester. The red shaded area shows where ||p - q||TV ≥ ε, and 'reject' is the required output from the standard tester.  The augmented tester's additional 'inaccurate information' output is shown. The constraints on valid outputs are driven by total variation distances between distributions (p, q, and p̂).", "section": "C.2 Lower bound for uniformity testing when a ≥ d"}, {"figure_path": "tAlMAcqK9s/figures/figures_30_1.jpg", "caption": "Figure 4: A visualization of p, p⁺, and p¯.", "description": "This figure visualizes three distributions: p, p⁺, and p⁻ over the domain [n].  The distribution p is uniform with a probability mass of 1/n for each element. p⁺ and p⁻ are constructed by modifying p. They have probability mass λlarge  on their first l elements (set L)  and λsmall on the rest (n-l) elements. p⁺ assigns a probability mass of (1+e')λsmall to the elements of L1,  and (1-e')λsmall to the elements of L2.  p⁻ assigns probability mass (1-e')λsmall to the elements of L1, and (1+e')λsmall to elements of L2.  The visualization uses a step function to represent probability masses, clearly showing how p⁺ and p⁻ deviate from the uniform distribution p.", "section": "C.3 Lower bound for uniformity testing when a < d"}, {"figure_path": "tAlMAcqK9s/figures/figures_34_1.jpg", "caption": "Figure 5: Error as a function of prediction quality for the ‘Hard Instance’ dataset", "description": "This figure shows the performance of the augmented tester algorithm on a synthetic dataset called ‘Hard Instance’ with varying prediction quality.  The x-axis represents the total variation distance between the true distribution and the prediction (||p - p̂||tv). The y-axis shows the percentage error of the augmented tester. As the prediction quality decreases (||p - p̂||tv increases), the error rate of the augmented tester increases, indicating that the algorithm's performance degrades with poorer predictions. However, even with relatively poor prediction quality, the augmented tester still outperforms the standard closeness tester.", "section": "E Empirical Evaluation"}, {"figure_path": "tAlMAcqK9s/figures/figures_34_2.jpg", "caption": "Figure 6: Additional figures for the ‘Hard Instance’ dataset", "description": "This figure compares the empirical distributions of the estimator Z from the augmented and unaugmented closeness testers for the hard instance dataset.  The left panel (a) shows the distribution of Z for the augmented tester, while the right panel (b) displays the distribution of Z from the unaugmented tester.  In both panels, purple bars represent the case where p=q, and green bars represent the case where ||p-q||tv ≥ 1/2.  The figure visually demonstrates the improved separation of the estimator Z in the two hypotheses for the augmented tester compared to the standard tester.", "section": "Empirical Evaluation"}, {"figure_path": "tAlMAcqK9s/figures/figures_35_1.jpg", "caption": "Figure 7: Results for the IP dataset", "description": "The figure shows the performance comparison of three algorithms on the IP dataset, focusing on error rate against the number of samples. The algorithms include the Closeness Tester (standard approach without prediction), the Augmented Tester (the proposed algorithm leveraging predictions), and CRS '15 (a state-of-the-art algorithm assuming almost-perfect predictions). Subfigure (a) presents the error rate vs. the number of samples. Subfigure (b) compares the performance of the Augmented Tester using two different predictors, p1 and p2, which vary in their accuracy. The results demonstrate the Augmented Tester's improved efficiency and robustness compared to the baselines.", "section": "Empirical Evaluation"}]