[{"figure_path": "tAlMAcqK9s/tables/tables_3_1.jpg", "caption": "Table 1: Optimal sample complexity bounds in the standard model versus the augmented bounds. a is the suggested accuracy level for the L₁-distance between p and p. d denotes the total variation distance between the known distribution q and p.", "description": "This table summarizes the sample complexities for closeness, identity, and uniformity testing in both standard and augmented settings. The standard setting assumes no prediction is available, while the augmented setting leverages a predicted distribution. The table highlights the optimal improvements in sample complexity achieved in the augmented setting, depending on the quality of the prediction, as measured by the total variation distance between the true and predicted distributions.", "section": "Our empirical Results"}, {"figure_path": "tAlMAcqK9s/tables/tables_17_1.jpg", "caption": "Table 1: Optimal sample complexity bounds in the standard model versus the augmented bounds. a is the suggested accuracy level for the L₁-distance between p and p. d denotes the total variation distance between the known distribution q and p.", "description": "This table summarizes the sample complexities for closeness, identity, and uniformity testing in both standard and augmented settings.  The standard setting assumes no prediction is available. The augmented setting leverages a predicted distribution, and its performance is parameterized by the total variation distance (a) between the true and predicted distributions. The table shows that the augmented algorithms achieve optimal sample complexity improvements that directly depend on the quality of the prediction.", "section": "Our empirical Results"}, {"figure_path": "tAlMAcqK9s/tables/tables_37_1.jpg", "caption": "Table 1: Optimal sample complexity bounds in the standard model versus the augmented bounds. a is the suggested accuracy level for the L₁-distance between p and p. d denotes the total variation distance between the known distribution q and p.", "description": "This table compares the sample complexities required for closeness, identity, and uniformity testing in two settings: the standard setting (without prediction) and the augmented setting (with prediction).  It shows how the augmented setting's sample complexity depends on the quality of the prediction (measured by the total variation distance between the true distribution and its prediction) and the suggested accuracy level.", "section": "Our empirical Results"}]