[{"figure_path": "iYkhThIXG1/tables/tables_7_1.jpg", "caption": "Table 1: Comparison of Average and Worst-Group Accuracy Across Different Baseline Methods for Toxicity Classification. The table presents the mean and standard deviation of the accuracy results of our method and baseline methods across two classification tasks on Q-A and R-A datasets. Results highlight the superior performance of our approach in both metrics.", "description": "This table compares the performance of the proposed method against several baseline methods for toxicity classification.  Two metrics are used: average accuracy and worst-group accuracy, calculated across different groups within the datasets. The Q-A and R-A datasets represent question and response classification tasks, respectively. The results show that the proposed method significantly outperforms the baselines in both average and worst-group accuracy, indicating its robustness and effectiveness.", "section": "4.2 Main Results"}, {"figure_path": "iYkhThIXG1/tables/tables_8_1.jpg", "caption": "Table 1: Comparison of Average and Worst-Group Accuracy Across Different Baseline Methods for Toxicity Classification. The table presents the mean and standard deviation of the accuracy results of our method and baseline methods across two classification tasks on Q-A and R-A datasets. Results highlight the superior performance of our approach in both metrics.", "description": "This table compares the performance of the proposed method against several baseline methods for toxicity classification using two datasets (Q-A and R-A).  It shows the average accuracy and the worst-group accuracy (the lowest accuracy among all groups) for each method.  The results demonstrate the effectiveness of the proposed approach in improving both overall accuracy and the performance for less well-represented groups.", "section": "4.2 Main Results"}, {"figure_path": "iYkhThIXG1/tables/tables_9_1.jpg", "caption": "Table 1: Comparison of Average and Worst-Group Accuracy Across Different Baseline Methods for Toxicity Classification. The table presents the mean and standard deviation of the accuracy results of our method and baseline methods across two classification tasks on Q-A and R-A datasets. Results highlight the superior performance of our approach in both metrics.", "description": "This table compares the performance of the proposed method against several baseline methods for toxicity classification on two datasets (Q-A and R-A).  It shows the average accuracy and worst-group accuracy (a measure of robustness) for each method. The results demonstrate the superior performance of the proposed approach.", "section": "4.2 Main Results"}, {"figure_path": "iYkhThIXG1/tables/tables_17_1.jpg", "caption": "Table 1: Comparison of Average and Worst-Group Accuracy Across Different Baseline Methods for Toxicity Classification.", "description": "This table compares the performance of the proposed method against several baseline methods for toxicity classification.  It presents the average accuracy and worst-group accuracy (the lowest accuracy across different subgroups) for both question and response classification tasks. The results show the effectiveness of the proposed method in achieving high accuracy while mitigating the impact of out-of-distribution data.", "section": "4.2 Main Results"}, {"figure_path": "iYkhThIXG1/tables/tables_20_1.jpg", "caption": "Table 1: Comparison of Average and Worst-Group Accuracy Across Different Baseline Methods for Toxicity Classification. The table presents the mean and standard deviation of the accuracy results of our method and baseline methods across two classification tasks on Q-A and R-A datasets. Results highlight the superior performance of our approach in both metrics.", "description": "This table compares the performance of the proposed method against several baseline methods for toxicity classification.  It shows the average and worst-group accuracy (with standard deviations) for two different tasks (question and response classification) on two datasets (Q-A and R-A).  The results demonstrate the effectiveness of the proposed approach in improving both overall accuracy and robustness across various groups.", "section": "4.2 Main Results"}, {"figure_path": "iYkhThIXG1/tables/tables_20_2.jpg", "caption": "Table 1: Comparison of Average and Worst-Group Accuracy Across Different Baseline Methods for Toxicity Classification.", "description": "This table presents the performance comparison of the proposed method against several baseline methods for toxicity classification.  The metrics used are average accuracy (the mean accuracy across all groups) and worst-group accuracy (the lowest accuracy across all groups), providing a comprehensive assessment of model robustness and generalizability.  The results show how the proposed method outperforms existing methods in terms of both average and worst-group accuracy, demonstrating its effectiveness in handling various data distributions and mitigating the impact of spurious correlations.", "section": "4.2 Main Results"}, {"figure_path": "iYkhThIXG1/tables/tables_21_1.jpg", "caption": "Table 1: Comparison of Average and Worst-Group Accuracy Across Different Baseline Methods for Toxicity Classification. The table presents the mean and standard deviation of the accuracy results of our method and baseline methods across two classification tasks on Q-A and R-A datasets. Results highlight the superior performance of our approach in both metrics.", "description": "This table compares the average and worst-group accuracy of the proposed method against several baseline methods for toxicity classification.  The comparison is done across two datasets (Q-A and R-A) using two different metrics: average accuracy and worst-group accuracy. The results demonstrate the superior performance of the proposed method compared to existing methods, highlighting its ability to handle data distribution shifts.", "section": "4.2 Main Results"}, {"figure_path": "iYkhThIXG1/tables/tables_22_1.jpg", "caption": "Table 8: Comparison of accuracy using different methods on the public HateXplain dataset.", "description": "This table presents the results of the toxicity classification task on the HateXplain dataset.  It compares the performance of the proposed method against several baseline methods, including methods based on different label integration strategies. The metrics used for comparison are average accuracy and worst-group accuracy, offering a comprehensive assessment of the model's performance across various subgroups within the data.", "section": "4.2 Main Results"}, {"figure_path": "iYkhThIXG1/tables/tables_22_2.jpg", "caption": "Table 9: Time complexity comparison of different methods on all datasets. We report the GPU hours of each experiment with one A100 80GB GPU.", "description": "This table presents the GPU hours required to train the toxicity classifier using different methods on three datasets: Question Dataset, Response Dataset, and HateXplain Dataset. It compares the computational efficiency of various approaches by showing the time taken for model training. The results reflect that different methods have different time complexities.", "section": "4. Evaluation"}]