[{"figure_path": "h6nSE8AWCT/figures/figures_1_1.jpg", "caption": "Figure 1: Illustration of compositional misalignment: (a) Results of current human image animation models [33, 31] on samples in compositional misalignment of human shapes between reference and target. (b) Sensitivity analysis according to variation of compositional misalignment by scaling and rotating (MA: MagicAnimate).", "description": "This figure shows the impact of compositional misalignment on human image animation.  (a) demonstrates that current methods struggle when the scale or rotation of the human in the reference image differs from that in the target pose.  Inconsistent results with varying fidelity are shown when scaling or rotating the reference image, and low fidelity is consistently observed when providing motion sequences with varying dynamic movements. (b) provides a sensitivity analysis showing the performance drop in terms of PSNR (Peak Signal-to-Noise Ratio) and IoU (Intersection over Union) as compositional misalignment (scaling and rotation) increases.", "section": "1 Introduction"}, {"figure_path": "h6nSE8AWCT/figures/figures_1_2.jpg", "caption": "Figure 2: Attention maps on the reference image corresponding to the target human shape (e.g., shoulder at blue point) according to denoising.", "description": "This figure shows how the attention mechanism of a diffusion model focuses on different parts of the reference image depending on the alignment between the target pose and reference image. When the shapes are aligned (top), the attention correctly focuses on the corresponding shoulder.  When misaligned (bottom), the attention is scattered across unrelated areas.", "section": "1 Introduction"}, {"figure_path": "h6nSE8AWCT/figures/figures_2_1.jpg", "caption": "Figure 3: Illustration of (a) current diffusion-based human image animation systems and (b) Test-time Procrustes Calibration (TPC) on top of these systems. The TPC can be applied to diffusion-based models in a model-agnostic manner, enhancing the fidelity and consistency of the output video.", "description": "This figure illustrates the architecture of a diffusion-based human image animation system (a) and how the proposed Test-time Procrustes Calibration (TPC) method is integrated into it (b). In (a), a reference image and a target pose are used as inputs for a diffusion model with a UNet architecture, generating an animation frame as output. In (b), a calibration branch is added using TPC, which generates a calibrated reference image latent feature, improving the model's ability to understand the correspondence between human shapes in the reference and target images. This enhances the overall quality of the generated animation by handling compositional misalignments.", "section": "3 Preliminary"}, {"figure_path": "h6nSE8AWCT/figures/figures_2_2.jpg", "caption": "Figure 3: Illustration of (a) current diffusion-based human image animation systems and (b) Test-time Procrustes Calibration (TPC) on top of these systems. The TPC can be applied to diffusion-based models in a model-agnostic manner, enhancing the fidelity and consistency of the output video.", "description": "This figure illustrates the architecture of a diffusion-based human image animation system with and without the proposed Test-time Procrustes Calibration (TPC).  Panel (a) shows a standard system where a reference image (x) and a target pose (pi) are fed into an encoder (Enc), which generates latent features (z) used to condition a diffusion model (UNet) that produces the animated frame (yi).  Panel (b) shows the enhanced system incorporating TPC.  A calibration branch, processing the reference image through the TPC module, adds a calibrated latent feature (ci) to the conditioning input, improving the accuracy and stability of the animation despite variations in the composition of the reference and target images.", "section": "Method"}, {"figure_path": "h6nSE8AWCT/figures/figures_2_3.jpg", "caption": "Figure 4: Conceptual illustration of the effectiveness of TPC in terms of style and shape variation.", "description": "This figure conceptually illustrates how TPC improves the robustness of diffusion-based human image animation systems to compositional misalignment. Panel (a) shows the existing scenario without TPC where style and shape variations lead to low fidelity outputs when the reference and target human shapes are not well-aligned. In contrast, panel (b) demonstrates how TPC, by introducing a calibrated reference image, bridges the gap between reference and target shapes, enabling consistent high-fidelity animation outputs even under significant compositional misalignment.", "section": "4 Method"}, {"figure_path": "h6nSE8AWCT/figures/figures_4_1.jpg", "caption": "Figure 5: Illustration of Test-time Procrustes Calibration (TPC) on diffusion-based human image animation. TPC provides calibrated latent feature c to enhance shape correspondence between the reference image and target poses. Procrustes Warping aligns the reference image with the target pose shape, while Iterative Propagation improves temporal consistency among calibrated features.", "description": "This figure illustrates the proposed Test-time Procrustes Calibration (TPC) method for enhancing diffusion-based human image animation.  The process begins with a reference image and a target pose sequence. Procrustes Warping aligns the shapes in the reference image to match the target poses, creating a calibrated reference image.  This image is then processed by an iterative propagation module to ensure temporal consistency in the output animation. Finally, the calibrated latent features are fed into a diffusion model along with the original reference features to generate the final animated video. The figure shows the flow of data and the key components of the TPC method.", "section": "4 Method"}, {"figure_path": "h6nSE8AWCT/figures/figures_4_2.jpg", "caption": "Figure 6: Illustration of (a) pre-defined 17 keypoints and (b) keypoints in reference and target human, their common point set, and optimal set.", "description": "This figure shows the keypoints used in Procrustes Warping.  (a) depicts the 17 keypoints selected to represent human shape, numbered for reference.  (b) illustrates the process of selecting an optimal subset of keypoints for alignment.  The reference and target images both have sets of 17 keypoints identified; a common subset (X) is selected from these points, representing features visible in both images.  Further refinement selects the optimal subset (x*), focusing on the keypoints most crucial for accurate shape matching during the Procrustes alignment process.  This subset is used to reduce the influence of keypoints which differ between the reference and target images due to differences in pose or other factors, leading to a more precise alignment.", "section": "4.1 Procrustes Warping"}, {"figure_path": "h6nSE8AWCT/figures/figures_5_1.jpg", "caption": "Figure 7: Illustration of iterative propagation on calibrated latent features. It shows M groups on L frame calibrated features and updates features in each group with randomly selected ones during the denoising process.", "description": "This figure illustrates the iterative propagation process used in Test-time Procrustes Calibration (TPC).  The process enhances temporal consistency among calibrated latent features by grouping sequential features and updating all features within a group with a randomly selected feature from that group. This helps to maintain consistent visual correspondence between the reference image and the target pose sequence throughout the animation process, even when there's compositional misalignment between them. The process is applied during each denoising step of the diffusion model.", "section": "4.2 Iterative Propagation"}, {"figure_path": "h6nSE8AWCT/figures/figures_7_1.jpg", "caption": "Figure 8: Qualitative results about applying TPC on diffusion-based human image animation systems (i.e., MA: MagicAnimate, DisCo, AA: AnimateAnyone, DP: DreamPose) on cases about compositional misalignment of human shape between a reference image and target motion: Temporal misalignment by motion affecting factor rotation (top left) and scale (top right). Consistent misalignment affecting rotation (bottom left) and scale (bottom right). Calibrated images and predictions of compositional aligned samples are available in Appendix. Please see also video in the supplementary.", "description": "This figure demonstrates the effectiveness of Test-time Procrustes Calibration (TPC) in addressing compositional misalignment issues in human image animation. It showcases qualitative results comparing four different diffusion-based methods (MagicAnimate, DisCo, AnimateAnyone, DreamPose) with and without TPC applied. The results highlight how TPC improves the quality and consistency of generated animations, even when the reference image and target motion have misaligned composition (scale and rotation).", "section": "5.3 Experimental Results"}, {"figure_path": "h6nSE8AWCT/figures/figures_7_2.jpg", "caption": "Figure 1: Illustration of compositional misalignment: (a) Results of current human image animation models [33, 31] on samples in compositional misalignment of human shapes between reference and target. (b) Sensitivity analysis according to variation of compositional misalignment by scaling and rotating (MA: MagicAnimate).", "description": "This figure demonstrates the impact of compositional misalignment on human image animation.  Panel (a) shows examples of animation results from current models when the reference image and target pose have misaligned compositions (scale and rotation). The results show a decrease in fidelity and consistency. Panel (b) presents a quantitative sensitivity analysis illustrating the effect of scale and rotation differences on the performance of current models, measured as PSNR and IoU, showing that the models are sensitive to even small deviations from alignment.", "section": "1 Introduction"}, {"figure_path": "h6nSE8AWCT/figures/figures_8_1.jpg", "caption": "Figure 8: Qualitative results about applying TPC on diffusion-based human image animation systems (i.e., MA: MagicAnimate, DisCo, AA: AnimateAnyone, DP: DreamPose) on cases about compositional misalignment of human shape between a reference image and target motion: Temporal misalignment by motion affecting factor rotation (top left) and scale (top right). Consistent misalignment affecting rotation (bottom left) and scale (bottom right). Calibrated images and predictions of compositional aligned samples are available in Appendix. Please see also video in the supplementary.", "description": "This figure shows the qualitative results of applying Test-time Procrustes Calibration (TPC) to four different diffusion-based human image animation models.  It demonstrates the impact of TPC on handling compositional misalignments (differences in scale and rotation) between the reference image and target poses.  The examples illustrate how TPC improves the quality and consistency of the generated animations, particularly in challenging scenarios with significant misalignments.", "section": "5.3 Experimental Results"}, {"figure_path": "h6nSE8AWCT/figures/figures_8_2.jpg", "caption": "Figure 11: Comparisons of calibrated images using an affine transform and Procrustes transform.", "description": "This figure compares the results of applying an affine transformation versus a Procrustes transformation to calibrate reference images for human image animation.  It visually demonstrates how the Procrustes transformation, which accounts for scaling, rotation, and translation, achieves better alignment of human shapes than the affine transformation, leading to more accurate and consistent animation results. This highlights the effectiveness of the Procrustes method used in the TPC (Test-time Procrustes Calibration) approach described in the paper.", "section": "Ablation Study"}, {"figure_path": "h6nSE8AWCT/figures/figures_13_1.jpg", "caption": "Figure 8: Qualitative results about applying TPC on diffusion-based human image animation systems (i.e., MA: MagicAnimate, DisCo, AA: AnimateAnyone, DP: DreamPose) on cases about compositional misalignment of human shape between a reference image and target motion: Temporal misalignment by motion affecting factor rotation (top left) and scale (top right). Consistent misalignment affecting rotation (bottom left) and scale (bottom right). Calibrated images and predictions of compositional aligned samples are available in Appendix. Please see also video in the supplementary.", "description": "This figure demonstrates the effectiveness of Test-time Procrustes Calibration (TPC) in handling compositional misalignment in human image animation. It showcases four different scenarios with varying degrees of misalignment (rotation and scale) and shows how TPC improves the generated animation quality compared to baseline models.  The top row depicts temporal misalignment due to bending and walking motions, while the bottom row shows consistent misalignment due to scaling and rotation. Each scenario includes ground truth, results without TPC, and results with TPC.", "section": "5.3 Experimental Results"}, {"figure_path": "h6nSE8AWCT/figures/figures_14_1.jpg", "caption": "Figure 8: Qualitative results about applying TPC on diffusion-based human image animation systems (i.e., MA: MagicAnimate, DisCo, AA: AnimateAnyone, DP: DreamPose) on cases about compositional misalignment of human shape between a reference image and target motion: Temporal misalignment by motion affecting factor rotation (top left) and scale (top right). Consistent misalignment affecting rotation (bottom left) and scale (bottom right). Calibrated images and predictions of compositional aligned samples are available in Appendix. Please see also video in the supplementary.", "description": "This figure displays qualitative results demonstrating the effectiveness of Test-time Procrustes Calibration (TPC) in handling compositional misalignment during human image animation. Four different models (MagicAnimate, DisCo, AnimateAnyone, DreamPose) are used, showcasing their performance with and without TPC on four cases of misalignment. The results illustrate that TPC improves the image quality and consistency in animation outputs, especially in challenging scenarios.", "section": "5.3 Experimental Results"}, {"figure_path": "h6nSE8AWCT/figures/figures_15_1.jpg", "caption": "Figure 12: Qualitative results about calibrated images on the samples in Figure 8.", "description": "This figure shows a comparison between the original results from four different diffusion-based human image animation models (DreamPose, MagicAnimate, DisCo, and AnimateAnyone) and the results obtained after applying the proposed Test-time Procrustes Calibration (TPC) method. The results are shown for four different samples that exhibit compositional misalignment between the reference image and the target motion, as illustrated in Figure 8.  The images illustrate how TPC improves the quality and consistency of the generated animation, especially in challenging scenarios where there is a significant compositional misalignment.", "section": "A.2 More qualitative results"}, {"figure_path": "h6nSE8AWCT/figures/figures_16_1.jpg", "caption": "Figure 15: Qualitative results about applying TPC on recent diffusion-based MagicAnimate (MA) on identical reference image with different motions. The motion videos are obtained from TikTok dance video dataset. (test-split)", "description": "This figure shows a comparison of animation results between the MagicAnimate model alone and the same model enhanced with Test-time Procrustes Calibration (TPC).  The experiment uses an identical reference image but varies the target motion videos from the TikTok dance dataset. The goal is to demonstrate how TPC improves robustness and consistency in human image animation when the target pose significantly differs from the reference image.", "section": "Experiments"}, {"figure_path": "h6nSE8AWCT/figures/figures_17_1.jpg", "caption": "Figure 8: Qualitative results about applying TPC on diffusion-based human image animation systems (i.e., MA: MagicAnimate, DisCo, AA: AnimateAnyone, DP: DreamPose) on cases about compositional misalignment of human shape between a reference image and target motion: Temporal misalignment by motion affecting factor rotation (top left) and scale (top right). Consistent misalignment affecting rotation (bottom left) and scale (bottom right). Calibrated images and predictions of compositional aligned samples are available in Appendix. Please see also video in the supplementary.", "description": "This figure shows qualitative results of applying Test-time Procrustes Calibration (TPC) to four different diffusion-based human image animation models (MagicAnimate, DisCo, AnimateAnyone, and DreamPose). It demonstrates TPC's effectiveness in handling compositional misalignments between reference and target images under various scenarios: temporal misalignment due to rotation or scale changes, and consistent misalignment due to rotation or scale differences. The results highlight TPC's ability to improve image quality and consistency by aligning human shapes in the reference and target images.", "section": "5.3 Experimental Results"}]