[{"figure_path": "xxY8d4rnSb/tables/tables_5_1.jpg", "caption": "Table 1: 1D-to-2D performance. Fig. 4-D setting, results averaged over five random seeds.", "description": "This table presents the quantitative results of the 1D-to-2D experiment described in Section 4.2 of the paper. Three different models (Unconstrained MLP, Constrained MLP, and ManiPose) were trained and evaluated on three different synthetic datasets with different levels of difficulty. The results are averaged over five different random seeds.  The table shows the MPJPE and the distance to circle (a measure of pose consistency) for each model and dataset.  The results demonstrate that ManiPose outperforms the other models in terms of both MPJPE and pose consistency.", "section": "4.2 Insights to the formal argument on a simplified setting"}, {"figure_path": "xxY8d4rnSb/tables/tables_7_1.jpg", "caption": "Table 2: Pose consistency evaluation of state-of-the-art methods on Human3.6M. MPJPE performance and pose consistency are not correlated; only ManiPose excels in both. T: sequence length. K: number of hypotheses. Orac.: Metric computed using oracle hypothesis. Grey lines: Methods where the Oracle MPJPE is computed with non-comparable number of hypotheses with respect to the other baselines. Bold: best; Underlined: second best. *: Method with unavailable code; MPSSE values reported in [12]. †: Results with comparable number of hypotheses. ‡: Results computed with official checkpoint and code.", "description": "This table compares the performance of ManiPose against other state-of-the-art methods on the Human3.6M dataset in terms of MPJPE, MPSSE, and MPSCE. It highlights that ManiPose achieves superior pose consistency while maintaining competitive MPJPE performance.  The table also details the experimental setup of each method, such as the sequence length (T) and number of hypotheses (K).", "section": "5.2 Comparison with the state of the art"}, {"figure_path": "xxY8d4rnSb/tables/tables_8_1.jpg", "caption": "Table 3: Comparison with the state-of-the-art on MPI-INF-3DHP using ground-truth 2D poses. T: sequence length.", "description": "This table compares the performance of ManiPose with other state-of-the-art methods on the MPI-INF-3DHP dataset using ground-truth 2D poses.  It shows the results for various metrics, including PCK (Percentage of Correct Keypoints), AUC (Area Under the Curve), MPJPE (Mean Per Joint Position Error), MPSSE (Mean Per Segment Symmetry Error), and MPSCE (Mean Per Segment Consistency Error). The table highlights ManiPose's superior performance in terms of pose consistency (low MPSCE and MPSSE) while maintaining competitive performance in other metrics. The 'T' column indicates the sequence length used for evaluation.", "section": "5 Experiments"}, {"figure_path": "xxY8d4rnSb/tables/tables_8_2.jpg", "caption": "Table 4: Ablation study: Single hypothesis cannot optimize both MPJPE and consistency. ManiPose uses the same backbone as MixSTE. MR: with manifold regularization. MC: manifold-constrained. Bold: best. Underlined: second best.", "description": "This table presents the ablation study results for ManiPose, comparing the performance of different model configurations. It shows that only the combination of multiple hypotheses and manifold constraints achieves optimal performance in both MPJPE (mean per-joint position error) and pose consistency metrics (MPSSE and MPSCE).", "section": "5.3 Ablation study"}, {"figure_path": "xxY8d4rnSb/tables/tables_19_1.jpg", "caption": "Table 1: 1D-to-2D performance. Fig. 4-D setting, results averaged over five random seeds.", "description": "This table presents a comparison of three different models' performance on a simplified 1D-to-2D pose lifting problem, designed to illustrate the core arguments of the paper. The models are an unconstrained MLP, a constrained MLP, and ManiPose.  The table reports the MPJPE (Mean Per Joint Position Error) and the distance of predictions to the circle manifold (representing pose consistency). The results highlight the trade-off between achieving low MPJPE and maintaining pose consistency, and demonstrate ManiPose's superior performance in both aspects.", "section": "Experiments"}, {"figure_path": "xxY8d4rnSb/tables/tables_20_1.jpg", "caption": "Table 6: Mean per joint prediction error (MPJPE) and mean per segment consistency error (MPSCE) in a 2D-to-3D scenario. Results are averaged over five random seeds. ManiPose reaches perfect MPSCE consistency without degrading MPJPE performance.", "description": "This table presents the results of a 2D-to-3D pose lifting experiment using three different methods: an unconstrained multi-layer perceptron (MLP), a constrained MLP, and ManiPose.  The metrics used to evaluate the performance are Mean Per Joint Position Error (MPJPE) and Mean Per Segment Consistency Error (MPSCE).  The table shows that ManiPose achieves the lowest MPJPE while maintaining perfect MPSCE consistency, indicating that it produces more accurate and consistent 3D poses.", "section": "5.3 Ablation study"}, {"figure_path": "xxY8d4rnSb/tables/tables_21_1.jpg", "caption": "Table 2: Pose consistency evaluation of state-of-the-art methods on Human3.6M. MPJPE performance and pose consistency are not correlated; only ManiPose excels in both. T: sequence length. K: number of hypotheses. Orac.: Metric computed using oracle hypothesis. Grey lines: Methods where the Oracle MPJPE is computed with non-comparable number of hypotheses with respect to the other baselines. Bold: best; Underlined: second best. *: Method with unavailable code; MPSSE values reported in [12]. †: Results with comparable number of hypotheses. ‡: Results computed with official checkpoint and code.", "description": "This table compares the performance of ManiPose with other state-of-the-art methods on the Human3.6M dataset in terms of MPJPE (mean per-joint position error) and pose consistency metrics (MPSSE and MPSCE). It highlights that ManiPose outperforms other methods in both aspects, showing a strong correlation between the two metrics.", "section": "5.2 Comparison with the state of the art"}, {"figure_path": "xxY8d4rnSb/tables/tables_22_1.jpg", "caption": "Table 2: Pose consistency evaluation of state-of-the-art methods on Human3.6M. MPJPE performance and pose consistency are not correlated; only ManiPose excels in both. T: sequence length. K: number of hypotheses. Orac.: Metric computed using oracle hypothesis. Grey lines: Methods where the Oracle MPJPE is computed with non-comparable number of hypotheses with respect to the other baselines. Bold: best; Underlined: second best. *: Method with unavailable code; MPSSE values reported in [12]. †: Results with comparable number of hypotheses. ‡: Results computed with official checkpoint and code.", "description": "This table compares the performance of ManiPose against other state-of-the-art methods on the Human3.6M dataset.  It evaluates both traditional metrics like MPJPE (Mean Per Joint Position Error) and novel pose consistency metrics (MPSSE, MPSCE). The table highlights that ManiPose outperforms other methods in terms of pose consistency while maintaining competitive MPJPE scores.  It also shows that MPJPE and pose consistency are not correlated, with some methods achieving low MPJPE but poor consistency and vice versa.", "section": "5.2 Comparison with the state of the art"}, {"figure_path": "xxY8d4rnSb/tables/tables_23_1.jpg", "caption": "Table 2: Pose consistency evaluation of state-of-the-art methods on Human3.6M. MPJPE performance and pose consistency are not correlated; only ManiPose excels in both. T: sequence length. K: number of hypotheses. Orac.: Metric computed using oracle hypothesis. Grey lines: Methods where the Oracle MPJPE is computed with non-comparable number of hypotheses with respect to the other baselines. Bold: best; Underlined: second best. *: Method with unavailable code; MPSSE values reported in [12]. †: Results with comparable number of hypotheses. ‡: Results computed with official checkpoint and code.", "description": "This table compares ManiPose with other state-of-the-art methods on the Human3.6M dataset in terms of pose consistency and MPJPE. It highlights that ManiPose outperforms other methods in both metrics, demonstrating its effectiveness in achieving high consistency without sacrificing accuracy. The table also provides details on the experimental setup, including the sequence length, number of hypotheses, and evaluation metrics used.", "section": "5.2 Comparison with the state of the art"}, {"figure_path": "xxY8d4rnSb/tables/tables_23_2.jpg", "caption": "Table 10: Rotations representation ablation: learning 3D directions instead of full rotations yields poorer results. Dim.: Dimension of rotations or directions representations. K: Number of hypotheses. β Scores regularization. Bold: best. Underlined: second best.", "description": "This ablation study investigates the impact of using 3D directions instead of full rotations for representing joint rotations in the ManiPose model. The results show that using full 6D rotations consistently outperforms using 3D directions across different hyperparameter settings, highlighting the importance of the richer representation for achieving optimal performance in terms of MPJPE, MPSSE, and MPSCE.", "section": "5.3 Ablation study"}]