[{"figure_path": "3G8sjUZqO3/tables/tables_6_1.jpg", "caption": "Table 1: Datasets used for the task of dividing N data points into K clusters.", "description": "This table lists eight datasets used in the experiments, specifying the number of data points (N), the number of clusters (K), and the number of features for each dataset.  The source of each dataset is also indicated.", "section": "5 Experiments"}, {"figure_path": "3G8sjUZqO3/tables/tables_7_1.jpg", "caption": "Table 1: Datasets used for the task of dividing N data points into K clusters.", "description": "This table lists eight datasets used in the paper's experiments to evaluate the performance of the proposed fractional programming-based clustering (FPC) algorithm.  For each dataset, it shows the number of data points (N), the number of clusters (K), the number of features for each data point, and the source of the dataset.  The datasets vary significantly in size and characteristics, allowing for a comprehensive evaluation of the algorithm's robustness.", "section": "5 Experiments"}, {"figure_path": "3G8sjUZqO3/tables/tables_7_2.jpg", "caption": "Table 2: NCut objective values achieved by the different algorithms with random initialization.", "description": "This table presents the results of four different algorithms (SC, FINC, FCD, and FPC) on eight datasets.  Each algorithm attempts to minimize the normalized cut (NCut) objective function.  The table shows the NCut values obtained by each algorithm for each dataset with random initialization. Lower values indicate better performance in minimizing the NCut.", "section": "5 Experiments"}, {"figure_path": "3G8sjUZqO3/tables/tables_7_3.jpg", "caption": "Table 3: NCut objective values achieved by the different algorithms with the SC initialization.", "description": "This table presents the NCut objective values obtained by four different algorithms (SC, SC+FINC, SC+FCD, and SC+FPC) when initialized using the SC algorithm.  The results are shown for eight different datasets, each with its own number of data points and features.  The values are accompanied by their standard deviations.  Blue coloring indicates improvement while red indicates degradation compared to the SC baseline.", "section": "5 Experiments"}, {"figure_path": "3G8sjUZqO3/tables/tables_8_1.jpg", "caption": "Table 4: The performance metrics of ACC, NMI, and ARI achieved by the different algorithms.", "description": "This table presents a comparison of four different clustering algorithms (SC, FINC, FCD, and FPC) across eight datasets.  The performance of each algorithm is evaluated using three metrics: Accuracy (ACC), Normalized Mutual Information (NMI), and Adjusted Rand Index (ARI).  Higher values for ACC, NMI, and ARI indicate better clustering performance. The table allows for a detailed assessment of the relative strengths and weaknesses of each algorithm in various clustering scenarios.", "section": "5 Experiments"}]