[{"figure_path": "C1hiRbzEH9/figures/figures_1_1.jpg", "caption": "Figure 1: OOD score for different training strategies. The ID data X in C R2 is sampled from three distinct Gaussian distributions, each representing a different class. The auxiliary outliers are sampled from a Gaussian mixture model away from the ID data, where the number of mixture components indicates the number of classes contained in auxiliary outliers. (a) The model trained without auxiliary outliers fails to detect OOD. (b) Incorporating a less diverse set of auxiliary outliers (10 classes) during training enables partial OOD detection, but overfits auxiliary outliers. (c) OOD detection is improved with a more diverse set of auxiliary outliers (1000 classes). (d) diverseMix enriches the diversity of outliers (10 classes) through creating significantly distinct mixed outliers.", "description": "This figure illustrates the impact of auxiliary outlier diversity on out-of-distribution (OOD) detection.  Four scenarios are shown:\n(a) No auxiliary outliers: The model fails to distinguish between in-distribution (ID) and OOD data.\n(b) Auxiliary outliers (10 classes): The model shows some OOD detection capability, but it overfits to the limited diversity of auxiliary outliers.\n(c) Diverse auxiliary outliers (1000 classes): Using a much more diverse set of auxiliary outliers significantly improves OOD detection.\n(d) diverseMix (10 classes): The proposed diverseMix method enhances the diversity of even a small set of auxiliary outliers by creating new, distinct mixed outliers, leading to improved OOD detection performance comparable to using a very large and diverse dataset.", "section": "Introduction"}, {"figure_path": "C1hiRbzEH9/figures/figures_8_1.jpg", "caption": "Figure 1: OOD score for different training strategies. The ID data X<sub>in</sub> C R<sup>2</sup> is sampled from three distinct Gaussian distributions, each representing a different class. The auxiliary outliers are sampled from a Gaussian mixture model away from the ID data, where the number of mixture components indicates the number of classes contained in auxiliary outliers. (a) The model trained without auxiliary outliers fails to detect OOD. (b) Incorporating a less diverse set of auxiliary outliers (10 classes) during training enables partial OOD detection, but overfits auxiliary outliers. (c) OOD detection is improved with a more diverse set of auxiliary outliers (1000 classes). (d) diverseMix enriches the diversity of outliers (10 classes) through creating significantly distinct mixed outliers.", "description": "This figure shows the effect of different training strategies on out-of-distribution (OOD) detection.  It compares four scenarios: (a) No auxiliary outliers used for training. (b) Training with a small, less diverse set of auxiliary outliers leads to overfitting,  resulting in poor OOD generalization. (c) A larger, more diverse set of auxiliary outliers improves OOD detection. (d) Using the proposed diverseMix method enhances the diversity of a small auxiliary outlier dataset, improving OOD detection.", "section": "Introduction"}]