[{"figure_path": "K1EG2ABzNE/figures/figures_3_1.jpg", "caption": "Figure 1: Average best possible PSNR values (in dB) obtained from standard DIP in (1) for 8 MRI (with 4x acceleration factor) scans (y-axis), where the network input z is either a perturbed version of the ground truth or pure noise. The noise is a zero-mean additive Gaussian noise with strength determined by σ (x-axis).", "description": "This figure shows the results of an experiment investigating the impact of the network input on the performance of Vanilla DIP.  Two scenarios are compared: one where the network input is a noisy version of the ground truth image (blue line), and another where the input is pure noise (red line).  The y-axis represents the best possible PSNR achieved before overfitting occurs, and the x-axis represents the standard deviation (σ) of the added Gaussian noise. The results show that a closer similarity between the DIP network input and the ground truth leads to higher reconstruction quality (higher PSNR). This motivates the development of aSeqDIP which aims to mitigate noise overfitting by adaptively changing the network input.", "section": "Motivation of aSeqDIP: The Impact of the Network Input in Vanilla DIP"}, {"figure_path": "K1EG2ABzNE/figures/figures_4_1.jpg", "caption": "Figure 2: Illustrative block diagram of the proposed aSeqDIP procedure. Each trapezoid corresponds to the updates of fok that takes zk−1 as input and is initialized with the optimized parameters φk−1 for k ∈ {2,..., K} or randomly for k = 1. The optimization for each set of weights takes place based on (3) and is run for N steps. The final reconstruction is fφK (ZK−1).", "description": "This figure illustrates the aSeqDIP algorithm's sequential process.  It shows how the network weights (φk) and inputs (zk) are updated iteratively across K steps. Each step involves N optimization iterations for the current set of network weights. The initial input, z0, is derived from the measurements, and subsequent inputs are the outputs of the previous steps. This sequential refinement gradually denoises and reconstructs the image.", "section": "3 The Proposed aSeqDIP Algorithm"}, {"figure_path": "K1EG2ABzNE/figures/figures_5_1.jpg", "caption": "Figure 3: An overview of differences between aSeqDIP and prior arts in terms of data dependency, network architecture(s), and procedural requisites. 'Data-Dependency' here indicates whether a method depend on a prior reference image or pre-trained models.", "description": "This figure compares aSeqDIP with other methods for image reconstruction, categorized into data-dependent and data-independent approaches.  Data-dependent methods use pre-trained models or reference images, while data-independent methods, including aSeqDIP, do not. The figure highlights the differences in network architecture, procedural steps, and the use of data.", "section": "3 Autoencoding Sequential DIP"}, {"figure_path": "K1EG2ABzNE/figures/figures_7_1.jpg", "caption": "Figure 4: Average PSNR results w.r.t. iteration i of 20 MRI (with 4x) scans (left) and 20 CT (with 18 views) scans (right) to show the impact of the proposed autoencoding regularization term on noise overfitting in aSeqDIP. Furthermore, average results of Vanilla DIP and Self-Guided DIP are also reported for comparison. For aSeqDIP, iteration i ∈ [NK], where N = 2.", "description": "This figure shows the average PSNR over 20 MRI and 20 CT scans for different methods.  The left panel shows MRI reconstruction with 4x acceleration, and the right panel shows CT reconstruction with 18 views. The plot shows the PSNR as a function of iteration number (i).  The vertical lines indicate where noise overfitting starts for each method. The figure demonstrates that aSeqDIP (with regularization) significantly delays the onset of noise overfitting compared to other methods, including vanilla DIP and Self-Guided DIP.  The aSeqDIP method with the autoencoding term disabled shows similar behavior to the Self-Guided DIP, highlighting the impact of the proposed autoencoding term.", "section": "4.2 Impact of the Autoencoding term on Noise Overfitting"}, {"figure_path": "K1EG2ABzNE/figures/figures_9_1.jpg", "caption": "Figure 5: Reconstructed/recovered images using our proposed approach, aSeqDIP, and the baselines for the considered tasks. The ground truth (GT) and degraded images are shown in the first and second columns, respectively, followed by three or four baselines per task. The last column presents our method. PSNR results are given at the bottom of each reconstructed image. For MRI (8x undersampling) and CT (18 views), the top right box shows the absolute difference between the center region box of the reconstructed image and the same region in the GT image. Denoising and in-painting used σₐ = 25 and HIAR = 0.25. For the task of Deblurring, aSeqDIP contains artifacts when compared to DPS. However, DPS generates a perceptually different image when compared to the GT. For all other tasks, aSeqDIP reconstructions contain sharper and clearer image features than other methods.", "description": "This figure shows visual comparisons of image reconstruction results using different methods (Vanilla DIP, Self-Guided DIP, Score-MRI, Ref-Guided DIP, SGLD-DIP, DPS, and aSeqDIP).  The results are shown for five different image reconstruction tasks: MRI, CT, denoising, inpainting, and deblurring.  Each row represents one task, showing the ground truth, the degraded image, and the reconstructions produced by each method.  The PSNR (Peak Signal-to-Noise Ratio) is included for each reconstruction.  The figure highlights that aSeqDIP generally produces sharper and clearer results, particularly in MRI and CT, though there is an exception in deblurring, where DPS produces comparable perceptual quality.", "section": "4.4 Visualizations"}, {"figure_path": "K1EG2ABzNE/figures/figures_15_1.jpg", "caption": "Figure 6: Ground truth signal and measurements (left), and the results of the denoising experiment in Appendix A.2 (right) to support the claims in Theorem A.1 and Remark A.2.", "description": "This figure consists of two subfigures. The left subfigure shows a 1D sinusoidal signal (ground truth) and its noisy version.  The right subfigure presents the results of a denoising experiment using Deep Image Prior (DIP). Three different network inputs are compared: the ground truth signal, the noisy signal, and random noise. The plot shows the l2 norm error of the network output during training. It demonstrates that using the ground truth as input leads to slower convergence and higher resistance to overfitting, while using the noisy signal as input results in rapid convergence to the noise level. Using random noise as input shows typical DIP behavior.", "section": "A Case Study: Impact of the DIP Network Input through lens of Neural Tangent Kernel in Residual Networks"}, {"figure_path": "K1EG2ABzNE/figures/figures_16_1.jpg", "caption": "Figure 7: Average PSNR (y-axis) of 8 MRI images (with 4x undersampling) obtained by optimizing the input of a trained autoencoder (using (17)) w.r.t. different values of the regularization parameter λ<sub>λ</sub> in (18) (x-axis).", "description": "The figure shows the average PSNR achieved on 8 MRI testing scans with 4x undersampling by optimizing the input of a pre-trained autoencoder.  The x-axis represents different values of the autoencoder regularization parameter (λ<sub>λ</sub>), and the y-axis shows the resulting average PSNR. The shaded area represents the standard deviation across the 8 scans. The figure demonstrates how the choice of regularization parameter affects the reconstruction quality when using a trained autoencoder as a reconstructor.", "section": "C.1 Robustness to Noise Overfitting for the Denoising Task"}, {"figure_path": "K1EG2ABzNE/figures/figures_16_2.jpg", "caption": "Figure 4: Average PSNR results w.r.t. iteration i of 20 MRI (with 4x) scans (left) and 20 CT (with 18 views) scans (right) to show the impact of the proposed autoencoding regularization term on noise overfitting in aSeqDIP. Furthermore, average results of Vanilla DIP and Self-Guided DIP are also reported for comparison. For aSeqDIP, iteration i ∈ [NK], where N = 2. Vertical lines approximately indicate the start of the PSNR decay for every case. In Appendix C.1, we include the PSNR curves of aSeqDIP and other DIP-based methods for the task of denoising.", "description": "The figure shows the average PSNR over iterations for MRI and CT reconstruction tasks, comparing aSeqDIP with and without the autoencoding regularization term, against Vanilla DIP and Self-Guided DIP. The plot demonstrates the effectiveness of the autoencoding term in delaying noise overfitting, resulting in improved reconstruction quality and a slower decline in PSNR.", "section": "4.2 Impact of the Autoencoding term on Noise Overfitting"}, {"figure_path": "K1EG2ABzNE/figures/figures_17_1.jpg", "caption": "Figure 4: Average PSNR results w.r.t. iteration i of 20 MRI (with 4x) scans (left) and 20 CT (with 18 views) scans (right) to show the impact of the proposed autoencoding regularization term on noise overfitting in aSeqDIP. Furthermore, average results of Vanilla DIP and Self-Guided DIP are also reported for comparison. For aSeqDIP, iteration i ∈ [NK], where N = 2. Vertical lines approximately indicate the start of the PSNR decay for every case. In Appendix C.1, we include the PSNR curves of aSeqDIP and other DIP-based methods for the task of denoising.", "description": "The figure shows the average PSNR curves for MRI and CT reconstruction tasks using aSeqDIP with and without the autoencoding regularization term, as well as for Vanilla DIP and Self-Guided DIP.  It demonstrates the effectiveness of the autoencoding term in mitigating noise overfitting by delaying the onset of PSNR decay, thus leading to improved reconstruction quality. The vertical lines mark the approximate start of PSNR decay for each method.", "section": "4.2 Impact of the Autoencoding term on Noise Overfitting"}, {"figure_path": "K1EG2ABzNE/figures/figures_18_1.jpg", "caption": "Figure 4: Average PSNR results w.r.t. iteration i of 20 MRI (with 4x) scans (left) and 20 CT (with 18 views) scans (right) to show the impact of the proposed autoencoding regularization term on noise overfitting in aSeqDIP. Furthermore, average results of Vanilla DIP and Self-Guided DIP are also reported for comparison. For aSeqDIP, iteration i ∈ [NK], where N = 2.", "description": "The figure displays the average PSNR (Peak Signal-to-Noise Ratio) results for MRI and CT image reconstruction tasks across different iterations.  It compares the performance of aSeqDIP (with and without the autoencoding regularization term) against Vanilla DIP and Self-Guided DIP. The plot shows how the PSNR changes over the iterations, illustrating the impact of the autoencoding term on mitigating noise overfitting.  A higher PSNR indicates better image quality. The vertical lines approximate the point where the PSNR starts to decay for each method.", "section": "4.2 Impact of the Autoencoding term on Noise Overfitting"}, {"figure_path": "K1EG2ABzNE/figures/figures_19_1.jpg", "caption": "Figure 11: Visualization of ground-truth and reconstructed images using different methods of a knee image from the fastMRI dataset with 4x k-space undersampling. A region of interest is shown with a green box and its error (magnitude) is shown in the panel on the top right. aSeqDIP provides the sharpest and clearest reconstruction of image features.", "description": "The figure compares the reconstruction results of several methods on a knee MRI image with 4x undersampling.  It highlights aSeqDIP's superior performance in reconstructing sharp and clear image features compared to other methods (Score MRI, Self-Guided DIP, Vanilla DIP, Reference-Guided DIP).  A region of interest is zoomed in for detailed comparison.", "section": "4.4 Visualizations"}, {"figure_path": "K1EG2ABzNE/figures/figures_19_2.jpg", "caption": "Figure 11: Visualization of ground-truth and reconstructed images using different methods of a knee image from the fastMRI dataset with 4x k-space undersampling. A region of interest is shown with a green box and its error (magnitude) is shown in the panel on the top right. aSeqDIP provides the sharpest and clearest reconstruction of image features.", "description": "This figure compares the reconstruction quality of different methods on a knee MRI image with 4x undersampling.  It shows the ground truth, the undersampled input, and the reconstructions from Score MRI, aSeqDIP, Vanilla DIP, and Reference-Guided DIP. A zoomed-in region highlights the differences in detail and sharpness between the methods. aSeqDIP shows the best reconstruction with sharpest and clearest features.", "section": "4.4 Visualizations"}, {"figure_path": "K1EG2ABzNE/figures/figures_20_1.jpg", "caption": "Figure 13: Visualization of ground-truth and reconstructed images using different methods of a CT scan from the AAPM dataset with 18 views. A region of interest is shown with a green box and its error (magnitude) is shown in the panel on the top right. aSeqDIP provides the sharpest and clearest reconstruction of image features.", "description": "This figure compares the image reconstruction results of several methods on a CT scan using 18 views. It shows the ground truth image, the input image with noise and artifacts, and the reconstructions generated by MCG, aSeqDIP, and vanilla DIP.  A zoomed-in region highlights the quality differences, showcasing aSeqDIP's ability to produce sharper and clearer images with fewer artifacts.", "section": "4.4 Visualizations"}, {"figure_path": "K1EG2ABzNE/figures/figures_20_2.jpg", "caption": "Figure 13: Visualization of ground-truth and reconstructed images using different methods of a CT scan from the AAPM dataset with 18 views. A region of interest is shown with a green box and its error (magnitude) is shown in the panel on the top right. aSeqDIP provides the sharpest and clearest reconstruction of image features.", "description": "This figure compares the performance of different image reconstruction methods on a CT scan from the AAPM dataset with 18 views.  It shows the ground truth, the input (noisy) image, and the reconstructions obtained using MCG, aSeqDIP, Vanilla DIP, and Reference Guided DIP. A region of interest is highlighted, and the corresponding PSNR values are displayed below each image.  The figure demonstrates that aSeqDIP achieves the highest PSNR and provides the sharpest and clearest reconstruction, indicating better performance in reconstructing detailed image features.", "section": "4.4 Visualizations"}, {"figure_path": "K1EG2ABzNE/figures/figures_21_1.jpg", "caption": "Figure 5: Reconstructed/recovered images using our proposed approach, aSeqDIP, and the baselines for the considered tasks. The ground truth (GT) and degraded images are shown in the first and second columns, respectively, followed by three or four baselines per task. The last column presents our method. PSNR results are given at the bottom of each reconstructed image. For MRI (8x undersampling) and CT (18 views), the top right box shows the absolute difference between the center region box of the reconstructed image and the same region in the GT image. Denoising and in-painting used σa = 25 and HIAR = 0.25. For the task of Deblurring, aSeqDIP contains artifacts when compared to DPS. However, DPS generates a perceptually different image when compared to the GT. For all other tasks, aSeqDIP reconstructions contain sharper and clearer image features than other methods.", "description": "This figure compares the image reconstruction results of the proposed aSeqDIP method to several baseline methods across five different image reconstruction tasks: MRI, CT, denoising, inpainting, and deblurring.  Each row represents a task, with the ground truth and degraded input image shown in the first two columns. Subsequent columns present reconstruction results from several different methods, with the final column showing aSeqDIP's results. PSNR values are given for each reconstruction to quantitatively assess performance.  In MRI and CT, a difference image highlights the discrepancy between the central region of the reconstruction and the ground truth.  The figure visually demonstrates that aSeqDIP generally achieves superior image quality.", "section": "4.4 Visualizations"}, {"figure_path": "K1EG2ABzNE/figures/figures_21_2.jpg", "caption": "Figure 5: Reconstructed/recovered images using our proposed approach, aSeqDIP, and the baselines for the considered tasks. The ground truth (GT) and degraded images are shown in the first and second columns, respectively, followed by three or four baselines per task. The last column presents our method. PSNR results are given at the bottom of each reconstructed image. For MRI (8x undersampling) and CT (18 views), the top right box shows the absolute difference between the center region box of the reconstructed image and the same region in the GT image. Denoising and in-painting used σa = 25 and HIAR = 0.25. For the task of Deblurring, aSeqDIP contains artifacts when compared to DPS. However, DPS generates a perceptually different image when compared to the GT. For all other tasks, aSeqDIP reconstructions contain sharper and clearer image features than other methods.", "description": "This figure shows visual comparisons of image reconstruction results from different methods (aSeqDIP and baselines) for five different image processing tasks: MRI, CT, denoising, inpainting, and deblurring.  For each task, a ground truth image, a degraded image, and the reconstructions from several methods are displayed.  The PSNR values are provided for quantitative comparison. The figure highlights that aSeqDIP generally produces sharper and clearer images, especially in MRI and CT where a zoomed-in section shows that aSeqDIP has lower error compared to other methods.", "section": "4.4 Visualizations"}, {"figure_path": "K1EG2ABzNE/figures/figures_22_1.jpg", "caption": "Figure 17: Non-linear deblurring samples where image restorations of different methods are given using an example from the FFHQ dataset.", "description": "This figure compares the results of different image deblurring methods applied to a sample image from the FFHQ dataset.  It shows the ground truth image alongside the input (blurred) image and the results obtained using DPS, aSeqDIP, Self-Guided DIP, and SGLD. The PSNR values for each method are included below its corresponding image, demonstrating the relative performance in terms of reconstruction quality.", "section": "4.4 Visualizations"}]