[{"figure_path": "ZBBrBujopT/figures/figures_8_1.jpg", "caption": "Figure 1: Control with cost function (12) for T = 200 steps: initial distribution x1 = [0.9, 0.1, 0.0]; parameters C3 = 10, C2 = 1; no noise. Left/Middle: Cost and cumulative cost over time of GPC-Simplex versus baselines. Right: control ut(2) (proportional to effective transmission rate) played by GPC-Simplex over time.", "description": "This figure shows the results of applying the GPC-Simplex algorithm to a controlled disease transmission model (SIR model).  The left and middle panels compare the cost and cumulative cost of GPC-Simplex against two baseline methods: one with full prevention (ut = [1, 0]) and one with no prevention (ut = [0, 1]). The right panel displays the control ut(2) used by GPC-Simplex over time, which is proportional to the effective transmission rate.  The results demonstrate that GPC-Simplex effectively controls the spread of the disease while minimizing costs, outperforming the baseline methods.", "section": "4 Experimental Evaluation"}, {"figure_path": "ZBBrBujopT/figures/figures_8_2.jpg", "caption": "Figure 2: Controlling hospital flows for T = 100 steps: initial distribution [0.9, 0.01, 0.09]; parameters ymax = 0.1, c2 = 0.01, c3 = 100. Left: The dashed red line shows the number of infected over time under no control; note that ymax (shown in dashed purple line) is significantly exceeded. The solid yellow and blue lines show the number of infected and susceptible under GPC-Simplex, which closely match the optimal solutions computed by [28] (dashed yellow and blue). Right: GPC-Simplex control (solid) vs. optimal control (dashed).", "description": "This figure compares the performance of the GPC-Simplex algorithm against the optimal control and a no-intervention baseline for a controlled SIR model simulating hospital flows.  The left panel shows that GPC-Simplex effectively controls the number of infected individuals, preventing it from exceeding the hospital capacity (ymax), unlike the no-intervention scenario. The right panel demonstrates that the control strategy learned by GPC-Simplex closely resembles the optimal control strategy.", "section": "4 Experimental Evaluation"}, {"figure_path": "ZBBrBujopT/figures/figures_25_1.jpg", "caption": "Figure 3: An intuitive illustration of xt(2) in the lower bound for simplex LDS (Theorem 30). The blue curve is the trajectory of πº, the “decreasing", "description": "This figure provides an intuitive illustration of the lower bound for simplex LDS in Theorem 30. It shows the trajectory of two comparator policies (πº and π¹) under different perturbation sequences.  The areas S1, S2, and S3 represent the regret incurred by an arbitrary policy under these two sequences, which sums to Ω(T). This demonstrates the impossibility of achieving sublinear regret against the class of all marginally stable policies for simplex LDS without mixing time assumption.", "section": "D Proof of Lower Bounds"}, {"figure_path": "ZBBrBujopT/figures/figures_31_1.jpg", "caption": "Figure 4: SIR with perturbations. T = 200. Initial state x1 = [0.9, 0.1, 0]. GPC-Simplex parameter H = 5. Top: Perturbation sequence: wt = [0, 1, 0], ∀1 ≤ t ≤ 200. γt ~ 0.01·Ber(0.2), ∀1 ≤ t ≤ 200. Bottom: Perturbation sequence: γt, wt is a normalized uniform random vector. γt = 0.01, ∀1 ≤ t ≤ 200.", "description": "This figure compares the performance of the GPC-Simplex algorithm against two baselines (full prevention and no prevention) for a controlled SIR model with two different perturbation sequences. The top row shows the results with a specific perturbation sequence (wt = [0,1,0]), while the bottom row shows the results with a normalized uniform random vector perturbation. The plots display the cost, cumulative cost, and control value (u(2)) over time.", "section": "F.1 Control in presence of perturbations"}, {"figure_path": "ZBBrBujopT/figures/figures_32_1.jpg", "caption": "Figure 5: Control with costs: control over T = 200 steps. t = 0, ∀t. SIR parameters: β = 0.5, θ = 0.03, ξ = 0.005. Initial state x1 = [0.9, 0.1, 0]. GPC-Simplex parameters: H = 5. Left: instantaneous cost over time, compared with that of no control (green) and full control (orange). Middle: cumulative cost over time. Right: ut(2) output by GPC-Simplex over time. (C2, C3) values (from top to bottom rows): (1, 20), (1, 10), (1, 5), (1, 1).", "description": "This figure compares the performance of the GPC-Simplex algorithm against two baselines (no prevention and full prevention) for controlling the spread of a disease using a controlled SIR model.  It shows instantaneous and cumulative costs over time, along with the control applied (ut(2)).  Different cost parameters (C2, C3) are tested, demonstrating GPC-Simplex's ability to adapt to various cost functions.", "section": "F Experiments: Controlled SIR model"}, {"figure_path": "ZBBrBujopT/figures/figures_33_1.jpg", "caption": "Figure 6: Control with costs: control over T = 200 steps. t = 0, ∀t. SIR parameters: β = 0.3, θ = 0.05, ξ = 0.001. Initial state x1 = [0.9, 0.1, 0]. GPC-Simplex parameters: H = 5. Left: instantaneous cost over time, compared with that of no control (green) and full control (orange). Middle: cumulative cost over time. Right: ut(2) output by GPC-Simplex over time. (C2, C3) values (from top to bottom rows): (1, 20), (1, 10), (1, 5), (1, 1).", "description": "This figure compares the performance of GPC-Simplex to two baselines (no prevention and full prevention) across four different parameter settings for the cost function in the controlled SIR model.  It shows instantaneous and cumulative costs over time, as well as the control strategy employed by GPC-Simplex (represented as u(2)).  The results demonstrate GPC-Simplex's ability to adapt its control strategy to different cost function parameters while outperforming the baselines.", "section": "F Experiments: Controlled SIR model"}, {"figure_path": "ZBBrBujopT/figures/figures_35_1.jpg", "caption": "Figure 7: Experimental results for dynamical system with horizon T = 100, uniform initial state, update rule Eq. (50) with η = 1/4, no perturbations, and time-invariant cost function ct(xt, ut) = x+1 for all times t. GPC-Simplex was implemented as described in Appendix E. The Best Response controller at each time t picks the control u that minimizes ct-1 (f(xt, u), u). The default controller picks the uniform control u = (1/3, 1/3, 1/3).", "description": "This figure shows the results of an experiment on a dynamical system using three different control methods: GPC-Simplex, Best Response, and Default control.  The left plot compares the instantaneous costs over time for each method, highlighting that GPC-Simplex outperforms the default control and approaches the performance of the Best Response controller. The right plot visualizes the population's evolution of different strategies (Rock, Scissors, Paper) across the 100 timesteps, revealing how the distribution changes over time under the influence of GPC-Simplex control.", "section": "H Experiments: Controlled replicator dynamics"}, {"figure_path": "ZBBrBujopT/figures/figures_36_1.jpg", "caption": "Figure 8: Experimental results for dynamical system with horizon T = 200, uniform initial state, update rule Eq. (50) with η = 1/4, no perturbations, and random cost function which is either ct(xt, ut) = x1 or ct(xt, ut) = x+1 + us with equal probability. GPC-Simplex was implemented as described in Appendix E. The Best Response controller at each time t picks the control u that minimizes ct-1 (f(xt, u), u). The default controller picks the uniform control u = (1/3, 1/3, 1/3). The plot shows the cost achieved by GPC-Simplex over time, compared to default Rock-Paper-Scissors control and Best Response control (dashed orange). Due to the non-continuity induced by the random cost functions, the loss plotted at time t is the average loss of the controller across the last min(t, 15) time steps.", "description": "This figure compares the performance of GPC-Simplex against two baselines (Best Response and default control) for a dynamical system with a random cost function. The x-axis represents the time step, and the y-axis shows the cost.  The non-continuity in the cost function means that the plotted cost at each time step is the average of the costs over the last 15 time steps. GPC-Simplex shows better performance compared to the default control but is slightly outperformed by the Best Response controller in the long run.", "section": "I Discussions"}]