[{"figure_path": "dBynjEbAt0/tables/tables_7_1.jpg", "caption": "Table 1: Comparison of fixed effect estimation accuracy based on posterior mean from proposed Bayesian models and warpMix estimate. Smallest estimation errors are highlighted in bold.", "description": "This table compares the accuracy of estimating the fixed effect (μ) using four different Bayesian models and the warpMix method.  The accuracy is measured by the estimation error, which is calculated for three different functions (μ₁, μ₂, μ₃). The table highlights the model with the lowest estimation error for each function, demonstrating that the proposed Bayesian models often outperform warpMix.", "section": "4 Numerical experiments"}, {"figure_path": "dBynjEbAt0/tables/tables_12_1.jpg", "caption": "Table 2: Comparison of fixed effect estimation accuracy based on posterior mean from proposed Bayesian models, and BRFC (posterior mean) and warpMix estimates. Model 1-F to Model 2-B correspond to our models where the number indicates the prior model on phase and the letter corresponds to the type of basis used to model the fixed effect function (F=Fourier, B=B-splines). Smallest errors are highlighted in bold.", "description": "This table presents a comparison of the fixed-effect estimation accuracy for the proposed Bayesian models and two other state-of-the-art methods (warpMix and BRFC).  The results are based on the posterior mean and are broken down into different model specifications and data simulation scenarios. The model specifications are indicated by a code (Model 1-F, Model 1-B, Model 2-F, Model 2-B), where the number refers to the prior model used for the phase functions (Prior Model 1 or 2) and the letter refers to the type of basis functions used to model the fixed-effect function (Fourier or B-spline). The data simulation scenarios include simulations from the proposed model (PM1-F, PM2-F) and simulations from the warpMix model (warpMix-µ1, warpMix-µ2, warpMix-µ3). The lowest error for each scenario is highlighted in bold. The table helps to demonstrate that the proposed Bayesian models achieve superior or comparable performance in fixed-effect estimation compared to the other models.", "section": "Additional comparison of estimation accuracy"}]