[{"figure_path": "vBah12uVbD/figures/figures_1_1.jpg", "caption": "Figure 1: For the three-class classification setting, the space of probability distributions can be illustrated by a two-dimensional simplex: each point in the simplex corresponds to a probability distribution so that credal sets can be depicted as regions. The left case corresponds to the special case of a singleton (credal) set, i.e., a precise probability distribution, signifying aleatoric but no epistemic uncertainty. The case in the middle represents partial knowledge with a certain degree of (epistemic) uncertainty about the true distribution, and the right one corresponds to the case of complete ignorance, where nothing is known about the distribution.", "description": "This figure illustrates how credal sets are represented in a three-class classification problem.  The space of all possible probability distributions is shown as a 2D simplex (triangle). A single point represents a precise probability distribution (no epistemic uncertainty, only aleatoric), while regions within the simplex depict credal sets (sets of probability distributions representing both aleatoric and epistemic uncertainty). The size and location of the credal set within the simplex indicate the degree of uncertainty.  The leftmost image shows a singleton (precise probability), the middle shows partial knowledge, and the rightmost represents complete ignorance.", "section": "2 Background"}, {"figure_path": "vBah12uVbD/figures/figures_6_1.jpg", "caption": "Figure 10: Scatter plots of aleatoric versus epistemic uncertainty using various credal set predictors for the ChaosNLI dataset with α = 0.2. The colors indicate the entropy of the ground truth distribution. The three cases numbered 1 to 3, correspond to the first to third rows of instances shown in Figure 5.", "description": "This figure shows scatter plots visualizing the relationship between aleatoric and epistemic uncertainty for different credal set predictors on the ChaosNLI dataset. Each point represents a data instance, with its x-coordinate representing the epistemic uncertainty and its y-coordinate representing the aleatoric uncertainty. The color of the point reflects the entropy of the corresponding ground truth distribution. Three specific cases from Figure 5 are highlighted, illustrating various uncertainty scenarios.  The results demonstrate the capability of the proposed methodology to disentangle and quantify both aleatoric and epistemic uncertainties.", "section": "Experiments"}, {"figure_path": "vBah12uVbD/figures/figures_7_1.jpg", "caption": "Figure 2: Various credal sets obtained for three instances from ChaosNLI dataset. The ground truth distributions are denoted by orange squares. Black circles indicate model predictions in cases employing a first-order learner (first four columns). For the last column, utilizing a second-order learner, the predicted second-order distributions are represented through contour plots. The miscoverage rate is α = 0.2, and the efficiency of each credal set is depicted below it.", "description": "This figure shows examples of credal sets generated for three different instances from the ChaosNLI dataset using both first-order and second-order prediction models.  The orange squares represent the true underlying probability distributions, while black circles show the predictions made by the model(s). In the first four columns, first-order models are used. In the last column, a second-order model is used, shown as contour plots.  The efficiency of each credal set is shown below its corresponding visualization. The value α = 0.2 represents the target miscoverage rate (i.e., the probability that the true distribution is not contained within the credal set).", "section": "Experiments"}, {"figure_path": "vBah12uVbD/figures/figures_7_2.jpg", "caption": "Figure 7: Different uncertainty situations given the predicted credal sets generated by KL method for the CIFAR10-H dataset with α = 0.2.", "description": "This figure shows three examples from the CIFAR10-H dataset illustrating different uncertainty situations. Each row represents a different uncertainty scenario: high epistemic uncertainty (High EU), low epistemic uncertainty with high aleatoric uncertainty (Low EU, High AU), and low epistemic uncertainty with low aleatoric uncertainty (Low EU, Low AU). For each scenario, the image (x), the ground truth probability distribution (λ<sup>x</sup>), the model's prediction (g(x)), and the uncertainty interval [H*(Q), H*(Q)] are displayed. The uncertainty intervals visually represent the range of plausible probability distributions for the given input, reflecting the level of uncertainty in the model's prediction.", "section": "Experiments"}, {"figure_path": "vBah12uVbD/figures/figures_13_1.jpg", "caption": "Figure 8: General overview of real-world datasets.", "description": "This figure provides a visual representation of the ChaosNLI and CIFAR10-H datasets used in the paper. Panel (a) shows a scatter plot of the ChaosNLI dataset, illustrating the distribution of probability distributions across the three classes (entailment, neutral, contradiction). Panels (b) and (c) display histograms of the entropy values for ChaosNLI and CIFAR10-H, respectively, offering insights into the level of uncertainty in each dataset. The x-axis represents entropy values, ranging from 0 to 1, with higher entropy indicating greater uncertainty, and the y-axis shows the frequency of instances with a given entropy level.", "section": "4 Experiments"}, {"figure_path": "vBah12uVbD/figures/figures_14_1.jpg", "caption": "Figure 9: Scatter plots of calibration scores versus the entropy of the first-order predictor's output for different nonconformity scores for the ChaosNLI dataset.", "description": "The figure shows four scatter plots, one for each of the four nonconformity functions used in the paper (Total Variation, Kullback-Leibler divergence, Wasserstein distance, and Inner product). Each plot displays the relationship between the calibration scores (y-axis) and the entropy of the predicted distribution (x-axis) for the ChaosNLI dataset.  The plots help to visualize the performance of each nonconformity function during the calibration phase of conformal prediction. The spread of points and their distribution provide insights into how well each function differentiates between more and less \"normal\" data points based on their predicted distributions.", "section": "3.1 Generalization to Imprecise First-Order Data"}, {"figure_path": "vBah12uVbD/figures/figures_15_1.jpg", "caption": "Figure 2: Various credal sets obtained for three instances from ChaosNLI dataset. The ground truth distributions are denoted by orange squares. Black circles indicate model predictions in cases employing a first-order learner (first four columns). For the last column, utilizing a second-order learner, the predicted second-order distributions are represented through contour plots. The miscoverage rate is α = 0.2, and the efficiency of each credal set is depicted below it.", "description": "This figure displays credal sets predicted by different models for three example instances from the ChaosNLI dataset.  Each example is represented visually using a probability simplex (triangle). The true distribution for each instance is shown as an orange square.  The first four columns illustrate the results from four different first-order prediction models using different methods of calculating nonconformity. Each model's prediction is shown as a black circle. The last column shows the result from a second-order model, represented as a contour plot indicating a range of probability distributions within the simplex. The caption explains that the miscoverage rate used was 0.2 and shows the calculated efficiency for each prediction.", "section": "Experiments"}, {"figure_path": "vBah12uVbD/figures/figures_17_1.jpg", "caption": "Figure 11: Credal sets generated by the KL method for three examples of illustrative synthetic data with α = 0.1. Each row represents one of three examples, with columns illustrating the evolution of the predicted credal set based on varying numbers of training data points. The lower and upper entropy of each credal set is displayed below it.", "description": "This figure shows the evolution of credal sets generated using the KL method on three different examples of synthetic data as the number of training data points increases. Each row represents one of the three examples, and the columns show how the credal set changes. The lower and upper entropy values are displayed below each credal set to help quantify the uncertainty.", "section": "E.1 Illustrative Example"}, {"figure_path": "vBah12uVbD/figures/figures_19_1.jpg", "caption": "Figure 2: Various credal sets obtained for three instances from ChaosNLI dataset. The ground truth distributions are denoted by orange squares. Black circles indicate model predictions in cases employing a first-order learner (first four columns). For the last column, utilizing a second-order learner, the predicted second-order distributions are represented through contour plots. The miscoverage rate is α = 0.2, and the efficiency of each credal set is depicted below it.", "description": "This figure visualizes credal sets predicted by different models for three example instances from the ChaosNLI dataset.  The ground truth probability distributions are shown as orange squares. The first four columns display predictions from first-order models, represented as black circles.  The final column shows predictions from a second-order model, visualized as contour plots. The figure highlights the variation in credal set size and shape across different prediction methods, indicating different levels of uncertainty.  The miscoverage rate (α) is fixed at 0.2, and each credal set's efficiency is shown below it.", "section": "Experiments"}, {"figure_path": "vBah12uVbD/figures/figures_21_1.jpg", "caption": "Figure 15: Coverage and efficiency results of different nonconformity functions applied on the synthetic data with imprecise first-order distributions (K = 3). The horizontal dashed lines indicate the nominal coverage levels.", "description": "This figure shows the results of an experiment on synthetic data to evaluate the performance of different nonconformity functions used in conformal credal set prediction.  The experiment uses imprecise first-order data, meaning that the true probability distributions are approximated by sampling. The figure presents violin plots illustrating the average coverage and efficiency of different nonconformity functions (TV, KL, WS, Inner, SO) across various miscoverage rates (α) and different numbers of samples (m) used to approximate the distributions.  The horizontal dashed lines represent the nominal coverage levels, which are the desired lower bounds of coverage. The plots show how coverage and efficiency vary with the nonconformity function, miscoverage rate, and the number of samples used in the approximations.", "section": "Experiments"}]