[{"figure_path": "FIs87Iro9j/tables/tables_6_1.jpg", "caption": "Table 1: Performance analysis of the model while training with and without proxy loss with varying number of selected experts.", "description": "This table presents the performance analysis of the ProxyFusion model under different training scenarios. It shows the impact of using the proxy loss (LProxy) and varying the number of selected experts (K) on the model's performance. The results are measured in terms of a certain metric (not specified in the snippet), with higher values indicating better performance.  By comparing the performance with and without the proxy loss for different values of K, we can assess the effectiveness of the proxy loss in enhancing the model's performance and identify the optimal number of selected experts.", "section": "3.3 Discussion and Ablation"}, {"figure_path": "FIs87Iro9j/tables/tables_7_1.jpg", "caption": "Table 3: Verification Performance (TAR (%) @FAR=%) for face included treatment and control protocols of the BTS 3.1 dataset. All faces are detected and algined using RetinaFace face detector.", "description": "This table presents the verification performance, specifically True Acceptance Rate (TAR) at various False Acceptance Rates (FAR), for a face recognition system tested on the BRIAR BTS 3.1 dataset.  The results are broken down by two settings: Face Included Treatment and Face Included Control.  The feature extractor used was Adaface.  The table compares the performance of ProxyFusion against other state-of-the-art methods.", "section": "3. Experiments"}, {"figure_path": "FIs87Iro9j/tables/tables_7_2.jpg", "caption": "Table 3: Verification Performance (TAR (%) @FAR=%) for face included treatment and control protocols of the BTS 3.1 dataset. All faces are detected and algined using RetinaFace face detector.", "description": "This table presents the verification performance, measured by TAR (True Acceptance Rate) at various FAR (False Acceptance Rate) levels, for face recognition on the BRIAR BTS 3.1 dataset.  It shows the results for both face-included treatment and control protocols.  The comparison is made using the RetinaFace face detector for all methods.  The table allows for an evaluation of the performance of different methods in different experimental conditions.", "section": "3.3 Experiments"}, {"figure_path": "FIs87Iro9j/tables/tables_8_1.jpg", "caption": "Table 3: Verification Performance (TAR (%) @FAR=%) for face included treatment and control protocols of the BTS 3.1 dataset. All faces are detected and algined using RetinaFace face detector.", "description": "This table presents the verification performance results for the BRIAR BTS 3.1 dataset, comparing the True Acceptance Rate (TAR) at various False Acceptance Rates (FAR) for both face-included treatment and control conditions.  The results are broken down by the feature extraction method used (Adaface [8]) and the face detection and alignment method (RetinaFace). The table allows for a comparison of the proposed ProxyFusion method against several other state-of-the-art methods in terms of accuracy.", "section": "3.3 Dataset"}]