[{"figure_path": "4bINoegDcm/figures/figures_0_1.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure displays various example prompts and their corresponding generated images using the AttnDreamBooth method.  The prompts are complex and combine multiple descriptive elements, demonstrating the model's ability to create personalized images aligned with detailed textual instructions. Each row shows an example prompt, followed by several generated images showing successful text-image alignment and identity preservation of a learned concept (sloth).", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_1_1.jpg", "caption": "Figure 2: Analysis of two principal methods. We visualize the cross-attention maps corresponding to the new concept and other tokens in the prompt. Textual Inversion [24] tends to overfit the textual embedding of the learned concept, resulting in incorrect attention map allocations to other tokens (e.g., “drawing” or “box”). In contrast, DreamBooth [71] appears to overlook the learned concept, producing images primarily based on other tokens.", "description": "This figure compares the results of Textual Inversion and DreamBooth methods for text-to-image personalization.  It shows that Textual Inversion tends to focus excessively on the learned concept, neglecting other aspects of the prompt, while DreamBooth often overlooks the learned concept and prioritizes other elements. This is visualized using cross-attention maps, highlighting the misallocation of attention in Textual Inversion and the lack of attention to the learned concept in DreamBooth.", "section": "1 Introduction"}, {"figure_path": "4bINoegDcm/figures/figures_2_1.jpg", "caption": "Figure 3: Overview of AttnDreamBooth. Our method consists of three training stages. In Stage 1, we optimize the textual embedding of the new concept to align its embedding with existing tokens. In Stage 2, we fine-tune the cross-attention layers to refine the attention map. In Stage 3, we fine-tune the entire U-net to capture the subject identity. Moreover, we introduce a cross-attention map regularization term to guide the learning of the attention map.", "description": "This figure illustrates the AttnDreamBooth method's three training stages.  Stage 1 focuses on aligning the new concept's textual embedding with existing tokens. Stage 2 refines the attention map by fine-tuning cross-attention layers. Finally, Stage 3 captures the subject's identity by fine-tuning the entire U-Net. A cross-attention map regularization term is introduced to enhance attention map learning.", "section": "4.2 AttnDreamBooth"}, {"figure_path": "4bINoegDcm/figures/figures_4_1.jpg", "caption": "Figure 4: Analysis of TI+DB. Column (a) demonstrates that TI+DB neglects the learned concept when integrating it into a new prompt, “A painting of a [V] toy in the style of Monet”. Column (b) shows the generated images based on a single word prompt, “[V]”, both before and after fine-tuning, using the diffusion model without fine-tuning. These images are notably similar to each other, which indicates that the learned textual embedding remains largely unchanged from its initial state.", "description": "This figure analyzes the limitations of combining Textual Inversion (TI) and DreamBooth (DB), denoted as TI+DB, for text-to-image generation. Column (a) shows that TI+DB fails to incorporate the learned concept when used in a complex prompt, indicating a problem with concept integration. Column (b) demonstrates that the learned textual embedding remains largely unchanged after fine-tuning, suggesting insufficient learning of the embedding alignment for the new concept, which is a key factor in successful text-to-image personalization.", "section": "4.1 Analysis of Existing Methods"}, {"figure_path": "4bINoegDcm/figures/figures_5_1.jpg", "caption": "Figure 5: Results after each training stage. We present the generations along with the attention maps of \"[V]\" for each stage. In stage 1, the model properly aligns the embedding of [V] with other tokens, \"inside a box\", but learns a very coarse attention map and subject identity. In stage 2, the model refines the attention map and subject identity. In stage 3, the model accurately captures the identity of the concept.", "description": "This figure shows the results of the AttnDreamBooth model after each of its three training stages.  The images generated are shown alongside heatmaps (attention maps) highlighting which parts of the image correspond to the token [V], representing the new concept being learned. Stage 1 shows a rough alignment of the embedding, with a blurry attention map. Stage 2 demonstrates a refined attention map with improved identity.  Stage 3 shows the final result, with an accurate representation of the concept's identity.", "section": "4.2 AttnDreamBooth"}, {"figure_path": "4bINoegDcm/figures/figures_6_1.jpg", "caption": "Figure 6: Qualitative comparison. We present four images generated by our method and two images from each of the baseline methods, including TI+DB [24, 71], NeTI [1], ViCo [30], and OFT [64]. Our method demonstrates superior performance in text alignment and identity preservation compared to these baselines.", "description": "This figure compares the image generation results of AttnDreamBooth against four other state-of-the-art methods (TI+DB, NeTI, ViCo, OFT) across various complex prompts. Each row shows the same prompt with images generated by each method. The images generated by AttnDreamBooth better reflect both the text description and the original concept image compared to other methods, demonstrating its superior performance in both text alignment and identity preservation.", "section": "5 Results"}, {"figure_path": "4bINoegDcm/figures/figures_7_1.jpg", "caption": "Figure 7: Examples of personalized generations obtained using AttnDreamBooth.", "description": "This figure shows several example images generated by the AttnDreamBooth model to demonstrate its ability to generate diverse and high-quality personalized images from complex prompts.  The images showcase different subjects (toys, furbies, bears) in various settings and styles, highlighting the model's capacity for text-aligned personalization.", "section": "5 Experiments"}, {"figure_path": "4bINoegDcm/figures/figures_9_1.jpg", "caption": "Figure 8: Ablation study. We compare models trained without optimizing the textual embedding (w/o Stage 1), without fine-tuning the cross-attention layers (w/o Stage 2), without fine-tuning the U-Net (w/o Stage 3), and without the cross-attention map regularization (w/o Reg). As can be observed, all sub-modules are essential for achieving identity-preserved and text-aligned personalized generations.", "description": "This figure shows the ablation study results of AttnDreamBooth.  It presents a visual comparison of personalized image generation results when different components of the model (textual embedding optimization, cross-attention layer fine-tuning, U-Net fine-tuning, and cross-attention map regularization) are removed. The results demonstrate that all sub-modules are essential to achieve identity preservation and text alignment in personalized image generation.", "section": "5.3 Ablation Study"}, {"figure_path": "4bINoegDcm/figures/figures_19_1.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure shows several example images generated by the proposed AttnDreamBooth method. Each image is generated using a complex prompt that combines a description of an object and a particular style or setting. For example, one prompt is 'as a cowboy draws its tiny revolver in a dusty town showdown, surrounded by cacti and a saloon'. The resulting image shows a sloth dressed as a cowboy.  The diversity and fidelity of the generated images illustrate the effectiveness of AttnDreamBooth in handling complex textual descriptions while maintaining consistency with the learned concept.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_20_1.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure shows several example images generated by the AttnDreamBooth model, showcasing its ability to generate personalized images based on complex and varied text prompts.  Each example shows a subject (a sloth, knight, astronaut, etc.) in a different scenario with a different style specified in the prompt. This demonstrates the model's capacity for precise control over both the subject and scene, indicating the effectiveness of the proposed method in aligning the textual descriptions with the generated imagery.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_21_1.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure showcases the results of AttnDreamBooth, a novel method for text-aligned personalized text-to-image generation.  It demonstrates the ability of the method to generate images based on complex prompts that include multiple details and stylistic elements, achieving high fidelity and alignment with the input text. Each image is generated using a different complex prompt.  The prompts cover a diverse set of scenarios, including descriptions of the subject as different characters or in different environments. The successful generation of these images highlights the model's ability to handle complex text inputs and maintain coherence across multiple aspects of the generated images.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_21_2.jpg", "caption": "Figure 6: Qualitative comparison. We present four images generated by our method and two images from each of the baseline methods, including TI+DB [24, 71], NeTI [1], ViCo [30], and OFT [64]. Our method demonstrates superior performance in text alignment and identity preservation compared to these baselines.", "description": "This figure shows a qualitative comparison of the proposed AttnDreamBooth method against four other state-of-the-art text-to-image personalization methods. For each of five concepts (sloth, doll, fluffy toy, teapot, toy boat), the figure displays four images generated by AttnDreamBooth and two images each from the four comparison methods (TI+DB, NeTI, ViCo, OFT).  The images illustrate the different approaches’ performance in terms of generating images that accurately reflect both the specified concept and the detailed textual descriptions provided in the prompt.", "section": "5 Results"}, {"figure_path": "4bINoegDcm/figures/figures_22_1.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure showcases the capabilities of AttnDreamBooth in generating personalized images based on complex and varied text prompts. Each image shows a subject (a sloth) incorporated into different scenarios and artistic styles as directed by the text prompts.  The results demonstrate the model's ability to accurately integrate the user-specified concept ('a sloth') into diverse and complex scenes while maintaining textual and visual coherence, showcasing the power of text-aligned personalization.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_22_2.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure displays various examples of personalized images generated using the AttnDreamBooth method. Each image depicts a specific object (e.g., a sloth, a knight, an astronaut) placed within diverse scenarios and artistic styles as described by complex text prompts.  The diversity and detail in the generated images highlight the method's ability to precisely control the subject's appearance while adhering to the user's textual instructions.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_22_3.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure showcases the results of the AttnDreamBooth method.  It shows a variety of images generated from complex prompts, demonstrating the model's ability to generate personalized images that accurately reflect both the specified concept and the descriptive text provided. Each image shows a different subject (e.g., sloth, knight, astronaut) rendered in a specific style (e.g., cowboy, cyberpunk) and scene according to the text prompt. The figure highlights the method's capability in preserving the identity of the subject while maintaining text alignment in complex, multi-element prompts.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_22_4.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure showcases the results of the AttnDreamBooth model on various complex prompts.  Each image demonstrates the ability to generate personalized images while maintaining alignment with the descriptive text.  The variety of styles, settings, and attire depicted in the images highlight the model's versatility in handling complex instructions.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_22_5.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure showcases the results of the AttnDreamBooth method applied to various complex prompts. Each image shows a personalized generation with a specific object (e.g., sloth, knight, astronaut) integrated into different styles and contexts according to the prompt. It aims to illustrate the model's ability to generate text-aligned, personalized images while handling intricate and varied textual instructions.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_22_6.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure shows several examples of personalized image generation using the AttnDreamBooth method.  Each image shows a subject (e.g., sloth, knight, astronaut) incorporated into different settings and styles as described by complex text prompts.  The figure visually demonstrates the method's capability to accurately preserve the subject's identity while aligning with the diverse textual descriptions.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_22_7.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure showcases the results of the AttnDreamBooth method on various complex prompts, demonstrating its ability to generate text-aligned and personalized images.  Each image shows a different prompt, where an object (e.g., a sloth) is presented in a specified style and context (e.g., as a cowboy, as a knight, as a musketeer). The diversity and quality of the generated images highlight the efficacy of the proposed method in handling complex text-to-image generation tasks.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_22_8.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure shows several example images generated by the AttnDreamBooth model. Each image shows a personalized object (e.g., sloth, knight, astronaut, etc.) placed in various settings and styles as described in complex text prompts. The figure demonstrates the model's ability to generate high-quality, text-aligned images of personalized concepts, even with intricate textual descriptions.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_22_9.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure showcases the results of AttnDreamBooth, demonstrating its capability to generate high-quality, personalized images based on complex text prompts.  It presents various examples of the model's output, showing different scenarios and styles. Each image depicts a specific subject (a sloth, knight, astronaut, robot, etc.) in different settings and artistic styles, all based on a user-provided textual description.  The quality and coherence of the images suggest effective text alignment and subject identity preservation. The figure visually demonstrates the model's ability to handle complex prompts while maintaining text alignment and identity preservation.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_22_10.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure showcases the results of the AttnDreamBooth method.  It presents several examples of personalized image generation from complex text prompts.  Each image shows a different subject (sloth, knight, astronaut, etc.) rendered in a variety of styles and scenarios described in the prompt. The figure visually demonstrates the model's ability to maintain the identity of the subject while accurately reflecting the details specified in the prompt.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_22_11.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure showcases the results of AttnDreamBooth, a novel method for text-aligned personalized text-to-image generation.  It presents several example prompts, each combining a concept (e.g., a sloth) with a detailed description of its setting and style (e.g., \"as a cowboy draws its tiny revolver in a dusty town showdown, surrounded by cacti and a saloon\"). The corresponding generated images demonstrate the model's ability to accurately represent the specified concept within the complex scene and style described in the text prompt, highlighting its strong text alignment capabilities.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_22_12.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure showcases the results of the AttnDreamBooth method on various complex prompts.  Each image shows a different prompt describing a subject (e.g., a sloth, a knight, a robot) in a specific context and style. The diversity of the generated images and their adherence to the textual description highlights the method's capability in handling nuanced and intricate text-to-image tasks.", "section": "Introduction"}, {"figure_path": "4bINoegDcm/figures/figures_22_13.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure shows several example images generated by the proposed AttnDreamBooth method.  Each image depicts a personalized concept (e.g., a sloth, a knight, a robot) integrated into a complex scene described by a textual prompt. The figure highlights the method's ability to accurately represent the personalized concept within the specified scene, demonstrating successful text alignment and identity preservation.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_22_14.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure showcases the results of the AttnDreamBooth method.  It demonstrates the model's ability to generate images based on complex and nuanced text prompts, incorporating several elements like character costumes, locations, artistic styles, and actions. The success of AttnDreamBooth in aligning the generated image with the detailed prompt is highlighted, showcasing its advantage over previous methods that might overemphasize one aspect of the prompt or ignore others.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_22_15.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure showcases the results of the AttnDreamBooth method, demonstrating its ability to generate images from complex and detailed text prompts.  Each image shows a personalized depiction of a concept (e.g., sloth, knight, astronaut) integrated into diverse scenarios and artistic styles. The figure highlights the model's capacity for both accurate identity preservation of the learned concept and precise alignment with the textual descriptions provided in the prompts.", "section": "1 Introduction"}, {"figure_path": "4bINoegDcm/figures/figures_22_16.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure shows several examples of personalized images generated using the AttnDreamBooth method.  Each image is accompanied by a complex prompt describing the desired scene and style. The goal of the figure is to demonstrate the ability of AttnDreamBooth to generate images accurately reflecting both the personalized concept and the specific instructions within the prompts.  The variety of examples highlights the model's flexibility in handling nuanced and detailed instructions.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_22_17.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure showcases the results of the AttnDreamBooth method on various complex prompts.  It demonstrates the model's ability to generate images of a specific concept (e.g., a sloth) while accurately integrating and aligning the concept with detailed descriptions within different scenes and styles (e.g., as a cowboy, knight, musketeer, astronaut, etc.).  The images highlight successful text alignment and identity preservation, even in complex scenes and varied artistic styles. This figure visually supports the paper's central claim of achieving high-quality personalized text-to-image generation with detailed textual control.", "section": "Introduction"}, {"figure_path": "4bINoegDcm/figures/figures_22_18.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure shows several example images generated by the AttnDreamBooth model.  Each image shows a different subject (sloth, knight, musketeer, astronaut, robot, assassin, Captain America, boatman, automaton) placed in a different setting and style, all based on a complex text prompt. The diversity of the generated images and the accurate representation of the requested elements in each prompt demonstrate the efficacy of the proposed AttnDreamBooth method for text-aligned personalized text-to-image generation.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_22_19.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure showcases the results of the AttnDreamBooth method on various complex text prompts. Each image demonstrates the model's ability to generate images of a specific subject (a sloth, a knight, a musketeer, etc.) placed in various scenes and styles as described in the text prompt, highlighting its ability to maintain subject identity and textual alignment.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_22_20.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure showcases several examples of personalized image generation using the AttnDreamBooth method.  Each image depicts a subject (e.g., a sloth) rendered in a variety of settings and styles, all specified by complex text prompts. The results demonstrate the ability of the method to generate images where the subject's identity is preserved while adhering accurately to diverse textual descriptions.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_22_21.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure shows several examples of personalized images generated using the AttnDreamBooth method. Each image is accompanied by a complex prompt that describes the scene, style, and subject (a specific toy in this case).  The goal is to illustrate the ability of the method to generate images that are both faithful to the user-provided concept (the toy) and consistent with the textual description of the scene, showcasing the method's capability for text-aligned personalization.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_23_1.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure shows several examples of personalized images generated using the AttnDreamBooth method.  Each image is accompanied by a complex text prompt describing the scene and style. The results demonstrate the model's ability to generate images that accurately reflect both the subject (identity preservation) and the textual descriptions (text alignment), even with intricate and varied prompts.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_24_1.jpg", "caption": "Figure 5: Results after each training stage. We present the generations along with the attention maps of \"[V]\" for each stage. In stage 1, the model properly aligns the embedding of [V] with other tokens, \"inside a box\", but learns a very coarse attention map and subject identity. In stage 2, the model refines the attention map and subject identity. In stage 3, the model accurately captures the identity of the concept.", "description": "This figure shows the results of the AttnDreamBooth model after each of its three training stages.  Each stage focuses on a different aspect of learning:  Stage 1 learns embedding alignment (how the new concept relates to existing words); Stage 2 refines the attention map (where the model focuses its attention within the image); and Stage 3 learns the subject identity (ensuring the generated image accurately represents the new concept). The figure includes generated images and their corresponding attention maps to illustrate the model's progress at each stage. The attention maps visually depict where the model focuses its attention when generating the image.", "section": "4.2 AttnDreamBooth"}, {"figure_path": "4bINoegDcm/figures/figures_24_2.jpg", "caption": "Figure 8: Ablation study. We compare models trained without optimizing the textual embedding (w/o Stage 1), without fine-tuning the cross-attention layers (w/o Stage 2), without fine-tuning the U-Net (w/o Stage 3), and without the cross-attention map regularization (w/o Reg). As can be observed, all sub-modules are essential for achieving identity-preserved and text-aligned personalized generations.", "description": "This figure shows the ablation study results of AttnDreamBooth. It presents a visual comparison of personalized images generated by the model with different components removed.  The full model, which includes the textual embedding optimization (Stage 1), cross-attention layer fine-tuning (Stage 2), U-Net fine-tuning (Stage 3), and cross-attention map regularization, is shown alongside variations where each of these components is removed individually. The results demonstrate that all components are crucial for achieving both identity preservation and text alignment in personalized image generation.", "section": "5.3 Ablation Study"}, {"figure_path": "4bINoegDcm/figures/figures_24_3.jpg", "caption": "Figure 6: Qualitative comparison. We present four images generated by our method and two images from each of the baseline methods, including TI+DB [24, 71], NeTI [1], ViCo [30], and OFT [64]. Our method demonstrates superior performance in text alignment and identity preservation compared to these baselines.", "description": "This figure compares the image generation results of AttnDreamBooth against four other state-of-the-art methods for different complex prompts.  It shows that AttnDreamBooth significantly outperforms the other methods in terms of both identity preservation (how well the generated image retains the characteristics of the target concept) and text alignment (how well the generated image matches the given text description).", "section": "5 Results"}, {"figure_path": "4bINoegDcm/figures/figures_25_1.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure shows several examples of personalized image generation results obtained using the proposed AttnDreamBooth method.  Each image is generated from a complex text prompt that combines a description of a scene, an object (the subject), and a style or artistic choice. The examples demonstrate the method's ability to maintain the identity of the subject while successfully incorporating the other elements of the prompt.", "section": "Abstract"}, {"figure_path": "4bINoegDcm/figures/figures_25_2.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure showcases various examples of personalized images generated using the AttnDreamBooth method. Each image is accompanied by a complex text prompt that describes the desired scene, style and subject. The figure demonstrates the model's ability to generate text-aligned images that accurately reflect the content of the prompt, while maintaining the identity of the personalized subject. This highlights the key advantage of AttnDreamBooth over existing methods, which often struggle to balance identity preservation and text alignment when dealing with complex prompts.", "section": "1 Introduction"}, {"figure_path": "4bINoegDcm/figures/figures_25_3.jpg", "caption": "Figure 1: Our method enables text-aligned text-to-image personalization with complex prompts.", "description": "This figure showcases the effectiveness of the AttnDreamBooth method in generating images from complex prompts. It presents various example prompts, each paired with the images generated by the model.  The diversity of the prompts illustrates the method's capability to handle detailed, multifaceted descriptions and generate corresponding visuals.", "section": "1 Introduction"}]