[{"figure_path": "4bINoegDcm/tables/tables_8_1.jpg", "caption": "Table 1: Quantitative comparisons. “Identity” denotes the identity preservation, and “Text” denotes the text alignment.", "description": "This table presents a quantitative comparison of different methods for text-to-image generation, specifically focusing on identity preservation and text alignment.  The methods are compared using two metrics: \"Identity\", which represents how well the generated image retains the identity of the target concept, and \"Text\", which measures how well the generated image aligns with the text prompt. Higher values indicate better performance. The table shows that while some methods excel in one area, AttnDreamBooth achieves a balance between both metrics.", "section": "5.2 Results"}, {"figure_path": "4bINoegDcm/tables/tables_8_2.jpg", "caption": "Table 2: User study. We asked the participants to select the image that better preserves the identity and matches the prompt.", "description": "This table presents the results of a user study comparing AttnDreamBooth to four baseline methods (TI+DB, NeTI, ViCo, and OFT). Participants were shown a concept image and a text prompt, along with two generated images: one from AttnDreamBooth and one from a baseline method. They were asked to choose the image that better preserved the identity of the concept and matched the prompt. The table shows the percentage of participants who preferred each method for each baseline method. For example, 68% of participants preferred AttnDreamBooth over TI+DB, while 83.4% preferred AttnDreamBooth over ViCo.", "section": "5.2 Results"}, {"figure_path": "4bINoegDcm/tables/tables_18_1.jpg", "caption": "Table 3: The prompts used in the quantitative evaluation.", "description": "This table lists the 24 prompts used in the quantitative evaluation of the AttnDreamBooth model.  These prompts are diverse and cover several aspects, including changes in background, environment, concept color, and artistic style, allowing for a comprehensive assessment of the model's performance under varying conditions.  The prompts are designed to test the model's ability to maintain text alignment and identity preservation across different scenarios.", "section": "5.2 Results"}, {"figure_path": "4bINoegDcm/tables/tables_18_2.jpg", "caption": "Table 4: Quantitative ablation study.", "description": "This table presents the quantitative results of an ablation study conducted on the AttnDreamBooth model.  Each row shows the performance of a variant of the model where one of the components (Stage 1, Stage 2, Stage 3, or the regularization term) has been removed.  The results are measured in terms of Identity Preservation and Text Alignment, both represented as an upward-pointing arrow (↑) to denote higher is better. The \"Full Model\" row provides the performance of the complete model. The study demonstrates the importance of each component to the overall performance of the model. Removing any single component leads to a significant decrease in either Identity Preservation or Text Alignment, or both.", "section": "5.3 Ablation Study"}]