[{"figure_path": "hgsS4onO4s/figures/figures_6_1.jpg", "caption": "Figure 2: Estimated density functions.", "description": "The figure compares the estimated density functions produced by three different methods: NCM, QNM, and the proposed \"Our Model\", against a ground truth density function.  The results are shown for a dataset with noise. Each plot shows the estimated density function overlaid on the ground truth function and data points. The figure demonstrates the ability of the three methods to approximate a bimodal density function and visually displays their performances.", "section": "4 Experiments"}, {"figure_path": "hgsS4onO4s/figures/figures_7_1.jpg", "caption": "Figure 2: Estimated density functions.", "description": "The figure compares the estimated density functions obtained using four different methods: NCM, SNF, QNM, and the proposed \"Our Model\".  Each plot shows the estimated density function (solid line), the ground truth density function (dashed line), and the data points used for estimation (small vertical lines at the bottom).  The goal is to visually assess the accuracy and smoothness of each method's estimation of the density function.  Note that SNF significantly overfits, exhibiting multiple local peaks, while Our Model and QNM capture the main features of the bimodal distribution.", "section": "4 Experiments"}, {"figure_path": "hgsS4onO4s/figures/figures_8_1.jpg", "caption": "Figure 3: Estimated intensity functions. Asterisks * represent nodal points.", "description": "This figure compares the estimated intensity functions obtained using three different methods: IEK (Gaussian kernel intensity estimator), STVB (structured variational Bayesian approach with sigmoidal Gaussian Cox processes), and the proposed IMK (inverse M-kernel model).  The x-axis represents the spatial location, and the y-axis represents the intensity.  The black dashed line shows the ground truth intensity function, while the colored lines represent the estimations from each method. The asterisks (*) highlight locations where the intensity is zero. The figure visually demonstrates the IMK's ability to accurately estimate the intensity function, outperforming both IEK and STVB in terms of accuracy and nodal point representation.", "section": "4 Experiments"}, {"figure_path": "hgsS4onO4s/figures/figures_12_1.jpg", "caption": "Figure B1: Estimation results of regression problem on ground truth g(x) = e-|x|² by using reference models (NCM and QNM) with Gaussian kernel e-|x-x'|²/τ² and our model with inverse M-kernel e-|x-x'|/τ.", "description": "This figure shows the estimated non-negative functions for the ground truth function g(x) = e<sup>-|x|²</sup> using three different methods: NCM (Non-negative coefficients Model), QNM (quadratic form of non-negative model), and the proposed Inverse M-kernel model.  It compares their performance for two different sample sizes (N=20 and N=100). The plot visually demonstrates the difference in representation power between the methods.  It highlights the ability of the proposed Inverse M-kernel model to accurately approximate the ground truth function even with a smaller sample size (N=20), while the other two methods struggle to provide a good fit.", "section": "B Additional Results"}]