[{"figure_path": "KXUijdMFdG/figures/figures_2_1.jpg", "caption": "Figure 1: Example Deep Homomorphism Network (DHN) built from two P*-homomorphism layers: C3 and C2. By stacking different homomorphism patterns, DHN can detect new patterns without explicit specifications. This figure demonstrates that the “spoon” pattern can be detected by stacking C3 and C2 homomorphism layers.", "description": "The figure illustrates a Deep Homomorphism Network (DHN) architecture with two layers.  The first layer uses 3-cycles (C3) as patterns to detect local subgraph structures, and the second layer uses 2-cycles (C2). The combination of these layers enables the detection of more complex patterns (like the 'spoon' pattern shown) not explicitly specified in the pattern set.  The shaded areas represent the 'receptive field' of each layer, showing how the pattern detection works cumulatively.", "section": "4 Deep Homomorphism Networks"}, {"figure_path": "KXUijdMFdG/figures/figures_6_1.jpg", "caption": "Figure 1: Example Deep Homomorphism Network (DHN) built from two P*-homomorphism layers: C3 and C2. By stacking different homomorphism patterns, DHN can detect new patterns without explicit specifications. This figure demonstrates that the “spoon” pattern can be detected by stacking C3 and C2 homomorphism layers.", "description": "The figure illustrates a Deep Homomorphism Network (DHN) with two layers. Each layer uses a different set of homomorphism patterns (C3 and C2). The input graphs are processed through these layers, and the output shows that the DHN can detect a new pattern, which is named \"spoon\", that is not explicitly defined in the model.  The illustration demonstrates that by stacking different homomorphism patterns, the DHN can learn to detect complex patterns.", "section": "4 Deep Homomorphism Networks"}, {"figure_path": "KXUijdMFdG/figures/figures_25_1.jpg", "caption": "Figure 1: Example Deep Homomorphism Network (DHN) built from two P*-homomorphism layers: C3 and C2. By stacking different homomorphism patterns, DHN can detect new patterns without explicit specifications. This figure demonstrates that the “spoon” pattern can be detected by stacking C3 and C2 homomorphism layers.", "description": "This figure illustrates the architecture of a Deep Homomorphism Network (DHN) built using two homomorphism layers (C3 and C2).  It demonstrates how stacking different homomorphism layers enables the detection of complex patterns, such as the 'spoon' pattern, which are not explicitly specified in the model.  This highlights the ability of DHNs to learn complex graph structures by combining simpler patterns.", "section": "4 Deep Homomorphism Networks"}]