[{"figure_path": "KSyTvgoSrX/tables/tables_12_1.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.18, δ = ε/n", "description": "This table presents numerical results for the expected factorization error of different matrix factorization methods (BSR, sqrt, AOF, Id, A) for various workload matrix sizes (n).  The settings used were α = 1, β = 0 (no momentum), k = 1 (single participation), and b = k/n. The privacy parameters were ε = 1.18 and δ = ε/n. The results are shown graphically in Figure 3.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_15_1.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: a = 1, β = 0, k = 1, b = k/n", "description": "This table presents the numerical results obtained from experiments shown in Figure 3 of the paper. It compares the expected factorization error for different matrix factorization methods: BSR, square root, AOF, Id, and A.  The error is calculated for various workload matrix sizes (n) under specific hyperparameters (α=1, β=0, k=1, b=k/n). This illustrates the relative performance of these methods in terms of the approximation quality achieved when factoring the workload matrix.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_15_2.jpg", "caption": "Table 3: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0.9, k = 1, b = k/n", "description": "This table presents numerical results for the expected factorization error, comparing the banded square root (BSR) factorization with other methods such as approximately optimal factorization (AOF), identity factorization (Id), and factorization A (A).  The results are categorized by workload matrix size (n) and show the error for each method under the specified settings (α = 1, β = 0.9, k = 1, b = k/n).  These settings represent a specific scenario in stochastic gradient descent (SGD) model training with momentum and weight decay.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_15_3.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n", "description": "This table presents numerical results for the expected factorization error, comparing the proposed BSR method with the Approximately Optimal Factorization (AOF) and baseline methods.  The results are shown for different workload matrix sizes (n), with α = 1 (no weight decay) and β = 0 (no momentum).  The error is calculated using the Frobenius norm of the error matrix, which measures the overall approximation error of the factorization.  The table specifically shows how the errors change as the matrix size is increased. The 'sqrt' column shows the results using a plain square root decomposition which is a common baseline.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_16_1.jpg", "caption": "Table 3: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0.9, k = 1, b = k/n, ε = 4, δ = 10⁻⁵", "description": "This table presents numerical results comparing the expected factorization error for different matrix factorization methods. The workload matrices stem from SGD with momentum (β = 0.9) and weight decay (α = 1). It shows the results for different matrix sizes (n) in the single participation setting (k = 1, b = k/n). The methods compared include the banded square root (BSR) factorization, the plain square root factorization, the approximately optimal factorization (AOF), and two baselines. The privacy parameters are ε = 4 and δ = 10⁻⁵.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_16_2.jpg", "caption": "Table 4: Numeric results for Figure 3 as well as a plain square root decomposition: α = 0.9999, β = 0, k = 1, b = k/n", "description": "This table presents numerical results for the expected factorization error, comparing the proposed BSR method against three others: a plain square root decomposition, the approximately optimal factorization (AOF), and a baseline method.  The results are organized by workload matrix size (n) and show the error for each method.  The values illustrate the performance of the different factorization approaches under the specific hyperparameter setting of α = 0.9999, β = 0, k = 1, and b = k/n (single participation).  The lower the error, the better the performance of the factorization method.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_16_3.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/n", "description": "This table presents numerical results from experiments evaluating the expected factorization error for different workload matrix sizes (n).  The results are broken down for four different factorization methods: BSR (banded square root), sqrt (plain square root), AOF (approximately optimal factorization), Id (identity factorization), and A (baseline factorization).  The settings for these experiments include α (weight decay parameter) = 1, β (momentum parameter) = 0, k (maximal number of data item participations) = 1, b (min-separation parameter) = k/n, ε (privacy parameter) = 1.8, and δ (privacy parameter) = ε/n. The table shows that BSR consistently achieves lower errors compared to the baseline methods (Id and A), and is often comparable to AOF.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_17_1.jpg", "caption": "Table 8: Numeric results for Figure 3 as well as a plain square root decomposition: a = 0.99, β = 0, k = 1, b = k/n", "description": "This table presents numerical results comparing the expected factorization error for different matrix factorization methods. The methods compared are BSR (banded square root), sqrt (plain square root), AOF (approximately optimal factorization), Id (identity matrix), and A (workload matrix).  The results are shown for different workload matrix sizes (n), specifically with parameters alpha (α) = 0.99, beta (β) = 0, k = 1 (single participation), and b = k/n. Lower values in the table indicate better approximation quality.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_17_2.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/n", "description": "This table presents numerical results that validate the theoretical findings in Figure 3. It compares the expected factorization error of different matrix factorization methods (BSR, sqrt, AOF, Id, A) for various workload matrix sizes (n).  The settings used are α=1, β=0, k=1, b=k/n, ε=1.8, δ=ε/n.  The 'sqrt' column represents a plain square root decomposition, which is used as a baseline.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_17_3.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: a = 1, β = 0, k = 1, b = k/n", "description": "This table presents numerical results for the expected factorization error of various matrix factorization methods, including BSR, square root, AOF, Id, and A. These results are obtained for different sizes (n) of the workload matrix and are visualized in Figure 3. The parameters a, β, k, and b are fixed to specific values (1, 0, 1, and k/n, respectively). The table illustrates the approximation error for each method at different problem scales.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_18_1.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.18, ε/δ = 6/0", "description": "This table presents the numeric results obtained from an experiment shown in Figure 3 of the paper. It compares the expected factorization error of different matrix factorization methods for specific hyperparameter settings (α = 1, β = 0, k = 1, b = k/n). The methods compared include BSR (Banded Square Root), sqrt (plain square root), AOF (Approximately Optimal Factorization), Id (Identity), and A (Workload Matrix).  The table shows the expected factorization error for different workload matrix sizes (n).  The values of ε and δ relate to the level of privacy achieved in the differentially private model training context.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_18_2.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n", "description": "This table presents numerical results comparing the expected factorization error of different matrix factorization methods (BSR, sqrt, AOF, Id, A) for various workload matrix sizes (n). The specific setting used for this comparison is α = 1, β = 0, k = 1, and b = k/n.  The table complements Figure 3 in the paper by providing the exact numerical values that the figure visualizes.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_18_3.jpg", "caption": "Table 11: Numeric results for Figure 4 as well as a plain square root decomposition: α = 0.999, β = 0.9, k = 1, b = 0", "description": "This table presents the expected factorization error for different workload matrix sizes (n) using various factorization methods: BSR (Banded Square Root), sqrt (square root), AOF (approximately optimal factorization), Id (identity), and A (baseline).  The results are based on the setting where α = 0.999, β = 0.9, k = 1, and b = 0. Lower error values indicate better performance.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_18_4.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/n", "description": "This table presents the numerical results obtained for different workload matrix sizes (n) using four different factorization methods: Banded Square Root (BSR), plain square root, Approximately Optimal Factorization (AOF), and two baseline methods (Id and A). The expected factorization error is reported for each method.  The parameters α (weight decay), β (momentum), k (maximal number of participation), and b (minimal separation) are set to 1, 0, 1, and k/n respectively.  The privacy parameters ε and δ are 1.8 and ε/n respectively. The results illustrate how the approximation error changes as the size of the workload matrix increases.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_19_1.jpg", "caption": "Table 11: Numeric results for Figure 4 as well as a plain square root decomposition: a = 0.999, β = 0.9, k = 1, b = 0", "description": "This table presents numerical results for the expected factorization error of different matrix factorization methods.  The results are shown for different workload matrix sizes (n) and are compared across several methods: BSR (Banded Square Root), sqrt (square root), AOF (Approximately Optimal Factorization), Id (identity matrix factorization), and A (baseline factorization with A = A * Id). The values are obtained using parameter settings of alpha (α)=0.999 and beta (β)=0.9, with k=1 (single participation) and b=0. The table is part of the experimental results section. It helps to validate the theoretical findings and show the practical performance of the BSR compared to baseline and state-of-the-art methods.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_19_2.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/η", "description": "This table presents the expected factorization error for different workload matrix sizes (n) using four factorization methods: BSR, square root, AOF, Id, and A.  The results are for the specific setting of α (weight decay) = 1, β (momentum) = 0, k (maximal participation) = 1, and b (min-separation) = k/n. The privacy parameters (ε, δ) are also specified.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_19_3.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/n", "description": "This table presents numerical results for the expected factorization error using different factorization methods (BSR, sqrt, AOF, Id, A) for various workload matrix sizes (n).  The settings used are α = 1 (no weight decay), β = 0 (no momentum), k = 1 (single participation), and b = k/n (each data item contributes at most once). The privacy parameters are ε = 1.8 and δ = ε/n.  The results demonstrate the relative approximation errors for each method compared to the optimal factorization (AOF).", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_20_1.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.18, δ = ε/η", "description": "This table presents the numerical results obtained from experiments for different workload matrix sizes (n). The expected factorization error is calculated for four different factorization methods: BSR (banded square root), sqrt (plain square root), AOF (approximately optimal factorization), Id (identity matrix), and A (original matrix).  The experiment parameters are α = 1, β = 0, k = 1, b = k/n, ε = 1.18, and δ = ε/η. The results demonstrate the performance of different factorization methods and the impact of increasing the matrix size on the factorization error. ", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_21_1.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/n", "description": "This table presents the numerical results obtained for the expected factorization error using different factorization methods (BSR, sqrt, AOF, Id, A) on workload matrices from SGD with specific hyperparameters (α = 1, β = 0). The error is calculated for various sizes of workload matrices (n), considering single participation (k = 1) and repeated participation scenarios (b = k/n). The privacy parameters are ε = 1.8 and δ = ε/n.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_21_2.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/n", "description": "This table presents numerical results that compare the expected factorization error of four different matrix factorization methods (BSR sqrt, AOF, Id, A) for various workload matrix sizes (n).  The hyperparameters used are α = 1, β = 0, k = 1, and b = k/n. The privacy parameters are ε = 1.8 and δ = ε/n. The results are visualized in Figure 3 of the paper.  The table shows how the expected factorization error changes with increasing workload matrix size for each of the methods.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_21_3.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/n", "description": "This table presents the numeric results obtained from experiments depicted in Figure 3. The experiments compare the expected factorization error of different matrix factorization techniques (BSR, sqrt, AOF, Id, A) in the setting where α = 1, β = 0, k = 1, b = k/n, ε = 1.8, and δ = ε/n. The table shows the error for various matrix sizes (n).", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_22_1.jpg", "caption": "Table 22: Numeric values for results in Table 5 bottom left plot (CIFAR-10, repeated participation, (ε, δ) = (8, 10⁻⁵).", "description": "This table provides numerical values corresponding to the results shown in the bottom-left plot of Figure 5.  The figure displays classification accuracy on the CIFAR-10 dataset with privacy parameters (ε, δ) = (8, 10⁻⁵) for a single epoch using varying batch sizes. This table breaks down the accuracy for BSR, AOF, Id, and A for different numbers of updates (50, 100, 200, 400, 500, 1000, 2000), showing the mean ± standard deviation over 5 independent training runs.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_22_2.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/n", "description": "This table presents numerical results obtained from experiments comparing the expected factorization error of different matrix factorization methods for a specific setting of hyperparameters (α = 1, β = 0, k = 1, b = k/n) and privacy parameters (ε = 1.8, δ = ε/n). The methods compared include BSR (banded square root), sqrt (plain square root), AOF (approximately optimal factorization), Id (identity matrix), and A (workload matrix). The table shows the expected factorization error for different workload matrix sizes (n).", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_23_1.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.18 ε/α", "description": "This table presents numerical results for the expected factorization error of different matrix factorization methods, including BSR, sqrt, AOF, Id, and A, as shown in Figure 3 of the paper. The results are for the setting where α (weight decay parameter) = 1, β (momentum parameter) = 0, k (maximal number of data item participations) = 1, b (min-separation parameter) = k/n, and ε (privacy parameter) = 1.18ε/α.  The table shows the error for different workload matrix sizes (n).", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_23_2.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: a = 1, β = 0, k = 1, b = k/n", "description": "This table presents the numerical results obtained from experiments. The results are broken down according to the workload matrix size (n).  For each size, the table lists the expected factorization error using four different methods: BSR (Banded Square Root), sqrt (plain square root), AOF (Approximately Optimal Factorization), Id (baseline factorization), and A (baseline factorization). The experiment uses settings where alpha = 1, beta = 0, k = 1, and b = k/n, as specified in the caption.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_24_1.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: a = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/n", "description": "This table presents the numerical results obtained from experiments comparing the approximation error of different matrix factorization methods (BSR, sqrt, AOF, Id, A).  The experiment setting uses a workload matrix generated from SGD with parameters α = 1, β = 0, k=1, and b = k/n, where α is the weight decay, β is the momentum, k is the maximal number of participations, and b is the minimal separation. The privacy parameters are ε = 1.8 and δ = ε/n, representing the privacy level.  The table shows the expected factorization error for different sizes of the workload matrix (n).  The results illustrate the approximation quality of each factorization method, showing how well each method approximates the true workload matrix under the given settings.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_24_2.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: a = 1, β = 0, ε = 1.18 ε/η", "description": "This table presents numerical results from experiments comparing different matrix factorization methods for differentially private SGD model training.  The results shown correspond to those plotted in Figure 3 for a specific setting: alpha (weight decay) =1, beta (momentum) = 0, with epsilon = 1.18ε/η. The table compares the expected approximation error for BSR (Banded Square Root), sqrt (plain square root), AOF (Approximately Optimal Factorization), Id (identity matrix), and A (workload matrix) factorizations, across varying numbers (n) of update steps. Lower approximation error is better.  This demonstrates the relative performance of these factorizations under specific hyperparameter conditions.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_24_3.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: a = 1, β = 0, k = 1, b = k/n", "description": "This table presents the numerical results obtained from experiments comparing the expected factorization error of different matrix factorization methods (BSR, sqrt, AOF, Id, A) for various workload matrix sizes (n). The experimental setup involves single data participation (k=1), no momentum (β=0), and no weight decay (α=1).  The results are shown for both the banded square root factorization (BSR) and for the ordinary square root. The table also includes the results for other baseline methods for comparison.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_25_1.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.18 ε/η", "description": "This table presents numerical results for the expected factorization error of different matrix factorization methods (BSR, sqrt, AOF, Id, A) under specific settings: α = 1, β = 0, k = 1, b = k/n, ε = 1.18 ε/η.  The results are displayed for various workload matrix sizes (n).  The 'sqrt' column likely indicates the results obtained using a plain square root decomposition.  The table shows that BSR demonstrates comparable error to the AOF, generally outperforming other baseline methods. These results visually correspond to those illustrated in Figure 3 of the paper.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_25_2.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/n", "description": "This table presents the numerical results obtained from experiments comparing different matrix factorization techniques, specifically the banded square root factorization (BSR) and others like AOF, Id, and A.  The results are shown for different workload matrix sizes (n).  The setup uses α = 1, β = 0, k = 1, and b = k/n, which represent specific parameter settings for stochastic gradient descent (SGD) with momentum and weight decay. The error metrics used are ε = 1.8 and δ = ε/n, representing differential privacy parameters.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_25_3.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/n", "description": "This table presents numerical results for the expected factorization error, comparing BSR, square root, AOF, Id, and A methods across various workload matrix sizes (n).  The results are based on the setting described in Figure 3, with α = 1, β = 0, k = 1, and b = k/n.  The privacy parameters used are ε = 1.8 and δ = ε/n. The table helps to understand the performance of each matrix factorization method in terms of approximation error.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_26_1.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/η", "description": "This table presents the numerical results for the expected factorization error of four different factorization methods (BSR sqrt, AOF, Id, A) applied to the workload matrices from Figure 3. The experimental setting is for single participation (k=1) with α=1, β=0 and b=k/n. The privacy parameters are set to ε=1.8 and δ=ε/η.  The results show the values of the expected factorization error for various workload matrix sizes (n).", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_26_2.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.18, δ = ε/η", "description": "This table presents the numerical results obtained from experiments comparing different matrix factorization methods for a specific setting where the workload matrix is characterized by α = 1, β = 0, k = 1, b = k/n, with privacy parameters ε = 1.18, and δ = ε/η.  The results show the expected factorization error, a metric reflecting the quality of the factorization obtained by each method.  The methods compared include BSR (banded square root), sqrt (plain square root), AOF (approximately optimal factorization), Id, and A (baseline factorizations). The table shows how the error changes as the workload matrix size, n, increases.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_26_3.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/n", "description": "This table presents numerical results on the expected factorization error for different workload matrix sizes (n).  It compares the performance of the Banded Square Root (BSR) factorization with the Approximately Optimal Factorization (AOF) and baseline methods (Id and A).  The settings are α = 1, β = 0, k = 1, b = k/n, ε = 1.8, and δ = ε/n, which represent specific parameters related to the stochastic gradient descent (SGD) algorithm used in differentially private model training.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_27_1.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/η", "description": "This table presents the numerical results obtained from the experiments shown in Figure 3.  It compares the expected factorization error for different workload matrix sizes (n) using four methods: the banded square root (BSR) factorization, the plain square root factorization (sqrt), the approximately optimal factorization (AOF), and the baseline factorizations (Id, A). The hyperparameters used are α=1, β=0, k=1, b=k/n, ε=1.8, δ=ε/η.  The results illustrate the relative performance of each method in terms of the approximation error as the workload matrix size increases.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_27_2.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/η", "description": "This table shows the numeric results for the expected factorization error of the banded square root factorization (BSR), approximately optimal factorization (AOF), and baseline factorizations (Id and A). These results are obtained for different workload matrix sizes (n) with specific hyperparameters: α = 1, β = 0, k = 1, and b = k/n. The privacy parameters are set to ε = 1.8 and δ = ε/η. The table complements Figure 3, providing numerical values corresponding to the results shown graphically in the figure.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_27_3.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: a = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/n", "description": "This table presents numerical results obtained from experiments comparing different matrix factorization methods. It includes the expected factorization error, calculated using the BSR factorization, the square root factorization, the AOF factorization, the identity factorization, and the baseline factorization. The experiment setting involves the parameters α=1, β=0, k=1, and b=k/n. The privacy parameters used are ε=1.8 and δ=ε/n.", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_28_1.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/n", "description": "This table presents the numerical results obtained for the expected factorization error using different factorization methods (BSR, sqrt, AOF, Id, A) for varying workload matrix sizes (n). The results are based on Figure 3 from the paper and uses a plain square root decomposition with specific hyperparameter settings (α = 1, β = 0, k = 1, b = k/n, ε = 1.8, δ = ε/n). The error is the expected approximation error, and the table shows how the performance varies for different workload sizes. The methods compared include the proposed Banded Square Root (BSR) factorization and several baselines (plain square root, approximately optimal factorization (AOF), identity matrices).", "section": "Experiments"}, {"figure_path": "KSyTvgoSrX/tables/tables_28_2.jpg", "caption": "Table 2: Numeric results for Figure 3 as well as a plain square root decomposition: α = 1, β = 0, k = 1, b = k/n, ε = 1.18 ε/α", "description": "This table presents numerical results for the expected factorization error of different matrix factorization methods (BSR, sqrt, AOF, Id, A) for various workload matrix sizes (n). The setting used is single participation (k=1), with weight decay (α=1) and no momentum (β=0). The error is calculated for the square root decomposition, and the privacy parameter ε is set to 1.18ε/α.", "section": "Experiments"}]