[{"figure_path": "wZgw4CrxwK/tables/tables_5_1.jpg", "caption": "Table 1: Correspondence between cost-robust contracts and hypothesis tests, arising from Theorem 1.", "description": "This table summarizes the correspondence between the economic objectives of minimizing budget and pay, their corresponding objective functions, the statistical objectives in hypothesis testing (minimizing false positives and negatives or minimizing the ratio of false positives to true positives), and their respective risk functions.  Theorem 1 in the paper establishes this relationship.", "section": "Hypothesis Testing and Contracts"}, {"figure_path": "wZgw4CrxwK/tables/tables_8_1.jpg", "caption": "Table 2: Monotone contracts curated on the MT-bench dataset. Costs are in units of $/1M tokens, and are order-of-magnitude estimates based on typical prices of electricity (see Appendix E.1). The numbers in bold denote the relative increase from the optimal monotone contract that the cost-robustness sacrifices in each setting. The percentages denote the price of cost-robustness: how much the objective values increase relative to the cost-aware setting.", "description": "This table compares the performance of cost-aware and cost-robust monotone contracts for the MT-bench dataset, in terms of expected payment, budget, and standard deviation.  It shows the cost (increase in objective values) of ensuring cost robustness for each optimization objective. The cost is expressed both as an absolute value and a percentage increase compared to the cost-aware contract.", "section": "5.2 Multi-outcome contracts"}, {"figure_path": "wZgw4CrxwK/tables/tables_22_1.jpg", "caption": "Table 3: Estimated energy costs for the Llama2 and CodeLlama model families, according to the methodology described in Appendix E.1.", "description": "This table presents the estimated costs of using different sized language models from the Llama2 and CodeLlama families.  The costs are expressed in dollars per million tokens and are calculated based on energy consumption data from the Hugging Face LLM Performance Leaderboard, using a conservative cost estimate of $0.105 per kWh.  The table shows that costs increase with model size, as expected.", "section": "5 Empirical Evaluation"}, {"figure_path": "wZgw4CrxwK/tables/tables_23_1.jpg", "caption": "Table 4: Model verbosities (average output length) of the models in consideration. Since the values are of the same order of magnitude, we assume for simplification that the choice of model does not significantly affect verbosity (see Appendix E.1).", "description": "This table shows the average output length (verbosity) for three different sizes of Llama-2 chat models (7B, 13B, and 70B parameters).  The authors note that since the values are similar, they simplified their cost calculations by assuming that model size does not significantly impact the response length.", "section": "E.1 Inference Costs"}, {"figure_path": "wZgw4CrxwK/tables/tables_23_2.jpg", "caption": "Table 5: Cost-aware vs Cost-robust contracts in the non-monotone setting. The numbers in bold denote the optimal values achieved for the 3 objectives. The percentages denote the relative increase from the optimal that the cost-robustness sacrifices in each setting.", "description": "This table presents a comparison of cost-aware and cost-robust contracts in a non-monotone setting, focusing on three optimization objectives: minimizing expected payment, minimizing maximum payment, and minimizing variance.  For each objective, it shows the expected payment (E[t]), maximum payment (maxtj), and standard deviation (stdev(t)) for both cost-aware and cost-robust contracts. The percentage increase in each metric for the cost-robust contract compared to the cost-aware contract is also provided, illustrating the trade-off between robustness and optimality.", "section": "5.2 Multi-outcome contracts"}, {"figure_path": "wZgw4CrxwK/tables/tables_23_3.jpg", "caption": "Table 5: Cost-aware vs Cost-robust contracts in the non-monotone setting. The numbers in bold denote the optimal values achieved for the 3 objectives. The percentages denote the relative increase from the optimal that the cost-robustness sacrifices in each setting.", "description": "This table compares the performance of cost-aware and cost-robust contracts for three different optimization objectives (min-pay, min-budget, and min-variance) when monotonicity constraints are not imposed. It shows that cost-robust contracts offer only a small increase in the objective values compared to the cost-aware contracts.", "section": "5.2 Multi-outcome contracts"}]