[{"figure_path": "RJG8ar4wHA/tables/tables_6_1.jpg", "caption": "Table 1: The performance of traffic prediction tasks (12 → 24) on four real-world datasets. The best results are shown in bold and the second best results are underlined.", "description": "This table presents the performance comparison of several traffic flow prediction models on four real-world datasets (PEMS08, PEMS04, SD, GBA). The models are evaluated using two metrics: Mean Absolute Error (MAE) and Root Mean Squared Error (RMSE). Lower values of MAE and RMSE indicate better performance. The results show that the proposed model, EpoD, achieves the best performance on three out of four datasets, demonstrating its effectiveness and superiority over other state-of-the-art models.", "section": "4.2 Performance Analysis on Real-world Datasets"}, {"figure_path": "RJG8ar4wHA/tables/tables_7_1.jpg", "caption": "Table 2: AUC score (% ) of future link prediction task on real-world social relationship datasets. The best results are shown in bold and the second best results are underlined.", "description": "This table presents the Area Under the Curve (AUC) scores, a metric for evaluating the performance of link prediction models on social relationship datasets.  It compares the performance of several models (DySAT, IRM, VREx, GroupDRO, DIDA, EAGLE, and the proposed EpoD) across three datasets (Collab, Yelp, and ACT).  Higher AUC scores indicate better performance. The best and second-best results for each dataset are highlighted in bold and underlined, respectively.", "section": "4.2 Performance Analysis on Real-world Datasets"}, {"figure_path": "RJG8ar4wHA/tables/tables_8_1.jpg", "caption": "Table 3: Ablation results on dynamic subgraph in EpoD. MAE performance on PEMS08 and PEMS04, AUC(%) score on Yelp.", "description": "This table presents the ablation study results comparing three versions of the EpoD model: EpoD-NoSub (without dynamic subgraphs), EpoD-PartitionSub (with partition-based subgraph extraction), and EpoD (the proposed model with node-centered dynamic subgraphs).  The results, in terms of MAE (Mean Absolute Error) for traffic flow prediction datasets PEMS08 and PEMS04, and AUC (Area Under the Curve) for the social network dataset Yelp, demonstrate the impact of incorporating dynamic subgraphs on model performance and the superiority of the proposed node-centered approach.", "section": "4.4 Ablation Study"}, {"figure_path": "RJG8ar4wHA/tables/tables_9_1.jpg", "caption": "Table 4: Efficiency analysis of EpoD (s/epoch).", "description": "This table presents the efficiency analysis of the proposed EpoD model in terms of seconds per epoch (s/epoch) for different datasets.  It compares EpoD's efficiency against two other models, DIDA and EAGLE, across three datasets: COLLAB, Yelp, and ACT.  Lower numbers indicate better efficiency.", "section": "4.5 Efficiency Analysis"}, {"figure_path": "RJG8ar4wHA/tables/tables_14_1.jpg", "caption": "Table 1: The performance of traffic prediction tasks (12 → 24) on four real-world datasets. The best results are shown in bold and the second best results are underlined.", "description": "This table presents the Mean Absolute Error (MAE) and Root Mean Squared Error (RMSE) for traffic flow prediction tasks on four real-world datasets: PEMS08, PEMS04, SD(2019-2020), and GBA(2019-2020).  The table compares the performance of the proposed EpoD model against several baseline models (GWNET, AGCRN, Z-GCNETS, DSTAGNN, STGNCDE, CaST). The best and second-best results for each dataset and metric are highlighted in bold and underlined, respectively. The results demonstrate the superior performance of EpoD for long-sequence traffic flow prediction.", "section": "4.2 Performance Analysis on Real-world Datasets"}, {"figure_path": "RJG8ar4wHA/tables/tables_17_1.jpg", "caption": "Table 1: The performance of traffic prediction tasks (12 → 24) on four real-world datasets. The best results are shown in bold and the second best results are underlined.", "description": "This table presents a comparison of the Mean Absolute Error (MAE) and Root Mean Squared Error (RMSE) for traffic flow prediction across four real-world datasets (PEMS08, PEMS04, SD, and GBA).  The models compared include GWNET, AGCRN, Z-GCNETS, DSTAGNN, STGNCDE, CaST, and the proposed EpoD model.  The results are shown for a 12-step prediction task (predicting the next 24 time steps given the previous 12).  The best performing model for each metric on each dataset is highlighted in bold, while the second-best is underlined.", "section": "4.2 Performance Analysis on Real-world Datasets"}, {"figure_path": "RJG8ar4wHA/tables/tables_18_1.jpg", "caption": "Table 1: The performance of traffic prediction tasks (12 → 24) on four real-world datasets. The best results are shown in bold and the second best results are underlined.", "description": "This table presents the Mean Absolute Error (MAE) and Root Mean Squared Error (RMSE) for traffic flow prediction on four real-world datasets using different models.  The task is to predict the next 24 time steps given the previous 12 time steps.  The models compared include GWNET, AGCRN, Z-GCNETs, DSTAGNN, STGNCDE, CaST, and the proposed EpoD model.  The best performing model for each metric on each dataset is highlighted in bold, with the second best underlined. This allows for a comparison of model performance across different datasets and metrics, showcasing the effectiveness of the proposed model.", "section": "4.2 Performance Analysis on Real-world Datasets"}, {"figure_path": "RJG8ar4wHA/tables/tables_20_1.jpg", "caption": "Table 8: The performance (MAE) of different L in Eq. 12 on PEMS08.", "description": "This table shows the Mean Absolute Error (MAE) achieved by the EpoD model on the PEMS08 dataset for different values of the hyperparameter L used in Equation 12.  The hyperparameter L controls the size of the node-centered dynamic subgraph used in the model, with a larger value indicating a larger subgraph. The table shows the MAE for values of L ranging from 1 to 10, illustrating how the model's performance changes with varying subgraph sizes. This analysis helps to determine the optimal value of L for balancing performance and computational cost.", "section": "4.4 Ablation Study"}, {"figure_path": "RJG8ar4wHA/tables/tables_21_1.jpg", "caption": "Table 1: The performance of traffic prediction tasks (12 → 24) on four real-world datasets. The best results are shown in bold and the second best results are underlined.", "description": "This table presents the Mean Absolute Error (MAE) and Root Mean Squared Error (RMSE) for traffic flow prediction tasks on four real-world datasets: PEMS08, PEMS04, SD(2019-2020), and GBA(2019-2020). It compares the performance of the proposed EpoD model against several baseline models, namely GWNET, AGCRN, Z-GCNETS, DSTAGNN, STGNCDE, and CaST.  The results show MAE and RMSE values for each model on each dataset, with the best performing model for each dataset highlighted in bold and the second-best underlined. This allows for a direct comparison of the EpoD model's performance against existing state-of-the-art methods on a variety of traffic flow datasets.", "section": "4.2 Performance Analysis on Real-world Datasets"}]