[{"figure_path": "qbvt3ocQxB/tables/tables_5_1.jpg", "caption": "Table 1: Effectiveness validation of IODA. Source domain dataset: DF2K [1]. Target domain dataset: RealSR_Canon [2]. Network architecture: SAFMN [26].", "description": "This table presents the results of an effectiveness validation experiment for the IODA method.  It compares the Peak Signal-to-Noise Ratio (PSNR) and Structural Similarity Index (SSIM) scores obtained using three different methods: a baseline, an image-guided method, and the full IODA method. The source domain dataset used for pre-training is DF2K, while the target domain dataset for testing is RealSR_Canon. The experiment employs the SAFMN network architecture.  The table showcases the improvement in PSNR and SSIM achieved by incorporating the proposed techniques, demonstrating the effectiveness of IODA in one-shot domain adaptation for super-resolution.", "section": "3.1 Experiment details"}, {"figure_path": "qbvt3ocQxB/tables/tables_6_1.jpg", "caption": "Table 2: Ablation experiments on image-guided domain adaptation, using the DF2K [1] dataset as the source domain dataset and RealSR_Canon [2] as the target domain dataset, with the SAFMN network architecture [26]. The performance of the pre-trained network (pre-trained on the source domain) on the target domain is represented as the baseline. - Indicates that the corresponding domain adaptive method is ineffective for SR task.", "description": "This table presents ablation study results on image-guided domain adaptation for super-resolution (SR).  It compares the performance of different methods on the RealSR_Canon dataset using the SAFMN network architecture.  The baseline represents the performance of the network pre-trained only on the source domain (DF2K). The table shows that using real high-resolution (HR) images during adaptation slightly improves performance, whereas text-guided adaptation fails to improve performance at all.  The proposed Image-Guided & SR method provides the best performance among those studied.", "section": "3.2 Ablation experiment"}, {"figure_path": "qbvt3ocQxB/tables/tables_6_2.jpg", "caption": "Table 3: Ablation experiments on diversity strategies, using the DF2K [1] dataset as the source domain dataset and RealSR_Canon [2] as the target domain dataset, with the SAFMN network architecture [26]. The baseline refers to the domain adaptation performance after incorporating image-guided domain adaptation without any diversity enhancement.", "description": "This table presents ablation study results on different diversity strategies used in the IODA method.  It shows the PSNR and SSIM values achieved using various approaches: a baseline without any diversity strategy, using only occlusion masks, using region-range masks with different generation methods (grid, box, instance), and a combination of occlusion and instance-based region-range masks (IODA).  The results demonstrate the effectiveness of the instance-guided target domain distribution expansion strategy in improving the performance of one-shot domain adaptation.", "section": "3.2 Ablation experiment"}, {"figure_path": "qbvt3ocQxB/tables/tables_7_1.jpg", "caption": "Table 4: Robustness experiments on different source and target domain datasets with the pre-trained network SAFMN [26]. → signifies the domain adaptation from the source domain to the target domain.", "description": "This table presents the results of experiments evaluating the robustness of the IODA method across various source and target domain datasets.  The baseline represents the performance of the pre-trained SAFMN network without domain adaptation, and \"Add IODA\" shows the performance after applying the IODA method.  The results are shown in terms of PSNR and SSIM metrics. The table demonstrates how well IODA generalizes across different datasets.", "section": "3.2.4 Ablation experiments on different datasets"}, {"figure_path": "qbvt3ocQxB/tables/tables_8_1.jpg", "caption": "Table 5: Robustness experiments on different networks architectures, with the source domain dataset: DF2K and target domain dataset: RealSR_Canon. The performance of the pre-trained network (pre-trained on the source domain) on the target domain is represented as the baseline. Fine-tune refers to the network utilizing all samples from the target domain HRTarget to fine-tune the pre-trained weights from the souce domain (Same as the original papers).", "description": "This table shows the performance of three different super-resolution (SR) networks (SAFMN, HAT, and SRFormer) on the RealSR_Canon dataset.  It compares the baseline performance (using only pre-trained weights from the DF2K dataset), the performance after fine-tuning on the full RealSR_Canon dataset, and the performance after applying the proposed IODA method.  The results demonstrate the robustness of IODA across different network architectures.", "section": "3.2.5 Ablation experiments on different network architectures"}, {"figure_path": "qbvt3ocQxB/tables/tables_8_2.jpg", "caption": "Table 6: Performance comparison on the RealSR_Canon [2] real-world dataset. - Indicates that the corresponding domain adaptive method is ineffective for SR task. None indicates that the results are temporarily unavailable. Time represents the duration of domain adaptive training.", "description": "This table compares the performance of IODA with other state-of-the-art super-resolution (SR) methods on the RealSR_Canon dataset.  It shows the PSNR and SSIM values achieved by each method, as well as the training time.  The results demonstrate that IODA achieves competitive performance while requiring significantly less training time compared to many existing methods.", "section": "3.3 Comparative experiment"}]