[{"figure_path": "giXUx4VH9t/tables/tables_6_1.jpg", "caption": "Table 1: Cosine similarity between mean direction and covariance shape of class-wise penultimate-layer features, followed by the comparison between theoretical and empirical slope. They are evaluated on CIFAR10 vs. CIFAR10-C Gaussian Noise, measured across architectures and hyperparameters. We report their means and standard deviations.", "description": "This table presents the results of an empirical analysis on the alignment of mean direction and covariance shape between the in-distribution (ID) and out-of-distribution (OOD) data after applying test-time adaptation (TTA) methods.  It compares the cosine similarity of the normalized mean and covariance matrices of features extracted from the penultimate layer of models trained on CIFAR10 and tested on CIFAR10-C Gaussian Noise. The analysis is conducted across different network architectures and TTA hyperparameters, showing the impact of TTA on aligning the ID and OOD data distributions.  The table also includes the theoretical and empirical slopes of the linear relationship between ID and OOD accuracy, allowing for a comparison between theoretical predictions and empirical results after TTA. ", "section": "4.2 Empirical analysis under adaptation to CIFAR10-C"}, {"figure_path": "giXUx4VH9t/tables/tables_7_1.jpg", "caption": "Table 2: The results of OOD accuracy estimation, measured by MAE (%) between estimated and actual OOD accuracy. The gray shades denote the results calculated after applying adaptations, and bold texts indicate the smallest estimation error among estimators. We also report the classification error (%) in both Vanilla and adaptation methods for each dataset.", "description": "This table presents the mean absolute error (MAE) of out-of-distribution (OOD) accuracy estimation using different methods.  It compares the accuracy estimations from different methods (ALine-S, ALine-D, ATC, DOC-feat, Agreement) before and after test-time adaptation (TTA) on various datasets (CIFAR10-C, CIFAR100-C, ImageNet-C, Camelyon17-WILDS, iWildCAM-WILDS).  Bold values highlight the methods with the lowest MAE for each dataset. Gray shading indicates results obtained after TTA. The classification error for each method, before and after adaptation, is also provided.", "section": "5.1 OOD Accuracy estimation after adaptation"}, {"figure_path": "giXUx4VH9t/tables/tables_8_1.jpg", "caption": "Table 1: Cosine similarity between mean direction and covariance shape of class-wise penultimate-layer features, followed by the comparison between theoretical and empirical slope. They are evaluated on CIFAR10 vs. CIFAR10-C Gaussian Noise, measured across architectures and hyperparameters. We report their means and standard deviations.", "description": "This table presents the cosine similarity of mean direction and covariance shape between CIFAR10 and CIFAR10-C Gaussian Noise features, computed using the penultimate layer of various model architectures and TTA hyperparameters.  It compares the theoretical and empirical slopes of the linear trend between ID and OOD accuracy. The results demonstrate that Test-Time Adaptation (TTA) methods align the mean and covariance, closely matching the theoretical conditions for linear trends.", "section": "4.2 Empirical analysis under adaptation to CIFAR10-C"}, {"figure_path": "giXUx4VH9t/tables/tables_9_1.jpg", "caption": "Table 1: Cosine similarity between mean direction and covariance shape of class-wise penultimate-layer features, followed by the comparison between theoretical and empirical slope. They are evaluated on CIFAR10 vs. CIFAR10-C Gaussian Noise, measured across architectures and hyperparameters. We report their means and standard deviations.", "description": "This table presents the cosine similarity of mean direction and covariance shape between CIFAR10 and CIFAR10-C Gaussian Noise features extracted from the penultimate layer of various models.  It compares these empirical results with theoretically predicted slopes under the Gaussian assumption in Miller et al. [32].  The results are shown for different model architectures and hyperparameters, highlighting the impact of test-time adaptation (TTA) on the alignment of feature distributions.", "section": "4.2 Empirical analysis under adaptation to CIFAR10-C"}, {"figure_path": "giXUx4VH9t/tables/tables_14_1.jpg", "caption": "Table 1: Cosine similarity between mean direction and covariance shape of class-wise penultimate-layer features, followed by the comparison between theoretical and empirical slope. They are evaluated on CIFAR10 vs. CIFAR10-C Gaussian Noise, measured across architectures and hyperparameters. We report their means and standard deviations.", "description": "This table presents the cosine similarity of mean direction and covariance shape between CIFAR10 and CIFAR10-C Gaussian Noise features, extracted from the penultimate layer of various model architectures, both before and after test-time adaptation (TTA).  It compares the empirical slope of the resulting linear trend in accuracy to the theoretical slope predicted by the Gaussian data setup described in the paper.  The results highlight how TTA aligns the mean and covariance, bringing the empirical closer to theoretical results, and demonstrating the effect of TTA on the linear trend.", "section": "4.2 Empirical analysis under adaptation to CIFAR10-C"}, {"figure_path": "giXUx4VH9t/tables/tables_15_1.jpg", "caption": "Table 1: Cosine similarity between mean direction and covariance shape of class-wise penultimate-layer features, followed by the comparison between theoretical and empirical slope. They are evaluated on CIFAR10 vs. CIFAR10-C Gaussian Noise, measured across architectures and hyperparameters. We report their means and standard deviations.", "description": "This table presents the results of an empirical analysis conducted to investigate the alignment of mean and covariance between in-distribution (ID) and out-of-distribution (OOD) data in the feature space of deep neural networks.  The cosine similarity of normalized means and covariances are measured, representing the alignment. The comparison between theoretical and empirical slope for the linear trend between ID and OOD accuracy further validates these findings. Results are shown for different network architectures and hyperparameter settings applied to CIFAR10 vs. CIFAR10-C Gaussian Noise dataset. ", "section": "4.2 Empirical analysis under adaptation to CIFAR10-C"}, {"figure_path": "giXUx4VH9t/tables/tables_16_1.jpg", "caption": "Table 1: Cosine similarity between mean direction and covariance shape of class-wise penultimate-layer features, followed by the comparison between theoretical and empirical slope. They are evaluated on CIFAR10 vs. CIFAR10-C Gaussian Noise, measured across architectures and hyperparameters. We report their means and standard deviations.", "description": "This table presents the cosine similarity of mean direction and covariance shape between the features of CIFAR10 and CIFAR10-C Gaussian noise data, calculated at the penultimate layer of different neural network architectures. It compares the results before and after applying test-time adaptation (TTA) methods, demonstrating how TTA aligns the mean and covariance of ID and OOD data, leading to stronger linear trends. The table also shows the theoretical and empirical slopes, highlighting the strong match between them after adaptation.", "section": "4.2 Empirical analysis under adaptation to CIFAR10-C"}, {"figure_path": "giXUx4VH9t/tables/tables_18_1.jpg", "caption": "Table 1: Cosine similarity between mean direction and covariance shape of class-wise penultimate-layer features, followed by the comparison between theoretical and empirical slope. They are evaluated on CIFAR10 vs. CIFAR10-C Gaussian Noise, measured across architectures and hyperparameters. We report their means and standard deviations.", "description": "This table shows the cosine similarity of mean direction and covariance shape of the penultimate layer features for CIFAR10 and CIFAR10-C Gaussian noise, before and after applying test-time adaptation methods. It also compares the theoretical and empirical slopes of the linear relationship between in-distribution (ID) and out-of-distribution (OOD) accuracy.  The results are shown for different network architectures and various hyperparameters used in the test-time adaptation methods.", "section": "4.2 Empirical analysis under adaptation to CIFAR10-C"}]