[{"figure_path": "fVRCsK4EoM/tables/tables_5_1.jpg", "caption": "Table 1: Quantitative comparisons of different methods. * indicates the small model (non SD-based); \"S\" is the number of sampling times. For the calculation of WinRate, we first derive the best sample of the compared method among S sampling times. Then, we calculate it as T w /T, where T w indicates the number of compared samples that surpass the results of Runway (S = 1) and T is the total number of prompts. “↑ (resp. ↓)\" means the larger (resp. smaller), the better. We normalized the predicted reward values with the dataset distribution. “Var” calculates the variance of different sampling times, showing the consistency of generation quality. (See the Supplementary Material for more details.)", "description": "This table presents a quantitative comparison of different image inpainting methods, including the proposed PrefPaint model.  It evaluates performance across several metrics: WinRate (percentage of samples surpassing Runway's baseline), reward scores (normalized), mean reward, and variance of reward across multiple samples (S=1, S=3, S=10).  The table highlights PrefPaint's superior performance in terms of WinRate, mean reward, and consistency of results.", "section": "5 Experiments"}, {"figure_path": "fVRCsK4EoM/tables/tables_7_1.jpg", "caption": "Table 1: Quantitative comparisons of different methods. * indicates the small model (non SD-based); \"S\" is the number of sampling times. For the calculation of WinRate, we first derive the best sample of the compared method among S sampling times. Then, we calculate it as T\\(_w\\)_/T, where T\\(_w\\)_ indicates the number of compared samples that surpass the results of Runway (S = 1) and T is the total number of prompts. “↑ (resp. ↓)” means the larger (resp. smaller), the better. We normalized the predicted reward values with the dataset distribution. “Var” calculates the variance of different sampling times, showing the consistency of generation quality. (See the Supplementary Material for more details.)", "description": "This table presents a quantitative comparison of different image inpainting methods, including the proposed PrefPaint model.  Metrics such as WinRate (percentage of times a method outperforms Runway), reward scores (mean and variance), and other quantitative measures (S=1, S=3, S=10) are compared across various methods for both outpainting and warping prompts.  The table also provides context for interpreting WinRate and details on the normalization and variance calculations.", "section": "5 Experiments"}, {"figure_path": "fVRCsK4EoM/tables/tables_7_2.jpg", "caption": "Table 1: Quantitative comparisons of different methods. * indicates the small model (non SD-based); \"S\" is the number of sampling times. For the calculation of WinRate, we first derive the best sample of the compared method among S sampling times. Then, we calculate it as T w /T , where T w indicates the number of compared samples that surpass the results of Runway (S = 1) and T is the total number of prompts. \"\n(resp. ↓)\" means the larger (resp. smaller), the better. We normalized the predicted reward values with the dataset distribution. \"Var\" calculates the variance of different sampling times, showing the consistency of generation quality. (See the Supplementary Material for more details.)", "description": "This table presents a quantitative comparison of different image inpainting methods, including the proposed PrefPaint model.  The comparison uses several metrics across two types of prompts (outpainting and warping). Key metrics include WinRate (percentage of samples where the method outperforms Runway), mean reward score (normalized), and variance of reward scores (reflecting consistency).  The table allows for a direct comparison of the performance and consistency of various methods.", "section": "5 Experiments"}, {"figure_path": "fVRCsK4EoM/tables/tables_23_1.jpg", "caption": "Table 1: Quantitative comparisons of different methods. * indicates the small model (non SD-based); \"S\" is the number of sampling times. For the calculation of WinRate, we first derive the best sample of the compared method among S sampling times. Then, we calculate it as T w/T, where T w indicates the number of compared samples that surpass the results of Runway (S = 1) and T is the total number of prompts. “↑ (resp. ↓)” means the larger (resp. smaller), the better. We normalized the predicted reward values with the dataset distribution. “Var” calculates the variance of different sampling times, showing the consistency of generation quality. (See the Supplementary Material for more details.)", "description": "This table provides a quantitative comparison of different image inpainting methods, including the proposed PrefPaint method.  It uses several metrics to evaluate the performance, such as WinRate (comparing to Runway), reward, and variance across multiple sampling attempts. Higher values generally indicate better performance. The table also provides a breakdown of results for different types of prompts (outpainting and warping).", "section": "5 Experiments"}, {"figure_path": "fVRCsK4EoM/tables/tables_27_1.jpg", "caption": "Table 1: Quantitative comparisons of different methods. * indicates the small model (non SD-based); \"S\" is the number of sampling times. For the calculation of WinRate, we first derive the best sample of the compared method among S sampling times. Then, we calculate it as \\(\\frac{T_w}{T}\\), where \\(T_w\\) indicates the number of compared samples that surpass the results of Runway (S = 1) and T is the total number of prompts. “↑ (resp. ↓)” means the larger (resp. smaller), the better. We normalized the predicted reward values with the dataset distribution. “Var” calculates the variance of different sampling times, showing the consistency of generation quality. (See the Supplementary Material for more details.)", "description": "This table presents a quantitative comparison of different image inpainting methods, including the proposed PrefPaint method.  It uses several metrics to evaluate performance across different prompt types (outpainting and warping) and varying numbers of sampling times (S). WinRate measures the percentage of samples surpassing the baseline Runway model, while Reward shows the average normalized reward score. The variance (Var) indicates the consistency of generation quality across multiple samples.", "section": "5 Experiments"}, {"figure_path": "fVRCsK4EoM/tables/tables_27_2.jpg", "caption": "Table 1: Quantitative comparisons of different methods. * indicates the small model (non SD-based); \"S\" is the number of sampling times. For the calculation of WinRate, we first derive the best sample of the compared method among S sampling times. Then, we calculate it as \\(\\frac{T_w}{T}\\), where \\(T_w\\) indicates the number of compared samples that surpass the results of Runway (S = 1) and T is the total number of prompts. “↑ (resp. ↓)” means the larger (resp. smaller), the better. We normalized the predicted reward values with the dataset distribution. “Var” calculates the variance of different sampling times, showing the consistency of generation quality. (See the Supplementary Material for more details.)", "description": "This table quantitatively compares the performance of the proposed PrefPaint method against several state-of-the-art (SOTA) image inpainting methods.  Key metrics include WinRate (the percentage of times the method outperforms Runway, a baseline model), reward scores (a measure of aesthetic quality), and the variance of these scores across multiple samplings. The table provides a comprehensive comparison across different prompting scenarios and highlights the proposed method's improved performance in terms of both quality and consistency.", "section": "5 Experiments"}, {"figure_path": "fVRCsK4EoM/tables/tables_28_1.jpg", "caption": "Table 1: Quantitative comparisons of different methods. * indicates the small model (non SD-based); \"S\" is the number of sampling times. For the calculation of WinRate, we first derive the best sample of the compared method among S sampling times. Then, we calculate it as T<sub>w</sub>/T, where T<sub>w</sub> indicates the number of compared samples that surpass the results of Runway (S = 1) and T is the total number of prompts. “↑ (resp. ↓)” means the larger (resp. smaller), the better. We normalized the predicted reward values with the dataset distribution. “Var” calculates the variance of different sampling times, showing the consistency of generation quality. (See the Supplementary Material for more details.)", "description": "This table presents a quantitative comparison of different image inpainting methods, including the proposed PrefPaint method.  It evaluates performance using metrics such as WinRate (percentage of times the method outperforms Runway), reward scores (normalized), and variance of reward scores across multiple sampling attempts. The table highlights PrefPaint's superior performance, particularly its high WinRate and low variance, indicating its robustness and consistent generation of high-quality images.", "section": "5 Experiments"}, {"figure_path": "fVRCsK4EoM/tables/tables_28_2.jpg", "caption": "Table 1: Quantitative comparisons of different methods. * indicates the small model (non SD-based); \"S\" is the number of sampling times. For the calculation of WinRate, we first derive the best sample of the compared method among S sampling times. Then, we calculate it as \\(\\frac{T_w}{T}\\), where \\(T_w\\) indicates the number of compared samples that surpass the results of Runway (S = 1) and T is the total number of prompts. “↑ (resp. ↓)” means the larger (resp. smaller), the better. We normalized the predicted reward values with the dataset distribution. “Var” calculates the variance of different sampling times, showing the consistency of generation quality. (See the Supplementary Material for more details.)", "description": "This table presents a quantitative comparison of different image inpainting methods, including the proposed PrefPaint method.  The metrics used are WinRate (percentage of times the method outperforms Runway), reward (mean reward score), and variance of reward scores across multiple sampling runs (reflecting consistency).  The table shows that PrefPaint significantly outperforms other methods in terms of WinRate and reward, while also demonstrating higher consistency. The * indicates models not based on Stable Diffusion.", "section": "5 Experiments"}]