[{"figure_path": "BRW0MKJ7Rr/figures/figures_5_1.jpg", "caption": "Figure 4.1: PDFs of Return Distributions and Two Candidate CDRs.", "description": "This figure compares the probability density functions (PDFs) of return distributions and two candidate coupled difference representations (CDRs). The left panel shows the PDFs of the policy's return distribution (ηπ(t,x)) and the h-dependent action-conditioned return distribution (ζ(t,x,a)). The right panel shows two candidate CDRs of  ηπ(t,x) and ζ(t,x,a).  One CDR is the superiority distribution (ψ(t,x,a)) and the other CDR is from Example 4.2. The figure illustrates that the superiority distribution captures more of the individual features of both return distributions than other such CDRs.", "section": "4 Distributional Superiority"}, {"figure_path": "BRW0MKJ7Rr/figures/figures_7_1.jpg", "caption": "Figure 5.1: Monte-Carlo estimates of ψ;q, for q = 0, 1, 1/2, and υπ;1/2 as a function of ω = 1/h.", "description": "This figure shows Monte-Carlo estimates of four different rescaled superiority distributions (ψ;q) with q = 0, 1, 1/2 and the advantage-shifted 1/2-rescaled superiority distribution (υπ;1/2) as a function of the decision frequency (ω = 1/h).  The plots illustrate how the distributions change as the decision frequency increases (h decreases).  The x-axis represents the value of the distributions, and the y-axis is the probability density. This figure supports Theorems 3.6/4.5 and 3.7/4.6 from the paper by demonstrating the collapse of the superiority distribution when no rescaling is applied, and its behavior under different rescaling approaches (q=1, q=1/2) at high frequencies. The advantage-shifted version (υπ;1/2) is also presented to show its effectiveness in high frequency setting.", "section": "5.1 The Rescaled Superiority Distribution Revisited"}, {"figure_path": "BRW0MKJ7Rr/figures/figures_8_1.jpg", "caption": "Figure 5.2: Risk-neutral algorithms on high-frequency option-trading as a function of ω.", "description": "This box plot shows the discounted returns of different algorithms (QR-DQN, DAU, DSUP(1), DAU+DSUP(1/2), and DSUP(1/2)) across various decision frequencies (1Hz, 5Hz, 10Hz, 15Hz, 20Hz, 25Hz, 30Hz, and 35Hz). The y-axis represents the discounted returns, and the x-axis represents the decision frequency. Each box plot represents the distribution of discounted returns for a specific algorithm and frequency. The figure illustrates the performance of different value-based RL algorithms in a high-frequency option-trading environment under the risk-neutral setting.", "section": "5 Simulations"}, {"figure_path": "BRW0MKJ7Rr/figures/figures_9_1.jpg", "caption": "Figure 5.3: CDFs of ψ;1/2 from DSUP(1/2) (left) and from QR-DQN (right) at the start state at w = 35Hz.", "description": "This figure compares the cumulative distribution functions (CDFs) of the 1/2-rescaled superiority distribution (ψ;1/2) learned by the DSUP(1/2) algorithm and the QR-DQN algorithm.  The comparison is made for actions 0 and 1 at the initial state of the environment when the decision frequency is 35 Hz. The plot shows that DSUP(1/2) better distinguishes between the two actions, while QR-DQN struggles to discriminate between them.", "section": "5.2 High-Frequency Option Trading"}, {"figure_path": "BRW0MKJ7Rr/figures/figures_9_2.jpg", "caption": "Figure 5.4: Risk-sensitive algorithms on high-frequency option-trading at ω = 35Hz.", "description": "This figure shows the performance comparison of QR-DQN and DSUP(1/2) algorithms in a risk-sensitive setting for high-frequency option trading. The x-axis represents different values of α (a parameter in the α-CVaR risk measure), while the y-axis shows the α-CVaR of the returns obtained by each algorithm.  Error bars represent variability in performance across multiple simulation runs. The results indicate that DSUP(1/2) outperforms QR-DQN consistently across various values of α, suggesting its superiority in risk-sensitive high-frequency trading scenarios.", "section": "High-Frequency Option Trading"}, {"figure_path": "BRW0MKJ7Rr/figures/figures_25_1.jpg", "caption": "Figure 5.1: Monte-Carlo estimates of ψ;q, for q = 0, 1, 1/2, and υπ;1/2 as a function of w = 1/h.", "description": "The figure shows Monte-Carlo estimates of four different rescaled superiority distributions (ψ;q) with q = 0, 1, 1/2, and the advantage-shifted 1/2-rescaled superiority distribution (υπ;1/2) as a function of the decision frequency (w = 1/h).  It illustrates the impact of different rescaling factors on the distributions as the decision frequency increases. The figure is crucial in demonstrating how the choice of the rescaling factor affects the behavior of the superiority distribution and its suitability for action ranking in high-frequency decision-making scenarios.", "section": "5.1 The Rescaled Superiority Distribution Revisited"}]