[{"figure_path": "EY2agT920S/figures/figures_1_1.jpg", "caption": "Figure 1: The experimental results on Traffic dataset. (a) illustrates the outcomes of the ablation study on mainstream forecasting models and their variants. (b) depicts the visualization of traffic volume (upper), successful prediction case (lower right), and failed prediction case (lower left), respectively.", "description": "This figure presents the results of an ablation study conducted on the Traffic dataset. It compares the performance of mainstream forecasting models (Informer, TimesNet, iTransformer, DLinear) with and without timestamps.  Subfigure (a) shows the MAE and MSE for each model, demonstrating that GLAFF significantly improves performance. Subfigure (b) displays visualizations of actual traffic volume, successful prediction using GLAFF, and a failed prediction (without GLAFF) to highlight the model's robustness improvements.", "section": "4 Experiment"}, {"figure_path": "EY2agT920S/figures/figures_3_1.jpg", "caption": "Figure 2: The overall architecture of GLAFF mainly consists of three primary components: Attention-based Mapper, Robust Denormalizer, and Adaptive Combiner.", "description": "The figure illustrates the overall architecture of the Global-Local Adaptive Fusion Framework (GLAFF).  GLAFF is a plug-and-play module that works with any time series forecasting backbone. It consists of three main parts:\n\n1. **Attention-based Mapper:** This component processes the timestamps (S and T) to generate global information in the form of initial mappings (X and Y). It uses an attention mechanism to capture dependencies between timestamps.\n2. **Robust Denormalizer:** This component adjusts the initial mappings (X and Y ) to account for data drift by inverse normalizing them to X and Y using quantile deviation.\n3. **Adaptive Combiner:** This component dynamically combines the global information (Y) and the local prediction from the backbone model (Y) to produce the final prediction (Y). The weight of the combination is adjusted based on the difference between the final mapping (X) and the actual observations (X) in the history window.\n\nThe inputs are the history observations (X), history timestamps (S), future timestamps (T). The output is the prediction (Y).", "section": "3 Methodology"}, {"figure_path": "EY2agT920S/figures/figures_7_1.jpg", "caption": "Figure 3: The illustration of prediction showcases among GLAFF and mainstream baselines.", "description": "This figure visualizes the prediction results of four mainstream time series forecasting models (Informer, DLinear, TimesNet, and iTransformer) and their enhanced versions with the proposed GLAFF method on the Traffic and Electricity datasets.  It demonstrates the improved prediction accuracy and robustness of GLAFF, especially when handling anomalies in the data (e.g., holidays impacting traffic volume or short circuits affecting electricity consumption).  The plots show the ground truth, the predictions from the base models alone, and the predictions from the models enhanced with GLAFF.  This allows for a visual comparison of the performance improvements achieved by GLAFF in different scenarios.", "section": "4.3 Prediction Showcase"}, {"figure_path": "EY2agT920S/figures/figures_17_1.jpg", "caption": "Figure 4: The forecasting errors for multivariate time series of hyperparameter analysis among different configurations for GLAFF. A lower outcome indicates a better prediction.", "description": "This figure presents the results of a hyperparameter analysis for the GLAFF model. It shows how different values for the quantile (q) in the Robust Denormalizer, the number of attention blocks (l) in the Attention-based Mapper, and the dropout proportion (p) in the Attention-based Mapper affect the model's performance, specifically the Mean Squared Error (MSE). The results are shown separately for several datasets to highlight how dataset characteristics influence the effect of each hyperparameter.", "section": "B.3 Hyperparameter Analysis"}, {"figure_path": "EY2agT920S/figures/figures_19_1.jpg", "caption": "Figure 3: The illustration of prediction showcases among GLAFF and mainstream baselines.", "description": "This figure provides a visual comparison of the prediction results from GLAFF and four mainstream time series forecasting models (Informer, DLinear, TimesNet, and iTransformer) across several datasets.  The plots show the ground truth values, the predictions made by each baseline model, and the predictions generated after integrating GLAFF into each model. The purpose is to visually demonstrate how GLAFF enhances the performance of the baseline models, particularly in handling anomalies and variations in the time series data.", "section": "4.3 Prediction Showcase"}]