[{"type": "text", "text": "Learning Infinitesimal Generators of Continuous Symmetries from Data ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Gyeonghoon Ko, Hyunsu Kim, Juho Lee Kim Jaechul Graduate School of AI KAIST Seoul, South Korea {kog, kim.hyunsu, juholee}@kaist.ac.kr ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Exploiting symmetry inherent in data can significantly improve the sample efficiency of a learning procedure and the generalization of learned models. When data clearly reveals underlying symmetry, leveraging this symmetry can naturally inform the design of model architectures or learning strategies. Yet, in numerous real-world scenarios, identifying the specific symmetry within a given data distribution often proves ambiguous. To tackle this, some existing works learn symmetry in a data-driven manner, parameterizing and learning expected symmetry through data. However, these methods often rely on explicit knowledge, such as pre-defined Lie groups, which are typically restricted to linear or affine transformations. In this paper, we propose a novel symmetry learning algorithm based on transformations defined with one-parameter groups, continuously parameterized transformations flowing along the directions of vector fields called infinitesimal generators. Our method is built upon minimal inductive biases, encompassing not only commonly utilized symmetries rooted in Lie groups but also extending to symmetries derived from nonlinear generators. To learn these symmetries, we introduce a notion of a validity score that examine whether the transformed data is still valid for the given task. The validity score is designed to be fully differentiable and easily computable, enabling effective searches for transformations that achieve symmetries innate to the data. We apply our method mainly in two domains: image data and partial differential equations, and demonstrate its advantages. Our codes are available at https: ", "page_idx": 0}, {"type": "text", "text": "//github.com/kogyeonghoon/learning-symmetry-from-scratch.git. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Symmetry is fundamental in many scientific disciplines, crucial for understanding the structure and dynamics of physical systems, datasets, and mathematical models. The ability to uncover and leverage symmetries has become increasingly important in machine learning and scientific research due to its potential to improve model efficiency, generalization, and interpretability. By capturing inherent symmetrical properties, models can learn more compact and informative representations, leading to improved performance in tasks like supervised learning [31, 29, 4, 7, 33], self-supervised learning [8, 15, 23], and generative models [19, 11, 18]. ", "page_idx": 0}, {"type": "text", "text": "Previous methods for learning symmetry have often relied on the explicit parameterization of group representations based on predefined generators, which can be limited in capturing various symmetries, including transformations that do not align along the generators. For example, when searching for Lie group symmetries in images or physics data, existing methods [3, 34] parameterize a group action $g$ as the matrix exponential of a linear combination of linear or affine Lie algebra generators $L_{i}$ with their learnable coefficients $w_{i}$ as $\\begin{array}{r}{g\\,=\\,\\exp\\left(\\sum_{i}w_{i}L_{i}\\right)}\\end{array}$ . In the affine transformations of images in $\\left(x_{1},x_{2}\\right)$ -coordinates, there are six generators, each corresponding to translation, scaling, and shearing operations with respect to the $x_{1}$ -axis and $x_{2}$ -axis. Although there exist some methods that directly learn the generators, they are either bound to the general linear group $G L(n)$ , which cannot account for non-affine or non-linear transformations [24], or are not guaranteed to find the correct symmetry in real-world image datasets [9, 13]. ", "page_idx": 0}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "When searching for symmetries in high-dimensional real-world datasets, we can take advantage of the fact that the data can be interpreted as a function $f:\\mathcal X\\to\\mathcal Y$ , such as images, which are functions from the 2D Euclidean space to the color space. Another notable example of such data is partial differential equations (PDEs), where the data take the form $\\pmb{u}:\\mathcal{X}\\rightarrow\\mathcal{U}$ and the Lie symmetries are defined as transformations on the space $\\mathcal{X}\\times\\mathcal{U}$ . There have been significant advances in Lie symmetry analysis in recent years, for both academic and industrial purposes, mostly involving extensive symbolic calculations and relying on computer algebra systems [26]. Discovering Lie symmetries of PDEs from data without prior knowledge is an unexplored topic, except for the work of Gabel et al. [14], which learns the symmetry generators of various PDEs in a supervised learning setup. ", "page_idx": 1}, {"type": "text", "text": "In this work, we propose a novel method for learning continuous symmetries, including non-affine transformations, from data without prior knowledge. By modeling one-parameter groups using Neural Ordinary Differential Equation (Neural ODE) [6], we establish a learnable infinitesimal generator capable of producing a sequence of transformed data through ODE integration. We design an appropriate validity score function that measures how much the transformation violates the invariance to certain criteria defined depending on the target task, and learn the generators by optimizing towards the validity score of the data transformed through ODE integration. For example, in an image classification dataset, we use a pre-trained feature extractor and define the validity score to be the cosine similarity between the features extracted from the original image and the transformed image. For PDEs, the validity score is defined by the numerical errors of the original equations after the transform. The validity scores are chosen based on the characteristics of the target tasks, and designed to be fully differentiable, so that the symmetry can be learned via gradient descent in an end-to-end fashion. We also incorporate two regularizations, orthonormality and Lipschitz loss, which prevent the learned generators from converging to a trivial solution. ", "page_idx": 1}, {"type": "text", "text": "Subsequently, we demonstrate that our method indeed discovers the correct symmetries in both image and PDE datasets. To the best of our knowledge, our research is the first to retrieve affine symmetry in the entire space of continuous transformations using the CIFAR-10 classification dataset, as shown in Figure 1. Moreover, our method excels in identifying non-affine symmetries and approximate symmetries in PDE tasks. We further demonstrate that the learned generators can be leveraged to develop automatic augmentation generators, which can be used to produce augmented training data for both image classification tasks and neural operator learning tasks of PDEs [21]. We provide empirical evidence that the models trained with data augmented by our learned generators perform competitively with those trained with traditional closed-form transforms such as Lie point symmetry (LPS) [4]. Moreover, we show that the approximate symmetries discovered by our method, which cannot be found by classical methods, can also boost the performance of the models, especially when the size of the training data is small. ", "page_idx": 1}, {"type": "image", "img_path": "wl44W8xpc7/tmp/3c4da35abb555ae82ccc1c82a5cd2736cd9c82e7dfbbcb3a1360f72f3aa32748.jpg", "img_caption": ["Figure 1: (a) Examples of the vector fields. $V_{3}$ is a learned symmetry which is approximately a rotation, while $V_{7}$ is not a symmetry, thus having a high validity score. (b) Transformed CIFAR-10 images using the learned generators. All the vector fields and transformations learned from CIFAR-10 are presented in Figure 8 of Appendix C. (c) Transformation of PDEs (KS equation) with learned symmetries: time translation (t-tsl) and Galilean boost (gal). "], "img_footnote": [], "page_idx": 1}, {"type": "text", "text": "Table 1: Infinitesimal generators of the Affine group $\\operatorname{Aff}(2)$ . The set of six generators $\\{L_{1},\\cdot\\cdot\\cdot,L_{6}\\}$ forms a basis of the corresponding Lie algebra. ", "page_idx": 2}, {"type": "image", "img_path": "wl44W8xpc7/tmp/cb0c8b2488200f76dc883a62fe41ff4e04e22e9c20ec76ad61293e7d03601e33.jpg", "img_caption": ["Figure 2: An example of a flow. "], "img_footnote": [], "page_idx": 2}, {"type": "table", "img_path": "wl44W8xpc7/tmp/36e59263e7d3274d051d5e3e092b1a632d4c293a0fd3764da69f04a832b1030a.jpg", "table_caption": [], "table_footnote": [], "page_idx": 2}, {"type": "text", "text": "2 Preliminaries: One-parameter Group ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "In this section, we present the basic definitions of a one-parameter group, which we use to parameterize the symmetric transformations learned from the data. ", "page_idx": 2}, {"type": "text", "text": "Consider an unknown Euclidean domain ${\\mathcal{Z}}\\subseteq\\mathbb{R}^{n}$ and a smooth vector field $V:\\mathcal{Z}\\to\\mathbb{R}^{n}$ . A path $\\gamma:I=(a,b)\\subseteq\\mathbb{R}\\to\\mathcal{Z}$ satisfying $\\begin{array}{r}{\\frac{d}{d s}\\gamma(s)=V(\\gamma(s))}\\end{array}$ for all $s\\in I$ is a curve that travels around the domain $\\mathcal{Z}$ with a velocity given by the vector field $V$ . Along the curve $\\gamma$ , a point ${\\pmb x}_{0}=\\gamma(a_{0})$ can be transported to $\\gamma(a_{0}+s)$ by flowing along the vector field $V$ by time $s$ . We define the flow $\\vartheta_{s}^{V}$ by $\\vartheta_{s}^{V}(\\dot{\\pmb{x}}_{0})=\\gamma(a_{0}\\dot{+}\\dot{s})$ of $V$ as in Figure 2. This flow is computed by solving an ODE ", "page_idx": 2}, {"type": "equation", "text": "$$\n\\frac{d}{d s}\\vartheta_{s}^{V}({\\pmb x})=V({\\pmb x})\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "with initial condition $\\vartheta_{0}^{V}(\\pmb{x})=\\pmb{x}$ for all $\\mathbf{\\boldsymbol{x}}\\in{\\mathcal{Z}}$ [20]. ", "page_idx": 2}, {"type": "text", "text": "The flow $\\vartheta^{V}$ is governed by an autonomous ODE, i.e., an ODE independent of the temporal variable $s$ . Due to properties of autonomous ODEs, the flow $\\vartheta^{V}$ exists uniquely and it is smooth in both variables $s$ and $\\textbf{\\em x}$ . Assuming a mild condition on $V$ , such as $V$ extends to a compactly supported vector field $\\tilde{V}$ on $\\mathbb{R}^{n}$ , the ODE does not terminate in $\\mathbb{R}^{n}$ in finite time and hence $\\vartheta_{s}^{V}$ is defined for all $s\\in\\mathbb{R}$ . In that case, the flow satisfies a group equation ", "page_idx": 2}, {"type": "equation", "text": "$$\n\\vartheta_{s_{1}+s_{2}}^{V}(\\pmb{x})=\\vartheta_{s_{1}}^{V}\\circ\\vartheta_{s_{2}}^{V}(\\pmb{x})\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "for all $s_{1},s_{2}\\in\\mathbb{R}$ . It means that the flow can be regarded as a group action of $\\mathbb{R}$ on $\\mathbb{R}^{n}$ , transforming elements of ${\\mathcal{Z}}\\subseteq\\mathbb{R}^{n}$ . For this reason, $\\vartheta_{s}^{V}$ is also called a one-parameter group, and the vector field $V$ is called an infinitesimal generator of the one-parameter group. ", "page_idx": 2}, {"type": "text", "text": "On $\\mathcal{Z}=\\mathbb{R}^{n}$ , a constant vector field $V(\\pmb{x})=\\pmb{v}\\in\\mathbb{R}^{n}$ gives rise to a translation $\\pmb{x}\\mapsto\\pmb{x}+s\\pmb{v}$ . For a matrix $A\\in\\mathbb{R}^{n\\times n}$ , a vector field $V(x)=A x$ gives rise to an affine transformation $\\pmb{x}\\mapsto\\exp(s\\pmb{A})\\pmb{x}$ , where exp is the matrix exponentiation. Multiple infinitesimal generators may span a vector space $\\mathfrak{g}$ , and if $\\mathfrak{g}$ satisfies some algebraic condition (closure under the Lie bracket), then $\\mathfrak{g}$ forms a Lie algebra. Composing the elements of one-parameter groups of elements in $\\mathfrak{g}$ gives rise to a Lie group $G$ . The correspondence between $G$ and $\\mathfrak{g}$ is called Lie group-Lie algebra correspondence. ", "page_idx": 2}, {"type": "text", "text": "Continuous symmetries are commonly defined by a Lie group $G$ , acting on some domain and keeping the transformed objects invariant with respect to some criterion. We model symmetries by specifying their infinitesimal generators whose composition of one-parameter groups comprises the symmetries of that domain. ", "page_idx": 2}, {"type": "text", "text": "Below, we describe two representative examples that will be discussed extensively in the remainder of the paper: images (interpreted as functions on 2D planes) and PDEs. ", "page_idx": 2}, {"type": "text", "text": "2.1 Images and Their Symmetries ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Consider a rescaled image of the form $f:\\mathcal{X}=[-1,1]^{2}\\subseteq\\mathbb{R}^{2}\\to\\mathcal{Y}=[0,1]^{3}\\in\\mathbb{R}^{3}$ . The affine transformations on $\\mathbb{R}^{2}$ have the form ${\\pmb x}\\,=\\,(x_{1},x_{2})\\,\\mapsto\\,{\\pmb A}{\\pmb x}\\,+\\,{\\pmb b}$ for a matrix $\\pmb{A}\\in\\mathbb{R}^{2\\times2}$ and a vector $\\pmb{b}\\in\\mathbb{R}^{2}$ . The Affine transformations form the 6-dimensional Affine group Aff(2), and it has a corresponding 6-dimensional Lie algebra having a basis $\\{L_{1},\\ldots,L_{6}\\}$ given as in Table 1. The symmetries of images are often exploited as a data augmentation strategy for learning image classifiers, under an assumption that the transforms do not alter the identity or semantics of the images to be classified. ", "page_idx": 2}, {"type": "text", "text": "Given an $n$ -dimensional independent variable $\\pmb{x}=(x_{1},\\cdots,x_{n})\\in\\mathcal{X}\\subseteq\\mathbb{R}^{n}$ and an $m$ -dimensional dependent variable $u={\\pmb u}({\\pmb x})=(u_{1}({\\pmb x}),\\cdots,u_{m}({\\pmb x}))\\in\\mathcal{U}\\subseteq\\mathbb{R}^{m}$ , we denote by $\\pmb{u}^{(i)}$ the collection of all $i$ -th partial derivatives of $\\textbf{\\em u}$ with respect to $\\textbf{\\em x}$ . A partial differential equation $\\Delta$ on ${\\pmb u}({\\pmb x})$ of order $k$ is defined by a set of algebraic equations $\\Delta(x,\\pmb{u},\\pmb{u}^{(1)},\\pmb{\\cdot}\\cdot\\cdot\\mathbf{\\nabla},\\pmb{u}^{(k)})\\,=\\,0$ involving all the variables and their partial derivatives. For example, two scalar independent variables $x,t\\in\\mathbb{R}$ and one scalar dependent variable $u(x,t)\\in\\mathbb{R}$ governed by equation $\\Delta=u_{t}+u u_{x}+u_{x x x}=0$ gives the 1-dimensional Korteweg-de Vries (KdV) equation, where we denote partials using subscripts, e.g. $\\begin{array}{r}{u_{t}=\\frac{\\partial u}{\\partial t}}\\end{array}$ and $\\begin{array}{r}{u_{x x x}=\\frac{\\partial^{3}u}{\\partial x^{3}}}\\end{array}$ . The KdV equation is commonly used to model the dynamics of solitons, e.g. shallow water waves [35]. The KdV equation described above is an example of 1-dimensional scalar-valued evolution equation. Such an equation takes the form $u=u(x,t)\\in\\overline{{\\mathbb{R}}}$ with its governing equation of the form ", "page_idx": 3}, {"type": "equation", "text": "$$\nu_{t}=F(x,t,u,u_{x},u_{x x},u_{x x x},\\cdot\\cdot\\cdot)\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "for some function $F$ . In this paper, we only deal with 1D scalar-valued evolution equation on a fixed periodic domain $x\\in[0,L]$ . ", "page_idx": 3}, {"type": "text", "text": "Continuous symmetries of PDEs are commonly parametrized by a one-parameter group on $\\mathcal{X}\\times\\mathcal{U}$ Denote $(\\xi,\\mu)\\,=\\,(\\xi[x,u],\\mu[x,u])$ an infinitesimal generator defined on $\\mathcal{X}\\times\\mathcal{U}$ . Then the PDE $\\Delta$ possesses the infinitesimal generator of symmetry $(\\xi,\\mu)$ if the equation is still satisfied after transforming both the independent variable $\\textbf{\\em x}$ and the dependent variable $\\textbf{\\em u}$ [27, 5, 26]. Symmetries of PDEs are categorized by how the generators $(\\xi,\\mu)$ depend on $(x,u)$ . The symmetry is a Lie point symmetry (LPS) if the value of $(\\xi,\\mu)$ at each point $(x,u(x))$ depends only on the point value $(x,u(x))$ itself. If $(\\xi,\\mu)$ also depends on the derivatives ${\\pmb u}^{(1)},\\cdots,{\\pmb u}^{(k)}$ at that point, it is called a Lie-Bäcklund symmetry or generalized symmetry. If $(\\xi,\\mu)$ depends on integrals of $\\textbf{\\em u}$ , then it is called a nonlocal symmetry. Finding an LPS of a PDE $\\Delta$ can be done algorithmically under some mild assumptions on $\\Delta$ . However, there is no general recipe of finding Lie-Bäcklund symmetries or nonlocal symmetries, and discovering such symmetries remains an active area of research. ", "page_idx": 3}, {"type": "text", "text": "3 Related Work ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Symmetry discovery. Approaches to learning symmetries can be categorized by addressing two questions: (a) where do they search for symmetries, and (b) what are they aiming to learn. One line of research aims to learn ranges, focusing on determining the ranges of transformation scales that enhance learning when employed as augmentation techniques. For example, Benton et al. [3] learns transformation ranges of predefined transformations by treating them as learnable parameters and backpropagating through differentiable transformations. ", "page_idx": 3}, {"type": "text", "text": "Another line of research aim to learn subgroups of bigger candidate groups, typically a linear group $G L(n)$ or an affine group $\\operatorname{Aff}(n)$ . For example, Desai et al. [10] use the Generative Adversarial Network (GAN) to search for symmetries, with the generator transforming data by group elements sampled from the candidate group and the discriminator verifying whether the transformed data sill lies in the data distribution. Similarly, Yang et al. [34] employ the GAN approach, but generator of GAN models infinitesimal generators instead of the subgroup itself. As an alternative, Moskalev et al. [24] proposed an idea of extracting symmetries from learned neural network by differentiating through it, and retrieved 2D rotation in the linear group using the rotation MNIST dataset. ", "page_idx": 3}, {"type": "text", "text": "Finally, learning symmetries with minimal assumption, i.e. without assuming the infinitesimal generators are linear or affine, is an area of large interest. An early attempt of Rao & Ruderman [28] models infinitesimal generator by a learnable matrix from the pixel space to the pixel space, and learn 2D rotation by solving a task that compares original images and rotated ones, where the images are $5\\times5$ random pixels. Sohl-Dickstein et al. [32] takes the similar approach with eigen-decomposing the learnable matrix. Dehmamy et al. [9] builds a convolution operation whose kernel encodes learnable infinitesimal generators, and retrieved 2D rotation from random $7\\times7$ images by comparing original and transformed ones. Our work closely aligns with Liu & Tegmark [22] and Forestano et al. [13], which model one-parameter groups by an MLP and learn the symmetries from an invariant scalar quantity. To the best of our knowledge, learning correct symmetries with minimal assumption was only achieved with toy datasets, far from real-world datasets such as CIFAR-10. ", "page_idx": 3}, {"type": "text", "text": "Utilizing symmetries in deep learning. An effective method for leveraging symmetries in deep learning is data augmentation [31]. In the image domain, there are numerous augmentation techniques available [29], most of which are based on geometric properties of images. Although data augmentation techniques have been primarily explored in the context of images, recent studies by [4, 23] have demonstrated that symmetries can also be used for augmenting data in the training of neural PDE solvers. In addition to data augmentation, some approaches involve designing new neural network architectures that inherently reflect the group symmetries of the input data [7]. Wang et al. [33] applied a similar strategy within the PDE domain. ", "page_idx": 4}, {"type": "text", "text": "4 Learning Continuous Symmetries with One-Parameter Groups ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "4.1 Training Process ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "Given a learning task with a dataset $\\mathcal{D}\\subset\\mathcal{A}$ in an underlying space $\\mathcal{A}=\\{f|f:\\mathcal{X}\\to\\mathcal{Y}\\}$ , we aim to model symmetry by a one-parameter group $\\vartheta_{s}$ acting on $\\boldsymbol{\\mathcal{A}}$ , as explained in $\\S\\ 4.3$ . We define a continuous symmetry by stating that $\\vartheta$ is a symmetry of this task if there exists some $\\sigma>0$ such that for any data point $f\\in\\mathcal D$ and transformation scale $s\\in[-\\sigma,\\sigma]$ , the transformed data point $\\vartheta_{s}(f)$ remains valid for this task. We assume the existence of a differentiable validity score $S(\\vartheta_{s},f)\\in\\mathbb{R}$ , such that $\\vartheta_{s}(f)\\in A$ is valid if $S(\\vartheta_{s},f)<C$ for a certain threshold $C\\in\\mathbb{R}$ . Then, a one-parameter group $\\vartheta$ is a symmetry of the task if $S(\\vartheta_{s},f)<C$ for all $f\\in\\mathcal D$ . ", "page_idx": 4}, {"type": "text", "text": "The validity score depends on the nature of the target task, though no strict criterion exists. As long as it is differentiable and the valid data aids learning, it is considered acceptable. For instance, we can define the validity based on a negative log-likelihood of a probabilistic model. In $\\S\\ 4.2$ , we discuss the validity scores to be used for image and PDE data. ", "page_idx": 4}, {"type": "text", "text": "Once a validity score is defined, we learn a symmetry $\\vartheta^{\\ast}$ by minimizing the validity scores of transformed data, ", "page_idx": 4}, {"type": "image", "img_path": "wl44W8xpc7/tmp/dc07da1c5a645667136b99a28c70f65e140a53c33113ab948aede165d725a8b1.jpg", "img_caption": ["Figure 3: Process of learning symmetry. "], "img_footnote": [], "page_idx": 4}, {"type": "equation", "text": "$$\n\\vartheta^{*}=\\arg\\operatorname*{min}_{\\vartheta}\\mathbb{E}_{f\\sim\\mathcal{D},s\\sim\\mathrm{Unif}([-\\sigma,\\sigma])}\\left[S(\\vartheta_{s},f)\\right],\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where the arg min is taken over the entire class of smooth one-parameter groups. Since the learning is performed in function space, we appropriately constrain the function space using a regularizer, as described in $\\S\\ 4.4$ . Once symmetries are learned, they reveal the symmetrical properties of the target task, which can then be exploited to augment the training data. ", "page_idx": 4}, {"type": "text", "text": "4.2 Task-specific Definition of Validity Score $S$ ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "Images. In image-related tasks, we define a validity score using a pre-trained neural network. Let $\\mathcal{D}$ be an image classification dataset consisting of data of the form $(f,y)\\in A\\times\\mathbb{R}$ , where $f$ is an image and $y$ is a label. Also let $H_{\\mathrm{cls}}\\circ H_{\\mathrm{fext}}:\\mathcal{A}\\rightarrow\\mathbb{R}$ be a learned neural network, where we denote by $\\bar{H}_{\\mathrm{fext}}:\\mathcal{\\bar{A}}\\rightarrow\\mathbb{R}^{k}$ the feature extractor and $H_{\\mathrm{cls}}:\\mathbb{R}^{k}\\rightarrow\\mathbb{R}$ the classifier. We define the validity score $S(\\vartheta_{s},f)$ as the cosine similarity between the features before and after the transformation: ", "page_idx": 4}, {"type": "equation", "text": "$$\nS(\\vartheta_{s},f)=\\sin\\left(H_{\\mathrm{fext}}(\\vartheta_{s}(f)),H_{\\mathrm{fext}}(f)\\right),\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where sim is the cosine similarity defined as sim(v1, v2) =∥|vv11∥·∥vv22|∥ for all ${\\pmb v}_{1},{\\pmb v}_{2}\\in\\mathbb{R}^{k}\\setminus\\{{\\bf0}\\}$ . ", "page_idx": 4}, {"type": "text", "text": "PDEs. Let ${\\pmb u}({\\pmb x})$ be a solution of a given PDE $\\Delta$ , discretized on a rectangular grid $\\chi_{\\mathrm{grid}}=\\{\\pmb{x}_{i}\\}_{i=1}^{N_{\\mathrm{grid}}}.$ For a transformed data $\\vartheta_{s}(\\pmb{u})$ , we measure the violation of the equality $\\Delta=0$ to assess whether the transformed data is still a valid solution. Using an appropriate numerical differentiation method, we directly compute the value of the PDE, denoted as $\\Delta(\\vartheta_{s}(u))$ , which represents the error of $\\vartheta_{s}(\\pmb{u})$ as a solution of $\\Delta$ , taking a value $\\Delta(\\vartheta_{s}(u))_{i}$ at grid point $\\pmb{x}_{i}$ . The validity score is defined by the summation of all PDE errors across the grid points: ", "page_idx": 4}, {"type": "equation", "text": "$$\nS(\\vartheta_{s},\\pmb{u})=\\sum_{i}\\left|\\Delta(\\vartheta_{s}(\\pmb{u}))_{i}\\right|.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "For example, for a solution $u(x)$ of the 1D KdV equation, we examine whether the transformed solution $\\tilde{u}=\\vartheta_{s}(u)$ satisfies $\\tilde{u}_{t}+\\tilde{u}\\tilde{u}_{x}+\\tilde{u}_{x x x}=0$ where the partials are computed using a numerical differentiation method. ", "page_idx": 5}, {"type": "text", "text": "4.3 Parametrization of One-Parameter Groups using Neural ODE ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "On a Euclidean domain ${\\mathcal{Z}}\\subseteq\\mathbb{R}^{n}$ , we model an infinitesimal generator with an MLP $h_{\\theta}:\\mathcal{Z}\\subseteq$ $\\mathbb{R}^{n}\\to\\mathbb{R}^{n}$ . The infinitesimal generator $h_{\\theta}$ gives rise to a one-parameter group $\\vartheta_{s}^{h_{\\theta}}$ . We sample a transformation scale $\\alpha\\sim\\operatorname{Unif}\\left(\\left[-\\sigma,\\sigma\\right]\\right)$ for a predefined hyperparameter $\\sigma\\in\\mathbb{R}_{>0}$ . To transform a point $x\\in{\\mathcal{Z}}$ along this one-parameter group by an amount $\\alpha\\geq0$ , we use a numerical ODE solver to solve the ODE for $\\gamma:[0,\\alpha]\\rightarrow{\\mathcal{Z}}$ satisfying ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\gamma^{\\prime}(s)=h_{\\theta}(\\gamma(s)),\\quad\\forall s\\in[0,\\alpha],\\quad\\gamma(0)=x\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "and obtain a transformed data point $\\tilde{\\pmb{x}}=\\vartheta_{\\alpha}^{\\pmb{h}_{\\theta}}(\\pmb{x})=\\gamma(\\alpha)$ . If $\\alpha<0$ , we compute $\\vartheta_{\\alpha}^{\\pmb{h}_{\\theta}}(\\pmb{x})=\\vartheta_{-\\alpha}^{-\\pmb{h}_{\\theta}}(\\pmb{x})$ by integrating $-h_{\\theta}$ instead of $h_{\\theta}$ using the ODE solver. We can backpropagate through the numerical ODE solver using the adjoint method [6] to learn $\\theta$ . ", "page_idx": 5}, {"type": "text", "text": "Let $f:\\mathcal{X}\\to\\mathcal{Y}$ be a data point on a domain $\\boldsymbol{\\mathcal{A}}$ . As $\\boldsymbol{\\mathcal{A}}$ is a space of functions, naïvely modeling symmetry on $\\boldsymbol{\\mathcal{A}}$ may ignore the geometry implied in the input space $\\mathcal{X}$ . Instead, we define two transformations: $\\vartheta_{\\mathcal{X}}$ on $\\mathcal{X}$ and $\\vartheta_{\\y}$ on $\\boldsymbol{\\wp}$ , and induce a transformation of $f$ by ", "page_idx": 5}, {"type": "equation", "text": "$$\n(\\vartheta_{X}(f))(x)=f(\\vartheta_{X}^{-1}(x)),\\quad(\\vartheta_{\\mathcal{Y}}(f))(x)=\\vartheta_{\\mathcal{Y}}(f(x)),\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where we abuse notation and write the transformed function as $\\vartheta_{\\mathcal{X}}(f)$ and $\\vartheta_{\\y}(f)$ . For an image represented as a discretized function $f:\\mathcal{X}\\to\\mathcal{Y}$ from $\\mathcal{X}=[-1,1]^{2}$ and $y=[0,1]^{3}$ , $\\vartheta_{\\mathcal{X}}$ corresponds to spatial transformations such as translation or rotation, and $\\vartheta_{\\mathcal{y}}$ corresponds to color space transformations. For a PDE, a 1D scalar-valued evolution equation on a fixed periodic domain takes the form $u(x,t)\\in\\mathcal{U}=\\mathbb{R}$ with $(x,t)\\,\\in\\,[0,L]\\,\\times\\,[0,T]^{\\'}=\\,\\chi\\,\\subseteq\\,\\mathbb{R}^{2}$ , and we parameterize an infinitesimal generator on a product space $\\mathcal{X}\\stackrel{}{\\times}\\mathcal{U}\\subseteq\\vec{\\mathbb{R}^{3}}$ by an MLP. Then, a transformation on $(x,t,u)\\in\\mathcal{X}\\times\\bar{\\mathcal{U}}$ induces a transformation on the solution of the PDE $u(x,t)$ . ", "page_idx": 5}, {"type": "text", "text": "4.4 Objective Functions ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "iSnyfimnitmeestirmya ll ogses.neraLteotr $N_{\\mathrm{sym}}$ pbuet etdh ef rnoumm ab esir nogfl es yMmLmP.e tFrioers  etaoc hb $(h_{\\theta}^{(a)})_{a=1}^{N_{\\mathrm{sym}}}$ mbep lteh ae $a\\in\\{1,\\dots,N_{\\mathrm{sym}}\\}$ transformation scale $s_{a}\\sim\\mathrm{Unif}([-\\sigma,\\sigma])$ to transform $f$ via numerical integration. The parameter $\\pmb{\\theta}$ is optimized by minimizing the average validity score over the training data, ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\mathcal{L}_{\\mathrm{sym}}(\\pmb{\\theta})=\\sum_{a=1}^{N_{\\mathrm{sym}}}\\mathbb{E}_{f\\sim\\mathcal{D},s_{a}\\sim\\mathrm{Unif}([-\\sigma,\\sigma])}\\left[S\\Big(\\vartheta_{s_{a}}^{h_{\\theta}^{(a)}},f\\Big)\\right].\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "Orthonormality loss. Learning only with the symmetry loss may result in trivial solutions such as the zero vector field or the same vector field repeated in multiple slots. To prevent this, we introduce the orthonormality loss to regularize the model towards learning orthonomral vector fields. Specifically, given two vector fields $V_{1},V_{2}:\\mathcal{Z}\\to\\mathbb{R}^{n}$ , we define an inner product as, ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\langle V_{1},V_{2}\\rangle={\\frac{1}{\\operatorname{vol}({\\mathcal{Z}})}}\\int_{{\\mathcal{Z}}}\\omega({\\pmb x})(V_{1}({\\pmb x})\\cdot V_{2}({\\pmb x}))d{\\pmb x}\\approx{\\frac{1}{|{\\mathcal{Z}}_{\\mathrm{grid}}|}}\\sum_{{\\pmb x}_{i}\\in{\\mathcal{Z}}_{\\mathrm{grid}}}\\omega({\\pmb x}_{i})(V_{1}({\\pmb x}_{i})\\cdot V_{2}({\\pmb x}_{i})),\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "with a suitable weight function $\\omega(x)\\,:\\,\\mathcal{Z}\\,\\rightarrow\\,\\mathbb{R}$ and a discretized grid ${\\mathcal{Z}}_{\\mathrm{grid}}$ of $\\mathcal{Z}$ of size $|\\mathcal{Z}_{\\mathrm{grid}}|$ . Given this definition, we first normalize each generator by its norm to ensure $\\|h_{\\theta}^{(a)}\\|^{2}=1$ . Then we compute the orthonormality loss as, ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\mathcal{L}_{\\mathrm{ortho}}(\\pmb{\\theta})=\\sum_{1\\leq a<b\\leq N_{\\mathrm{sym}}}\\biggl\\langle\\mathrm{sg}(h_{\\pmb{\\theta}}^{(a)}),h_{\\pmb{\\theta}}^{(b)}\\biggr\\rangle,\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $\\operatorname{sg}(\\cdot)$ denotes the stop-gradient operation to ensure that the constraint $\\langle h_{\\theta}^{(a)},h_{\\theta}^{(b)}\\rangle=0$ only affects the latter slot $(b)$ . By doing this, if the true number of symmetries $N_{\\mathrm{sym}}^{*}$ is less than or equal to the assumed number of symmetries $N_{\\mathrm{sym}}$ , the learned symmetries will be aligned in the first $N_{\\mathrm{sym}}^{*}$ slots. ", "page_idx": 5}, {"type": "text", "text": "Lipschitz loss. We further introduce inductive biases to the infinitesimal generators we aim to learn. For instance, an infinitesimal generator moving only a single pixel near the boundary by a large scale would be undesirable. This idea can be implemented using Lipschitz continuity. For a grid point $\\pmb{x}_{i}\\in\\mathcal{Z}_{\\mathrm{grid}}$ and its neighboring point $\\mathbf{x}_{j}\\in\\mathrm{nbhd}(\\mathbf{x}_{i})\\subset\\mathcal{Z}_{\\mathrm{grid}}$ , we expect the vector field $V$ to satisfy the Lipschitz condition, ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\operatorname{Lips}(V;x_{i},x_{j})<\\tau{\\mathrm{~where~Lips}}(V;x_{i},x_{j})={\\frac{\\|V(x_{i})-V(x_{j})\\|}{\\|x_{i}-x_{j}\\|}}.\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "To regularize the model toward the Lipschitz condition, we introduce the Lipshictz loss, ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\mathcal{L}_{\\mathrm{Lips}}(\\pmb\\theta)=\\sum_{a=1}^{N_{\\mathrm{sym}}}\\sum_{\\pmb{x}_{i}\\in\\mathcal{Z}_{\\mathrm{grid}},\\pmb{x}_{j}\\in\\mathrm{nbhd}(\\pmb x_{i})}\\operatorname*{max}(\\mathrm{Lips}(\\pmb h_{\\pmb\\theta}^{(a)};\\pmb x_{i},\\pmb x_{j})-\\tau,0).\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "Total loss and loss-scale-independent learning. We jointly minimize the three loss functions with suitable weights $w_{\\mathrm{sym}},w_{\\mathrm{ortho}},w_{\\mathrm{Lips}}>0$ and learn the weights $\\pmb{\\theta}$ of MLP using a stochastic gradient descent: ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\theta^{*}=\\underset{\\theta}{\\arg\\operatorname*{min}}\\,w_{\\mathrm{sym}}\\mathcal{L}_{\\mathrm{sym}}(\\theta)+w_{\\mathrm{ortho}}\\mathcal{L}_{\\mathrm{ortho}}(\\theta)+w_{\\mathrm{Lips}}\\mathcal{L}_{\\mathrm{Lips}}(\\theta).\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "To minimize the computational burden of hyperparameter tuning, we ensure that all the loss terms have a natural scale, i.e. a dimensionless scale independent of the context. For example, when penalizing the inner product in Equation 11, we apply arccos to the normalized inner product to ensure the loss term lies in $[0,\\pi/2)$ . Similarly, the scale of the PDE validity score $S(\\vartheta_{s},u)$ in Equation 9 depends on the scale of the data $\\textbf{\\em u}$ . When penalizing it, we apply the log function so that the gradients are scaled automatically as $\\nabla_{\\boldsymbol{\\theta}}\\log(S(\\bar{\\vartheta_{s}},\\mathbf{\\bar{u}}))=\\bar{\\nabla}_{\\boldsymbol{\\theta}}S(\\bar{\\vartheta_{s}},\\bar{\\mathbf{u}})\\big/S(\\bar{\\vartheta}_{s},\\bar{\\mathbf{u}})$ . ", "page_idx": 6}, {"type": "text", "text": "Here we describe the generic training process, but the actual implementation requires non-trivial task-specific designs, such as the choice of the weighting function $w(x)$ or the method for locating the transformed data on the target grid. We defer these details for image and PDE tasks to Appendix A. ", "page_idx": 6}, {"type": "text", "text": "4.5 Comparison With Other Methods ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "Here, we compare our method with other recent symmetry discovery methods. The differences mainly arise from (a) what they aim to learn (e.g., transformation scales or subgroups from a larger group) and (b) their assumptions about prior knowledge (e.g., complete, partial, or no knowledge of symmetry generators). Another important distinction is the viewpoint on symmetry: some methods learn symmetries that raw datasets inherently possess (implicit), while others learn symmetries from datasets explicitly designed to carry such symmetries (explicit). ", "page_idx": 6}, {"type": "text", "text": "Some recent symmetry discovery works are listed in Table 2. We emphasize that our method excels in two key aspects: (a) our learning method reduces infinitely many degrees of freedom, (b) our method works with high-dimensional real-world datasets. For example, while LieGAN [33] and LieGG [24] reduce a 6-dim space (affine) to a 3-dim space (translation and rotation), ours reduces an $\\infty$ -dim space to a finite one. L-conv [9] also does not assume any prior knowledge, but it is limited in finding rotation in a toy task, where it learns rotation angles of rotated images by comparing them with the original ones, which are $7\\mathrm{x}7$ random pixel images. ", "page_idx": 6}, {"type": "text", "text": "5 Experiments ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "5.1 Images ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "We use images of size $32\\times32$ from the CIFAR-10 classification task. Since our method does not model discrete symmetry, we use horizontal flip with $50\\%$ probability by default. We train a ResNet-18 model, which will be used as the feature extractor $H_{\\mathrm{{fext}}}$ in Equation 5. The weight function on the pixels is computed as explained in Appendix A.1. We expect to find 6 affine generators and we use an MLP modeling 10 vector fields in the pixel space $[-1,1]^{\\frac{\\star}{2}}\\subseteq\\mathbb{R}^{2}$ , expecting the first six learned vector fields to be the affine generators. We learn the Equation 14 using stochastic gradient descent with $w_{\\mathrm{sym}}=1$ and $w_{\\mathrm{ortho}},w_{\\mathrm{Lips}}=10$ . The parameter $\\sigma$ , which controls the scale of transformation, is set to $\\sigma\\,=\\,0.4$ , and the Lipschitz threshold $\\tau$ is set to $\\tau\\,=\\,0.5$ . Other details are described in Appendix B.1. We conducted three trials with random initializations and report the full results in ", "page_idx": 6}, {"type": "table", "img_path": "wl44W8xpc7/tmp/dbdebb03426b450d1e92697b8fdd5cea06e96749376a51c47ad25bbe55ef0ab8.jpg", "table_caption": ["Table 2: Comparison with other symmetry discovery methods. "], "table_footnote": [], "page_idx": 7}, {"type": "image", "img_path": "", "img_caption": ["Figure 4: (a) Self inner-products of the learned generators. (b) Inner product comparison of the learned generators with the affine generators. (c) Affine-ness of learned generators. "], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "Appendix C.1. Furthermore, we also learn symmetries in the color space, and their results are shown in Appendix G. ", "page_idx": 7}, {"type": "text", "text": "Learned symmetries. Since we expect to learn affine symmetries, we compare the results with the affine basis $\\{L_{1},\\cdot\\cdot\\cdot,L_{6}\\}$ defined in Table 1. We compute the inner products $\\langle V,L_{i}\\rangle$ of the learned vector field $V$ with $L_{i}$ for $i=1,\\cdots\\,,6$ to measure how much the learned vector fields contain the affine basis and measure the affine-ness of vector field by Affine-ness $\\begin{array}{r}{(V)^{2}=\\sum_{i=1}^{6}\\langle V,L_{i}\\rangle^{2}}\\end{array}$ . ", "page_idx": 7}, {"type": "text", "text": "In all experiments, we successfully retrieve six linearly independent affine generators in the first six slots. Figure 4a shows that the learned generators are orthogonal to each other, as desired. Figure 4b shows the inner product between the learned generators and the affine generators. Since the affineness measure of the first 6 learned generators in Figure $4\\mathrm{c}$ is almost close to 1, we can read out the affine components in Figure $4\\mathrm{b}$ and say that e.g., $V_{1}\\approx(0,-0.98+0.12x_{2})$ . Notably, two translation generators are found in the first two slots, indicating that the two translations are the most invariant one-parameter group among the entire class of one-parameter groups on the pixel space. After the two translation generators, four affine generators are learned, indicating that affine transformations are the next most invariant transformations. In particular, the third and fourth generators are close to the rotation generator and the scaling generator, respectively. The remaining four generators fix pixels close to the center and transform boundary pixels by a large magnitude. ", "page_idx": 7}, {"type": "text", "text": "Analysis. Unlike other symmetry discovery researches [24, 9] that use datasets which are explicitly designed to be symmetric such as rotation MNIST, we discovered affine transformations from CIFAR10 with no augmentation except horizontal flip. Moreover, we extract the symmetries from the ResNet trained with CIFAR-10 without augmentation. This implies that although CIFAR-10 is not explicitly composed to be symmetric under affine transformations, the dataset possesses intrinsic affine symmetry. This also implies that even the ResNet trained without augmentation possesses invariance under affine transformation. It is widely believed that the strong generalization power of neural networks is linked to the augmentation insensitivity of the neural networks [25]. Our results show that ", "page_idx": 7}, {"type": "image", "img_path": "wl44W8xpc7/tmp/da64f1a6faa1547d31dedf3b9064a8862f3207009eee808ee92ff94a133dc861.jpg", "img_caption": ["Figure 5: Inner products between the learned non-affine symmetry generators and the ground truth. The results including the affine symmetry generators are shown in Figure 10a. "], "img_footnote": [], "page_idx": 8}, {"type": "table", "img_path": "wl44W8xpc7/tmp/76e56538d000b1807cbfe2a442ae800c3bdecd72fa1652fdf1921983bc40e578.jpg", "table_caption": ["Table 4: Definition of PDEs. "], "table_footnote": [], "page_idx": 8}, {"type": "table", "img_path": "wl44W8xpc7/tmp/080e4b365c637684f94e4cfec1ccd26e060a1c9a33b2a0e6752ad18d7b2110d7.jpg", "table_caption": ["Table 5: LPS of PDEs. "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "ResNet is insensitive to affine transformation even when not explicitly designed to be so, supporting this hypothesis. This result implies that augmentation explicitly amplifies the insensitivity by using transformed data for training. Our analysis is tangential to that of Gruver et al. [16], which measures the extent of invariance using derivatives along the infinitesimal generators instead of ODE integration. ", "page_idx": 8}, {"type": "text", "text": "Augmentation results. We train a ResNet-18 model using CIFAR10 classification data, applying the learned symmetries as data augmentation. We compare the results of no-augmentation, default augmentation (horizontal filp and random crop), and affine transformation, with transformation scale searched in $\\left\\lbrace0.1,0.2,0.3,0.4,0.5\\right\\rbrace$ . We conduct five experiments with random initialization for all the settings and report the results in Table 3. ", "page_idx": 8}, {"type": "table", "img_path": "wl44W8xpc7/tmp/d6fc65e265fd3b24df299e0f5efe4dba2f5bf2d5eb17b5deafba423909573921.jpg", "table_caption": ["Table 3: Test accuracy in CIFAR-10. "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "5.2 PDEs ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "We follow the experimental setting of Brandstetter et al. [4], which use the Korteweg-de Vries (KdV) equation, the Kuramoto-Shivashinsky (KS) equation, and the Burgers’ equation on a 1D periodic domain as experiments. They all have time translation, space translation, and the Galilean boost as LPSs. To consider PDEs with non-trivial and non-affine symmetries, we add two variants of the KdV, namely the nKdV equation and the cKdV equation. The nKdV is yielded by a nonlinear time translation of the original KdV, and the cKdV is the cylindrical KdV equation, having an extra time-dependent term. The equations are listed in Table 4, and their symmetries are listed in Table 5. Note that some symmetries are ruled out since we work within a fixed periodic domain, e.g., the scaling symmetry of the KdV. Since there are at most three symmetries, we open four slots in an MLP and learn symmetries using weights $w_{\\mathrm{sym}},w_{\\mathrm{Lips}}=1$ and $w_{\\mathrm{ortho}}=3$ . ", "page_idx": 8}, {"type": "image", "img_path": "wl44W8xpc7/tmp/fad08eec79a17ebface5d972457ed898cd1c49c94e8b22c5be1744ba8ea7f9c9.jpg", "img_caption": ["Figure 6: Comparison of augmentation performances using the ground truth symmetries and the learned symmetries with various numbers of data. The symbol $\\varnothing$ stands for no-augmentation. "], "img_footnote": [], "page_idx": 8}, {"type": "table", "img_path": "wl44W8xpc7/tmp/8ed463a6f27624ecbed5e027374e0f0a282c50da9eb2b2c132e629c145931de5.jpg", "table_caption": ["Table 6: Test NMSE comparison of augmentation using LPS and AS in FNO learning for cKdV. ", "Learned symmetries. We compare the learned symmetries with the ground-truth symmetries using inner products. We found the ground truth symmetries in all the experiments as in Figure 5 and Figure 10. "], "table_footnote": [], "page_idx": 9}, {"type": "text", "text": "Interestingly, for the Burgers’ equation and the cKdV equation, we additionally found the $u$ -axis rescaling operation $(0,0,u)$ and the time translation $(0,1,0)$ respectively. Applying the $u$ -axis rescaling $u\\mapsto c u$ for $c\\approx1$ to the Burgers’ equation $u_{t}+u u_{x}-\\nu u_{x}x=0$ gives $\\overline{{c u_{t}}}+c^{2}u u_{x}-$ $\\nu c u_{x}x=c(c-1)u u_{x}$ , leaving only the $u u_{x}$ term. The $u u_{x}$ term in Burgers’ is called the convection term, and it is approximately zero in most region and spikes in some small region. Similarly, the time translation $t\\mapsto t+c$ for $c\\approx0$ fixes the first three terms in the cKdV equation $u_{t}+u u_{x}+u_{x x x}+$ $u/(2(t+1))=0$ and only changes the last term $u/(2(t+1))$ by a negligible amount. These are not LPSs of the given equations, but the error of the PDE after transformation is smaller than the error of the numerical differentiation method. These are approximate symmetries (AS), and the theory of AS is also of great interest in the symmetry analysis of PDEs [2, 1]. ", "page_idx": 9}, {"type": "text", "text": "Augmentation results. We use the learned symmetries as data augmentation and train Fourier Neural Operators (FNOs). The detailed experiment setting is described in Appendix B.2. Since FNOs are extremely sensitive to numerical error, we employ Whittaker-Shannon interpolation, explained in Appendix D.2, to resample the transformed results. The results are depicted in Figure 6. In all cases, data augmentation using the learned symmetries improve the performance, almost close to the results using the ground truth symmetries. The detailed results are in Appendix C.2. Additionally, we verify that the approximate symmetry of cKdV is also beneficial to training, as shown in Table 6, especially when the numbers of data points is low, proving the effectiveness of symmetries extracted from data. ", "page_idx": 9}, {"type": "text", "text": "Ablations. Additional ablation studies on numerical methods, such as numerical differentiation and interpolation, and hyperparameter sensitivity are conducted, and their results are presented in Appendices E and F. ", "page_idx": 9}, {"type": "text", "text": "6 Conclusion ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "We have introduced a novel method for learning continuous symmetries, including non-affine transformations, from data without prior knowledge. By leveraging Neural ODE, our approach models one-parameter groups to generate a sequence of transformations, guided by a task-specific validity score function. This approach captures both affine and non-affine symmetries in image and PDE datasets, enhancing automatic data augmentation in image classification and neural operator learning for PDEs. The learned generators produce augmented training data that improve model performance, particularly with limited training data. ", "page_idx": 9}, {"type": "text", "text": "Limitation. However, despite its flexibility, our method requires careful selection of numerical methods, such as numerical differentiation and interpolation, to ensure stable training and the ODE integration can be computationally large for augmentation generation compared to other augmentation methods. While we focus on image symmetries and LPSs of PDEs, the method could potentially model other symmetries and domains with proper validity scores, suggesting future applications in learning complex symmetries, including conditional and non-local symmetries, in various data types. ", "page_idx": 9}, {"type": "text", "text": "Acknowledgments and Disclosure of Funding ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "This work was partly supported by Institute of Information & communications Technology Planning & Evaluation (IITP) grant funded by the Korea government(MSIT) (No.RS-2019-II190075, Artificial Intelligence Graduate School Program(KAIST), No.2022-0-00713, Meta-learning Applicable to Realworld Problems, No.2022-0-00184, Development and Study of AI Technologies to Inexpensively Conform to Evolving Policy on Ethics, No.RS-2024-00509279, Global AI Frontier Lab) ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "[1] Baikov, V., Gazizov, R., and Ibragimov, N. K. Approximate symmetry and formal linearization. Journal of Applied Mechanics and Technical Physics, 30(2):204–212, 1989. 10   \n[2] Baumann, G. Approximate symmetries of partial differential equations. Symmetry Analysis of Differential Equations with Mathematica $\\textsuperscript{\\textregistered}$ , pp. 404–423, 2000. 10   \n[3] Benton, G. W., Finzi, M., Izmailov, P., and Wilson, A. G. Learning invariances in neural networks from training data. In Advances in Neural Information Processing Systems 35 (NeurIPS 2022), 2020. 1, 4   \n[4] Brandstetter, J., Welling, M., and Worrall, D. E. Lie point symmetry data augmentation for neural pde solvers. In International Conference on Machine Learning, pp. 2241–2256. PMLR, 2022. 1, 2, 5, 9, 14, 15   \n[5] Cantwell, B. J. Introduction to symmetry analysis. Cambridge University Press, 2002. 4   \n[6] Chen, R. T., Rubanova, Y., Bettencourt, J., and Duvenaud, D. K. Neural ordinary differential equations. Advances in neural information processing systems, 31, 2018. 2, 6   \n[7] Cohen, T. and Welling, M. Group equivariant convolutional networks. In International conference on machine learning, pp. 2990–2999. PMLR, 2016. 1, 5   \n[8] Dangovski, R., Jing, L., Loh, C., Han, S., Srivastava, A., Cheung, B., Agrawal, P., and Soljacic, M. Equivariant self-supervised learning: Encouraging equivariance in representations. In International Conference on Learning Representations (ICLR), 2022. 1   \n[9] Dehmamy, N., Walters, R., Liu, Y., Wang, D., and Yu, R. Automatic symmetry discovery with lie algebra convolutional network. Advances in Neural Information Processing Systems, 34: 2503–2515, 2021. 2, 4, 7, 8   \n[10] Desai, K., Nachman, B., and Thaler, J. Symmetry discovery with deep learning. Physical Review D, 105(9):096031, 2022. 4   \n[11] Dey, N., Chen, A., and Ghafurian, S. Group equivariant generative adversarial networks. In 9th International Conference on Learning Representations, ICLR 2021, Virtual Event, Austria, May 3-7, 2021, 2021. 1   \n[12] Dumbser, M. and Käser, M. Arbitrary high order non-oscillatory finite volume schemes on unstructured meshes for linear hyperbolic systems. Journal of Computational Physics, 221(2): 693–723, 2007. 14, 16, 18   \n[13] Forestano, R. T., Matchev, K. T., Matcheva, K., Roman, A., Unlu, E. B., and Verner, S. Deep learning symmetries and their lie groups, algebras, and subalgebras from first principles. Machine Learning: Science and Technology, 4(2):025027, 2023. 2, 4   \n[14] Gabel, A., Quax, R., and Gavves, E. Data-driven lie point symmetry detection for continuous dynamical systems. Machine Learning: Science and Technology, 2024. 2   \n[15] Garrido, Q., Najman, L., and LeCun, Y. Self-supervised learning of split invariant equivariant representations. In Proceedings of The 40th International Conference on Machine Learning (ICML 2023), 2023. 1   \n[16] Gruver, N., Finzi, M. A., Goldblum, M., and Wilson, A. G. The lie derivative for measuring learned equivariance. In The Eleventh International Conference on Learning Representations, ICLR 2023, Kigali, Rwanda, May 1-5, 2023, 2023. 9   \n[17] Hoarau, E. and David, C. Lie group computation of finite difference schemes. arXiv preprint math/0611895, 2006. 9   \n[18] Hoogeboom, E., Satorras, V. G., Vignac, C., and Welling, M. Equivariant diffusion for molecule generation in 3d. In Proceedings of The 39th International Conference on Machine Learning (ICML 2022), 2022. 1 ", "page_idx": 10}, {"type": "text", "text": "[19] Huang, Y., Peng, X., Ma, J., and Zhang, M. 3dlinker: An E(3) equivariant variational autoencoder for molecular linker design. In Proceedings of The 39th International Conference on Machine Learning (ICML 2022), 2022. 1 ", "page_idx": 11}, {"type": "text", "text": "[20] Lee, J. M. Smooth manifolds. Springer, 2012. 3   \n[21] Li, Z., Kovachki, N. B., Azizzadenesheli, K., Liu, B., Bhattacharya, K., Stuart, A. M., and Anandkumar, A. Fourier neural operator for parametric partial differential equations. In 9th International Conference on Learning Representations, ICLR 2021, Virtual Event, Austria, May 3-7, 2021, 2021. 2   \n[22] Liu, Z. and Tegmark, M. Machine learning hidden symmetries. Physical Review Letters, 128 (18):180201, 2022. 4   \n[23] Mialon, G., Garrido, Q., Lawrence, H., Rehman, D., LeCun, Y., and Kiani, B. Self-supervised learning with lie symmetries for partial differential equations. Advances in Neural Information Processing Systems, 36:28973–29004, 2023. 1, 5   \n[24] Moskalev, A., Sepliarskaia, A., Sosnovik, I., and Smeulders, A. W. M. Liegg: Studying learned lie group generators. In Advances in Neural Information Processing Systems 35 (NeurIPS 2022), 2022. 2, 4, 7, 8   \n[25] Novak, R., Bahri, Y., Abolafia, D. A., Pennington, J., and Sohl-Dickstein, J. Sensitivity and generalization in neural networks: an empirical study. In 6th International Conference on Learning Representations, ICLR 2018, Vancouver, BC, Canada, April 30 - May 3, 2018, Conference Track Proceedings, 2018. 8   \n[26] Oliveri, F. Lie symmetries of differential equations: Classical results and recent contributions. Symmetry, 2(2):658–706, 2010. ISSN 2073-8994. doi: 10.3390/sym2020658. URL https: //www.mdpi.com/2073-8994/2/2/658. 2, 4   \n[27] Olver, P. J. Applications of Lie groups to differential equations, volume 107. Springer Science & Business Media, 1993. 4   \n[28] Rao, R. and Ruderman, D. Learning lie groups for invariant visual perception. Advances in neural information processing systems, 11, 1998. 4   \n[29] Shorten, C. and Khoshgoftaar, T. M. A survey on image data augmentation for deep learning. Journal of big data, 6(1):1–48, 2019. 1, 5   \n[30] Sil, S. Nonclassical symmetries, nonlinear self-adjointness, conservation laws and some new exact solutions of cylindrical kdv equation. International Journal of Applied and Computational Mathematics, 9(5):69, 2023. 9   \n[31] Simard, P. Y., Steinkraus, D., Platt, J. C., et al. Best practices for convolutional neural networks applied to visual document analysis. In Icdar, volume 3. Edinburgh, 2003. 1, 5   \n[32] Sohl-Dickstein, J., Wang, C. M., and Olshausen, B. A. An unsupervised algorithm for learning lie group transformations. arXiv preprint arXiv:1001.1027, 2010. 4   \n[33] Wang, R., Walters, R., and Yu, R. Incorporating symmetry into deep dynamics models for improved generalization. In 9th International Conference on Learning Representations, ICLR 2021, Virtual Event, Austria, May 3-7, 2021, 2021. 1, 5, 7   \n[34] Yang, J., Walters, R., Dehmamy, N., and Yu, R. Generative adversarial symmetry discovery. In Proceedings of The 40th International Conference on Machine Learning (ICML 2023), 2023. 1, 4   \n[35] Zabusky, N. J. and Kruskal, M. D. Interaction of\" solitons\" in a collisionless plasma and the recurrence of initial states. Physical review letters, 15(6):240, 1965. 4   \n[36] Zhang, Y.-T. and Shu, C.-W. Eno and weno schemes. In Handbook of numerical analysis, volume 17, pp. 103–122. Elsevier, 2016. 14, 16 ", "page_idx": 11}, {"type": "text", "text": "A Implementation Details ", "text_level": 1, "page_idx": 12}, {"type": "text", "text": "A.1 Image Dataset ", "text_level": 1, "page_idx": 12}, {"type": "text", "text": "Notation. Images are functions of the form $f:\\mathcal X\\to\\mathcal Y$ , where $\\mathcal{X}=[-1,1]^{2}$ is the spatial domain and $\\mathcal{D}=[0,1]^{3}$ is the normalized RGB domain. Pixels $\\chi_{\\mathrm{grid}}=\\{\\pmb{x}_{i}\\}_{i=1}^{N_{\\mathrm{grid}}}$ i}iN=gr1id are discretized through a rectangular grid of $\\mathcal{X}$ , and images $f$ are discretized on the pixel space by $f_{i}=f(\\pmb{x}_{i})$ for all . ", "page_idx": 12}, {"type": "text", "text": "$\\omega(x)$ in orthonormality loss. We first learn a symmetry on the spatial domain $\\mathcal{X}$ using a feature extractor $H_{\\mathrm{hidden}}$ taken from a pretrained neural network. One obstacle is that in most image datasets, the main subjects of images are mostly located around the centers, and the regions close to the boundary are filled with backgrounds. In other words, each pixel has a different level of importance, and we may end up learning infinitesimal generators that only move boundary pixels and fix the center. ", "page_idx": 12}, {"type": "text", "text": "We take into account the importance of pixels using the weight function $\\omega(x):\\mathcal{X}\\rightarrow\\mathbb{R}_{\\ge0}$ . For a discretized image $\\bar{f}=\\{f_{i}\\}$ and for each pixel $\\pmb{x}_{i}$ , we measure a pixel sensitivity of the image $f$ at the $i$ -th pixel up to the feature extractor $H_{\\mathrm{{fext}}}$ as ", "page_idx": 12}, {"type": "image", "img_path": "wl44W8xpc7/tmp/411fb991f81775926ec699b64f3b674bc6d78d5bb570c09f53ba590f33064a45.jpg", "img_caption": ["Figure 7: The weight function $\\omega(x)$ . "], "img_footnote": [], "page_idx": 12}, {"type": "equation", "text": "$$\n\\mathrm{Sensitivity}(f,\\mathbf{x}_{i})=\\left\\|\\frac{\\partial H_{\\mathrm{fext}}(f)}{\\partial\\mathbf{x}_{i}}\\right\\|=\\left\\|\\frac{\\partial f_{i}}{\\partial\\mathbf{x}_{i}}\\frac{\\partial H_{\\mathrm{fext}}(f)}{\\partial f_{i}}\\right\\|,\n$$", "text_format": "latex", "page_idx": 12}, {"type": "text", "text": "which can be computed by querying a Jacobian-vector product of $H_{\\mathrm{{fext}}}$ with respect to the image gradient at each pixe l ∂∂xfii . We define the weight ω(x) as the average of pixel sensitivity across the dataset: ", "page_idx": 12}, {"type": "equation", "text": "$$\n\\omega({\\pmb x}_{i})=\\mathbb{E}_{f\\sim\\mathcal{D}}[\\mathrm{Sensitivity}(f,{\\pmb x}_{i})]=\\mathbb{E}_{f\\sim\\mathcal{D}}\\left[\\left\\|\\frac{\\partial H_{\\mathrm{fext}}(f)}{\\partial{\\pmb x}_{i}}\\right\\|\\right].\n$$", "text_format": "latex", "page_idx": 12}, {"type": "text", "text": "However, computing this weight function $\\omega$ needs $N_{\\mathrm{grid}}\\cdot N_{\\mathrm{data}}$ times of computation of Jacobianvector products. Instea we use a Gaussian kern $\\begin{array}{r}{\\kappa(\\pmb{x};\\hat{\\pmb{x}},\\sigma)=\\frac{1}{\\sqrt{2\\pi}\\sigma}\\exp(-\\frac{||\\pmb{x}-\\hat{\\pmb{x}}||^{2}}{2\\sigma^{2}})}\\end{array}$ , with a fixed and the center $\\hat{\\pmb{x}}$ sampled uniformly on $\\mathcal{X}$ , and approximate the weight function by ", "page_idx": 12}, {"type": "equation", "text": "$$\n\\omega(\\pmb{x}_{i})\\approx\\mathbb{E}_{f\\sim\\mathcal{D},\\hat{\\pmb{x}}\\sim\\mathrm{Unif}(\\mathcal{X})}\\left[\\kappa\\big(\\pmb{x}_{i};\\hat{\\pmb{x}},\\sigma\\big)\\bigg\\|\\sum_{j}\\frac{\\partial H_{\\mathrm{fext}}(f)}{\\partial\\pmb{x}_{j}}\\kappa(\\pmb{x}_{j};\\hat{\\pmb{x}},\\sigma)\\bigg\\|\\right]\n$$", "text_format": "latex", "page_idx": 12}, {"type": "text", "text": "so that we compute the weight in a stochastic manner. Intuitively, it computes Jacobian-vector product for each larger pseudo-pixel represented by the Gaussian kernels instead of each individual pixel. We iterate over the dataset 20 times, and the computed weight function is shown in Figure 7. ", "page_idx": 12}, {"type": "text", "text": "Training details. The infinitesimal generator $h_{\\theta}^{(a)}$ transforms each pixel $\\pmb{x}_{i}$ into $\\tilde{\\pmb{x}}_{i}$ via ODE integration. In this process, the transformed pixels $\\{\\breve{x}_{i}\\}$ may no longer be located on the rectangular grid $\\chi_{\\mathrm{grid}}$ , so we use the bilinear interpolation method to resample the transformed image $\\vartheta_{s}(\\bar{f})$ on $\\chi_{\\mathrm{grid}}$ . Note that the bilinear interpolation operation is differentiable, thereby we can train the MLP by minimizing the validity score $S\\bar{(\\vartheta_{s},f)}$ , which is the cosine similarity between the features of $f$ and $\\vartheta_{s}(f)$ : ", "page_idx": 12}, {"type": "equation", "text": "$$\nS\\left(\\vartheta_{s},f\\right)=\\sin\\left(H_{\\mathrm{fext}}(\\vartheta_{s}(f)),H_{\\mathrm{fext}}(f)\\right).\n$$", "text_format": "latex", "page_idx": 12}, {"type": "text", "text": "A.2 PDE Dataset ", "text_level": 1, "page_idx": 12}, {"type": "text", "text": "Notation. Solutions of a 1D scalar-valued evolution equation on a periodic domain take the form $u(x,t):\\mathcal{X}\\to\\mathcal{U}$ for $\\mathcal{X}=[0,L]\\times[0,T]$ and $\\mathcal{U}=\\mathbb{R}$ , where $[0,L]$ is the spatial domain and $[0,T]$ is the temporal domain. Similar to the image task, the domain $\\mathcal{X}$ is discretized by the rectangular grid $\\bar{\\chi}_{\\mathrm{grid}}\\overset{\\bar{}}{=}\\{x_{i}\\}_{i=1}^{N_{\\mathrm{grid}}}=\\{(x_{i},t_{i})\\}_{i=1}^{N_{\\mathrm{grid}}}$ . A discretized solution is a set of tuples $(x_{i},t_{i},u_{i})$ where $u_{i}=\\bar{u}(x_{i},t_{i})$ . ", "page_idx": 12}, {"type": "text", "text": "$\\omega(x)$ in orthonormality loss. Unlike in images, we assume that all discretized grid points hold equal importance, so we set $\\omega({\\pmb x})=1$ for all $\\pmb{x}\\in\\mathcal{X}$ . ", "page_idx": 13}, {"type": "text", "text": "Training details. The infinitesimal generators on the product space $\\mathcal{X}\\times\\mathcal{U}$ transform a point $\\pmb{u}=\\{(\\bar{x_{i}},t_{i},u_{i})\\}$ into $\\pmb{\\tilde{u}}=\\{(\\tilde{x}_{i},\\tilde{t}_{i},\\tilde{\\bar{u_{i}}})\\}$ . Therefore, the transformed solutions are no longer on the rectangular grid. To compute the PDE value $\\Delta(\\tilde{{\\boldsymbol{u}}})$ for $\\tilde{\\pmb{u}}=\\vartheta_{s}(\\pmb{u})$ in Equation 6, we need to compute partial derivatives numerically such as $u_{x}(\\tilde{x}_{i},\\tilde{t}_{i})$ , $u_{t}(\\tilde{x}_{i},\\tilde{t}_{i})$ or $u_{x x}(\\tilde{x}_{i},\\tilde{t}_{i})$ . We use the finite difference method, in which the numerical derivative is approximated by finite differences, e.g., ", "page_idx": 13}, {"type": "equation", "text": "$$\nu_{x}(x_{i},t_{i})=\\frac{u(x_{i}+\\Delta x,t_{i})-u(x_{i}-\\Delta x,t_{i})}{2\\Delta x}.\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "for some small $\\Delta x$ . ", "page_idx": 13}, {"type": "text", "text": "In particular, we use the weighted essentially non-oscillating (WENO) scheme as a numerical differentiation method [36], with a careful choice of parameters as in Dumbser & Käser [12]. In the WENO method, multiple estimates for derivatives are made using multiple sets of neighboring gridpoints (called stencils). The multiple estimates are then averaged with weights (called smoothness indicator) that approximate how stable the derivative estimates are . We implement the WENO method working on a nonuniform grid, and the model learns symmetries by backpropagating through it. A detailed description on the WENO scheme is in Appendix D.1. ", "page_idx": 13}, {"type": "text", "text": "B Experiment Details ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "In this section, we present the detailed experimental settings of the experiments in $\\S\\ S$ . ", "page_idx": 13}, {"type": "text", "text": "B.1 Images ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "Training ResNet-18. When training the ResNet-18 with CIFAR-10, both the feature extractor $H_{\\mathrm{{fext}}}$ and models after augmentation, we train the model in 200 epochs with a batch size 128. The learning rate is set to $10^{-1}$ and decreases by a factor of 0.2 at the 60th, 120th, and 160th epoch. The model is trained by SGD optimizer with Nesterov momentum 0.9 and weight decay 0.4. ", "page_idx": 13}, {"type": "text", "text": "Learning symmetries. To learn the symmetry generators, we train the MLP using two shared hidden layers, each with a width of 256, followed by a hidden layer of width 32 for each output vector field. We use the swish activation function to ensure the learned vector fields are smooth. The MLP is trained for 50 epochs with a batch size 128 and fixed learning rate of $10^{-4}$ using the Adam optimizer. The learning process takes less than 10 hours on a GeForce RTX 2080 Ti GPU. ", "page_idx": 13}, {"type": "text", "text": "B.2 PDEs ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "Data generation. We follow the data generation method of Brandstetter et al. [4]. Given an 1D evolution equation $u_{t}=F(x,t,u,u_{x},u_{x}x x,\\cdot\\cdot\\cdot)$ for $u=u(x,t)$ on periodic domain $[0,L]$ , we start with an initial condition $u(x,0)$ by random Fourier series as ", "page_idx": 13}, {"type": "equation", "text": "$$\nu(x,0)=\\sum_{p=1}^{P}A_{p}\\sin(2\\pi l_{p}x/L+\\phi_{p})\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "where $P$ is the number of Fourier modes and $(A_{p},l_{p},\\phi_{p})$ are random coefficients. For time-stepping, we compute $x$ -derivatives $u_{x},u_{x x},\\cdot\\cdot\\cdot$ using pseudospectral method, which computes derivatives in Fourier domain and converts them back to the original domain. We use an ODE solver to compute the time evolution of $u(x,t)$ from $t=0$ to $t=T$ . The solution is discretized on regular grid of size $N_{x}\\times N_{t}$ on $[0,L]\\times[0,T]$ , where $N_{x}=256$ and $N_{t}=140$ by default. ", "page_idx": 13}, {"type": "text", "text": "When simulating Burgers’ equation, we instead solve the PDE for the heat equation $\\phi_{t}\\,=\\,\\phi_{x x}$ for $\\phi\\,=\\,\\nu\\phi(x,t)$ . The Burgers’ equation $u(x,t)$ and the heat equation $\\phi({\\boldsymbol{x}},t)$ is related via the Cole-Hopf transformation: ", "page_idx": 13}, {"type": "equation", "text": "$$\nu=2\\nu\\frac{\\partial}{\\partial x}\\log(x).\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "After data generation, we transform the heat equation back to the Burgers’ equation. ", "page_idx": 13}, {"type": "text", "text": "Learning symmetries. We use an MLP with the same architecture as described in Appendix B.1. Since all the tuples $(x,t,u)$ must pass through the MLP, totaling $N_{x}\\times N_{t}$ for each data instance, we set a small batch size 4. Symmetries are learned using 1024 data instances over 50 epochs. We use the Adam optimizer and train the network with a learning rate of $10^{-4}$ in the first 25 epochs and $10^{-5}$ for the remaining 25 epochs. The learning process also takes less than 10 hours on a GeForce RTX 2080 Ti GPU. ", "page_idx": 14}, {"type": "text", "text": "Sobolev regularization. To ensure smoothness in the vector fields, we apply additional regularization using the Sobolev norm of order 2 in the $x$ -domain. For a vector field $V(x,t)$ , the Sobolev norm can be efficiently computed in Fourier domain: ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\|V(\\cdot,t)\\|_{2,2}^{2}=\\sum_{i=0}^{2}\\left\\|\\frac{\\partial^{i}V(\\cdot,t)}{\\partial x^{i}}\\right\\|_{2}^{2}=\\sum_{n=0}^{N_{x}-1}\\left(1+|\\frac{n_{\\mathrm{freq}}}{L}|\\right)^{2}\\hat{V}(n,t)\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "where $n_{\\mathrm{freq}}=\\operatorname*{min}(n,N_{x}-n)$ and $\\hat{V}(\\cdot,t)$ is the discrete Fourier transformation of $V(\\cdot,t)$ . Since we already enforce $||V||=1$ , we penalize towards the Sobolev norm excluding the zeroth order term: ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\|V(\\cdot,t)\\|_{2,2}^{2}-\\|V(\\cdot,t)\\|_{2}^{2}=\\sum_{i=1}^{2}\\left\\|\\frac{\\partial^{i}V(\\cdot,t)}{\\partial x^{i}}\\right\\|_{2}^{2}=\\sum_{n=0}^{N_{x}-1}\\left(\\left(1+|\\frac{n_{\\mathrm{freq}}}{L}|\\right)^{2}-1\\right)\\hat{V}(n,t).\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "We apply the Sobolev regularization during the final 10 epochs. ", "page_idx": 14}, {"type": "text", "text": "Training FNOs. For the KdV and KS equations, we train an autoregressive FNO solver, which takes 20 timesteps as input and predicts the subsequent 20 timesteps, following the experimental setup of Brandstetter et al. [4]. For the nKdV and cKdV equations, which are time-dependent and contain explicit $t$ terms, we train FNOs as single-time neural operators. These models utilizes the initial conditions of the equations to predict the states after 70 timesteps. We train the FNO over 40 epochs, with each epoch comprising 280 iterations across the dataset for the KdV and KS equation and 100 iterations for the nKdV and cKdV equations. The learning rate begins at $10^{-4}$ and decreases by a factor of 0.4 every 10 epochs. ", "page_idx": 14}, {"type": "text", "text": "C Experiment Results ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "In this section, we provide detailed results of the experiments outlined in $\\S\\ S$ . For symmetry learning tasks, we conducted each experiment three times and randomly selected one for reporting in $\\S\\ S$ . The complete set of results is provided here. Also, we report the detailed evaluation metrics in augmentation tasks. ", "page_idx": 14}, {"type": "text", "text": "C.1 Images ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Figure 8 is a visualizations of the learned symmetries discussed in $\\S\\ 5.1$ . Figure 9 displays results from experiments conducted under the same settings but with different model initializations compared to Figure 4 in $\\S\\ 5.1$ . It is notable that affine symmetries consistently occupy the first six slots across all experiments. ", "page_idx": 14}, {"type": "text", "text": "C.2 PDEs ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "We report experiments results for learning symmetries, conducting three trials for each equation in figure Figure 10. The ground truth symmetries and the approximate symmetries are consistently found in the former slots in all the experiments. The remaining fourth slots occasinally converge to learned symmetries despite the orthonormality loss or converge to some unknown vector fields with high validity scores. The results from the first trials are used in the augmentation experiments. ", "page_idx": 14}, {"type": "text", "text": "In Table 7 and Table 8, we provide the augmentation results of FNOs using the learned symmetries, which are illustrated in Figure 6. ", "page_idx": 14}, {"type": "image", "img_path": "wl44W8xpc7/tmp/37396320045b0cab8634e94e85bd119f82b3262b132232ff6e231d8baf338a8f.jpg", "img_caption": ["Figure 8: (a) The learned vector fields. (b) Transformed images using the learned generators. The images with transformation scale 0 are the original images. "], "img_footnote": [], "page_idx": 15}, {"type": "table", "img_path": "wl44W8xpc7/tmp/31057f56abce76dd3e59c20e8a661880aceefdc580d6695c98a4d4d10e95db61.jpg", "table_caption": ["Table 7: Comparison of augmentation methods with different numbers of data for KdV and KS "], "table_footnote": [], "page_idx": 15}, {"type": "text", "text": "D Technical Details ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "D.1 Weighted Essentially Non-Oscillating (WENO) Scheme ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "This section is largely based on Zhang & Shu [36], Dumbser & Käser [12]. ", "page_idx": 15}, {"type": "text", "text": "WENO scheme in 1D. Consider a smooth function $f:\\mathcal{X}\\subseteq\\mathbb{R}\\to\\mathbb{R}$ , where we only have access to the function on the grid $\\mathcal{X}_{\\mathrm{grid}}=\\{x_{1},\\cdot\\cdot\\cdot,x_{N_{\\mathrm{grid}}}\\},x_{1}<\\cdot\\cdot\\cdot<x_{N_{\\mathrm{grid}}}$ . To estimate the derivatives $\\begin{array}{r}{f^{(k)}(x)=\\frac{d^{k}f}{d x^{k}}(x)}\\end{array}$ for some $x\\in\\mathscr{X}$ , we use $k+1$ neighboring points in $I=\\{x_{i},\\cdot\\cdot\\cdot,x_{i+k}\\}$ and compute the unique -th order polynomial $p_{I}(x)$ that interpolates the function $f$ on the points in $I$ . In other words, we ensure $\\bar{p_{I}(x_{i})}=f(x_{i}),\\dot{\\cdot}\\cdot\\dot{\\cdot},p_{I}(x_{i+k}\\bar{\\rangle}=f(x_{i+k})$ . Then we can pick up the estimates of the derivatives using the polynomial as $f^{(k)}(x)\\approx p_{I}^{(k)}(x)$ . We call the set of neighboring points $I$ a stencil, and the polynomial $p_{I}$ the reconstruction polynomial. Usage of reconstruction polynomials is a fundamental concept in the numerical differentiation method known as the finite difference method. ", "page_idx": 15}, {"type": "text", "text": "$p_{I_{1}}^{(k)}(x),\\cdot\\cdot\\cdot\\,,p_{I_{N_{s}}}^{(k)}(x)$ e fnotir atlhlye  dneorinv-aotsicvielsl $f^{(k)}(x)$ W uEsiNngO )m suclthieplme es,t ewncei lcs $I_{1},\\cdot\\cdot\\cdot\\,,I_{N_{s}}$ .t ipTlhee  eessttiimmaatteess are then averaged with weights $\\omega_{1},\\cdots,\\omega_{N_{s}}$ which take account of the quality of each estimation. In the WENO scheme, we assume the grid points are sufficiently dense, hence the estimates are more accurate when the reconstruction polynomials $p_{I_{m}}$ are smooth. The smoothness of $p_{I_{m}}$ is measured by the smoothness indicator, defined as: ", "page_idx": 15}, {"type": "image", "img_path": "wl44W8xpc7/tmp/705762b15ba5daf2785787e1a624a624c1fc03bd3e779d9887194e7f433f8078.jpg", "img_caption": ["Figure 9: The same results (learned symmetries of images) under different initializations compared to Figure 4. ", "(b) Third experiment. "], "img_footnote": [], "page_idx": 16}, {"type": "table", "img_path": "wl44W8xpc7/tmp/e83553a04977f2dd319dc1448b43624da5ad14b3791be90c415b5f65487a9605.jpg", "table_caption": ["Table 8: Comparison of augmentation methods with different numbers of data for nKdV and cKdV "], "table_footnote": [], "page_idx": 16}, {"type": "text", "text": "", "page_idx": 16}, {"type": "equation", "text": "$$\n\\mathrm{IS}_{I_{m}}=\\sum_{\\alpha=1}^{k}\\int_{\\Delta}\\vert\\Delta\\vert^{\\alpha-1}(p_{I_{m}}^{(\\alpha)}(x))^{2}d x\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "where $\\Delta=(x_{j},x_{j+1})\\subset\\mathbb{R}$ is an interval between two grid points containing $x$ , and $|\\Delta|$ is the length of $\\Delta$ . The weights $\\omega_{1},\\cdots,\\omega_{N_{s}}$ are defined as: ", "page_idx": 16}, {"type": "equation", "text": "$$\n\\omega_{m}=\\frac{\\alpha_{m}}{\\sum_{m^{\\prime}}\\alpha_{m^{\\prime}}},\\quad\\alpha_{m}=\\frac{\\gamma_{m}}{(\\epsilon+\\mathrm{IS}_{I_{m}})^{b}}\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "where $\\gamma_{m}$ is called the linear weight, usually chosen heuristically, $b$ is a positive integer usually set to 2 or 4, and $\\epsilon>0$ is a small positive number preventing the denominator from being zero. The final estimate for the derivative f (k)(x) is computed by averaging the estimates p(I1k )(x), · · · , p(IkN)s ( with the weights $\\omega_{1},\\cdots,\\omega_{N_{s}}$ : ", "page_idx": 16}, {"type": "equation", "text": "$$\n\\hat{f}^{(k)}(x)=\\sum_{m=1}^{N_{s}}\\omega_{m}\\cdot p_{I_{m}}^{(k)}(x).\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "WENO scheme for multivariate function. The WENO scheme extends smoothly to multidimensional function $f:\\mathbb{R}^{n}\\rightarrow\\mathbb{R}$ . For $\\pmb{k}=(k_{1},\\cdot\\cdot\\cdot\\,,k_{n})\\in\\mathbb{Z}_{\\geq0}^{n}$ , we denote $\\begin{array}{r}{f^{(k)}(x)=\\frac{\\partial^{k}f}{\\partial x_{1}^{k_{1}}\\cdots\\partial x_{n}^{k_{n}}}(x)}\\end{array}$ On a stencil $I$ with an appropriate number of grid points, we compute the reconstruction polynomial $p_{I}({\\pmb x})$ with a nonzero $^k$ -degree term, and the smoothness indicator is defined similarly as: ", "page_idx": 16}, {"type": "equation", "text": "$$\n\\mathrm{IS}_{I}=\\sum_{1\\leq|{\\pmb\\alpha}|\\leq k}\\int_{\\Delta}|\\Delta|^{|{\\pmb\\alpha}|-1}(p_{I_{m}}^{({\\pmb\\alpha})}({\\pmb x}))^{2}d{\\pmb x}\n$$", "text_format": "latex", "page_idx": 16}, {"type": "image", "img_path": "wl44W8xpc7/tmp/019f5e85d7c984f838579f44d6b09d73d7f1d50c4a27d7220b6fbc69319a1935.jpg", "img_caption": ["Figure 10: Inner product comparison of the learned symmetry generators with the ground truth symmetries. (a), (b), and (c) are conducted with different random initializations. "], "img_footnote": [], "page_idx": 17}, {"type": "text", "text": "where $\\pmb{\\alpha}=(\\alpha_{1},\\cdot\\cdot\\cdot\\mathrm{~,~}\\alpha_{n})\\in\\mathbb{Z}_{\\ge0}^{n}$ , $\\textstyle|\\alpha|=\\sum_{i=1}^{n}\\alpha_{i}$ and the interval $\\Delta$ is now a $n$ -dimensional cell containing the point $\\textbf{\\em x}$ with volume $|\\Delta|$ . Like the 1D case, the weights are defined using the linear weights and smoothness indicator. ", "page_idx": 17}, {"type": "text", "text": "Choice of parameters. We follow the choice of parameters of Dumbser & Käser [12]. The linear weight $\\gamma_{m}$ is chosen to be 100 if $\\textbf{\\em x}$ is inside the center cell of $I_{m}$ and 1 otherwise, reflecting the fact that the estimates are accurate as much as the point $\\textbf{\\em x}$ is close to the center of $I_{m}$ . The parameters $b$ and $\\epsilon$ are chosen as $b=4$ and $\\epsilon=10^{-6}$ . ", "page_idx": 17}, {"type": "text", "text": "D.2 Whittaker-Shannon Interpolation on a Periodic Domain ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Let $\\cdots,f[-1],f[0],f[1],\\cdot\\cdot\\cdot$ be a discretization of a continuous signal on a real line. The WhittakerShannon interpolation recovers the original signal $f$ as: ", "page_idx": 17}, {"type": "equation", "text": "$$\nf(t)=\\sum_{n=-\\infty}^{\\infty}f[n]\\mathrm{sinc}(t-n)\n$$", "text_format": "latex", "page_idx": 17}, {"type": "text", "text": "where sinc is the normalized sinc function $\\begin{array}{r}{\\mathrm{sinc}(t)=\\frac{\\sin(\\pi x)}{\\pi x_{\\mathrm{~.~}}}}\\end{array}$ . The Nyquist-Shannon sampling theorem states that states that $f(t)$ is the perfect reconstruction of $f$ , in a sense that if the original function does not contain any frequencies higher than a certain threshold, called the Nyquist frequency, then $f$ is perfectly reconstructs the original signal. ", "page_idx": 17}, {"type": "text", "text": "Similarly, if $f[0],f[1],\\dots,f[N-1]$ is a discretization of a continuous signal on a periodic domain $[0,N]$ for some even positive integer $N$ , the Whittaker-Shannon interpolation is given as: ", "page_idx": 18}, {"type": "equation", "text": "$$\nf(t)=\\sum_{n=-\\infty}^{\\infty}f[n\\,\\mathrm{mod}\\;N]\\mathrm{sinc}(t-n)=\\sum_{n=0}^{N-1}f[n]\\sum_{n=-\\infty}^{\\infty}\\mathrm{sinc}(t-m N)=\\sum_{n=0}^{N-1}f[n]D_{N}(t)\n$$", "text_format": "latex", "page_idx": 18}, {"type": "text", "text": "where $\\begin{array}{r}{D_{N}(t)=\\sum_{n=-\\infty}^{\\infty}\\mathrm{sinc}(t-m N)}\\end{array}$ is the Dirichlet kernel with period $N$ . The Dirichlet kernel $D_{N}(t)$ has a closed-form expression ", "page_idx": 18}, {"type": "equation", "text": "$$\nD_{N}(t)=\\frac{\\sin(\\pi t)}{N\\tan(\\pi t/N)}.\n$$", "text_format": "latex", "page_idx": 18}, {"type": "text", "text": "D.3 Nonlinear Time Transformation of the KdV Equation ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "We apply a nonlinear time transformation $t$ defined as $t=t_{0}(e^{\\frac{\\hat{t}}{t_{0}}}-1)$ , where $t_{0}$ is a constant scaling factor, to the KdV equation $u_{t}+u u_{x}+u_{x x x}$ . The derivative with respect to $t$ is transformed to ", "page_idx": 18}, {"type": "equation", "text": "$$\n\\frac{\\partial}{\\partial t}=\\frac{\\partial\\hat{t}}{\\partial t}\\frac{\\partial}{\\partial\\hat{t}}=e^{\\frac{\\hat{t}}{t_{0}}}\\frac{\\partial}{\\partial\\hat{t}}\n$$", "text_format": "latex", "page_idx": 18}, {"type": "text", "text": "hence the KdV equation with nonlinear time transformation (nKdV) becomes ", "page_idx": 18}, {"type": "equation", "text": "$$\ne^{\\frac{\\hat{t}}{t_{0}}}u_{\\hat{t}}u_{t}+u u_{x}+u_{x x x}=0.\n$$", "text_format": "latex", "page_idx": 18}, {"type": "text", "text": "The three symmetries of the KdV changes accordingly. The space translation is left untouched, and the other two infinitesimal generators are tranformed as: ", "page_idx": 18}, {"type": "equation", "text": "$$\n\\begin{array}{c}{\\displaystyle\\frac{\\partial}{\\partial t}=e^{\\frac{\\hat{t}}{t_{0}}}\\frac{\\partial}{\\partial\\hat{t}}}\\\\ {\\displaystyle t\\frac{\\partial}{\\partial x}+\\frac{\\partial}{\\partial u}=t_{0}(e^{\\frac{\\hat{t}}{t_{0}}}-1)\\frac{\\partial}{\\partial x}+\\frac{\\partial}{\\partial u}}\\end{array}\n$$", "text_format": "latex", "page_idx": 18}, {"type": "text", "text": "where we used the derivative notation $\\begin{array}{r}{(1,0,0)=\\frac{\\partial}{\\partial x}}\\end{array}$ , $\\textstyle(0,1,0)={\\frac{\\partial}{\\partial t}}$ and $\\textstyle(0,0,1)={\\frac{\\partial}{\\partial u}}$ ", "page_idx": 18}, {"type": "text", "text": "E Ablation Studies ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "E.1 Numerical differentiation. ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "When searching for symmetries of PDEs, we use the WENO scheme as a numerical differentiation method. We have found that the choice of numerical differentiator is critical, as gradients must flow through numerical differntiation during the backpropagation step. To compare different methods, we experimented with using the WENO scheme and another method: bilinear interpolation followed by discrete numerical differentiation on a regular rectangular grid.. When using bilinear interpolation followed by discrete differentiation, the loss failed to converge well, even with very small learning rate $10^{-6}$ . The learned vector fields were not orthogonal, and they only spanned the time translation and the space translation at best, as in Figure 11. These experiments were conducted using the KS equation. ", "page_idx": 18}, {"type": "text", "text": "We hypothesize that the bilinear interpolation distributes each transformed point into two adjacent grid points, but discrete differentiation is done by repeatedly subtracting values of two adjacent grid points, so the gradient may not flow well during the backpropagation. ", "page_idx": 18}, {"type": "text", "text": "E.2 Whittaker-Shannon interpolation. ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "In the PDE augmentation task, when the transformed PDEs are resampled into the regular rectangular grid, we use Whittaker-Shannon instead of more commonly used bilinear interpolation. This step is also crucial for training FNOs with transformed data, since FNOs are extremely sensitive to numerical error and hence any aliasing effects must be avoided. We compared the augmentation results using Whittaker-Shannon interpolation with those using bilinear interpolation, using the KS equation with 512 training data and report the result in Table 9. The results clearly demonstrate that bilinear interpolation adversely affects the training FNO models. ", "page_idx": 18}, {"type": "image", "img_path": "wl44W8xpc7/tmp/9463e1086aa3854a4ac666b1e6328540270e60c043fe2d8496d6c333e9b0bd56.jpg", "img_caption": ["Figure 11: Experiment using using bilinear interpolation and discrete differentiation. (a) Learning curve. (b) Learned symmetries. "], "img_footnote": [], "page_idx": 19}, {"type": "text", "text": "Table 9: Test NMSE comparison of augmentation using Whittaker-Shannon interpolation and bilinear interpolation. ", "page_idx": 19}, {"type": "table", "img_path": "wl44W8xpc7/tmp/6189cfc239772e37e9ad3f47f16de94f4aa3a964f2651de4a892ed1c1631d876.jpg", "table_caption": [], "table_footnote": [], "page_idx": 19}, {"type": "text", "text": "F Hyperparameter analysis ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "In this section, we analyze the roles of various hyperparameters in our learning scheme. We use experiment setting of the KS equation in $\\S\\ 5.2$ . We selected the KS equation for analysis as it proved to be the most challenging in learning symmetries, possibly due to its fourth-order derivative term $u_{x x x x}$ . In particular, among the three symmetries (space translation, time translation, Galilean boost) the algorithm easily learns the space and time translation in a few epochs, but learning the Galilean boost takes more epochs as in Figure 12. We evaluate the results by examining whether the three symmetries are correctly found in the first three slots. ", "page_idx": 19}, {"type": "image", "img_path": "wl44W8xpc7/tmp/abe23237017500199011895c0692e065745cfdb230e15db3b8899c3473f2fa2b.jpg", "img_caption": ["Figure 12: Learning curves of four symmetry generators. "], "img_footnote": [], "page_idx": 19}, {"type": "text", "text": "F.1 Lipschitz Threshold ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "The Lipschitz threshold $\\tau$ in Equation 13 is the only parameter that constrains the function space in which we search for the symmetries. The threshold $\\tau$ is set to $\\tau=3$ in the main experiments. We conduct additional experiments with $\\tau=1,2,4,8,16,32$ . Surprisingly, in all experiments, regardless of the value of $\\tau$ , we found the three ground truth symmetries. ", "page_idx": 19}, {"type": "text", "text": "F.2 Transformation Scale ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "The transformation scale $\\sigma$ controls how much we transform the data when searching for symmetries. The tuple $(x,t,u)$ in $\\mathcal{X}\\times\\mathcal{U}$ is scaled so that $x$ and $t$ form a uniform grid on $[0,1]^{2}$ , and $u$ is scaled so that the standard deviation of $u$ closely matches that of $x$ and $t$ , which is approximately 0.29. Hence, the default transformation scale $\\sigma=0.4$ transforms data with slightly more than its standard deviation at most. We conduct experiments with various transformation scales $\\sigma=0.1,0.2,0.4,0.6,0.8$ . The ground truth symmetries were found when $\\sigma=0.1,0.2,0.4$ . When $\\sigma=0.6$ , the Galilean boost was found but allocated in the fourth slot, meaning that the learning was unstable. When $\\sigma=0.8$ , the model only found space and time translation correctly. ", "page_idx": 19}, {"type": "image", "img_path": "wl44W8xpc7/tmp/4dfdbe942468d31e2003f4a0a9e2fc79fa8cb3dccf36769aa8854885d318afa0.jpg", "img_caption": ["Figure 13: Experiments with various values of hyperparameter $\\tau$ . "], "img_footnote": [], "page_idx": 20}, {"type": "image", "img_path": "wl44W8xpc7/tmp/792ef253c5aeda73c68a240cf0203ff9cca78ec8e4267a906dccd21088a8b236.jpg", "img_caption": ["Figure 14: Experiments with various values of hyperparameter $\\sigma$ . "], "img_footnote": [], "page_idx": 20}, {"type": "text", "text": "F.3 Weights of Three Losses ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Although the three loss terms Equation 14 are designed to have dimensionless scales, tuning the three loss terms in appropriate ranges is inevitable.We perform a grid search over the three weights $w_{\\mathrm{sym}}$ , $w_{\\mathrm{ortho}}$ , wLipschitz of the total loss in a fixed grid $[\\bar{1},3,10]^{3}$ . We report the number of correctly learned symmetries across different values of $w_{\\mathrm{sym}}$ , $w_{\\mathrm{Lips}}$ , and $w_{\\mathrm{ortho}}$ in Table 10. The number 3 is the maximum number of symmetries to be discovered. We found that the ratio between $w_{\\mathrm{sym}}$ and $w_{\\mathrm{ortho}}$ significantly affects the results. In this case, the weight $w_{\\mathrm{ortho}}$ should be larger than $w_{\\mathrm{sym}}$ to prevent the learning of redundant infinitesimal generators. ", "page_idx": 20}, {"type": "text", "text": "G Color-space Results ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Recall that in our formulation, images take the form $\\mathcal{X}\\rightarrow\\mathcal{Y}$ where $\\mathcal{X}=[-1,1]^{2}$ is the pixel space and $\\mathcal{V}\\in\\mathbb{R}^{3}$ is the RGB color space. Our formulation is not limited to searching for the symmetries on the 2D plane $\\mathcal{X}$ , but is capable of learning symmetries in the color space $\\boldsymbol{\\wp}$ . In this section, we elaborate how we modeled learning scheme for color-space symmetries and present the results. ", "page_idx": 20}, {"type": "text", "text": "Table 10: The number of correctly learned symmetries across values of $w_{\\mathrm{sym}},\\,w_{\\mathrm{Lips}}$ , and $w_{\\mathrm{ortho}}$ ", "page_idx": 21}, {"type": "equation", "text": "$$\n)\\,w_{\\mathrm{sym}}=3\n$$", "text_format": "latex", "page_idx": 21}, {"type": "equation", "text": "$$\n(\\mathrm{c})\\,w_{\\mathrm{sym}}=10\n$$", "text_format": "latex", "page_idx": 21}, {"type": "table", "img_path": "wl44W8xpc7/tmp/d5eefbacb943a52b0963d0e8dd0102bf523175bc9f50a3ce222d5651f014908b.jpg", "table_caption": ["(a) $w_{\\mathrm{sym}}=1$ "], "table_footnote": [], "page_idx": 21}, {"type": "text", "text": "Transformation of Images: $\\mathsf{V}_{1}$ ", "text_level": 1, "page_idx": 21}, {"type": "image", "img_path": "wl44W8xpc7/tmp/e0b30ce89b0b501e86254aaaa68d46fb028ac95e93901fe1ece625d5cc6deb2a.jpg", "img_caption": ["Transformation of Images: $\\mathsf{V}_{2}$ "], "img_footnote": [], "page_idx": 21}, {"type": "image", "img_path": "wl44W8xpc7/tmp/411c67eb9991e1fb87cc869f1c90fe6955d50900a0d165cda78b1dba2a4536e2.jpg", "img_caption": ["Transformation of Images: $\\mathsf{V}_{3}$ "], "img_footnote": [], "page_idx": 21}, {"type": "image", "img_path": "wl44W8xpc7/tmp/1eb213d92f5057f5c42392505ca474bce30ffc3c79061086d563c18e1fe29655.jpg", "img_caption": ["Figure 15: Learned color-space transformations. "], "img_footnote": [], "page_idx": 21}, {"type": "text", "text": "G.1 Learning Scheme ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Similar to other cases, we model one-parameter groups on $\\boldsymbol{\\wp}$ by a neural ODE, integrating over 3D vector fields $\\upnu\\rightarrow\\mathbb{R}^{3}$ parametrized by a neural network. Colors are non-uniform – for example, black, brown and gray appear much more frequently than pink or yellow in CIFAR-10 dataset. To address this, we first form a grid $\\mathcal{V}_{\\mathrm{grid}}$ on the color space $\\boldsymbol{\\wp}$ by randomly sampling 1024 colors from the CIFAR-10 dataset. Then we define the weight function $w:y\\rightarrow\\mathbb{R}$ , like the weight function in Equation 17, by the color sensitivity of the neural network $H_{\\mathrm{{fext}}}$ . For a grid point $\\pmb{y}_{i}\\in\\mathcal{V}_{\\mathrm{grid}}$ , the weight $\\omega({\\pmb y}_{i})$ is defined as: ", "page_idx": 21}, {"type": "equation", "text": "$$\n\\omega(\\pmb{y}_{i})=\\mathbb{E}_{f\\sim\\mathcal{D}}\\left[\\left\\|\\frac{\\partial H_{\\mathrm{fext}}(\\pmb{f})}{\\partial\\pmb{y}_{i}}\\right\\|\\right].\n$$", "text_format": "latex", "page_idx": 21}, {"type": "text", "text": "To estimate the magnitude of the gradient with respect to the change of $\\pmb{y}_{i}$ , we use neighboring points $\\pmb{y}_{j}\\in\\mathrm{nbhd}(\\pmb{y}_{i})\\subset\\bar{\\mathcal{Y}}_{\\mathrm{grid}}$ . For a discretized image $\\{\\pmb{x}_{i},f(\\pmb{x}_{i})\\}_{x_{i}\\in\\mathcal{X}_{\\mathrm{grid}}}$ , we use the nearest neighbor ", "page_idx": 21}, {"type": "text", "text": "algorithm to collect $f(\\pmb{x}_{i})\\in\\mathrm{Nearest}(\\pmb{y}_{i})$ close to $\\pmb{y}_{i}$ , and measure how much $H_{\\mathrm{{fext}}}$ changes when the color $f(\\pmb{x}_{i})$ shifts towards the direction ${\\pmb y}_{j}-{\\pmb y}_{i}$ : ", "page_idx": 22}, {"type": "equation", "text": "$$\n\\left\\|\\frac{\\partial H_{\\mathrm{fext}}(f)}{\\partial y_{i}}\\right\\|=\\frac{1}{|\\mathrm{nbhd}(y_{i})|}\\sum_{y_{j}\\in\\mathrm{nbhd}(y_{i})}\\left\\|(y_{j}-y_{i})\\cdot\\nabla_{\\mathrm{1_{Nearest}}(y_{i})}H_{\\mathrm{fext}}(f)\\right\\|\n$$", "text_format": "latex", "page_idx": 22}, {"type": "text", "text": "where $\\mathbb{1}_{\\mathrm{Nearest}(\\pmb{y}_{i})}$ is a vector whose $i$ -th entry is 1 if $f(\\pmb{x}_{i})\\in\\mathrm{Nearest}(\\pmb{y}_{i})$ and 0 otherwise, and $\\nabla_{\\mathbb{1}_{\\mathrm{Nearest}(\\pmb{y}_{i})}}H_{\\mathrm{fext}}\\grave{(f)}$ is computed by Jacobian-vector product. ", "page_idx": 22}, {"type": "text", "text": "Once the weight function is computed, we learn symmetries by optimizing through the validity score $S$ , defined by cosine similarity of features of the learned neural network. Since there are (batch size) $\\cdot$ (number of pixels) number of colors in a single batch of images, it’s impractical to feed all of them directly into the MLP. Instead, we use the grid $\\mathcal{V}_{\\mathrm{grid}}$ , and compute the vector field values on the grid and interpolate them using the nearest neighbor algorithm. ", "page_idx": 22}, {"type": "text", "text": "G.2 Results ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "We open three slots for color-space symmetries and train the model with $w_{\\mathrm{sym}},w_{\\mathrm{Lips}}\\;=\\;1$ and $w_{\\mathrm{ortho}}=3$ . We found the brightness control, color contrast and blue-yellow shift respectively as in Figure 15. ", "page_idx": 22}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "The checklist is designed to encourage best practices for responsible machine learning research, addressing issues of reproducibility, transparency, research ethics, and societal impact. Do not remove the checklist: The papers not including the checklist will be desk rejected. The checklist should follow the references and precede the (optional) supplemental material. The checklist does NOT count towards the page limit. ", "page_idx": 23}, {"type": "text", "text": "Please read the checklist guidelines carefully for information on how to answer these questions. For each question in the checklist: ", "page_idx": 23}, {"type": "text", "text": "• You should answer [Yes] , [No] , or [NA] .   \n• [NA] means either that the question is Not Applicable for that particular paper or the relevant information is Not Available.   \n• Please provide a short (1–2 sentence) justification right after your answer (even for NA). ", "page_idx": 23}, {"type": "text", "text": "The checklist answers are an integral part of your paper submission. They are visible to the reviewers, area chairs, senior area chairs, and ethics reviewers. You will be asked to also include it (after eventual revisions) with the final version of your paper, and its final version will be published with the paper. ", "page_idx": 23}, {"type": "text", "text": "The reviewers of your paper will be asked to use the checklist as one of the factors in their evaluation. While \"[Yes] \" is generally preferable to \"[No] \", it is perfectly acceptable to answer \"[No] \" provided a proper justification is given (e.g., \"error bars are not reported because it would be too computationally expensive\" or \"we were unable to find the license for the dataset we used\"). In general, answering \"[No] \" or \"[NA] \" is not grounds for rejection. While the questions are phrased in a binary way, we acknowledge that the true answer is often more nuanced, so please just use your best judgment and write a justification to elaborate. All supporting evidence can appear either in the main paper or the supplemental material, provided in appendix. If you answer [Yes] to a question, in the justification please point to the section(s) where related material for the question can be found. ", "page_idx": 23}, {"type": "text", "text": "IMPORTANT, please: ", "page_idx": 23}, {"type": "text", "text": "• Delete this instruction block, but keep the section heading “NeurIPS paper checklist\", • Keep the checklist subsection headings, questions/answers and guidelines below. • Do not modify the questions and only use the provided macros for your answers. ", "page_idx": 23}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Justification: We clarified our contribution in the last two sentences in the abstract and the last paragraph in the introduction. Both sections mentioned that our scope is learning continuous symmetry with minimal prior knowledge. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 23}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: We mentioned our limitations in the last two sentences in the conclusion. Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 24}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Justification: Although we did not provide any theorems or propositions, which requires proofs, all formulas are numbered and cross-referenced. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 24}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 24}, {"type": "text", "text": "Justification: We checked the reproducibility of the reported experiments and we provided the hyperparameter analysis in the paper and we shared our source code. Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 25}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Justification: We attached our source code and we used public datasets, which are freely accessed by anyone. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why. ", "page_idx": 25}, {"type": "text", "text": "• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable). • Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 26}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 26}, {"type": "text", "text": "Justification: All hyperparameters used in the experiments are provided in the appendix. Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 26}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 26}, {"type": "text", "text": "Justification: We measured the performance with 3-5 repeats. In Table 1 and Table 4, we reported the standard deviation, and in Figure 6(B), we described it using the error bar. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 26}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 26}, {"type": "text", "text": "Justification: We also mentioned such information in the appendix. Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. ", "page_idx": 26}, {"type": "text", "text": "• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 27}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 27}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 27}, {"type": "text", "text": "Justification: We checked the code of ethics and our paper does not cause any hazard because it only explores theoretical symmetries. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 27}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 27}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 27}, {"type": "text", "text": "Justification: Since we explore only theoretical symmetries present in mathematical space, our work is far from the societal impacts. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed.   \n• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 27}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 27}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 28}, {"type": "text", "text": "Justification: We do not have such risks. ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 28}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 28}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 28}, {"type": "text", "text": "Justification: We properly credited when adopting the existing codes and properly cited the original paper that produced the code and dataset. ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 28}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 28}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Justification: We shared our code with anoymization and documentation. ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 28}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 29}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 29}, {"type": "text", "text": "Justification: The paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 29}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 29}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 29}, {"type": "text", "text": "Justification: The paper does not involve any potential risks incurred by study participants Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 29}]