[{"figure_path": "wl44W8xpc7/figures/figures_1_1.jpg", "caption": "Figure 1: (a) Examples of the vector fields. V3 is a learned symmetry which is approximately a rotation, while V7 is not a symmetry, thus having a high validity score. (b) Transformed CIFAR-10 images using the learned generators. All the vector fields and transformations learned from CIFAR-10 are presented in Figure 8 of Appendix C. (c) Transformation of PDEs (KS equation) with learned symmetries: time translation (t-tsl) and Galilean boost (gal).", "description": "This figure demonstrates examples of learned symmetries using the proposed method. (a) shows vector fields, where V3 represents a learned rotational symmetry and V7 is not a symmetry. (b) displays transformed CIFAR-10 images using learned generators to illustrate the learned transformations in image data. (c) shows the transformation of PDEs (Kuramoto-Sivashinsky equation), specifically time translation and Galilean boost, highlighting the applicability of the method to different data types.", "section": "Introduction"}, {"figure_path": "wl44W8xpc7/figures/figures_2_1.jpg", "caption": "Figure 2: An example of a flow.", "description": "This figure illustrates a one-parameter group generated by a vector field V. A point x0 is transported along the vector field by time s, resulting in a new point φs(x0). The curve represents the flow, showcasing how the transformation changes over time.", "section": "2 Preliminaries: One-parameter Group"}, {"figure_path": "wl44W8xpc7/figures/figures_4_1.jpg", "caption": "Figure 3: Process of learning symmetry.", "description": "This figure illustrates the process of learning continuous symmetries using Neural ODE.  The input is a data point, f, which is then transformed via ODE integration using a learned infinitesimal generator (modeled by an MLP). The transformed data point is denoted as vs(f). A validity score, S(vs, f), measures how well the transformation preserves the desired invariance for the task at hand, and this score is used to update the infinitesimal generator via backpropagation. This process aims to learn a symmetry where the validity score remains low.", "section": "4 Learning Continuous Symmetries with One-Parameter Groups"}, {"figure_path": "wl44W8xpc7/figures/figures_8_1.jpg", "caption": "Figure 5: Inner products between the learned non-affine symmetry generators and the ground truth. The results including the affine symmetry generators are shown in Figure 10a.", "description": "This figure compares the inner products of learned non-affine symmetry generators with their ground truth counterparts for four PDEs (KdV, KS, nKdV, and cKdV).  Each subplot represents a PDE.  The heatmap shows the inner product between each learned generator (V1-V4) and the ground truth symmetries (x-tsl: space translation, t-tsl: time translation, gal: Galilean boost, u-scl: u-axis scaling). A high inner product (blue) indicates a strong alignment between the learned and ground truth symmetries, showing the success of the method in identifying symmetries from data, even non-affine ones.", "section": "5.2 PDEs"}, {"figure_path": "wl44W8xpc7/figures/figures_8_2.jpg", "caption": "Figure 6: Comparison of augmentation performances using the ground truth symmetries and the learned symmetries with various numbers of data. The symbol (Ø stands for no-augmentation.", "description": "This figure compares the performance of data augmentation using ground truth symmetries and learned symmetries for four different partial differential equations (PDEs): KdV, KS, nKdV, and cKdV.  The x-axis represents the number of data points used for training, and the y-axis represents the test normalized mean squared error (NMSE).  The results show that augmentation with learned symmetries achieves comparable performance to augmentation with ground truth symmetries, especially when training data is scarce.  The 'Ø' symbol indicates no augmentation.", "section": "5.2 PDEs"}, {"figure_path": "wl44W8xpc7/figures/figures_12_1.jpg", "caption": "Figure 7: The weight function w(x).", "description": "This figure shows the weight function w(x) used in the Orthonormality loss. The weight function is designed to address the issue of varying importance of pixels in image datasets, where the center pixels often contain the main subject of the image and are more important than the boundary pixels. The weight function assigns higher weights to pixels closer to the center and lower weights to pixels further from the center. This ensures that the model focuses more on the central parts of images, which tend to be more informative.  The figure displays a heatmap visualizing the weights, with brighter colors indicating higher weight.", "section": "A.1 Image Dataset"}, {"figure_path": "wl44W8xpc7/figures/figures_15_1.jpg", "caption": "Figure 8: (a) The learned vector fields. (b) Transformed images using the learned generators. The images with transformation scale 0 are the original images.", "description": "This figure shows the learned vector fields and their effect on the CIFAR-10 images. The left panel (a) visualizes the 10 learned vector fields, showing the direction and magnitude of the transformation at each pixel location.  The right panel (b) displays the transformations of a sample image under different transformation scales, ranging from -0.3 to 0.3.  The original, untransformed image corresponds to a transformation scale of 0.", "section": "C.1 Images"}, {"figure_path": "wl44W8xpc7/figures/figures_16_1.jpg", "caption": "Figure 1: (a) Examples of the vector fields. V3 is a learned symmetry which is approximately a rotation, while V7 is not a symmetry, thus having a high validity score. (b) Transformed CIFAR-10 images using the learned generators. All the vector fields and transformations learned from CIFAR-10 are presented in Figure 8 of Appendix C. (c) Transformation of PDEs (KS equation) with learned symmetries: time translation (t-tsl) and Galilean boost (gal).", "description": "This figure shows examples of learned vector fields, demonstrating the ability of the proposed method to identify symmetries in different domains.  Panel (a) compares two vector fields, one representing a learned symmetry (V3, approximately rotation) and one not a symmetry (V7). Panel (b) illustrates transformed CIFAR-10 images using the learned generators, showcasing the effect of the learned symmetries on the image data.  Panel (c) presents transformations of the Kuramoto-Sivashinsky (KS) equation, highlighting learned time translation and Galilean boost symmetries.", "section": "Introduction"}, {"figure_path": "wl44W8xpc7/figures/figures_17_1.jpg", "caption": "Figure 1: (a) Examples of the vector fields. V3 is a learned symmetry which is approximately a rotation, while V7 is not a symmetry, thus having a high validity score. (b) Transformed CIFAR-10 images using the learned generators. All the vector fields and transformations learned from CIFAR-10 are presented in Figure 8 of Appendix C. (c) Transformation of PDEs (KS equation) with learned symmetries: time translation (t-tsl) and Galilean boost (gal).", "description": "This figure shows examples of learned symmetries using the proposed method. (a) shows vector fields, where V3 represents a learned rotational symmetry while V7 is not a symmetry. (b) illustrates CIFAR-10 images transformed using the learned generators, highlighting the effect of the learned symmetries on the image data.  (c) demonstrates transformations of the Kuramoto-Sivashinsky (KS) partial differential equation using learned symmetries, specifically time translation and Galilean boost.  The figure visually demonstrates the method's ability to identify and apply both approximate and exact symmetries.", "section": "Introduction"}, {"figure_path": "wl44W8xpc7/figures/figures_19_1.jpg", "caption": "Figure 1: (a) Examples of the vector fields. V3 is a learned symmetry which is approximately a rotation, while V7 is not a symmetry, thus having a high validity score. (b) Transformed CIFAR-10 images using the learned generators. All the vector fields and transformations learned from CIFAR-10 are presented in Figure 8 of Appendix C. (c) Transformation of PDEs (KS equation) with learned symmetries: time translation (t-tsl) and Galilean boost (gal).", "description": "This figure shows examples of learned symmetries from the proposed method. (a) shows vector fields learned from the CIFAR-10 dataset, where V3 is an approximately rotational symmetry and V7 is not a symmetry. (b) shows example transformed CIFAR-10 images using the learned generators. (c) shows the transformation of the Kuramoto-Sivashinsky (KS) equation with learned time translation and Galilean boost symmetries.", "section": "Introduction"}, {"figure_path": "wl44W8xpc7/figures/figures_19_2.jpg", "caption": "Figure 1: (a) Examples of the vector fields. V3 is a learned symmetry which is approximately a rotation, while V7 is not a symmetry, thus having a high validity score. (b) Transformed CIFAR-10 images using the learned generators. All the vector fields and transformations learned from CIFAR-10 are presented in Figure 8 of Appendix C. (c) Transformation of PDEs (KS equation) with learned symmetries: time translation (t-tsl) and Galilean boost (gal).", "description": "This figure shows examples of learned symmetries using the proposed method.  (a) illustrates two vector fields, one representing a learned rotational symmetry (V3) and one that is not a symmetry (V7), highlighting the validity score's ability to distinguish between them. (b) displays CIFAR-10 images transformed using the learned generators, showcasing the effects of the learned symmetries. (c) demonstrates the application of the method to partial differential equations (PDEs), specifically the Kuramoto-Sivashinsky (KS) equation, illustrating learned symmetries such as time translation and Galilean boost.", "section": "1 Introduction"}, {"figure_path": "wl44W8xpc7/figures/figures_20_1.jpg", "caption": "Figure 1: (a) Examples of the vector fields. V3 is a learned symmetry which is approximately a rotation, while V7 is not a symmetry, thus having a high validity score. (b) Transformed CIFAR-10 images using the learned generators. All the vector fields and transformations learned from CIFAR-10 are presented in Figure 8 of Appendix C. (c) Transformation of PDEs (KS equation) with learned symmetries: time translation (t-tsl) and Galilean boost (gal).", "description": "This figure visualizes the learned symmetries from the proposed method. (a) shows examples of vector fields learned, where V3 represents an approximate rotation symmetry, while V7 does not, resulting in a higher validity score. (b) demonstrates transformed CIFAR-10 images using these learned generators. (c) shows the application to PDEs, specifically the KS equation, illustrating the learned time translation and Galilean boost symmetries.", "section": "1 Introduction"}, {"figure_path": "wl44W8xpc7/figures/figures_20_2.jpg", "caption": "Figure 1: (a) Examples of the vector fields. V3 is a learned symmetry which is approximately a rotation, while V7 is not a symmetry, thus having a high validity score. (b) Transformed CIFAR-10 images using the learned generators. All the vector fields and transformations learned from CIFAR-10 are presented in Figure 8 of Appendix C. (c) Transformation of PDEs (KS equation) with learned symmetries: time translation (t-tsl) and Galilean boost (gal).", "description": "This figure shows examples of learned symmetries from the proposed method. (a) shows vector fields where V3 represents a learned rotation symmetry, while V7 is not a symmetry and has a high validity score. (b) visualizes transformed CIFAR-10 images using learned generators. (c) demonstrates the transformation of PDEs (KS equation) using learned time translation and Galilean boost symmetries.", "section": "1 Introduction"}, {"figure_path": "wl44W8xpc7/figures/figures_21_1.jpg", "caption": "Figure 1: (a) Examples of the vector fields. V3 is a learned symmetry which is approximately a rotation, while V7 is not a symmetry, thus having a high validity score. (b) Transformed CIFAR-10 images using the learned generators. All the vector fields and transformations learned from CIFAR-10 are presented in Figure 8 of Appendix C. (c) Transformation of PDEs (KS equation) with learned symmetries: time translation (t-tsl) and Galilean boost (gal).", "description": "This figure shows examples of learned symmetries on image and PDE data.  Panel (a) displays vector fields learned by the model, with V3 approximating a rotation symmetry (low validity score) and V7 representing a non-symmetric transformation (high validity score). Panel (b) illustrates the CIFAR-10 images transformed using these learned generators, showcasing the effects of the learned symmetries.  Panel (c) shows the transformation of the Kuramoto-Sivashinsky (KS) equation data using learned symmetries such as time translation and Galilean boost.", "section": "Introduction"}, {"figure_path": "wl44W8xpc7/figures/figures_21_2.jpg", "caption": "Figure 1: (a) Examples of the vector fields. V3 is a learned symmetry which is approximately a rotation, while V7 is not a symmetry, thus having a high validity score. (b) Transformed CIFAR-10 images using the learned generators. All the vector fields and transformations learned from CIFAR-10 are presented in Figure 8 of Appendix C. (c) Transformation of PDEs (KS equation) with learned symmetries: time translation (t-tsl) and Galilean boost (gal).", "description": "This figure shows examples of learned symmetries on image and PDE data. (a) shows vector fields learned by the model, where V3 represents a learned rotational symmetry while V7 does not. (b) shows CIFAR-10 images transformed using the learned generators. (c) shows the transformation of PDEs (KS equation) using learned symmetries such as time translation and Galilean boost.", "section": "4 Learning Continuous Symmetries with One-Parameter Groups"}, {"figure_path": "wl44W8xpc7/figures/figures_21_3.jpg", "caption": "Figure 1: (a) Examples of the vector fields. V3 is a learned symmetry which is approximately a rotation, while V7 is not a symmetry, thus having a high validity score. (b) Transformed CIFAR-10 images using the learned generators. All the vector fields and transformations learned from CIFAR-10 are presented in Figure 8 of Appendix C. (c) Transformation of PDEs (KS equation) with learned symmetries: time translation (t-tsl) and Galilean boost (gal).", "description": "This figure shows examples of learned symmetries using the proposed method. (a) shows vector fields, where V3 represents a learned rotational symmetry and V7 is not a symmetry. (b) presents transformed CIFAR-10 images using the learned generators, illustrating the effect of the learned symmetries on image data. (c) demonstrates the application of the method to partial differential equations (PDEs), specifically the Kuramoto-Sivashinsky (KS) equation, showcasing the learned time translation and Galilean boost symmetries.", "section": "Introduction"}]