[{"figure_path": "IAQNJUJe8q/figures/figures_1_1.jpg", "caption": "Figure 1: Left: Peptide design requires generating peptides that form compact interactions with the binding site on the receptor. The intricacy of protein-peptide interactions demands efficient exploration in the vast space for sequence-structure co-design. Right: Different binding sites (a, b, c, d) adopt disparate center offsets and geometric shapes, approximating variable 3D Gaussian distributions that deviate from N(0, I). We propose to convert the geometry into a standard space approximating standard Gaussian, via an affine transformation derived from the binding site (§3.3).", "description": "The figure illustrates the challenge of peptide design.  The left panel shows that peptides must interact compactly with the receptor's binding site, necessitating efficient exploration of a vast sequence-structure space.  The right panel highlights the variability in binding site geometry across different examples (a-d).  These sites have varying shapes and locations, represented as different 3D Gaussian distributions. The paper proposes using an affine transformation derived from the binding site's geometry to standardize this variability and make it easier to learn with a generative model.", "section": "Introduction"}, {"figure_path": "IAQNJUJe8q/figures/figures_3_1.jpg", "caption": "Figure 2: Overall architecture of PepGLAD. (A) Variational AutoEncoder (§3.2): compressing the sequence and the structure {(xi, Xi)} of the peptide into the latent space {(zi, Zi)} with the encoder Eφ, and decoding the sequence and full-atom geometry from the latent states with the decoder Dξ. (B) Affine Transformation F (§3.3): projecting the geometry to approximately N(0, I) via the receptor-specific affine transformation derived from the binding site, and recovering the data geometry with the inverse of F after the diffusion generative process. (C) Latent Diffusion (§3.4): jointly generating zi and Zi in the standard latent space.", "description": "This figure illustrates the overall architecture of the PepGLAD model, showing the three main modules: a variational autoencoder that compresses peptide sequence and structure into a latent space; a receptor-specific affine transformation that projects the geometry into a standard space; and a latent diffusion model that generates the peptide in this standard latent space.  The figure shows the flow of data through the three modules, starting with the peptide and receptor in the data space, progressing through the latent space, and finally to the standard latent space where the diffusion process occurs. The different stages of the diffusion process are also visually represented.", "section": "3 Our Method: PepGLAD"}, {"figure_path": "IAQNJUJe8q/figures/figures_7_1.jpg", "caption": "Figure 3: Top: A generated candidate confined within the binding site (PDB=4cu4, ∆G=-34.21). Bottom: A generated candidate with complementary shape to the binding site (PDB=3pkn, ∆G=-33.32). Both candidates form compact interactions at the interface.", "description": "This figure showcases two example peptides generated by the PepGLAD model.  The top panel shows a peptide that fits snugly within the binding site of a receptor (PDB ID: 4cu4), demonstrating a compact interaction. The bottom panel presents a peptide whose shape complements the binding site of a different receptor (PDB ID: 3pkn), again showcasing a successful binding conformation.  Both examples highlight the model's ability to generate peptides with favorable binding affinities (indicated by negative ∆G values), and its capacity for generating diverse binding conformations.", "section": "4.2 Sequence-Structure Co-Design"}, {"figure_path": "IAQNJUJe8q/figures/figures_8_1.jpg", "caption": "Figure 4: The distribution of RMSDc on the test set of PepBench and a visualized sample.", "description": "This figure visualizes the distribution of RMSD<sub>Cα</sub> values obtained on the PepBench test set when comparing generated peptide conformations against reference structures. It also shows a specific example comparing a reference structure (PDB: 3vxw) with a peptide conformation generated by PepGLAD, highlighting the low RMSD<sub>Cα</sub>, RMSD<sub>atom</sub>, and high DockQ score achieved.  The box plot provides a visual representation of the distribution's central tendency, spread, and outliers, offering a comparison of PepGLAD's performance against other models.", "section": "4.3 Binding Conformation Generation"}, {"figure_path": "IAQNJUJe8q/figures/figures_18_1.jpg", "caption": "Figure 2: Overall architecture of PepGLAD. (A) Variational AutoEncoder (§3.2): compressing the sequence and the structure {(xi, Xi)} of the peptide into the latent space {(zi, Zi)} with the encoder Eφ, and decoding the sequence and full-atom geometry from the latent states with the decoder Dɛ. (B) Affine Transformation F (§3.3): projecting the geometry to approximately N(0, I) via the receptor-specific affine transformation derived from the binding site, and recovering the data geometry with the inverse of F after the diffusion generative process. (C) Latent Diffusion (§3.4): jointly generating zi and Zi in the standard latent space.", "description": "This figure illustrates the overall architecture of the PepGLAD model, which comprises three modules: a variational autoencoder, an affine transformation, and a latent diffusion model.  The autoencoder compresses the peptide sequence and structure into a fixed-dimensional latent space, handling the variable-size nature of amino acid residues. The affine transformation converts the 3D coordinates into a standardized space, improving generalization across different binding sites. Finally, the latent diffusion model generates the peptide sequence and structure in this standardized space, which is then converted back to the original space using the inverse transformation.", "section": "3 Our Method: PepGLAD"}, {"figure_path": "IAQNJUJe8q/figures/figures_19_1.jpg", "caption": "Figure 2: Overall architecture of PepGLAD. (A) Variational AutoEncoder (§3.2): compressing the sequence and the structure {(xi, Xi)} of the peptide into the latent space {(zi, Zi)} with the encoder E6, and decoding the sequence and full-atom geometry from the latent states with the decoder DE. (B) Affine Transformation (§3.3): projecting the geometry to approximately N(0, I) via the receptor-specific affine transformation derived from the binding site, and recovering the data geometry with the inverse of F after the diffusion generative process. (C) Latent Diffusion (§3.4): jointly generating zi and Zi in the standard latent space.", "description": "This figure illustrates the overall architecture of the PepGLAD model, which consists of three main modules: a variational autoencoder (VAE), an affine transformation, and a latent diffusion model. The VAE compresses the peptide's sequence and structure into a fixed-dimensional latent space. The affine transformation converts the 3D coordinates of the peptide into a shared standard space to improve generalization across different binding sites. Finally, the latent diffusion model generates the peptide in this standard latent space. The figure shows the flow of information through the model, from the input peptide and binding site to the generated peptide.", "section": "3 Our Method: PepGLAD"}, {"figure_path": "IAQNJUJe8q/figures/figures_20_1.jpg", "caption": "Figure 2: Overall architecture of PepGLAD. (A) Variational AutoEncoder (§3.2): compressing the sequence and the structure {(xi, Xi)} of the peptide into the latent space {(zi, Zi)} with the encoder Eφ, and decoding the sequence and full-atom geometry from the latent states with the decoder Dɛ. (B) Affine Transformation F (§3.3): projecting the geometry to approximately N(0, I) via the receptor-specific affine transformation derived from the binding site, and recovering the data geometry with the inverse of F after the diffusion generative process. (C) Latent Diffusion (§3.4): jointly generating zi and Zi in the standard latent space.", "description": "This figure illustrates the overall architecture of the PepGLAD model, which consists of three main modules: a Variational Autoencoder (VAE), an affine transformation, and a latent diffusion model. The VAE encodes the peptide sequence and structure into a fixed-dimensional latent representation, which is then transformed into a standard space using a receptor-specific affine transformation. Finally, the latent diffusion model generates new peptides in this standard latent space, which are then decoded back into the original sequence and structure space by the decoder.", "section": "3 Our Method: PepGLAD"}, {"figure_path": "IAQNJUJe8q/figures/figures_22_1.jpg", "caption": "Figure 2: Overall architecture of PepGLAD. (A) Variational AutoEncoder (§3.2): compressing the sequence and the structure {(xi, Xi)} of the peptide into the latent space {(zi, Zi)} with the encoder Eθ, and decoding the sequence and full-atom geometry from the latent states with the decoder Dθ. (B) Affine Transformation F (§3.3): projecting the geometry to approximately N(0, I) via the receptor-specific affine transformation derived from the binding site, and recovering the data geometry with the inverse of F after the diffusion generative process. (C) Latent Diffusion (§3.4): jointly generating zi and Zi in the standard latent space.", "description": "This figure illustrates the overall architecture of the PepGLAD model, which consists of three main modules: Variational Autoencoder, Affine Transformation, and Latent Diffusion.  The Variational Autoencoder compresses the peptide's sequence and 3D structure into a fixed-dimensional latent representation. The Affine Transformation converts the 3D coordinates to a shared standard space, improving generalization. Finally, the Latent Diffusion model generates new sequences and structures within this standardized latent space.", "section": "3 Our Method: PepGLAD"}, {"figure_path": "IAQNJUJe8q/figures/figures_23_1.jpg", "caption": "Figure 2: Overall architecture of PepGLAD. (A) Variational AutoEncoder (§3.2): compressing the sequence and the structure {(xi, Xi)} of the peptide into the latent space {(zi, Zi)} with the encoder E6, and decoding the sequence and full-atom geometry from the latent states with the decoder DE. (B) Affine Transformation F (§3.3): projecting the geometry to approximately N(0, I) via the receptor-specific affine transformation derived from the binding site, and recovering the data geometry with the inverse of F after the diffusion generative process. (C) Latent Diffusion (§3.4): jointly generating zi and Zi in the standard latent space.", "description": "This figure illustrates the overall architecture of the PepGLAD model, which consists of three main modules: 1. Variational Autoencoder: Encodes the peptide's sequence and structure into a fixed-dimensional latent representation. 2. Affine Transformation: Transforms the 3D coordinates of the peptide and binding site into a shared standard space, improving generalization. 3. Latent Diffusion Model: Generates the peptide's sequence and structure in the standardized latent space using a diffusion process.", "section": "3 Our Method: PepGLAD"}]