[{"type": "text", "text": "Introducing Spectral Attention for Long-Range Dependency in Time Series Forecasting ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Bong Gyun Kang1∗ Dongjun Lee1∗ HyunGi Kim2 DoHyun Chung3 ", "page_idx": 0}, {"type": "text", "text": "Sungroh Yoon1,2† ", "page_idx": 0}, {"type": "text", "text": "1 Interdisciplinary Program in Artificial Intelligence, Seoul National University   \n2 Department of Electrical and Computer Engineering, Seoul National University   \n3 Department of Future Automotive Mobility, Seoul National University ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Sequence modeling faces challenges in capturing long-range dependencies across diverse tasks. Recent linear and transformer-based forecasters have shown superior performance in time series forecasting. However, they are constrained by their inherent inability to effectively address long-range dependencies in time series data, primarily due to using fixed-size inputs for prediction. Furthermore, they typically sacrifice essential temporal correlation among consecutive training samples by shuffling them into mini-batches. To overcome these limitations, we introduce a fast and effective Spectral Attention mechanism, which preserves temporal correlations among samples and facilitates the handling of long-range information while maintaining the base model structure. Spectral Attention preserves longperiod trends through a low-pass filter and facilitates gradient to flow between samples. Spectral Attention can be seamlessly integrated into most sequence models, allowing models with fixed-sized look-back windows to capture longrange dependencies over thousands of steps. Through extensive experiments on 11 real-world time series datasets using 7 recent forecasting models, we consistently demonstrate the efficacy of our Spectral Attention mechanism, achieving state-ofthe-art results. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Time series forecasting (TSF) stands as a core task in machine learning, ubiquitous in our lives through applications such as weather forecasting, traffic flow estimation, and financial investment. Over time, TSF techniques have evolved from statistical [5, 10, 18] and machine learning approaches [2, 9, 20] to deep learning models like Recurrent Neural Networks [15, 25, 41] and Convolution based Networks [12, 45]. Following the success of Transformers [44] in various domains, Transformerbased models have also become mainstream in the time series domain [23, 27, 36, 49, 54, 55, 56]. Recently, methodologies based on Multi-layer Perceptron have received renewed attention [7, 8, 28, 52]. However, despite the advancements, long-term dependency modeling in TSF remains challenging [53]. ", "page_idx": 0}, {"type": "text", "text": "Unlike image models, where data are randomly sampled from the image distribution and are thus independent of each other [16], TSF models sample data from the continuous signal, dependent on the time variable $t$ as shown in Figure 1a. This leads to a high level of correlation between each training sample, which consists of a fixed-sized look-back window before $t$ (as input) and the subsequent prediction sequence after $t$ (as label). Therefore, the conventional approach of shuffling the consecutive samples into mini-batches deprives the model of utilizing the crucial inherent temporal correlation between the samples. This restricts the model’s consideration to only a fixed-size look-back window for sequence modeling, limiting the ability to address long-range dependencies (Figure 1b). ", "page_idx": 0}, {"type": "image", "img_path": "dxyNVEBQMp/tmp/2cd3311148d36c85c8e123e1c9b9421292522bcefb23de5c7ef77e5f70f3aba3.jpg", "img_caption": ["(a) Time Series Data ", "Figure 1: (a) Training data are sampled for each time step from continuous sequences, exhibiting high temporal correlations. (b) Conventional approaches simply ignore this temporal information with a shuffled batch. (c) We address the temporal correlation between the samples for the first time, enabling the model to consider long-range dependencies that surpass the look-back window. "], "img_footnote": [], "page_idx": 1}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "Recent studies pointed out that simply increasing the look-back window leads to substantially detrimental effects such as increased model size and longer training and inference times [53]. This is particularly challenging for transformer forecasters, which exhibit quadratic time/memory complexity [36, 44, 54], and even for efficient models using techniques like Sparse Attention, which have O(nlogn) complexity [23, 27, 55]. Furthermore, if the commonly used look-back window of 96 is extended fivefold, the model can only utilize time steps of less than 500, making it difficult to consider long-range dependencies spanning thousands or the entire dataset. Also, increasing the look-back window may not be beneficial, often leading to decreased performance [53], highlighting the fact that current models are not sufficient in capturing long-range dependencies. ", "page_idx": 1}, {"type": "text", "text": "To address this limitation, we propose Spectral Attention, which can be applied to most TSF models and enables the model to utilize long-range temporal correlations in sequentially obtained training data. With the stream of consecutive training samples (Figure 1c), Spectral Attention stores an exponential moving average (EMA) of the activations with various smoothing factors at each time step. This serves as a low-pass filter, inherently embedding long-range information over a thousand steps. Attention is then applied to the stored EMA activations of various smoothing factors (low-pass filters with different frequencies), enabling the model to learn which periodic trends to consider when predicting the future, thereby enhancing its performance. Spectral Attention is even applicable to models such as iTransformer [31], which do not preserve the temporal order of time series data internally. ", "page_idx": 1}, {"type": "text", "text": "We further extend Spectral Attention, where computations depend on the activation of the previous timesteps, to Batched Spectral Attention, enabling parallel training across multiple timesteps. This extension makes Spectral Attention faster and more practical and allows for the direct utilization of temporal relationships among consecutive data samples within a mini-batch in the training base model. In Batched Spectral Attention, the EMA is unfolded over time to perform Spectral Attention simultaneously across multiple time steps. This unfolding allows gradients at time $t$ to propagate through the Spectral Attention module to the previous time step within the mini-batch, achieving effects similar to Backpropagation Through Time (BPTT) [47] and extends the model’s effective input window. ", "page_idx": 1}, {"type": "text", "text": "Our approach preserves the base TSF model architecture and learning objective while enabling the model to leverage long-term trends spanning thousands of steps. By effectively utilizing the temporal correlation of training samples, our method allows gradients to flow back in time beyond the lookback window, extending to the entire mini-batch. Also, our method requires little additional training time and memory. We conducted experiments on 7 recent TSF models and 11 real-world datasets and demonstrated consistent performance enhancement in all architecture, achieving state-of-the-art results. We summarize the main contributions as follows: ", "page_idx": 1}, {"type": "text", "text": "• We propose Spectral Attention, which addresses long-range dependencies spanning thousands of steps through frequency flitering and attention mechanisms, leveraging the temporal correlation among the consecutive samples.   \n• We propose Batched Spectral Attention, which enables parallel training across multiple timesteps and expends the effective input window, allowing the gradient to flow through time within the mini-batch.   \n• Batched Spectral Attention is applicable to most existing TSF models and practical in real-world scenarios with minimal additional memory and comparable training time. Also, it allows finetuning with a trained TSF model.   \n• Batched Spectral Attention demonstrates consistent model-agnostic performance improvements, particularly showcasing superior performance on datasets with significant long-term trend variations. ", "page_idx": 2}, {"type": "text", "text": "2 Related Works ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Classic TSF models. Statistical TSF methods, such as ARIMA [35], Holt-Winters [18], and Gaussian Process [10], assume that temporal variations adhere to predefined patterns. However, their practical applicability is largely limited by the complex nature of real-world data. Machine learning approaches, such as Support Vector Machines [4] and Random Forests [14] have proven to be effective even compared to early artificial neural networks [13, 17, 40]. Convolutional network-based methods leverage convolution kernels to capture temporal variations sliding along the temporal dimension [12, 45]. Recurrent neural network (RNN) grasp changes over time via state transitions across different time steps. [25, 41]. However, RNN-based models exhibit limitations in modeling long-range dependencies due to challenges such as vanishing gradients and error accumulation [30, 43]. Recently, transformer and linear-based models have emerged as alternatives, demonstrating superior performance compared to recurrent models [46, 53]. ", "page_idx": 2}, {"type": "text", "text": "Transformer and Linear based models. Transformer-based models [44] address temporal relationships between time points using the attention. LogSparseTransformer [27], Reformer [23], and Informer [55] have been proposed to make the Transformer architecture efficient, addressing the quadratic time complexity. The Autoformer [49] incorporates series decomposition as an inner block of Transformer and aggregates similar sub-series by utilizing the Auto-Correlation mechanism. PatchTST [36] introduces patching, a channel-independent approach that processes each variable separately and focuses on cross-time attention. Crossformer [54] utilizes a channel-dependent approach to learn cross-variate dependencies. This is achieved through the use of cross-time and cross-dimension attention. iTransformer [31] applies attention and FFN in an inverted way, where attention handles correlations between channels and FFN handles the temporal information. Recently, to address Transformers’ potential difficulties in capturing long-range dependencies [53], methodologies based on the linear model and Multi-Layer Perceptron (MLP) structures have emerged. DLinear [53] utilizes the decomposition method introduced in Autoformer and predicts by adding the output of two linear layers for each seasonal and trend element. TiDE [7] proposes an architecture based on MLP residual blocks that combines information from dynamic and static covariates with a look-back window for encoding, followed by decoding. TSMixer [8] performs forecasting by repeatedly mixing time and features using an MLP. RLinear [28] comprises of a single linear layer with RevIN [21] for normalization and de-normalization. ", "page_idx": 2}, {"type": "text", "text": "Frequency-utilizing models. Using the frequency domain for TSF is a well-established approach [3, 42, 19]. Conventional approaches leverage frequency information during the preprocessing stage [37] or decompose time series based on frequency filtering [39]. In deep TSF models, research has also explored architectural advancements that are aware of the frequency information. SAAM [34], which is applicable to RNNs, performs FFT and autocorrelation on the input signal. WaveFroM [51] uses discrete wavelet transform (DWT) to project time series into wavelet domains of various scales and performs forecasting through graph convolution and dilated convolution. FEDformer [56] adopts a mixture-of-experts strategy to refine the decomposition of seasonal and trend components and introduce sparse attention mechanisms in the frequency domain. TimesNet [48] transforms 1D time series into 2D tensors utilizing multi-periodicity by identifying dominant frequencies through Fourier Transform, modeling temporal variations effectively. FreTS [52] leverages frequency-domain MLPs to achieve global signal analysis and compact energy representation, addressing the limitations of point-wise mappings and information bottlenecks in conventional MLP-based methods. FITS [50] employs interpolation within the complex frequency domain to construct a concise and robust model. While these models leverage frequency information, they are limited in modeling long-range dependencies, as the frequency conversion is confined to the look-back window. On the other hand, our Spectral Attention is the first to achieve long-range dependency modeling beyond the look-back window by incorporating consecutive data streams during model training. ", "page_idx": 2}, {"type": "image", "img_path": "dxyNVEBQMp/tmp/c2b014ce21a47e035b3ca1ba0c8740ea39f2d038e3d2a43904b1ef093fa39c40.jpg", "img_caption": ["Figure 2: (a) Plug-in Spectral Attention (SA) module takes a subset of intermediate feature $F$ and returns $F^{\\prime}$ with long-range information beyond the look-back window. The model is trained end-toend, and gradients flow through the SA module. (b) To capture the long-range dependency, SA stores momentums of feature $F$ generated from the sequential inputs. Multiple momentum parameters $\\alpha_{i}$ capture dependencies across various ranges. (c) SA module computes $F^{\\prime}$ by attending multiple low-frequency $(M^{\\alpha_{i}})$ and high-frequency $(F-M^{\\alpha_{i}})$ components and feature $(F)$ using learnable Spectral Attention Matrix (SA-Matrix) "], "img_footnote": [], "page_idx": 3}, {"type": "text", "text": "", "page_idx": 3}, {"type": "text", "text": "3 Methods ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Problem Statement. In multivariate time series forecasting, time series data is given $\\mathbb{D}_{T}:$ $\\{x_{1},...,x_{T}\\}\\;\\in\\;\\mathbb{R}^{T\\times N}$ at time $T$ with $N$ variates. Our goal is, at arbitrary future time $t\\,>\\,T$ , to predict future $S$ time steps $Y_{t}=\\{x_{t+1},...,x_{t+S}\\}\\in\\mathbb{R}^{\\tilde{S}\\times N}$ . To achieve this goal, TSF model $f$ utilizes length $L$ look-back window as input $X_{t}\\stackrel{\\cdot\\,-\\,}{=}\\{x_{t-L+1},...,x_{t}\\}\\in\\mathbb{R}^{L\\times N}$ making prediction $P_{t}=f(X_{t})$ , $P\\in\\mathbb{R}^{S\\times N}$ . ", "page_idx": 3}, {"type": "text", "text": "Model is trained with the training dataset $D_{T}=\\{(X_{t},Y_{t})|L\\leq t\\leq T-S\\}$ . While conventional methods typically randomly sample each $X,Y$ from $D_{T}$ to constitute the mini-batch, we utilize sequential sampling to incorporate temporal correlations between samples into the learning process. ", "page_idx": 3}, {"type": "text", "text": "3.1 Spectral Attention ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Spectral Attention $(S A)$ can be applied to every TSF model that satisfies the aforementioned problem statement. This base TSF model is represented by $P=f(X)$ , and $S A$ can be applied to arbitrary activation $F$ within the model. The base model can be reformulated as $P=f_{2}(F,E)$ and $F,E=$ $f_{1}(X).\\;F,E$ are intermediate state and SA module takes an arbitrary subset $F$ as input and transforms it into $F^{\\prime}$ of the same size; $F^{\\prime}=S A(F)$ , $P^{\\prime}=f_{2}(F^{\\prime},E)$ . The resulting SA plugged model $f_{S A}$ is depicted in Figure 2a. ", "page_idx": 3}, {"type": "text", "text": "With $X_{t}$ as the base model input, $S A$ takes $D$ -dimensional feature vector $F_{t}\\,\\in\\mathbb{R}^{D}$ as input. $S A$ updates the exponential moving average (EMA) $M_{t}\\in\\mathbb{R}^{K\\times D}$ of $F_{t}$ in its internal memory with the $K$ smoothing factors $\\{\\alpha_{1},...,\\bar{\\alpha_{K}}\\}\\in\\bar{\\mathbb{R}}^{K}$ $\\langle\\alpha_{1}<\\cdot\\cdot<\\alpha_{K}\\rangle$ ) as shown in Figure 2b. ", "page_idx": 3}, {"type": "equation", "text": "$$\nM_{t+1}^{k,i}=\\alpha_{k}\\times M_{t}^{k,i}+(1-\\alpha_{k})\\times F_{t}^{i}\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "EMA retains the trend of features over long-range time periods based on the smoothing factor. It operates as a low-pass fliter, with the -3db (half) cut-off frequency of $\\begin{array}{r}{f r e q_{c u t}=\\frac{1}{2\\pi}c o s^{-\\overset{\\cdot}{1}}\\left[1-\\frac{(1-\\alpha)^{2}}{2\\alpha}\\right]}\\end{array}$ effectively preserving the trend over 6,000 period with $\\alpha=0.999$ . ", "page_idx": 3}, {"type": "text", "text": "To represent high-frequency patterns contrasting with the low-pass flitered long-range pattern $M_{t}$ , we generated $\\boldsymbol{H_{t}}\\in\\mathbb{R}^{K\\times\\dot{\\boldsymbol{D}}}$ by subtracting $M_{t}$ from $F_{t}$ . ", "page_idx": 3}, {"type": "equation", "text": "$$\nH_{t}^{k,i}=F_{t}^{i}-M_{t}^{K-k-1,i}\n$$", "text_format": "latex", "page_idx": 3}, {"type": "image", "img_path": "dxyNVEBQMp/tmp/60f7b5913ded134eb82b2fcb6128c531022d26c7f85215e30a7e5aeac2dfd6ca.jpg", "img_caption": ["Figure 3: BSA module takes a sequentially-sampled mini batch $\\{X_{t},...X_{t+B-1}\\}$ and computes the corresponding EMA momentums $\\{M_{t},...M_{t+B-1}\\}$ over time. This is done via single matrix multiplication enabling parallelization. We made the momentum parameter $\\alpha_{i}$ learnable, allowing the model to directly learn the periodicity of the information essential for the future prediction. "], "img_footnote": [], "page_idx": 4}, {"type": "text", "text": "$S A$ contains learnable parameters: sa-matrix $\\in\\mathbb{R}^{(2K+1)\\times D}$ , which learns what frequency the model should attend to for each feature. $2\\times H_{t},F_{t},2\\times M_{t}$ are concatenated on dimension 0, resulting in $\\mathbb{R}^{(2K+1)\\times D}$ , which is then weighted summed with sa-matrix on dimension 0, generating output $F_{t}^{\\prime}$ (Figure 2c). ", "page_idx": 4}, {"type": "equation", "text": "$$\nF_{t}^{\\prime}=s u m(s o f t m a x(s a-m a t r i x,d i m\\;0)\\cdot c o n c a t((2\\times H_{t},F_{t},2\\times M_{t}),d i m\\;0),d i m\\;0)\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "The sa-matrix is initialized so that softmax(sa-matrix) resembles a Gaussian distribution on axis 0. This results in symmetric value on axis 0 (sa-matri $\\displaystyle{x^{K+1-i}=s a{-}m a t r i x^{K+1+i}}$ ) and makes $S A$ an identity function on initialization $(\\because H^{k}+M^{K-k-1}=F)$ . ", "page_idx": 4}, {"type": "equation", "text": "$$\nF=S A_{i n i t}(F)\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "$S A$ allows the model to attend to multiple frequencies of its feature signal, enabling it to focus on either long-range dependencies or high-frequency patterns as needed and shift the feature $F$ distribution on the frequency domain. By initializing $S A$ as an identity function, the model can be fine-tuned with the already trained base model, allowing efficient implementation. ", "page_idx": 4}, {"type": "text", "text": "3.2 Batched Spectral Attention ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "Batched Spectral Attention $\\left(B S A\\right)$ enables batch training over multiple time steps. The main concept involves unfolding EMA, which facilitates gradients to flow across consecutive samples in a minibatch, akin to BPTT. This enables efficient parallel training and promotes the model to extract long-range information beneficial for future prediction, extending the effective look-back window. The overall flow of $B S A$ is depicted in Figure 3. ", "page_idx": 4}, {"type": "text", "text": "With mini-batch of size $B$ , consecutive samples $X_{[t,t+B-1]}\\,=\\,\\{X_{t},...X_{t+B-1}\\}\\,\\in\\,\\mathbb{R}^{B\\times S\\times N}$ are given as input. Following aforementioned $S A$ setting, $B S A$ takes $F_{[t,t+B-1]}=\\{F_{t},...F_{t+B-1}\\}\\in$ $\\mathbb{R}^{B\\times D}$ as input. In the next step, $B S A$ utilizes $F_{[t,t+B-1]}$ and the stored $M_{t}\\in\\mathbb{R}^{K\\times D}$ to generate $M_{t+b}(0\\leq b\\leq B)$ by unfolding the Equation 1. ", "page_idx": 4}, {"type": "equation", "text": "$$\nM_{t+b}^{k,i}=\\alpha_{k}^{b}\\times M_{t}^{k,i}+(1-\\alpha_{k})\\alpha_{k}^{b-1}\\times F_{t}^{i}+\\cdot\\cdot\\cdot+(1-\\alpha_{k})\\times F_{t+b-1}^{i}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "This equation can be transformed to calculate $M_{[t,t+B]}\\in\\mathbb{R}^{(B+1)\\times K\\times D}$ in parallel as follows. ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{M_{[t,t+B]}^{:,k,i}=l o w e r\\!-\\!t r i a n g l e(A^{k})\\times c o n c a t((M_{t}^{k,i},F_{[t,t+B-1]}^{:,i}),d i m\\,0)}\\\\ &{\\qquad\\qquad A\\in\\mathbb{R}^{K\\times(B+1)\\times(B+1)},\\ A^{k,p,q}=(1-\\alpha_{k})^{I\\{q>0\\}}\\alpha_{k}^{p-q}}\\end{array}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "$A$ refers to unfolding matrix and $I$ refers to indicator function. $M_{t+B}$ is stored in $B S A$ for the next mini-batch input. F [′t, $F_{[t,t+B-1]}^{\\prime}$ is computed in parallel, similar to Equation 2 and 3, using $F_{[t,t+B-1]}$ , $B_{[t,t+B-1]}$ , and sa-matrix∈ $\\ '\\mathbb{R}^{(2K+1)\\times D}$ . The lower-triangle function prevents gradients from the past timestep from flowing into future models, aligning with the characteristics of time-series data. ", "page_idx": 4}, {"type": "text", "text": "At the beginning of each training epoch, $M_{0}$ is initialized to $F_{0}$ for all $\\alpha$ , enhancing stability for subsequent EMA accumulation. Since $S A$ is proposed to address long-range dependencies in training, it lacks sufficient information in the early stages when not enough steps have been seen. Therefore, for the stability of training, we linearly warm up the learning rate for the first $1/(1-m a x(s m o o t h i n g\\,f\\!a c t o r s))$ timesteps at the beginning of each training epoch. The overall training of both the base model and $B S A$ is conducted according to Algorithm 1. ", "page_idx": 5}, {"type": "text", "text": "In SA, the smoothing factors $\\{\\alpha_{1},...,\\alpha_{K}\\}$ $\\in\\mathbb{R}^{K}$ were given as scalar values, whereas in $B S A$ , they are expressed by learnable parameters. This is because $B S A$ can utilize additional past information in training beyond the look-back window by incorporating a batch-sized time window, allowing it to determine the extent of long-range dependency required for training. To keep the smoothing factors between 0 and 1, we initialized learnable parameters by applying an inverse sigmoid to the initial smoothing factors and then applied a sigmoid function in training. ", "page_idx": 5}, {"type": "text", "text": "So far, we assume the feature $F$ from the base model as a vector. However, the output of the intermediate layers of the model is often represented as a tensor with two or more dimensions. In real practice, we use additional channel dimensions in $B S A$ to process the activation tensor, which acts as applying multiple $B S A$ modules simultaneously. ", "page_idx": 5}, {"type": "text", "text": "Algorithm 1 Batched Spectral Attention (1 epoch) Input: Trained up to (E-1)th epoch TSF model $f_{\\theta}$ , $B S A$ with sa-matrix, smoothing factors Train data: $\\mathfrak{D}_{t r}=\\{(X_{0},Y_{0}),...,(X_{t r},Y_{t r})\\}$ Valid data: $\\mathfrak{D}_{v a l}=\\left\\{(X_{t r+1},Y_{t r+1}),...,(X_{v a l},Y_{v a l})\\right\\}$ mini-batch size: B Train: $s t=0,e d=B-1$ initialize $M_{0}$ in $B S A$ with $X_{0}$ and $f_{\\theta}\\left(:=f_{2\\theta}\\cdot f_{1\\theta}\\right)$ for $X_{[s t,e d]}$ , $Y_{[s t,e d]}$ in $\\mathfrak{D}_{t r}$ do {: train phase} $P_{[s t,e d]}\\gets\\dot{f}_{2\\theta}\\cdot\\dot{B}S A\\cdot f_{1\\theta}(X_{[s t,e d]})$ $\\dot{\\mathcal{L}}=\\dot{\\mathcal{L}}_{\\mathrm{mse}}(P_{[s t,e d]},Y_{[s t,e d]})$ Compute $\\nabla\\mathcal{L}$ and adjust learning rate update $f_{\\theta}$ , sa-matrix, smoothing factors $s t+=B$ , $e d=m i n(e d+B,t r)$ end for $s t=t r+1,e d=t r+B$ for $X_{[s t,e d]},Y_{[s t,e d]}$ in $\\mathfrak{D}_{v a l}$ do {: Validation phase} $\\begin{array}{r l}&{P_{[s t,e d]}\\leftarrow f_{2\\theta}\\cdot B S A\\cdot f_{1\\theta}(X_{[s t,e d]})}\\\\ &{\\mathcal{L}=\\mathcal{L}_{\\mathrm{mse}}(P_{[s t,e d]},Y_{[s t,e d]})}\\end{array}$ accumulate $\\mathcal{L}$ and calculate validation loss $\\mathcal{L}_{v a l}$ $s t+=B,e d=m i n(e d+B,v a l)$ end for Output: Trained up to $E$ th epoch $f_{\\theta}$ , sa-matrix, $\\{\\alpha_{1},...,\\alpha_{K}\\}$ , $\\mathcal{L}_{v a l}$ for $E$ th epoch ", "page_idx": 5}, {"type": "text", "text": "3.3 Consecutive dataset split ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "In the TSF scenario, the entire time series data $\\{x_{1},...,x_{T_{e n d}}\\}$ is divided into train, validation, and test sets in chronological order. Let $T_{t r}$ and $T_{v a l}$ denote the last time in the train and validation data respectively. Model training occurs using data for t in [1, $T_{t r}]$ , while model selection for the best model can utilize data for t in $[T_{t r+1},\\,T_{v a l}]$ . The test set comprises predicting time steps $[T_{v a l+1},T_{e n d}]$ , which are not accessible during training or validation. However, since each training sample consists of the look-back window of size $\\mathrm{L}$ and a prediction window of size S, the training input samples are restricted to $X_{[L,T_{t r}-S]}$ . Validation samples and test input samples range from $X_{[T_{t r},T_{v a l}-S]}$ , and from $X_{[T_{v a l},T_{e n d}-S]}$ , respectively. While this approach is plausible for independent data like images, it is unnatural for sequential data, as it leaves unreachable gaps $(X_{[T_{t r}-S+1,T_{t r}-1]}$ , $X_{[T_{v a l}-S+1,T_{v a l}-1]})$ , undermining the consecutive characteristics. We filled the missing gaps, making train, validation, and test sets consecutive so that our $B S A$ model could update momentum continuously. For fair evaluation, added samples were not used for either model training, validation, or performance assessment. Detailed explanations of model validation and evaluation are provided in Appendix A.3. The full code is available at https://github.com/DJLee1208/BSA_2024. ", "page_idx": 5}, {"type": "text", "text": "4 Experiments ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "We first evaluate BSA using state-of-the-art TSF models and various real-world time series forecasting scenarios in section 4.1. Next, to demonstrate that BSA effectively addresses long-range dependencies and is robust to distribution shift, we perform experiments on synthetic signals of various frequencies in section 4.2. Finally, we analyze the BSA’s performance variations depending on the insertion sites within the base model, examine computation and memory costs, and conduct an ablation study in section 4.3. ", "page_idx": 5}, {"type": "text", "text": "Datasets. We use eleven real-world public datasets: Weather, Traffic, ECL, ETT (4 sub-datasets; h1, h2, m1, m2), Exchange, PEMS03, EnergyData, and Illness [6, 26, 29, 49]. In the Illness dataset, ", "page_idx": 5}, {"type": "text", "text": "Table 1: Forecasting results averaged across prediction lengths $S\\in\\{96,192,336,720\\}$ and three seeds. Illness and Exchange datasets use different prediction lengths due to short data lengths. Higher performance between the base model and BSA is bolded. The Avg. column shows the mean across all datasets. Red indicates p-value $<0.05$ in paired t-test. Abbreviations are as follows, We.; Weather, Tr.: Traffic, Eh1: ETTh1, Eh2: ETTh2, Em1: ETTm1, Em2: ETTm2, Ex.:Exchange, PE.: PEMS03, En.: EnergyData, Il.: Illness. Full results are provided in Appendix B.1. ", "page_idx": 6}, {"type": "table", "img_path": "dxyNVEBQMp/tmp/2ae10ab6c3be7ee8a3cf62d640a17a80c23aa1ee108d7130e0500e4d752581db.jpg", "table_caption": [], "table_footnote": [], "page_idx": 6}, {"type": "text", "text": "the look-back window is set to 36, and the forecasting lengths are 24, 36, 48, and 60. For the other datasets, the look-back window is set to 96, and the forecasting lengths are 96, 192, 336, and 720. Train, validation, and test split ratio are 0.6, 0.2, 0.2 for the ETT dataset and 0.7, 0.1, 0.2 for the Weather, Traffic, ECL, Exchange, PEMS03, EnergyData, and Illness datasets. The Weather, Traffic, and ECL datasets settings follow the TimesNet paper [48]. Details on datasets are provided in Appendix A.1. ", "page_idx": 6}, {"type": "text", "text": "Baseline models. As a benchmark, we apply BSA to 7 recent or well-known forecasting models. (1) Linear based models: DLinear [53], RLinear [28], FreTS [52] (2) Convolution based methods: TimesNet [48] (3) Transformer based methods: iTransformer [31], Crossformer [54], PatchTST [36]. For each dataset, the model structure configuration is based on the Time-Series-Library [48]. Details on the base model configurations are provided in Appendix A.2. ", "page_idx": 6}, {"type": "text", "text": "Training details. We first train the base model for more than 30 epochs (20 epochs for the Traffic dataset) using Adam [22] to ensure that the validation MSE saturates, while also conducting an extensive hyperparameter search. Then, we fine-tune with the BSA module attached to the pre-trained base model. All experiments are based on the average values of three random seeds. We provide further details in Appendix A.3. ", "page_idx": 6}, {"type": "text", "text": "4.1 Real world datasets ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "We demonstrate that BSA improves forecasting performance by providing the ability to address long-range dependencies, regardless of the base model architecture. Table 1 presents the averaged values over prediction lengths for both the base and the BSA applied model across 11 time series datasets and 7 TSF models. We apply the BSA module at the beginning of the base model’s activation, with the number of BSA channels matching the number of channels in the data (position 1 in Figure ", "page_idx": 6}, {"type": "image", "img_path": "dxyNVEBQMp/tmp/6050c7114214cb7b7c5a30e79be1693618a3ed2a6629539a940c1f5e16481fde.jpg", "img_caption": ["Figure 4: This figure illustrates the analysis of the SA-matrix of the DLinear model trained on the 720-step prediction task for the Weather and ETTh1 datasets. Panel (a) shows the heatmap of the SA-matrix, and (b)-(d) show the attention and FFT graphs. "], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "7). BSA effectively improves MSE and MAE across all architectures. The average performance gain, in terms of MSE, ranged from as low as $0.96\\%$ to as high as $7.2\\%$ , with linear-based models demonstrating relatively high performance. Paired t-tests demonstrate statistically significant (p-value $<0.05)$ improvements in most MSE and all MAE across various models. This result emphasizes the model-agnostic versatility of BSA. Furthermore, BSA exhibited overall performance gain across all datasets, with the enhancement being statistically significant in $82\\%$ of cases. BSA’s higher gain on ETTm compared to ETTh, both derived from the same signal but with different sampling rates, further indicates BSA’s effectiveness in handling long-range dependencies. ", "page_idx": 7}, {"type": "text", "text": "To understand how BSA addresses long-range dependencies, we conduct an internal inspection. In Figure 4a, we present the heat map of the trained SA-Matrix of the DLinear (Temperature $(^{\\circ}\\mathbf{C})$ channel, Weather data). The positive ${\\bf X}$ -axis corresponds to the $l o g_{10}$ values of the periods preserved by the low-pass filter, derived with the smoothing factor. Negative values correspond to high-frequency components. The blue graph in Figure 4b represents the SA-Matrix averaged over the feature dimension, illustrating the frequencies to which BSA attends overall. The red graph represents the result of applying the Fast Fourier Transform (FFT) and denoising to the raw signal. The blue graph skewed towards the low-frequency side indicates that the BSA effectively captures the long-range trend of the data. Figure $4c$ depicts the graph for the SWDR (Short Wave Downward Radiation per unit area, $\\mathrm{W}/\\mathrm{m})$ ) channel in the same SA-Matrix. While not identical to Figure 4b, it also exhibits strong attention towards the low-frequency pattern. In contrast, Figure 4d, the FFT graph for the HULL (High UseLess Load channel, ETTh1 data), shows that the signal itself lacks long-range trends, resulting in the symmetric SA-Matrix. This result demonstrates that BSA operates as intended, learning the low-frequency components of the signal for future prediction. We provided other graphs and detailed information on the graph plotting method in Appendix B.2. ", "page_idx": 7}, {"type": "text", "text": "4.2 Synthetic datasets ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "To further demonstrate that BSA learns long-range dependencies beyond the look-back window, we add sine waves with periods of 100, 300, and 1000 to the natural data while maintaining the mean and standard deviation (Refer to Appendix C for details on synthetic data generation). Figure 5 illustrates the performance improvement of BSA over the iTransformer model on the ETTh1 and ", "page_idx": 7}, {"type": "image", "img_path": "dxyNVEBQMp/tmp/69a5c1bf4bce29269376baaec22ae73ad8aa92009b540140f8c1ef74323f195e.jpg", "img_caption": ["Figure 5: Results of the iTransformer model on synthetic (a) ETTh1 and (b) ETTh2 datasets. The ${\\bf X}$ -axis is the prediction length (96, 192, 336, 720), and the y-axis is the performance improvement $(\\%)$ compared to the base model. Each color represents the different periods of the sine wave added to the natural data. 0 indicates original data and serves as the baseline. "], "img_footnote": [], "page_idx": 7}, {"type": "image", "img_path": "dxyNVEBQMp/tmp/de70cd8de0902300f6c9ecf87475702eee87a6e448431c8c5611553d2bff8b64.jpg", "img_caption": ["Figure 6: Attention and FFT graphs on LUFL channel of the original and synthetic ETTh1 data (iTransformer, 720-step prediction). (a) is from the original data and (b)-(d) are from the synthetic data created by adding sine waves with periods of 100, 300, and 1000, respectively. The red arrows on the FFT graphs show the added synthetic signals. Full visualization is provided in Appendix C.1 "], "img_footnote": [], "page_idx": 8}, {"type": "text", "text": "ETTh2 datasets. The x-axis is the prediction length, and each line represents the period of the added sine wave. Performance improvement is calculated as $100\\times$ (base MSE - BSA MSE) / base MSE. While the base model with a 96-length look-back window is expected to learn the 100-period trend, BSA outperformed it, especially for 96 and 192-step predictions (green line). The yellow line (period 300) shows nearly a $30\\%$ performance improvement across all prediction lengths. While the base model fails to learn the long-range interactions within a period of 300, BSA captures and utilizes the underlying trend. BSA also learns the 1000-period signal (red line) and demonstrates substantial improvements, especially in long prediction-length (336, 720) tasks. These results show that BSA effectively learns long-range patterns beyond the look-back window, essential for future prediction. ", "page_idx": 8}, {"type": "text", "text": "Figure 6 is generated from LUFL (Low UseFul Load) channel of ETTh1 data and with added sine waves of periods 100, 300, and 1000. The red arrow shows the added synthetic trend in the FFT graph (red line). As long-range trends are introduced, the attention graph (blue line) shifts from resembling symmetric Gaussian to a low-frequency bias. Longer sine wave periods cause greater shifts, prioritizing long-range information for predictions. ", "page_idx": 8}, {"type": "image", "img_path": "dxyNVEBQMp/tmp/32c90d398bef7ca7a6a417d7191f50835e5f97baeffe1c5c89b823817b2d14bd.jpg", "img_caption": [], "img_footnote": [], "page_idx": 8}, {"type": "image", "img_path": "dxyNVEBQMp/tmp/da3818cdca7d43e6a1299f7e7b76c7df240b0a74a3426f846f79296339523127.jpg", "img_caption": [], "img_footnote": [], "page_idx": 8}, {"type": "text", "text": "Table 2: Performance analysis on BSA insertion site. Each Figure 7: Schematic diagram of the number corresponds with the insertion site in Figure 7. BSA insertion site on Transformer. ", "page_idx": 8}, {"type": "text", "text": "The BSA module offers high flexibility as it can be applied to arbitrary activations of the base model. In Table 2, we analyzed the performance changes by applying BSA at various locations within the model. Each location corresponds to a number in the Transformer architecture depicted in Figure 7. While we uniformly applied BSA to position 1 for the main result Table 1, the results in Table 2 suggest the potential for further performance enhancement by applying BSA at appropriate locations. Additionally, while there is variability depending on the placement, the performance consistently remains higher compared to the baseline, demonstrating the stability of our method. We provided a full result in Appendix D.1. ", "page_idx": 8}, {"type": "text", "text": "BSA shows consistent performance improvement across varying look-back window (input) lengths. Table 3 demonstrates BSA’s superiority for look-back window lengths of 48, 96, and 192. Notably, while the baseline model’s performance drops significantly with shorter inputs, BSA maintains high performance. ", "page_idx": 8}, {"type": "text", "text": "Table 3: BSA’s performance improvement ( $\\%$ , denoted with \\*) compared to base model across three input lengths $\\{48,96,192\\}$ (iTransformer, average over 4 prediction lengths and 3 seeds). The full result, including other models, is in Appendix D.2. ", "page_idx": 9}, {"type": "table", "img_path": "dxyNVEBQMp/tmp/642df08a19fe2672ed068af49b75627e66a361a9cf673ce178bca9032068823f.jpg", "table_caption": [], "table_footnote": [], "page_idx": 9}, {"type": "text", "text": "Table 4: Computational cost increase with the BSA $(\\%)$ , averaged over 3 seeds and 4 prediction lengths on the PEMS03 dataset. TN: TimesNet, iTF: iTransformer, CF: Crossformer, PTST: PatchTST. The full result, including other datasets, is in Appendix D.3. ", "page_idx": 9}, {"type": "table", "img_path": "dxyNVEBQMp/tmp/9ef117cdce317a52d76a635754abb3db4d3542152df062c24a5b1db6368a4c9f.jpg", "table_caption": [], "table_footnote": [], "page_idx": 9}, {"type": "text", "text": "We also demonstrate the impact of using BSA on the training time, peak memory, and the number of model parameters. The extra computation required for BSA is constant with data length and linear with a look-back window length (c.f. quadratic for the base model with transformer architecture). Table 4 demonstrates the computational cost of the BSA is quite small, showing less than a $5\\%$ increase even with the large PEMS03 dataset. ", "page_idx": 9}, {"type": "text", "text": "We conduct an ablation study on the three key components that constitute BSA (Table 5). “BPTT” refers to whether gradients can flow between samples within the mini-batch. Without BPTT, BSA learns similarly to SA. “SFs” denotes whether to use multiple smoothing factors. Lastly, “Learn SF” indicates whether the smoothing factor is treated as learnable. The results indicate that each component significantly contributes to the performance improvement of BSA. ", "page_idx": 9}, {"type": "table", "img_path": "dxyNVEBQMp/tmp/20f3aad264b244fae4267ef1762adf4f54306f8a3c13126f42d424c40a5aecf9.jpg", "table_caption": ["Table 5: Ablation study with 3 components in BSA (Weather data, 720-step prediction, iTransformer). "], "table_footnote": [], "page_idx": 9}, {"type": "text", "text": "5 Conclusion ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "Our study addresses the challenges in handling long-range dependencies inherent in time series data by introducing a fast and effective Spectral Attention mechanism. By preserving temporal correlations and enabling the flow of gradients between samples, this mechanism facilitates the model in capturing crucial long-range interactions essential for accurate future predictions. Therefore, our research paves the way for fixed-sized input models to effectively handle long-range dependencies extending far beyond the input window. Through extensive experimentation, we demonstrated that our Spectral Attention mechanism enhances performance across various base architectures, with its ability to grasp long-term dependencies being the key factor behind this improvement. BSA effectively tackles long-term fluctuations, complementing the base model’s capacity to manage intricate yet short-term patterns. This integrated model holds promise for improving real-world application performance. For instance, it could boost weather forecast accuracy by simultaneously capturing minute-by-minute weather changes and seasonal variations. Moreover, when predicting deterioration from a patient’s real-time data, it can consider medications with lengthy onset times. Our study has limitations: we did not analyze the impact of BSA placement within the base model in detail. Also, BSA’s performance gains may be limited when applied to datasets with only high-frequency information within the look-back window. These issues should be addressed in future research. ", "page_idx": 9}, {"type": "text", "text": "6 Acknowledgement ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "This research was supported by a grant of the MD-Phd/Medical Scientist Training Program through the Korea Health Industry Development Institute (KHIDI), funded by the Ministry of Health & Welfare, Republic of Korea, National Research Foundation of Korea (NRF) grants funded by the Korea government (Ministry of Science and ICT, MSIT) (2022R1A3B1077720 and 2022R1A5A708390811), Institute of Information & Communications Technology Planning & Evaluation (IITP) grants funded by the Korea government (MSIT) (2021-0-01343: Artificial Intelligence Graduate School Program (Seoul National University), 2022-0-00959 and IITP-2024-RS-2024-00397085: Leading Generative AI Human Resources Development), and the BK21 FOUR program of the Education and Research Program for Future ICT Pioneers, Seoul National University in 2024, AI-Bio Research Grant through Seoul National University, Hyundai Motor Company, HUINNO AIM Company through HA-Rnd2325-PredictClinicalDeterioration. ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "[1] Abien Fred Agarap. Deep learning using rectified linear units (relu). arXiv preprint arXiv:1803.08375, 2018.   \n[2] Nesreen K Ahmed, Amir F Atiya, Neamat El Gayar, and Hisham El-Shishiny. An empirical comparison of machine learning models for time series forecasting. Econometric reviews, 29(5-6):594–621, 2010.   \n[3] Peter Bloomfield. Fourier analysis of time series: an introduction. John Wiley & Sons, 2004.   \n[4] Bernhard E Boser, Isabelle M Guyon, and Vladimir N Vapnik. A training algorithm for optimal margin classifiers. In Proceedings of the fifth annual workshop on Computational learning theory, pages 144–152, 1992.   \n[5] George EP Box and Gwilym M Jenkins. Some recent advances in forecasting and control. Journal of the Royal Statistical Society. Series C (Applied Statistics), 17(2):91–109, 1968.   \n[6] Luis M Candanedo, Véronique Feldheim, and Dominique Deramaix. Data driven prediction models of energy use of appliances in a low-energy house. Energy and buildings, 140:81–97, 2017.   \n[7] Abhimanyu Das, Weihao Kong, Andrew Leach, Shaan Mathur, Rajat Sen, and Rose Yu. Longterm forecasting with tide: Time-series dense encoder. arXiv preprint arXiv:2304.08424, 2023.   \n[8] Vijay Ekambaram, Arindam Jati, Nam Nguyen, Phanwadee Sinthong, and Jayant Kalagnanam. Tsmixer: Lightweight mlp-mixer model for multivariate time series forecasting. In Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining, pages 459–469, 2023.   \n[9] Jerome H Friedman. Greedy function approximation: a gradient boosting machine. Annals of statistics, pages 1189–1232, 2001.   \n[10] Agathe Girard, Carl Rasmussen, Joaquin Q Candela, and Roderick Murray-Smith. Gaussian process priors with uncertain inputs application to multiple-step ahead time series forecasting. Advances in neural information processing systems, 15, 2002.   \n[11] Dan Hendrycks and Kevin Gimpel. Gaussian error linear units (gelus). arXiv preprint arXiv:1606.08415, 2016.   \n[12] Pradeep Hewage, Ardhendu Behera, Marcello Trovati, Ella Pereira, Morteza Ghahremani, Francesco Palmieri, and Yonghuai Liu. Temporal convolutional neural (tcn) network for an effective weather forecasting using time-series data from the local weather station. Soft Computing, 24:16453–16482, 2020.   \n[13] Geoffrey E Hinton, Simon Osindero, and Yee-Whye Teh. A fast learning algorithm for deep belief nets. Neural computation, 18(7):1527–1554, 2006.   \n[14] Tin Kam Ho. Random decision forests. In Proceedings of 3rd international conference on document analysis and recognition, volume 1, pages 278–282. IEEE, 1995.   \n[15] Sepp Hochreiter and Jürgen Schmidhuber. Long short-term memory. Neural computation, 9(8):1735–1780, 1997.   \n[16] Tzu-Ming Harry Hsu, Hang Qi, and Matthew Brown. Measuring the effects of non-identical data distribution for federated visual classification. arXiv preprint arXiv:1909.06335, 2019.   \n[17] MJC Hu and Halbert E Root. An adaptive data processing system for weather forecasting. Journal of Applied Meteorology and Climatology, 3(5):513–523, 1964.   \n[18] Rob J Hyndman and George Athanasopoulos. Forecasting: principles and practice. OTexts, 2018.   \n[19] A. Kahraman, G. Yang, and P. Hou. Wind power forecasting using lstm incorporating fourier transformation based denoising technique. In 20th International Workshop on Large-Scale Integration of Wind Power into Power Systems as well as on Transmission Networks for Offshore Wind Power Plants (WIW 2021), volume 2021, pages 94–98, 2021.   \n[20] Kyoung-jae Kim. Financial time series forecasting using support vector machines. Neurocomputing, 55(1-2):307–319, 2003.   \n[21] Taesung Kim, Jinhee Kim, Yunwon Tae, Cheonbok Park, Jang-Ho Choi, and Jaegul Choo. Reversible instance normalization for accurate time-series forecasting against distribution shift. In International Conference on Learning Representations, 2021.   \n[22] Diederik P Kingma and Jimmy Ba. Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980, 2014.   \n[23] Nikita Kitaev, Łukasz Kaiser, and Anselm Levskaya. Reformer: The efficient transformer. arXiv preprint arXiv:2001.04451, 2020.   \n[24] Diego Krapf, Enzo Marinari, Ralf Metzler, Gleb Oshanin, Xinran Xu, and Alessio Squarcini. Power spectral density of a single brownian trajectory: what one can and cannot learn from it. New Journal of Physics, 20(2):023029, 2018.   \n[25] Guokun Lai, Wei-Cheng Chang, Yiming Yang, and Hanxiao Liu. Modeling long-and short-term temporal patterns with deep neural networks. In The 41st international ACM SIGIR conference on research & development in information retrieval, pages 95–104, 2018.   \n[26] Guokun Lai, Wei-Cheng Chang, Yiming Yang, and Hanxiao Liu. Modeling long-and short-term temporal patterns with deep neural networks. In The 41st international ACM SIGIR conference on research & development in information retrieval, pages 95–104, 2018.   \n[27] Shiyang Li, Xiaoyong Jin, Yao Xuan, Xiyou Zhou, Wenhu Chen, Yu-Xiang Wang, and Xifeng Yan. Enhancing the locality and breaking the memory bottleneck of transformer on time series forecasting. Advances in neural information processing systems, 32, 2019.   \n[28] Zhe Li, Shiyi Qi, Yiduo Li, and Zenglin Xu. Revisiting long-term time series forecasting: An investigation on linear mapping. arXiv preprint arXiv:2305.10721, 2023.   \n[29] Minhao Liu, Ailing Zeng, Muxi Chen, Zhijian Xu, Qiuxia Lai, Lingna Ma, and Qiang Xu. Scinet: Time series modeling and forecasting with sample convolution and interaction. Advances in Neural Information Processing Systems, 35:5816–5828, 2022.   \n[30] Yeqi Liu, Chuanyang Gong, Ling Yang, and Yingyi Chen. Dstp-rnn: A dual-stage two-phase attention-based recurrent neural network for long-term and multivariate time series prediction. Expert Systems with Applications, 143:113082, 2020.   \n[31] Yong Liu, Tengge Hu, Haoran Zhang, Haixu Wu, Shiyu Wang, Lintao Ma, and Mingsheng Long. itransformer: Inverted transformers are effective for time series forecasting. arXiv preprint arXiv:2310.06625, 2023.   \n[32] Yong Liu, Haixu Wu, Jianmin Wang, and Mingsheng Long. Non-stationary transformers: Rethinking the stationarity in time series forecasting. NeurIPS, 2022.   \n[33] MickOhrberg. Brownian noise — Wikipedia, the free encyclopedia, 2024. [Online; accessed 9-April-2024].   \n[34] Fernando Moreno-Pino, Pablo M Olmos, and Antonio Artés-Rodríguez. Deep autoregressive models with spectral attention. Pattern Recognition, 133:109014, 2023.   \n[35] Brian K Nelson. Time series analysis using autoregressive integrated moving average (arima) models. Academic emergency medicine, 5(7):739–744, 1998.   \n[36] Yuqi Nie, Nam H Nguyen, Phanwadee Sinthong, and Jayant Kalagnanam. A time series is worth 64 words: Long-term forecasting with transformers. arXiv preprint arXiv:2211.14730, 2022.   \n[37] Vigneashwara Pandiyan, Rita Drissi-Daoudi, Sergey Shevchik, Giulio Masinelli, Roland Logé, and Kilian Wasmer. Analysis of time, frequency and time-frequency domain features from acoustic emissions during laser powder-bed fusion process. Procedia CIRP, 94:392–397, 2020.   \n[38] Adam Paszke, S. Gross, Francisco Massa, A. Lerer, James Bradbury, Gregory Chanan, Trevor Killeen, Z. Lin, N. Gimelshein, L. Antiga, Alban Desmaison, Andreas Köpf, Edward Yang, Zach DeVito, Martin Raison, Alykhan Tejani, Sasank Chilamkurthy, Benoit Steiner, Lu Fang, Junjie Bai, and Soumith Chintala. Pytorch: An imperative style, high-performance deep learning library. NeurIPS, 2019.   \n[39] Hadi Rezaei, Hamidreza Faaljou, and Gholamreza Mansourfar. Stock price prediction using deep learning and frequency decomposition. Expert Systems with Applications, 169:114332, 2021.   \n[40] Frank Rosenblatt. The perceptron, a perceiving and recognizing automaton Project Para. Cornell Aeronautical Laboratory, 1957.   \n[41] Alaa Sagheer and Mostafa Kotb. Time series forecasting of petroleum production using deep lstm recurrent networks. Neurocomputing, 323:203–213, 2019.   \n[42] Donghwan Song, Adrian Matias Chung Baek, and Namhun Kim. Forecasting stock market indices using padding-based fourier transform denoising and time series deep learning models. IEEE Access, 9:83786–83796, 2021.   \n[43] Ilya Sutskever, Oriol Vinyals, and Quoc V Le. Sequence to sequence learning with neural networks. Advances in neural information processing systems, 27, 2014.   \n[44] Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz Kaiser, and Illia Polosukhin. Attention is all you need. Advances in neural information processing systems, 30, 2017.   \n[45] Renzhuo Wan, Shuping Mei, Jun Wang, Min Liu, and Fan Yang. Multivariate temporal convolutional network: A deep neural networks approach for multivariate time series forecasting. Electronics, 8(8):876, 2019.   \n[46] Qingsong Wen, Tian Zhou, Chaoli Zhang, Weiqi Chen, Ziqing Ma, Junchi Yan, and Liang Sun. Transformers in time series: A survey. arXiv preprint arXiv:2202.07125, 2022.   \n[47] Paul J Werbos. Backpropagation through time: what it does and how to do it. Proceedings of the IEEE, 78(10):1550–1560, 1990.   \n[48] Haixu Wu, Tengge Hu, Yong Liu, Hang Zhou, Jianmin Wang, and Mingsheng Long. Timesnet: Temporal 2d-variation modeling for general time series analysis. ICLR, 2023.   \n[49] Haixu Wu, Jiehui Xu, Jianmin Wang, and Mingsheng Long. Autoformer: Decomposition transformers with auto-correlation for long-term series forecasting. Advances in neural information processing systems, 34:22419–22430, 2021.   \n[50] Zhijian Xu, Ailing Zeng, and Qiang Xu. FITS: Modeling time series with $\\mathbb{S}10\\mathrm{k}\\mathbb{S}$ parameters. In The Twelfth International Conference on Learning Representations, 2024.   \n[51] Fuhao Yang, Xin Li, Min Wang, Hongyu Zang, Wei Pang, and Mingzhong Wang. Waveform: Graph enhanced wavelet learning for long sequence forecasting of multivariate time series. In Proceedings of the AAAI Conference on Artificial Intelligence, volume 37, pages 10754–10761, 2023.   \n[52] Kun Yi, Qi Zhang, Wei Fan, Shoujin Wang, Pengyang Wang, Hui He, Ning An, Defu Lian, Longbing Cao, and Zhendong Niu. Frequency-domain mlps are more effective learners in time series forecasting. Advances in Neural Information Processing Systems, 36, 2024.   \n[53] Ailing Zeng, Muxi Chen, Lei Zhang, and Qiang Xu. Are transformers effective for time series forecasting? In Proceedings of the AAAI conference on artificial intelligence, volume 37, pages 11121–11128, 2023.   \n[54] Yunhao Zhang and Junchi Yan. Crossformer: Transformer utilizing cross-dimension dependency for multivariate time series forecasting. In The eleventh international conference on learning representations, 2022.   \n[55] Haoyi Zhou, Shanghang Zhang, Jieqi Peng, Shuai Zhang, Jianxin Li, Hui Xiong, and Wancai Zhang. Informer: Beyond efficient transformer for long sequence time-series forecasting. In Proceedings of the AAAI conference on artificial intelligence, volume 35, pages 11106–11115, 2021.   \n[56] Tian Zhou, Ziqing Ma, Qingsong Wen, Xue Wang, Liang Sun, and Rong Jin. Fedformer: Frequency enhanced decomposed transformer for long-term series forecasting. In International conference on machine learning, pages 27268–27286. PMLR, 2022. ", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "", "page_idx": 13}, {"type": "text", "text": "A Details on Datasets, Models, and Training ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "A.1 Details on datasets ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Dataset Information. We conducted experiments on 11 real-world datasets to assess the performance of baseline models and the proposed BSA method. The Weather dataset [49] includes 21 meteorological factors acquired every 10 minutes in 2020 from the Weather Station of the Max Planck Institute for Biogeochemistry. The Traffic dataset [49] records hourly road occupancy rates from 862 sensors on San Francisco Bay Area freeways, covering the period from January 2015 to December 2016. The ECL dataset [49] captures the hourly electricity consumption of 321 clients. The ETT dataset [55] contains seven factors related to electricity transformers, spanning from July 2016 to July 2018. It is divided into four sub-datasets: ETTh1 and ETTh2 are recorded hourly, while ETTm1 and ETTm2 are collected every 15 minutes. The Exchange dataset [49] comprises panel data of daily exchange rates from eight countries, ranging from 1990 to 2016. Illness dataset [49] contains weekly data on influenza-like illness (ILI) cases recorded by the U.S. Centers for Disease Control and Prevention (CDC) from 2002 to 2021. The dataset tracks the proportion of ILI patients relative to the overall number of patients seen during that period. PEMS03 dataset [29] is a sub-dataset of the PEMS dataset, which includes public traffic network data from California, recorded at 5-minute intervals. The EnergyData dataset [6] comprises hourly end-use measurements gathered from 454 residential properties and 140 commercial establishments located in the Pacific Northwest. All these public datasets were downloaded from the referenced sources in March 2024. ", "page_idx": 14}, {"type": "text", "text": "Dataset split. We adhere to the data processing protocol and train-validation-test split used in TimesNet [48], where the training, validation, and test datasets are sequentially separated in chronological order. Our paper’s data split ratios for train, validation, and test set are as follows: (0.7, 0.1, 0.2) for Weather, Traffic, ECL, Exchange, Ilnness, PEMS03, and EnergyData datasets and (0.6, 0.2, 0.2) for ETT. The details of datasets are provided in Table 6. ", "page_idx": 14}, {"type": "text", "text": "Forecasting setting. Following the approach in iTransformer [31], the look-back window length is set to {96}, while the forecast lengths are {96, 192, 336, 720} for the Weather, Traffic, ECL, ETT, PEMS03, and EnergyData datasets. Forecasting lengths is only {96} for the Exchange dataset since the dataset is too short, which causes biased best model selection with the validation set. For Illness dataset, the look-back window length is {36} and the forecasting lengths are {24, 36, 48, 60}. ", "page_idx": 14}, {"type": "text", "text": "Table 6: Summary of Datasets. Channel denotes the number of time series variables (channels) for each dataset. Pre-Train is the number of training epochs for baseline model saturation. Finetune is the number of fine-tuning epochs for our method. Data Split means the number of time steps in (Train, Validation, Test) data split respectively. Sampling Rate denotes how often the data samples are collected. Type is to show the domain in which the data is acquired. We have indicated cases where the data split count matches exactly with that used in TimesNet [48] by marking them with an asterisk $(^{*})$ . For the ETT and the Exchange dataset, the length of the downloaded data differed from the data length reported in TimesNet. ", "page_idx": 14}, {"type": "table", "img_path": "dxyNVEBQMp/tmp/cb5f2c39af020203daeeb36638e92dac370aee474c7a440b9b03a3ecbd5040f9.jpg", "table_caption": [], "table_footnote": [], "page_idx": 14}, {"type": "text", "text": "A.2 Details on Model Implementations ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Model configurations. In this section, we discuss the configurations of the baseline models and specify where the BSA module was integrated into each baseline model. For each dataset, the base model structure configuration was directly replicated from the Time-Series-Library [48] scripts when available. Where configurations were not provided, we adjusted them to align closely with the available examples. ", "page_idx": 14}, {"type": "text", "text": "", "page_idx": 15}, {"type": "text", "text": "1. DLinear [53]: The only hyperparameter for this baseline model is the (moving_average $=25$ ) for the series decomposition module from Autoformer [49]. We set the Individual to True so that there are separate linear models for each number of input variables. The BSA module is implemented at the very beginning of the forward pass right before series decomposition. The BSA module is implemented for each channel, which is the number of input variables for this case. ", "page_idx": 15}, {"type": "text", "text": "2. iTransformer [31]: The hyperparameters for this baseline model are as follows: ", "page_idx": 15}, {"type": "text", "text": "$(\\mathrm{d\\_model}=512$ , d_ff $=512$ , dropout $=0.1$ , num_heads $=8$ , encoder_layers $=3$ , activation $=$ GELU [11]) for the Weather, ECL, PEMS03, and EnergyData datasets,   \n$\\mathrm{{(d\\_model}}=512$ , $\\mathrm{d\\_ff}=512$ , dropout $=0.1$ , num_heads $=8$ , encoder_layers $=4$ , activation $=$ GELU) for the Traffic dataset,   \n(d_model $=128$ , d_ff $=128$ , dropout $=0.1$ , num_heads $=8$ , encoder_layers $=2$ , activation $=$ GELU) for the ETT and Exchange datasets.   \nThe BSA module is implemented at the beginning part of the forward pass right after normalization from the Non-stationary Transformer [32] and right before the input embedding. The BSA module is implemented for each channel, which is the number of input variables for this case. ", "page_idx": 15}, {"type": "text", "text": "3. Crossformer [54]: The hyperparameters for this baseline model are as follows: ", "page_idx": 15}, {"type": "text", "text": "(seg_len $=12$ , win_size $=2$ , factor $=3$ , $\\mathrm{d\\_model}=32$ , $\\mathrm{d\\_ff}=32$ , dropout $=0.1$ , num_heads $=8$ , encoder_layers $=2$ , activation $=$ RELU [1]) for the Weather and EnergyData dataset,   \n(seg_len $=12$ , win_size $=2$ , factor $=3$ , ${\\mathrm{d}}\\_{\\mathrm{model}}=128$ , $\\mathrm{d\\_ff}=128$ , dropout $=0.1$ , num_heads $=2$ , encoder_layers $=2$ , activatio $\\boldsymbol{\\mathbf{\\rho}}_{\\mathrm{l}}=\\boldsymbol{\\mathbf{R}}\\boldsymbol{\\mathbf{E}}\\boldsymbol{\\mathbf{L}}\\boldsymbol{\\mathbf{U}}$ ) for the Traffic dataset,   \n(seg_len $=12$ , win_size $=2$ , factor $=3$ , d_model $=256$ , d_ff $=512$ , dropout $=0.1$ , num_heads $=8$ , encoder_layers $=2$ , activation $\\mathrm{\\Delta}_{\\mathrm{l}}=\\mathrm{RELU}$ ) for the ECL and PEMS03 dataset,   \n(seg_len $=12$ , win_size $=2$ , factor $=3$ , d_model $=512$ , d_ff $=2048$ , dropout $=0.1$ , num_heads $=8$ , encoder_layers $=2$ , activation $=\\mathrm{RELU}.$ ) for the ETTh1 and ETTh2 datsets,   \n(seg_len $=12$ , win_size $=2$ , factor $=1$ , ${\\mathrm{d}}\\_{\\mathrm{model}}=512,$ , d_ff $=2048$ , dropout $=0.1$ , num_heads $=8$ , encoder_layers $=2$ , activation $=$ RELU) for the ETTm1 and ETTm2 datasets,   \n(seg_len $=12$ , win_size $=2$ , factor $=3$ , ${\\mathrm{d}}\\_{\\mathrm{model}}=64,$ , d_ff $=64$ , dropout $=0.1$ , num_heads $=8$ , encoder_layers $=2$ , activation $=$ RELU) for the Exchange dataset.   \nThe BSA module is implemented at the very beginning of the forward pass, right before the input embedding. The BSA module is implemented for each channel, which is the number of input variables for this case. ", "page_idx": 15}, {"type": "text", "text": "4. PatchTST [36]: The hyperparameters for this baseline model are as follows: ", "page_idx": 15}, {"type": "text", "text": "(patch_len $=16$ , stride $=8$ , d_model $=512$ , d_ff $=2048$ , dropout $=0.1$ , num_heads $=4$ , encoder_layers $=2$ , activation $=$ GELU [11]) for the Weather and EnergyData dataset,   \n(patch_len $=16$ , stride $=8$ , $\\mathrm{d\\_model}=512$ , d_ff $=512$ , dropout $=0.1$ , num_heads $=8$ , encoder_layers $=2$ , activation $=$ GELU) for the Traffic dataset,   \n(patch_len $=16$ , stride $=8$ , d_model $=512$ , d_ff $=2048$ , dropout $=0.1$ , num_heads $=8$ , encoder_layers $=2$ , activati $\\mathsf{m}=\\mathrm{GELU})$ for the ECL and PEMS03 dataset,   \n(patch_len $=16$ , stride $=8$ , d_model $=512$ , d_ff $=2048$ , dropout $=0.1$ , num_heads $=8$ , encoder_layers $=1$ , activation $=$ GELU) for the ETTh1 datset,   \n(patch_len $=16$ , stride $=8$ , $\\mathrm{d\\_model}=512$ , d_ff $=2048$ , dropout $=0.1$ , num_heads $=4$ , encoder_layers $=3$ , activatio $\\mathrm{{n}=G E L U)}$ for the ETTh2, ETTm1, and ETTm2 datsets.   \nThe BSA module is implemented at the beginning part of the forward pass right after normalization from the Non-stationary Transformer [32] and right before the patch embedding. The BSA module is implemented for each channel, which is the number of input variables for this case. ", "page_idx": 15}, {"type": "text", "text": "5. TimesNet [48]: The hyperparameters for this baseline model are as follows: ", "page_idx": 15}, {"type": "text", "text": "(top_ $\\mathbf{k}=5$ , num_kernels $=6$ , embed $=$ ’timeF’, freq $\\mathbf{\\omega}=\\mathbf{\\omega}^{\\setminus}\\mathbf{h}^{\\setminus}$ , d_model $=32$ , d_ff $=32$ , dropout $=0.1$ , encoder_layers $=2$ ) for the Weather, ETTh2, ETTm2, and EnergyData datasets,   \n$(\\mathrm{top\\_k}=5$ , num_kernels $=6$ , embed $=$ ’timeF’, freq $\\mathbf{\\omega}=\\mathbf{\\omega}^{\\setminus}\\mathbf{h}^{\\setminus}$ , d_model $=512$ , d_ff $=512$ , dropout $=0.1$ , encoder_layers $=2$ ) for the Traffic dataset,   \n(top_ $\\mathrm{k}=5$ , num_kernels $=6$ , embed $=$ ’timeF’, freq $\\mathbf{\\omega}=\\mathbf{\\omega}^{\\ast}\\mathbf{h}\\cdot\\mathbf{\\omega}$ , d_model $=256$ , d_ff $=512$ , dropout $=0.1$ , encoder_layers $=2$ ) for the ECL and PEMS03 dataset,   \n(top_ $\\mathbf{k}=5$ , num_kernels $=6$ , embed $=$ ’timeF’, freq $\\mathbf{\\omega}=\\mathbf{\\omega}^{\\setminus}\\mathbf{h}^{\\setminus}$ , d_model $=16$ , d_ff $=32$ , dropout $=0.1$ , encoder_layers $=2$ ) for the ETTh1 and ETTm1 datasets, ", "page_idx": 15}, {"type": "text", "text": "$(\\mathrm{top\\_k}=5$ , num_kernels $=6$ , embed $=$ ’timeF’, freq $\\mathbf{\\omega}=\\mathbf{\\omega}^{\\setminus}\\mathbf{h}^{\\setminus}$ , d_model $=64$ , d_ff $=64$ , dropout $=0.1$ , encoder_layers $=2$ ) for the Exchange dataset. ", "page_idx": 16}, {"type": "text", "text": "The BSA module is implemented at the beginning part of the forward pass right after normalization from the Non-stationary Transformer [32] and right before the input embedding. The BSA module is implemented for each channel, which is the number of input variables for this case. ", "page_idx": 16}, {"type": "text", "text": "6. FreTS [52]: The hyperparameters for this baseline model are as follows: (embed_size $=128$ , hidden_size $=256$ , sparsity_threshold $=0.01$ , scale $=0.02$ ) for all datasets. Based on the paper, the channel-independent strategy is selected. ", "page_idx": 16}, {"type": "text", "text": "The BSA module is implemented at the very beginning of the forward pass, right before the token embedding. The BSA module is implemented for each channel, which is the number of input variables for this case. ", "page_idx": 16}, {"type": "text", "text": "7. RLinear [28]: The only hyperparameter for this baseline model is the $(\\mathrm{dropout}=0.1)$ ). We set the Individual to True so that there are separate linear models for each number of input variables. The BSA module is implemented at the beginning part of the forward pass right after normalization from the RevIN [21] and right before the linear layer. The BSA module is implemented for each channel, which is the number of input variables for this case. ", "page_idx": 16}, {"type": "text", "text": "A.3 Details on Training ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Pre-training and Finetuning configurations. To show how our BSA module performs when added to the baseline models, we saturated the models by greedy hyperparameter search. ", "page_idx": 16}, {"type": "text", "text": "The hyperparameter search space for the base model is as follows: the possible learning rate is (0.03, 0.01, 0.003, 0.001, 0.0003), and the weight decay is (0.01, 0.003, 0.001, 0.0003, 0.0001, 0.00003). ", "page_idx": 16}, {"type": "text", "text": "The hyperparameter search space for BSA finetuning is as follows: the possible learning rate for the SA-Matrix in the BSA module is (0.08, 0.05, 0.03, 0.01, 0.003, 0.001), learning rate for the rest of the model, i.e. original modules, is (0.01, 0.003, 0.001, 0.0003, 0.0001, 0.00003, 0.00001), learning rate for smoothing factor $\\alpha_{k}$ is (none, 0.03, 0.01, 0.003, 0.001, 0.0001, 0.00001), initialization for smoothing factor $\\alpha_{k}$ is ([0.9, 0.99, 0.999], [0.9, 0.99, 0.999, 0.999], [0.9, 0.95, 0.992, 0.999], [0.8, 0.96, 0.992, 0.9984, 0.99968]). ", "page_idx": 16}, {"type": "text", "text": "Model selection Hyperparameter search is conducted based on the validation set. While models trained using conventional sample shuffilng evenly represent the entire time series distribution from which the dataset is sampled, BSA learns data in chronological order. Consequently, the final model tends to favor the distribution of the later part of the data. This can be seen as a mild version of catastrophic forgetting, commonly occurring in continual learning. To mitigate this effect, we assigned higher weights to the later samples during the validation process. The weights are represented by $\\begin{array}{r}{0.5+0.5\\times\\sin\\left(\\frac{\\pi}{2}\\times\\frac{v a l\\_i d x}{v a l\\_l e n}\\right)}\\end{array}$ vvaall__liednx), continuously increasing from 0.5 for the first sample to 1.0 for the last sample. ", "page_idx": 16}, {"type": "text", "text": "Optimization The whole code is implemented in PyTorch [38]. Each experiment was conducted on a single NVIDIA GeForce RTX 3090Ti or NVIDIA A40 or NVIDIA L40 GPU. The default batch size for baseline model saturation is 64, while for our method—which involves fine-tuning after integrating the BSA module—it is 256. If a baseline model is too heavy and results in GPU memory overflow, the batch size is adjusted to fit within the available memory. We used the ADAM [22] optimizer and L2 loss (MSE loss) for the model optimization. The baseline saturation training epoch is set to 40 epochs for the Weather dataset, 20 epochs for the Traffic dataset, and 30 epochs for the rest of the datasets. The finetuning epoch is set to 30 epochs for the ETTh1, ETTh2, and Exchange datasets and 20 epochs for the rest of the datasets. ", "page_idx": 16}, {"type": "text", "text": "B Real world dataset experiments ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "B.1 Full experiment results ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "The experiments were conducted on a total of 11 public real-world datasets and 7 forecasting models. The average results (MSE, MAE) of the experiments conducted with three random seeds 0, 1, and 2 are shown in Table 7, and the standard deviations are shown in Table 8. The values reported in Table 1 are labeled as Avg in Table 7. For the Exchange dataset, we only report experiments with a prediction length of {96}. Using prediction lengths of {192, 336, 720} causes improper best model selection due to an insufficient number of validation samples. The empty results indicate that the training is too heavy, and the results are not yet available. We expect to have the results ready by the rebuttal. ", "page_idx": 16}, {"type": "image", "img_path": "dxyNVEBQMp/tmp/78e17cf5b9785195f767a97f6fb16177be746bd67804c4bf2eb23998f9d5ceff.jpg", "img_caption": ["Figure 8: The illustration compares the pre-denoising and post-denoising results alongside Brownian noise. For (a) and (b), the y-axis represents amplitude, and the $\\mathbf{X}$ -axis is on a negative log scale, indicating that moving toward the right corresponds to lower frequencies. Conversely, in (c), the y-axis represents decibels, and the $\\mathbf{X}$ -axis is on a log scale, where moving toward the left corresponds to lower frequencies. "], "img_footnote": [], "page_idx": 17}, {"type": "text", "text": "", "page_idx": 17}, {"type": "text", "text": "B.2 SA-Matrix and FFT visualization ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "To investigate how the SA-Matrix of BSA predominantly attends to specific frequency bands, we employed the heatmaps, the Gaussian kernel density estimate graphs, and the FFT graphs as shown in Figure 9, 10, 11, 12, 15 and 13. ", "page_idx": 17}, {"type": "text", "text": "The 2D heatmap depicts the learnable parameters of the SA-Matrix, defined as sa-matrix∈ $\\mathbb{R}^{(2K+1)\\times D}$ , where $K$ represents the number of smoothing factors and $D$ represents the dimension of the input features. Consequently, the y-axis of the 2D heatmap matches the length of $D$ , and the $\\mathbf{X}$ -axis corresponds to $2K+1$ , symmetrically arranged around zero. On the $\\mathbf{X}$ -axis, positive values indicate the low-frequency regions, while negative values represent the high-frequency regions. ", "page_idx": 17}, {"type": "text", "text": "The Gaussian kernel density estimate graphs intuitively reveal which frequency bands the SA-Matrix predominantly attends to. The $K$ smoothing factors were modified according to Equation 8 and symmetrically arranged around zero, serving as the data points for kernel density estimation (KDE). The weight values from each row of the SA-Matrix were converted to probabilities using the softmax function, and the resulting outputs established a mapping of these weight values to data points necessary for Gaussian KDE. This mapping facilitated the construction of the Gaussian KDE graph. Subsequently, the overall probability density of the SA-Matrix was estimated by calculating the mean across columns. Consequently, the y-axis of the graphs denotes the attention level of the SA-Matrix, whereas the $\\mathbf{X}$ -axis indicates the scalar indices, encompassing the range of the smoothing factors. To better represent the variation in weight values across frequency bands, we adjusted the bandwidth of the KDE function to 0.4, based on the product of the Gaussian kernel’s covariance factor and the standard deviation of the sampled weights in the matrix. ", "page_idx": 17}, {"type": "equation", "text": "$$\n\\alpha_{k}^{'}=\\log_{10}(\\frac{1}{1-\\sigma(\\alpha_{k})})\n$$", "text_format": "latex", "page_idx": 17}, {"type": "text", "text": "The FFT graph is depicted with a red line. FFT analysis was conducted for each variable to determine if the fine-tuned SA-Matrix aligns with the frequencies exhibited by the dataset. To compare the low-frequency parts, the negative log-scale was used on the ${\\bf X}$ -axis, showing that progression to the right indicates decreasing frequencies. The Gaussian filter with a fixed standard deviation of 5 was utilized to smooth the signal’s amplitude. ", "page_idx": 17}, {"type": "text", "text": "The denoising phase was executed on the FFT output to analyze the correlation between the frequency tendencies of the dataset and the manipulated weights in the SA-Matrix. Figure 8(c) depicts Brownian noise, with the $\\mathbf{X}$ -axis denoting frequency and the y-axis in decibels (dB). Both axes are configured on a log scale. Converting the y-axis from decibels to amplitude is akin to implementing linear scaling, which reveals a steeper rise in noise at lower frequencies. This noise generally arises in the low-frequency bands of most real-world systems, such as electronic systems and environmental sciences [24]. Figure 8 (a) shows that noise escalates within the low-frequency regions across variables, leading to the assumption that unique Brownian noise originates in each system. Consequently, a linear approximation was used for the denoising function, which was performed manually. The outcomes of this process are presented in Figure 8 (b). ", "page_idx": 17}, {"type": "table", "img_path": "dxyNVEBQMp/tmp/2125e1bba84a33c83894d06330662e8006c0edead291ea45e5e870f8f5c5145d.jpg", "table_caption": [""], "table_footnote": [], "page_idx": 18}, {"type": "table", "img_path": "dxyNVEBQMp/tmp/681c2b0f86c379b54bdb319cb1d9b999c02878a33772726804de28fa79215a31.jpg", "table_caption": [""], "table_footnote": [], "page_idx": 19}, {"type": "table", "img_path": "dxyNVEBQMp/tmp/a18acab0c8421d635b34ef9ccc899d1ddf45f39cc782af5b85e8983e07ea4f96.jpg", "table_caption": ["Table 9: Full average results of three random seeds with prediction lengths $S\\in\\{96,192,336,720\\}$ and a fixed lookback length $T=\\{96\\}$ on synthetic data. The original results are from the public datasets ETTh1 and ETTh2, as shown in Table 7. Synthetic datasets were created by adding sine waves with periods of 100, 300, and 1000 to the original ETTh datasets. Gains mean performance improvements by using our method. "], "table_footnote": [], "page_idx": 20}, {"type": "text", "text": "", "page_idx": 20}, {"type": "text", "text": "C Synthetic dataset experiments ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "We constructed synthetic datasets by adding sine waves with periods of 100, 300, and 1000 to each channel (variable) of the ETTh1 and ETTh2 datasets. The scale of the sine wave is set to the standard deviation value of each channel. The phases of the sine waves for each channel are randomly sampled from a uniform distribution from 0 to $2\\pi$ to make decorrelated sine waves. The full results are reported in Table 9. ", "page_idx": 20}, {"type": "text", "text": "C.1 SA-Matrix and FFT visualization ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "As illustrated in Figure 14, the LUFL, MULL, OT, and LULL channels are organized into columns, with each graph positioned within rows that correspond to the periods added to the dataset. Figure 14 (a) shows the SA-Matrix from the iTransformer model fine-tuned with a 720 prediction length on the ETTh1 data that does not include added sine waves. From (b) to (d), the models were trained with synthetic datasets increasingly augmented with sine waves at periods of 100, 300, and 1000. As the number of added periods increases, there is a shift in the SA-Matrix weight distribution toward low-frequency patterns in each channel. ", "page_idx": 20}, {"type": "text", "text": "D Analysis and Ablation Studies ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "D.1 BSA insertion site analysis ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Table 10 shows the full results for different BSA module insertion sites in the iTransformer [31] and DLinear [53] models on the Weather Dataset. Table 2 is from the average value of Table 10. The BSA module insert position can be found in Figure 7. ", "page_idx": 20}, {"type": "table", "img_path": "dxyNVEBQMp/tmp/4359816f16e75e6ec67cdb32f4a7cf2149a6090b6209ce8ad565cde5adbb832c.jpg", "table_caption": ["Table 10: Full results for different BSA module locations for iTransformer [31] and DLinear [53] on the Weather dataset. Positions 1 and 4 are the only available options for the DLinear Model. "], "table_footnote": [], "page_idx": 21}, {"type": "text", "text": "D.2 BSA variable input lengths analysis ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Table 11: Full result for the performance of the base model and BSA according to changes in Input length. Experiments were conducted on Weather and PEMS03 data using DLinear, RLinear, and iTransformer models. ", "page_idx": 21}, {"type": "table", "img_path": "dxyNVEBQMp/tmp/d10b7f8f13ab02235096c87f418c3e1c0cde392712dd08cdf1d8f38e002a8501.jpg", "table_caption": [], "table_footnote": [], "page_idx": 21}, {"type": "text", "text": "Table 11 shows the full results of the performance of the base model and BSA according to changes in Input length. Experiments were conducted on Weather and PEMS03 data using DLinear [53], RLinear [28], and iTransformer [31] models. Table 3 in the main text shows the summarized results. ", "page_idx": 21}, {"type": "text", "text": "D.3 BSA computational cost analysis ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Table 12 presents a comprehensive analysis of BSA’s computational cost. We measured the model training time (sec/1step), peak memory usage (GB), and the number of parameters (M) for both the base model and the model with BSA applied. The experiments were conducted using the lightweight Weather dataset with 21 channels and the heavy PEMS03 dataset with 358 channels. Tests were performed on Timesnet [48], iTransformer [31], Crossformer [54], and PatchTST [36] models. Linear models were excluded from the experiments as they are very lightweight and their training cost is not an issue. Table 4 in the main text shows the summarized results. ", "page_idx": 21}, {"type": "table", "img_path": "dxyNVEBQMp/tmp/8cff776c41a86ccfd74ae98342793f597aaa0fa0715a70ee28f1c98d300d5633.jpg", "table_caption": ["Table 12: Full result for the model training time (sec/1 step), peak memory usage (GB), and the number of parameters (M) for both the base model and the model with BSA applied. The experiments were conducted using the lightweight Weather dataset with 21 channels and the heavy PEMS03 dataset with 358 channels. Tests were performed on Timesnet, iTransformer, Crossformer, and PatchTST models. "], "table_footnote": [], "page_idx": 22}, {"type": "text", "text": "", "page_idx": 22}, {"type": "text", "text": "D.4 Pre/Post BSA activation signal visualization ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Figure 16 demonstrates the transition between pre-activation $F$ (left) and post-activation $F^{\\prime}$ (right) during the inference process. The figure shows the spectrum of randomly sampled activations from the DLinear model trained with a 720 prediction length on the SWDR $(\\mathrm{W/m})$ channel of the weather dataset. The $\\mathbf{X}$ -axis signifies timesteps while the y-axis indicates frequency. To enhance visibility in the low-frequency region, y-axis values below 0.1 are presented in a log scale, whereas values above 0.1 are depicted in a linear scale. A darkening in the high-frequency region is observed from pre-activation to post-activation, suggesting that the activations may undergo a denoising effect in the high-frequency areas as they pass through the SA-Matrix. ", "page_idx": 22}, {"type": "image", "img_path": "dxyNVEBQMp/tmp/192dbeadc6c9230071e58150c0889a0d8817ce9f3d00d545942184eb1a88bc2d.jpg", "img_caption": ["Figure 9: The 2D heatmaps of the SA-Matrix from the DLinear model finetuned with a 720 prediction length on the Weather dataset. "], "img_footnote": [], "page_idx": 23}, {"type": "image", "img_path": "dxyNVEBQMp/tmp/47ba7bac6edbb960639d77ff5fb96aaac8e7d36a629eee30cc20a75b48889710.jpg", "img_caption": ["Figure 10: The kernel density estimate graphs of the SA-Matrix from the DLinear model finetuned with a 720 prediction length on the Weather dataset and FFT graphs of the data. "], "img_footnote": [], "page_idx": 24}, {"type": "image", "img_path": "dxyNVEBQMp/tmp/2e85d8155f9c26a1ba095af3435150ee2fa035a5fc1508b8ad91b06221819dec.jpg", "img_caption": ["Figure 11: The kernel density estimate graphs of the SA-Matrix from the iTransformer model finetuned with a 720 prediction length on the Weather Data and FFT graphs of the data. "], "img_footnote": [], "page_idx": 25}, {"type": "image", "img_path": "dxyNVEBQMp/tmp/f8661853dc532f8caec84639332198f227f8aa9e80db543f39f62027f63b7635.jpg", "img_caption": [], "img_footnote": [], "page_idx": 26}, {"type": "text", "text": "Figure 12: The kernel density estimate graphs of the SA-Matrix from the DLinear model finetuned with a 720 prediction length on the ETTh1 dataset and FFT graphs of the data. ", "page_idx": 26}, {"type": "image", "img_path": "dxyNVEBQMp/tmp/70c198894d5511bef8222a9bff7f0eb4704c4039119274c832a4a5871fa3289c.jpg", "img_caption": ["Figure 13: The kernel density estimate graphs of the SA-Matrix from the DLinear model finetuned with a 720 prediction length on the ETTm1 dataset and FFT graphs of the data. "], "img_footnote": [], "page_idx": 26}, {"type": "image", "img_path": "dxyNVEBQMp/tmp/12bb2e10ca8dd9b79d614f417b4194cab87d6bad2c3ee3054d1c20a7ba328c3d.jpg", "img_caption": ["Figure 14: The kernel density estimate graphs of LUFL, MULL, OT, and LULL channels of the SA-Matrix from the iTransformer model with a 720 prediction length on the original and synthetic ETTh1 data. Row (a) represents the original data, while rows (b) - (d) display synthetic datasets. These datasets were generated by adding sine waves with periods of 100, 300, and 1000, respectively. "], "img_footnote": [], "page_idx": 27}, {"type": "image", "img_path": "dxyNVEBQMp/tmp/f689f5e329fa96012d25c32a0b774d334b65b63f4fe52b1061320f48b375ade5.jpg", "img_caption": ["Figure 15: The kernel density estimate graphs of the SA-Matrix from the iTransformer model finetuned with a 720 prediction length on the ETTm1 dataset and FFT graphs of the data. "], "img_footnote": [], "page_idx": 27}, {"type": "image", "img_path": "dxyNVEBQMp/tmp/2d73467efb7bca9d8b84a18094e252a213a05ecd1603c10216c646a9de98570d.jpg", "img_caption": ["Figure 16: Illustration of the SWDR $(\\mathrm{W/m})$ channel of the Pre-Activation (left) and Post-Activation (right) through SA-Matrix from the DLinear model trained with a 720 prediction length on the weather dataset. "], "img_footnote": [], "page_idx": 28}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "The checklist is designed to encourage best practices for responsible machine learning research, addressing issues of reproducibility, transparency, research ethics, and societal impact. Do not remove the checklist: The papers not including the checklist will be desk rejected. The checklist should follow the references and precede the (optional) supplemental material. The checklist does NOT count toward the page limit. ", "page_idx": 29}, {"type": "text", "text": "Please read the checklist guidelines carefully for information on how to answer these questions. For each question in the checklist: ", "page_idx": 29}, {"type": "text", "text": "• You should answer [Yes] , [No] , or [NA] .   \n• [NA] means either that the question is Not Applicable for that particular paper or the relevant information is Not Available.   \n• Please provide a short (1–2 sentence) justification right after your answer (even for NA). ", "page_idx": 29}, {"type": "text", "text": "The checklist answers are an integral part of your paper submission. They are visible to the reviewers, area chairs, senior area chairs, and ethics reviewers. You will be asked to also include it (after eventual revisions) with the final version of your paper, and its final version will be published with the paper. ", "page_idx": 29}, {"type": "text", "text": "The reviewers of your paper will be asked to use the checklist as one of the factors in their evaluation. While \"[Yes] \" is generally preferable to \"[No] \", it is perfectly acceptable to answer \"[No] \" provided a proper justification is given (e.g., \"error bars are not reported because it would be too computationally expensive\" or \"we were unable to find the license for the dataset we used\"). In general, answering \"[No] \" or \"[NA] \" is not grounds for rejection. While the questions are phrased in a binary way, we acknowledge that the true answer is often more nuanced, so please just use your best judgment and write a justification to elaborate. All supporting evidence can appear either in the main paper or the supplemental material provided in the appendix. If you answer [Yes] to a question, in the justification please point to the section(s) where related material for the question can be found. ", "page_idx": 29}, {"type": "text", "text": "IMPORTANT, please: ", "page_idx": 29}, {"type": "text", "text": "• Delete this instruction block, but keep the section heading “NeurIPS paper checklist\", • Keep the checklist subsection headings, questions/answers and guidelines below. • Do not modify the questions and only use the provided macros for your answers. ", "page_idx": 29}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 29}, {"type": "text", "text": "Answer:[Yes] ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Justification: The paper’s contributions and scope are well-explained throughout the abstract and introduction, and the entire paper is written to provide a consistent and comprehensive conclusion. ", "page_idx": 29}, {"type": "text", "text": "Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 29}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? Answer: [Yes] ", "page_idx": 29}, {"type": "text", "text": "Justification: Our paper discusses the limitations and future research directions to address them in the conclusion section 5. ", "page_idx": 30}, {"type": "text", "text": "Guidelines: ", "page_idx": 30}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 30}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 30}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 30}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 30}, {"type": "text", "text": "Justification: Our paper proposes a new model architecture and demonstrates its superiority through a practical approach with extensive experiments rather than theoretical proofs. ", "page_idx": 30}, {"type": "text", "text": "Guidelines: ", "page_idx": 30}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 30}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 30}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 30}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 30}, {"type": "text", "text": "Justification: Our paper provides detailed information to reproduce all experiments. Additionally, the complete experiment code will be provided. ", "page_idx": 30}, {"type": "text", "text": "Guidelines: ", "page_idx": 31}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 31}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 31}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Justification: https://github.com/DJLee1208/BSA_2024 ", "page_idx": 31}, {"type": "text", "text": "Guidelines: ", "page_idx": 31}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why. ", "page_idx": 31}, {"type": "text", "text": "• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable). • Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 32}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 32}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 32}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 32}, {"type": "text", "text": "Justification: Our paper provides detailed information about the experiments, including data splits, hyperparameters, how they were chosen, and the type of optimizer, in the main text and the appendix. ", "page_idx": 32}, {"type": "text", "text": "Guidelines: ", "page_idx": 32}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 32}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 32}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 32}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 32}, {"type": "text", "text": "Justification: In the main results, we used a paired t-test to demonstrate the superiority of our methodology and reported the p-value. ", "page_idx": 32}, {"type": "text", "text": "Guidelines: ", "page_idx": 32}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 32}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 32}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 32}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 32}, {"type": "text", "text": "Justification: We reported the types and number of GPUs used in the experiments, as well as the packages used for training. ", "page_idx": 32}, {"type": "text", "text": "Guidelines: ", "page_idx": 33}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 33}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 33}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 33}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 33}, {"type": "text", "text": "Justification: Yes, the research conducted in the paper fully conforms to the NeurIPS Code of Ethics in every respect. We have ensured that all ethical guidelines and standards have been meticulously followed throughout the study. ", "page_idx": 33}, {"type": "text", "text": "Guidelines: ", "page_idx": 33}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 33}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 33}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 33}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 33}, {"type": "text", "text": "Justification: Our paper discusses the potential broader impacts of our research in the conclusion. ", "page_idx": 33}, {"type": "text", "text": "Guidelines: ", "page_idx": 33}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed.   \n• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 33}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 33}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 34}, {"type": "text", "text": "Answer: [NA] . ", "page_idx": 34}, {"type": "text", "text": "Justification: Our model does not pose such risks, and therefore, safeguards for responsible data or model release were not applicable. ", "page_idx": 34}, {"type": "text", "text": "Guidelines: ", "page_idx": 34}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 34}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 34}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 34}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 34}, {"type": "text", "text": "Justification: Yes, we have properly credited the creators or original owners of assets used in the paper, including publicly available models and packages, with accurate citations. ", "page_idx": 34}, {"type": "text", "text": "Guidelines: ", "page_idx": 34}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 34}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 34}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 34}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 34}, {"type": "text", "text": "Justification: This paper does not include new assets. ", "page_idx": 34}, {"type": "text", "text": "Guidelines: ", "page_idx": 34}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used. ", "page_idx": 34}, {"type": "text", "text": "• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 35}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 35}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 35}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 35}, {"type": "text", "text": "Justification: This paper does not involve crowdsourcing. ", "page_idx": 35}, {"type": "text", "text": "Guidelines: ", "page_idx": 35}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 35}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 35}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 35}, {"type": "text", "text": "Answer:[NA] ", "page_idx": 35}, {"type": "text", "text": "Justification: This paper does not involve research with human subjects. ", "page_idx": 35}, {"type": "text", "text": "Guidelines: ", "page_idx": 35}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 35}]