[{"figure_path": "I2gVmVRgNk/tables/tables_7_1.jpg", "caption": "Table 1: Time series forecasting (TSF) tasks: M4-Weekly The values of EVORATE and time series forecasting performance below are experiments on dataset M4-Weekly. Here, short, medium, long, Avg stands for short-horizon SMAPE, medium-horizon SMAPE, long-horizon SMAPE, and the whole average sMAPE.", "description": "This table presents the results of time series forecasting experiments on the M4-Weekly dataset.  It shows the impact of varying the order (k) of the autoregressive model on the forecasting performance, measured by the Symmetric Mean Absolute Percentage Error (sMAPE).  The sMAPE is calculated separately for short, medium, and long forecasting horizons, as well as an overall average.  The table also includes the EVORATE and ForeCA values for each model order. EVORATE quantifies the evolving patterns in the data, while ForeCA measures the forecastibility of the time series.", "section": "6.2 Sequential data's order approximation and feature selection"}, {"figure_path": "I2gVmVRgNk/tables/tables_8_1.jpg", "caption": "Table 2: Time series forecasting (TSF) tasks: The estimated mutual information for the sequential data for different datasets. RMSE (Crypto, Player Traj.)/sMAPE (M4-Monthly, M4-Weekly, M4-Daily) is the performance of one SOTA TSF method [53].", "description": "This table presents a comparison of the estimated mutual information (using EVORATE and ForeCA methods) and the state-of-the-art (SOTA) performance for time series forecasting tasks across various datasets (Crypto, Player Trajectory, M4-Monthly, M4-Weekly, and M4-Daily).  The RMSE (root mean squared error) and sMAPE (symmetric mean absolute percentage error) metrics are used to evaluate the SOTA forecasting model's performance. The table shows that EVORATE generally provides higher mutual information estimates than ForeCA, implying a better ability to capture evolving patterns in sequential data. The SOTA performance varies across different datasets, suggesting that the effectiveness of the model depends on the dataset's characteristics.", "section": "6.2 Sequential data's order approximation and feature selection"}, {"figure_path": "I2gVmVRgNk/tables/tables_8_2.jpg", "caption": "Table 3: The estimated mutual information for the evolving domains for different datasets. The reported results are the average accuracy of the multiple target domains.", "description": "This table presents the estimated mutual information (EVORATEW) and the classification accuracy for both invariant and evolving learning methods across seven different datasets.  The \"ACC_Evo - ACC_Inv\" column shows the improvement in accuracy achieved by using the evolving learning method compared to the invariant learning method. The EVORATEW values provide a quantitative measure of the evolving patterns in each dataset, indicating the suitability of applying evolving learning methods.", "section": "6.4 Control randomness to corrupt evolving patterns"}, {"figure_path": "I2gVmVRgNk/tables/tables_8_3.jpg", "caption": "Table 4: The comparison of the classification accuracy (%) between our and baseline methods across the synthetic and real-world datasets. The reported results are the average accuracy of the multiple target domains.", "description": "This table compares the classification accuracy of the proposed method against several baseline methods across various synthetic and real-world datasets.  The accuracy is averaged across multiple target domains for each dataset, providing a comprehensive comparison of performance.", "section": "6.5 Algorithms to improve performance on EDG tasks"}, {"figure_path": "I2gVmVRgNk/tables/tables_18_1.jpg", "caption": "Table 4: The comparison of the classification accuracy (%) between our and baseline methods across the synthetic and real-world datasets. The reported results are the average accuracy of the multiple target domains.", "description": "This table compares the classification accuracy of the proposed method against several baseline methods across various synthetic and real-world datasets.  The accuracy is averaged across multiple target domains for a comprehensive evaluation.  The results highlight the superior performance of the proposed method compared to the existing state-of-the-art techniques.", "section": "6.5 Algorithms to improve performance on EDG tasks"}, {"figure_path": "I2gVmVRgNk/tables/tables_18_2.jpg", "caption": "Table 6: Rotated Gaussian. We show the results on each target domain by domain index.", "description": "This table presents the classification accuracy results for the Rotated Gaussian dataset in the Evolving Domain Generalization (EDG) task.  The results are broken down by target domain (26-30) and compare different algorithms (MIXUP, IRM, CORAL, DIVA, LSSAE, DRAIN) to the proposed method.  Each algorithm's performance is presented as an average accuracy across multiple runs, with standard deviation indicated.  This allows for a direct comparison of the performance of various domain generalization techniques on this specific dataset in terms of generalization ability.", "section": "6.5 Algorithms to improve performance on EDG tasks"}, {"figure_path": "I2gVmVRgNk/tables/tables_18_3.jpg", "caption": "Table 6: Rotated Gaussian. We show the results on each target domain by domain index.", "description": "This table presents the results of the Rotated Gaussian experiment in the Evolving Domain Generalization (EDG) tasks.  Each column represents a different target domain (numbered 21-30), and each row shows the performance of different algorithms (MIXUP, IRM, CORAL, DIVA, LSSAE, DRAIN, and the proposed method). The values are the average accuracy of each algorithm's performance on that target domain, including standard deviation. The table aims to show how well different algorithms generalize to evolving domains in this specific dataset.", "section": "6.5 Algorithms to improve performance on EDG tasks"}, {"figure_path": "I2gVmVRgNk/tables/tables_20_1.jpg", "caption": "Table 2: Time series forecasting (TSF) tasks: The estimated mutual information for the sequential data for different datasets. RMSE (Crypto, Player Traj.)/sMAPE (M4-Monthly, M4-Weekly, M4-Daily) is the performance of one SOTA TSF method [53].", "description": "This table compares the estimated mutual information (using EVORATE) with the performance of a state-of-the-art (SOTA) time series forecasting method on various datasets (Crypto, Player Traj., M4-Monthly, M4-Weekly, M4-Daily).  The RMSE/SMAPE values represent the error rate of the SOTA method.  The table highlights the relationship between EVORATE scores and forecasting performance across different dataset types.", "section": "6.2 Sequential data's order approximation and feature selection"}]