[{"figure_path": "3NAEowLh7Q/tables/tables_7_1.jpg", "caption": "Table 2: Performance of semantic segmentation on the Scannet dataset compared to LangSplat and LEGaussians based on text query.", "description": "This table presents a quantitative comparison of semantic segmentation performance on the ScanNet dataset.  Three methods are compared: LangSplat, LEGaussians, and the proposed OpenGaussian.  The results are broken down by the number of classes (19, 15, and 10) used for the semantic segmentation task, and both mIoU (mean Intersection over Union) and mAcc (mean Accuracy) are reported.  OpenGaussian shows significantly improved performance compared to the other two methods, highlighting the effectiveness of its proposed approach.", "section": "4.2 Open-Vocabulary Point Cloud Understanding"}, {"figure_path": "3NAEowLh7Q/tables/tables_9_1.jpg", "caption": "Table 4: Association strategy ablation.", "description": "This table presents the ablation study of the association strategies used in the paper.  It compares the performance (mIoU and mAcc) of three different approaches:\n\n1. Using only IoU (Intersection over Union) between 3D instance renderings and SAM masks for association.\n2. Using only feature distance between instance features and pseudo-features for association.\n3. Using both IoU and feature distance for association. \n\nThe results show that combining both IoU and feature distance leads to the best performance, indicating the importance of considering both geometric and semantic information for accurate object association.", "section": "4.4 Ablation Study"}, {"figure_path": "3NAEowLh7Q/tables/tables_9_2.jpg", "caption": "Table 5: Performance of semantic segmentation with various codebook configurations.", "description": "This table presents the results of ablation studies on different codebook configurations for semantic segmentation.  It compares the performance (mIoU and mAcc) of using a single-level codebook with different numbers of clusters (k), a two-level codebook where the coarse level uses only instance features or both instance and spatial features (xyz), and a two-level codebook with different numbers of clusters at both levels.  The results demonstrate the benefits of using a two-level codebook incorporating spatial information for better performance.", "section": "4.4 Ablation Study"}]