[{"figure_path": "yRuJqoWoCs/tables/tables_7_1.jpg", "caption": "Table 2: Comparison of our EPIO model and DeFiNe on ScanNet regarding the use of data augmentation. VCA stands for virtual camera augmentation, and jitter stands for canonical camera jittering.", "description": "This table compares the performance of the proposed Equivariant Perceiver IO (EPIO) model against its non-equivariant baseline, DeFiNe, on the ScanNet dataset.  It specifically investigates the impact of two types of data augmentation techniques: virtual camera augmentation (VCA) and canonical camera jittering. The results are presented in terms of three commonly used metrics for evaluating stereo depth estimation performance: Absolute Relative Error (Abs.Rel.), Root Mean Squared Error (RMSE), and the percentage of pixels with a delta error less than 1.25 (δ < 1.25). By comparing performance across different augmentation strategies, the table aims to showcase the advantages of incorporating equivariance into the model for improving robustness and generalization.", "section": "4.2 Stereo Depth Estimation"}, {"figure_path": "yRuJqoWoCs/tables/tables_8_1.jpg", "caption": "Table 1: Stereo depth estimation results compared with the state-of-the-art: DPSNet [27], NAS [31], IIB [57], DeFine [23], DeMoN [49], DeepMVS [26].", "description": "This table presents a comparison of the proposed Equivariant Perceiver IO (EPIO) model's performance on stereo depth estimation against several state-of-the-art methods.  The results are shown across three standard metrics (Abs.Rel, RMSE, δ<1.25) and three datasets (ScanNet, SUN3D, Scenes11).  It highlights the superior performance of EPIO, particularly on real-world datasets (ScanNet, SUN3D).", "section": "4.2 Stereo Depth Estimation"}, {"figure_path": "yRuJqoWoCs/tables/tables_9_1.jpg", "caption": "Table 3: Ablation study on the choice of positional encoding frequency and decoder architecture.", "description": "This table presents the results of an ablation study conducted to evaluate the impact of different design choices on the performance of the proposed model.  Specifically, it analyzes the effects of removing camera information, using Fourier encodings instead of spherical harmonics, removing the equivariant attention module, varying the maximum order of spherical harmonics (lmax), and using a non-equivariant decoder. The results are reported in terms of three metrics: Absolute Relative error (Abs. Rel.), Root Mean Squared Error (RMSE), and the percentage of pixels with error less than 1.25 (δ < 1.25). The comparison allows for assessing the individual contribution of each component towards achieving state-of-the-art results. ", "section": "4 Experimental Results"}, {"figure_path": "yRuJqoWoCs/tables/tables_23_1.jpg", "caption": "Table 4: Different tasks and their corresponding geometric information in Equivariant Perceiver IO", "description": "This table shows how the proposed Equivariant Perceiver IO (EPIO) architecture can be adapted to various computer vision tasks.  It lists the input data, the type of geometric transformation involved, the type of positional encoding used, the feature embedding method, the query type, and the prediction type for each task.  This illustrates the model's flexibility and generalizability across a range of problems.", "section": "4 Experimental Results"}, {"figure_path": "yRuJqoWoCs/tables/tables_25_1.jpg", "caption": "Table 5: Comparison of our model and Depth Anything", "description": "This table presents a quantitative comparison of the proposed SE(3) Equivariant Perceiver IO model against the Depth Anything model on the ScanNet benchmark.  The metrics used for comparison are Absolute Relative Error (Abs.Rel.), Root Mean Squared Error (RMSE), and the percentage of pixels with error less than 1.25 (δ < 1.25). Lower values of Abs.Rel. and RMSE indicate better accuracy, while a higher value for δ < 1.25 signifies a greater proportion of pixels with accurate depth predictions.  The results demonstrate that the proposed model outperforms Depth Anything on all three metrics.", "section": "4 Experimental Results"}, {"figure_path": "yRuJqoWoCs/tables/tables_25_2.jpg", "caption": "Table 6: Novel View Depth Estimation across a varying number of views.", "description": "This table presents a comparison of depth estimation results obtained using the DeFiNe and the proposed Equivariant Perceiver IO (EPIO) models.  The results are evaluated across different numbers of input views (2, 3, and 4) to illustrate the impact of the number of views on depth estimation accuracy. Lower values indicate better performance.", "section": "4.2 Stereo Depth Estimation"}]