[{"figure_path": "BRZYhVHvSg/tables/tables_9_1.jpg", "caption": "Table 1: Retrieval averaged over 10 queries with 50 retrievals on UTKFace dataset [40] for MOPR, k-NN, and MMR [27]. Entries indicate average percentage representation in retrieved items. MOPR is able to balance representation across classes, whereas k-NN and MMR miss intersectional groups (highlighted in red).", "description": "This table presents the average percentage representation of different demographic groups in the top 50 retrieved items for three different retrieval methods: MOPR, k-NN, and MMR.  The results are averaged over 10 different queries.  The table highlights the ability of MOPR to balance representation across various intersectional groups (combinations of attributes like gender and race), while k-NN and MMR show disproportionate representation of some intersectional groups, indicated in red.", "section": "Numerical Experiments"}, {"figure_path": "BRZYhVHvSg/tables/tables_28_1.jpg", "caption": "Table 1: Retrieval averaged over 10 queries with 50 retrievals on UTKFace dataset [40] for MOPR, k-NN, and MMR [27]. Entries indicate average percentage representation in retrieved items. MOPR is able to balance representation across classes, whereas k-NN and MMR miss intersectional groups (highlighted in red).", "description": "This table compares the performance of three retrieval methods (MOPR, k-NN, and MMR) on the UTKFace dataset in terms of their ability to achieve balanced representation across different demographic groups.  The table shows the percentage representation of each group (male/female, different races) in the top 50 retrieved items for each of the methods, averaged over 10 queries.  The results highlight MOPR's superior ability to balance representation across intersectional groups, unlike the other methods which show imbalances, particularly for minority intersectional groups, indicated in red.", "section": "Numerical Experiments"}, {"figure_path": "BRZYhVHvSg/tables/tables_30_1.jpg", "caption": "Table 1: Retrieval averaged over 10 queries with 50 retrievals on UTKFace dataset [40] for MOPR, k-NN, and MMR [27]. Entries indicate average percentage representation in retrieved items. MOPR is able to balance representation across classes, whereas k-NN and MMR miss intersectional groups (highlighted in red).", "description": "This table presents the average percentage representation of different demographic groups in the top 50 retrieved items for three different retrieval methods: MOPR, k-NN, and MMR, using the UTKFace dataset.  The results are averaged over 10 queries. The table highlights that MOPR effectively balances representation across various demographic groups, whereas k-NN and MMR show significant disparities, particularly for intersectional groups (highlighted in red).", "section": "Numerical Experiments"}, {"figure_path": "BRZYhVHvSg/tables/tables_30_2.jpg", "caption": "Table 1: Retrieval averaged over 10 queries with 50 retrievals on UTKFace dataset [40] for MOPR, k-NN, and MMR [27]. Entries indicate average percentage representation in retrieved items. MOPR is able to balance representation across classes, whereas k-NN and MMR miss intersectional groups (highlighted in red).", "description": "This table presents the average percentage representation of different demographic groups in the top 50 retrieved items for three different retrieval methods: MOPR, k-NN, and MMR.  The UTKFace dataset was used, and the results are averaged over 10 queries.  The table highlights MOPR's ability to achieve a balanced representation across various intersectional groups, while k-NN and MMR methods demonstrate significant shortcomings in this regard, particularly with respect to intersectional groups that are under-represented (highlighted in red).", "section": "Numerical Experiments"}, {"figure_path": "BRZYhVHvSg/tables/tables_31_1.jpg", "caption": "Table 1: Retrieval averaged over 10 queries with 50 retrievals on UTKFace dataset [40] for MOPR, k-NN, and MMR [27]. Entries indicate average percentage representation in retrieved items. MOPR is able to balance representation across classes, whereas k-NN and MMR miss intersectional groups (highlighted in red).", "description": "This table presents the average percentage representation of different demographic groups (male/female, white/black/Asian/Indian/others) in the top 50 retrieved items for three different retrieval methods: MOPR (the proposed method), k-NN (k-Nearest Neighbors), and MMR (Maximal Marginal Relevance).  The results are averaged over 10 queries.  The table highlights that MOPR achieves a more balanced representation across various intersectional groups compared to the other two methods, which tend to miss certain groups.", "section": "Numerical Experiments"}, {"figure_path": "BRZYhVHvSg/tables/tables_31_2.jpg", "caption": "Table 1: Retrieval averaged over 10 queries with 50 retrievals on UTKFace dataset [40] for MOPR, k-NN, and MMR [27]. Entries indicate average percentage representation in retrieved items. MOPR is able to balance representation across classes, whereas k-NN and MMR miss intersectional groups (highlighted in red).", "description": "This table presents the average percentage representation of different demographic groups in the top 50 retrieved items for three different retrieval methods: MOPR, k-NN, and MMR.  The UTKFace dataset [40] was used.  The table shows that MOPR effectively balances representation across various demographic groups, while k-NN and MMR show a disproportionate representation of certain intersectional groups (highlighted in red). This demonstrates MOPR's ability to improve fairness and inclusivity in retrieval systems.", "section": "Numerical Experiments"}]