[{"figure_path": "fjLCqicn64/figures/figures_1_1.jpg", "caption": "Figure 1: An illustration of long-range dependencies and short-range dependencies within human brain.", "description": "This figure illustrates the concept of short-range and long-range dependencies in brain networks. The left panel shows a simplified representation of the human brain, divided into regions with different colors representing different brain regions of interest (ROIs).  Nodes (dots) within each region represent specific areas within that region. The right panel depicts a brain graph where nodes represent ROIs and edges represent the connections between them. The black solid lines represent short-range connections within nearby ROIs (local connectivity). Dashed and colored arcs show long-range connections bridging distant ROIs. This visual representation highlights that brain communication involves both local interactions and extensive long-distance connections crucial for integrating information across the entire brain.", "section": "1 Introduction"}, {"figure_path": "fjLCqicn64/figures/figures_3_1.jpg", "caption": "Figure 2: The overall framework of the proposed ALTER.", "description": "The figure illustrates the overall framework of the proposed ALTER model for brain network analysis. It shows the process of extracting node features and adjacency matrix from fMRI data, calculating adaptive factors, performing adaptive long-range encoding using biased random walks based on the adaptive factors, injecting the long-range embeddings into a transformer framework, integrating short- and long-range dependencies using the self-attention mechanism, and generating the graph-level representation for downstream tasks such as neurological disease diagnosis. The figure visually represents the data flow and processing stages of the ALTER model.", "section": "3 Method"}, {"figure_path": "fjLCqicn64/figures/figures_8_1.jpg", "caption": "Figure 3: Performance comparison with varying readout functions (%).", "description": "This figure compares the performance of different readout functions (Average, Max, Sum, Sort, Clustering) in three different model architectures (ALTER, Graphormer, and SAN) with and without the Adaptive Long-range Aware (ALGA) strategy.  The y-axis represents the AUC (Area Under the Curve), a metric used to evaluate the performance of a classification model.  The results show that the ALGA strategy consistently improves the AUC across all readout functions and model architectures, indicating its effectiveness in improving model performance.", "section": "4.3 Ablation Study"}, {"figure_path": "fjLCqicn64/figures/figures_9_1.jpg", "caption": "Figure 4: In-depth analysis of ALTER and adaptive long-range aware strategy.", "description": "This figure presents an in-depth analysis of the ALTER model and its adaptive long-range aware (ALGA) strategy. Subfigure (a) shows the impact of the number of hops in the ALGA strategy on the model's performance, demonstrating that increasing the number of hops generally improves the model's predictive power for both ABIDE and ADNI datasets.  Subfigure (b) displays an attention heatmap illustrating the communication patterns between brain regions of interest (ROIs). Subfigure (c) shows an example brain graph used in the analysis, highlighting long-range dependencies captured by the ALTER model.", "section": "4.4 In-depth Analysis of ALTER and ALGA Strategy"}, {"figure_path": "fjLCqicn64/figures/figures_14_1.jpg", "caption": "Figure 2: The overall framework of the proposed ALTER.", "description": "This figure shows the overall framework of the proposed ALTER model.  It details the process, starting with fMRI data as input, through the calculation of adaptive factors, the adaptive long-range encoding using a biased random walk, injecting those long-range embeddings into a transformer framework, and finally using a readout function to produce the final output for downstream tasks such as neurological disease diagnosis. The diagram visually represents the flow of information and the key components of the ALTER model.", "section": "3 Method"}, {"figure_path": "fjLCqicn64/figures/figures_15_1.jpg", "caption": "Figure 2: The overall framework of the proposed ALTER.", "description": "This figure illustrates the overall framework of the Adaptive Long-range aware TransformER (ALTER) model.  It shows the process flow, starting with fMRI data as input. Adaptive factors (FG) are calculated from the fMRI data to represent communication strength between brain Regions of Interest (ROIs).  These factors are used in an adaptive long-range encoding process to generate long-range dependency embeddings (EG). These embeddings are concatenated with the original node features (XG) and fed into a long-range aware transformer. The transformer incorporates both short- and long-range dependencies and produces a graph-level representation (ZG) used for downstream tasks (e.g., disease prediction).", "section": "3 Method"}]