[{"figure_path": "prgxz9fYbf/figures/figures_7_1.jpg", "caption": "Figure 1: Effects of different regularisation methods on Gram matrix condition number, in the toy binary classification problem trained for 2000 epochs. The left plot shows the condition numbers when different amounts of stochastic kernel regularisation (γ) are applied. The middle and right plots show the condition numbers when the coefficient v of the KL regularisation terms are varied, with and without a Taylor approximation, respectively.", "description": "This figure displays the effects of different regularization methods on the condition number of Gram matrices in a toy binary classification problem. Three plots illustrate the impacts of stochastic kernel regularization (γ), the KL regularization coefficient (v) with and without Taylor approximation on the Gram matrix's condition number over 2000 training epochs. The results show how these methods impact the stability of the Gram matrices during training.", "section": "4.2 Effects of regularisation on Gram matrix condition number"}, {"figure_path": "prgxz9fYbf/figures/figures_17_1.jpg", "caption": "Figure 2: Effects of stochastic kernel regularisation on Gram matrix condition number strength, in the toy binary classification problem trained for 10000 epochs. See Section 4.2.", "description": "This figure displays the effects of different strengths of stochastic kernel regularization (SKR) on the condition number of Gram matrices over 10,000 training epochs.  The condition number measures the sensitivity of a matrix to small changes, with higher values indicating greater instability.  The plot shows how varying the gamma (γ) parameter, which controls the SKR strength, affects the condition number's trajectory.  Different gamma values are compared: γ = ∞ (no SKR), γ = Pℓ, γ = Pℓ/10, and γ = Pℓ/100, where Pℓ represents the number of inducing points at a layer. The graph demonstrates how increasing the strength of SKR (decreasing gamma) helps maintain lower and more stable condition numbers, thereby improving the numerical stability of the model during training.", "section": "4.2 Effects of regularisation on Gram matrix condition number"}]