[{"figure_path": "gW0znG5JCG/figures/figures_0_1.jpg", "caption": "Figure 1: Within a cell, there are two types of relationships among genes.", "description": "This figure illustrates the two types of relationships that can exist between genes within a single cell.  Associating relationships (blue lines) represent genes that tend to co-occur, meaning they are frequently expressed together within the same cell.  Dissociating relationships (red lines) represent genes that tend to avoid co-occurrence; when one is expressed, the other is less likely to be expressed.  This concept is key to the paper's proposed method for scRNA-seq data imputation, which incorporates both associating and dissociating gene relationships.", "section": "Abstract"}, {"figure_path": "gW0znG5JCG/figures/figures_2_1.jpg", "caption": "Figure 2: A brief overview of Single-Cell Complete Relationship (scCR).", "description": "The figure provides a visual overview of the Single-Cell Complete Relationship (scCR) method. It shows the three main stages of the method: pre-imputation, complete relationship, and denoising.  Each stage involves specific steps such as k-NN graph construction, feature propagation, and standardization.  The figure highlights how the method integrates both associating and dissociating gene-gene relationships to improve imputation accuracy.", "section": "4 Proposed Method"}, {"figure_path": "gW0znG5JCG/figures/figures_3_1.jpg", "caption": "Figure 3: A subset of the gene expression matrix in the Baron Human dataset.", "description": "This figure shows a heatmap of a subset of the gene expression matrix from the Baron Human dataset. It visually represents the expression levels of several genes across different cells. The color intensity corresponds to the expression level, with darker shades indicating lower expression and brighter shades indicating higher expression.  The figure highlights the variability in gene expression across different genes and cells, illustrating the complexity of single-cell RNA sequencing data and the need for imputation techniques to deal with missing or noisy values.", "section": "4.3 Complete Relationship Stage"}, {"figure_path": "gW0znG5JCG/figures/figures_4_1.jpg", "caption": "Figure 4: An illustration of the concatenation and standardization processes in the complete relationship stage. Std denotes standard deviation.", "description": "This figure illustrates the two main steps involved in the complete relationship stage of the scCR imputation method.  First, concatenation combines the original cell-gene matrix X(1) with its negative counterpart [-X(1)] to create Xcom. This step is crucial for incorporating both associating and dissociating gene relationships.  Second, column-wise standardization normalizes the values for each gene in Xcom, ensuring that the data across genes has a standard normal distribution with a mean of 0 and a standard deviation of 1.  This process is key for making the subsequent propagation step more effective and preventing the values from various genes dominating the imputation process. The end result is a standardized matrix Xcom, ready for further processing within the scCR framework.", "section": "4.3 Complete Relationship Stage"}, {"figure_path": "gW0znG5JCG/figures/figures_6_1.jpg", "caption": "Figure 5: Performance on dropout recovery, measured by RMSE. Figures highlighted in green indicate reduction rates from the most competitive baseline at each setting.", "description": "This figure displays the RMSE (Root Mean Square Error) for dropout recovery across six scRNA-seq datasets (Baron Mouse, Pancreas, Mouse Bladder, Zeisel, Worm Neuron, Baron Human) and eight different methods (DCA, AutoClass, scGNN 2.0, scGCL, MAGIC, scFP, scBFP, and scCR).  The x-axis represents the dropout rate (20%, 40%, 80%), and the y-axis represents the RMSE.  Green highlights indicate that scCR outperforms the best-performing baseline for that specific dataset and dropout rate.  The graph shows that scCR consistently achieves lower RMSE values across all datasets and dropout rates, demonstrating its effectiveness in recovering missing data.", "section": "5.2 Results"}, {"figure_path": "gW0znG5JCG/figures/figures_7_1.jpg", "caption": "Figure 6: UMAP visualization using the Baron Human dataset, comparing scCR with the three most competitive imputation methods. The first row shows the visualization of the raw data and their imputed results. The second row displays the visualization of data subjected to an 80% dropout rate and their imputed results.", "description": "This figure uses UMAP to visualize the results of scCR and three other imputation methods (DCA, scFP, scBFP) on the Baron Human dataset.  It compares the visualizations of the raw data with those imputed using each method. A second row shows the same comparison, but with 80% of the data randomly removed (simulating dropouts) before imputation.  The visualization allows for a visual comparison of the different methods' abilities to recover the structure of the data in the presence of noise and missing values.", "section": "5.2 Results"}, {"figure_path": "gW0znG5JCG/figures/figures_7_2.jpg", "caption": "Figure 7: The first row indicates the percentages of associating and dissociating gene-gene relationships in datasets. The second and third rows represents the percentages of associating and dissociating relationships within a gene-gene k-NN graph in each method.", "description": "This figure compares the proportion of associating and dissociating gene-gene relationships in six scRNA-seq datasets. It shows the actual ratios in the datasets (first row), and then the ratios captured by scBFP and scCR using their respective k-NN graph constructions (second and third rows). The results highlight scCR's ability to better capture both associating and dissociating relationships compared to scBFP.", "section": "5.2 Results"}, {"figure_path": "gW0znG5JCG/figures/figures_8_1.jpg", "caption": "Figure 8: Running time comparison of scCR and baselines according to the number of cells.", "description": "This figure shows the running time of scCR and other state-of-the-art imputation methods (DCA, AutoClass, scGNN 2.0, scGCL, MAGIC, scFP, and scBFP) as a function of the number of cells in the dataset.  It demonstrates the computational efficiency of scCR compared to other methods, especially as the number of cells increases. The y-axis represents running time in seconds, while the x-axis represents the number of cells.", "section": "5 Experiments"}, {"figure_path": "gW0znG5JCG/figures/figures_19_1.jpg", "caption": "Figure 3: A subset of the gene expression matrix in the Baron Human dataset.", "description": "This figure shows a heatmap visualization of a subset of the gene expression matrix from the Baron Human dataset.  It highlights the varying scales of gene expression across different genes.  The color intensity represents the expression level, demonstrating that the distributions of expression values differ greatly between genes, even within the same dataset. This visual representation emphasizes the heterogeneity of gene expression levels in single-cell RNA sequencing data, which is addressed by the standardization step in the proposed scCR method.", "section": "4.3 Complete Relationship Stage"}, {"figure_path": "gW0znG5JCG/figures/figures_20_1.jpg", "caption": "Figure 10: Performance on dropout recovery, measured by L1 Median Distance. Figures highlighted in green indicate reduction rates from the most competitive baseline at each setting.", "description": "This figure shows the performance comparison of different imputation methods on dropout recovery, measured by the Median L1 Distance metric. The results are shown for six different scRNA-seq datasets (Baron Mouse, Pancreas, Mouse Bladder, Zeisel, Worm Neuron, and Baron Human) and for three different dropout rates (20%, 40%, and 80%). The figure highlights the reduction rates achieved by scCR compared to the best-performing baseline method for each dataset and dropout rate.", "section": "H.2 Dropout Recovery"}]