[{"figure_path": "mtBmKqyqGS/figures/figures_0_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows several examples of image and video generation results using Phased Consistency Models (PCMs). The left side shows text-to-image generation results with different numbers of steps (1, 2, 4, 8, 16 steps). The right side shows text-to-video generation results with 2 steps. Each image and video shows a different prompt and demonstrates the model's ability to generate high-quality and diverse samples, even in a small number of steps.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_1_1.jpg", "caption": "Figure 2: Summative motivation. We observe and summarize three crucial limitations for (latent) consistency models, and generalize the design space, well tackling all these limitations.", "description": "This figure shows three key limitations of Latent Consistency Models (LCMs) and how the proposed Phased Consistency Models (PCMs) address them.  The limitations highlighted are inconsistencies in results across different inference steps (blurriness at low and high steps), limited controllability (CFG values restricted, insensitivity to negative prompts), and inefficiency (poor performance at few-step generation).  Each limitation is demonstrated with examples comparing LCM and PCM results.", "section": "Introduction"}, {"figure_path": "mtBmKqyqGS/figures/figures_2_1.jpg", "caption": "Figure 3: (Left) Illustrative comparison of diffusion models [15], consistency models [56], consistency trajectory models [21], and our phased consistency model. (Right) Simplified visualization of the forward SDE and reverse-time PF-ODE trajectories.", "description": "This figure provides a visual comparison of four different types of diffusion models: standard diffusion models, consistency models, consistency trajectory models, and phased consistency models (PCMs). The left panel shows how each model approaches the task of fitting the data distribution. The right panel shows a simplified illustration of the forward stochastic differential equation (SDE) and the reverse-time probability flow ordinary differential equation (PF-ODE) trajectories. The figure highlights the key differences between the models and shows how PCMs address some of the limitations of previous models.", "section": "2 Preliminaries"}, {"figure_path": "mtBmKqyqGS/figures/figures_3_1.jpg", "caption": "Figure 4: Training paradigm of PCMs. ‘?’ means optional usage.", "description": "This figure illustrates the training process of Phased Consistency Models (PCMs). It shows how the model is trained by combining multiple ODE sub-trajectories and how the self-consistency property is enforced on each sub-trajectory. The figure also shows the optional use of classifier-free guidance (CFG) during training. The figure includes an encoder, an ODE solver, a discriminator, and an EMA update module. It also shows how the ODE trajectory is split into multiple sub-trajectories.", "section": "3 Method"}, {"figure_path": "mtBmKqyqGS/figures/figures_5_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows image and video generation results using Phased Consistency Models (PCMs) with different numbers of steps (1, 2, 4, 8, 16).  It demonstrates the ability of PCMs to generate high-quality images and videos with fewer steps than traditional methods.  The left side shows text-to-image generation, and the right side shows text-to-video generation.  The results highlight the model's stability and speed across various inference steps.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_9_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure demonstrates the effectiveness of Phased Consistency Models (PCMs) in generating high-quality images and videos. It shows examples of images and videos generated using PCMs with different numbers of steps (1-step, 2-step, 4-step, 8-step, 16-step). The results highlight PCM's ability to produce stable and fast generation across various step settings, outperforming existing methods in both image and video generation.", "section": "Introduction"}, {"figure_path": "mtBmKqyqGS/figures/figures_25_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure demonstrates the phased consistency model's (PCM) ability to generate stable and high-quality images and videos across various numbers of steps (1, 2, 4, 8, 16).  It visually compares the results of PCM with those of other methods across different inference step settings, showcasing its superior performance in image and video generation. The left panel demonstrates text-to-image generation and the right shows text-to-video generation.", "section": "Introduction"}, {"figure_path": "mtBmKqyqGS/figures/figures_27_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows examples of image and video generation results using Phased Consistency Models (PCMs).  The left side demonstrates text-to-image generation, showcasing the consistency of results across different numbers of sampling steps (1-step, 2-step, 4-step, 8-step, 16-step). The right side shows text-to-video generation, highlighting PCM's ability to produce stable and high-quality videos with fewer steps.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_27_2.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows the results of image and video generation using Phased Consistency Models (PCMs) with different numbers of steps (1-step, 2-step, 4-step, 8-step, 16-step).  It visually demonstrates the model's ability to generate high-quality images and videos efficiently, even with a small number of steps. The results include both text-to-image and text-to-video generation examples, showcasing the versatility of the PCM approach.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_28_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows the results of image and video generation using Phased Consistency Models (PCMs) with different numbers of steps.  The left side demonstrates image generation, showcasing improvements in stability and speed compared to existing methods.  The right side illustrates video generation, highlighting the model's ability to produce high-quality videos in fewer steps. The figure visually demonstrates one of the paper's main contributions: creating a method for stable and efficient image and video generation.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_28_2.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows several image and video generation results using Phased Consistency Models (PCMs).  It visually demonstrates the model's ability to generate stable and high-quality results across different numbers of steps (1-step, 2-step, 4-step, 8-step, and 16-step) for both image and video generation.  The samples show a variety of subjects and styles, highlighting the versatility of the PCM approach.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_29_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows examples of image and video generation results using Phased Consistency Models (PCMs).  The top row demonstrates text-to-image generation with different numbers of steps (8-step, 4-step, 2-step, and 1-step). The bottom row shows text-to-video generation results with 2-step and 16-step.  It visually demonstrates the ability of PCMs to produce stable and high-quality results even with fewer steps than traditional methods.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_29_2.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows the results of image and video generation using Phased Consistency Models (PCMs).  It visually demonstrates the ability of PCMs to produce stable and high-quality results across different numbers of generation steps (1-step, 2-step, 4-step, 8-step, 16-step), for both image and video generation. The results suggest that PCMs are efficient at generating high-quality results, even with fewer steps, compared to other methods. This figure is a visual summary of the effectiveness and efficiency of the PCM approach.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_30_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows the results of image and video generation using Phased Consistency Models (PCMs).  The top row demonstrates text-to-image generation with 1, 2, 4, and 8 steps. The bottom row demonstrates text-to-video generation with 2 and 16 steps. The figure highlights the stability and speed of PCMs in generating high-quality images and videos.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_30_2.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure showcases the results of Phased Consistency Models (PCMs) in generating both images and videos.  It visually demonstrates the stable and fast generation capabilities of the model, highlighting improvements over existing methods, especially in the context of multi-step generation. The figure includes examples of image generation at 1, 2, 4, and 8 steps for text-to-image and 2, 8, and 16 steps for text-to-video, offering a visual comparison of the model's output at varying stages of the generative process. The visual comparison highlights the speed and stability offered by PCMs.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_31_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows the results of image and video generation using Phased Consistency Models (PCMs). The left side shows the image generation results with different numbers of steps (1-step, 2-step, 4-step, 8-step, 16-step) using PCMs.  The right side shows the video generation results with 2-step and 16-step PCMs. The figure highlights the stability and speed of image and video generation achieved by PCMs.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_32_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows the results of image and video generation using Phased Consistency Models (PCMs).  The top row shows results of text-to-image generation with different numbers of steps (8, 4, 2, and 1). The bottom row shows results of text-to-video generation with different numbers of steps (16, 2). The images showcase the improved stability and speed offered by the PCM model compared to previous methods.  The improved consistency is visible as the image and video quality remain high even when using only a few steps in the generation process.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_33_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure showcases the results of Phased Consistency Models (PCMs) on image and video generation.  It visually compares the outputs of PCMs with different numbers of steps (1-step, 2-step, 4-step, 8-step, and 16-step) for both image and video generation. The image generation examples demonstrate the consistency and quality of images generated at various steps, highlighting PCM's ability to produce high-quality results even with fewer steps. The video generation examples show the temporal consistency and smoothness of the video generated by PCMs. Overall, the figure illustrates PCM's efficiency and effectiveness in producing stable and high-quality outputs for both image and video generation tasks.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_33_2.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows examples of image and video generation results using Phased Consistency Models (PCMs).  The top row showcases text-to-image generation, demonstrating the model's ability to produce stable and high-quality images across various numbers of generation steps (1-step to 16-step). The bottom row shows text-to-video generation, highlighting the model's capacity to generate coherent and smooth videos. The visual comparison aims to illustrate PCM's effectiveness in creating consistent results across different generation settings, emphasizing its speed and stability.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_33_3.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows examples of image and video generation results obtained using Phased Consistency Models (PCMs).  The top row displays image generation results across different numbers of steps (8-step, 4-step, 2-step, 1-step) using the PCM, illustrating that the PCM can produce relatively stable and consistent image outputs irrespective of the number of steps. The bottom row shows video generation results in the text-to-video scenario using a 2-step PCM, indicating that the model can generate high-quality videos at a speed that significantly surpasses previous methods.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_34_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure showcases the results of Phased Consistency Models (PCMs) in generating both images and videos.  It visually demonstrates the model's ability to produce stable and high-quality outputs even with a reduced number of generation steps (1-step to 16-step). The left side shows image generation results across various step numbers and the right side shows video generation results.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_35_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows examples of image and video generation results using Phased Consistency Models (PCMs).  It visually demonstrates the model's ability to produce stable and high-quality outputs across various inference steps (1-step, 2-step, 4-step, 8-step, 16-step), showcasing its speed and efficiency compared to previous methods. Both image and video generations are presented, highlighting the versatility of PCMs.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_35_2.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows the results of image and video generation using Phased Consistency Models (PCMs).  The left side demonstrates image generation with various numbers of steps (1-step, 2-step, 4-step, 8-step, 16-step), showcasing the model's ability to produce stable and high-quality images even with fewer steps. The right side shows a similar comparison for video generation, highlighting PCMs' effectiveness in producing coherent and temporally consistent videos.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_35_3.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure showcases the results of Phased Consistency Models (PCMs) in both image and video generation.  It visually compares the image generation quality across different numbers of steps (1, 2, 4, 8, 16) using PCMs. The figure also demonstrates PCM's applicability to video generation, displaying example results of text-to-video generation.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_35_4.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows the results of image and video generation using Phased Consistency Models (PCMs). The left side shows the image generation results for different numbers of steps (1-step, 2-step, 4-step, 8-step, 16-step) comparing PCM with other methods. The right side shows video generation results comparing PCMs with other methods.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_35_5.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows the results of image and video generation using Phased Consistency Models (PCMs).  It visually demonstrates the model's ability to produce stable and high-quality results across various numbers of generation steps (1-step, 2-step, 4-step, 8-step, and 16-step), both for images and videos.  The images highlight the model's performance on generating diverse subjects such as animals and people. The video results showcase the temporal consistency and quality of the generated video sequences. The figure provides a clear visual summary of the model's capabilities.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_36_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows image and video generation results from the proposed Phased Consistency Models (PCMs).  It demonstrates the ability of PCMs to generate stable and high-quality images and videos across various numbers of inference steps (1-step, 2-step, 4-step, 8-step, 16-step), showcasing improvements in stability and speed compared to previous methods. The image and video generation examples visually represent the model's performance in handling different prompts and generating consistent outputs, even at lower inference steps.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_36_2.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows the results of image and video generation using Phased Consistency Models (PCMs). The left side shows image generation results with different numbers of steps (1, 2, 4, 8, 16 steps), demonstrating the stability and speed of the method. The right side shows video generation results, showcasing its versatility and state-of-the-art performance in generating high-quality videos.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_36_3.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure showcases the results of Phased Consistency Models (PCMs) in image and video generation.  It visually compares the results across different numbers of sampling steps (1-step, 2-step, 4-step, 8-step, 16-step) for both image and video generation, highlighting the model's ability to produce stable and high-quality results even with fewer steps than traditional methods. The left side shows text-to-image generation, while the right shows text-to-video generation, demonstrating the versatility of the PCM approach.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_36_4.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows the results of image and video generation using Phased Consistency Models (PCMs).  The top row shows image generation results, comparing the quality and consistency across different numbers of sampling steps (8-step, 4-step, 2-step, 1-step). The bottom row showcases the application of PCMs to video generation, illustrating the generation quality of video at 2-step and 16-step.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_36_5.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure showcases the results of Phased Consistency Models (PCMs) in generating both images and videos. It presents multiple image samples generated using PCMs with varying inference steps (1-step, 2-step, 4-step, 8-step, and 16-step), demonstrating the model's stability and speed across different settings. Additionally, it includes examples of video generation using PCMs, highlighting the model's effectiveness in producing coherent and high-quality video outputs.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_37_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure demonstrates the capability of Phased Consistency Models (PCMs) in generating high-quality images and videos efficiently. It showcases the results of PCMs across different numbers of generation steps (1-step, 2-step, 4-step, 8-step, 16-step) for both image and video generation. The image generation examples exhibit consistency across various numbers of steps, with improvements in quality and stability as the number of steps increases. The video generation examples show the models' ability to create fluent and visually appealing videos, suggesting the effectiveness of PCMs in generating video data.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_38_1.jpg", "caption": "Figure 21: PCM generation 2-step results with Stable-Diffusion v1-5.", "description": "This figure shows a collage of images generated using the Phased Consistency Model (PCM) with Stable Diffusion v1-5, showcasing the model's ability to generate diverse and high-quality images in just two steps.  The images depict a range of subjects and styles, highlighting the versatility of the PCM.", "section": "VII More Generation Results"}, {"figure_path": "mtBmKqyqGS/figures/figures_39_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure showcases the results of the Phased Consistency Model (PCM) for both image and video generation.  The left side demonstrates image generation with varying numbers of steps (1, 2, 4, 8, 16), highlighting the model's ability to produce consistent and high-quality images regardless of the number of steps. The right side illustrates text-to-video generation, demonstrating PCM's capability to generate stable and high-quality videos in a few steps. The figure visually supports the paper's claim that PCM improves both speed and stability of generation compared to existing methods.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_40_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows the results of image and video generation using Phased Consistency Models (PCMs).  The left side displays image generation results at different numbers of steps (1, 2, 4, 8, 16-step), demonstrating improved stability and speed compared to existing Latent Consistency Models (LCMs). The right side shows video generation results from text prompts, highlighting PCM's versatility and state-of-the-art performance in few-step video generation.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_41_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure demonstrates the capabilities of Phased Consistency Models (PCMs) in generating high-quality images and videos. It showcases examples of image generation with different numbers of steps (1-step, 2-step, 4-step, 8-step, 16-step), highlighting the model's ability to produce stable and consistent results across varying step counts.  Furthermore, it includes examples of text-to-video generation, showing PCMs' versatility in handling different modalities.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_42_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure demonstrates the capability of Phased Consistency Models (PCMs) to generate both high-quality images and videos efficiently.  It shows examples of image generation with different numbers of steps (1-step, 2-step, 4-step, 8-step, and 16-step) using PCMs, highlighting the model's ability to achieve stable and fast generation even with fewer steps. The video generation results further showcase the versatility and state-of-the-art performance of PCMs in producing high-quality video outputs. ", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_43_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows examples of images and videos generated using Phased Consistency Models (PCMs).  The left side displays images generated from text prompts, showcasing the model's ability to produce stable and high-quality results across various numbers of steps in the generation process (1-step, 2-step, 4-step, 8-step, 16-step).  The right side demonstrates the application of PCMs to video generation, highlighting the model's capability to produce coherent and visually appealing video output.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_44_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows examples of image and video generation results obtained using Phased Consistency Models (PCMs).  The left side showcases text-to-image generation results at various step counts (1, 2, 4, 8, and 16 steps), demonstrating the model's ability to produce high-quality images with fewer steps than traditional methods. The right side displays results of text-to-video generation, showcasing the method's versatility across different video generation tasks. Overall, this figure visually demonstrates the speed and stability of PCMs compared to other methods in generating both images and videos.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_45_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure showcases the capabilities of Phased Consistency Models (PCMs) in generating high-quality images and videos.  It visually compares the results of PCMs against other methods (LCMs) across various numbers of generation steps (1-step, 2-step, 4-step, 8-step, and 16-step). The results demonstrate PCM's ability to produce stable and high-quality outputs even with a smaller number of steps, improving both speed and visual fidelity, especially evident in the text-to-video generation examples.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_46_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure showcases the capabilities of Phased Consistency Models (PCMs) in generating both images and videos.  The left side shows image generation results, demonstrating improvements in speed and stability across different numbers of sampling steps (1-step, 2-step, 4-step, 8-step, 16-step). The right side illustrates PCM's application to video generation, also highlighting faster and more consistent results compared to traditional methods.  The overall message is that PCMs lead to better and faster image and video generation across a variety of parameters.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_47_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows examples of images and videos generated using Phased Consistency Models (PCMs). The left side shows images generated from text prompts, demonstrating the model's ability to produce high-quality and consistent results across different numbers of sampling steps. The right side shows videos generated using PCMs, showcasing the model's capability for video generation.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_48_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows examples of image and video generation results using Phased Consistency Models (PCMs).  The left side displays various image generation results with different numbers of steps (8-step, 4-step, 2-step, 1-step) showcasing image stability and quality across different inference steps. The right side showcases the model's capabilities in text-to-video generation, demonstrating stable and fast video generation across various inference steps (16-step, 2-step). This visually demonstrates the key advantage of PCMs in generating stable results even with a small number of steps.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_49_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows the results of image and video generation using Phased Consistency Models (PCMs).  The left side displays image generation results comparing PCMs with different numbers of steps (8-step, 4-step, 2-step, 1-step) against a standard Latent Consistency Model (LCM) of similar design.  The right side shows video generation results using PCMs (16-step, 2-step) for text-to-video generation.  The overall message is that PCMs produce stable results across various step sizes, unlike LCMs, and are suitable for both image and video generation.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_49_2.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure showcases the results of Phased Consistency Models (PCMs) in generating both images and videos.  It displays examples generated using different numbers of steps (1, 2, 4, 8, 16 steps) for both image and video generation, highlighting the model's ability to produce stable and high-quality results even with fewer steps compared to previous methods.  The images demonstrate the model's capacity for text-to-image generation, while the video examples illustrate its capability for text-to-video generation.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_50_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows examples of image and video generation results using Phased Consistency Models (PCMs).  The top row showcases text-to-image generation with different numbers of steps in the generation process (8-step, 4-step, 2-step, 1-step). The bottom row shows text-to-video generation using PCMs.  The results illustrate the model's ability to produce high-quality outputs efficiently, even with a reduced number of steps.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_50_2.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows image and video generation results using Phased Consistency Models (PCMs).  It visually demonstrates the model's ability to produce stable and high-quality results across various numbers of generation steps (1-step, 2-step, 4-step, 8-step, 16-step), showcasing improvements in consistency and speed over existing methods. The top row displays image generation from text prompts, while the bottom showcases video generation, highlighting the model's versatility.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_51_1.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows visual examples of image and video generation using Phased Consistency Models (PCMs).  The top row showcases image generation with different numbers of steps (1-step, 2-step, 4-step, 8-step, 16-step) demonstrating the stable and fast generation capabilities of the model. The bottom row displays video generation results, further highlighting the model's versatility and efficiency. The overall caption emphasizes the model's ability to achieve stable and fast image and video generation.", "section": "Abstract"}, {"figure_path": "mtBmKqyqGS/figures/figures_51_2.jpg", "caption": "Figure 1: PCMs: Towards stable and fast image and video generation.", "description": "This figure shows the results of image and video generation using Phased Consistency Models (PCMs). It demonstrates that PCMs are able to generate stable and high-quality images and videos even with a small number of steps. This is in contrast to previous methods, which often produce blurry or inconsistent results.", "section": "Abstract"}]