[{"figure_path": "p50Dyqk0GX/tables/tables_7_1.jpg", "caption": "Table 1: ID and OOD performances of DRM and baselines methods on CLIP ViT-B/16, with and without WiSE-FT. Best performances are highlighted in bold. For IMAGENET, we report the average performance over its 5 OOD test sets. Results on individual test sets are provided in Appendix E.1.", "description": "This table presents the in-distribution (ID) and out-of-distribution (OOD) performance of the Dual Risk Minimization (DRM) method and several baseline methods on the CLIP ViT-B/16 model.  The results are shown for the ImageNet dataset (with five OOD variations) and two WILDS datasets: iWildCam and FMoW.  WiSE-FT (weight-space averaging) is also applied as a post-processing step, and results are reported both with and without its application.  The best performing method for each metric is highlighted in bold.", "section": "5.2 Main results"}, {"figure_path": "p50Dyqk0GX/tables/tables_7_2.jpg", "caption": "Table 2: ID and OOD performances of DRM and FLYP on two larger CLIP models.", "description": "This table presents the in-distribution (ID) and out-of-distribution (OOD) performance results for two larger CLIP models (ViT-L/14 and ViT-L/14@336) using two methods: FLYP and DRM.  The performance is evaluated across three benchmark datasets: ImageNet, iWildCam, and FMoW.  For each dataset, the ID and OOD accuracy (or macro F1 score) are reported for both methods. This allows comparison of the relative performance improvements provided by DRM over FLYP on larger models.", "section": "5.2 Main results"}, {"figure_path": "p50Dyqk0GX/tables/tables_8_1.jpg", "caption": "Table 3: Results of ablation studies on DRM with CLIP ViT-L/14 performance and IWILDCAM. We use \"df\" and \"cd\" to denote the type of text prompts used to produce model predictions. \"dual\" refers to the mixture model (10) for inference. “–” means the corresponding loss term is not in use.", "description": "This table presents the ablation study results performed on the iWildCam dataset using the CLIP ViT-L/14 model without WiSE-FT.  It systematically investigates the impact of different design choices within the Dual Risk Minimization (DRM) framework on both In-distribution (ID) and Out-of-distribution (OOD) performance. The table explores variations in using dual prompts for ERM and WRM, and also evaluates the effects of including affinity normalization, testing individual loss terms (ERM or WRM only), and comparing different inference strategies (using a combination of ERM and WRM outputs or using only one).", "section": "5.3 Ablation study"}, {"figure_path": "p50Dyqk0GX/tables/tables_9_1.jpg", "caption": "Table 4: Performance of fine-tuned CLIP ViT-L/14 on IWILDCAM with concept descriptions generated by different LLMs of various sizes.", "description": "This table shows the ID and OOD performance of fine-tuned CLIP ViT-L/14 model on the IWILDCAM dataset. The model is fine-tuned using concept descriptions generated by different LLMs with varying sizes (parameters). The results are compared against the FLYP baseline.  It demonstrates how the performance of DRM varies with different large language models.", "section": "5.3 Ablation study"}, {"figure_path": "p50Dyqk0GX/tables/tables_9_2.jpg", "caption": "Table 5: Performance of DRM under different λ on IWILDCAM and IMAGENET with CLIP ViT-L/14 and CLIP ViT-B/16 respectively.", "description": "This table presents the ID and OOD performance of the Dual Risk Minimization (DRM) method under different values of the hyperparameter λ.  The results are shown for two datasets, IWILDCAM and IMAGENET, using two different CLIP models (ViT-L/14 and ViT-B/16). The table helps to illustrate how the balance between empirical risk minimization and worst-case risk minimization (controlled by λ) affects both in-distribution and out-of-distribution performance.", "section": "5.5 Study on the effect of λ in DRM"}, {"figure_path": "p50Dyqk0GX/tables/tables_17_1.jpg", "caption": "Table 6: Quantitative study on the reliability of concept descriptions verse default prompts. The affinities to concept descriptions are sensitive to changes in the core features of image foregrounds (FG) and remain relatively stable against changes in the non-core features of backgrounds (BG).", "description": "This table presents a quantitative analysis comparing the reliability of concept descriptions and default prompts in capturing core visual features. It demonstrates that concept descriptions are more sensitive to changes in foreground (core features) and less affected by changes in background (non-core features) compared to default prompts.", "section": "D.1 Qualitative and quantitative study on the reliability of concept descriptions"}, {"figure_path": "p50Dyqk0GX/tables/tables_20_1.jpg", "caption": "Table 7: Performance on ImageNet OOD variants with CLIP ViT-B/16. “OOD” stands for the average performance over the OOD datasets.", "description": "This table presents the detailed performance of different methods on various ImageNet Out-of-Distribution (OOD) datasets using the CLIP ViT-B/16 model.  It shows ID (in-distribution) accuracy along with OOD accuracy for each of the five OOD datasets.  The results show the performance with and without WiSE-FT (Weight-space averaging fine-tuning) applied.  The table allows for a direct comparison of the methods' performance on both in-distribution and out-of-distribution data.", "section": "5.2 Main results"}, {"figure_path": "p50Dyqk0GX/tables/tables_20_2.jpg", "caption": "Table 8: ID and OOD performance on Dollar Street-DA and GeoYFCC-DA with CLIP ViT-B/16.", "description": "This table presents the in-distribution (ID) and out-of-distribution (OOD) performance results of different fine-tuning methods on two datasets: Dollar Street-DA and GeoYFCC-DA.  The ID performance is measured using images from specific geographic locations (North America and Europe), while the OOD performance is evaluated using images from other continents. The methods compared include a zero-shot baseline, FLYP (a fine-tuning method), FLYP combined with WiSE-FT (a weight-averaging technique), DRM (the proposed method), and DRM combined with WiSE-FT.", "section": "5.2 Main results"}, {"figure_path": "p50Dyqk0GX/tables/tables_21_1.jpg", "caption": "Table 1: ID and OOD performances of DRM and baselines methods on CLIP ViT-B/16, with and without WiSE-FT. Best performances are highlighted in bold. For IMAGENET, we report the average performance over its 5 OOD test sets. Results on individual test sets are provided in Appendix E.1.", "description": "This table presents the in-distribution (ID) and out-of-distribution (OOD) performance of different methods on the CLIP ViT-B/16 model.  The methods include several baselines and the proposed DRM (Dual Risk Minimization) method. The performance is evaluated across multiple datasets, including ImageNet and its OOD variants (ImageNet-V2, ImageNet-R, ImageNet-A, ImageNet-Sketch, ObjectNet) as well as  iWildCam and fMoW from the WILDS benchmark.  The table also shows the impact of using WiSE-FT (Weight-space averaging) with each method.  Best performances are highlighted in bold. Note that for ImageNet, the OOD performance is an average over 5 test sets, and individual results for each are given in Appendix E.1.", "section": "5.2 Main results"}, {"figure_path": "p50Dyqk0GX/tables/tables_22_1.jpg", "caption": "Table 10: Ablation study on DRM with CLIP ViT-L/14 (w/o WiSE-FT) on iWildCam.", "description": "This ablation study investigates the impact of various design choices in the Dual Risk Minimization (DRM) framework on the robustness of CLIP ViT-L/14 fine-tuned on the iWildCam dataset. The table explores different combinations of Empirical Risk Minimization (ERM) and Worst-case Risk Minimization (WRM) with various prompt types and classifier combinations. It assesses the performance of using a single risk for training, as well as different methods for combining the two classifiers after training, including ensemble and weighted average methods. Results are reported in terms of ID and OOD performance.", "section": "5.3 Ablation study"}, {"figure_path": "p50Dyqk0GX/tables/tables_23_1.jpg", "caption": "Table 11: Results of applying DRM under different settings.", "description": "This table presents the results of applying DRM under various settings by comparing the ID and OOD performance when using FLYP, LP-FT, and DRM. Row 1 shows the baseline performance with FLYP. Row 2 demonstrates DRM without FLYP or LP-FT. Row 3 shows the performance with both LP-FT and DRM. Lastly, Row 4 shows the result when combining FLYP and DRM. The combination of FLYP and DRM yielded the best results among the different settings.", "section": "5.3 Ablation study"}, {"figure_path": "p50Dyqk0GX/tables/tables_23_2.jpg", "caption": "Table 12: Results of applying DRM on fine-tuning ImageNet pre-trained ResNet50 on iWildCam.", "description": "This table presents the In-distribution (ID) and Out-of-distribution (OOD) performance results of applying Dual Risk Minimization (DRM) on ImageNet pre-trained ResNet50 model, fine-tuned on the iWildCam dataset.  The results are compared to the standard Empirical Risk Minimization (ERM) with full fine-tuning (ERM+FT) and linear probing followed by fine-tuning (ERM+LP-FT).  It shows the effectiveness of DRM in improving the OOD performance of a pre-trained CNN model.", "section": "E.6 Results of applying DRM on ImageNet pre-trained ResNet50"}, {"figure_path": "p50Dyqk0GX/tables/tables_24_1.jpg", "caption": "Table 1: ID and OOD performances of DRM and baselines methods on CLIP ViT-B/16, with and without WiSE-FT. Best performances are highlighted in bold. For IMAGENET, we report the average performance over its 5 OOD test sets. Results on individual test sets are provided in Appendix E.1.", "description": "This table presents a comparison of the In-distribution (ID) and Out-of-distribution (OOD) performance of the Dual Risk Minimization (DRM) method against several baseline methods.  The comparison is made using the CLIP ViT-B/16 model on three datasets: ImageNet, iWildCam, and FMoW.  The results are shown with and without the WiSE-FT method.  ImageNet's OOD performance is averaged across five different OOD test sets. The best-performing method for each metric is bolded.", "section": "5.2 Main results"}]