[{"figure_path": "He2GCHeRML/tables/tables_5_1.jpg", "caption": "Table 1: The table shows the p-values obtained using paired t-test between the results our method against each of the baselines for all the properties studied. Here, L. Loss refers to Learning Loss.", "description": "This table presents the p-values from paired t-tests comparing the performance of the proposed active learning method against four baseline methods (Random, Learning Loss, Coreset, Evidential Uncertainty) across four molecular properties (mu, alpha, homo, lumo).  A p-value less than 0.05 indicates a statistically significant difference. The table shows the proposed method significantly outperforms all baselines across all properties.", "section": "4.2 Active Learning Performance"}, {"figure_path": "He2GCHeRML/tables/tables_7_1.jpg", "caption": "Table 1: The table shows the p-values obtained using paired t-test between the results our method against each of the baselines for all the properties studied. Here, L. Loss refers to Learning Loss.", "description": "This table presents the p-values from pairwise t-tests comparing the proposed active learning method's performance against several baseline methods (Random, Learning Loss, Coreset, Evidential Uncertainty) across four molecular properties (mu, alpha, homo, lumo).  A p-value less than 0.05 indicates a statistically significant difference in performance.", "section": "4.2 Active Learning Performance"}, {"figure_path": "He2GCHeRML/tables/tables_9_1.jpg", "caption": "Table 2: Average (± std) time (minutes) taken by each method for sample selection and training the SphereNet model (one iteration of AL). Here, L. Loss refers to Learning Loss.", "description": "This table shows the average time, in minutes, taken by each active learning method for one iteration of the active learning process.  The methods are compared for the time taken for both the selection of samples and for training of the SphereNet model.  The standard deviation is also reported alongside the average.", "section": "4.5 Computation Time Analysis"}, {"figure_path": "He2GCHeRML/tables/tables_20_1.jpg", "caption": "Table 3: The table shows the p-values obtained using paired t-test between the results our method against each of the baselines for the mu and lumo properties, using Dimenet++ backbone.", "description": "This table presents the p-values from paired t-tests comparing the performance of the proposed active learning method against three baseline methods (Random, Learning Loss, Coreset) for predicting two molecular properties (mu and lumo) using the DimeNet++ model as the backbone.  Small p-values (typically less than 0.05) indicate statistically significant differences, suggesting that the proposed method outperforms the baselines.", "section": "4.2 Active Learning Performance"}, {"figure_path": "He2GCHeRML/tables/tables_22_1.jpg", "caption": "Table 4: The table shows the p-values obtained using paired t-test between the results our method against each of the baselines for the mu property for query budgets 1,000, 1, 500 and 2,000.", "description": "This table presents the p-values from paired t-tests comparing the performance of the proposed active learning method against several baseline methods. The p-values indicate the statistical significance of the performance differences for the 'mu' property across three different query budgets (1000, 1500, and 2000). Lower p-values suggest a more significant improvement by the proposed method compared to the baselines.", "section": "4.3 Study of Query Budget"}, {"figure_path": "He2GCHeRML/tables/tables_22_2.jpg", "caption": "Table 5: The table shows the p-values obtained using paired t-test between the result of our method against uncertainty only and diversity only components in ablation study for mu and lumo prediction.", "description": "This table presents the p-values from paired t-tests comparing the performance of the proposed active learning method against two ablation models: one using only the uncertainty component and the other using only the diversity component.  The p-values indicate the statistical significance of the performance differences for predicting the 'mu' and 'lumo' properties of molecules.", "section": "A.10 Addtional Ablation Studies"}, {"figure_path": "He2GCHeRML/tables/tables_23_1.jpg", "caption": "Table 6: The table shows a comparison between our proposed descriptor and the SOAP descriptor for the properties mu and lumo, using SphereNet as the backbone.", "description": "This table compares the performance of the proposed geometric descriptor with the SOAP descriptor for predicting the properties *mu* and *lumo* using SphereNet as the underlying GNN model.  For each property,  the Mean Absolute Error (MAE) is presented for seven AL iterations.  'SOAP D' refers to SOAP descriptor with diversity only, while 'SOAP B' indicates SOAP with both uncertainty and diversity.  Similarly, 'Our D' and 'Our B' represent the proposed descriptor with diversity only and with both uncertainty and diversity respectively. The results show the effectiveness of the proposed descriptor compared to the SOAP descriptor.", "section": "4.4 Ablation Studies"}, {"figure_path": "He2GCHeRML/tables/tables_23_2.jpg", "caption": "Table 7: The table shows the p-values obtained from a paired t-test comparing the results of our method against those of SOAP for the properties mu and lumo, using SphereNet as the backbone.", "description": "This table presents the p-values from paired t-tests comparing the performance of the proposed method against the SOAP descriptor for predicting the mu and lumo properties of molecules using the SphereNet model.  The p-values indicate the statistical significance of the performance difference between the two methods.", "section": "4.4 Ablation Studies"}, {"figure_path": "He2GCHeRML/tables/tables_23_3.jpg", "caption": "Table 1: The table shows the p-values obtained using paired t-test between the results our method against each of the baselines for all the properties studied. Here, L. Loss refers to Learning Loss.", "description": "This table presents the p-values from paired t-tests comparing the performance of the proposed active learning method against four baseline methods (Random, Learning Loss, Coreset, and Evidential Uncertainty) across four molecular properties (mu, alpha, homo, and lumo).  Small p-values (typically <0.05) indicate statistically significant improvements of the proposed method over the corresponding baseline.", "section": "4.2 Active Learning Performance"}, {"figure_path": "He2GCHeRML/tables/tables_24_1.jpg", "caption": "Table 9: Assets, Licenses, and Descriptions", "description": "This table lists the assets used in the paper, their respective licenses, and a short description of what each asset is.  The assets include pre-trained graph neural network models (SphereNet and DimeNet++), benchmark datasets (QM9 and MD17), and active learning schemes (Coreset, Learning Loss, and Evidential Uncertainty).  The licenses are provided to ensure compliance and transparency in the use of these assets.", "section": "A.11 Licenses for Existing Assets"}]