[{"figure_path": "RYQ0KuZvkL/figures/figures_2_1.jpg", "caption": "Figure 1: A motivating example for differences. The rewards for all actions other than the ones specified in the figure are 0. Define policy set II = {π1, π2} so that π₁ always plays a₁, whereas π2 plays a1 on green states but a2 on red states. The difference of their state-action visitation probabilities is only non-zero in states s3, s4 and are just O(€) apart.", "description": "This figure shows a simple Markov Decision Process (MDP) with four states and three actions. Two policies, π1 and π2 are defined; π1 always takes action a1, while π2 takes action a2 in the red states (s3 and s4) and a1 otherwise. The key point illustrated is that the difference in state-action visitations between π1 and π2 is only significant in the red states and negligible elsewhere. This motivates the idea that estimating only the difference between policy values can be more efficient than estimating the value of each policy individually.", "section": "Introduction"}, {"figure_path": "RYQ0KuZvkL/figures/figures_16_1.jpg", "caption": "Figure 1: A motivating example for differences. The rewards for all actions other than the ones specified in the figure are 0. Define policy set II = {π1, π2} so that π₁ always plays a₁, whereas π2 plays a1 on green states but a2 on red states. The difference of their state-action visitation probabilities is only non-zero in states s3, s4 and are just O(€) apart.", "description": "This figure is a simple MDP with three actions and four states.  Two policies (π1 and π2) are defined. Policy π1 always selects action a1. Policy π2 selects a1 except in states s3 and s4 (the red states), where it selects a2. The key takeaway is that the difference in the state-action visitations of these two policies is small (O(ε)) and only present in states s3 and s4.  This highlights the core idea of the paper: that focusing on the difference between policies can be more sample-efficient than estimating each policy's value independently.", "section": "1 Introduction"}]