[{"figure_path": "X2UMdvcmMo/tables/tables_8_1.jpg", "caption": "Table 1: Quantitative Comparisons on FF++. We report Fréchet inception distance, eye similarity, nose similarity, mouth similarity and Mean Square Error and show that our method achieves SOTA or competitive results compared with existing methods. FacePartsSwap is essentially a cut & paste method, rather than a generative one, and thus has a higher FPSim. Therefore, we only present its results here and do not include it in the quantitative comparisons.", "description": "This table presents a quantitative comparison of different facial parts swapping methods on the FaceForensics++ (FF++) dataset.  It evaluates the methods using Fréchet Inception Distance (FID) to assess image quality, and FPSim (Facial Part Similarity) metrics (FPSim-E, FPSim-N, FPSim-M) to measure the similarity between generated facial parts (eyes, nose, mouth) and corresponding reference images. Mean Squared Error (MSE) is also used to evaluate reconstruction accuracy.  The results show that the proposed 'Ours' method achieves state-of-the-art or competitive performance compared to existing methods, particularly in terms of FID and MSE.", "section": "4.2 Quantitative Comparisons"}, {"figure_path": "X2UMdvcmMo/tables/tables_8_2.jpg", "caption": "Table 2: Quantitative comparison of feature fusion under different ablative configurations. Both the generation quality and facial part similarity are measured.", "description": "This table presents a quantitative comparison of different feature fusion methods used in the FuseAnyPart model.  It shows the impact of various ablation studies on the model's performance, measured by FID (Fréchet Inception Distance), MSE (Mean Squared Error), and FPSim (Facial Part Similarity) for eyes, nose, and mouth.  The different configurations include using cross-attention alone, multiple cross-attention layers, adding the feature in convolutional layers, adding in cross-attention layers, and combining cross-attention and addition with a hierarchical structure. The results highlight the effectiveness of the proposed Addition-based Injection Module.", "section": "4.3 Ablation Study"}]