[{"figure_path": "rle9X7DQuH/figures/figures_1_1.jpg", "caption": "Figure 1: Experimental results on the OwSSL problem. (a) Self-label assignment of seen classes (1-5) and novel classes (6-10) with or without conditional component in self-labeling. (b) Predictive confidence and hierarchical threshold for each class.", "description": "This figure presents experimental results related to open-world semi-supervised learning.  Subfigure (a) compares self-label assignments for seen and unseen classes with and without the proposed conditional self-labeling method. It shows the conditional method produces self-label assignments closer to ground truth. Subfigure (b) displays the predictive confidence and the hierarchical thresholds applied to different classes during the learning process, illustrating the difference in learning progress between known and unknown classes.", "section": "1 Introduction"}, {"figure_path": "rle9X7DQuH/figures/figures_2_1.jpg", "caption": "Figure 3: Illustration on the hierarchical thresholding scheme.", "description": "This figure illustrates the hierarchical thresholding scheme used in the OwMatch framework.  It shows how the predictive confidence is used to generate thresholds for seen and novel classes.  Seen classes generally have higher predictive confidence and thus have a higher threshold, while novel classes exhibit more variability in their confidence levels and therefore have a hierarchical thresholding strategy applied to them.", "section": "3 Methodology"}, {"figure_path": "rle9X7DQuH/figures/figures_16_1.jpg", "caption": "Figure 4: Confusion matrices on CIFAR-10 with both novel class ratio and label ratio of 50%. The model needs to classify the initial five seen classes accurately (as reflected in the diagonal elements). While for the novel classes (6-10), the classes clustering are required to align with the ground-truth label (dark blue in one cell).", "description": "This figure shows confusion matrices for CIFAR-10 at different training epochs (1, 10, and 100).  It visualizes how the model's ability to distinguish between seen and novel classes improves during training. The diagonal elements represent accurate classification of seen classes.  The off-diagonal elements, particularly the dark blue blocks, illustrate the model's progress in correctly clustering novel classes with their ground truth labels.  The matrices show a clear trend towards improved classification and clustering accuracy as training progresses.", "section": "D Additional results"}, {"figure_path": "rle9X7DQuH/figures/figures_17_1.jpg", "caption": "Figure 5: Accuracy as a function of class number estimation error on CIFAR-100 dataset.", "description": "This figure shows how the accuracy of the OwMatch model changes with different levels of class estimation error on the CIFAR-100 dataset.  The accuracy is shown for three categories: seen classes (already known to the model), novel classes (unknown to the model), and all classes (both seen and novel). It demonstrates the robustness of OwMatch's performance even when the model's initial estimate of the number of classes is imperfect.  The graph shows that the overall accuracy (Seen + Novel) remains relatively stable, even with a significant estimation error, highlighting the model's resilience to errors in the initial class number estimation.", "section": "5 Experiments"}, {"figure_path": "rle9X7DQuH/figures/figures_19_1.jpg", "caption": "Figure 6: Model performance on CIFAR-100 with varying numbers of seen classes and a fixed amount of labeled data (5% of total data). Models trained with more seen classes generally perform better on both novel and all classes, despite having fewer labeled data per seen class.", "description": "This figure shows the impact of the number of seen classes on the model's performance when the total amount of labeled data is fixed at 5% of the total dataset.  The results indicate that models trained with more seen classes achieve higher accuracy on both known and novel classes, even though there are fewer labeled samples per class.  This suggests that a wider range of seen classes, even with fewer labeled examples, can be more beneficial for open-world semi-supervised learning.", "section": "5. Experiments"}, {"figure_path": "rle9X7DQuH/figures/figures_19_2.jpg", "caption": "Figure 1: Experimental results on the OwSSL problem. (a) Self-label assignment of seen classes (1-5) and novel classes (6-10) with or without conditional component in self-labeling. (b) Predictive confidence and hierarchical threshold for each class.", "description": "This figure shows experimental results on the open-world semi-supervised learning (OwSSL) problem.  Panel (a) compares the self-label assignment for seen and novel classes with and without the conditional component in the self-labeling method.  It demonstrates that the conditional approach leads to a better assignment of self-labels, especially for novel classes. Panel (b) illustrates the predictive confidence and hierarchical thresholds assigned to each class. This shows that seen classes typically have higher confidence and different thresholding strategies are used for seen and novel classes.", "section": "1 Introduction"}]