[{"figure_path": "GHqw3xLAvd/figures/figures_3_1.jpg", "caption": "Figure 1: Differentiable quantum computing for linear control.", "description": "This figure illustrates the hybrid quantum-classical approach of the proposed algorithm.  The classical module uses a gradient-based optimizer to iteratively update the control policy (K). This policy is then passed to the quantum module, which uses differentiable quantum computing techniques to evaluate the objective function f(K) via a quantum simulator. This process repeats, with the objective function evaluation providing feedback for the optimizer to refine the control policy until it converges to the optimal policy.", "section": "1.2 Main Contributions"}, {"figure_path": "GHqw3xLAvd/figures/figures_9_1.jpg", "caption": "Figure 2: Numerical Results on Convergence. Following the mass-spring-damper setup in [45], our policy gradient descent algorithm converges much faster than [45].", "description": "This figure compares the convergence speed of the proposed quantum policy gradient algorithm and the classical policy gradient method from [45] on a mass-spring-damper system.  Three subplots show the convergence for the objective function (J - J*), the objective function expressed in terms of the feedback gain (f(K) - f(K*)), and the runtime.  The results demonstrate that the quantum algorithm converges significantly faster than the classical approach, achieving a similar level of accuracy in fewer iterations and less computational time.  The speedup becomes more pronounced as the system size increases, highlighted in the runtime subplot.", "section": "5 Numerical Experiments"}, {"figure_path": "GHqw3xLAvd/figures/figures_29_1.jpg", "caption": "Figure 3: Numerical Results on Convergence. In the aircraft control problem, our policy gradient descent algorithm converges much faster than classic method [45].", "description": "This figure compares the convergence speed of the proposed quantum policy gradient algorithm and a classical method for solving a linear quadratic regulator (LQR) problem applied to aircraft pitch angle control. The plots show that the proposed quantum algorithm achieves a much faster convergence rate than the classical method, highlighting the effectiveness of quantum computing for large-scale optimal control problems.", "section": "5.3 Numerical Experiments"}, {"figure_path": "GHqw3xLAvd/figures/figures_29_2.jpg", "caption": "Figure 4: Relative Error. We scale the size of a mass-spring system and our method consistently gets smaller relative error compared to [45].", "description": "This figure shows the relative errors ((J - J*)/J* and (f(K) - f(K*))/f(K*)) for both the proposed quantum algorithm and a classical method [45] as the problem size (number of masses in a mass-spring system) increases from 2 to 4. The results demonstrate that the proposed quantum algorithm achieves smaller relative errors compared to the classical method as the problem size grows. This highlights the improved accuracy and robustness of the quantum algorithm, especially when dealing with larger-scale problems.", "section": "5.3 Numerical Experiments"}]