[{"figure_path": "DAtNDZHbqj/figures/figures_18_1.jpg", "caption": "Figure 2: Learning curves in MuJoCo tasks with 5 constant delays where the shaded areas represented the standard deviation.", "description": "This figure shows the learning curves for different reinforcement learning algorithms on various MuJoCo tasks with a constant delay of 5 time steps.  The y-axis represents the return, and the x-axis shows the global steps. The shaded regions indicate the standard deviation across multiple runs, providing a measure of the variability in the algorithm's performance.  The plot allows for a comparison of the learning efficiency and stability of different algorithms (A-SAC, DC/AC, DIDA, BPQL, AD-SAC, and VDPO) under the challenging condition of delayed observations.", "section": "4.2 Experimental Results"}, {"figure_path": "DAtNDZHbqj/figures/figures_19_1.jpg", "caption": "Figure 2: Learning curves in MuJoCo tasks with 5 constant delays where the shaded areas represented the standard deviation.", "description": "This figure displays the learning curves for various reinforcement learning algorithms across different MuJoCo tasks with a constant delay of 5 steps.  The x-axis represents the number of global steps, while the y-axis shows the return. Shaded regions indicate the standard deviation across multiple runs, providing insight into the stability and performance variability of each algorithm. The figure allows for comparison of the learning efficiency and performance of different algorithms under delayed reward scenarios.", "section": "4.2 Experimental Results"}, {"figure_path": "DAtNDZHbqj/figures/figures_20_1.jpg", "caption": "Figure 2: Learning curves in MuJoCo tasks with 5 constant delays where the shaded areas represented the standard deviation.", "description": "This figure shows the learning curves for different reinforcement learning algorithms on various MuJoCo benchmark tasks with a constant observation delay of 5 timesteps.  The algorithms compared include A-SAC, DC/AC, DIDA, BPQL, AD-SAC, and the proposed VDPO. The y-axis represents the average return, and the x-axis represents the number of global steps. Shaded areas indicate the standard deviation across multiple runs, demonstrating the performance consistency and stability of each algorithm. The figure illustrates the relative performance of each algorithm in terms of convergence speed and final performance.", "section": "4.2 Experimental Results"}]