[{"figure_path": "Vw1V9AgPXW/tables/tables_8_1.jpg", "caption": "Table 1: Estimation Performance of Satformer Compared with Baselines", "description": "This table presents a detailed comparison of the estimation performance of the proposed Satformer model against various baseline methods (both mathematical and neural network-based) across three real-world satellite network datasets (Iridium, Telesat, and Starlink).  The comparison is done at different sampling ratios (2%, 4%, 6%, 8%, and 10%), using two common evaluation metrics: Normalized Mean Absolute Error (NMAE) and Normalized Root Mean Squared Error (NRMSE). Lower values for both metrics indicate better performance. The table also includes improvement percentages achieved by Satformer over the best performing baseline models for each dataset and sampling ratio.", "section": "4.2 Performance Comparison with Baselines"}, {"figure_path": "Vw1V9AgPXW/tables/tables_17_1.jpg", "caption": "Table 2: Hyper Parameter Settings", "description": "This table presents the hyperparameter settings used for training the Satformer model and the neural network-based baseline models across three datasets with different sizes. The hyperparameters include the learning rate (lr), number of training epochs, and batch size. For each dataset, the table shows the specific hyperparameter configuration used for each model.", "section": "Implementation Details"}, {"figure_path": "Vw1V9AgPXW/tables/tables_20_1.jpg", "caption": "Table 3: Training & Inference Time", "description": "This table compares the training and inference times of the Satformer model against various baseline models (HaLRTC, LATC, LETC, COSTCO, CDSA, DAIN, SPIN, SAITS, STCAGCN).  The comparison is done across three different datasets (Iridium, Telesat, Starlink) representing different scales of satellite networks.  The table shows training time in seconds and inference time in seconds for each model and dataset.  This allows for a direct comparison of the computational efficiency of Satformer relative to other methods for estimating satellite network traffic.", "section": "G Runtime Analysis"}, {"figure_path": "Vw1V9AgPXW/tables/tables_21_1.jpg", "caption": "Table 1: Estimation Performance of Satformer Compared with Baselines", "description": "This table presents a comprehensive comparison of the estimation performance of Satformer against various baseline models across three real-world satellite network datasets (Iridium, Telesat, and Starlink) with varying sampling ratios (2% to 10%).  The metrics used for comparison are Normalized Mean Absolute Error (NMAE) and Normalized Root Mean Squared Error (NRMSE). The table demonstrates Satformer's superior performance and robustness across different datasets and sampling ratios.", "section": "4.2 Performance Comparison with Baselines"}]