[{"figure_path": "3MW44iNdrD/tables/tables_8_1.jpg", "caption": "Table 1: Evaluating Proposed FairQueue against ITI-GEN. We utilize FD: Fairness Discrepancy (↓), TA: Text-Alignment (↑), FID (↓), and DS: DreamSim (↓) to determine the fairness, quality, and semantic preservation, respectively. For FD a combination of CLIP [20], off-the-shelf classifier [44, 45] and human evaluator were utilized as tSA classifier. For TA we utilize CLIP [20] as the feature extractor. Overall, our proposed method demonstrates the best ability to balance between sample quality and fairness, while preserving the semantics of the original base-prompt T.", "description": "This table presents a quantitative comparison of the proposed FairQueue method against the state-of-the-art ITI-GEN method for fair text-to-image generation.  It evaluates performance across various sensitive attributes (tSAs), using metrics for fairness (Fairness Discrepancy - FD), quality (Text-Alignment - TA and Fréchet Inception Distance - FID), and semantic preservation (DreamSim - DS).  The results show FairQueue achieves a better balance of fairness and quality compared to ITI-GEN.", "section": "5 Experiments"}, {"figure_path": "3MW44iNdrD/tables/tables_15_1.jpg", "caption": "Table 2: Analysis of all possible different combinations for Prompt Queuing (PQ) and tSA Attention Amplification (AA). We summarize our findings from main paper for the tSA “Smiling”. Note that a(S) notates AA for tSA tokens, ITI-GEN prompt P=[T;S], and results in bold and italics are the best and second best. Notice that C6:FairQueue (PQ+AA) provides the best combination: it achieves both outstanding sample quality (C6: TA=0.674 & FID=80.02 similar to C1: TA=0.681 & FID=76.9 with the best quality but poor fairness) and fairness (C6: FD=0.069 similar to C4: FD=0.05 with the best fairness but poor quality).", "description": "This table presents an ablation study comparing different combinations of prompt queuing (PQ) and attention amplification (AA) for the tSA \"Smiling\".  It shows the fairness (FD), text alignment (TA), Fr\nchet Inception Distance (FID), and DreamSim (DS) scores for each combination.  The results highlight that FairQueue (PQ+AA), which uses both techniques, achieves the best balance between sample quality and fairness.", "section": "A.1 Identifying FairQueue as the optimal combination"}, {"figure_path": "3MW44iNdrD/tables/tables_35_1.jpg", "caption": "Table 3: A/B testing: Human assessment comparing quality between ITI-Gen vs FairQueue for 200 samples per tSA. Col 2 and 3 indicate the percentage of labelers that prefer the method's sample quality. A larger value is better.", "description": "This table presents the results of a human evaluation comparing the image quality of samples generated by ITI-GEN and FairQueue.  For each of four sensitive attributes (Smiling, High Cheekbones, Gender, and Young), 200 image pairs (one from each method) were evaluated by human labelers using A/B testing to determine which sample was of higher quality. The percentages in the table show the proportion of labelers who preferred each method for each attribute.  Higher percentages indicate better perceived quality.", "section": "A.3.3 Human-recognized Assessment Comparing ITI-Gen and FairQueue Quality"}, {"figure_path": "3MW44iNdrD/tables/tables_35_2.jpg", "caption": "Table 4: Fairness comparison by human-recognized tSA: Human assessment to compare FD for ITI-Gen vs FairQueue for 200 samples per tSA.", "description": "This table presents the Fairness Discrepancy (FD) values, a measure of fairness in image generation, for both the ITI-GEN and FairQueue methods.  The results are shown for four different sensitive attributes: Smiling, High Cheekbones, Gender, and Young. Lower FD values indicate better fairness. The table summarizes the human evaluation results from the user study comparing the fairness of images generated using both methods for each tSA.", "section": "A.3.3 Human-recognized Assessment Comparing ITI-Gen and FairQueue Quality"}, {"figure_path": "3MW44iNdrD/tables/tables_38_1.jpg", "caption": "Table 1: Evaluating Proposed FairQueue against ITI-GEN. We utilize FD: Fairness Discrepancy (↓), TA: Text-Alignment (↑), FID (↓), and DS: DreamSim (↓) to determine the fairness, quality, and semantic preservation, respectively. For FD a combination of CLIP [20], off-the-shelf classifier [44, 45] and human evaluator were utilized as tSA classifier. For TA we utilize CLIP [20] as the feature extractor. Overall, our proposed method demonstrates the best ability to balance between sample quality and fairness, while preserving the semantics of the original base-prompt T.", "description": "This table presents a comparison of the proposed FairQueue method against the state-of-the-art ITI-GEN method for fair text-to-image generation.  It evaluates performance across multiple sensitive attributes (tSAs) using four metrics: Fairness Discrepancy (FD) to measure fairness, Text-Alignment (TA) and Fréchet Inception Distance (FID) to assess quality, and DreamSim (DS) to evaluate semantic preservation.  The results show that FairQueue achieves a better balance between quality and fairness compared to ITI-GEN, while maintaining the semantic content of the base prompt.", "section": "5 Experiments"}, {"figure_path": "3MW44iNdrD/tables/tables_39_1.jpg", "caption": "Table 1: Evaluating Proposed FairQueue against ITI-GEN. We utilize FD: Fairness Discrepancy (↓), TA: Text-Alignment (↑), FID (↓), and DS: DreamSim (↓) to determine the fairness, quality, and semantic preservation, respectively. For FD a combination of CLIP [20], off-the-shelf classifier [44, 45] and human evaluator were utilized as tSA classifier. For TA we utilize CLIP [20] as the feature extractor. Overall, our proposed method demonstrates the best ability to balance between sample quality and fairness, while preserving the semantics of the original base-prompt T.", "description": "This table presents a comparison of the proposed FairQueue method against the state-of-the-art ITI-GEN method for fair text-to-image generation.  Multiple metrics are used to evaluate both the fairness and quality of the generated images, considering various sensitive attributes (tSAs). The metrics include Fairness Discrepancy (FD), measuring equal representation across tSA categories; Text-Alignment (TA), assessing semantic preservation; Fréchet Inception Distance (FID), evaluating image quality; and DreamSim (DS), measuring semantic preservation.  The results show that FairQueue achieves a better balance between fairness and image quality compared to ITI-GEN.", "section": "Experiments"}, {"figure_path": "3MW44iNdrD/tables/tables_39_2.jpg", "caption": "Table 1: Evaluating Proposed FairQueue against ITI-GEN. We utilize FD: Fairness Discrepancy (↓), TA: Text-Alignment (↑), FID (↓), and DS: DreamSim (↓) to determine the fairness, quality, and semantic preservation, respectively. For FD a combination of CLIP [20], off-the-shelf classifier [44, 45] and human evaluator were utilized as tSA classifier. For TA we utilize CLIP [20] as the feature extractor. Overall, our proposed method demonstrates the best ability to balance between sample quality and fairness, while preserving the semantics of the original base-prompt T.", "description": "This table presents a comparison of the proposed FairQueue method against the state-of-the-art ITI-GEN method for fair text-to-image generation.  It evaluates performance across multiple metrics: Fairness Discrepancy (FD), which measures fairness; Text-Alignment (TA) and Fréchet Inception Distance (FID), which measure image quality; and DreamSim (DS), which measures semantic preservation. The results show that FairQueue achieves a better balance between sample quality and fairness compared to ITI-GEN.", "section": "5 Experiments"}, {"figure_path": "3MW44iNdrD/tables/tables_40_1.jpg", "caption": "Table 1: Evaluating Proposed FairQueue against ITI-GEN. We utilize FD: Fairness Discrepancy (↓), TA: Text-Alignment (↑), FID (↓), and DS: DreamSim (↓) to determine the fairness, quality, and semantic preservation, respectively. For FD a combination of CLIP [20], off-the-shelf classifier [44, 45] and human evaluator were utilized as tSA classifier. For TA we utilize CLIP [20] as the feature extractor. Overall, our proposed method demonstrates the best ability to balance between sample quality and fairness, while preserving the semantics of the original base-prompt T.", "description": "This table presents a comparison of the proposed FairQueue method against the state-of-the-art ITI-GEN method for fair text-to-image generation across various sensitive attributes (tSAs).  It uses four metrics to evaluate performance: Fairness Discrepancy (FD), Text Alignment (TA), Fréchet Inception Distance (FID), and DreamSim (DS).  Lower FD indicates better fairness, higher TA and lower FID indicate better quality, and lower DS indicates better semantic preservation. The results show that FairQueue achieves a better balance of fairness and quality than ITI-GEN, while maintaining good semantic preservation.", "section": "5 Experiments"}]