[{"figure_path": "VTcGX5HO19/tables/tables_2_1.jpg", "caption": "Table 2: Optimization on test functions: regret when n = N (mean ± std.) / Average costs of evaluations / AUC of PPs.", "description": "This table presents a quantitative comparison of different Bayesian Optimization methods on various benchmark test functions.  For each function, it shows the mean and standard deviation of the regret (difference between the global optimum and the estimated optimum at the final iteration), the average cost (number of function evaluations), and the Area Under the Curve (AUC) of the performance profiles.  The table allows for a comparison of the performance and efficiency of various methods across different function complexities.", "section": "E.2 Quantitative comparison"}, {"figure_path": "VTcGX5HO19/tables/tables_14_1.jpg", "caption": "Table 2: Optimization on test functions: regret when n = N (mean ± std.) / Average costs of evaluations / AUC of PPs.", "description": "This table presents a quantitative comparison of different Bayesian Optimization methods on several benchmark test functions.  For each function, it shows the mean and standard deviation of the regret (difference between the global optimum and the estimated optimum) when the total number of evaluations (n) equals N.  Additionally, it provides the average cost (number of evaluations) and the area under the performance profile curve (AUC), which measures the overall performance of each method across all the runs. This table allows for a detailed comparison of the optimization performance of different methods based on various metrics.", "section": "E.2 Quantitative comparison"}, {"figure_path": "VTcGX5HO19/tables/tables_17_1.jpg", "caption": "Table 2: Optimization on test functions: regret when n = N (mean ± std.) / Average costs of evaluations / AUC of PPs.", "description": "This table presents a quantitative comparison of different Bayesian optimization methods on seven benchmark test functions.  For each function, it shows the mean and standard deviation of the regret (the difference between the global optimum and the estimated global optimum at the end of the optimization process), the average number of function evaluations required, and the area under the performance profile curve (AUC). This provides a comprehensive evaluation of the algorithms' performance across various aspects.", "section": "E.2 Quantitative comparison"}, {"figure_path": "VTcGX5HO19/tables/tables_20_1.jpg", "caption": "Table 2: Optimization on test functions: regret when n = N (mean ± std.) / Average costs of evaluations / AUC of PPs.", "description": "This table compares different Bayesian Optimization methods on seven benchmark test functions.  For each function, it shows the mean and standard deviation of the regret (the difference between the global optimum and the estimated optimum at the end of optimization), the average number of function evaluations needed, and the Area Under the Curve (AUC) of the performance profile.  The AUC provides a summary of the overall performance of each method across the functions. Lower regret, fewer evaluations, and higher AUC values indicate better performance.", "section": "E.2 Quantitative comparison"}, {"figure_path": "VTcGX5HO19/tables/tables_24_1.jpg", "caption": "Table 2: Optimization on test functions: regret when n = N (mean ± std.) / Average costs of evaluations / AUC of PPs.", "description": "This table compares the performance of different Bayesian Optimization methods on seven benchmark test functions.  For each function, it shows the mean and standard deviation of the regret (difference between the global optimum and the estimated optimum at the end of optimization), the average number of function evaluations required, and the area under the performance profile curve (AUC).  The AUC provides an overall ranking of the methods across all functions.", "section": "E.2 Quantitative comparison"}, {"figure_path": "VTcGX5HO19/tables/tables_24_2.jpg", "caption": "Table 2: Optimization on test functions: regret when n = N (mean ± std.) / Average costs of evaluations / AUC of PPs.", "description": "This table compares the performance of different Bayesian Optimization methods on seven benchmark test functions.  For each function, it shows the mean and standard deviation of the regret (difference between the global optimum and the estimated optimum) after N evaluations, the average cost (number of function evaluations), and the Area Under the Curve (AUC) of the performance profiles. The results help evaluate the efficiency and effectiveness of each method in finding the global optimum.", "section": "E.2 Quantitative comparison"}, {"figure_path": "VTcGX5HO19/tables/tables_25_1.jpg", "caption": "Table 2: Optimization on test functions: regret when n = N (mean ± std.) / Average costs of evaluations / AUC of PPs.", "description": "This table compares different Bayesian Optimization methods on several benchmark test functions.  It shows the mean and standard deviation of the regret (the difference between the global optimum and the estimated optimum at the end of the optimization process), the average number of function evaluations needed to reach this result, and the Area Under the Curve (AUC) of the performance profiles.  The table enables a comparison of the methods' effectiveness and efficiency.", "section": "E.2 Quantitative comparison"}]