[{"figure_path": "6FYh6gxzPf/tables/tables_7_1.jpg", "caption": "Table 1: Overall results compared to the state-of-the-art active grasp detection methods.", "description": "This table presents a comparison of the proposed active grasp detection method's performance against existing state-of-the-art methods on the GraspNet-1Billion benchmark.  The comparison is done across three subsets of the benchmark: 'Seen', 'Similar', and 'Novel', reflecting the object categories' visual similarity to the training data.  For each subset and overall, the Average Precision (AP) is reported, along with AP at 0.8 and 0.4 success rates (AP0.8 and AP0.4), offering a comprehensive view of the methods' performance across different grasping difficulty levels.  The 'All views' row provides an upper bound, representing performance achievable with complete scene information (all 256 views).", "section": "4.2 Simulation Experiments"}, {"figure_path": "6FYh6gxzPf/tables/tables_7_2.jpg", "caption": "Table 2: Results of the real-world grasping experiments.", "description": "This table presents the success rates of three different methods (Close-loop [5], ACE-NBV [32], and Ours) in real-world grasping experiments.  The success rate is calculated as the percentage of successful grasps out of the total number of attempts (56/75 for the proposed method).  It shows the performance comparison of the proposed method against two state-of-the-art baselines in a real-world setting, highlighting the improvement achieved by the proposed method.", "section": "4.3 Real-world Experiments"}, {"figure_path": "6FYh6gxzPf/tables/tables_7_3.jpg", "caption": "Table 3: Runtime analysis of the proposed method.", "description": "This table shows a breakdown of the time taken for each step in the active grasp detection system.  The total time is 3.44 seconds, with the robot execution taking the longest (51.16%). NBV planning consumes a significant portion of the total time (29.07%). The mapping and grasp detection steps are relatively quick.", "section": "4.3 Real-world Experiments"}, {"figure_path": "6FYh6gxzPf/tables/tables_12_1.jpg", "caption": "Table 4: Kinect results compared to the state-of-the-art active grasp detection methods.", "description": "This table presents a comparison of the performance of the proposed active grasp detection method against state-of-the-art methods using a Kinect camera.  It shows the average precision (AP) and AP at different thresholds (AP0.8 and AP0.4) for three object categories: seen, similar, and novel.  The \"All views\" row represents the performance when all available views of the scene are used, serving as an upper bound for comparison.", "section": "4.2 Simulation Experiments"}, {"figure_path": "6FYh6gxzPf/tables/tables_12_2.jpg", "caption": "Table 2: Results of the real-world grasping experiments.", "description": "This table presents the success rate of the real-world grasping experiments for three different methods: Close-loop [5], ACE-NBV [32], and the proposed method.  The success rate is calculated as the number of successful grasps divided by the total number of attempts.  Each method was tested on a set of 25 objects from the YCB dataset, with each object tested in five different cluttered scenes, resulting in 75 total trials. The proposed method outperforms the baselines, achieving the highest success rate.", "section": "4.3 Real-world Experiments"}]