[{"figure_path": "V8HVsyTSu6/tables/tables_8_1.jpg", "caption": "Table 1: Comparison of running time and excess risk of different methods for linear regression. The symbol '*' indicates that running time is over 12000 seconds.", "description": "This table compares the computational efficiency and prediction accuracy of three different methods for linear regression: Standard DRO, OR-WDRO, and UOT-DRO.  The comparison is made across six different sample sizes (80, 200, 2000, 5000, 10000, 20000). For each method and sample size, the table shows the running time (in seconds) and the excess risk (a measure of prediction error). The asterisk (*) indicates that the running time exceeded 12000 seconds, highlighting the computational advantages of the UOT-DRO method, especially for larger datasets.", "section": "5.1 Linear regression"}, {"figure_path": "V8HVsyTSu6/tables/tables_8_2.jpg", "caption": "Table 2: Excess risk with various contamination for linear classification.", "description": "This table presents the results of a linear classification experiment, comparing the performance of three different methods (Standard DRO, OR-WDRO, and UOT-DRO) under varying levels of data contamination (represented by the 'Contamin. C' column).  For each contamination level, the table shows the excess risk and accuracy achieved by each method. Excess risk measures the difference between the achieved loss and the minimum possible loss, while accuracy represents the percentage of correctly classified data points.  The results illustrate the robustness of the proposed UOT-DRO method to outliers compared to the other two methods.", "section": "5.2 Linear classification"}, {"figure_path": "V8HVsyTSu6/tables/tables_9_1.jpg", "caption": "Table 2: Excess risk with various contamination for linear classification.", "description": "This table presents a comparison of excess risk and accuracy for three different methods (Standard DRO, OR-WDRO, and UOT-DRO) in a linear classification problem with varying levels of data contamination (C).  It demonstrates the robustness of the UOT-DRO method against outliers, as its performance remains consistent across different contamination levels, unlike the other two methods.", "section": "5.2 Linear classification"}, {"figure_path": "V8HVsyTSu6/tables/tables_17_1.jpg", "caption": "Table 4: Excess risk with various parameters for linear regression.", "description": "This table shows the excess risk for different combinations of lambda (λ) and beta (β) parameters in the linear regression experiment.  The results demonstrate that the model's performance shows minimal sensitivity to variations in these parameters across a range of values.", "section": "5.1 Linear regression"}, {"figure_path": "V8HVsyTSu6/tables/tables_17_2.jpg", "caption": "Table 5: Excess risk with various λ2 for linear regression.", "description": "This table presents the excess risk achieved by standard DRO and UOT-DRO methods under different values of the parameter λ2.  The parameter λ2 controls the weight given to prior knowledge in identifying outliers.  The table shows that the UOT-DRO method is significantly more robust to outliers, achieving a much lower excess risk than the standard DRO, particularly when λ2 is greater than 1.", "section": "5.1 Linear regression"}, {"figure_path": "V8HVsyTSu6/tables/tables_17_3.jpg", "caption": "Table 6: Excess risk with various contamination for linear regression.", "description": "This table compares the excess risk of three different methods (Standard DRO, OR-WDRO, and UOT-DRO) for linear regression under different levels of data contamination.  The contamination factor (C) represents the degree of data corruption.  The excess risk is a measure of the model's performance relative to the optimal performance.  Lower values of excess risk indicate better performance.", "section": "5.1 Linear regression"}, {"figure_path": "V8HVsyTSu6/tables/tables_17_4.jpg", "caption": "Table 7: Excess risk with various preprocessing parameter ĉ for linear regression (ε = 0.1).", "description": "This table compares the excess risk of standard DRO, OR-WDRO [20], and UOT-DRO for linear regression with different values of the preprocessing parameter ĉ (epsilon).  The parameter ĉ represents the estimated proportion of data corruption. The table shows how sensitive each method is to variations in ĉ.", "section": "5.1 Linear regression"}, {"figure_path": "V8HVsyTSu6/tables/tables_18_1.jpg", "caption": "Table 1: Comparison of running time and excess risk of different methods for linear regression. The symbol '*' indicates that running time is over 12000 seconds.", "description": "This table compares the computational time and excess risk (difference between obtained loss and minimum achievable loss) of three different methods for linear regression: Standard DRO, OR-WDRO [20], and the proposed UOT-DRO. The excess risk and computational time are shown for different sample sizes (n). The '*' symbol indicates that the running time exceeded 12000 seconds for the OR-WDRO method, highlighting its computational inefficiency compared to the UOT-DRO method, particularly for larger datasets.", "section": "5.1 Linear regression"}, {"figure_path": "V8HVsyTSu6/tables/tables_19_1.jpg", "caption": "Table 9: Excess risk with various ĉ for linear classification.", "description": "This table compares the excess risk and accuracy of three different methods (Standard DRO, OR-WDRO, and UOT-DRO) for linear classification with varying levels of data corruption (represented by the parameter ĉ).  The results show the robustness of UOT-DRO against changes in the corruption level, maintaining high accuracy.", "section": "5.2 Linear classification"}, {"figure_path": "V8HVsyTSu6/tables/tables_19_2.jpg", "caption": "Table 10: Accuracy of various parameters for linear classification when C = 10. Standard DRO: 66%; OR-WDRO: 79%.", "description": "This table shows the accuracy of the UOT-DRO model for different values of parameters β (beta) and λ (lambda) in a linear classification task where the contamination factor C is 10.  The accuracy is compared to standard DRO and OR-WDRO methods to highlight the robustness of the UOT-DRO approach and its insensitivity to parameter tuning.  The wide range of accuracies for different parameter choices indicates the method's stability.", "section": "5.2 Linear classification"}, {"figure_path": "V8HVsyTSu6/tables/tables_19_3.jpg", "caption": "Table 11: Loss and accuracy of various β for logistic regression.", "description": "This table presents the loss and accuracy of the logistic regression model using the proposed UOT-DRO method with varying values of the parameter β.  The results are shown for three different values of the parameter λ (5, 10, and 15), demonstrating the impact of β on the model's performance across different levels of regularization.", "section": "5.3 Logistic regression"}, {"figure_path": "V8HVsyTSu6/tables/tables_19_4.jpg", "caption": "Table 5: Excess risk with various λ2 for linear regression.", "description": "This table presents the excess risk of standard DRO and UOT-DRO with various λ2 for linear regression.  λ2 is a parameter that represents the credibility level assigned to the function h, which is designed based on prior knowledge about the data distribution. A larger value of λ2 indicates higher confidence in h, meaning that h(ξ) is more likely to be larger at outlier points.  The results show the impact of λ2 on model performance under different values of λ, illustrating the trade-off between robustness and performance based on prior knowledge.", "section": "Additional experiments on linear regression"}]