[{"figure_path": "HUxtJcQpDS/tables/tables_6_1.jpg", "caption": "Table 1: Mean and standard deviation of the concordance Index on four survival risk categories. We trained HEALNet and all baselines on four TCGA tasks and report the performance on the test set across five folds. HEALNet outperforms all of its multimodal baselines and three out of four unimodal baselines in absolute c-Index performance.", "description": "This table presents the mean and standard deviation of the concordance index (c-index) achieved by HEALNet and various baseline models across four different cancer datasets from The Cancer Genome Atlas (TCGA).  The c-index is a measure of the predictive accuracy of survival models.  The table shows that HEALNet outperforms most other models in terms of both mean c-index and consistency (lower standard deviation).", "section": "5 Results"}, {"figure_path": "HUxtJcQpDS/tables/tables_7_1.jpg", "caption": "Table 2: Analysis of the performance of HEALNet, trained on all modalities, in scenarios with missing modalities at inference, compared to unimodal baselines. Each test sample contains only one of either the Omic or WSI modality. The scenarios include test sets consisting of samples with only Omic modality, only WSI modality or a combination of both (at random). HEALNet achieves a higher c-Index across datasets, implying effective encoding of cross-modal information and handling different amounts of data with missing modalities.", "description": "This table shows the performance of HEALNet when some modalities are missing during the testing phase.  It compares HEALNet's performance to unimodal baselines in four different scenarios: (1) only omic data, (2) only WSI data, (3) a mix of both, and (4) using only the available modality. HEALNet consistently achieves better results, demonstrating its robustness to missing data and ability to leverage cross-modal information learned during training.", "section": "5 Results"}, {"figure_path": "HUxtJcQpDS/tables/tables_14_1.jpg", "caption": "Table 1: Mean and standard deviation of the concordance Index on four survival risk categories. We trained HEALNet and all baselines on four TCGA tasks and report the performance on the test set across five folds. HEALNet outperforms all of its multimodal baselines and three out of four unimodal baselines in absolute c-Index performance.", "description": "This table presents the performance of HEALNet and various baseline models on four different cancer datasets from The Cancer Genome Atlas (TCGA).  The performance metric is the concordance index (c-index), a measure of how well the model predicts survival times.  The table shows the mean and standard deviation of the c-index across five-fold cross-validation for each model.  The models include unimodal models (using only one data type), and multimodal models using various fusion methods (late, intermediate, early). The results demonstrate that HEALNet generally outperforms the other models, showcasing its effectiveness in multimodal survival analysis.", "section": "5 Results"}, {"figure_path": "HUxtJcQpDS/tables/tables_14_2.jpg", "caption": "Table 4: Mean and standard deviation of classification performance. We trained HEALNet and all baselines on two MIMIC-III tasks and report the performance on the test set across five folds. HEALNet outperforms all multi-modal and uni-modal baselines in classification performance.", "description": "This table presents the results of a classification experiment using the MIMIC-III dataset.  The experiment compares the performance of HEALNet against several other unimodal and multimodal baselines on two tasks: predicting patient mortality (MORT) and disease classification (ICD9).  The performance metric used is AUC (Area Under the Curve) for ICD9 and Macro-AUC for MORT.  The results are averaged across five folds of cross-validation.", "section": "Additional experiments"}, {"figure_path": "HUxtJcQpDS/tables/tables_15_1.jpg", "caption": "Table 5: Overview of data availability and dimensionality of the four TCGA datasets used for experiments.", "description": "This table presents a summary of the four cancer datasets from The Cancer Genome Atlas (TCGA) used in the HEALNet experiments.  For each dataset (BLCA, BRCA, KIRP, UCEC), it lists the number of slide samples, the number of omic samples, the overlap between slide and omic samples used in the analysis, the number of omic features used, the resolution of the whole slide images (WSI), the percentage of censored data (where the outcome was not observed), the survival bin sizes used for discretizing survival time, and the amount of disk space used for storing the data.", "section": "4 Experiments"}, {"figure_path": "HUxtJcQpDS/tables/tables_16_1.jpg", "caption": "Table 1: Mean and standard deviation of the concordance Index on four survival risk categories. We trained HEALNet and all baselines on four TCGA tasks and report the performance on the test set across five folds. HEALNet outperforms all of its multimodal baselines and three out of four unimodal baselines in absolute c-Index performance.", "description": "This table presents the performance of HEALNet and various baseline models (unimodal and multimodal) on four different cancer datasets from The Cancer Genome Atlas (TCGA). The performance is measured using the concordance index (c-index), a common metric for evaluating survival prediction models. The results show that HEALNet achieves state-of-the-art performance, outperforming other multimodal methods and several unimodal baselines.", "section": "5 Results"}]