[{"figure_path": "WXqukapoa7/figures/figures_2_1.jpg", "caption": "Figure 1: Overview of the system model considered in this work. Left time series: Disentangled latent variable time series predictions provided by an untrusted ML agent at time t ∈ [T], represented by (Šīt(i) : i = 1, ..., k); Right time series: Observed mixed perturbations (f (sヶ; 0) : τ < t) at time t - 1.", "description": "This figure illustrates the system model used in the paper.  An untrusted machine learning agent provides predictions for disentangled latent variables (Šīt(i)). These predictions, along with observed mixed perturbations from previous time steps, are input to the control policy π.  The control policy then generates actions (ut) that affect the dynamical system, resulting in an updated state (xt+1).", "section": "2 Problem Formulation"}, {"figure_path": "WXqukapoa7/figures/figures_4_1.jpg", "caption": "Figure 1: Overview of the system model considered in this work. Left time series: Disentangled latent variable time series predictions provided by an untrusted ML agent at time t ∈ [T], represented by (Šīt(i) : i = 1, ..., k); Right time series: Observed mixed perturbations (f (sτ; 0) : τ < t) at time t - 1.", "description": "The figure illustrates the system model used in the paper.  On the left, it shows a series of disentangled latent variable predictions generated by an untrusted machine learning (ML) agent at different time steps (t).  On the right, it shows the observed mixed perturbations in the system, resulting from a combination of these latent variables. The system's state is updated based on the current state, control actions, and these mixed perturbations. The figure highlights the challenge of using untrusted ML predictions in control problems.", "section": "2 Problem Formulation"}, {"figure_path": "WXqukapoa7/figures/figures_7_1.jpg", "caption": "Figure 2: Drone Navigation under challenging windy and rainy weather conditions, with the drone's target path illustrated by a dotted curve. The external perturbations impacting the drone's flight are modeled by two independent, time-varying latent variables: wt for wind speed and rt for rain intensity at time t ∈ [T]. The trajectory produced by the DISC policy (Algorithm 1 in Section 3) is represented by the blue curve, while that from the offline optimal policy is traced in red. More comparison results with other baseline policies can be found in Appendix C.2. Right: Ratio of Costs J(π)/J* (y-axis) between DISC (red), linear quadratic regulator (LQR, orange), model predictive control with untrusted ML predictions (MPC (UNTRUSTED), green), and the self-tuning policy (blue), with a varying scaling factor v from 0.25 to 8. Shadow area depicts the range of standard deviations for 5 random tests.", "description": "This figure shows the results of a drone navigation experiment under windy and rainy conditions. The left panel shows the drone's trajectory using the DISC policy compared to the optimal offline trajectory.  The right panel shows a comparison of the cost ratios for DISC, LQR, MPC (with untrusted predictions), and a self-tuning policy across different levels of environmental unpredictability (controlled by the scaling factor 'v'). The shadow area represents the standard deviation across five random trials.", "section": "Experiments"}, {"figure_path": "WXqukapoa7/figures/figures_8_1.jpg", "caption": "Figure 3: Voltage Control with in a dynamic environment. This figure illustrates the heterogeneity and variability of power injections at different nodes within an electrical grid, including a residential area, a solar photovoltaic (PV) system, and a wind turbine. Right: Example B. Voltage Control (Section 5.2). Left column: Convergence of confidence parameters (λ(1), λ(2), λ(3)) corresponding to 3 latent components. Right column: Temporal dynamics of latent time series st ∈ R³. We illustrate the time series data for three key latent variables in the energy system (see Figure 3): Gaussian-distributed residential consumption (bottom), real-world photovoltaic (PV) integration (top), and wind generation (middle). The red dotted line marks a critical transition point where there is a notable shift in the power generation patterns. We use time series before the blue dotted line as the buffered data to warm start the ML model, learn the mixing matrix, and obtain disentangled predictions. The x-axis in each graph marks the time steps, while the y-axis denotes the values of the time series.", "description": "This figure shows a diagram of a power grid with different types of power sources and loads. It also includes graphs showing the convergence of confidence parameters and temporal dynamics of latent time series for different power sources.", "section": "5.2 Example B: Voltage Control with Heterogeneous Power Injections"}, {"figure_path": "WXqukapoa7/figures/figures_19_1.jpg", "caption": "Figure 4: Example A. Drone Navigation (Section 5.1). Left column: Convergence of confidence parameters λ(1), λ(2), λ(3), λ(4) corresponding to 4 latent components. Right column: Temporal dynamics of latent components θt ○ st in R4. We illustrate the time series for the latent components in (16), with each sub-figure featuring four distinct curves representing the dimensions of the respective 4-dimensional component. Post the dotted red line, the additional blue curves visualize imperfect ML predictions from the multi-layer neural network, elaborated in Appendix C.3. The x-axis in each graph marks the time steps, while the y-axis denotes the values of the time series.", "description": "This figure shows the convergence of confidence parameters and the temporal dynamics of latent components for the drone navigation task. The left column displays the convergence of four confidence parameters (λ(1) to λ(4)), each associated with a latent component.  The right column shows the time series for each of these four latent components. The dotted red line indicates a change in the data characteristics (a transition point). Blue curves after the dotted red line represent imperfect predictions from a neural network model.", "section": "5.1 Experiment A: Drone Navigation with Mixed Disturbances"}, {"figure_path": "WXqukapoa7/figures/figures_20_1.jpg", "caption": "Figure 2: Drone Navigation under challenging windy and rainy weather conditions, with the drone's target path illustrated by a dotted curve. The external perturbations impacting the drone's flight are modeled by two independent, time-varying latent variables: wt for wind speed and rt for rain intensity at time t ∈ [T]. The trajectory produced by the DISC policy (Algorithm 1 in Section 3) is represented by the blue curve, while that from the offline optimal policy is traced in red. More comparison results with other baseline policies can be found in Appendix C.2. Right: Ratio of Costs J(π)/J* (y-axis) between DISC (red), linear quadratic regulator (LQR, orange), model predictive control with untrusted ML predictions (MPC (UNTRUSTED), green), and the self-tuning policy (blue), with a varying scaling factor v from 0.25 to 8. Shadow area depicts the range of standard deviations for 5 random tests.", "description": "The figure shows the results of drone navigation experiments under windy and rainy conditions. The left panel illustrates the drone's trajectory using different control policies, including the proposed DISC policy, compared to the optimal offline policy, LQR and an MPC policy using untrusted ML predictions. The right panel shows the cost ratios for the different policies with varying scaling factors, representing different levels of environmental uncertainty.", "section": "Experiment A: Drone Navigation with Mixed Disturbances"}, {"figure_path": "WXqukapoa7/figures/figures_20_2.jpg", "caption": "Figure 6: Average total cost J(π) with error bars for four policies in the voltage control task (Section 5.2).", "description": "This bar chart compares the average total cost J(π) achieved by four different control policies: DISC, Self-tuning, MPC (untrusted), and LQR.  The error bars represent the standard deviation across multiple runs. The LQR cost is shown as a dashed horizontal line for reference.  DISC outperforms the other policies, suggesting its effectiveness in minimizing cost for voltage control in power grids.", "section": "5 Experiments"}, {"figure_path": "WXqukapoa7/figures/figures_23_1.jpg", "caption": "Figure 1: Overview of the system model considered in this work. Left time series: Disentangled latent variable time series predictions provided by an untrusted ML agent at time t ∈ [T], represented by (Šīt(i) : i = 1, ..., k); Right time series: Observed mixed perturbations (f (sヶ; 0) : τ < t) at time t - 1.", "description": "This figure illustrates the system model used in the paper. The left side shows the disentangled latent variable predictions from an untrusted ML agent, while the right side depicts the observed mixed perturbations.  The model shows how the untrusted ML agent's predictions, the control policy, and the dynamical system interact to produce the observed states. The figure highlights the core components of the system and their relationships.", "section": "2 Problem Formulation"}, {"figure_path": "WXqukapoa7/figures/figures_23_2.jpg", "caption": "Figure 1: Overview of the system model considered in this work. Left time series: Disentangled latent variable time series predictions provided by an untrusted ML agent at time t ∈ [T], represented by (Šīt(i) : i = 1, ..., k); Right time series: Observed mixed perturbations (f (sτ; 0) : τ < t) at time t - 1.", "description": "This figure illustrates the system model used in the paper. An untrusted machine learning agent provides predictions for disentangled latent variables, which are then combined with observed mixed perturbations to update the system state. The control policy uses these predictions and the observed state to determine actions. The figure shows the interaction between the ML agent, the dynamical system, and the control policy. The time series plots show the disentangled latent variable predictions and the mixed perturbations over time.", "section": "2 Problem Formulation"}]