[{"figure_path": "nfq3GKfb4h/tables/tables_5_1.jpg", "caption": "Table 1: Choice model NLLs on human choice data sets. Bolded digits indicate a significant (p < 0.01) improvement over baselines (BT, BB, LCL).", "description": "This table compares the negative log-likelihood (NLL) scores of different choice models on four human choice datasets. The models compared are Bradley-Terry, Bower & Balzano, LCL, CRCS, and LC-CRCS. Lower NLL scores indicate better model fit to the data.  The table shows that CRCS and LC-CRCS models generally achieve lower NLL scores than the baseline models, indicating a better fit to the human choice data. The bolded numbers indicate statistically significant improvements (p<0.01) compared to the baseline models.", "section": "4 Experiments"}, {"figure_path": "nfq3GKfb4h/tables/tables_6_1.jpg", "caption": "Table 2: Consistency of inferred utility function with separately collected rankings on District-Smart. Bolded digits indicate a significant improvement over baselines (BT, BB, LCL).", "description": "This table presents the consistency of utility functions inferred by five different choice models with separately collected rankings on the District-Smart dataset.  The models are compared against baselines: Bradley-Terry, Bower & Balzano, and LCL.  The consistency is measured using Kendall's tau, indicating how well the ranking implied by the inferred utility parameters aligns with the human-provided rankings.  Bolded values highlight statistically significant improvements of CRCS and LC-CRCS over the baselines.", "section": "4.2 Evaluation on static human choice data"}, {"figure_path": "nfq3GKfb4h/tables/tables_14_1.jpg", "caption": "Table 1: Choice model NLLs on human choice data sets. Bolded digits indicate a significant (p < 0.01) improvement over baselines (BT, BB, LCL).", "description": "This table presents the negative log-likelihood (NLL) scores achieved by different choice models on four human choice datasets.  The models compared include Bradley-Terry, Bower & Balzano, LCL, CRCS, and LC-CRCS. Lower NLL indicates better model fit.  The table highlights statistically significant improvements (p<0.01) of CRCS and LC-CRCS over the baseline models (Bradley-Terry, Bower & Balzano, and LCL).", "section": "4 Experiments"}, {"figure_path": "nfq3GKfb4h/tables/tables_15_1.jpg", "caption": "Table 1: Choice model NLLs on human choice data sets. Bolded digits indicate a significant (p < 0.01) improvement over baselines (BT, BB, LCL).", "description": "This table presents the negative log-likelihood (NLL) scores for four different choice models on four human choice datasets.  The models compared are Bradley-Terry, Bower & Balzano, LCL (Linear Context Logit), CRCS (Computationally Rational Choice Surrogate), and LC-CRCS (Linear Context + CRCS). Lower NLL indicates better model fit to the data.  Bolded values highlight statistically significant improvements of CRCS and LC-CRCS over the baselines.", "section": "4 Experiments"}, {"figure_path": "nfq3GKfb4h/tables/tables_15_2.jpg", "caption": "Table 1: Choice model NLLs on human choice data sets. Bolded digits indicate a significant (p < 0.01) improvement over baselines (BT, BB, LCL).", "description": "This table presents the negative log-likelihood (NLL) scores for four different choice models on four human choice datasets.  The models compared are Bradley-Terry, Bower & Balzano, LCL, CRCS, and LC-CRCS. Lower NLL indicates better model fit to the data.  The table highlights statistically significant improvements (p<0.01) achieved by CRCS and LC-CRCS compared to the baseline models (Bradley-Terry, Bower & Balzano, and LCL).", "section": "4 Experiments"}, {"figure_path": "nfq3GKfb4h/tables/tables_16_1.jpg", "caption": "Table 1: Choice model NLLs on human choice data sets. Bolded digits indicate a significant (p < 0.01) improvement over baselines (BT, BB, LCL).", "description": "This table presents the negative log-likelihood (NLL) scores achieved by different choice models on four human choice datasets.  The models compared are Bradley-Terry (BT), Bower & Balzano (BB), Linear Context Logit (LCL), the proposed CRCS model, and the LC-CRCS model. Lower NLL scores indicate better model fit.  Bolded numbers highlight statistically significant improvements of CRCS and LC-CRCS over the baselines.", "section": "4 Experiments"}, {"figure_path": "nfq3GKfb4h/tables/tables_17_1.jpg", "caption": "Table 1: Choice model NLLs on human choice data sets. Bolded digits indicate a significant (p < 0.01) improvement over baselines (BT, BB, LCL).", "description": "This table presents the negative log-likelihood (NLL) scores achieved by different choice models on four distinct human choice datasets: Hotels, District-Smart, Car-Alt, and Dumbalska.  The models compared are Bradley-Terry (BT), Bower & Balzano (BB), Linear Context Logit (LCL), the proposed Computationally Rational Choice Surrogate (CRCS), and the proposed LC-CRCS model. Lower NLL scores indicate better model fit to the data. Bolded values highlight statistically significant improvements (p<0.01) of CRCS and LC-CRCS over the baselines.", "section": "4 Experiments"}, {"figure_path": "nfq3GKfb4h/tables/tables_19_1.jpg", "caption": "Table 1: Choice model NLLs on human choice data sets. Bolded digits indicate a significant (p < 0.01) improvement over baselines (BT, BB, LCL).", "description": "This table presents the negative log-likelihood (NLL) scores achieved by different choice models on four distinct human choice datasets: Hotels, District-Smart, Car-Alt, and Dumbalska.  The models compared include Bradley-Terry (BT), Bower & Balzano (BB), Linear Context Logit (LCL), Computationally Rational Choice Surrogate (CRCS), and LC-CRCS. Lower NLL scores indicate better model fit to the data.  Bolded values highlight statistically significant improvements of CRCS and LC-CRCS over the baselines.", "section": "4 Experiments"}, {"figure_path": "nfq3GKfb4h/tables/tables_21_1.jpg", "caption": "Table 1: Choice model NLLs on human choice data sets. Bolded digits indicate a significant (p < 0.01) improvement over baselines (BT, BB, LCL).", "description": "This table presents the negative log-likelihood (NLL) scores achieved by different choice models on four human choice datasets: Hotels, District-Smart, Car-Alt, and Dumbalska.  The models compared are Bradley-Terry (BT), Bower & Balzano (BB), Linear Context Logit (LCL), the computationally rational choice surrogate (CRCS), and the combined LC-CRCS model.  Lower NLL scores indicate better model fit to the data. Bolded values highlight statistically significant improvements of CRCS and LC-CRCS over the baselines.", "section": "4 Experiments"}]