[{"figure_path": "Tsb4dVtCHx/figures/figures_8_1.jpg", "caption": "Figure 1: Coefficient Estimation Path in Model 1", "description": "This figure shows the coefficient estimation paths for both adversarial training and group adversarial training in Model 1.  Each colored line represents a different coefficient, and the shaded area around the line indicates the standard error of the mean.  The x-axis shows the sample size, while the y-axis shows the estimated value of each coefficient.  The figure demonstrates how the estimated values of the coefficients change with increasing sample size for both methods and visually compares the performance of the two approaches.", "section": "4 Numerical Experiments"}, {"figure_path": "Tsb4dVtCHx/figures/figures_8_2.jpg", "caption": "Figure 2: Coefficient Estimation Path in Model 2", "description": "This figure displays the coefficient estimation paths for both adversarial training and group adversarial training in Model 2.  The x-axis represents the sample size, and the y-axis shows the estimated coefficient values. Multiple lines represent the estimations from five separate runs for each sample size.  The shaded regions around the lines indicate the standard error.  The figure shows how the estimated coefficients converge towards the ground truth values as the sample size increases, illustrating the effectiveness of both methods.  The legend provides the ground truth values for comparison.  This plot specifically compares the two different methods in the context of model 2.", "section": "4 Numerical Experiments"}, {"figure_path": "Tsb4dVtCHx/figures/figures_9_1.jpg", "caption": "Figure 3: Prediction Error in Model 1", "description": "This figure shows the prediction error in Model 1 for both adversarial training and group adversarial training. The x-axis represents the logarithm of the sample size, while the y-axis represents the logarithm of the prediction error. The shaded area represents the standard error of the mean. We can observe that the prediction error decreases as the sample size increases. Additionally, group adversarial training has a lower prediction error compared to adversarial training.", "section": "4 Numerical Experiments"}, {"figure_path": "Tsb4dVtCHx/figures/figures_9_2.jpg", "caption": "Figure 3: Prediction Error in Model 1", "description": "The figure shows the prediction error of both adversarial training and group adversarial training in Model 1 with different sample sizes. The prediction error is presented as log10(prediction error) versus log10(sample size). Error bars are included to show variability. The results suggest that group adversarial training leads to lower prediction error compared to adversarial training.", "section": "4 Numerical Experiments"}]