[{"figure_path": "YdfZP7qMzp/tables/tables_6_1.jpg", "caption": "Table 1: Performance of Video Recognition and Generation Methods. We evaluate on video recognition and class-conditioned image-to-video generation tasks. SEER† predicts 16 frames, while others predict 12 frames. Top-1 accuracy and FVD scores are reported. Baseline I adapts SVD to datasets with generative fine-tuning and then uses attentive-probing for classification. Baseline II fully finetunes SVD with classification supervision only in traditional classification framework.", "description": "This table compares the performance of various video recognition and generation methods, including the proposed GenRec model.  It shows the top-1 accuracy for video recognition on four datasets (SSV2, K400, SSV2, EK-100) and Fréchet Video Distance (FVD) scores for class-conditioned image-to-video generation on two datasets (SSV2, EK-100).  Two baselines are included: one using generative fine-tuning with attentive-probing, and the other fine-tuning with traditional classification supervision. The table highlights GenRec's competitive performance in both tasks and its advantage over baselines.", "section": "4.2 Main Results"}, {"figure_path": "YdfZP7qMzp/tables/tables_8_1.jpg", "caption": "Table 3: Relation between generation and recognition.", "description": "This table presents a quantitative comparison of the performance of the GenRec model on video recognition and generation tasks with limited frames. The \"Early Frames\" section shows accuracy (Acc↑) and Fréchet Video Distance (FVD↓) scores when only the initial frames of a video are visible, while the \"Limited Inter. Frames\" section provides the same metrics when only a limited number of frames are available.  The results highlight the relationship between the model's ability to generate videos and its performance on recognizing actions, indicating potential synergy between generation and recognition.", "section": "4.2 Main Results"}, {"figure_path": "YdfZP7qMzp/tables/tables_8_2.jpg", "caption": "Table 1: Performance of Video Recognition and Generation Methods. We evaluate on video recognition and class-conditioned image-to-video generation tasks. SEER† predicts 16 frames, while others predict 12 frames. Top-1 accuracy and FVD scores are reported. Baseline I adapts SVD to datasets with generative fine-tuning and then uses attentive-probing for classification. Baseline II fully finetunes SVD with classification supervision only in traditional classification framework.", "description": "This table presents a comparison of various video recognition and generation methods.  It shows the top-1 accuracy for video recognition on four datasets (SSV2, K400, SSV2, EK-100) and the Fréchet Video Distance (FVD) for image-to-video generation. Two baselines are included for comparison: Baseline I uses generative fine-tuning and attentive-probing; Baseline II uses full fine-tuning with classification supervision.  The table highlights GenRec's performance relative to state-of-the-art models.", "section": "4.2 Main Results"}, {"figure_path": "YdfZP7qMzp/tables/tables_8_3.jpg", "caption": "Table 1: Performance of Video Recognition and Generation Methods. We evaluate on video recognition and class-conditioned image-to-video generation tasks. SEER† predicts 16 frames, while others predict 12 frames. Top-1 accuracy and FVD scores are reported. Baseline I adapts SVD to datasets with generative fine-tuning and then uses attentive-probing for classification. Baseline II fully finetunes SVD with classification supervision only in traditional classification framework.", "description": "This table compares the performance of various video recognition and generation methods.  It shows the top-1 accuracy for video recognition on four datasets (SSV2, K400, SSV2, EK-100) and the Fréchet Video Distance (FVD) scores for class-conditioned image-to-video generation on two datasets (SSV2 and EK-100).  Two baseline methods are included for comparison, showing the effect of different training strategies on the overall performance.", "section": "4.2 Main Results"}, {"figure_path": "YdfZP7qMzp/tables/tables_9_1.jpg", "caption": "Table 1: Performance of Video Recognition and Generation Methods. We evaluate on video recognition and class-conditioned image-to-video generation tasks. SEER† predicts 16 frames, while others predict 12 frames. Top-1 accuracy and FVD scores are reported. Baseline I adapts SVD to datasets with generative fine-tuning and then uses attentive-probing for classification. Baseline II fully finetunes SVD with classification supervision only in traditional classification framework.", "description": "This table compares the performance of various video recognition and generation methods.  It shows classification accuracy (top-1 accuracy) on four datasets (SSV2, K400, SSV2, EK-100) and Fréchet Video Distance (FVD) scores for class-conditioned image-to-video generation.  Two baselines are included: one using generative fine-tuning with attentive probing and the other using full fine-tuning with classification supervision. The table highlights GenRec's competitive performance in both tasks.", "section": "4.2 Main Results"}, {"figure_path": "YdfZP7qMzp/tables/tables_14_1.jpg", "caption": "Table 7: Early action prediction on EK-100.", "description": "This table presents a detailed breakdown of early action prediction results on the EK-100 dataset.  It shows the accuracy (in percentage) achieved by three different methods (TemPr, MVD+, and GenRec) at varying observation ratios (p) representing the proportion of the video visible. The results are further categorized into Verb Obs., Noun Obs., and Action Obs., reflecting different aspects of action recognition.", "section": "4.2 Main Results"}, {"figure_path": "YdfZP7qMzp/tables/tables_14_2.jpg", "caption": "Table 1: Performance of Video Recognition and Generation Methods. We evaluate on video recognition and class-conditioned image-to-video generation tasks. SEER† predicts 16 frames, while others predict 12 frames. Top-1 accuracy and FVD scores are reported. Baseline I adapts SVD to datasets with generative fine-tuning and then uses attentive-probing for classification. Baseline II fully finetunes SVD with classification supervision only in traditional classification framework.", "description": "This table presents a comparison of various video recognition and generation methods.  It includes results for top-1 accuracy on several datasets (SSV2, K400, EK-100) and Fréchet Video Distance (FVD) scores for image-to-video generation.  Two baselines are included, representing different approaches to adapting the Stable Video Diffusion (SVD) model for these tasks. The table highlights GenRec's performance relative to state-of-the-art methods, demonstrating its ability to achieve competitive results on both video recognition and generation.", "section": "4.2 Main Results"}, {"figure_path": "YdfZP7qMzp/tables/tables_14_3.jpg", "caption": "Table 1: Performance of Video Recognition and Generation Methods. We evaluate on video recognition and class-conditioned image-to-video generation tasks. SEER† predicts 16 frames, while others predict 12 frames. Top-1 accuracy and FVD scores are reported. Baseline I adapts SVD to datasets with generative fine-tuning and then uses attentive-probing for classification. Baseline II fully finetunes SVD with classification supervision only in traditional classification framework.", "description": "This table compares the performance of various video recognition and generation methods.  It includes methods that don't use multi-modal alignment and those that do, highlighting the impact of this technique.  The table shows top-1 accuracy for video recognition on four datasets (SSV2, K400, SSV2, EK-100), and Fréchet Video Distance (FVD) scores for class-conditioned image-to-video generation.  Baselines are included to demonstrate the improvement achieved by the GenRec method.  The number of predicted frames (12 or 16) is noted for each method.", "section": "4.2 Main Results"}, {"figure_path": "YdfZP7qMzp/tables/tables_15_1.jpg", "caption": "Table 1: Performance of Video Recognition and Generation Methods. We evaluate on video recognition and class-conditioned image-to-video generation tasks. SEER† predicts 16 frames, while others predict 12 frames. Top-1 accuracy and FVD scores are reported. Baseline I adapts SVD to datasets with generative fine-tuning and then uses attentive-probing for classification. Baseline II fully finetunes SVD with classification supervision only in traditional classification framework.", "description": "This table compares the performance of various video recognition and generation methods.  It shows the top-1 accuracy for video recognition on four datasets (SSV2, K400, SSV2, EK-100) and the Fréchet Video Distance (FVD) scores for class-conditioned image-to-video generation on two datasets (SSV2, EK-100). Two baselines are included for comparison: Baseline I uses generative pre-training and attentive probing for classification, while Baseline II performs full fine-tuning for classification only. The table highlights GenRec's performance relative to these baselines and state-of-the-art methods.", "section": "4.2 Main Results"}, {"figure_path": "YdfZP7qMzp/tables/tables_15_2.jpg", "caption": "Table 1: Performance of Video Recognition and Generation Methods. We evaluate on video recognition and class-conditioned image-to-video generation tasks. SEER† predicts 16 frames, while others predict 12 frames. Top-1 accuracy and FVD scores are reported. Baseline I adapts SVD to datasets with generative fine-tuning and then uses attentive-probing for classification. Baseline II fully finetunes SVD with classification supervision only in traditional classification framework.", "description": "This table compares the performance of various video recognition and generation methods.  It shows top-1 accuracy for video recognition on four datasets (SSV2, K400, SSV2, EK-100) and Fréchet Video Distance (FVD) scores for class-conditioned image-to-video generation on two datasets (SSV2 and EK-100).  Two baselines are included: Baseline I uses a generative pre-training approach with attentive probing for classification; Baseline II fully fine-tunes a video diffusion model for classification.  The table highlights GenRec's competitive performance compared to state-of-the-art methods.", "section": "4.2 Main Results"}, {"figure_path": "YdfZP7qMzp/tables/tables_15_3.jpg", "caption": "Table 1: Performance of Video Recognition and Generation Methods. We evaluate on video recognition and class-conditioned image-to-video generation tasks. SEER† predicts 16 frames, while others predict 12 frames. Top-1 accuracy and FVD scores are reported. Baseline I adapts SVD to datasets with generative fine-tuning and then uses attentive-probing for classification. Baseline II fully finetunes SVD with classification supervision only in traditional classification framework.", "description": "This table compares the performance of various video recognition and generation methods.  It shows the top-1 accuracy for video recognition on four datasets (SSV2, K400, SSV2, EK-100) and Fréchet Video Distance (FVD) scores for class-conditioned image-to-video generation on two datasets (SSV2, EK-100).  Two baseline methods are included: one using generative fine-tuning and attentive-probing, and another fully fine-tuning a standard video diffusion model for classification. The table highlights GenRec's performance relative to these baselines and other state-of-the-art methods.", "section": "4.2 Main Results"}]