[{"figure_path": "ZYNYhh3ocW/tables/tables_7_1.jpg", "caption": "Table 1: Generation accuracy results. Impr. is the percentage decrease in wrong bits.", "description": "This table presents the accuracy of circuit generation using different methods: Basic DNAS, DNAS Skip, Darts-, and the proposed T-Net.  The results are shown for several benchmark circuits, categorized into 'Small' and 'Large' based on their size.  Accuracy is measured as the percentage of correctly predicted output bits.  The 'Wrongs' column indicates the number of incorrectly predicted bits.  'Impr.' represents the improvement in accuracy (reduction in wrong bits) achieved by T-Net compared to the other methods.", "section": "6.1 Comparative Evaluation"}, {"figure_path": "ZYNYhh3ocW/tables/tables_7_2.jpg", "caption": "Table 2: Generation size results. Init Node is generated by SOP or our T-Net and Opt Node is optimized by resyn2. Impr. represents the percentage decrease in nodes achieved by our approach.", "description": "This table compares the initial and optimized node counts of circuits generated using SOP and the proposed T-Net method.  The \"Init Node\" column shows the number of nodes in the circuit generated by either SOP or T-Net before optimization.  The \"Opt Node\" column shows the node count after optimization using the resyn2 tool. The \"Impr.\" column indicates the percentage improvement in node count achieved by the T-Net method compared to SOP.  The table is divided into \"Small\" and \"Large\" circuit categories based on the number of nodes.", "section": "6 Experiments"}, {"figure_path": "ZYNYhh3ocW/tables/tables_8_1.jpg", "caption": "Table 3: Optimization results. The term 'Impr.' is defined as the percentage decrease in the number of nodes achieved by our approach, relative to the traditional configuration.", "description": "This table presents a comparison of the number of nodes in circuits optimized using different methods.  The \"Tradition\" column shows the results using a traditional Sum-of-Products (SOP) method with the resyn2 operator.  The columns labeled \"2022 Teams\" and \"2023 Teams\" represent the results from the winning teams in the IWLS 2022 and 2023 competitions, respectively. Finally, the \"Ours\" column shows the results obtained using the authors' proposed method.  The \"Impr.\" column indicates the percentage improvement in node reduction achieved by the authors' approach compared to the traditional method.", "section": "6.1 Comparative Evaluation"}, {"figure_path": "ZYNYhh3ocW/tables/tables_8_2.jpg", "caption": "Table 4: Scalability results of transformed truth table on large circuits.", "description": "This table presents the scalability results of the proposed multi-label transformation method on two large circuits: LogicNets6 and Espresso9.  It shows the initial node count, the node count after decomposition, the percentage improvement in node count, the generation time before and after decomposition, the percentage improvement in generation time, the accuracy before and after decomposition, and the percentage improvement in the number of wrong bits. The results demonstrate that the multi-label transformation method significantly improves scalability by reducing both circuit size and generation time while maintaining high accuracy.", "section": "6.2 Scalability"}, {"figure_path": "ZYNYhh3ocW/tables/tables_9_1.jpg", "caption": "Table 5: Ablation results on four benchmarks of circuit.", "description": "This table presents the ablation study results, comparing the performance of different configurations of the proposed T-Net against a baseline.  It shows the impact of adding skip connection regularization (+con.), boolean hardness-aware loss (+con.+loss), and the triangle-shaped network architecture (+con.+loss+T). The results are evaluated on four different circuit benchmarks, demonstrating the effectiveness of each component in improving accuracy and reducing the number of nodes.", "section": "6.3 Ablation Study"}, {"figure_path": "ZYNYhh3ocW/tables/tables_17_1.jpg", "caption": "Table 6: Network Size of the two circuits evaluated in motivation.", "description": "This table presents the network sizes used for the DNAS and T-Net approaches in the motivation experiments. It compares the number of nodes, levels, width, and depth for the networks used to generate two example circuits (Espresso7 and LogicNets1). This provides context for the differences in the efficiency and scalability of the methods discussed in Section 4. The table helps to explain the observed challenges with DNAS concerning circuit accuracy and the curse of skip connections.", "section": "C Motivation"}, {"figure_path": "ZYNYhh3ocW/tables/tables_20_1.jpg", "caption": "Table 1: Generation accuracy results. Impr. is the percentage decrease in wrong bits.", "description": "This table presents the results of the circuit generation accuracy experiments comparing the proposed T-Net method against three baseline DNAS methods (Basic DNAS, DNAS Skip, Darts-) and a traditional SOP method.  The table shows the accuracy (percentage of correctly predicted outputs), the number of wrong bits, and the improvement in wrong bits achieved by T-Net compared to the baselines for several circuits of different sizes (small and large).  The results demonstrate the superior performance of the proposed T-Net.", "section": "6.1 Comparative Evaluation"}, {"figure_path": "ZYNYhh3ocW/tables/tables_21_1.jpg", "caption": "Table 1: Generation accuracy results. Impr. is the percentage decrease in wrong bits.", "description": "This table presents the accuracy of circuit generation using four different methods: Basic DNAS, DNAS Skip, Darts-, and T-Net (the authors' method).  For several benchmark circuits of varying sizes, the table shows the accuracy (Acc. (%)), number of wrong bits (Wrongs), and the improvement in wrong bits compared to the Basic DNAS method (Impr. (%)) for each method. The results demonstrate the superior performance of T-Net in generating highly accurate circuits, with significantly fewer errors compared to other methods.", "section": "6.1 Comparative Evaluation"}, {"figure_path": "ZYNYhh3ocW/tables/tables_22_1.jpg", "caption": "Table 9: Generation size results. Init Node is generated by SOP or our T-Net and Opt Node is optimized by resyn2. Impr. represents the percentage decrease in nodes achieved by our approach.", "description": "This table presents a comparison of the initial and optimized circuit sizes generated by the traditional Sum-of-Products (SOP) method and the proposed T-Net method.  For each circuit benchmark, it shows the initial number of nodes generated by SOP and T-Net. Then, the table shows the optimized number of nodes obtained after applying the resyn2 optimization tool to both the SOP-generated and T-Net-generated circuits. Finally, the table highlights the improvement in node count achieved by T-Net compared to SOP, expressed as a percentage decrease in the number of nodes.", "section": "6 Experiments"}, {"figure_path": "ZYNYhh3ocW/tables/tables_22_2.jpg", "caption": "Table 3: Optimization results. The term 'Impr.' is defined as the percentage decrease in the number of nodes achieved by our approach, relative to the traditional configuration.", "description": "This table compares the number of nodes in circuits optimized using different methods.  The \"Tradition\" column shows results from a traditional method (SOP+resyn2). The \"2022 Teams\" and \"2023 Teams\" columns represent results from winning teams in the IWLS 2022 and 2023 competitions, respectively. The \"Ours\" column shows the results obtained using the authors' proposed method (T-Net). The \"Impr. (%)↑\" column indicates the percentage improvement in node reduction achieved by the authors' approach compared to the traditional method.", "section": "6 Experiments"}, {"figure_path": "ZYNYhh3ocW/tables/tables_22_3.jpg", "caption": "Table 11: Sensitivity analysis on different initialization.", "description": "This table presents the results of a sensitivity analysis performed on four different circuits using three distinct random initializations. It demonstrates the robustness of the T-Net approach by showing that it consistently achieves 100% accuracy across various random initializations, highlighting its stability in network depth and ability to avoid getting stuck in local optima.", "section": "E.3 Sensitivity Analysis"}, {"figure_path": "ZYNYhh3ocW/tables/tables_23_1.jpg", "caption": "Table 12: Sensitivity analysis on different initial network sizes.", "description": "This table presents the results of a sensitivity analysis conducted to evaluate the robustness of the proposed T-Net model to variations in the initial network architecture.  Specifically, it investigates how changes in the width and depth of the network's two blocks (upper and lower) affect the model's accuracy in generating circuits.  The table showcases the consistent accuracy (100%) achieved across various initial network configurations, demonstrating the model's resilience to variations in initial architecture.", "section": "6.3 Ablation Study"}, {"figure_path": "ZYNYhh3ocW/tables/tables_23_2.jpg", "caption": "Table 13: Sensitivity analysis on different network depth.", "description": "This table presents the results of a sensitivity analysis conducted on the LogicNets2 circuit to determine the optimal network depth for accurate circuit generation.  The analysis varies the network depth while keeping other parameters consistent. It shows that shallow networks lack sufficient capacity to generate circuits exactly, while excessively deep networks result in redundancy. The optimal depth appears to be around 25, balancing accuracy and efficiency.", "section": "6.3 Ablation Study"}, {"figure_path": "ZYNYhh3ocW/tables/tables_23_3.jpg", "caption": "Table 14: Analysis T-Net on circuits with extreme multiple POs.", "description": "This table compares the performance of a rectangular network and the proposed T-Net in generating circuits with a large number of primary outputs (POs).  It demonstrates that the T-Net, with its triangular structure, can effectively handle circuits with many POs, achieving 100% accuracy with fewer nodes than the rectangular network.", "section": "E.4 Other Experiments"}]