[{"figure_path": "LXz1xIEBkF/figures/figures_4_1.jpg", "caption": "Figure 1: Bloom's taxonomy [15] applied to ManeuverGame. For a given problem, a subject must first recall the meaning of the information they're being presented with (e.g., a formal specification), and understand it in the given context (grid world). Applying these concepts in ManeuverGame enables the subject to analyze different trajectories, both valid and invalid, under a trial-and-error process. Evaluating the trajectories, a subject is able to hone in on specifications that are both valid and meet the specification, allowing them to create multiple such specifications. This process repeats itself for new problems.", "description": "This figure illustrates how Bloom's taxonomy of learning is applied to the ManeuverGame experiment. It shows how the process of understanding, applying, analyzing, evaluating, and creating specifications within the game's context involves different cognitive levels and leads to refining understanding of policies by iterating through the process multiple times.", "section": "3 Methods"}, {"figure_path": "LXz1xIEBkF/figures/figures_6_1.jpg", "caption": "Figure 2: STEM experience vs. validation score by experiment condition. Horizontal jitter was added to visually separate points. Linear fit is shown. Displayed r and p values were calculated using Spearman's coefficient.", "description": "This figure displays the correlation between STEM experience and validation scores across three experimental conditions: Active Learning without Feedback, Active Learning with Feedback, and Control.  The x-axis represents STEM experience, and the y-axis represents validation scores (points).  Each point represents a participant.  Horizontal jitter has been applied to spread out points with overlapping x-values for better visualization. A line of best fit is displayed for each condition, along with the Spearman's rank correlation coefficient (r) and its associated p-value. The results indicate varying degrees of correlation between STEM experience and validation performance across different experimental setups.", "section": "5 Results"}, {"figure_path": "LXz1xIEBkF/figures/figures_7_1.jpg", "caption": "Figure 3: Combined heat map and boxplot (same data) showing satisfaction of specification in trajectory generation by correctness for valid and invalid ground truth. Each datapoint represents one response to a validation satisfaction question.", "description": "This figure shows the relationship between the correctness of participants' responses and whether the generated trajectories satisfied the specification. It's broken down by whether the specification was valid or invalid.  The heatmap shows the distribution of counts for each combination of response correctness (correct/incorrect) and trajectory satisfaction (satisfied/not satisfied) and the boxplots show the percentage of satisfactory trajectories for each combination.", "section": "5.3 Trajectory Analysis"}, {"figure_path": "LXz1xIEBkF/figures/figures_14_1.jpg", "caption": "Figure 4: Formal Methods Familiarity vs. Validation Score. Horizontal jitter was added to visually separate points. Displayed r and p values were calculated using Spearman’s coefficient but a linear fit is shown.", "description": "This figure shows the correlation between participants’ self-reported familiarity with formal methods and their performance on the validation task.  The horizontal jitter helps to visualize individual data points more clearly, and the low r value (0.196) and high p-value (0.209) indicate that there is no statistically significant correlation between formal methods familiarity and validation performance.", "section": "5 Results"}, {"figure_path": "LXz1xIEBkF/figures/figures_14_2.jpg", "caption": "Figure 5: Participant confidence in their answer when their answer was actually correct vs incorrect, split by experimental condition.", "description": "This figure shows box plots illustrating the level of confidence participants reported for their answers, categorized by whether their answers were correct or incorrect. The data is further broken down by the three experimental conditions: Active Learning without Feedback, Active Learning with Feedback, and Control.  The p-values and effect sizes (Cohen's d) are displayed above each group of box plots, showing the statistical significance of the differences in confidence between correct and incorrect responses within each condition.", "section": "5 Results"}, {"figure_path": "LXz1xIEBkF/figures/figures_14_3.jpg", "caption": "Figure 6: Participants' Average Confidence vs. STEM Experience when Correct and Incorrect. Horizontal jitter is shown to visually separate points. The correlation was calculated using Spearman's coefficient, but a linear fit is shown.", "description": "This figure shows two scatter plots, one for correct answers and one for incorrect answers, depicting the relationship between participants' average confidence and their STEM experience.  The x-axis represents STEM experience, and the y-axis represents average confidence. A linear regression line is plotted for each dataset.  The correlation coefficient (r) and p-value are displayed for each plot to show the statistical strength of the correlation.  The plot suggests that those with more STEM experience tend to exhibit higher confidence, especially when giving incorrect answers.", "section": "5 Results"}, {"figure_path": "LXz1xIEBkF/figures/figures_15_1.jpg", "caption": "Figure 7: Subject's average confidence across all questions vs total validation score for each of the experimental learning conditions. A linear fit is shown but correlations were calculated using Spearman's coefficient. All of the correlations were positive but none were found to be significant with the Bonferroni correction (a = 0.05/3 = 0.016).", "description": "This figure displays the correlation between the average confidence levels and the total validation score achieved by participants across different experimental conditions (active learning with and without feedback, and control).  A linear fit is shown for visualization purposes, but statistical significance was determined using Spearman's correlation coefficient, and the Bonferroni correction was applied to account for multiple comparisons.  The results indicate a positive correlation in all conditions, suggesting higher average confidence is generally associated with higher scores; however, none of these correlations reach statistical significance.", "section": "5 Results"}]