[{"figure_path": "MncgmW8b6q/tables/tables_5_1.jpg", "caption": "Table 1: Comparison of the representation power of the main dynamical metrics (lower is better). β, β' and (A2, A1, A0, B2, B1, Bo) provide little value for the initial clustering and are not shown.", "description": "This table presents the Davies-Bouldin index for different metrics used in clustering polynomial continued fractions.  A lower Davies-Bouldin index indicates better separation between clusters.  The table shows that the irrationality measure (δ) and certain growth factors of the continued fraction's denominator (qn) and error rate (e(n)) are more effective for clustering than simply using the limit (L) of the continued fraction.", "section": "3.5 Choice of Metrics for Clustering"}, {"figure_path": "MncgmW8b6q/tables/tables_13_1.jpg", "caption": "Table 2: Comparison between 1000 point fit results and 5 point fits results (even spread and logarithmic spread).", "description": "This table compares the results of curve fitting using 1000 data points against curve fitting using only 5 data points.  The goal was to determine if using only 5 data points would provide a sufficient approximation for large-scale analysis. The table shows the relative error averages for both even and logarithmic data point spreads for the growth coefficients of  \n\n*   Convergence rate (ε(n))\n*   Denominator growth rate (q̃n)", "section": "A Numerical Measurements, Curve Fitting and Validation of Formulas"}, {"figure_path": "MncgmW8b6q/tables/tables_16_1.jpg", "caption": "Table 4: Continued fractions converging to linear fractional transformations of the Golden Ratio φ, found using the top left cluster of Figure 3b. Numerous data points in this cluster exhibit identical sequence dynamics and are equivalent under the inflation and index indentation transformations. The equivalent data points create families of continued fractions in the cluster. Discrepancies between the calculated irrationality measure within the same family is ascribed to numerical inaccuracies, typically on the order 0.001. However, when comparing families, discrepancies in the irrationality measure rise to a magnitude of 0.04, suggesting potential deeper distinctions among these PCFs.", "description": "This table shows examples of continued fractions converging to linear fractional transformations of the golden ratio (φ).  It demonstrates how seemingly different continued fractions can share the same underlying dynamic behavior and be related through simple transformations (inflation and index indentation). The table highlights the consistency of the irrationality measure within families of equivalent fractions and shows a slight increase in the discrepancy between families, which suggests deeper mathematical differences.", "section": "D Scalability to Larger Datasets"}, {"figure_path": "MncgmW8b6q/tables/tables_26_1.jpg", "caption": "Table 5: This is a table showing the automatically generated conjectured formulas that were analytically proven. For the method of proving, see appendix A.2. Note that lines 1, 4 and 7 are proven infinite families of formulas, generalized from the cases found in the dataset.", "description": "This table presents a list of formulas for mathematical constants that were automatically generated by the system and then analytically proven.  The table shows the polynomials used to define the continued fraction, the convergence dynamics (h1(n), h2(n)), and the resulting mathematical constant.  Lines 1, 4, and 7 represent infinite families of formulas, derived from patterns discovered in the dataset. Appendix A.2 provides details on the methods used for analytical proof.", "section": "G List of Proven Formulas"}, {"figure_path": "MncgmW8b6q/tables/tables_27_1.jpg", "caption": "Table 5: This is a table showing the automatically generated conjectured formulas that were analytically proven. For the method of proving, see appendix A.2. Note that lines 1, 4 and 7 are proven infinite families of formulas, generalized from the cases found in the dataset.", "description": "This table presents formulas for mathematical constants that were automatically generated and then analytically proven.  Each row shows a continued fraction formula, along with its constituent polynomials a<sub>n</sub> and b<sub>n</sub>,  helper polynomials h<sub>1</sub>(n) and h<sub>2</sub>(n), a function f(n), and the resulting mathematical constant. Note that some rows represent infinite families of formulas, derived from specific cases found in the data.", "section": "G List of Proven Formulas"}]