[{"figure_path": "mAdGQ1Hh3L/figures/figures_1_1.jpg", "caption": "Figure 1: Analysis of the input-dependent matrices in SSMs. We investigate domain discrepancy in the input sequence x, response sequence y, and the input-dependent matrices A, B, and C. The results indicate that the input-dependent matrices can accumulate the domain-specific features during the recurrent process, potentially increasing domain gap. We experiment on PACS [24] with Sketch as the target domain, analyzing the representations from the last block of VMamba backbone [22].", "description": "This figure analyzes how domain discrepancy accumulates in the input-dependent matrices of State Space Models (SSMs).  It shows that these matrices, A, B, and C, accumulate domain-specific features during the recurrent process, leading to a larger domain gap between the source and target domains. The experiment uses the PACS dataset with Sketch as the target domain, examining the representations from the final layer of a VMamba model. The bar charts illustrate the domain distances in the input sequence (x), the output sequence (y), and the input-dependent matrices (A, B, C) for both a baseline model and two proposed methods (START-M and START-X), demonstrating how START-M and START-X reduce the domain discrepancies.", "section": "1 Introduction"}, {"figure_path": "mAdGQ1Hh3L/figures/figures_5_1.jpg", "caption": "Figure 2: Overall Architecture of the Proposed START Framework. The core of the START framework is the Saliency-driven Token-Aware Transformation, which uses a saliency-driven scheme to localize tokens targeted by input-dependent matrices, subsequently perturbing domain-specific style information within these tokens. We designed two variants: START-M, which uses input-dependent matrices, and START-X, which uses input sequences to compute saliency.", "description": "The figure illustrates the overall architecture of the proposed START framework.  The framework's core is the Saliency-driven Token-Aware Transformation module, which uses a saliency-driven method to identify tokens in the input sequence that are heavily influenced by the model's input-dependent matrices (A, B, C).  Domain-specific style information within these identified tokens is then perturbed. Two variants are presented: START-M, which uses the input-dependent matrices themselves to calculate saliency, and START-X, which uses the input sequences directly.  The process involves calculating saliency scores, selecting salient tokens based on these scores, and then replacing the selected tokens with style-perturbed versions via style interpolation.  The final output is an augmented sequence that incorporates the style perturbations.", "section": "3.3 Saliency-driven Token-Aware Transformation for Mamba"}, {"figure_path": "mAdGQ1Hh3L/figures/figures_8_1.jpg", "caption": "Figure 2: Overall Architecture of the Proposed START Framework. The core of the START framework is the Saliency-driven Token-Aware Transformation, which uses a saliency-driven scheme to localize tokens targeted by input-dependent matrices, subsequently perturbing domain-specific style information within these tokens. We designed two variants: START-M, which uses input-dependent matrices, and START-X, which uses input sequences to compute saliency.", "description": "This figure illustrates the overall architecture of the START framework, focusing on the core component: Saliency-driven Token-Aware Transformation.  This transformation uses a saliency-driven method to identify tokens within input-dependent matrices that are heavily influenced by domain-specific style information.  These tokens are then selectively perturbed to encourage the model to learn more domain-invariant features. The figure highlights two variants: START-M, using the input-dependent matrices directly for saliency calculation, and START-X, which uses the input sequences for saliency estimation.", "section": "3.3 Saliency-driven Token-Aware Transformation for Mamba"}, {"figure_path": "mAdGQ1Hh3L/figures/figures_20_1.jpg", "caption": "Figure 2: Overall Architecture of the Proposed START Framework. The core of the START framework is the Saliency-driven Token-Aware Transformation, which uses a saliency-driven scheme to localize tokens targeted by input-dependent matrices, subsequently perturbing domain-specific style information within these tokens. We designed two variants: START-M, which uses input-dependent matrices, and START-X, which uses input sequences to compute saliency.", "description": "The figure illustrates the overall architecture of the proposed START framework for domain generalization.  It highlights the core component, the Saliency-driven Token-Aware Transformation. This transformation identifies salient tokens within the input (using either input-dependent matrices – START-M – or the input sequence itself – START-X) and selectively perturbs these tokens to reduce domain-specific style information. This process aims to make the model more robust to domain shifts by focusing on domain-invariant features.", "section": "3.3 Saliency-driven Token-Aware Transformation for Mamba"}]