[{"figure_path": "mAdGQ1Hh3L/tables/tables_6_1.jpg", "caption": "Table 1: Performance (%) comparisons with the SOTA DG methods on PACS and OfficeHome.", "description": "This table compares the performance of the proposed START model against state-of-the-art (SOTA) domain generalization (DG) methods on two benchmark datasets: PACS and OfficeHome.  It shows the average performance across different domains within each dataset,  allowing for a comparison of the methods' ability to generalize to unseen target domains.  The table includes the number of parameters for each model.  It's structured to facilitate comparison between different types of DG methods such as CNN-based, ViT-based, and SSM-based models.", "section": "4.2 Main Results"}, {"figure_path": "mAdGQ1Hh3L/tables/tables_7_1.jpg", "caption": "Table 1: Performance (%) comparisons with the SOTA DG methods on PACS and OfficeHome.", "description": "This table presents the performance comparison of the proposed START method with state-of-the-art (SOTA) domain generalization (DG) methods on two benchmark datasets: PACS and OfficeHome.  The table shows the accuracy (%) achieved by each method on different domains within each dataset, providing a comprehensive evaluation of the model's generalization ability across various visual domains. The results are crucial for demonstrating the superiority of START over existing methods.", "section": "4 Experiments"}, {"figure_path": "mAdGQ1Hh3L/tables/tables_8_1.jpg", "caption": "Table 1: Performance (%) comparisons with the SOTA DG methods on PACS and OfficeHome.", "description": "This table compares the performance of the proposed START model with state-of-the-art (SOTA) domain generalization (DG) methods on two benchmark datasets: PACS and OfficeHome.  The table shows the accuracy (%) achieved by each method on various subsets of each dataset.  It allows for a comparison of different approaches, including those based on CNNs, ViTs, and SSMs.  The performance is broken down by domain within each dataset, along with an average accuracy across all domains. The number of parameters used by each model is also included for reference.", "section": "4 Experiments"}, {"figure_path": "mAdGQ1Hh3L/tables/tables_8_2.jpg", "caption": "Table 1: Performance (%) comparisons with the SOTA DG methods on PACS and OfficeHome.", "description": "This table compares the performance of the proposed START method with state-of-the-art (SOTA) domain generalization (DG) methods on two benchmark datasets: PACS and OfficeHome.  The table shows the accuracy (%) achieved by each method on each of the sub-domains within each dataset, as well as an average accuracy across all sub-domains.  It allows for a comparison of different approaches, including those based on Convolutional Neural Networks (CNNs), Vision Transformers (ViTs), and State Space Models (SSMs). The number of parameters for each model is also provided, allowing comparison of model complexity.", "section": "4 Experiments"}, {"figure_path": "mAdGQ1Hh3L/tables/tables_8_3.jpg", "caption": "Table 1: Performance (%) comparisons with the SOTA DG methods on PACS and OfficeHome.", "description": "This table presents a comparison of the proposed START model's performance against state-of-the-art (SOTA) domain generalization (DG) methods on two benchmark datasets: PACS and OfficeHome.  The results are shown in terms of accuracy percentages, broken down by individual domain and averaged across all domains.  The table allows for a direct comparison of the proposed method against various existing approaches based on CNNs and ViTs, highlighting the relative strengths and weaknesses of each method in terms of accuracy and parameter count.", "section": "4 Experiments"}, {"figure_path": "mAdGQ1Hh3L/tables/tables_9_1.jpg", "caption": "Table 6: Domain gaps within input-dependent matrices.", "description": "This table shows a comparison of domain gaps within input-dependent matrices (Δ, B, C) and feature maps (Feat.) across different methods.  Lower values indicate smaller domain gaps, suggesting better generalization ability.  The methods compared include a baseline and several state-of-the-art domain generalization techniques alongside the proposed START methods (START-M and START-X).  The results demonstrate that START-M and START-X effectively reduce the domain discrepancy in input-dependent matrices, thus improving the model’s generalization performance.", "section": "4.3 Ablation Study and Analytical Experiments"}, {"figure_path": "mAdGQ1Hh3L/tables/tables_17_1.jpg", "caption": "Table 1: Performance (%) comparisons with the SOTA DG methods on PACS and OfficeHome.", "description": "This table compares the performance of the proposed START model against state-of-the-art (SOTA) domain generalization (DG) methods on two benchmark datasets: PACS and OfficeHome.  The table shows the average accuracy (%) achieved by each method across different domains within each dataset.  The comparison highlights START's performance relative to other methods based on different architectures (CNNs, ViTs, and SSMs).  Parameters (number of parameters in millions) are also provided for each model.", "section": "4 Experiments"}, {"figure_path": "mAdGQ1Hh3L/tables/tables_18_1.jpg", "caption": "Table 1: Performance (%) comparisons with the SOTA DG methods on PACS and OfficeHome.", "description": "This table presents a comparison of the proposed START model's performance against state-of-the-art (SOTA) domain generalization (DG) methods on two benchmark datasets: PACS and OfficeHome.  The table shows the average accuracy across different domains (Art, Cartoon, Photo, Sketch for PACS; Art, Clipart, Product, Real for OfficeHome) as well as the number of model parameters for each method.  This allows for a comparison of both accuracy and computational efficiency between different approaches to domain generalization.", "section": "4 Experiments"}, {"figure_path": "mAdGQ1Hh3L/tables/tables_18_2.jpg", "caption": "Table 1: Performance (%) comparisons with the SOTA DG methods on PACS and OfficeHome.", "description": "This table compares the performance of the proposed START method with state-of-the-art (SOTA) domain generalization (DG) methods on two benchmark datasets: PACS and OfficeHome.  The table shows the accuracy (%) achieved by each method on different domains within each dataset.  It also provides information on the number of parameters (Params) used by each model.  The results demonstrate the effectiveness of START compared to existing CNN-based, ViT-based, and SSM-based methods.", "section": "4 Experiments"}, {"figure_path": "mAdGQ1Hh3L/tables/tables_18_3.jpg", "caption": "Table 1: Performance (%) comparisons with the SOTA DG methods on PACS and OfficeHome.", "description": "This table compares the performance of the proposed START model with state-of-the-art (SOTA) domain generalization (DG) methods on two benchmark datasets: PACS and OfficeHome.  The table shows the average accuracy achieved by each method across different domains within each dataset.  Metrics include accuracy for individual domains (Art, Cartoon, Photo, Sketch for PACS; Art, Clipart, Product, Real for OfficeHome) and an average accuracy across all domains within each dataset.", "section": "4.2 Main Results"}, {"figure_path": "mAdGQ1Hh3L/tables/tables_18_4.jpg", "caption": "Table 1: Performance (%) comparisons with the SOTA DG methods on PACS and OfficeHome.", "description": "This table compares the performance of the proposed START method against state-of-the-art (SOTA) domain generalization (DG) methods on two benchmark datasets: PACS and OfficeHome.  It shows the accuracy (%) achieved by each method on different domains within each dataset.  The table also includes the number of parameters (Params) for each method.  The average accuracy across all domains is also reported (Avg.).  The results demonstrate the superior performance of the START method compared to existing SOTA approaches.", "section": "4 Experiments"}, {"figure_path": "mAdGQ1Hh3L/tables/tables_19_1.jpg", "caption": "Table 1: Performance (%) comparisons with the SOTA DG methods on PACS and OfficeHome.", "description": "This table compares the performance of the proposed START method with state-of-the-art (SOTA) domain generalization (DG) methods on two benchmark datasets: PACS and OfficeHome.  The table shows the accuracy (%) achieved by each method on different subsets (Art, Cartoon, Photo, Sketch for PACS; Art, Clipart, Product, Real for OfficeHome) and the average accuracy across all subsets.  The 'Params' column indicates the number of model parameters.", "section": "4.2 Main Results"}, {"figure_path": "mAdGQ1Hh3L/tables/tables_19_2.jpg", "caption": "Table 1: Performance (%) comparisons with the SOTA DG methods on PACS and OfficeHome.", "description": "This table presents a comparison of the proposed START method's performance with state-of-the-art (SOTA) domain generalization (DG) methods on two benchmark datasets: PACS and OfficeHome.  The table shows the average accuracy (%) achieved by each method across different domains within each dataset.  The performance metrics include accuracy on individual domains as well as an average accuracy across all domains.  This allows for a direct comparison of the effectiveness of the different DG approaches in handling domain shift and generalization to unseen domains.  The table includes the number of parameters (Params) for each model, indicating model complexity.", "section": "4 Experiments"}, {"figure_path": "mAdGQ1Hh3L/tables/tables_20_1.jpg", "caption": "Table 1: Performance (%) comparisons with the SOTA DG methods on PACS and OfficeHome.", "description": "This table compares the performance of the proposed START method with state-of-the-art (SOTA) domain generalization (DG) methods on two benchmark datasets: PACS and OfficeHome.  It shows the average accuracy across multiple domains for each method, along with the number of parameters used by each model. The table helps illustrate the effectiveness of START compared to other existing techniques in terms of accuracy and computational efficiency.  The results are broken down by domain within each dataset to give a more detailed view of the model performance across diverse visual characteristics.", "section": "4 Experiments"}]