[{"figure_path": "I2gVmVRgNk/figures/figures_6_1.jpg", "caption": "Figure 1: (a-b) Performance of (a) EVORATE / (b) concat and separate critic on mutual information estimation on sequential data with correspondence. (c-d) Performance of EVORATEw on mutual information estimation on two consecutive time steps without correspondence, where g is (c) an identity function / (d) neural nets.", "description": "This figure compares the performance of the proposed EVORATE and EVORATEw methods for estimating mutual information in sequential data.  Panels (a) and (b) show the results for data with clear correspondence between time steps, comparing EVORATE with two different critic network architectures (concatenated and separable). Panels (c) and (d) illustrate the performance of EVORATEw, designed for data without direct correspondence, using either an identity function or a neural network for the encoding (g). The plots show the estimated mutual information (MI) over training steps, compared against the true MI value.", "section": "6.1 Multivariate Gaussians with tractable MI"}, {"figure_path": "I2gVmVRgNk/figures/figures_6_2.jpg", "caption": "Figure 1: (a-b) Performance of (a) EVORATE / (b) concat and separate critic on mutual information estimation on sequential data with correspondence. (c-d) Performance of EVORATEw on mutual information estimation on two consecutive time steps without correspondence, where g is (c) an identity function / (d) neural nets.", "description": "This figure shows the performance of EVORATE and EVORATEw on mutual information estimation tasks.  Panels (a) and (b) compare the performance of EVORATE using different critic network architectures (concatenated vs. separable) on sequential data *with* correspondence between data points.  Panels (c) and (d) demonstrate the performance of EVORATEw, which addresses situations *without* correspondence, using different encoder functions (identity vs. neural network). The plots illustrate how the estimated mutual information converges to the true mutual information over training steps under various conditions.", "section": "Experiment"}, {"figure_path": "I2gVmVRgNk/figures/figures_8_1.jpg", "caption": "Figure 1: (a-b) Performance of (a) EVORATE / (b) concat and separate critic on mutual information estimation on sequential data with correspondence. (c-d) Performance of EVORATEw on mutual information estimation on two consecutive time steps without correspondence, where g is (c) an identity function / (d) neural nets.", "description": "This figure shows the performance comparison of EVORATE and EVORATEw in mutual information estimation.  (a) and (b) demonstrate EVORATE's performance on sequential data *with* correspondence, comparing different critic function architectures.  (c) and (d) illustrate EVORATEw's performance on data *without* correspondence, showcasing the impact of different encoding functions (g) on the estimation accuracy.", "section": "6.1 Multivariate Gaussians with tractable MI"}]