[{"figure_path": "I6tBNcJE2F/figures/figures_0_1.jpg", "caption": "Figure 1: Results of cutting-edge methods. Our CORUN better restores hazy-contaminated details. Furthermore, techniques optimized by our Colabator framework, indicated by a \"+\" suffix, exhibit strong generalization in haze removal and color correction.", "description": "This figure shows a comparison of the results obtained by several state-of-the-art image dehazing methods on a set of real-world hazy images.  The methods include DGUN, PDN, and CORUN. The results demonstrate that CORUN outperforms the other methods in terms of detail preservation and color correction, especially when combined with the Colabator framework. The '+' suffix indicates methods enhanced by the Colabator framework, showcasing improved generalization capabilities for haze removal and color correction.", "section": "1 Introduction"}, {"figure_path": "I6tBNcJE2F/figures/figures_2_1.jpg", "caption": "Figure 2: The architecture of the proposed CORUN with the details at kth stage.", "description": "This figure illustrates the architecture of the Cooperative Unfolding Network (CORUN) proposed in the paper.  CORUN is a deep unfolding network that cooperatively models atmospheric scattering and image scenes. The figure shows the network's structure, including the Transmission and Scene Gradient Descent Modules (TGDM and SGDM) and the Cooperative Proximal Mapping Modules (T-CPMM and S-CPMM) at each stage.  The details of TGDM and SGDM are also shown, illustrating how they iteratively refine the transmission map and dehazed image.  The figure uses various symbols to represent different operations within the network, such as element-wise summation, subtraction, multiplication, dot product, etc. This visual representation helps readers understand how CORUN works.", "section": "3.1 Cooperative Unfolding Network"}, {"figure_path": "I6tBNcJE2F/figures/figures_4_1.jpg", "caption": "Figure 3: The plug-and-play Coherence-based Pseudo-label Generator paradigm.", "description": "This figure illustrates the pipeline of the proposed Coherence-based label generator (Colabator). It shows a two-stage process: pre-training and fine-tuning.  During pre-training, a dehazing network is trained on synthetic hazy and ground truth images.  Fine-tuning utilizes a mean-teacher framework where a teacher network generates pseudo-labels for real-world hazy images. These labels are then used to train a student network.  Colabator leverages a combination of strong and weak augmentations, a CLIP-based image quality assessment, and an optimal label pool to generate high-quality pseudo-labels, addressing the scarcity of real-world paired data for training.", "section": "3.2 Coherence-based Pseudo Labeling by Colabator"}, {"figure_path": "I6tBNcJE2F/figures/figures_6_1.jpg", "caption": "Figure 4: Visual comparison on RTTS[40]. Please zoom in for a better view.", "description": "This figure compares the performance of several state-of-the-art real-world image dehazing methods on the RTTS dataset.  Each row shows a hazy input image followed by the dehazed results from PDN, DAD, PSD, D4, DGUN, RIDCP, and the proposed CORUN method.  The comparison highlights the differences in how well each method handles various types of haze, detail preservation, and color accuracy.", "section": "4 Experiments"}, {"figure_path": "I6tBNcJE2F/figures/figures_7_1.jpg", "caption": "Figure 4: Visual comparison on RTTS[40]. Please zoom in for a better view.", "description": "This figure compares the performance of various state-of-the-art dehazing methods on the RTTS dataset.  It shows the original hazy image alongside the results produced by each method, allowing for a visual comparison of their effectiveness in terms of haze removal, color correction, and detail preservation. Zooming in is recommended to better appreciate the differences in detail.", "section": "4 Experiments"}, {"figure_path": "I6tBNcJE2F/figures/figures_8_1.jpg", "caption": "Figure 4: Visual comparison on RTTS[40]. Please zoom in for a better view.", "description": "This figure compares the results of various state-of-the-art image dehazing methods on the RTTS dataset.  Each row represents a different hazy image and its dehazed counterparts from several methods, showing the performance of each method in restoring details and colors. The \"Ours\" column shows the results obtained by the proposed method (CORUN) in the paper, highlighting its improved detail restoration and color correction compared to other methods.", "section": "4 Experiments"}, {"figure_path": "I6tBNcJE2F/figures/figures_9_1.jpg", "caption": "Figure 4: Visual comparison on RTTS[40]. Please zoom in for a better view.", "description": "This figure compares the results of different dehazing methods on the RTTS dataset.  Each row shows a hazy input image and the results from various methods: PDN, DAD, PSD, D4, DGUN, RIDCP, and the proposed method (Ours).  The results show that the proposed method generally produces more visually appealing and detailed outputs, preserving finer details and colours more faithfully than other methods, particularly in complex scenes.", "section": "4 Experiments"}, {"figure_path": "I6tBNcJE2F/figures/figures_16_1.jpg", "caption": "Figure 4: Visual comparison on RTTS[40]. Please zoom in for a better view.", "description": "This figure compares the results of several state-of-the-art real-world image dehazing methods on the RTTS dataset.  It shows a series of hazy images and their corresponding dehazed versions produced by different methods.  The goal is to illustrate the visual quality improvements achieved by the proposed CORUN method. The highlighted regions in the image comparison call attention to the differences between the different methods, such as the level of detail preserved, color accuracy, and the removal of haze.", "section": "4 Experiments"}]