[{"figure_path": "TbPv0qFnHO/figures/figures_1_1.jpg", "caption": "Figure 1: (a) Hierarchical diagram in Video Violence Detection (VVD). (b) Our DSRL enhances the detection of ambiguous violence by combining Euclidean and Hyperbolic spaces to balance visual feature expression and hierarchical event relations.", "description": "The figure is composed of two parts: (a) shows a hierarchical diagram of video violence detection, illustrating the hierarchical structure of event categories (violent vs. normal events) and event development (before, during, and after a violent event); (b) illustrates the proposed Dual-Space Representation Learning (DSRL) method, highlighting its ability to improve ambiguous violence detection by combining the strengths of both Euclidean and hyperbolic spaces, which captures visual features and hierarchical relationships between events respectively.", "section": "1 Introduction"}, {"figure_path": "TbPv0qFnHO/figures/figures_1_2.jpg", "caption": "Figure 1: (a) Hierarchical diagram in Video Violence Detection (VVD). (b) Our DSRL enhances the detection of ambiguous violence by combining Euclidean and Hyperbolic spaces to balance visual feature expression and hierarchical event relations.", "description": "The figure demonstrates the advantages of using both Euclidean and hyperbolic spaces in video violence detection.  Panel (a) shows a hierarchical structure of events in VVD, illustrating the complexity and ambiguity that can arise with violent acts. Panel (b) highlights how the Dual-Space Representation Learning (DSRL) approach balances the strengths of both spaces: Euclidean space effectively captures visual features while hyperbolic space models the complex hierarchical relationships between events, leading to improved detection of ambiguous violent events.", "section": "1 Introduction"}, {"figure_path": "TbPv0qFnHO/figures/figures_4_1.jpg", "caption": "Figure 2: A conceptual diagram of our DSRL.", "description": "This figure provides a detailed overview of the Dual-Space Representation Learning (DSRL) framework. It illustrates the key components and their interactions, starting from feature preprocessing of video and audio data to the final violence score prediction.  The diagram highlights the HE-GCN module (Hyperbolic Energy-constrained Graph Convolutional Network), which performs representation learning in hyperbolic space to capture hierarchical event relations. It also shows the DSI module (Dual-Space Interaction), which integrates features from both Euclidean and hyperbolic spaces.  The figure details the processes within each module, including exponential mapping, hyperbolic Dirichlet energy calculation, layer-sensitive hyperbolic association degree determination, message aggregation, and cross-space attention mechanisms.  The figure also visually presents the LSHAD construction rules and how the modules work together to achieve the final violence score.", "section": "4 Methodology"}, {"figure_path": "TbPv0qFnHO/figures/figures_8_1.jpg", "caption": "Figure 3: t-SNE visualization of vanilla and DSRL features for the test video on XD-Violence.", "description": "This figure shows the results of t-distributed Stochastic Neighbor Embedding (t-SNE) dimensionality reduction on the features extracted from the XD-Violence test video. The left panel displays the visualization of the original features, while the right panel shows the features obtained after applying the Dual-Space Representation Learning (DSRL) method proposed in the paper. The different colors represent different event categories (normal and violent).  The visualization helps illustrate the ability of the DSRL method to better separate the features of different event categories, improving the discriminative power for violence detection.", "section": "5.4 Qualitative Results"}, {"figure_path": "TbPv0qFnHO/figures/figures_8_2.jpg", "caption": "Figure 4: Frame-level scores and violence localization examples for the test video from XD-Violence dataset.", "description": "This figure visualizes the frame-level violence scores predicted by the DSRL model and a baseline model for three video clips from the XD-Violence dataset.  The x-axis represents the time, while the y-axis represents the violence score. The shaded pink regions indicate the ground truth violent segments in the videos.  The figure shows that DSRL more accurately identifies violent segments compared to the baseline model, as indicated by its violence scores closely aligning with the ground truth. Key frames are also highlighted to show specific examples of violent and normal events in each video clip. ", "section": "5.4 Qualitative Results"}, {"figure_path": "TbPv0qFnHO/figures/figures_8_3.jpg", "caption": "Figure 5: Some visual results of DSRL in the context of ambiguous violence. “Euclidean” represents the results of GCN only. “Hyperbolic” refers to the results of HyperVD.", "description": "This figure presents qualitative visualizations of the Dual-Space Representation Learning (DSRL) method's performance on ambiguous violence detection. It compares DSRL's results with those obtained using only Euclidean space representation (GCN) and only hyperbolic space representation (HyperVD). Each subfigure shows a video clip with ambiguous violent events and the corresponding violence scores generated by each method. The results demonstrate that DSRL effectively handles ambiguous violence by combining the strengths of both Euclidean and hyperbolic geometries. Specifically, the Euclidean space representation focuses on visual features, while the hyperbolic space representation captures the hierarchical relationships between events.  DSRL combines these two perspectives to achieve a superior performance in identifying violent events, even when visual cues are ambiguous.", "section": "5.4 Qualitative Results"}, {"figure_path": "TbPv0qFnHO/figures/figures_15_1.jpg", "caption": "Figure 3: t-SNE visualization of vanilla and DSRL features for the test video on XD-Violence.", "description": "This figure shows the t-SNE visualization of the vanilla features and the features extracted by the proposed Dual-Space Representation Learning (DSRL) method for a test video from the XD-Violence dataset.  The visualization helps illustrate how DSRL improves the separability of violent and non-violent features in the feature space, enabling better classification performance.  The improved separation is visually evident in the clustering of the points in the DSRL feature space compared to the vanilla features.", "section": "5.4 Qualitative Results"}, {"figure_path": "TbPv0qFnHO/figures/figures_16_1.jpg", "caption": "Figure 2: A conceptual diagram of our DSRL.", "description": "This figure provides a visual overview of the Dual-Space Representation Learning (DSRL) framework proposed in the paper.  It illustrates the main components of the system, including feature preprocessing (handling both visual and audio inputs), the Hyperbolic Energy-constrained Graph Convolutional Network (HE-GCN) module for learning hierarchical relationships among events in hyperbolic space, the Dual-Space Interaction (DSI) module for integrating Euclidean and hyperbolic space representations, and finally, the violence score generation and loss calculation. The diagram depicts the flow of information through these different stages, showing how visual and audio features are processed, combined, and ultimately used to predict the likelihood of violent events in a video.", "section": "4 Methodology"}, {"figure_path": "TbPv0qFnHO/figures/figures_16_2.jpg", "caption": "Figure 5: Some visual results of DSRL in the context of ambiguous violence. \"Euclidean\" represents the results of GCN only. \"Hyperbolic\" refers to the results of HyperVD.", "description": "This figure demonstrates qualitative results of the proposed DSRL method and compares it to methods using only Euclidean or hyperbolic space representation for violence detection.  It shows several video clips categorized as ambiguously violent, with frame-level violence scores calculated using the different methods. The results highlight that DSRL better identifies the true nature of ambiguously violent scenarios, outperforming the other approaches which can misclassify these scenes due to focusing only on one geometric space.", "section": "5.4 Qualitative Results"}, {"figure_path": "TbPv0qFnHO/figures/figures_17_1.jpg", "caption": "Figure 5: Some visual results of DSRL in the context of ambiguous violence. \"Euclidean\" represents the results of GCN only. \"Hyperbolic\" refers to the results of HyperVD.", "description": "This figure shows qualitative results of the proposed Dual-Space Representation Learning (DSRL) method in handling ambiguous violent events. It compares the performance of DSRL against methods using only Euclidean space representation (GCN) and only hyperbolic space representation (HyperVD).  The figure presents examples where DSRL successfully distinguishes ambiguous situations (e.g., smoke from a fire, a collision that might be interpreted as violence) while the single-space methods fail. The results demonstrate that the combined approach of DSRL effectively leverages the advantages of both Euclidean and hyperbolic spaces to improve the accuracy of violence detection in challenging scenarios.", "section": "5.4 Qualitative Results"}]