[{"figure_path": "az1SLLsmdR/figures/figures_1_1.jpg", "caption": "Figure 1: Illustration of Elucidating Dataset Condensation (EDC). Left: The overall of our better design choices in dataset condensation on ImageNet-1k. Right: The evaluation performance and data synthesis required time of different configurations on ResNet-18 with IPC 10. Our integral EDC refers to CONFIG G.", "description": "This figure illustrates the Elucidating Dataset Condensation (EDC) framework. The left panel shows a flowchart of the EDC process, highlighting key design choices such as flatness regularization, soft category-aware matching, real image initialization, and weak augmentation.  The right panel presents a comparison of different configurations of EDC on ResNet-18 with an IPC (Images Per Class) of 10, showing the top-1 accuracy on ImageNet-1k and the time spent on data synthesis for each configuration.  CONFIG G represents the final, integrated EDC model.", "section": "3 Improved Design Choices"}, {"figure_path": "az1SLLsmdR/figures/figures_3_1.jpg", "caption": "Figure 1: Illustration of Elucidating Dataset Condensation (EDC). Left: The overall of our better design choices in dataset condensation on ImageNet-1k. Right: The evaluation performance and data synthesis required time of different configurations on ResNet-18 with IPC 10. Our integral EDC refers to CONFIG G.", "description": "This figure illustrates the Elucidating Dataset Condensation (EDC) framework. The left panel shows a flowchart summarizing the key design choices incorporated into EDC for ImageNet-1k dataset condensation, highlighting improvements in data synthesis, soft label generation, and post-evaluation.  The right panel presents a comparison of different configurations of EDC, showcasing the impact of individual design choices on model accuracy and training time using a ResNet-18 model with an IPC of 10.  This comparison demonstrates the effectiveness of the complete EDC framework (CONFIG G).", "section": "3 Improved Design Choices"}, {"figure_path": "az1SLLsmdR/figures/figures_4_1.jpg", "caption": "Figure 3: Comparison between real image initialization and random initialization.", "description": "This figure compares the data synthesis process using real image initialization versus random initialization (using Gaussian noise).  It shows three stages of the synthesis process (iterations 1, 20, and 1000) for both methods. Real image initialization starts with actual images from the original dataset, leading to more realistic and coherent image generation over the iterations. Random initialization, starting with noise, produces less realistic and more distorted images, especially in the initial stages. The figure visually demonstrates how real image initialization leads to better image quality and potentially improved model performance after the condensation process.", "section": "3.2 Our Solutions"}, {"figure_path": "az1SLLsmdR/figures/figures_8_1.jpg", "caption": "Figure 1: Illustration of Elucidating Dataset Condensation (EDC). Left: The overall of our better design choices in dataset condensation on ImageNet-1k. Right: The evaluation performance and data synthesis required time of different configurations on ResNet-18 with IPC 10. Our integral EDC refers to CONFIG G.", "description": "This figure illustrates the Elucidating Dataset Condensation (EDC) framework. The left panel shows a summary of the key design choices that contribute to EDC's improved performance on ImageNet-1k.  The right panel presents a quantitative comparison of different configurations of EDC, highlighting the impact of these design choices on accuracy and computational efficiency. Each configuration is evaluated using ResNet-18 with an IPC (Images Per Class) of 10.  The 'CONFIG G' refers to the complete EDC model, representing the optimal configuration.", "section": "3 Improved Design Choices"}, {"figure_path": "az1SLLsmdR/figures/figures_22_1.jpg", "caption": "Figure 5: Visualization of the synthetic images of prior training-dependent dataset condensation methods.", "description": "This figure displays example images generated by three different dataset condensation methods: SRe2L, CDA, and G-VBSM.  These methods are all categorized as training-dependent. The images are meant to illustrate the quality of the synthetic data created by these methods. In particular, it highlights that these methods, which begin data synthesis with Gaussian noise, tend to produce images that lack realism and fail to convey clear semantics. This supports a main point of the paper that previous approaches had significant limitations and demonstrates the need for a new approach.", "section": "3.1 Limitations of Prior Methods"}, {"figure_path": "az1SLLsmdR/figures/figures_23_1.jpg", "caption": "Figure 1: Illustration of Elucidating Dataset Condensation (EDC). Left: The overall of our better design choices in dataset condensation on ImageNet-1k. Right: The evaluation performance and data synthesis required time of different configurations on ResNet-18 with IPC 10. Our integral EDC refers to CONFIG G.", "description": "This figure illustrates the Elucidating Dataset Condensation (EDC) framework. The left panel shows a flowchart summarizing the key design choices for dataset condensation, emphasizing improvements over existing methods. The right panel presents a quantitative comparison of different configurations of EDC, highlighting the impact of individual design choices (e.g., soft category-aware matching, smoothing learning rate, etc.) on the final performance (accuracy and time cost) when using a ResNet-18 model with an IPC of 10 on the ImageNet-1k dataset.  CONFIG G represents the complete EDC approach.", "section": "3 Improved Design Choices"}, {"figure_path": "az1SLLsmdR/figures/figures_26_1.jpg", "caption": "Figure 1: Illustration of Elucidating Dataset Condensation (EDC). Left: The overall of our better design choices in dataset condensation on ImageNet-1k. Right: The evaluation performance and data synthesis required time of different configurations on ResNet-18 with IPC 10. Our integral EDC refers to CONFIG G.", "description": "This figure illustrates the proposed Elucidating Dataset Condensation (EDC) method. The left panel shows a flowchart summarizing the design choices made for data synthesis, soft label generation, and evaluation stages. The right panel presents a table comparing different configurations of EDC, showing their top-1 accuracy on ImageNet-1k using a ResNet-18 model with an IPC of 10, and the time taken for data synthesis. The best performing configuration is labeled as CONFIG G, representing the complete EDC method.", "section": "3 Improved Design Choices"}, {"figure_path": "az1SLLsmdR/figures/figures_27_1.jpg", "caption": "Figure 1: Illustration of Elucidating Dataset Condensation (EDC). Left: The overall of our better design choices in dataset condensation on ImageNet-lk. Right: The evaluation performance and data synthesis required time of different configurations on ResNet-18 with IPC 10. Our integral EDC refers to CONFIG G.", "description": "This figure illustrates the Elucidating Dataset Condensation (EDC) framework. The left panel shows the key design choices integrated into EDC, categorized into three stages: Data Synthesis, Soft Label Generation, and Post-Evaluation. The right panel presents a comparison of different EDC configurations on ResNet-18 with an IPC of 10, highlighting their accuracy, training time, and resource utilization.  The configurations (CONFIG A-G) represent incremental improvements to the approach, with CONFIG G representing the final, optimized EDC model.", "section": "3 Improved Design Choices"}, {"figure_path": "az1SLLsmdR/figures/figures_28_1.jpg", "caption": "Figure 1: Illustration of Elucidating Dataset Condensation (EDC). Left: The overall of our better design choices in dataset condensation on ImageNet-1k. Right: The evaluation performance and data synthesis required time of different configurations on ResNet-18 with IPC 10. Our integral EDC refers to CONFIG G.", "description": "This figure illustrates the Elucidating Dataset Condensation (EDC) framework. The left panel shows a summary of the design choices that improved the performance of dataset condensation on ImageNet-1k.  The right panel presents a comparison of different configurations of EDC on ResNet-18 model with an IPC of 10, showcasing the trade-offs between accuracy, time spent for data synthesis, and other factors.  CONFIG G represents the complete and optimized EDC approach.", "section": "3 Improved Design Choices"}, {"figure_path": "az1SLLsmdR/figures/figures_29_1.jpg", "caption": "Figure 1: Illustration of Elucidating Dataset Condensation (EDC). Left: The overall of our better design choices in dataset condensation on ImageNet-1k. Right: The evaluation performance and data synthesis required time of different configurations on ResNet-18 with IPC 10. Our integral EDC refers to CONFIG G.", "description": "This figure illustrates the Elucidating Dataset Condensation (EDC) framework. The left panel shows a summary of the key design choices incorporated into EDC for improving dataset condensation on ImageNet-1k.  The right panel presents a quantitative comparison of different configurations of EDC, highlighting the impact of each design choice on the model's accuracy and the time required for data synthesis using a ResNet-18 model with an IPC of 10.  The final configuration, denoted as CONFIG G, represents the complete EDC method.", "section": "3 Improved Design Choices"}, {"figure_path": "az1SLLsmdR/figures/figures_30_1.jpg", "caption": "Figure 1: Illustration of Elucidating Dataset Condensation (EDC). Left: The overall of our better design choices in dataset condensation on ImageNet-1k. Right: The evaluation performance and data synthesis required time of different configurations on ResNet-18 with IPC 10. Our integral EDC refers to CONFIG G.", "description": "This figure illustrates the proposed Elucidating Dataset Condensation (EDC) method. The left panel shows a flowchart summarizing the key design choices that improve EDC's performance, including real image initialization, soft category-aware matching, smoothing LR schedule, and EMA-based evaluation. The right panel presents a table comparing different configurations of EDC on ResNet-18 with an IPC of 10, showing their top-1 accuracy, time spent for data synthesis, batch size, memory usage and other hyperparameters. CONFIG G represents the complete EDC model.", "section": "3 Improved Design Choices"}]