[{"figure_path": "5jYFoldunM/figures/figures_8_1.jpg", "caption": "Figure 1: 104 simulations of FDP by BHq before and after INCREASE-10 is executed on the z-scores. N = 103, No = 900, and q = 0.10.", "description": "This figure shows the results of 104 simulations comparing the false discovery proportion (FDP) before and after applying the INCREASE-10 algorithm to a set of z-scores.  The x-axis represents the FDP before the adversarial attack (using the Benjamini-Hochberg procedure), and the y-axis shows the FDP after the attack. Each point represents a single simulation. The parameters used are N=103 (total number of tests), No=900 (number of null hypotheses), and q=0.10 (FDR control level). The plot demonstrates that INCREASE-10 consistently increases the FDP.", "section": "5.1 INCREASE-c Simulations on Synthetic Data"}, {"figure_path": "5jYFoldunM/figures/figures_8_2.jpg", "caption": "Figure 1: 104 simulations of FDP by BHq before and after INCREASE-10 is executed on the z-scores. N = 103, No = 900, and q = 0.10.", "description": "This figure shows the results of 104 simulations comparing the false discovery proportion (FDP) before and after applying the INCREASE-10 algorithm.  The x-axis represents the FDP before the algorithm, and the y-axis represents the FDP after. Each point represents a single simulation.  The parameters used are N=1000 tests, 900 null hypotheses, a control level q=0.10. The plot demonstrates that INCREASE-10 consistently increases the FDP, showing its effectiveness in compromising the BH procedure's FDR control.", "section": "5.1 INCREASE-c Simulations on Synthetic Data"}, {"figure_path": "5jYFoldunM/figures/figures_8_3.jpg", "caption": "Figure 2: Comparing the FDR increase ∆₁ of INCREASE-1 with the lower bound L₁ of Theorem 4.5 as functions of q when µ₁ = 0, N = 1000", "description": "This figure compares the actual FDR increase (∆₁) caused by the INCREASE-1 algorithm with the theoretical lower bound (L₁) derived in Theorem 4.5.  The comparison is shown across various control levels (q) when the mean of alternative distributions (µ₁) is 0 and the total number of tests (N) is 1000. This illustrates how well the theoretical bound approximates the actual adversarial impact of the algorithm under specific conditions.", "section": "5.1.2 INCREASE-1 Simulations versus Theoretical Bounds Under Small µ₁"}, {"figure_path": "5jYFoldunM/figures/figures_8_4.jpg", "caption": "Figure 3: Comparing the FDR increase Δ₁ of INCREASE-1 with the lower bound L₁ of Theorem 4.5 as functions of q when μ₁ = .25, N = 1000", "description": "This figure compares the actual FDR increase (Δ₁) achieved by the INCREASE-1 algorithm against the theoretical lower bound (L₁) derived in Theorem 4.5, as a function of the control level (q).  The parameters used are μ₁ = 0.25, N = 1000, and c = 1.  It shows how well the theoretical bound approximates the actual adversarial effect for different control levels.  The discrepancy provides insights into the degree of adversarial robustness under different control level settings.", "section": "5.1.2 INCREASE-1 Simulations versus Theoretical Bounds Under Small μ₁"}, {"figure_path": "5jYFoldunM/figures/figures_21_1.jpg", "caption": "Figure 4: 103 simulations of FDP by BHq with and without application of INCREASE-5 on marginal conformal p-values [5] derived from an SVM one-class classifier on a test set with outliers drawn with a = 1.5.", "description": "This figure shows the results of 103 simulations comparing the false discovery proportion (FDP) of the Benjamini-Hochberg (BHq) procedure before and after applying the INCREASE-5 algorithm. The conformal p-values used were derived from a one-class SVM classifier on a test set containing outliers. The parameter 'a' controls the level of separation between the inliers and outliers, with a=1.5 indicating a moderate level of separation.  The x-axis represents FDP before applying INCREASE-5, and the y-axis represents FDP after applying INCREASE-5. Each point represents a single simulation, and the color intensity reflects the frequency of observations in that region. The black line represents the theoretical FDR control level (0.1).  The plot shows that INCREASE-5 significantly increases the FDP in many simulations, demonstrating its effectiveness in breaking the FDR control of BHq even with relatively simple adversarial perturbations.", "section": "5.1 INCREASE-c Simulations on Synthetic Data"}]