[{"figure_path": "pHiTmEsAfZ/tables/tables_13_1.jpg", "caption": "Table 1: Hyperparameters for Autoencoder", "description": "This table lists the hyperparameters used for training the autoencoder model.  It includes details on the network architecture (backbone, input/output dimensions, hidden size, encoder/decoder depth), regularization parameters (input/output noise factors, weight decay), optimization settings (optimizer, learning rate), training parameters (batch size, training epoch), and learning rate scheduling (lr scheduler). These settings are crucial for effectively training the autoencoder to efficiently encode and decode the policy network parameters into and from the latent representation.", "section": "B Implementation Details"}, {"figure_path": "pHiTmEsAfZ/tables/tables_13_2.jpg", "caption": "Table 2: Hyperparameters for Behavior Embedding", "description": "This table lists the hyperparameters used for training the behavior embedding model.  The behavior embedding model uses a multi-layer perceptron (MLP) architecture to encode trajectories and success states into a lower-dimensional embedding space.  Hyperparameters specified include the network architecture (backbone), input dimensions (trajectory dim, success state dim), hidden layer size, output dimension, batch size, optimizer, learning rate, weight decay, number of training epochs, and the learning rate scheduler.", "section": "B Implementation Details"}, {"figure_path": "pHiTmEsAfZ/tables/tables_13_3.jpg", "caption": "Table 3: Hyperparameters for Diffusion Model", "description": "This table lists the hyperparameters used to configure the conditional diffusion model.  The hyperparameters control various aspects of the diffusion process, such as the embedding dimension, number of inference steps, learning rate, and optimizer.  Understanding these values is crucial for reproducing the results of the paper and for modifying the training process.", "section": "Implementation Details"}, {"figure_path": "pHiTmEsAfZ/tables/tables_14_1.jpg", "caption": "Table 4: Qualified rate and success rate of Top 5/10 models from the generated polices with 100 trajectories on MetaWorld", "description": "This table presents the success rate of generated policies on MetaWorld tasks. It shows the proportion of policies achieving 100% success rate (Qualified Rate) and the average success rate of top 5 and top 10 performing policies.  The results are broken down for both seen (training) and unseen (testing) tasks, demonstrating the model's performance on both familiar and novel scenarios.", "section": "C.2 More Results"}]