[{"figure_path": "PAu0W5YAKC/figures/figures_14_1.jpg", "caption": "Figure 1: Example of hierarchical graph.", "description": "This figure shows a hierarchical graph structure used in the paper's experiments.  The graph has L+1 layers, where the top L layers contain d nodes each.  Nodes in adjacent layers are fully connected. The bottom layer consists of a single reward node (XN) connected to all nodes in the topmost layer. This structure allows for varying graph depth (L) and maximum in-degree (d) to evaluate algorithm performance under different graph topologies. The ai symbols represent the interventions available at each node.", "section": "A Empirical Evaluations"}, {"figure_path": "PAu0W5YAKC/figures/figures_14_2.jpg", "caption": "Figure 2: Cumulative regret with L = 2.", "description": "This figure shows the cumulative regret for different causal bandit algorithms with a hierarchical graph where the maximum causal depth L is 2.  The x-axis represents the number of iterations, and the y-axis represents the cumulative regret.  The algorithms compared are GA-LCB (Graph-Agnostic Linear Causal Bandit), GA-LCB (known) (GA-LCB with known graph structure), GCB-UCB (Graph Causal Bandit - Upper Confidence Bound), and LinSEM-UCB (Linear Structural Equation Model - Upper Confidence Bound). GA-LCB demonstrates a significantly higher initial regret due to the structure learning phase, but its regret plateaus as the number of iterations increases. In contrast, the other algorithms exhibit much lower but less scalable regret.", "section": "A Empirical Evaluations"}, {"figure_path": "PAu0W5YAKC/figures/figures_14_3.jpg", "caption": "Figure 2: Cumulative regret with L = 2.", "description": "This figure shows the cumulative regret for different causal bandit algorithms (GA-LCB, GA-LCB(known), GCB-UCB, and LinSEM-UCB) over 40000 iterations on a hierarchical graph with a causal depth of L=2 and maximum in-degree of d=3.  GA-LCB is the proposed algorithm in this paper, and GA-LCB(known) represents the performance of the algorithm with prior knowledge of the graph structure.  The figure demonstrates the performance comparison among these algorithms, indicating GA-LCB's performance relative to state-of-the-art algorithms in the presence of uncertainty about the causal graph. Note that GA-LCB shows slightly higher regret than GA-LCB(known) during the initial iterations, which can be explained by the initial structure learning and exploration.", "section": "A Empirical Evaluations"}, {"figure_path": "PAu0W5YAKC/figures/figures_14_4.jpg", "caption": "Figure 2: Cumulative regret with L = 2.", "description": "This figure shows the cumulative regret for different causal bandit algorithms (GA-LCB, GCB-UCB, LinSEM-UCB) on a hierarchical graph with causal depth L=2.  The x-axis represents the number of iterations, and the y-axis represents the cumulative regret.  GA-LCB shows initially higher regret than the other two algorithms, due to its structure learning phase, but the regret converges to a relatively stable level after some iterations.", "section": "A Empirical Evaluations"}, {"figure_path": "PAu0W5YAKC/figures/figures_15_1.jpg", "caption": "Figure 5: Cumulative regret with different length L under hierarchical graph with d = 2.", "description": "This figure shows the cumulative regret of the GA-LCB algorithm under different causal depth L. The x-axis represents the causal depth L, and the y-axis represents the cumulative regret. The figure shows that the cumulative regret increases exponentially with the causal depth L, which is consistent with the theoretical results in the paper. The figure also shows the cumulative regret of GA-LCB under known and unknown graph settings. The cumulative regret under the unknown graph setting is slightly higher than the cumulative regret under the known graph setting. This is because the GA-LCB algorithm needs to learn the graph structure under the unknown graph setting, which introduces additional regret.", "section": "Empirical Evaluations"}, {"figure_path": "PAu0W5YAKC/figures/figures_15_2.jpg", "caption": "Figure 6: Cumulative regret with different degree d under hierarchical graph with L = 2.", "description": "This figure shows the empirical cumulative regret of the GA-LCB algorithm with different maximum in-degree values (d) under a hierarchical graph structure with a fixed maximum causal depth (L=2). It compares the empirical results with the theoretical upper and lower bounds of O(dL−1/2√T) and O(d3/2L−3/2√T) respectively. The plot demonstrates that as the maximum in-degree increases, the cumulative regret also increases, aligning with the theoretical findings in the paper. The empirical results fall between the upper and lower bounds, indicating the effectiveness of the proposed GA-LCB algorithm.", "section": "Empirical Evaluations"}, {"figure_path": "PAu0W5YAKC/figures/figures_15_3.jpg", "caption": "Figure 7: Computational time of different algorithms.", "description": "This figure compares the computational time of four different causal bandit algorithms: GA-LCB, GA-LCB (with known graph), GCB-UCB, and LinSEM-UCB.  The algorithms are evaluated on hierarchical graphs with different causal depths (L=2 and L=4). The results show that GA-LCB, designed for unknown graphs, has a significantly lower computational time compared to the other algorithms, particularly in larger graphs (L=4). The computational advantage is attributed to GA-LCB's efficient algorithm design, particularly avoiding computationally expensive optimization.", "section": "A Empirical Evaluations"}, {"figure_path": "PAu0W5YAKC/figures/figures_38_1.jpg", "caption": "Figure 1: Example of hierarchical graph.", "description": "This figure shows an example of a hierarchical graph used in the paper's experiments. The graph has multiple layers of nodes, where nodes in adjacent layers are fully connected. Each node represents a variable, and the edges represent causal relationships between them. The last layer contains a single node, representing the reward variable, which is fully connected to all nodes in the previous layer.  Soft interventions can be applied to any subset of nodes, aiming to maximize the value of the reward node. The structure illustrates the complexity of the problem addressed by the GA-LCB algorithm, especially when the underlying graph structure is unknown.", "section": "A Empirical Evaluations"}]