[{"figure_path": "AH5KwUSsln/figures/figures_1_1.jpg", "caption": "Figure 1: Graphical representation of the proposed learning framework. Given an available finite sample of training sets, each assumed to be generated by a single data distribution, one can learn a credal set P of data distributions in either a frequentist or subjectivist fashion (Section 3). This allows us to derive generalization bounds under credal uncertainty (Section 4).", "description": "This figure illustrates the process of credal learning.  Multiple training datasets, each potentially generated from a different distribution, are used to infer a credal set (a convex set of probability distributions). This credal set represents the uncertainty in the data-generating process. From this credal set, generalization bounds can be derived under credal uncertainty which provides a more robust estimate of model risk compared to traditional methods that assume a single data generating distribution.", "section": "Contributions"}, {"figure_path": "AH5KwUSsln/figures/figures_4_1.jpg", "caption": "Figure 1: Graphical representation of the proposed learning framework. Given an available finite sample of training sets, each assumed to be generated by a single data distribution, one can learn a credal set P of data distributions in either a frequentist or subjectivist fashion (Section 3). This allows us to derive generalization bounds under credal uncertainty (Section 4).", "description": "This figure illustrates the overall framework of the proposed credal learning approach.  It shows how a finite sample of training sets, each from a potentially different distribution, is used to infer a credal set (a convex set of probability distributions) representing the uncertainty in the data-generating process. This credal set then forms the basis for deriving generalization bounds, providing robust uncertainty quantification.", "section": "Contributions"}, {"figure_path": "AH5KwUSsln/figures/figures_20_1.jpg", "caption": "Figure 2. Graphical representation of the proposed learning framework. Given an available finite sample of training sets, each assumed to be generated by a single data distribution, one can learn a credal set P of data distributions in either a frequentist or subjectivist fashion (Section 3). This allows us to derive generalization bounds under credal uncertainty (Section 4).", "description": "The figure shows a graphical model of the proposed learning framework.  It begins with a finite sample of training sets, each assumed to be generated by a single unknown data distribution. From these, a credal set (convex set) of probability distributions is inferred using either frequentist or subjectivist methods.  This credal set is then used to derive generalization bounds under credal uncertainty, which are bounds on the expected risk given the uncertainty represented by the credal set. This framework allows for more robust generalization bounds by acknowledging variability in the data-generating distribution.", "section": "3 Credal Learning"}]