[{"figure_path": "cS63YtJ49A/tables/tables_6_1.jpg", "caption": "Table 1: Quantitative results on MS-COCO 2017 [21].", "description": "This table presents a quantitative comparison of different methods (Deepcache and AdaptiveDiffusion) on the MS-COCO 2017 dataset for image generation.  Metrics such as PSNR, LPIPS, and FID are used to evaluate image quality.  The table also shows MACs (Multiply-Accumulate operations), memory usage, latency, and speedup ratios, providing a comprehensive performance comparison of the different approaches across various sampling schedulers (DDIM, DPM++, Euler).", "section": "4.2 Main Results"}, {"figure_path": "cS63YtJ49A/tables/tables_6_2.jpg", "caption": "Table 2: Quantitative results on ImageNet 256×256 [7].", "description": "This table presents a quantitative comparison of the proposed AdaptiveDiffusion method against the DeepCache baseline on the ImageNet 256x256 dataset for conditional image generation.  Metrics include PSNR (Peak Signal-to-Noise Ratio), LPIPS (Learned Perceptual Image Patch Similarity), and FID (Fréchet Inception Distance).  Memory usage (Mem), multiply-accumulate operations (MACs), latency, and speedup ratio are also reported, providing a comprehensive evaluation of both the quality and efficiency gains achieved by the proposed method.", "section": "4.2 Main Results"}, {"figure_path": "cS63YtJ49A/tables/tables_7_1.jpg", "caption": "Table 3: Quantitative results on video generation tasks.", "description": "This table presents a quantitative comparison of the proposed AdaptiveDiffusion method against the Deepcache baseline on video generation tasks.  The metrics used for evaluation include PSNR (Peak Signal-to-Noise Ratio), LPIPS (Learned Perceptual Image Patch Similarity), and FVD (Fréchet Video Distance), reflecting both the quality of individual frames and the temporal coherence of the generated videos.  The table also shows memory usage (Mem), MACs (Multiply-Accumulate operations, a measure of computational cost), latency, and the speedup factor achieved by each method compared to the original, full-step video generation process.  Two different video generation models are evaluated: I2VGen-XL and ModelScopeT2V.", "section": "4.2 Results"}, {"figure_path": "cS63YtJ49A/tables/tables_7_2.jpg", "caption": "Table 4: Ablation studies on hyperparameters using SDXL [32]. We conduct the ablation studies using 50-step Euler sampling scheduler for SDXL on COCO2017.", "description": "This table presents the ablation study results on the hyperparameters (δ and Cmax) of the proposed AdaptiveDiffusion method.  It shows the impact of varying the skipping threshold (δ) and the maximum number of continuous skipping steps (Cmax) on the performance metrics (PSNR, LPIPS, FID, MACs, Latency, and Speedup Ratio) when using the 50-step Euler sampling scheduler for SDXL on the MS-COCO 2017 dataset. The results demonstrate the trade-off between speed and image quality when adjusting these hyperparameters.", "section": "4 Experiments"}, {"figure_path": "cS63YtJ49A/tables/tables_7_3.jpg", "caption": "Table 5: Study on few-step sampling. Acceleration results with different original sampling steps using SDXL [32] on COCO2017.", "description": "This table shows the ablation study on different sampling steps (50, 25, 15, and 10).  For each step count, it provides the PSNR, LPIPS, and FID scores, along with the total number of Multiply-Accumulate operations (MACs), latency in seconds, and speedup ratio compared to the full 50-step method.  This demonstrates the effectiveness of AdaptiveDiffusion in accelerating the denoising process even with a significantly reduced number of steps.", "section": "4.3 Ablation Studies"}, {"figure_path": "cS63YtJ49A/tables/tables_16_1.jpg", "caption": "Table 6: Performance on Unconditional Image Generation.", "description": "This table compares the performance of Deepcache and the proposed AdaptiveDiffusion method on unconditional image generation tasks using two datasets: CIFAR10 and LSUN.  The metrics reported are FID (Fréchet Inception Distance), a measure of image quality, and speedup ratio, indicating the acceleration achieved by each method compared to a baseline. Lower FID values indicate better image quality, and higher speedup ratios signify faster generation times.  The results show that AdaptiveDiffusion achieves both better image quality (lower FID) and faster generation speeds (higher speedup ratio) than Deepcache on both datasets.", "section": "4.3 Experiments on Unconditional Image Generation"}, {"figure_path": "cS63YtJ49A/tables/tables_17_1.jpg", "caption": "Table 7: Performance on SDE-DPM Solver.", "description": "This table presents the performance comparison between DeepCache and the proposed AdaptiveDiffusion method using the SDE-DPM solver on the COCO2017 dataset.  It shows that AdaptiveDiffusion achieves higher PSNR and lower LPIPS and FID scores compared to DeepCache, indicating better image quality.  While AdaptiveDiffusion has a slightly higher latency, the speedup ratio remains comparable to DeepCache.", "section": "4.3 Ablation Studies"}]