[{"figure_path": "NJUClFbosX/figures/figures_1_1.jpg", "caption": "Figure 1: Overview of D3. D3 generates structured TPR representations by mapping input data to the nearest pre-learned symbolic features stored within discrete, learnable dictionaries. Each dictionary is linked explicitly to specific TPR components, such as roles, filler, and unbinding operators. Notably, D3 uses a shared dictionary configuration between the roles and unbinding operators. This figure illustrates, for example, that role₁ and unbind₁ share one dictionary, while role2 and unbind2 share another. T denotes a superimposed representation that represents multiple objects.", "description": "This figure illustrates the Discrete Dictionary-based Decomposition (D3) layer's workflow.  The D3 layer takes input data and generates queries for each TPR component (filler, role, and unbinding operator). These queries are used to access pre-learned symbolic features (codes) from separate key-value dictionaries.  The selected codes are then aggregated to produce structured TPR representations.  Note that the D3 layer uses shared dictionaries for roles and their corresponding unbinding operators.", "section": "3 Method"}, {"figure_path": "NJUClFbosX/figures/figures_5_1.jpg", "caption": "Figure 2: Test accuracy curve [%] on the SAR task for 10 seeds, with shadowed area indicating SD.", "description": "This figure shows the test accuracy curves for four different models (FWM, AID, D3 (w/ F), and D3 (w/o F)) on the SAR task across 30,000 iterations.  The shadowed areas represent the standard deviation across 10 different seeds. The results show that D3 models significantly outperform the FWM and AID models, achieving nearly perfect accuracy. The difference between D3 (w/ F) and D3 (w/o F) suggests the impact of applying D3 to generate filler representations.", "section": "4.2.1 TPR-based Memory Networks"}, {"figure_path": "NJUClFbosX/figures/figures_7_1.jpg", "caption": "Figure 3: The heatmap displays the cosine similarity between the generated representations during the discovery phase for the SAR task. We explore the similarity across different types of representations: (a) queries of roles, (b) codes of roles, and (c) the roles themselves.", "description": "This figure shows heatmaps visualizing the cosine similarity between different representations generated during the discovery phase of the SAR task.  Three heatmaps are presented, each showing the similarity between:\n(a) Queries of roles\n(b) Codes of roles\n(c) The roles themselves\nThe heatmaps help illustrate how the different components of the D3 model (query generation, key access, code aggregation) interact to create structured representations.", "section": "3.1 Discrete Dictionary-based Decomposition module"}, {"figure_path": "NJUClFbosX/figures/figures_7_2.jpg", "caption": "Figure 4: The heatmap displays the cosine similarity between the generated representations during the discovery phase (represented on the x-axis) and the inference phase (represented on the y-axis) for the SAR task. We explore the similarity across different types of representations: (a) queries of roles and unbinding operators, (b) codes of roles and unbinding operators, and (c) the roles and unbinding operators themselves.", "description": "This figure shows the cosine similarity between representations generated during the discovery and inference phases of the SAR task.  It visualizes this similarity for queries, codes, and the actual roles and unbinding operators. The goal is to demonstrate that the learned representations in D3 satisfy the conditions required for accurate TPR operations. A high correlation between roles and unbinding operators is expected, signifying successful decomposition.", "section": "3.1 Discrete Dictionary-based Decomposition module"}, {"figure_path": "NJUClFbosX/figures/figures_7_3.jpg", "caption": "Figure 5: The heatmap visualizes the cosine similarity of the learned codebook features for the SAR task. There are two parts to each heatmap: (a) the similarity among codebook keys, denoted as {k}code, and (b) the similarity among codebook values, denoted as {v}code. For better visualization, the heatmap values are reordered to reflect the cluster of similar codebook keys.", "description": "This figure shows heatmaps visualizing cosine similarity within and between learned codebook keys and values.  The left heatmap displays similarity between keys, and the right heatmap shows similarity between values.  The ordering of the keys and values has been adjusted to better show clusters of similar features.", "section": "3.1 Discrete Dictionary-based Decomposition module"}, {"figure_path": "NJUClFbosX/figures/figures_8_1.jpg", "caption": "Figure 6: The mean accuracy on the SAR task for 10 seeds in the ablation study, with error bar indicating SD. The default setting uses Dcode of 64, Ncode of 64, and top-k of 8. Each figure shows the experimental results for the following settings: (a) Varying Dcode. (b) Varying Ncode with top-k constant. (c) Varying top-k with Ncode constant.", "description": "This figure shows the ablation study on the hyperparameters of the D3 model for the SAR task. It shows the impact of varying the code size (Dcode), the number of keys (Ncode), and the top-k value on the accuracy. The default settings were Dcode=64, Ncode=64, and top-k=8.  Subfigures (a), (b), and (c) depict the effect of varying each of these parameters individually while keeping the others constant, showing how each parameter affects the model's performance in systematic generalization.", "section": "4.3.2 Ablation Study"}, {"figure_path": "NJUClFbosX/figures/figures_17_1.jpg", "caption": "Figure 6: The mean accuracy on the SAR task for 10 seeds in the ablation study, with error bar indicating SD. The default setting uses Dcode of 64, Ncode of 64, and top-k of 8. Each figure shows the experimental results for the following settings: (a) Varying Dcode. (b) Varying Ncode with top-k constant. (c) Varying top-k with Ncode constant.", "description": "This figure presents the ablation study results on the Systematic Associative Recall (SAR) task, investigating the impact of hyperparameters Dcode (codebook dimension), Ncode (number of keys), and top-k (number of selected keys) on the model's accuracy.  The default setting employs Dcode=64, Ncode=64, and top-k=8.  The figure shows three subplots: (a) varies Dcode while keeping Ncode and top-k constant; (b) varies Ncode while keeping Dcode and top-k constant; and (c) varies top-k while keeping Dcode and Ncode constant. Each setting's accuracy is evaluated using 10 different seeds, with error bars showing standard deviations.", "section": "4.3.2 Ablation Study"}, {"figure_path": "NJUClFbosX/figures/figures_18_1.jpg", "caption": "Figure 8: Ablation study for the effect of the residual connection on (a) the SAR task and (b) the sys-bAbI task for 10 seeds.", "description": "This ablation study investigates the impact of removing the residual connection from the D3 layer on the SAR and sys-bAbI tasks.  The results show a significant performance drop when the residual connection is removed, demonstrating its importance for the effective training of the D3 layer and its contribution to the model's ability to generalize well on the two tasks.", "section": "4.3.2 Ablation Study"}, {"figure_path": "NJUClFbosX/figures/figures_19_1.jpg", "caption": "Figure 3: The heatmap displays the cosine similarity between the generated representations during the discovery phase for the SAR task. We explore the similarity across different types of representations: (a) queries of roles, (b) codes of roles, and (c) the roles themselves.", "description": "This figure shows heatmaps visualizing the cosine similarity between different types of representations generated during the discovery phase of the SAR task.  Three heatmaps are presented, each corresponding to a different representation type:\n(a) Queries of roles: Similarity between the query vectors generated for different roles.\n(b) Codes of roles: Similarity between the code vectors obtained from the dictionaries for different roles.\n(c) Roles themselves: Similarity between the final role representations.\nThe heatmaps help to illustrate how well the different representations align and support the compositionality of the proposed method.", "section": "4.3.1 Qualitative Analysis"}, {"figure_path": "NJUClFbosX/figures/figures_19_2.jpg", "caption": "Figure 1: Overview of D3. D3 generates structured TPR representations by mapping input data to the nearest pre-learned symbolic features stored within discrete, learnable dictionaries. Each dictionary is linked explicitly to specific TPR components, such as roles, filler, and unbinding operators. Notably, D3 uses a shared dictionary configuration between the roles and unbinding operators. This figure illustrates, for example, that role₁ and unbind₁ share one dictionary, while role2 and unbind2 share another. T denotes a superimposed representation that represents multiple objects.", "description": "This figure illustrates the architecture of the Discrete Dictionary-based Decomposition (D3) layer.  The D3 layer maps input data to pre-learned symbolic features stored in discrete, learnable dictionaries. Each dictionary is specifically linked to a TPR component (role, filler, or unbinding operator).  The figure highlights that D3 uses shared dictionaries for roles and their corresponding unbinding operators, improving efficiency. The process is shown in two stages: encoding (mapping input to TPR components) and decoding (retrieving specific fillers from the combined representation).", "section": "3 Method"}, {"figure_path": "NJUClFbosX/figures/figures_20_1.jpg", "caption": "Figure 3: The heatmap displays the cosine similarity between the generated representations during the discovery phase for the SAR task. We explore the similarity across different types of representations: (a) queries of roles, (b) codes of roles, and (c) the roles themselves.", "description": "This figure shows three heatmaps visualizing cosine similarity between different representations generated during the discovery phase of the SAR task. Each heatmap represents a different aspect of the generated representations: (a) queries of roles, (b) codes of roles, and (c) the roles themselves. The heatmaps provide a visual representation of how similar different parts of the generated representations are to each other.", "section": "3.1 Discrete Dictionary-based Decomposition module"}, {"figure_path": "NJUClFbosX/figures/figures_20_2.jpg", "caption": "Figure 4: The heatmap displays the cosine similarity between the generated representations during the discovery phase (represented on the x-axis) and the inference phase (represented on the y-axis) for the SAR task. We explore the similarity across different types of representations: (a) queries of roles and unbinding operators, (b) codes of roles and unbinding operators, and (c) the roles and unbinding operators themselves.", "description": "This figure shows the cosine similarity between the generated representations in the discovery and inference phases for the SAR task. It uses heatmaps to visualize the similarity for three different representation types: queries of roles and unbinding operators, their corresponding codes, and the roles and unbinding operators themselves. This helps to understand how the D3 layer generates structured representations that satisfy the necessary conditions for accurate TPR operations.", "section": "3.1 Discrete Dictionary-based Decomposition module"}, {"figure_path": "NJUClFbosX/figures/figures_20_3.jpg", "caption": "Figure 5: The heatmap visualizes the cosine similarity of the learned codebook features for the SAR task. There are two parts to each heatmap: (a) the similarity among codebook keys, denoted as {k}code, and (b) the similarity among codebook values, denoted as {v}code. For better visualization, the heatmap values are reordered to reflect the cluster of similar codebook keys.", "description": "This figure shows heatmaps visualizing the cosine similarity within the learned codebook features used in the Discrete Dictionary-based Decomposition (D3) layer for the SAR task.  The left heatmap (a) displays the similarity between different codebook keys (k), while the right heatmap (b) displays the similarity between different codebook values (v).  The values are reordered to highlight clusters of similar keys and values, making the patterns more apparent.", "section": "3.1 Discrete Dictionary-based Decomposition module"}, {"figure_path": "NJUClFbosX/figures/figures_21_1.jpg", "caption": "Figure 3: The heatmap displays the cosine similarity between the generated representations during the discovery phase for the SAR task. We explore the similarity across different types of representations: (a) queries of roles, (b) codes of roles, and (c) the roles themselves.", "description": "This figure shows heatmaps illustrating cosine similarity between different representation types generated during the discovery phase of the Systematic Associative Recall (SAR) task.  Three heatmaps are presented, each focusing on a different aspect:\n\n(a) **query:** Shows similarity between the query vectors for each role.\n(b) **code:** Displays similarity between the code vectors derived from the key-value dictionaries for each role.\n(c) **component:** Illustrates the similarity between the final role representations generated after the aggregation of code values.\n\nThe heatmaps visually demonstrate how the D3 layer maps input data (queries) to pre-learned symbolic features (codes) within dictionaries to generate structured TPR representations (components) for different roles in the SAR task.", "section": "4.3.1 Qualitative Analysis"}, {"figure_path": "NJUClFbosX/figures/figures_21_2.jpg", "caption": "Figure 4: The heatmap displays the cosine similarity between the generated representations during the discovery phase (represented on the x-axis) and the inference phase (represented on the y-axis) for the SAR task. We explore the similarity across different types of representations: (a) queries of roles and unbinding operators, (b) codes of roles and unbinding operators, and (c) the roles and unbinding operators themselves.", "description": "This figure shows the cosine similarity between representations generated during the discovery and inference phases of the SAR task.  It displays three subplots.  The first (a) shows the similarity between queries (input data mapped to represent roles and unbinding operators) in the discovery and inference phases.  The second (b) does the same but for the codes (intermediate feature vectors representing roles and unbinding operators).  The third (c) displays the similarity between the actual roles and unbinding operators themselves. The purpose is to illustrate that D3 generates representations that satisfy the requirements of the TPR framework for accurate TPR operations.", "section": "4.3.1 Qualitative Analysis"}, {"figure_path": "NJUClFbosX/figures/figures_21_3.jpg", "caption": "Figure 5: The heatmap visualizes the cosine similarity of the learned codebook features for the SAR task. There are two parts to each heatmap: (a) the similarity among codebook keys, denoted as {k}code, and (b) the similarity among codebook values, denoted as {v}code. For better visualization, the heatmap values are reordered to reflect the cluster of similar codebook keys.", "description": "This figure shows two heatmaps visualizing the cosine similarity within the learned codebook keys and values used in the D3 model for the SAR task.  Heatmap (a) displays the similarity between different codebook keys, while heatmap (b) shows the similarity between corresponding codebook values. The values have been reordered to emphasize clusters of similar features.", "section": "3.1 Discrete Dictionary-based Decomposition module"}]