[{"figure_path": "qNYYb4nOKA/figures/figures_10_1.jpg", "caption": "Figure 1: Toy example: structured information encapsulating three entities using schema.org.", "description": "This figure is a toy example showing how structured information can be represented using schema.org vocabulary.  It showcases three entities ('Insight', 'Person', and 'Organization') with their respective properties (key-value pairs), demonstrating a way to structure unstructured information for better processing and analysis. This schema is used as a blueprint for extracting and organizing information in the paper.", "section": "3 Capturing the structure"}, {"figure_path": "qNYYb4nOKA/figures/figures_11_1.jpg", "caption": "Figure 1: Toy example: structured information encapsulating three entities using schema.org.", "description": "This figure displays a toy example of structured information that uses schema.org vocabulary to represent three different entities (Insight, Person, and Organization). Each entity is shown as a set of key-value pairs, where the keys represent properties and the values represent the entity's specific attributes.  This example illustrates how the authors propose to structure information for their information extraction quality evaluation method. The use of schema.org allows for a standardized and easily-parsable format for the data.", "section": "3 Capturing the structure"}, {"figure_path": "qNYYb4nOKA/figures/figures_13_1.jpg", "caption": "Figure 1: Toy example: structured information encapsulating three entities using schema.org.", "description": "This figure displays a toy example of structured information using the schema.org vocabulary.  It shows three entities: \"Insight\", \"Person\", and \"Organization\", each with its own set of properties (key-value pairs like name, description, keywords, etc.). This example illustrates how the authors use schema.org to structure information for their information extraction task, creating a template for consistent data representation.", "section": "3 Capturing the structure"}]