[{"figure_path": "PZCiWtQjAw/tables/tables_7_1.jpg", "caption": "Table 1: Main results of different methods on MUSIC-21 dataset under the setting of Continual Audio-Visual Sound Separation with base separation models of iQuery [14] and Co-Separation [23], respectively. The bold part denotes the best results. Our proposed ContAV-Sep achieves the best performance among all baselines.", "description": "This table presents the main experimental results comparing different methods on the MUSIC-21 dataset for continual audio-visual sound separation.  It shows the performance (SDR, SIR, SAR) of various continual learning approaches (Fine-tuning, LwF, EWC, PLOP, EWF, AV-CIL) and the proposed ContAV-Sep, using both iQuery and Co-Separation as base models. The results are split to show performance with and without memory usage.  The \"Upper Bound\" row indicates the best possible performance achievable by training on all available data. The table highlights that ContAV-Sep consistently outperforms other methods.", "section": "4 Experiments"}, {"figure_path": "PZCiWtQjAw/tables/tables_8_1.jpg", "caption": "Table 2: Ablation study on our proposed ContAV-Sep. Our full approach achieves best results compared to the variants.", "description": "This table presents the ablation study of the proposed ContAV-Sep method. It shows the impact of each component of the CrossSDC (Cross-modal Similarity Distillation Constraint) on the final performance.  By removing different components of the CrossSDC, the experiment evaluates the contribution of each component to the overall performance. The results demonstrate that the full model (with all components) achieves the best performance, highlighting the effectiveness of the proposed CrossSDC in improving the continual audio-visual sound separation.", "section": "4.3 Ablation Study on CrossSDC and Memory Size"}, {"figure_path": "PZCiWtQjAw/tables/tables_9_1.jpg", "caption": "Table 3: Experimental results of our proposed ContAV-Sep with different memory size from 1 to 30 samples per memory class.", "description": "This table presents the experimental results of the proposed ContAV-Sep model with varying memory sizes. The memory size refers to the number of samples per class stored in the memory set.  The table shows how the model's performance, measured by SDR, SIR, and SAR, changes as the memory size increases from 1 to 30 samples per class.  The results demonstrate the impact of memory size on the model's ability to mitigate catastrophic forgetting and maintain performance on previously seen classes during continual learning.", "section": "4.3 Ablation Study on CrossSDC and Memory Size"}]