{"importance": "This paper is important because it addresses the high cost of using large language models (LLMs) in knowledge-based question answering (KBQA) by proposing a cost-efficient strategy.  It offers a novel solution to balance accuracy and cost, which is crucial for real-world applications of LLMs in resource-constrained environments. The research opens new avenues for optimizing LLM usage, particularly in specialized domains needing domain expertise, and pushes the boundaries of efficient model selection techniques. This is highly relevant to the current trends in AI research focusing on responsible and cost-effective AI solutions. ", "summary": "Coke: A cost-efficient KBQA strategy using LLMs and KGMs, maximizing accuracy while minimizing GPT-4 fees by up to 20.89%", "takeaways": ["Coke, a novel cost-efficient strategy for KBQA, minimizes LLM calls within budget constraints.", "A multi-armed bandit approach with cluster-level Thompson Sampling and context-aware policy optimizes model selection for accuracy and cost.", "Experiments show Coke improves Pareto frontier on three benchmark datasets, achieving higher accuracy with up to 20.89% GPT-4 cost savings."], "tldr": "Knowledge-based question answering (KBQA) often relies on expensive large language models (LLMs).  Current methods struggle to balance accuracy and cost effectively.  Different models excel in different knowledge domains, making model selection challenging and time-consuming.\n\nThe paper introduces \"Coke,\" a cost-efficient KBQA strategy.  Coke uses a multi-armed bandit approach, cleverly combining LLMs and smaller, knowledge graph-based models (KGMs).  A context-aware policy selects the best model for each question, dynamically balancing exploration and exploitation to optimize accuracy within a budget.  Extensive experiments demonstrate Coke's success, significantly improving the cost-accuracy trade-off compared to existing approaches, showcasing significant cost reduction while maintaining or improving accuracy.", "affiliation": "Hong Kong Polytechnic University", "categories": {"main_category": "Natural Language Processing", "sub_category": "Question Answering"}, "podcast_path": "pje1Y71jad/podcast.wav"}