[{"figure_path": "EQZlEfjrkV/figures/figures_2_1.jpg", "caption": "Figure 1: Illustrations of the advantage of our framework. Within our framework, it can be shown that G₁'s parameters can be identified (up to sign) while G2's cannot. In contrast, the latent projection framework cannot even differentiate G₁ from G2 as they share the same ADMG (c) after projection. Furthermore, with ADMG, any edge coefficient that involves a latent variable cannot be considered.", "description": "This figure compares two different causal graphs (G1 and G2) and their corresponding ADMG (acyclic directed mixed graph) representation after projecting out latent variables.  G1's parameters are identifiable in the proposed framework, while G2's are not. The latent projection framework, however, fails to distinguish between G1 and G2 because they share the same ADMG.  This highlights the advantage of the proposed framework which considers all variables and edges, unlike the latent projection method which only considers observed variables and loses information about latent variable connections.", "section": "2.2 Framework Comparison"}, {"figure_path": "EQZlEfjrkV/figures/figures_3_1.jpg", "caption": "Figure 1: Illustrations of the advantage of our framework. Within our framework, it can be shown that G₁'s parameters can be identified (up to sign) while G2's cannot. In contrast, the latent projection framework cannot even differentiate G₁ from G2 as they share the same ADMG (c) after projection. Furthermore, with ADMG, any edge coefficient that involves a latent variable cannot be considered.", "description": "This figure compares the author's proposed framework with the latent projection framework for identifying parameters in partially observed linear causal models.  It shows two DAGs (G1 and G2) where G1's parameters are identifiable using the author's method (up to sign), but G2's are not.  The latent projection framework, however, fails to distinguish between G1 and G2 because they produce the same ADMG when projected.  The key difference is that the author's framework considers all edges, including those involving latent variables, while the ADMG approach does not.", "section": "Framework Comparison"}, {"figure_path": "EQZlEfjrkV/figures/figures_4_1.jpg", "caption": "Figure 1: Illustrations of the advantage of our framework. Within our framework, it can be shown that G₁'s parameters can be identified (up to sign) while G2's cannot. In contrast, the latent projection framework cannot even differentiate G₁ from G2 as they share the same ADMG (c) after projection. Furthermore, with ADMG, any edge coefficient that involves a latent variable cannot be considered.", "description": "This figure compares the author's proposed framework with the existing latent projection framework using two example graphs, G1 and G2.  G1's parameters can be identified using the author's method, while G2's cannot. The latent projection framework fails to distinguish between G1 and G2 because they project to the same ADMG.  A key difference is that the author's framework allows identification of coefficients involving latent variables which the latent projection framework does not.", "section": "2.2 Framework Comparison"}, {"figure_path": "EQZlEfjrkV/figures/figures_8_1.jpg", "caption": "Figure 4: Estimated edge coefficients by the proposed method for Big Five human personality dataset. Variables whose name starts with \"L\" are latent variables while the others are observed variables.", "description": "This figure shows the estimated edge coefficients in a linear causal model representing the Big Five personality traits.  The model includes both observed variables (personality traits measured by survey questions) and latent variables (unobserved factors influencing personality). The edge coefficients, which represent the strength of causal relationships between variables, are displayed on the edges connecting the nodes. Positive values suggest a positive relationship, while negative values indicate a negative relationship.  The latent variables are denoted by names starting with \"L\". The figure visually represents the learned causal structure of the personality model and the strength of the direct causal effects between both observed and latent variables.", "section": "5 Experiments"}, {"figure_path": "EQZlEfjrkV/figures/figures_15_1.jpg", "caption": "Figure 8: An illustrative graph to show orthogonal transformation indeterminacy. An atomic cover of it, {L1, L2}, has more than one latent variable, and thus there exists orthogonal transformation indeterminacy regarding coefficients of edges that involve {L1, L2}.", "description": "This figure demonstrates a graph structure where the parameters are not identifiable due to orthogonal transformation indeterminacy.  Specifically, the atomic cover {L1, L2} contains more than one latent variable, leading to this indeterminacy affecting the edges connected to L1 and L2. The figure illustrates how the presence of multiple latent variables with identical parents and children causes ambiguity in parameter estimation.", "section": "3.1 Definition of Parameter Identifiability and Indeterminacy"}, {"figure_path": "EQZlEfjrkV/figures/figures_15_2.jpg", "caption": "Figure 1: Illustrations of the advantage of our framework. Within our framework, it can be shown that G₁'s parameters can be identified (up to sign) while G2's cannot. In contrast, the latent projection framework cannot even differentiate G₁ from G2 as they share the same ADMG (c) after projection. Furthermore, with ADMG, any edge coefficient that involves a latent variable cannot be considered.", "description": "This figure compares three graphs to illustrate the advantages of the proposed framework over existing methods.  Graph G1 demonstrates a scenario where the parameters are identifiable. Graph G2 shows a scenario where the parameters are not identifiable. Both G1 and G2 are projected into the same ADMG (acyclic directed mixed graph) using the latent projection framework, highlighting a limitation of that approach: it cannot differentiate between identifiable and unidentifiable models when latent variables are involved. The proposed framework overcomes this limitation by considering all variables and edge coefficients, even those involving latent variables.", "section": "2.2 Framework Comparison"}, {"figure_path": "EQZlEfjrkV/figures/figures_21_1.jpg", "caption": "Figure 1: Illustrations of the advantage of our framework. Within our framework, it can be shown that G₁'s parameters can be identified (up to sign) while G2's cannot. In contrast, the latent projection framework cannot even differentiate G₁ from G2 as they share the same ADMG (c) after projection. Furthermore, with ADMG, any edge coefficient that involves a latent variable cannot be considered.", "description": "This figure compares two causal graphs (G1 and G2) and their corresponding ADMG (acyclic directed mixed graph) in the latent projection framework.  It highlights that while our proposed framework can identify the parameters of G1 (up to sign), it cannot identify the parameters of G2.  The latent projection framework, on the other hand, fails to distinguish between G1 and G2 because they project to the same ADMG. The key difference is that our framework considers edge coefficients involving latent variables, which the latent projection framework does not.", "section": "2.2 Framework Comparison"}, {"figure_path": "EQZlEfjrkV/figures/figures_22_1.jpg", "caption": "Figure 8: An illustrative graph to show orthogonal transformation indeterminacy. An atomic cover of it, {L1, L2}, has more than one latent variable, and thus there exists orthogonal transformation indeterminacy regarding coefficients of edges that involve {L1, L2}.", "description": "This figure illustrates a graph with latent variables (L1, L2, L3, L4) and observed variables (X1-X18).  The key point is that the latent variables L1 and L2 share the same parents (X5, X6) and children (X9-X12). This structure demonstrates orthogonal transformation indeterminacy, meaning that the model parameters (edge coefficients) are not uniquely identifiable.  There exists more than one set of parameters that would produce the same observed covariance matrix. This indeterminacy is specifically relevant to the parameters associated with the edges connected to L1 and L2.", "section": "3.1 Definition of Parameter Identifiability and Indeterminacy"}, {"figure_path": "EQZlEfjrkV/figures/figures_22_2.jpg", "caption": "Figure 1: Illustrations of the advantage of our framework. Within our framework, it can be shown that G₁'s parameters can be identified (up to sign) while G2's cannot. In contrast, the latent projection framework cannot even differentiate G₁ from G2 as they share the same ADMG (c) after projection. Furthermore, with ADMG, any edge coefficient that involves a latent variable cannot be considered.", "description": "This figure compares two graphs, G1 and G2, illustrating the difference in identifiability of parameters using different frameworks.  G1's parameters are identifiable (up to a sign ambiguity) within the proposed framework, whereas G2's parameters are not. The latent projection framework, however, fails to distinguish between G1 and G2 because they produce the same ADMG upon projection, thereby highlighting the limitation of previous frameworks which cannot handle edge coefficients involving latent variables.", "section": "2.2 Framework Comparison"}, {"figure_path": "EQZlEfjrkV/figures/figures_24_1.jpg", "caption": "Figure 1: Illustrations of the advantage of our framework. Within our framework, it can be shown that G₁'s parameters can be identified (up to sign) while G₂'s cannot. In contrast, the latent projection framework cannot even differentiate G₁ from G₂ as they share the same ADMG (c) after projection. Furthermore, with ADMG, any edge coefficient that involves a latent variable cannot be considered.", "description": "This figure compares the proposed framework with the latent projection framework by showing two graphs, G1 and G2.  The proposed framework can identify the parameters of G1 (up to sign), while it cannot for G2. The latent projection framework, however, fails to distinguish between G1 and G2 because they produce the same ADMG after projection.  This highlights the advantage of the proposed framework in handling latent variables.", "section": "2.2 Framework Comparison"}, {"figure_path": "EQZlEfjrkV/figures/figures_24_2.jpg", "caption": "Figure 1: Illustrations of the advantage of our framework. Within our framework, it can be shown that G₁'s parameters can be identified (up to sign) while G2's cannot. In contrast, the latent projection framework cannot even differentiate G₁ from G2 as they share the same ADMG (c) after projection. Furthermore, with ADMG, any edge coefficient that involves a latent variable cannot be considered.", "description": "This figure compares the proposed framework with existing methods for parameter identifiability in partially observed linear causal models. It shows two graphs, G1 and G2, where G1's parameters are identifiable while G2's are not, highlighting the advantage of the proposed framework.  The figure also demonstrates that the latent projection framework, which projects the DAG with latent variables onto an ADMG, fails to distinguish between G1 and G2 because it loses crucial information during projection and cannot consider edge coefficients involving latent variables.", "section": "Framework Comparison"}, {"figure_path": "EQZlEfjrkV/figures/figures_24_3.jpg", "caption": "Figure 8: An illustrative graph to show orthogonal transformation indeterminacy. An atomic cover of it, {L1, L2}, has more than one latent variable, and thus there exists orthogonal transformation indeterminacy regarding coefficients of edges that involve {L1, L2}.", "description": "This figure illustrates a graph with latent variables L1 and L2 that share the same parents and children. This demonstrates orthogonal transformation indeterminacy, meaning the parameters of the model cannot be uniquely identified due to the existence of multiple equivalent parameterizations.", "section": "3.1 Definition of Parameter Identifiability and Indeterminacy"}, {"figure_path": "EQZlEfjrkV/figures/figures_24_4.jpg", "caption": "Figure 1: Illustrations of the advantage of our framework. Within our framework, it can be shown that G₁'s parameters can be identified (up to sign) while G₂'s cannot. In contrast, the latent projection framework cannot even differentiate G₁ from G₂ as they share the same ADMG (c) after projection. Furthermore, with ADMG, any edge coefficient that involves a latent variable cannot be considered.", "description": "This figure compares the author's proposed framework with the latent projection framework using two example graphs, G1 and G2.  The figure highlights that the authors' framework can distinguish between the identifiability of parameters in G1 and G2, while the latent projection framework cannot, as both graphs project to the same ADMG.  This demonstrates the advantage of the new framework which allows for the identification of parameters involving latent variables, a limitation of previous methods. The figure showcases how different graph structures can result in different parameter identifiability characteristics.", "section": "Framework Comparison"}, {"figure_path": "EQZlEfjrkV/figures/figures_24_5.jpg", "caption": "Figure 3: An illustrative graph that satisfies the conditions for structure-identifiability. At the same time, it also satisfies the condition for parameter identifiability - given the structure and Σχ, all the parameters are identifiable only up to group sign indeterminacy.", "description": "The figure is an illustrative graph showing a partially observed linear causal model. It demonstrates a model where the structure is identifiable and the parameters are identifiable up to a group sign indeterminacy.  The graph includes both observed (X) and latent (L) variables. The conditions for structure identifiability (Condition 1 and 2) and parameter identifiability (Theorem 3) are satisfied by this graph. The figure highlights that all parameters are identifiable up to a group sign.", "section": "3.2 Graphical Condition for Structure Identifiability"}, {"figure_path": "EQZlEfjrkV/figures/figures_25_1.jpg", "caption": "Figure 8: An illustrative graph to show orthogonal transformation indeterminacy. An atomic cover of it, {L1, L2}, has more than one latent variable, and thus there exists orthogonal transformation indeterminacy regarding coefficients of edges that involve {L1, L2}.", "description": "This figure shows a graph with two latent variables L1 and L2, and six observed variables X3 to X8.  The latent variables are parents to all observed variables. The key point is that L1 and L2 share the same children (observed variables), which exemplifies the condition for orthogonal transformation indeterminacy as discussed in the paper.  This indeterminacy affects the identifiability of edge coefficients involving these latent variables.", "section": "3. Identifiability Theory"}, {"figure_path": "EQZlEfjrkV/figures/figures_25_2.jpg", "caption": "Figure 8: An illustrative graph to show orthogonal transformation indeterminacy. An atomic cover of it, {L1, L2}, has more than one latent variable, and thus there exists orthogonal transformation indeterminacy regarding coefficients of edges that involve {L1, L2}.", "description": "This figure illustrates a graph with latent variables L1 and L2 that share the same parents and children.  The caption points out that this structure demonstrates orthogonal transformation indeterminacy, meaning the parameters (edge coefficients) cannot be uniquely identified, even if the graph structure and data are known. The indeterminacy specifically affects the coefficients on edges involving L1 and L2.", "section": "3.1 Definition of Parameter Identifiability and Indeterminacy"}, {"figure_path": "EQZlEfjrkV/figures/figures_25_3.jpg", "caption": "Figure 8: An illustrative graph to show orthogonal transformation indeterminacy. An atomic cover of it, {L1, L2}, has more than one latent variable, and thus there exists orthogonal transformation indeterminacy regarding coefficients of edges that involve {L1, L2}.", "description": "This figure illustrates a graph with latent variables L1 and L2 that share the same parents and children.  This structure demonstrates orthogonal transformation indeterminacy, a type of parameter non-identifiability in partially observed linear causal models where multiple parameter sets can produce the same observational data.  Specifically, the parameters associated with edges involving L1 and L2 cannot be uniquely determined, only up to an orthogonal transformation.", "section": "3.1 Definition of Parameter Identifiability and Indeterminacy"}, {"figure_path": "EQZlEfjrkV/figures/figures_25_4.jpg", "caption": "Figure 8: An illustrative graph to show orthogonal transformation indeterminacy. An atomic cover of it, {L1, L2}, has more than one latent variable, and thus there exists orthogonal transformation indeterminacy regarding coefficients of edges that involve {L1, L2}.", "description": "This figure illustrates a graph with latent variables (L1, L2, L3, L4) and observed variables (X1-X18). The key takeaway is that the atomic cover {L1, L2} has more than one latent variable, which leads to orthogonal transformation indeterminacy. This indeterminacy impacts the identifiability of the parameters (edge coefficients) associated with the edges involving L1 and L2.  The figure highlights a scenario where the model's parameters cannot be uniquely identified, even if the structure is known, due to the presence of multiple latent variables within a single atomic cover.", "section": "3.1 Definition of Parameter Identifiability and Indeterminacy"}]