[{"figure_path": "mP084aMFsd/figures/figures_1_1.jpg", "caption": "Figure 1: The left panel shows an example of the topological event sequences generated by a mobile network, where a Granger causal graph is expected to be inferred to serve the TNFD task. The right panel illustrates the abstracted generation and inference processes. Solid lines represent the data generation process for event sequences, while dashed lines correspond to the inference process for the causal graph. Solid circles denote observed variables, and dashed circles represent latent variables.", "description": "This figure illustrates the process of generating and inferring Granger causal graphs from topological event sequences in a mobile network.  The left panel shows a sample of topological event sequences, where events occur on various devices (nodes) within a network. The right panel depicts the abstraction of this process, including data generation and inference. Solid lines show the event sequence generation process, while dashed lines indicate the process of inferring the causal graph. Observed variables are represented by solid circles and latent variables by dashed circles.", "section": "1 Introduction"}, {"figure_path": "mP084aMFsd/figures/figures_6_1.jpg", "caption": "Figure 2: The F1 Scores of different methods on synthetic data.", "description": "This figure shows the F1 scores achieved by different methods (S²GCSL, TNPAR, ADM4, CAUSE, PCMCI, MLE_SGL, ACD) on synthetic datasets.  The F1 score is a metric evaluating the accuracy of a model's predictions. The figure displays the sensitivity of the F1 score to variations in different parameters of the synthetic data generation process. These parameters include the range of activation intensity (a), the range of baseline intensity (μ), the sample size (m), the time interval (Δ), the number of event types (|V|), and the number of devices (|N|).  Each subfigure shows the F1 score across a range of values for one parameter while keeping others constant.  This allows assessment of each method's robustness and effectiveness across various data characteristics.", "section": "4.2.2 Results on Synthetic Data"}, {"figure_path": "mP084aMFsd/figures/figures_6_2.jpg", "caption": "Figure 3: The SHD of different methods on synthetic data.", "description": "This figure displays the Structural Hamming Distance (SHD) results for various methods on synthetic datasets.  The SHD metric measures the difference between two graphs, indicating the number of edge changes (insertions, deletions, or flips) needed to transform one graph into another.  Lower SHD values signify better performance. The figure shows how the SHD varies across different parameters of the synthetic data, such as the range of activation intensity, the range of baseline intensity, sample size, time interval, number of event types, and the number of devices.  It provides a visual comparison of the different methods' performance in terms of SHD under varying data characteristics.", "section": "4.2.2 Results on Synthetic Data"}, {"figure_path": "mP084aMFsd/figures/figures_7_1.jpg", "caption": "Figure 4: The SID of different methods on synthetic data.", "description": "The figure shows the Structural Intervention Distance (SID) of different methods on synthetic data.  SID measures the similarity between two directed acyclic graphs (DAGs) based on their corresponding causal inference statements, with lower SID indicating greater similarity. The graphs illustrate the sensitivity of the SID for each method (S²GCSL, TNPAR, ADM4, CAUSE, PCMCI, MLE_SGL, ACD) across various parameters of the synthetic data generation process: the range of activation intensity (a), the range of baseline intensity (µ), the sample size, the time interval (Δ), the number of event types (|V|), and the number of devices (|N|). The results show that S²GCSL generally achieves a lower SID across different parameter settings, suggesting its robustness and better performance in causal structure learning compared to other methods.", "section": "4.2.2 Results on Synthetic Data"}]