[{"figure_path": "Lzl8qJYXv5/figures/figures_5_1.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1 – ε)–likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure shows a comparison between the true hallucination rate (THR) and the posterior hallucination rate (PHR) for different dataset sizes (n=2 and n=100).  The top panels display the neural process's generated outcomes, with the blue region representing the (1-ε)-likely set based on the true generative model and the purple region showing the (1-ε)-likely set based on the model's posterior predictive distribution. The bottom panels illustrate the corresponding PHR and THR across the input domain.  The plots demonstrate the relationship between the estimated PHR and the actual THR, particularly how the PHR's accuracy increases as the dataset size grows, indicating the effectiveness of the proposed method for estimating hallucination rates.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_6_1.jpg", "caption": "Figure 3: Synthetic data: (a) Plot of the average THR and PHR as a function of n. The THR and PHR follow each other and decrease as the number of contextual examples n increases. (b) Plot of the estimated PHR vs the THR. Each point represents the predicted PHR and actual THR for a given instance. Perfect performance would have all points on the x = y. Results show the PHR closely approximates THR, but performance degrades with context length.", "description": "This figure displays the results of a synthetic regression experiment, comparing the true hallucination rate (THR) and the posterior hallucination rate (PHR) estimator for different sizes of the in-context dataset (n).  Panel (a) shows that THR and PHR decrease and track each other very closely as n increases. Panel (b) shows a scatter plot demonstrating the calibration of the PHR estimator, showing the PHR closely aligns with the THR across different sizes of the dataset, although the accuracy decreases as context length increases.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_7_1.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1-ε)-likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure shows the results of a synthetic regression experiment.  The top row (n=2 and n=100) shows the data generated by the neural process model and the true and estimated (1-ε) likely sets. The blue region shows the true (1-ε) likely set, while the purple shows the estimated set based on a small number of observations. The bottom row shows the true hallucination rate (THR) and the posterior hallucination rate (PHR).  The plots illustrate how the PHR (estimated hallucination rate) aligns with the THR (true hallucination rate) and how both metrics improve (reduce) as more contextual examples are given.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_7_2.jpg", "caption": "Figure 3: Synthetic data: (a) Plot of the average THR and PHR as a function of n. The THR and PHR follow each other and decrease as the number of contextual examples n increases. (b) Plot of the estimated PHR vs the THR. Each point represents the predicted PHR and actual THR for a given instance. Perfect performance would have all points on the x = y. Results show the PHR closely approximates THR, but performance degrades with context length.", "description": "This figure shows the relationship between the True Hallucination Rate (THR) and the Posterior Hallucination Rate (PHR) for synthetic regression data with varying numbers of context examples (n).  Panel (a) demonstrates that as the number of context examples increases, both THR and PHR decrease, showing a strong positive correlation. Panel (b) displays a calibration plot, where each point represents the PHR and THR for a single instance. The closer the points are to the diagonal line (x=y), the better the PHR's accuracy as a predictor of THR.  While the PHR is generally a good estimator, the figure shows that its accuracy decreases as the context length increases.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_16_1.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1 – ε)-likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure shows the results of a synthetic regression experiment comparing the posterior hallucination rate (PHR) and the true hallucination rate (THR) for different dataset sizes (n=2 and n=100).  The blue shaded regions represent the (1-ε)-likely sets for the true data-generating process (THR), calculated using the true underlying model, while the purple regions show the (1-ε)-likely sets estimated by the CGM (PHR). As the number of data points increases from n=2 to n=100, the purple region converges toward the blue region, indicating improved accuracy of the CGM's predictions. The plots clearly illustrate how the PHR (model estimate) becomes more accurate as the size of the training dataset increases, closely tracking the THR (true value).", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_19_1.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1-6)–likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure visualizes the results of a synthetic regression experiment.  It compares the neural process's generated outcomes for two different dataset sizes (n=2 and n=100). The blue shaded region represents the (1-ε)-likely set based on the true underlying data generating process, while the purple region shows the same set but conditioned on observed data. The panels on the right show the corresponding posterior hallucination rate (PHR) and true hallucination rate (THR) estimations. The plots visually demonstrate how the model's uncertainty decreases as the amount of available context data increases.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_27_1.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1-ε)-likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure shows the neural process's generated outcomes for different dataset sizes (n=2 and n=100). The blue region represents the true (1-ε)-likely set based on the true underlying function, while the purple region shows the (1-ε)-likely set from the model's perspective, conditioned on the observed data.  The plots illustrate how the posterior hallucination rate (PHR) and the true hallucination rate (THR) change across the input domain (x) for each dataset size. This helps visualize the model's uncertainty and how well the PHR approximates the THR as the dataset size increases.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_29_1.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1-6)–likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure compares the true and estimated hallucination rates for a synthetic regression task. The top row shows the generated outcomes of a neural process model for two different dataset sizes (n=2 and n=100).  The blue shaded area represents the true (1-ε)-likely set, meaning the range of values with at least a 1-ε probability under the true data generating distribution. The purple shaded area represents the corresponding range based on the model's posterior predictive distribution. The lower row of the figure illustrates the true hallucination rate (THR, in blue) and the estimated posterior hallucination rate (PHR, in purple) as a function of input x, for both dataset sizes. The figure aims to demonstrate that PHR is a good estimator for THR. ", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_30_1.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1-6)–likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure shows a comparison of the true hallucination rate (THR) and the posterior hallucination rate (PHR) for different dataset sizes (n=2 and n=100).  The blue shaded regions represent the (1-ε)-likely sets of the true generative model, while the purple regions represent the (1-ε)-likely sets of the model's posterior predictive distribution. The plots show that as the dataset size increases, the model's posterior predictive distribution becomes more aligned with the true distribution, reducing the rate of hallucinations.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_30_2.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1-є)-likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure demonstrates the results of synthetic regression experiments with different numbers of data points (n=2 and n=100). The top row shows the generated outcomes (blue for true and purple for estimated). The bottom row shows the corresponding posterior hallucination rate (PHR) and true hallucination rate (THR) across the domain. The results show that PHR closely aligns with THR as the number of data points increases.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_31_1.jpg", "caption": "Figure 3: Synthetic data: (a) Plot of the average THR and PHR as a function of n. The THR and PHR follow each other and decrease as the number of contextual examples n increases. (b) Plot of the estimated PHR vs the THR. Each point represents the predicted PHR and actual THR for a given instance. Perfect performance would have all points on the x = y. Results show the PHR closely approximates THR, but performance degrades with context length.", "description": "This figure shows the relationship between the true hallucination rate (THR) and the posterior hallucination rate (PHR) for synthetic regression data. Panel (a) shows that as the number of context examples (n) increases, both THR and PHR decrease, indicating that the PHR is a good estimator of the THR. Panel (b) further validates this by showing a strong correlation between the predicted PHR and actual THR. However, the accuracy of the PHR estimator decreases as the context length increases.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_31_2.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1-ε)-likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure shows the results of synthetic regression experiments comparing the posterior hallucination rate (PHR) and the true hallucination rate (THR). The top row shows the model's generated outcomes for different dataset sizes (n=2 and n=100). The bottom row shows the PHR and THR curves across the domain. The blue region represents the true (1-ε)-likely set for each model, and the purple region represents the likely set based on the model's prediction.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_32_1.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1-ε)-likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure shows a comparison between the true hallucination rate (THR) and the posterior hallucination rate (PHR) for a synthetic regression task.  The left and right panels depict the neural process's generated outcomes (with different numbers of training data points) and the corresponding (1-ε)-likely sets for true and estimated responses. The central panels show the THR and PHR across the input domain. The comparison illustrates how accurately the PHR estimates the THR for different sample sizes.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_33_1.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1 – є)–likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure shows the comparison between the true hallucination rate (THR) and the posterior hallucination rate (PHR) for different numbers of data points (n=2 and n=100). The blue region represents the (1-ε)-likely set based on the true generative model, while the purple region represents the (1-ε)-likely set based on the model's predictions. The plots show that as the number of data points increases, the PHR becomes a better estimate of the THR, indicating that the model's uncertainty decreases and its predictions become more accurate. This demonstrates the effectiveness of the proposed method for estimating hallucination rates.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_33_2.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1-ε)-likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure shows a comparison of the true hallucination rate (THR) and the posterior hallucination rate (PHR) for synthetic regression tasks.  The top row shows the generated outcomes of a neural process model for two different dataset sizes (n=2 and n=100). The blue region represents the (1-ε)-likely set based on the true data generating process; the purple region shows the (1-ε)-likely set predicted by the model based on the observed data. The bottom row shows plots of the PHR and THR across the input domain (x). This visualization helps to understand how the model's prediction uncertainty relates to the true uncertainty and how this relationship changes with the size of the training dataset.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_33_3.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1-ε)-likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure shows the comparison of the generated outcomes by the neural process model with the true and posterior hallucination rates, showing how the model's uncertainty changes with the amount of data (n). The blue region represents the actual likely set of responses given the mechanism f*, while the purple region is generated by the model given the context data. The second and fourth panels show how the PHR and THR align with the actual (1-ε)-likely sets. As the number of data points (n) increases, the purple region becomes more aligned with the blue region, demonstrating that the posterior hallucination rate aligns well with the true hallucination rate.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_34_1.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1-ε)-likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure shows the results of a synthetic regression experiment.  The top row shows the model's generated outcomes for different dataset sizes (n=2 and n=100). The blue shaded region represents the true (1-ε)-likely set, which is the set of responses that are likely to be generated from the underlying true data distribution. The purple shaded region represents the likely set, when considering the context. The bottom row shows the posterior hallucination rate (PHR) and the true hallucination rate (THR) for the different dataset sizes. The PHR is the probability that the model will generate a response that is unlikely, given the context, whereas the THR is the probability that a hallucination will be generated, given the true data distribution.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_34_2.jpg", "caption": "Figure 5: Llama-2-7b: Error Rate (Top green curves) and Response Entropy (Bottom blue curves) on LLM in-context learning tasks. Grey dashed lines represent the error rate and entropy of a random classifier over the set of valid responses.", "description": "This figure shows the performance of Llama-2-7b on six different natural language in-context learning tasks.  The top curves (green) show the model's error rate in predicting the correct response, while the bottom curves (blue) show the predictive entropy. The grey dashed lines show the baseline error rate and entropy of a random classifier. The x-axis represents the number of in-context examples used, and the y-axis represents both the error rate and the predictive entropy.  The figure illustrates how both the error rate and entropy decrease with more in-context examples, indicating improved model performance.  However, the rate of improvement varies significantly across different tasks, highlighting the complexity of ICL in natural language.", "section": "3.2 Natural language tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_35_1.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1-ε)-likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure displays the results of synthetic regression experiments.  The left and right panels in the top row show the neural process's generated outcomes for datasets with 2 and 100 examples, respectively. The blue region represents the (1-ε)-likely set based on the true generative model, while the purple region is the likely set determined by the model, conditioned on the data. The bottom panels show the posterior hallucination rate (PHR) and the true hallucination rate (THR) calculated by the model.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_35_2.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1-є)-likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure shows the comparison between the true hallucination rate (THR) and the posterior hallucination rate (PHR) for a synthetic regression task.  The top row shows the neural process's generated outcomes (model's predictions) for datasets of size n=2 and n=100. The blue region represents the true likely set of outputs (based on the true underlying data generating process), while the purple region shows the model's likely set of outputs (based on the model's learned distribution). The bottom row shows the THR and PHR calculated across the range of input values (x). The graphs illustrate how increasing the dataset size (n) improves the model's ability to predict likely outputs, resulting in a closer alignment between THR and PHR.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_37_1.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1-ε)-likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure shows the results of a synthetic regression experiment.  The top row illustrates the model's prediction for two different dataset sizes (n=2 and n=100). The blue shaded area shows the (1-ε)-likely set based on the true underlying data generating process (which is known in this synthetic setting).  The purple area shows the model's predicted (1-ε)-likely set given the observed data.  The bottom row shows the posterior hallucination rate (PHR) and the true hallucination rate (THR) for the same datasets.  The figure demonstrates that the PHR accurately estimates THR and that both decrease with increasing data size (n).", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_38_1.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1-6)–likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure shows the results of a synthetic regression experiment with different numbers of in-context examples. The top row shows the generated data for n=2 and n=100, with the blue region representing the true (1-ε)-likely set and the purple region representing the likely set conditioned on the observed data. The bottom row shows the corresponding posterior hallucination rate (PHR) and true hallucination rate (THR) curves across the x-domain. The plots show that, with increasing number of in-context examples, both the PHR and THR approach the ground truth.", "section": "3.1 Synthetic regression tasks"}, {"figure_path": "Lzl8qJYXv5/figures/figures_39_1.jpg", "caption": "Figure 2: In the first and third panes, we see the neural process's generated outcomes for n = 2 and n = 100. The blue region is the true (1-6)–likely set, while the purple is the likely set when conditioned on the blue data points. The second and fourth panes are the corresponding measures of the PHR and THR across the domain.", "description": "This figure shows a comparison of the true hallucination rate (THR) and the posterior hallucination rate (PHR) for a synthetic regression task.  The top row shows the generated data and the (1-ε)-likely sets for different numbers of data points (n=2 and n=100). The blue region represents the true (1-ε)-likely set based on the ground truth function, while the purple region represents the (1-ε)-likely set predicted by the model. The bottom row shows the PHR and THR plotted against the input values. This demonstrates how the PHR estimator accurately predicts the THR, especially with smaller dataset sizes.", "section": "3.1 Synthetic regression tasks"}]