[{"figure_path": "Lbuxdzg1pd/tables/tables_3_1.jpg", "caption": "Figure 1: Choosing the optimal parameters τ and 1 − γ for our analysis in Theorem 5: For a given level of robustness, what is the best consistency we can obtain with our analysis.", "description": "This figure shows a Pareto frontier of robustness and consistency tradeoffs for Algorithm 2.  For a given level of robustness (tolerance for error in the predicted gap), the plot indicates the maximum achievable consistency (performance with an accurate prediction). This illustrates the algorithm's ability to balance robustness and accuracy.", "section": "4 Robustness-Consistency Trade-offs"}, {"figure_path": "Lbuxdzg1pd/tables/tables_5_1.jpg", "caption": "Figure 1: Choosing the optimal parameters τ and 1 − γ for our analysis in Theorem 5: For a given level of robustness, what is the best consistency we can obtain with our analysis.", "description": "This figure shows the Pareto frontier of robustness versus consistency for Algorithm 2, a modified secretary algorithm that incorporates a predicted additive gap.  The x-axis represents the level of robustness (the algorithm's competitive ratio when the predicted gap is inaccurate), and the y-axis represents the level of consistency (the algorithm's competitive ratio when the predicted gap is accurate).  The curve illustrates the trade-off between robustness and consistency; improving one often requires sacrificing the other.  The optimal choice of parameters τ and γ (which control the algorithm's behavior) depends on the desired balance between robustness and consistency.", "section": "4 Robustness-Consistency Trade-offs"}, {"figure_path": "Lbuxdzg1pd/tables/tables_7_1.jpg", "caption": "Algorithm 3 Secretary with Bounded Prediction Error", "description": "This algorithm is a modification of the secretary problem algorithm that incorporates a bounded error in the predicted additive gap.  It observes weights up to a time τ, computes the best-so-far (BSF) value, and then accepts the first element whose weight exceeds the maximum of the BSF and the predicted gap minus the error bound (ẽ - є). This modification aims to improve robustness against inaccurate gap predictions.", "section": "5 Improved Guarantees for Bounded Errors"}]