[{"figure_path": "PKEmH9ZJfw/tables/tables_2_1.jpg", "caption": "Table 1: Comparison of proposed method with other recent related work on causal learning from interventional data", "description": "This table compares the proposed method with other existing methods for causal learning from interventional data.  It contrasts various aspects of each method, including the type of causal mechanisms and mixing functions used, whether they handle hard or soft interventions, whether they employ explicit or implicit modeling, and the level of identifiability achieved (up to what level of transformation they can uniquely identify the true causal graph).  This allows for a comprehensive comparison of the relative strengths and weaknesses of different approaches in the field of causal representation learning.", "section": "2 Related Work"}, {"figure_path": "PKEmH9ZJfw/tables/tables_7_1.jpg", "caption": "Table 2: Comparison of identifiability results", "description": "This table compares the causal disentanglement and causal completeness scores for different causal graphs (G1-G10) across four different causal representation learning models: B-VAE, d-VAE, ILCM, and ICRL-SM.  The scores quantify how well each model can disentangle and recover the true causal relationships from the data.  Higher scores indicate better performance in identifying the true causal structure.", "section": "5 Results"}, {"figure_path": "PKEmH9ZJfw/tables/tables_8_1.jpg", "caption": "Table 3: Table comparing action and object accuracy across various methods on Causal-Triplet datasets under different settings. Z and zi show whether all causal variables (Z), or only the intervened casual variable (zi) are used for the prediction task. R64 denote images with resolutions 64 x 64.", "description": "This table compares the performance of different causal representation learning methods on two action prediction tasks using the Causal-Triplet datasets.  It shows action and object accuracy, varying whether all causal variables or only the intervened variable are used for prediction, and using images with 64x64 resolution. The methods compared are β-VAE, d-VAE, ILCM, and the proposed ICRL-SM.", "section": "4.2 Metrics"}, {"figure_path": "PKEmH9ZJfw/tables/tables_8_2.jpg", "caption": "Table 2: Comparison of identifiability results", "description": "This table compares the identifiability results of different models (B-VAE, d-VAE, ILCM, and ICRL-SM) across ten different causal graphs (G1-G10).  For each graph, the table shows the Causal Disentanglement and Causal Completeness scores, which measure how well the models disentangle and fully capture the causal variables, respectively.  The results help evaluate the effectiveness of each method in identifying the true causal relationships within the different graph structures.", "section": "5 Results"}, {"figure_path": "PKEmH9ZJfw/tables/tables_8_3.jpg", "caption": "Table 2: Comparison of identifiability results", "description": "This table presents the Causal Disentanglement and Causal Completeness scores for different causal graph structures (G1-G10) across four different models: B-VAE, d-VAE, ILCM, and ICRL-SM.  The scores indicate the degree of disentanglement and completeness achieved by each model in identifying the true causal relationships within the generated datasets.  Higher scores reflect better performance.", "section": "5 Results"}, {"figure_path": "PKEmH9ZJfw/tables/tables_18_1.jpg", "caption": "Table 1: Comparison of proposed method with other recent related work on causal learning from interventional data", "description": "This table compares the proposed method with other related work on causal learning from interventional data. It compares various aspects of different methods, including the type of causal mechanisms and mixing functions used, the type of interventions employed (soft or hard), whether the approach is explicit or implicit, and the identifiability results achieved. The table provides a comprehensive overview of existing techniques and highlights the unique aspects of the proposed method.", "section": "Related Work"}, {"figure_path": "PKEmH9ZJfw/tables/tables_18_2.jpg", "caption": "Table 1: Comparison of proposed method with other recent related work on causal learning from interventional data", "description": "This table compares the proposed Implicit Causal Representation Learning via Switchable Mechanisms (ICRL-SM) method with other related works on causal learning from interventional data.  The comparison is made across several key aspects: the type of causal mechanisms and mixing functions used, the type of interventions considered (soft or hard), whether the model is explicit or implicit, and the identifiability results achieved. The table highlights the unique contributions of ICRL-SM, which is an implicit approach capable of handling soft interventions.", "section": "Related Work"}, {"figure_path": "PKEmH9ZJfw/tables/tables_20_1.jpg", "caption": "Table 3: Table comparing action and object accuracy across various methods on Causal-Triplet datasets under different settings. Z and zi show whether all causal variables (Z), or only the intervened casual variable (zi) are used for the prediction task. R64 denote images with resolutions 64 x 64.", "description": "This table compares the performance of different methods on two downstream tasks: Causal Disentanglement and Action Inference.  It shows action and object accuracy using either all causal variables or only the intervened variable, with image resolution of 64x64. The results demonstrate the superior performance of the proposed ICRL-SM method, especially when only the intervened variable is used for prediction, indicating its effectiveness in disentangling causal factors from soft interventions.", "section": "5.2 Factors Affecting Causal Disentanglement"}, {"figure_path": "PKEmH9ZJfw/tables/tables_20_2.jpg", "caption": "Table 2: Comparison of identifiability results", "description": "This table compares the causal disentanglement and causal completeness scores for different causal graphs (G1-G10) across four different methods: B-VAE, d-VAE, ILCM, and ICRL-SM.  The scores are calculated on test data and show the performance of each model in identifying the causal relationships within the various graph structures.", "section": "5 Results"}]