[{"figure_path": "OcO2XakUUK/tables/tables_5_1.jpg", "caption": "Table 2: Consistency properties of existing surrogate losses and ours in the case of c(x, y) = 1g(x)+y.", "description": "This table summarizes the consistency properties of several surrogate loss functions for learning to defer, focusing on the case where the cost function is based on the expert's classification error.  It compares existing methods (LCE, LOVA, Lgeneral, LRS) with the newly proposed LRL2D family of losses. For each loss function, the table indicates whether it satisfies realizable H-consistency, Bayes-consistency, and H-consistency bounds.  The table highlights the advantages of the LRL2D family in simultaneously achieving multiple consistency guarantees.", "section": "4.5 Summary"}, {"figure_path": "OcO2XakUUK/tables/tables_7_1.jpg", "caption": "Table 2: Consistency properties of existing surrogate losses and ours in the case of c(x, y) = 1g(x)+y.", "description": "This table summarizes the consistency properties of different surrogate loss functions for learning to defer in the specific case where the cost function is based on the expert's classification error.  It shows whether each loss function satisfies realizable H-consistency, Bayes-consistency, and H-consistency bounds.  The table compares the properties of existing losses (LCE, LOVA, Lgeneral, LRS) with the newly proposed losses (LRL2D with various choices of function Ψ).", "section": "4.5 Summary"}, {"figure_path": "OcO2XakUUK/tables/tables_8_1.jpg", "caption": "Table 3: Comparison of system accuracy, accepted accuracy and coverage; mean ± standard deviation over three runs. Realizable L2D outperforms or is comparable to baselines in all the settings.", "description": "This table compares the performance of several learning-to-defer (L2D) methods, including those proposed in the paper, across three real-world datasets.  For each method and dataset, it shows the system accuracy (overall accuracy), accepted accuracy (accuracy on non-deferred instances), and coverage (percentage of instances not deferred).  The results demonstrate the effectiveness of the proposed Realizable L2D methods compared to existing baselines.", "section": "6 Experiments"}]