[{"figure_path": "EIl9qmMmvy/tables/tables_4_1.jpg", "caption": "Table 1: Evaluation results on D4RL benchmark. We report the average normalized scores at the end of training with standard deviation across 5 random seeds. Diffusion-DICE (D-DICE) demonstrates superior performance compared to all baseline algorithms in 13 out of 15 tasks, especially on more challenging tasks.", "description": "This table presents the average normalized scores achieved by Diffusion-DICE and several baseline algorithms on 15 different tasks from the D4RL benchmark.  The results are averaged across 5 independent runs with standard deviations reported, highlighting the superior performance of Diffusion-DICE on the majority of tasks.", "section": "4.1 D4RL Benchmark Datasets"}, {"figure_path": "EIl9qmMmvy/tables/tables_7_1.jpg", "caption": "Table 1: Evaluation results on D4RL benchmark. We report the average normalized scores at the end of training with standard deviation across 5 random seeds. Diffusion-DICE (D-DICE) demonstrates superior performance compared to all baseline algorithms in 13 out of 15 tasks, especially on more challenging tasks.", "description": "This table presents the quantitative results of Diffusion-DICE and several baseline algorithms on the D4RL benchmark.  The average normalized scores and standard deviations across 5 random seeds are reported for 15 different tasks.  The results highlight Diffusion-DICE's superior performance compared to other methods, particularly on more difficult tasks.", "section": "4.1 D4RL Benchmark Datasets"}, {"figure_path": "EIl9qmMmvy/tables/tables_26_1.jpg", "caption": "Table 1: Evaluation results on D4RL benchmark. We report the average normalized scores at the end of training with standard deviation across 5 random seeds. Diffusion-DICE (D-DICE) demonstrates superior performance compared to all baseline algorithms in 13 out of 15 tasks, especially on more challenging tasks.", "description": "This table presents the quantitative results of Diffusion-DICE and several baseline algorithms on 15 tasks from the D4RL benchmark.  The average normalized scores and standard deviations across 5 random seeds are shown for each algorithm and task.  Diffusion-DICE outperforms the baselines on most tasks, particularly the more difficult ones.", "section": "4.1 D4RL Benchmark Datasets"}, {"figure_path": "EIl9qmMmvy/tables/tables_26_2.jpg", "caption": "Table 3: Comparison of K between Diffusion-DICE and IDQL", "description": "This table compares the number of action candidates (K) used in the select stage of the Diffusion-DICE algorithm and the IDQL algorithm across different D4RL benchmark tasks. It shows that Diffusion-DICE requires significantly fewer action candidates than IDQL to achieve comparable performance.", "section": "4.1 D4RL Benchmark Datasets"}, {"figure_path": "EIl9qmMmvy/tables/tables_26_3.jpg", "caption": "Table 1: Evaluation results on D4RL benchmark. We report the average normalized scores at the end of training with standard deviation across 5 random seeds. Diffusion-DICE (D-DICE) demonstrates superior performance compared to all baseline algorithms in 13 out of 15 tasks, especially on more challenging tasks.", "description": "This table presents the performance comparison of Diffusion-DICE against various baseline algorithms on 15 tasks from the D4RL benchmark.  The results show the average normalized scores and standard deviations across 5 random seeds for each algorithm and task. Diffusion-DICE outperforms the other methods in a majority of tasks, highlighting its effectiveness, especially on more difficult tasks.", "section": "4.1 D4RL Benchmark Datasets"}, {"figure_path": "EIl9qmMmvy/tables/tables_26_4.jpg", "caption": "Table 1: Evaluation results on D4RL benchmark. We report the average normalized scores at the end of training with standard deviation across 5 random seeds. Diffusion-DICE (D-DICE) demonstrates superior performance compared to all baseline algorithms in 13 out of 15 tasks, especially on more challenging tasks.", "description": "This table presents the performance comparison of Diffusion-DICE against various baseline algorithms on 15 tasks from the D4RL benchmark.  The results, averaged across 5 random seeds, show the average normalized scores and standard deviations. Diffusion-DICE outperforms other methods on most tasks, particularly the more difficult ones.", "section": "4.1 D4RL Benchmark Datasets"}]