[{"type": "text", "text": "Visual Fourier Prompt Tuning ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Runjia Zeng1 \\*, Cheng $\\mathbf{Han}^{2}\\,^{*}$ , Qifan Wang3, Chunshu $\\mathbf{W}\\mathbf{u}^{4}$ , Tong Geng4, Lifu Huang5, Ying Nian $\\mathbf{W}\\mathbf{u}^{6}$ and Dongfang Liu1† ", "page_idx": 0}, {"type": "text", "text": "1Rochester Institute of Technology 2University of Missouri - Kansas City 3Meta AI 4University of Rochester 5Virginia Tech 6University of California, Los Angeles ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "With the scale of Transformer-based vision models continuing to grow, finetuning these large-scale pretrained models for new tasks has become increasingly parameter-intensive. Visual prompt tuning is introduced as a parameter-efficient finetuning (PEFT) method to this trend. Despite its successes, a notable research challenge persists within almost all PEFT approaches: significant performance degradation is observed when there is a substantial disparity between the datasets used in pretraining and finetuning phases. To address this challenge, we draw inspiration from human visual cognition, and propose the Visual Fourier Prompt Tuning (VFPT) method as an effective and efficient solution for adapting largescale Transformer-based models. Our approach innovatively incorporates the Fast Fourier Transform into prompt embeddings, seamlessly integrating both spatial and frequency domain information. Apart from its inherent simplicity and intuitiveness, VFPT exhibits superior performance across various tasks, offering a general solution to address the data disparity challenge. Empirical results demonstrate that our approach outperforms several state-of-the-art baselines on two benchmarks, with low parameter usage (e.g., $0.57\\%$ of model parameters on VTAB-1k) and notable performance enhancements (e.g., $73.20\\%$ of mean accuracy on VTAB-1k). Our code is avaliable at https://github.com/runtsang/VFPT. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "“Fourier’s theorem is not only one of the most beautiful results of modern analysis, but it may be said to furnish an indispensable instrument in the treatment of nearly every recondite question in modern physics.” ", "page_idx": 0}, {"type": "text", "text": "−Lord William Thomson Kelvin [1] ", "page_idx": 0}, {"type": "text", "text": "Prompt tuning [2, 3] is initially introduced for parameter-efficient adaptation of large foundation models in natural language processing (NLP). As vision models continue to scale for enhanced performance, visual prompt tuning [4] has been applied to various vision domains (e.g., image classification [5], segmentation [6, 7], detection [8]), demonstrating superior performance and lower parameter usage compared to other parameter-efficient fine-tuning (PEFT) methods. However, a common challenge within the research community remains unaddressed: significant performance degradation occurs when there is a substantial disparity between the data used in pretraining and finetuning [9, 10]. This issue hinders the broader application of visual prompt tuning. Consequently, a natural question arises: $\\textcircled{1}$ Can prompt tuning generalize across datasets with varying disparities? ", "page_idx": 0}, {"type": "text", "text": "As researchers commonly draw insights from human to replicate the principles in intelligent machines [11, 12, 13, 14], we consider to answer this question from the human visual cognition’s perspective. While humans comprehend the world through past experiences/knowledge, it is essential to generalize and adapt this understanding to new tasks efficiently and effectively. The robust and rapid adaptability of human visual cognition thus arises from various domain analysis, capturing the new patterns from different channels and perspectives [15, 16, 17]. ", "page_idx": 0}, {"type": "text", "text": "Interestingly, we find that the paradigm of visual prompt tuning is conceptually analogous to human visual cognition. While the frozen large-scale vision model functions as accumulated knowledge, the fast adaptation mechanism resembles visual prompt tuning, requiring the incorporation of diverse domains of information (e.g., time, frequency) to achieve comprehensive understandings [18, 19, 20]. The Fast Fourier Transform (FFT) [18, 19, 20], renowned for its ability to convert signals from their original domain (e.g., time or spatial) to the frequency domain and vice versa, serves as an ideal tool for contributing informative insights in the frequency domain. By leveraging the capabilities of FFT, visual prompts can naturally integrate both spatial and frequency domain information during finetuning, thereby enabling the frozen vision model to achieve consistent and robust performance across datasets with varying disparities. Consequently, our research question evolves into: $\\circledcirc$ How can FFT be integrated into visual prompt tuning to emulate the human visual mechanism? ", "page_idx": 1}, {"type": "text", "text": "To this end, we employ a simple yet effective strategy that utilizes the Fourier operations to facilitate visual prompt tuning (see Fig. 1(c)). By integrating frequency domain information into learnable prompt embeddings, our approach elegantly assimilates data from both spatial and frequency domains, simulating the human visual cognition. We name our approach Visual Fourier Prompt Tuning (VFPT), which exhibits several compelling advantages: $\\pmb{\\mathrm{\\Sigma}}$ Simplicity. The intuitive application of FFT in prompt tuning emulates the rapid processing capabilities of the human visual system, making VFPT both elegant and straightforward to implement (see $\\S2.1\\$ ). $\\pmb{\\varphi}$ Generality. By incorporating frequency domain information, the search space for latent embeddings of prompts is naturally expanded, resulting in advanced enhancement in performance across different datasets and tasks with varying data disparities (see $\\S4.2\\rangle$ ). The generality of our model is further illustrated through our analysis of the optimization process, which enables smoother navigation towards local minima, increasing flatness around them and exhibiting apparent convexity. $\\pmb{\\otimes}$ Interpretability. To intuitively demonstrate the advantages of Fourier components, we visually illustrate that the introduction of Fourier transform in visual prompt tuning results in a markedly higher concentration of attention scores within the Transformer’s input space, which correlates positively with enhancements in performance (see $\\S4.4\\rangle$ ). This observation, in turn, explains the effectiveness of our approach. ", "page_idx": 1}, {"type": "text", "text": "Comprehensive experiments are conducted to evaluate the performance of VFPT. In $\\S2$ , we conduct a literature review and discuss relevant works. Our approach is presented in $\\S3$ , where we describe how we simple yet effectively integrate FFT into visual prompt tuning. In $\\S4.2$ , we present compelling experimental results on various benchmarks, backbones, and different pretraining objectives, achieving superior performance without complex engineering design. Specifically, our approach achieves an average improvement of $7.63\\,\\%$ in accuracy on VTAB-1k compared to full finetuning, and $3.77\\%$ compared to VPT [4]. In $\\S4.4$ , we demonstrate that the FFT prompts significantly enhance the activation of the frozen vision model. Additionally, we study the optimization process of prompt tuning approaches, indicating that VFPT provides a more favorable optimization process. Finally, we demonstrate the strong algorithmic generalization of our approach to the language domain, and show additional visual explanations in the Appendix. We trust that this work provides valuable insights. ", "page_idx": 1}, {"type": "text", "text": "2 Related Work ", "text_level": 1, "page_idx": 1}, {"type": "text", "text": "2.1 Visual Parameter-efficient Finetuning ", "text_level": 1, "page_idx": 1}, {"type": "text", "text": "With the significant growth in the scale of vision models, especially following the emergence of Vision Transformers [21, 22, 23, 24, 25], the development of PEFT methods under “pretrain-thenfinetune” paradigm becomes increasingly critical. Current methods under this paradigm can be generally categorized into partial tuning [26, 27, 28], extra module (i.e., including reparameterization approaches such as Low-Rank Adaptation (LoRA) [29]) [30, 31, 32, 33, 34, 10, 35, 36], and prompt tuning [4, 37, 38, 39, 40, 41]. Partial tuning and extra module face several limitations that hinder their application. $\\textcircled{1}$ Unsatisfactory performance: they generally cannot reach competitive performance with regard to full finetuning [4, 26, 27, 28, 33, 10]; $\\circledcirc$ Model-oriented design: most research requires to insert specific architecture/block design [31, 30, 32] during tuning, rendering them non-universal solutions when considering different backbones. In contrast, prompt tuning [2], originally proposed for language-domain [42, 43, 44, 45], provides a general and straightforward solution in vision with powerful performance gains. It signals a new paradigm in PEFT in the field of computer vision. ", "page_idx": 1}, {"type": "text", "text": "Generally, prompt tuning introduces a sets of learnable parameters to the input sequence of backbone models, updating only these parameters during the finetuning. Despite its apparent simplicity, the paradigm of visual prompt tuning has demonstrated notable performance enhancements. Current developments on visual prompt tuning primarily concentrate on engineering optimizations, such as reducing parameter usage [5] and expanding applicability across diverse tasks [39, 46, 47, 48]. These approaches often involve introducing additional constraints and functionalities to the foundational design, which deviate from the principles of simplicity and elegance to the original concept of visual prompt tuning. Our approach, in sharp contrast, endeavors to explore visual prompt tuning from the perspective of human visual intelligence, while diligently maintaining the simplicity of prompt tuning. It is also essential to emphasize that visual prompt tuning diverges markedly from visual instruction tuning [49] (i.e., aiming at improving the model’s instruction following abilities). ", "page_idx": 1}, {"type": "text", "text": "", "page_idx": 2}, {"type": "text", "text": "2.2 Fast Fourier Transform in Vision ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "FFT is a powerful mathematical algorithm used to compute the Discrete Fourier Transform (DFT) and its inverse [50, 51]. It is pivotal in information processing, allowing the detailed analysis of various signals (e.g., image [52, 53, 54], radar [55, 56, 57]) for frequency determinations. In vision, FFT’s ability to transform complex data in spatial domain into frequency domain makes it an invaluable tool for abstracting critical features from noisy or high-dimensional datasets [58, 59]. This abstraction is particularly beneficial as the identification of salient features are shown to have better generalization ability across domains [60, 61, 62, 63], directly influences the performance [64, 65, 66, 67] of image analysis and processing tasks. Current research on FFT in vision predominantly explores areas such as conventional image processing [52, 68, 69, 70], image pre-processing for deep neural networks (DNNs) [71, 72] and DNN architectural design [20, 66, 65, 73, 74, 75, 76]. ", "page_idx": 2}, {"type": "text", "text": "Despite its profound utility and effectiveness, the integration of FFT within the paradigm of visual prompt tuning remains largely underexplored. Recent work [77] adapts the pretrained multi-modal network to the tasks under modality-incomplete segmentation scenarios via FFT prompt tuning. This approach demonstrates the potential of FFT operations to handle missing modalities (i.e., substantial disparity) effectively. However, it primarily focuses on task-specific optimization and design. The extensive applicability and generality of FFT, especially in cross-dataset analysis, have yet to be recognized or exploited. Another work [36] incorporates Fourier transform into the LoRA-based approach. While the expressive Fourier basis facilitates the recovery of weight changes, it does not fully integrate frequency domain information during finetuning, which remains orthogonal to our approach. In this paper, we aim to broaden the scope of exploration and contribute to advancing the field of Fourier-based research in vision. By studying the integration of FFT with visual prompt tuning, we fully explore how to improve both the efficacy (see $\\S3$ ) and the adaptability of learning models to diverse and challenging datasets (see $\\S4_{.}$ ). Furthermore, we present novel evidence indicating that VFPT establishes strong correlations within the Transformer’s input space, aligning with the performance enhancements (see $\\S4.4)$ . Overall, the generality of VFPT suggests a novel understanding of the Fourier-based method in current machine learning applications. ", "page_idx": 2}, {"type": "text", "text": "3 Methodology ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "In this section, we introduce VFPT, a novel visual prompt tuning approach for effective and general large-scale transformer-based model finetuning. We first define the problem and notations of visual prompt tuning and FFT in $\\S3.1$ . The integration of Fourier-based visual prompt tuning is presented in $\\S3.2$ . The overall framework is shown in Fig. 1(c), where we compare our model with original VPT. ", "page_idx": 2}, {"type": "text", "text": "3.1 Preliminary ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Visual Prompt Tuning. Given a pretrained Transformer model $\\mathbf{T}$ with $N$ layers, the objective of prompt tuning in vision is to finetune a model $\\hat{\\bf T}$ into a new task with only a few set of $d$ -dimensional embedding vectors, i.e., prompts, in the input space after patch Emb layer. These learnable prompts are defined as $\\mathbf{P}=\\{P^{1},\\bar{P}^{2},\\bar{\\dots},P^{N}\\}$ , where ${\\bar{P}}^{i}$ represents the learnable visual prompts in the $i_{t h}$ encoder layer. Formally, the encoder layers with prompts are defined as: ", "page_idx": 2}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{Z^{1}=L_{1}(P^{1},\\,E)}\\\\ &{Z^{i}=L_{i}(P^{i},\\,Z^{i-1})\\;\\;\\;\\;i=2,3,...\\,,N}\\end{array}\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "where the embeddings of the input image patches $E$ are initialized with frozen Emb projection, and $Z^{i}$ is the contextual embeddings computed by the $i_{t h}$ encoder layer. The colors and $\\sqcap$ indicate trainable and frozen parameters, respectively. Here, trainable prompts only accounts for a small proportion of the total parameters (e.g., $1.14\\%$ on VTAB-1k [78] in VPT [4]). ", "page_idx": 2}, {"type": "image", "img_path": "nkHEl4n0JU/tmp/214b8d67edcee65554956bb0398c4e73c04d9392972b8ceeb28f5b5d2b3512f2.jpg", "img_caption": ["Figure 1: Overview of VPT vs. VFPT (ours) frameworks. (a) Original Visual Prompt Tuning. (b) 2D Fast Fourier Transform operations in partial visual prompts along hidden and sequence length dimensions. (c) The overall architecture of our proposed VFPT (see $\\S3.2)$ . "], "img_footnote": [], "page_idx": 3}, {"type": "text", "text": "Fast Fourier Transform. The FFT is a powerful algorithm for computing the Discrete Fourier Transform (DFT), which transforms a finite sequence of equally-spaced function samples into a same-length discrete-time Fourier transform sequence. Specifically, given a sequence $\\{x_{n}\\}$ where $n$ is a member of the interval $n\\in[0,N-1]$ , the DFT is defined as: ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\mathcal{F}(x)=X_{k}=\\sum_{n=0}^{N-1}x_{n}e^{-i2\\pi\\frac{k}{N}n},\\quad0\\leq k\\leq N-1.\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "For a finite sequence of equally-spaced samples $\\{x_{n}\\}$ , the DFT generates a same-length sequence of equally-spaced samples $\\{X_{k}\\}$ . This transform is denoted as $\\mathcal{F}$ . The initial DFT is in complexity $O(n^{\\bar{2}})$ . For acceleration, we use Cooley–Tukey FFT algorithm [79] following common practice [80] (i.e., complexity $O(n\\log n))$ . FFT serves as a powerful tool for domain transition. Consequently, we explore the integration of the FFT operation within PEFT methods, particularly in prompt tuning. ", "page_idx": 3}, {"type": "text", "text": "3.2 Visual Fourier Prompt Tuning ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Visual prompt tuning is particularly useful under the pretrain-then-finetune paradigm. However, it suffers a significant performance reduction when substantial disparities exist between pretrain and finetune datasets. The reason is that during finetuning on new data, the image distribution may deviate markedly from the examples used in pretraining the backbone model [9]. Existing prompt tuning [4, 5], focusing predominantly on spatial information, can only harness the shared information embedded within the pretrained backbone, limiting their capacity to adapt effectively to novel tasks. Thus, it is crucial to strengthen the ability to capture distinguishing feature from finetuning data. ", "page_idx": 3}, {"type": "text", "text": "To this end, we introduce VFPT, an intuitive yet powerful method with advanced performance and generality. Compared to VPT (see Fig. 1(a)), our model (see Fig. 1(c)) transforms partial prompts from spatial domain to frequency domain via 2D FFT (see $\\S3.1)$ to consider both the spatial and frequency domain information. Formally, for each learnable visual prompts in the $i_{t h}$ encoder layer $P^{i}\\overset{\\cdot}{\\in}\\mathbf{P}=\\{P^{1},P^{2},\\ldots,P^{N}\\}$ , we have $\\dot{P^{i}}=\\{p_{1}^{i},p_{2}^{i},\\cdot\\cdot\\cdot,p_{M}^{i}\\}$ . We select $m$ partial prompts as visual Fourier prompts at each layer, where $0\\leq m\\leq M$ . Further, $\\alpha=m/M$ represents the fraction of Fourier participation, where zero indicates all prompts are original visual prompts, and one implies all prompts are given after FFT. We apply a 2D FFT on $\\alpha$ visual prompt embedding input with respect to both sequence (i.e., ${\\mathcal F}_{\\mathrm{seq}},$ ) and hidden dimensions $(i.e.,\\,\\mathcal{F}_{\\mathrm{h}})$ . Note that the operations $\\mathcal{F}_{\\mathrm{seq}}(\\mathcal{F}_{\\mathrm{h}}(x))$ and ${\\mathcal{F}}_{\\mathrm{h}}({\\mathcal{F}}_{\\mathrm{seq}}(x))$ are mathematically equivalent due to the commutative property of the two one-dimensional FFTs [80]. Here, $^{-}$ indicates Fourier operations. ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\begin{array}{r}{P_{\\mathcal{F}}^{i}=\\Re\\left(\\mathcal{F}_{\\mathrm{seq}}\\left(\\mathcal{F}_{\\mathrm{h}}([p_{1}^{i},p_{2}^{i},\\dots,p_{m}^{i}])\\right)\\right).}\\end{array}\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "To maintain the pretrained structure’s consistency, we only alter the prompt embeddings, and thus retain only the real component $(i.e.,\\Re)$ from the output. This design does not require any adjustments to accommodate complex numbers in the self-attention module, ensuring that the remaining elements ", "page_idx": 3}, {"type": "text", "text": "of the model remain unchanged. Consequently, the overall integrated prompts Pˆ i in the $i_{t h}$ encoder layer are formed by the concatenation between the visual Fourier prompts and visual prompts as: ", "page_idx": 4}, {"type": "equation", "text": "$$\n{\\hat{P}}^{i}=\\left[P_{\\mathcal{F}}^{i},p_{m+1}^{i},\\dots,p_{M}^{i}\\right].\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Our elegant design of VFPT enjoys a few appealing characteristics: ", "page_idx": 4}, {"type": "text", "text": "• Simplicity: VFPT only requires several lines of code based on the implementation of the visual prompt tuning. Its intuitive integration of information between spatial and frequency domains brings nearly free performance efficacy. The low complexity of FFT (i.e., $O(n\\log n);$ ) leads to an overall marginal reduction during the training schedule.(i.e., $2.8\\%$ on VTAB-1k [78]). In sharp contrast, current endeavors in visual prompt tuning mainly emphasize augmenting architectural complexity for superior performance [5, 81, 42], undermining the inherent simplicity of prompt tuning and introducing significant training overhead (e.g., [81] learns 2D prompt token map for densely image relationship construction, [5] incorporates additional self-attention K-V prompts). ", "page_idx": 4}, {"type": "text", "text": "• Generality: The frequency and spatial analysis of imagery inputs can be mutually complementary, leading to a more comprehensive feature understanding from distinct perspectives (e.g., the frequency domain allows for the distraction and decomposition of luminance and noise to a considerable degree [82], while the spatial domain excels in capturing intricate object details). By incorporating learnable prompts from both domains, VFPT demonstrates enhanced prompt learning capabilities, which makes it superior to finetune across diverse tasks (see $\\S4.2\\rangle$ ). The empirical findings of flatness and convexity of VFPT further strength our claim. ", "page_idx": 4}, {"type": "text", "text": "• Interpretability: In visual prompt tuning, a notable challenge arises concerning the interpretability of learnable prompts. Unlike in NLP, where tokens explicitly represent these prompts, visual prompts have historically lacked a clear and explainable representation. In order to intuitively perceive the function of visual prompts, we offer a possible way to understand why prompts play an important role in fine-tuning a new task through the visualization of attention maps. Moreover, we can also observe a better and stronger global feature learning pattern through introducing visual Fourier prompts, showing how Fourier prompts work. More discussion will be elaborated in $\\S4.4$ . ", "page_idx": 4}, {"type": "text", "text": "4 Experiment ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "4.1 Experiment Setup ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "Datasets. Following common practice [5, 4, 81, 83], our experiments are carried out on two image classification benchmarks. VTAB-1k [78] collects 19 benchmarked Visual Task Adaptation, separated into three groups: (1) Natural includes natural images captured by standard cameras, (2) Specialized consists of images taken by specialized equipment, and (3) Structured considers tasks considering geometric comprehension (i.e., counting, distance), which has substantial dataset disparities (i.e., tasks in Natural and Specialized are closely related to image classification and thus have low disparities, while tasks in Structured are regarded as distinct from image classification) when comparing to the pretrained dataset [9] (i.e., ImageNet21K [84]). Each task of VTAB-1k contains 1000 training examples with the 800/200 split for train/val set. FGVC contains 5 benchmarked Fine-Grained Visual Classification, including CUB-200-2011 [85], NABirds [86], Oxford Flowers [87], Stanford Dogs [88] and Stanford Cars [89]. The training set is split into $90\\%$ train and $10\\%$ val. ", "page_idx": 4}, {"type": "text", "text": "Baselines. For consistency, we follow [4, 5] and compare VFPT with other widely applied parameterefficient fine-tuning methods. Results of two vision transformer architectures, Vision transformer [23] (ViT) and Swin transformer [24] (Swin), on image classification are discussed in $\\S4.2$ . We also apply VFPT on two self-supervised objectives: MAE [90] and MoCo v3 [26]. ", "page_idx": 4}, {"type": "text", "text": "Training. Following [4, 5], we conduct grid search to find the best tuning hyperparameters, learning rate (i.e., [50, 25, 10, 5, 2.5, 1, 0.5, 0.25, 0.1, 0.05]), and weight decay (i.e., [0.01, 0.001, 0.0001, 0.0]) on val set. Notably, VFPT does not require specific-designed large learning rate in [4]. The learning rate is scheduled by a cosine decay policy and trained for 100 epochs. ", "page_idx": 4}, {"type": "text", "text": "Reproducibility. VFPT is implemented in Pytorch [91]. Experiments are conducted on NVIDIA A100-40GB GPUs. To guarantee reproducibility, our full implementation will be publicly released. ", "page_idx": 4}, {"type": "text", "text": "4.2 Main Results ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "In this section, we demonstrate the effectiveness of VFPT from two key perspectives: $\\spadesuit$ Superior Performance: Our model demonstrates significant performance improvements across diverse datasets, including challenging tasks with large disparities in data, thus showcasing its generalizability. ", "page_idx": 4}, {"type": "text", "text": "Table 1: Image classification accuracy for ViT-Base/16 [23] pretrained on supervised ImageNet-21k. Following [4, 5], we report the average test accuracy (three runs) on FGVC [4] and VTAB-1k [78] benchmarks, and “Number of Wins” in [·] compared to full fine-tuning (Full) [92]. $\\blacktriangleright$ denotes the method with highest “Number of Wins” compared to Full. We further report “Number of Wins to VPT” in $\\{\\cdot\\}$ . “Tuned/Total” is the average percentage of tuned parameters required by 24 tasks. “Scope” indicates the tuning scope of each method. “Additional parameters” is the existence of parameters in addition to the pretrained backbone and linear head. Bold and Underline indicate the best and the second best results. VFPT outperforms full fine-tuning in 22 of 24 instances with fewer trainable parameters and beats VPT in 23 of 24 cases with lower parameters. $\\dagger$ denotes methods using soft flitered prompts to reduce the parameter usage in learnable visual prompts, requiring specialized devices to facilitate acceleration. Per-task results are available in Appendix. Same for Table 2 and 3. ", "page_idx": 5}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/89ae2a1f0b53d06c3c1255a2e2285f73c17c93630c3d010db6ec4b0312da99ed.jpg", "table_caption": [], "table_footnote": [], "page_idx": 5}, {"type": "text", "text": "$\\heartsuit$ Fourier Contribution: We observe that Fourier components play a critical role in VFPT, where tasks with larger data disparities tend to favor higher percentages of Fourier components. ", "page_idx": 5}, {"type": "text", "text": "Definition of disparity. Following [9], we use the Fréchet Inception Distance (FID) [99, 100] to measure the disparity between the datasets used in pretraining (i.e., ImageNet) and funetuning (i.e., downstream tasks). Average FID scores of each group are reported in Fig. 2, where the Natural group has low disparities due to its close relationship to ImageNet21K [84] and the Specialized and Structured groups ", "page_idx": 5}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/337baf4181a891fbc7726cccfb981d1176ea22e8a2727ae8cfe56a4e7dc52f60.jpg", "table_caption": ["Table 2: Image classification accuracy for SwinBase [24] pretrained on supervised ImageNet-21k. "], "table_footnote": [], "page_idx": 5}, {"type": "text", "text": "(i.e., orientation prediction task) are considered distinct from image classification. The dataset description of VTAB-1k is covered in $\\S4.1$ (FGVC is excluded due to lack of categorization). ", "page_idx": 5}, {"type": "text", "text": "$\\spadesuit$ Superior Performance. In order to have a comprehensive understanding on generality, we examine VFPT on ViT-Base/16 [23], Swin-Base [24], and two self-supervised objectives, following common practice [4, 5]. We also report the individual per-task results for Table 1, 2 and 3 in Appendix. ", "page_idx": 5}, {"type": "text", "text": "VFPT on ViT. We report the average accuracy score on VTAB-1k and FGVC benchmarks across four diverse task groups for three runs in Table 1, where fifteen protocols under pretrain-then-finetune paradigm are considered. Specifically, Full [92] updates both backbone and classification head; Linear [92], Parital-1 [93] (top layer), and MLP-3 [94] (3 MLP layers) are partial tuning approaches; Sidetune [31], Bias [30], Adapter [32], LoRA [35], AdaptFormer [95] and $\\mathrm{{ARC}_{a t t}}$ [96] are extra module methods which add new trainable parameters to backbone for adaptation; VPT-S [4], VPTD [4], EXPRES [97] and $\\mathrm{E^{2}V P T}$ [5] are concurrent visual prompt tuning approaches. Consequently, we have several key observations. First, VFPT is able to outperform the full fine-tuning method in 22 out of 24 tasks. For example, our model achieves ${\\bf0.13\\%}$ improvement on FGVC and ${\\bf5.21\\%}$ improvements on VTAB-1k Structured, respectively. The empirical results show the effectiveness of VFPT. Second, VFPT tunes only $0.66\\%$ of the overall parameters in the backbone, establishing it as a competitive method within the PEFT approaches. Third, while VPT struggles to capture the image information when having significant dataset disparity, VFPT achieves notable performance improvements by integrating both spatial and frequency information (see $\\S3.2)$ without additional architectural modifications. (i.e., $60.19\\%$ vs. $54.98\\%$ on VTAB-1k Structured). ", "page_idx": 5}, {"type": "text", "text": "VFPT on Hierarchical Transformer. We further extend VFPT to a hierarchical transformer — Swin-Base [24] for architectural generalization. The MSA layer of Swin is employed in local shifted windows, and patch embeddings are merged at deeper layers. For consistency, we follow the same settings from ViT to apply and prepend Fourier prompts ahead of the visual prompts. The results on the ImageNet-21k supervised pretrained Swin-Base [24] are reported in Table 2. It can be seen that VFPT consistently outperforms all the other parameter-efficient methods on three VTAB-1k groups. VFPT on Different Pretraining Objectives. In Table 3, we report the experimental results on two self-supervised objectives: MAE [90] and MoCo v3 [26]. While VPT yields inconclusive results, VFPT has the highest “Number of Wins” compared to full fine-tuning among PEFT methods (i.e., 8 of 19 instances under MAE, and 14 of 19 instances under MoCo v3, respectively). Our method also outperforms VPT by a large margin (e.g., $53.59\\%$ vs. $36.02\\%$ under MAE on VTAB-1k Natural). ", "page_idx": 5}, {"type": "image", "img_path": "nkHEl4n0JU/tmp/cc8c7a556d1763c7f268fd8f00c7cd87858aa3b273697a423ab59c1b84b8ce0c.jpg", "img_caption": ["Figure 2: Image classification accuracy of various Fourier percentages of VTAB-1k [78] for ViT-Base/16 [23]. For better illustration, we randomly select 3 datasets in each group of VTAB-1k. The “Average FID Score of Each Group” is reported in $<\\cdot>$ . Our conclusion aligns with 16 of 19 cases. The cross framed by the square indicates the best percentage for each downstream task. Those datasets with only three Fourier percentage reports are due to the prompt length limits. "], "img_footnote": [], "page_idx": 6}, {"type": "text", "text": "", "page_idx": 6}, {"type": "text", "text": "$\\heartsuit$ Fourier Contribution. We conducted experiments to understand the impact of Fourier components by varying the percentages of Fourier prompts in VFPT. As shown in Fig. 2, we observed distinct preferences across the VTAB-1k benchmark, which comprises three groups with varying data disparities (see $\\S4.1)$ . Specifically, the Natural group, which has a data distribution similar to the pretrained task (low disparity), shows peak performance when half of the visual prompts are transformed into Fourier prompts, as indicated by the accuracy curves in Fig. 2(a). This suggests that transfer learning is less challenging in this group. Conversely, for the Specialized and Structured groups, which have data distributions significantly different from the pretrained task (high disparity), the accuracy curves in Fig. 2(b-c) demonstrate that higher classification performance is achieved with an increased percentage of Fourier components. These observations are consistent with our expectations, demonstrating the effectiveness of Fourier prompts in VFPT, especially for tasks with large data disparities. In other words, our approach can be viewed as a generalization of VPT, where the Fourier components learn effective representations from the frequency domain that complement the knowledge from the spatial domain. ", "page_idx": 6}, {"type": "text", "text": "4.3 Study of Optimization ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "In this section, we investigate why VFPT achieves better performance and generalization across various tasks from an optimization perspective. Previous works [102] demonstrate that landscape geometry significantly impacts model generalization, so we visualize the loss landscape to ", "page_idx": 6}, {"type": "text", "text": "understand the enhanced generality of VFPT. Specifically, in Fig.3(a), we randomly select two parameter directions for the study, as randomness in directions does not significantly affect the results [102]. There are two key observations supporting the enhanced generality of VFPT. i) Flatness: VFPT provides a larger connected region around the local minimum [103] (e.g., $\\star$ in the yellow square, where the larger blue area in VFPT offers more optimization choices) and a smoother edge of the loss landscape for mitigating chaotic landscapes (e.g., $\\bullet$ in the green square, where the bumpy contour in VPT is sensitive to loss variations, resulting in worse gen", "page_idx": 7}, {"type": "image", "img_path": "nkHEl4n0JU/tmp/d81a946b4f83d10252cfa308349fd4bbdbb69c6fb0cb24c1fbc91c3a7ea3b8f0.jpg", "img_caption": ["Figure 3: Visualization of loss landscape [102] and the ratio map of Hessian [102]. "], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "erality). This indicates that VFPT achieves a flatter minimizer, which consistently correlates with lower test error [102]. ii) Convexity: As eigenvalues of the Hessian directly assess the convexity of a loss function [102], we compute both the maximum and minimum eigenvalues of the Hessian and map their ratios [102]. As shown in Fig. 3(b), a higher prevalence of near-zero negative eigenvalues (in deep blue) in VFPT suggests the presence of more convex regions $25.0\\%$ vs. $20.0\\%$ ) for model optimization. This finding indicates that the incorporation of the Fourier transform in visual prompt tuning effectively mitigates the sharpness of the loss landscape. ", "page_idx": 7}, {"type": "text", "text": "4.4 Study of Interpretability ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "To the best of our knowledge, research on the understanding of prompt tuning remains rare [9, 5]. Consequently, our research seeks to both quantitatively and qualitatively examine the impact of Fourier components on the enhancement of visual prompt tuning. For fairness, instead of using enhanced visualization methods [105, 106, 104] that may alter the original expression of the learnable prompts, we visualise and examine the raw average attention head on the last layer of VPT and VFPT. ", "page_idx": 7}, {"type": "text", "text": "Significant attention distribution in learnable prompts. Observations from both VPT and VFPT in Fig. 4(a) reveal a common phenomenon: there exists a pronounced accumulation of attention scores at learnable prompt locations (i.e., narrow color area on the left side of 2D attention map), indicating that these prompts have a substantial impact on the frozen embeddings during the finetuning stage. ", "page_idx": 7}, {"type": "text", "text": "Global attention scores pattern in Fourier prompts. We further observe a notably higher concentration in global attention scores when integrating visual Fourier prompts. Specifically, the global attention scores indicate that VFPT also establishes robust correlations within the Transformer’s input space [4] (see Fig. 4(a)). In contrast, VPT lacks this correlation, suggesting that it does not adequately consider or integrate ", "page_idx": 7}, {"type": "image", "img_path": "nkHEl4n0JU/tmp/bba8f3040301e8bedd8b79c35aeee2c5938b1bf0b9ae8bfcab59927522cb302d.jpg", "img_caption": ["Figure 4: Study of interpretability. (a) The 3D and 2D attention map in VPT and VFPT on a randomly selected sample. The colors , and indicate class, prompt and patch tokens, respectively. (b) Corresponding GradCAM [104] maps. Note that red regions correspond to a high score for the class. We present more visualization results in $\\S S4$ "], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "extensive information from the frozen backbone. Moreover, we find a positive relationship between strong associations and performance gains quantitatively (see $\\S4.2)$ and qualitatively (see Fig. 4(b)) in VFPT, suggesting that the integration of visual Fourier prompts encourage clear foreground (i.e., tree with high frequency component) - background (i.e., sky with low frequency component) separation. ", "page_idx": 7}, {"type": "text", "text": "Table 5: A set of ablative studies on VTAB-1k [78] Natural and Specialized benchmarks in three runs. “Prompt Location” is the placement of the visual Fourier prompts relative to original visual prompts. “Prompt Depth” indicates the layer we use visual Fourier prompts. “Transform Type” is the method we use to transform prompts and input images. “Fourier/Transform Dimension” indicates the dimension we apply using specific transform method. Per-task results are available in Appendix. Same for Table 4. ", "page_idx": 8}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/2ac51eae6050996b91378d32c676531388cb891181e5930711d8628dee328cf0.jpg", "table_caption": [], "table_footnote": ["(a) Fourier Prompt Dimension (b) Fourier Prompt Location (c) Fourier Prompt Depth "], "page_idx": 8}, {"type": "text", "text": "In summary, our findings provide significant insights into the interpretability of prompt tuning, revealing that for both VPT and VFPT, a considerable portion of attention is directed towards the learnable prompts. Further, VFPT exhibit enhanced global feature learning capabilities compared to VPT by interfacing effectively with frozen embeddings, thereby enabling precise capture of distinctive features across diverse downstream tasks. This observation corroborates our findings in $\\S4.2$ . ", "page_idx": 8}, {"type": "text", "text": "4.5 Ablation Study ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "We ablate VFPT’s key components on VTAB-1k [78] Natural and Specialized. More studies are provided in $\\S S2.5$ . ", "page_idx": 8}, {"type": "text", "text": "Transform Type. We ablate on other transform method instead to certify the impact of Fourier transform in Table 4, where the Fixed Linear Layer (i.e., FLL) and the Learnable Linear Layer (i.e., LLL) are con", "page_idx": 8}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/1df5cf277dbecdd217d1b8a3570a31052cd652a6da6307a2ec13f7a268abbbc6.jpg", "table_caption": ["Table 4: Ablative studies of transform type on VTAB1k [78] Natural and Specialized benchmarks in three runs. Per-task results are available in Appendix. "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "sidered. Compared with FFT, a fixed non-parameter Fourier domain transform in sequence and hidden dimension, the FLL operation considers only a fixed spatial domain transform in hidden dimension; the LLL further unfixes the transformation to enable gradient updates. As seen, both FLL and LLL show inferior performance to FFT. We further consider the impact of current Fourier domain adaption approach [71], which maps a source image to a target “style” without altering semantic content. However, no significant improvement can be observed. ", "page_idx": 8}, {"type": "text", "text": "Fourier Prompt Dimension. A fundamental distinction between VFPT and other methods is the incorporation of FFT into visual prompts. In our standard implementation, we utilize 2D FFTs across both sequence length and hidden dimensions. Here, we explore the impact of each dimension’s transformation individually. As shown in Table 5(a), the separate Fourier transformations along each dimension appear to have similar contributions (i.e., $80.88\\%$ vs. $80.74\\%$ in Natural). However, the combined application of transformations across both dimensions (i.e., 2D FFTs) demonstrates a synergistic effect, yielding significant improvement in performance. ", "page_idx": 8}, {"type": "text", "text": "Fourier Prompt Location. In Table 5(b), three prompt locations are considered for VFPT, which are “Prepend” $(i.e.,\\mathcal{P})$ , “Append” $(i.e.,A)$ , and “Random” $(i.e.,\\mathcal{R})$ . Specifically, $\\mathcal{P}$ and $\\boldsymbol{\\mathcal{A}}$ prepend visual Fourier prompts before or after visual prompts, and $\\mathcal{R}$ randomly selects the position for visual Fourier prompts in each layer. As seen, both $\\mathcal{P}$ and $\\boldsymbol{\\mathcal{A}}$ show competitive results, validating the robustness of VFPT $w.r t$ . prompt locations. In alignment with the findings in [5, 4], we choose $\\mathcal{P}$ as our baseline method in all experiments since it reaches superior results (i.e., $81.35\\%$ vs $81.02\\%$ in Natural). ", "page_idx": 8}, {"type": "text", "text": "Fourier Prompt Depth. Table 5(c) presents the performance of VFPT based on the specific layer at which visual Fourier prompts are employed. The results suggest that employment on separate layers also yields a accuracy improvement compared with VPT. Further application of visual Fourier prompts across all layers fosters the best overall performance. ", "page_idx": 8}, {"type": "text", "text": "5 Conclusion ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "We present Visual Fourier Prompt Tuning (VFPT), a simple yet powerful parameter-efficient visual prompt tuning approach that draws insights from human visual cognition. It has merits in: i) integrating spatial and frequency domain information through an intuitive yet effective design; ii) demonstrating generality across datasets with varying disparities while ensuring powerful performance; and iii) thoroughly investigating the associations between learnable prompts and frozen embeddings to elucidate this generality. As a whole, we conclude that the outcomes elucidated in this paper impart essential understandings and necessitate further exploration within this realm. ", "page_idx": 8}, {"type": "text", "text": "6 Acknowledgements ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "This research was supported by the National Science Foundation under Grant No. 2242243. ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "[1] William Thomson and Peter Guthrie Tait. Treatise on Natural Philosophy. Claredon Press, 1867.   \n[2] Brian Lester, Rami Al-Rfou, and Noah Constant. The power of scale for parameter-efficient prompt tuning. In EMNLP, 2021.   \n[3] Qifan Wang, Yuning Mao, Jingang Wang, Hanchao Yu, Shaoliang Nie, Sinong Wang, Fuli Feng, Lifu Huang, Xiaojun Quan, Zenglin Xu, and Dongfang Liu. Aprompt: Attention prompt tuning for efficient adaptation of pre-trained language models. In EMNLP, 2023.   \n[4] Menglin Jia, Luming Tang, Bor-Chun Chen, Claire Cardie, Serge Belongie, Bharath Hariharan, and Ser-Nam Lim. Visual prompt tuning. In ECCV, 2022.   \n[5] Cheng Han, Qifan Wang, Yiming Cui, Zhiwen Cao, Wenguan Wang, Siyuan Qi, and Dongfang Liu. E2vpt: An effective and efficient approach for visual prompt tuning. In ICCV, 2023.   \n[6] Wenhao Xu, Rongtao Xu, Changwei Wang, Shibiao Xu, Li Guo, Man Zhang, and Xiaopeng Zhang. Spectral prompt tuning: Unveiling unseen classes for zero-shot semantic segmentation. In AAAI, 2024.   \n[7] Muzhi Zhu, Hengtao Li, Hao Chen, Chengxiang Fan, Weian Mao, Chenchen Jing, Yifan Liu, and Chunhua Shen. Segprompt: Boosting open-world segmentation via category-level prompt learning. In ICCV, 2023.   \n[8] Xing Nie, Bolin Ni, Jianlong Chang, Gaofeng Meng, Chunlei Huo, Shiming Xiang, and Qi Tian. Pro-tuning: Unified prompt tuning for vision tasks. IEEE TCSVT, 2023.   \n[9] Cheng Han, Qifan Wang, Yiming Cui, Wenguan Wang, Lifu Huang, Siyuan Qi, and Dongfang Liu. Facing the elephant in the room: Visual prompt tuning or full finetuning? In ICLR, 2024.   \n[10] Arnav Chavan, Zhuang Liu, Deepak Gupta, Eric Xing, and Zhiqiang Shen. One-for-all: Generalized lora for parameter-efficient fine-tuning. arXiv preprint arXiv:2306.07967, 2023.   \n[11] Lin Zhao, Lu Zhang, Zihao Wu, Yuzhong Chen, Haixing Dai, Xiaowei Yu, Zhengliang Liu, Tuo Zhang, Xintao Hu, Xi Jiang, et al. When brain-inspired ai meets agi. Meta-Radiology, page 100005, 2023.   \n[12] Demis Hassabis, Dharshan Kumaran, Christopher Summerfield, and Matthew Botvinick. Neuroscience-inspired artificial intelligence. Neuron, 95(2):245–258, 2017.   \n[13] Hadi Salehi and Rigoberto Burgueño. Emerging artificial intelligence methods in structural engineering. Engineering Structures, 171:170–189, 2018.   \n[14] Ben Shneiderman. Human-centered AI. Oxford University Press, 2022.   \n[15] Aaron Quigley and Peter Eades. Fade: Graph drawing, clustering, and visual abstraction. In ISGD, 2000.   \n[16] Ivan Viola, Min Chen, and Tobias Isenberg. Visual abstraction. Foundations of Data Visualization, pages 15–37, 2020.   \n[17] Christopher P Burgess, Loic Matthey, Nicholas Watters, Rishabh Kabra, Irina Higgins, Matt Botvinick, and Alexander Lerchner. Monet: Unsupervised scene decomposition and representation. arXiv preprint arXiv:1901.11390, 2019.   \n[18] Ronald L Allen and Duncan Mills. Signal analysis: time, frequency, scale, and structure. John Wiley & Sons, 2004.   \n[19] VU Reddy. On fast fourier transform: a popular tool for spectrum analysis. Resonance, 3(10):79–88, 1998.   \n[20] Lu Chi, Borui Jiang, and Yadong Mu. Fast fourier convolution. In NeurIPS, 2020.   \n[21] Anurag Arnab, Mostafa Dehghani, Georg Heigold, Chen Sun, Mario Luˇci´c, and Cordelia Schmid. Vivit: A video vision transformer. In ICCV, 2021.   \n[22] Chun-Fu Richard Chen, Quanfu Fan, and Rameswar Panda. Crossvit: Cross-attention multiscale vision transformer for image classification. In ICCV, 2021.   \n[23] Alexey Dosovitskiy, Lucas Beyer, Alexander Kolesnikov, Dirk Weissenborn, Xiaohua Zhai, Thomas Unterthiner, Mostafa Dehghani, Matthias Minderer, Georg Heigold, Sylvain Gelly, et al. An image is worth 16x16 words: Transformers for image recognition at scale. In ICLR, 2021.   \n[24] Ze Liu, Yutong Lin, Yue Cao, Han Hu, Yixuan Wei, Zheng Zhang, Stephen Lin, and Baining Guo. Swin transformer: Hierarchical vision transformer using shifted windows. In ICCV, 2021.   \n[25] Wenhai Wang, Enze Xie, Xiang Li, Deng-Ping Fan, Kaitao Song, Ding Liang, Tong Lu, Ping Luo, and Ling Shao. Pyramid vision transformer: A versatile backbone for dense prediction without convolutions. In ICCV, 2021.   \n[26] Xinlei Chen, Saining Xie, and Kaiming He. An empirical study of training self-supervised vision transformers. In ICCV, 2021.   \n[27] Menglin Jia, Zuxuan Wu, Austin Reiter, Claire Cardie, Serge Belongie, and Ser-Nam Lim. Exploring visual engagement signals for representation learning. In ICCV, 2021.   \n[28] Dhruv Mahajan, Ross Girshick, Vignesh Ramanathan, Kaiming He, Manohar Paluri, Yixuan Li, Ashwin Bharambe, and Laurens Van Der Maaten. Exploring the limits of weakly supervised pretraining. In ECCV, 2018.   \n[29] Shibo Jie, Haoqing Wang, and Zhi-Hong Deng. Revisiting the parameter efficiency of adapters from the perspective of precision redundancy. In ICCV, 2023.   \n[30] Sylvestre-Alvise Rebuff,i Hakan Bilen, and Andrea Vedaldi. Learning multiple visual domains with residual adapters. In NeurIPS, 2017.   \n[31] Jeffrey O Zhang, Alexander Sax, Amir Zamir, Leonidas Guibas, and Jitendra Malik. Sidetuning: a baseline for network adaptation via additive side networks. In ECCV, 2020.   \n[32] Han Cai, Chuang Gan, Ligeng Zhu, and Song Han. Tinytl: Reduce memory, not parameters for efficient on-device learning. In NeurIPS, 2020.   \n[33] Xuehai He, Chunyuan Li, Pengchuan Zhang, Jianwei Yang, and Xin Eric Wang. Parameterefficient model adaptation for vision transformers. In AAAI, 2023.   \n[34] Shibo Jie and Zhi-Hong Deng. Fact: Factor-tuning for lightweight adaptation on vision transformer. In AAAI, 2023.   \n[35] Edward J Hu, Yelong Shen, Phillip Wallis, Zeyuan Allen-Zhu, Yuanzhi Li, Shean Wang, Lu Wang, and Weizhu Chen. Lora: Low-rank adaptation of large language models. arXiv preprint arXiv:2106.09685, 2021.   \n[36] Ziqi Gao, Qichao Wang, Aochuan Chen, Zijing Liu, Bingzhe Wu, Liang Chen, and Jia Li. Parameter-efficient fine-tuning with discrete fourier transform. In ICML, 2024.   \n[37] Chen Ju, Tengda Han, Kunhao Zheng, Ya Zhang, and Weidi Xie. Prompting visual-language models for efficient video understanding. In ECCV, 2022.   \n[38] Shaohua Dong, Yunhe Feng, Qing Yang, Yan Huang, Dongfang Liu, and Heng Fan. Efficient multimodal semantic segmentation via dual-prompt learning. arXiv preprint arXiv:2312.00360, 2023.   \n[39] Liqi Yan, Cheng Han, Zenglin Xu, Dongfang Liu, and Qifan Wang. Prompt learns prompt: exploring knowledge-aware generative prompt collaboration for video captioning. In IJCAI, 2023.   \n[40] Yuhang Zang, Wei Li, Kaiyang Zhou, Chen Huang, and Chen Change Loy. Unified vision and language prompt learning. arXiv preprint arXiv:2210.07225, 2022.   \n[41] Taowen Wang, Yiyang Liu, James Chenhao Liang, Yiming Cui, Yuning Mao, Shaoliang Nie, Jiahao Liu, Fuli Feng, Zenglin Xu, Cheng Han, et al. Mmpt: Multimodal prompt tuning for zero-shot instruction learning. In EMNLP, 2024.   \n[42] Fang Ma, Chen Zhang, Lei Ren, Jingang Wang, Qifan Wang, Wei Wu, Xiaojun Quan, and Dawei Song. Xprompt: Exploring the extreme of prompt tuning. In EMNLP, 2022.   \n[43] Yun He, Steven Zheng, Yi Tay, Jai Gupta, Yu Du, Vamsi Aribandi, Zhe Zhao, YaGuang Li, Zhao Chen, Donald Metzler, et al. Hyperprompt: Prompt-based task-conditioning of transformers. In ICML, 2022.   \n[44] Pengfei Liu, Weizhe Yuan, Jinlan Fu, Zhengbao Jiang, Hiroaki Hayashi, and Graham Neubig. Pre-train, prompt, and predict: A systematic survey of prompting methods in natural language processing. ACM Computing Surveys, 55(9):1–35, 2023.   \n[45] Xipeng Qiu, Tianxiang Sun, Yige Xu, Yunfan Shao, Ning Dai, and Xuanjing Huang. Pretrained models for natural language processing: A survey. Science China Technological Sciences, 63(10):1872–1897, 2020.   \n[46] Hantao Yao, Rui Zhang, and Changsheng Xu. Visual-language prompt tuning with knowledgeguided context optimization. In CVPR, 2023.   \n[47] Kihyuk Sohn, Huiwen Chang, José Lezama, Luisa Polania, Han Zhang, Yuan Hao, Irfan Essa, and Lu Jiang. Visual prompt tuning for generative transfer learning. In CVPR, 2023.   \n[48] Yuan Yao, Ao Zhang, Zhengyan Zhang, Zhiyuan Liu, Tat-Seng Chua, and Maosong Sun. Cpt: Colorful prompt tuning for pre-trained vision-language models. AI Open, 5:30–38, 2024.   \n[49] Haotian Liu, Chunyuan Li, Qingyang Wu, and Yong Jae Lee. Visual instruction tuning. In NeurIPS, 2024.   \n[50] Henri J Nussbaumer and Henri J Nussbaumer. The fast Fourier transform. Springer, 1982.   \n[51] Luis B Almeida. The fractional fourier transform and time-frequency representations. IEEE TSP, 1994.   \n[52] Isa Servan Uzun, Abbes Amira, and Ahmed Bouridane. Fpga implementations of fast fourier transforms for real-time signal and image processing. IEE Proceedings-Vision, Image and Signal Processing, 152(3):283–296, 2005.   \n[53] Todd A Ell and Stephen J Sangwine. Hypercomplex fourier transforms of color images. IEEE TIP, 2006.   \n[54] Pierre Duhamel and Martin Vetterli. Fast fourier transforms: a tutorial review and a state of the art. Signal Processing, 1990.   \n[55] David Brandwood. Fourier transforms in radar and signal processing. Artech House, 2012.   \n[56] M Sifuzzaman, M Rafiq Islam, and Mostafa Z Ali. Application of wavelet transform and its advantages compared to Fourier transform. Vidyasagar University, Midnapore, West-Bengal, India, 2009.   \n[57] Jia Xu, Ji Yu, Ying-Ning Peng, and Xiang-Gen Xia. Radon-fourier transform for radar target detection, i: Generalized doppler filter bank. IEEE TAES, 2011.   \n[58] Tim OF Conrad, Martin Genzel, Nada Cvetkovic, Niklas Wulkow, Alexander Leichtle, Jan Vybiral, Gitta Kutyniok, and Christof Schütte. Sparse proteomics analysis–a compressed sensing-based approach for feature selection and classification of high-dimensional proteomics mass spectrometry data. BMC Bioinformatics, 18:1–20, 2017.   \n[59] Niklas Mevenkamp and Benjamin Berkels. Variational multi-phase segmentation using highdimensional local features. In WACV, 2016.   \n[60] A Oppenheim, Jae Lim, Gary Kopec, and SC Pohlig. Phase in speech and pictures. In ICASSP, 1979.   \n[61] Alan V Oppenheim and Jae S Lim. The importance of phase in signals. Proceedings of the IEEE, 69(5):529–541, 1981.   \n[62] Leon N Piotrowski and Fergus W Campbell. A demonstration of the visual importance and flexibility of spatial-frequency amplitude and phase. Perception, 11(3):337–346, 1982.   \n[63] Bruce C Hansen and Robert F Hess. Structural sparseness and spatial phase alignment in natural scenes. JOSA A, 24(7):1873–1885, 2007.   \n[64] Nikunj Raghuvanshi, Rahul Narain, and Ming C Lin. Efficient and accurate sound propagation using adaptive rectangular decomposition. IEEE TVCG, 15(5):789–801, 2009.   \n[65] Tim-Oliver Buchholz and Florian Jug. Fourier image transformer. In CVPR, 2022.   \n[66] Tan Nguyen, Minh Pham, Tam Nguyen, Khai Nguyen, Stanley Osher, and Nhat Ho. Fourierformer: Transformer meets generalized fourier integral theorem. In NeurIPS, 2022.   \n[67] Dario Fuoli, Luc Van Gool, and Radu Timofte. Fourier space losses for efficient perceptual image super-resolution. In ICCV, 2021.   \n[68] B Hinman, Jared Bernstein, and D Staelin. Short-space fourier transform image processing. In ICASSP, 1984.   \n[69] Normand Beaudoin and Steven S Beauchemin. An accurate discrete fourier transform for image processing. In ICPR, 2002.   \n[70] Rama Chellappa and R Bagdazian. Fourier coding of image boundaries. IEEE TPAMI, (1):102–105, 1984.   \n[71] Yanchao Yang and Stefano Soatto. Fda: Fourier domain adaptation for semantic segmentation. In CVPR, 2020.   \n[72] Qinwei Xu, Ruipeng Zhang, Ya Zhang, Yanfeng Wang, and Qi Tian. A fourier-based framework for domain generalization. In CVPR, 2021.   \n[73] Harry Pratt, Bryan Williams, Frans Coenen, and Yalin Zheng. Fcnn: Fourier convolutional neural networks. In ECML PKDD, 2017.   \n[74] Tianyi Chu, Jiafu Chen, Jiakai Sun, Shuobin Lian, Zhizhong Wang, Zhiwen Zuo, Lei Zhao, Wei Xing, and Dongming Lu. Rethinking fast fourier convolution in image inpainting. In ICCV, 2023.   \n[75] Yongming Rao, Wenliang Zhao, Zheng Zhu, Jiwen Lu, and Jie Zhou. Global filter networks for image classification. In NeurIPS, 2021.   \n[76] John Guibas, Morteza Mardani, Zongyi Li, Andrew Tao, Anima Anandkumar, and Bryan Catanzaro. Adaptive fourier neural operators: Efficient token mixers for transformers. arXiv preprint arXiv:2111.13587, 2021.   \n[77] Ruiping Liu, Jiaming Zhang, Kunyu Peng, Yufan Chen, Ke Cao, Junwei Zheng, M Saquib Sarfraz, Kailun Yang, and Rainer Stiefelhagen. Fourier prompt tuning for modality-incomplete scene segmentation. arXiv preprint arXiv:2401.16923, 2024.   \n[78] Xiaohua Zhai, Joan Puigcerver, Alexander Kolesnikov, Pierre Ruyssen, Carlos Riquelme, Mario Lucic, Josip Djolonga, Andre Susano Pinto, Maxim Neumann, Alexey Dosovitskiy, et al. A large-scale study of representation learning with the visual task adaptation benchmark. arXiv preprint arXiv:1910.04867, 2019.   \n[79] James W Cooley and John W Tukey. An algorithm for the machine calculation of complex fourier series. Mathematics of Computation, 19(90):297–301, 1965.   \n[80] James Lee-Thorp, Joshua Ainslie, Ilya Eckstein, and Santiago Ontanon. Fnet: Mixing tokens with fourier transforms. arXiv preprint arXiv:2105.03824, 2021.   \n[81] Wenjie Pei, Tongqi Xia, Fanglin Chen, Jinsong Li, Jiandong Tian, and Guangming Lu. $\\mathrm{Sa^{2}v p}$ : Spatially aligned-and-adapted visual prompt. In AAAI, 2024.   \n[82] Chongyi Li, Chun-Le Guo, Man Zhou, Zhexin Liang, Shangchen Zhou, Ruicheng Feng, and Chen Change Loy. Embedding fourier for ultra-high-definition low-light image enhancement. arXiv preprint arXiv:2302.11831, 2023.   \n[83] Kai Han, Yunhe Wang, Hanting Chen, Xinghao Chen, Jianyuan Guo, Zhenhua Liu, Yehui Tang, An Xiao, Chunjing Xu, Yixing Xu, et al. A survey on vision transformer. IEEE TPAMI, 2022.   \n[84] Jia Deng, Wei Dong, Richard Socher, Li-Jia Li, Kai Li, and Li Fei-Fei. Imagenet: A large-scale hierarchical image database. In CVPR, 2009.   \n[85] Catherine Wah, Steve Branson, Peter Welinder, Pietro Perona, and Serge Belongie. The caltech-ucsd birds-200-2011 dataset. California Institute of Technology, 2011.   \n[86] Grant Van Horn, Steve Branson, Ryan Farrell, Scott Haber, Jessie Barry, Panos Ipeirotis, Pietro Perona, and Serge Belongie. Building a bird recognition app and large scale dataset with citizen scientists: The fine print in fine-grained dataset collection. In CVPR, 2015.   \n[87] Maria-Elena Nilsback and Andrew Zisserman. Automated flower classification over a large number of classes. In ICVGIP, 2008.   \n[88] Aditya Khosla, Nityananda Jayadevaprakash, Bangpeng Yao, and Fei-Fei Li. Novel dataset for fine-grained image categorization: Stanford dogs. In CVPR Workshop, 2011.   \n[89] Timnit Gebru, Jonathan Krause, Yilun Wang, Duyun Chen, Jia Deng, and Li Fei-Fei. Finegrained car detection for visual census estimation. In AAAI, 2017.   \n[90] Kaiming He, Xinlei Chen, Saining Xie, Yanghao Li, Piotr Dollár, and Ross Girshick. Masked autoencoders are scalable vision learners. In CVPR, 2022.   \n[91] Adam Paszke, Sam Gross, Francisco Massa, Adam Lerer, James Bradbury, Gregory Chanan, Trevor Killeen, Zeming Lin, Natalia Gimelshein, Luca Antiga, Alban Desmaison, Andreas Kopf, Edward Yang, Zachary DeVito, Martin Raison, Alykhan Tejani, Sasank Chilamkurthy, Benoit Steiner, Lu Fang, Junjie Bai, and Soumith Chintala. Pytorch: An imperative style, high-performance deep learning library. In NeurIPS, 2019.   \n[92] Eugenia Iofinova, Alexandra Peste, Mark Kurtz, and Dan Alistarh. How well do sparse imagenet models transfer? In CVPR, 2022.   \n[93] Jason Yosinski, Jeff Clune, Yoshua Bengio, and Hod Lipson. How transferable are features in deep neural networks? In NeurIPS, 2014.   \n[94] Xinlei Chen, Haoqi Fan, Ross Girshick, and Kaiming He. Improved baselines with momentum contrastive learning. In CVPR, 2020.   \n[95] Shoufa Chen, Chongjian Ge, Zhan Tong, Jiangliu Wang, Yibing Song, Jue Wang, and Ping Luo. Adaptformer: Adapting vision transformers for scalable visual recognition. In NeurIPS, 2022.   \n[96] Wei Dong, Dawei Yan, Zhijun Lin, and Peng Wang. Efficient adaptation of large vision transformer via adapter re-composing. In NeurIPS, 2024.   \n[97] Rajshekhar Das, Yonatan Dukler, Avinash Ravichandran, and Ashwin Swaminathan. Learning expressive prompting with residuals for vision transformers. In CVPR, 2023.   \n[98] Yi Ren, Shangmin Guo, Wonho Bae, and Danica J Sutherland. How to prepare your task head for finetuning. In ICLR, 2023.   \n[99] Min Jin Chong and David Forsyth. Effectively unbiased fid and inception score and where to find them. In CVPR, 2020.   \n[100] Tuomas Kynkäänniemi, Tero Karras, Miika Aittala, Timo Aila, and Jaakko Lehtinen. The role of imagenet classes in fr\\’echet inception distance. In ICLR, 2023.   \n[101] Seungryong Yoo, Eunji Kim, Dahuin Jung, Jungbeom Lee, and Sungroh Yoon. Improving visual prompt tuning for self-supervised vision transformers. In ICML, 2023.   \n[102] Hao Li, Zheng Xu, Gavin Taylor, Christoph Studer, and Tom Goldstein. Visualizing the loss landscape of neural nets. In NeurIPS, 2018.   \n[103] Sepp Hochreiter and Jürgen Schmidhuber. Flat minima. Neural Computation, 9(1):1–42, 1997.   \n[104] Ramprasaath R Selvaraju, Michael Cogswell, Abhishek Das, Ramakrishna Vedantam, Devi Parikh, and Dhruv Batra. Grad-cam: Visual explanations from deep networks via gradientbased localization. In ICCV, 2017.   \n[105] Samira Abnar and Willem Zuidema. Quantifying attention flow in transformers. arXiv preprint arXiv:2005.00928, 2020.   \n[106] Cheonbok Park, Inyoup Na, Yongjang Jo, Sungbok Shin, Jaehyo Yoo, Bum Chul Kwon, Jian Zhao, Hyungjong Noh, Yeonsoo Lee, and Jaegul Choo. Sanvis: Visual analytics for understanding self-attention networks. In IEEE VIS, 2019.   \n[107] Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. Bert: Pre-training of deep bidirectional transformers for language understanding. In NAACL, 2018.   \n[108] Xiao Liu, Kaixuan Ji, Yicheng Fu, Zhengxiao Du, Zhilin Yang, and Jie Tang. P-tuning v2: Prompt tuning can be comparable to fine-tuning universally across scales and tasks. arXiv preprint arXiv:2110.07602, 2021.   \n[109] Alex Wang, Yada Pruksachatkun, Nikita Nangia, Amanpreet Singh, Julian Michael, Felix Hill, Omer Levy, and Samuel Bowman. Superglue: A stickier benchmark for general-purpose language understanding systems. In NeurIPS, 2019. ", "page_idx": 9}, {"type": "text", "text": "", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "", "page_idx": 13}, {"type": "text", "text": "", "page_idx": 14}, {"type": "text", "text": "SUMMARY OF THE APPENDIX ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "This appendix contains additional experimental results and discussions of our NeurIPS 2024 submission: Visual Fourier Prompt Tuning, organized as follows: ", "page_idx": 15}, {"type": "text", "text": "• $\\S S1$ provides per-task results on VTAB-1k and FGVC image classification benchmarks with confidence analysis, where the overall results have been provided in the main paper.   \n• $\\S S2$ provides per-task results on ablation study, where the overall results have been provided in the main paper. Further study of sensitivity of Fourier prompt percentages and prompt lengths is included in $\\S S2.5$ .   \n• $\\S S3$ provides per-task results on Fourier percentage, where partial results have been provided in the main paper.   \n• $\\S S4$ presents more details and results of visualization of attention maps.   \n• $\\S S4$ presents more details and results of visualization of loss landscapes.   \n• $\\S S6$ discusses our potential extension to language tasks.   \n• $\\S S7$ further analyze the complexity of our approach.   \n• $\\S S8$ shows related asset license and consent to our work.   \n• $\\S S9$ claims reproducibility of our approach.   \n• $\\S S10$ discusses the social impact of our research.   \n• $\\S S11$ adds more discussions, and points out potential directions of our future work. ", "page_idx": 15}, {"type": "text", "text": "S1 Per-task Results on VTAB-1k and FGVC ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "S1.1 Per-task Results on ViT-Base ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "To provide comprehensive results from the paper, we report the average per-task test accuracy (i.e., 3 runs, 24 tasks) on VTAB-1k [78] Natural, Specialized and Structured, respectively (see Table S1, S2 and S3). We also report per-task FGVC [4] results (5 tasks) in Table S4. VPT-SHALLOW [4] is also included for completeness (i.e., VPT-SHALLOW only introduces 1-st layer visual prompts). In conclusion, VFPT shows consistently better performance in various downstream tasks. ", "page_idx": 15}, {"type": "text", "text": "Table S1: VTAB-1k [78] Natural per-task results for ViT-Base/16 [23] pretrained on supervised ImageNet-21k. Consistent to our paper, “Number of Wins” in [·] compared to full fine-tuning [92]. “Tuned/Total” is the percentage of tuned parameters in each task, along with the average results of those percentages in each group. The highest accuracy among all approaches except FULL are shown in bold. $\\dagger$ denotes method using soft flitered prompts to reduce the parameter usage in learnable visual prompts, requiring specialized devices to facilitate acceleration. All results are averaged in three runs with different initialization seeds. Same for Table S2-S21. We also report standard deviation error bars for our main results (Table S1, S2, S3 and S4) by calculating each task respectively and averaging across them. Other tables show similar trends on standard deviation error bars. ", "page_idx": 15}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/7c994828b78e477f1fdc6c875edd173b25b1972c5d8ac823c6a8bb1c2111f315.jpg", "table_caption": [], "table_footnote": [], "page_idx": 15}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/bb7b327f78a57ee6d4eae9959f2d7ffd579221256ce4be05bf1d62fb6bbf482b.jpg", "table_caption": ["Table S2: VTAB-1k [78] Specialized per-task results for ViT-Base/16 [23] pretrained on supervised ImageNet-21k. "], "table_footnote": [], "page_idx": 16}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/f333d7901bab35ab61ef18a1d5b1c5f4bb1c3cf312dfe23c1517e02253d3c8e9.jpg", "table_caption": ["Table S3: VTAB-1k [78] Structured per-task results for ViT-Base/16 [23] pretrained on supervised ImageNet-21k. "], "table_footnote": [], "page_idx": 16}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/ff54f9f6356dfe15cf06ddeb99ce592c5eed5f9823f51c6b83bf6f2a928fe67d.jpg", "table_caption": ["Table S4: FGVC [4] per-task results for ViT-Base/16 [23] pretrained on supervised ImageNet-21k. "], "table_footnote": [], "page_idx": 16}, {"type": "text", "text": "S1.2 Per-task Results on Swin-Base ", "text_level": 1, "page_idx": 17}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/71c4f4337a835cddb4c73bc8dbe4345b85076cd9cd0f4c4e132c7d60937660f0.jpg", "table_caption": ["Table S5: VTAB-1k [78] Natural per-task results for Swin-Base [24] pretrained on supervised ImageNet-21k. Specially, the highest accuracy is shown in bold. Same for Table S6 and S7 "], "table_footnote": [], "page_idx": 17}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/23b7b5f6f2d8d386749c56fdf3572e0a53129020048535a59662a0a8bfaf480b.jpg", "table_caption": ["Table S6: VTAB-1k [78] Specialized per-task results for Swin-Base [24] pretrained on supervised ImageNet-21k. "], "table_footnote": [], "page_idx": 17}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/e0f90d9863e8ae526977787eda2b2f0f1361e96e7fa0e410ac9a9b4836219679.jpg", "table_caption": ["Table S7: VTAB-1k [78] Structured per-task results for Swin-Base [24] pretrained on supervised ImageNet-21k. "], "table_footnote": [], "page_idx": 17}, {"type": "text", "text": "S1.3 Per-task Results on MAE and MoCo v3 ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Table S8: VTAB-1k [78] Natural per-task results for ViT-Base/16 [23] pretrained on MAE [90]. Since VPT [4] have considerably lower performance, we do not list the per-task results for simplicity. We instead compare our method to full fine-tuning, and the highest accuracy is shown in bold. We post the “Number of Wins” in $[\\cdot]$ to full fine-tuning (FULL) [92]. Same for Table S9-S13. ", "page_idx": 17}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/8418207273a72d4476203635b8d255b590589d5edd1ad9f3f54b12612a191b45.jpg", "table_caption": [], "table_footnote": [], "page_idx": 17}, {"type": "text", "text": "Table S9: VTAB-1k [78] Specialized per-task results for ViT-Base/16 [23] pretrained on MAE [90]. ", "text_level": 1, "page_idx": 18}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/2943a94b1495ceb300b7b1b9838e80faf0adcd2e32c033c5984b3d6cc5bf1d92.jpg", "table_caption": [], "table_footnote": [], "page_idx": 18}, {"type": "text", "text": "Table S10: VTAB-1k [78] Strcutured per-task results for ViT-Base/16 [23] pretrained on MAE [90]. ", "text_level": 1, "page_idx": 18}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/3e7a26ec5c792f496dee0f4805ada457443ef9462d30601fb5d8d25ed097ebb3.jpg", "table_caption": [], "table_footnote": [], "page_idx": 18}, {"type": "text", "text": "Table S11: VTAB-1k [78] Natural per-task results for ViT-Base/16 [23] pretrained on MOCO [26]. ", "text_level": 1, "page_idx": 18}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/c5d5b70676e7fa5493d87e69ff576d2e446c99e9a7fed36a80a68c94bf4064b5.jpg", "table_caption": [], "table_footnote": [], "page_idx": 18}, {"type": "text", "text": "Table S12: VTAB-1k [78] Specialized per-task results for ViT-Base/16 [23] pretrained on MOCO [26]. ", "page_idx": 18}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/15db471b6e2e15c1482c9db32e542b3f731718bc3901dcc89c9efa951f225679.jpg", "table_caption": [], "table_footnote": [], "page_idx": 18}, {"type": "text", "text": "Table S13: VTAB-1k [78] Structured per-task results for ViT-Base/16 [23] pretrained on MOCO [26]. ", "page_idx": 18}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/9830707be4e8e4dd17751e3a14ec8f5057d835693cc9fce23a412713772939b4.jpg", "table_caption": [], "table_footnote": [], "page_idx": 18}, {"type": "text", "text": "S2 Per-task Results on Ablation Study ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "S2.1 Per-task Results of Transform Type on VTAB-1k Natural and Specialized ", "page_idx": 19}, {"type": "text", "text": "Table S14: Transform type per-task results on VTAB-1k [78] Natural for ViT-Base/16 [23] pretrained on supervised ImageNet-21k. ", "page_idx": 19}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/f6bbbf51afb379d4bf434ee7b8641e9319643c9b3fb35a0f881e3dda4e92b560.jpg", "table_caption": [], "table_footnote": [], "page_idx": 19}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/aff76652e1c191a95cc24549c4f39b9b90768e98f408d69ffa0fa6818803618f.jpg", "table_caption": ["Table S15: Transform type per-task results on VTAB-1k [78] Specialized for ViT-Base/16 [23] pretrained on supervised ImageNet-21k. "], "table_footnote": [], "page_idx": 19}, {"type": "text", "text": "S2.2 Per-task Results of Fourier Prompt Depth on VTAB-1k Natural and Specialized ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Table S16: Fourier prompt depth per-task results on VTAB-1k [78] Natural for ViT-Base/16 [23] pretrained on supervised ImageNet-21k. ", "page_idx": 19}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/030a27cea5d13395560c27295c658cf0ebe2d4a38238e3442a0d8d825f463d02.jpg", "table_caption": [], "table_footnote": [], "page_idx": 19}, {"type": "text", "text": "Table S17: Fourier prompt depth per-task results on VTAB-1k [78] Specialized for ViTBase/16 [23] pretrained on supervised ImageNet-21k. ", "page_idx": 20}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/a9a339e8f40cfde2209ff1a473d650d1814012c675e84f88ded496970fbe64c4.jpg", "table_caption": [], "table_footnote": [], "page_idx": 20}, {"type": "text", "text": "S2.3 Per-task Results of Fourier Prompt Location on VTAB-1k Natural and Specialized ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Table S18: Fourier prompt location per-task results on VTAB-1k [78] Natural for ViTBase/16 [23] pretrained on supervised ImageNet-21k. ", "page_idx": 20}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/0014f54302f99221ad213de05132295d809e0fce3ec7d830253800a22cd8ec38.jpg", "table_caption": [], "table_footnote": [], "page_idx": 20}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/e99671e9f975eee69fdad39f5ab8c18f80bbf284f468d505b9109b0709536ff0.jpg", "table_caption": ["Table S19: Fourier prompt location per-task results on VTAB-1k [78] Specialized for ViTBase/16 [23] pretrained on supervised ImageNet-21k. "], "table_footnote": [], "page_idx": 20}, {"type": "text", "text": "Table S20: Fourier prompt dimension per-task results on VTAB-1k [78] Natural for ViTBase/16 [23] pretrained on supervised ImageNet-21k. ", "page_idx": 21}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/d84ad9ad9a7b20ac01fe9a4054360bddad45b45f1ed798c3b05111c438f87ceb.jpg", "table_caption": ["S2.4 Per-task Results of Fourier Prompt Dimension on VTAB-1k Natural and Specialized "], "table_footnote": [], "page_idx": 21}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/1c4f72ee8531ed3ecd6e7f9aa2ae7496a4426b30ad72644feb571f84879cb41b.jpg", "table_caption": ["Table S21: Fourier prompt dimension per-task results on VTAB-1k [78] Specialized for ViTBase/16 [23] pretrained on supervised ImageNet-21k. "], "table_footnote": [], "page_idx": 21}, {"type": "image", "img_path": "nkHEl4n0JU/tmp/921adc2355b76ad488cb278241ac4870f20249f280ae946ddc1b205fa47d4d0e.jpg", "img_caption": ["S2.5 Sensitivity of Fourier Prompt Percentages and Prompt Lengths ", "Figure S1: Sensitivity of visual Fourier prompt percentages and its prompt lengths on VTAB-1k [78] DTD. "], "img_footnote": [], "page_idx": 21}, {"type": "text", "text": "S3 Per-task Results on Fourier Percentage ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Table S22: Fourier percentage per-task results on VTAB-1k [78] Natural for ViT-Base/16 [23] pretrained on supervised ImageNet-21k. The highest accuracy among all Fourier percentages are shown in bold.Same for Table S23 and S24 ", "page_idx": 22}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/ecfea382d1136cc328be761d526972f4e29d75a89e376d2cd93343911f57de27.jpg", "table_caption": [], "table_footnote": [], "page_idx": 22}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/222552385d5f05e3e4e9da0ccbc9e70e2d54a3114e38b8071f9ba28d6b0270c9.jpg", "table_caption": ["Table S23: Fourier percentage per-task results on VTAB-1k [78] Specialized for ViT-Base/16 [23] pretrained on supervised ImageNet-21k. "], "table_footnote": [], "page_idx": 22}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/171873c8fe5956499224225a22df95a6adb204dbe71b99491a74adf90ddc85c0.jpg", "table_caption": ["Table S24: Fourier percentage per-task results on VTAB-1k [78] Structured for ViT-Base/16 [23] pretrained on supervised ImageNet-21k. "], "table_footnote": [], "page_idx": 22}, {"type": "image", "img_path": "nkHEl4n0JU/tmp/da2a771fa159875cb025fdbcdb4ab1f0d18b5017cc8517bccc95875550f0c350.jpg", "img_caption": ["S4 Visualization of Attention Map ", "Figure S2: (a) More visualization results of 2D attention map on VTAB-1K [78] (b) Corresponding 3D attention maps. Figures are best viewed by zooming in. (c) More visual inspection of VPT and VFPT using GradCAM [104]. Consistent to our paper, the red regions correspond to high score for class. From left to right are input image after standard data augmentation, GradCAM results for VPT and GradCAM results for VFPT. Figure best viewed in color. "], "img_footnote": [], "page_idx": 23}, {"type": "text", "text": "In this section, we present more details and results of visualization of attention maps to support our findings in $\\S4.4$ . All samples selected from VTAB-1k [78] have the same prompt length (i.e., 10 prompts) with one class token and 196 input patches. ", "page_idx": 23}, {"type": "text", "text": "In Fig.S2(a), we can first observe a significant attention distribution in learnable prompts and then a notably higher concentration in global attention scores when integrating visual Fourier prompts, showing consistency with our paper. ", "page_idx": 23}, {"type": "text", "text": "In Fig.S2(b), we present more visualization inspection results for VPT and VFPT using GradCAM [104]. Overall, we present additional visual evidence to support the notion that the integration of visual Fourier prompts encourage clear foreground-background separation. ", "page_idx": 23}, {"type": "image", "img_path": "nkHEl4n0JU/tmp/192d052fc4738573a38dd285c39305fab9116d1fc5cb157008fc148b6ed5cf4e.jpg", "img_caption": ["S5 Visualization of Loss Landscape ", "Figure S3: Loss landscape on VTAB-1k [78] Natural. "], "img_footnote": [], "page_idx": 24}, {"type": "image", "img_path": "nkHEl4n0JU/tmp/728499014c28ff7f9629cc27e6ab50ec299952b8781116d37a925aff15bbf8bb.jpg", "img_caption": ["Figure S4: Loss landscape on VTAB-1k [78] Specialized. "], "img_footnote": [], "page_idx": 24}, {"type": "image", "img_path": "nkHEl4n0JU/tmp/5579d60d558163bedb54ca348e187a41491e3f250289ad14213bc6c4218ecbce.jpg", "img_caption": ["Figure S5: Loss landscape on VTAB-1k [78] Structured. "], "img_footnote": [], "page_idx": 24}, {"type": "text", "text": "S6 Extension to Language Tasks ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "While ViT-Base/16 [23] is structurally similar to BERT [107], we follow [5, 108] and naturally test the efficiency of the VFPT on natural language understanding (NLU) tasks. Specifically, we include BERT-Large [107] for evaluation, and compare full fine-tuning (FULL) [2], Prompt Tuning [2], P-Tuning v2 [108] and $\\mathrm{E^{2}V P T}$ [5] on SuperGlue [107] dataset: a collection of text classification tasks to test the general language understanding ability. The tasks include natural language inference (RTE and CB), coreference resolution (WSC), sentence completion (COPA), word sense disambiguation (WiC), and question answering (MultiRC (Fla), ReCoRD (F1) and BoolQ). In Table S25, we show that VFPT outperforms FULL and Prompt Tuning and show competitive results to P-Tuning v2 [108]. Considering VFPT is designed for visual-related tasks, and text understanding tasks might not need fruitful frequency domain information, these results are impressive and suggest future work for a general solution across modalities under the pretrain-then-finetune paradigm. ", "page_idx": 25}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/955b34ff471873329adf2a1e7aadceef29eec90a4c64a48356f6e039ccfb33bc.jpg", "table_caption": ["Table S25: Per-task results for SuperGLUE development set [109] with a pretrained BERTLarge [107]. See $\\S S6$ . "], "table_footnote": [], "page_idx": 25}, {"type": "text", "text": "S7 Extension of Complexity Analysis ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Table S26: Complexity analysis of fourier percentage settings on CIFAR-100 benchmark. The percentages in the results indicate the rate of improvement compared to VPT. ", "page_idx": 25}, {"type": "table", "img_path": "nkHEl4n0JU/tmp/2581a72b25c040ac6311d449e3a333022f70c0b996ac044a52570ca87ea0ac6e.jpg", "table_caption": [], "table_footnote": [], "page_idx": 25}, {"type": "text", "text": "We have provided a detailed comparison of our computational results in this section. More specifically, we experimented with different Fourier percentage settings (i.e.., the alpha rate) on the CIFAR-100 benchmark and reported their maximum memory consumption, average training batch time, and average inference batch time. All settings were tested with the same batch size and prompt length. The experiments were conducted on NVIDIA A100-40GB GPUs. ", "page_idx": 25}, {"type": "text", "text": "As illustrated in Table S26, no significant increase in maximum memory consumption at the MB level is observed across different Fourier percentage settings. However, we do observe a slight increase in average batch time during both training and inference, on the order of $10^{-3}$ and $10^{-\\overline{{4}}}$ , respectively. This suggests that a lower Fourier percentage incurs a higher computational burden. This effect is likely attributable to suboptimal parallel acceleration and the implementation inefficiencies associated with prompts that have partial Fourier transformation. We will investigate this further in future research. ", "page_idx": 25}, {"type": "text", "text": "S8 Asset License and Consent ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "The majority of VPT [4] is licensed under CC-BY-NC 4.0. Portions of [4] are available under separate licenses: google-research/task_adaptation and huggingface/transformers are licensed under Apache-2.0; Swin-Transformer [24] and ViT-pytorch [23] are licensed under MIT; and MoCo-v3 [26] and MAE [90] are licensed under CC BY 4.0. ", "page_idx": 25}, {"type": "text", "text": "All the datasets included in our study are publicly available (VTAB-1K, FGVC), and all the models are publicly available. We would like to state that the contents in the dataset do NOT represent our views or opinions. ", "page_idx": 25}, {"type": "text", "text": "S9 Reproducibility ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "VFPT is implemented in Pytorch [91]. Experiments are conducted on NVIDIA A100-40GB GPUs. To guarantee reproducibility, our full implementation shall be publicly released upon paper acceptance. For training schedule, the superior low-complexity of FFT (i.e., $O(n\\log n),$ ) allows for efficient training of visual Fourier prompts with only a slight decrease in training speed (i.e., $2.8\\%$ on VTAB-1k [78] compared to VPT). ", "page_idx": 26}, {"type": "text", "text": "S10 Social Impact and Limitations ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "This study presents VFPT, demonstrating significant and generalizable performance enhancements over state-of-the-art baselines across two benchmarks. The incorporation of the FFT contributes these advantages without necessitating architecture-specific designs or incurring substantial computational overhead under pretrain-then-finetune paradigm for large-scale models (see $\\S3$ ). Our approach enjoys advanced model accuracy, and is valuable in real-world computational-sensitive applications, e.g., training machine learning models on edge devices. Moreover, VFPT advances significantly towards achieving generality across datasets, demonstrating substantial performance improvements even when faced with large dataset disparities (see $\\S4_{.}$ ). This progress is crucial for the continuous development of PEFT across a wider spectrum of applications. ", "page_idx": 26}, {"type": "text", "text": "For potential limitations, drawing inspirations from human visual cognition, our method incorporates spatial and frequency information, which brings an additional hyper-parameter — Fourier percentage (i.e., $\\alpha$ in $\\S3.2)$ . However, in practical applications, we observe in $\\S4.2$ that dataset disparity (i.e., low disparity tasks prefer small $\\alpha$ value, and vice versa) serves as a guideline for selecting an appropriate Fourier percentage. Nonetheless, we argue that the implementation of an automatic Fourier percentage search can further augment efficiency. ", "page_idx": 26}, {"type": "text", "text": "S11 Discussion and Future Work ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "In $\\S2$ , we review PEFT methods and the application of the fast Fourier transform in vision. Notably, a recent study [36] in NLP incorporates Fourier transform as a viable PEFT approach, which warrants discussion. Specifically, it learns a set of spectral coefficients of Fourier basis using a LoRA-based approach and then applies the inverse discrete Fourier transform to the spectral matrix, yielding its spatial-domain counterpart as the updated weight change. Although the Fourier basis’s orthogonal and expressive advantages reduce the need for extensive parameter fine-tuning, the inverse transform applied to the spectral matrix discards frequency information, ultimately considering only traditional spatial domain features. The parameter-efficient use of the Fourier transform in this study is orthogonal to our method, where both spatial and frequency domain information are integrated (see $\\S3$ ) for enhanced generality (see $\\S4.2\\rangle$ ) and interpretability (see $\\S4.4\\rangle$ ). ", "page_idx": 26}, {"type": "text", "text": "Despite VFPT systemic effectiveness and simplicity, it also comes with new challenges and unveils some intriguing questions. For example, the balance between spatial and frequency information is presently dictated by task-specific, manually set percentages (see $\\S4.2\\rangle$ ). Introducing a small network within the VFPT framework to autonomously search for optimal combinations might enhance training efficiency and facilitate additional performance improvements. Another essential future direction deserving of further investigation is the integration of visual information from both the spatial and frequency domains. In $\\S4.5$ , we demonstrate through ablation studies that integration at the preprocessing stage may not yield satisfactory performance. Consequently, we outline several alternative integration approaches in Table 4, demonstrating that VFPT holds the most advantageous position under the prompt tuning paradigm. Nonetheless, the applicability of this integration to other PEFT methods requires further investigation. ", "page_idx": 26}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 27}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 27}, {"type": "text", "text": "Justification: We propose VFPT, an intuitive yet effective strategy that utilizes the Fourierbased operations to facilitate visual prompt tuning. The main contributions of VFPT (i.e., simplicity, generality, and interpretability) are claimed in both the abstract and introduction accurately. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 27}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 27}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Justification: We discuss the limitations in§S10 in Appendix ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 27}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 27}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Justification: All theorems used in the paper are properly referenced. ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 28}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 28}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Justification: We claim reproducibility in both $\\S4$ and $\\S S9$ . Our code will be publicly available after acceptance. ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 28}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 29}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 29}, {"type": "text", "text": "Justification: We claim reproducibility in both $\\S4$ and $\\S S9$ . All the datasets included in our study are publicly available (VTAB-1K, FGVC). Our code will be publicly available after acceptance. The publicly available code should be adequate to replicate the primary experimental results. ", "page_idx": 29}, {"type": "text", "text": "Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 29}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 29}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Justification: We specify all the training and test details in $\\S4$ ", "page_idx": 29}, {"type": "text", "text": "Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 29}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 29}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 29}, {"type": "text", "text": "Justification: We report standard deviation error bars for our main result in $\\S S1$ Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper. ", "page_idx": 29}, {"type": "text", "text": "• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 30}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 30}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 30}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 30}, {"type": "text", "text": "Justification: We specify all the training and test computing resources in $\\S4$ and $\\S S9$ . Guidelines: ", "page_idx": 30}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 30}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 30}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 30}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 30}, {"type": "text", "text": "Justification: We conform to the NeurIPS Code of Ethics and show related asset license and consent to our work in $\\S S8$ . ", "page_idx": 30}, {"type": "text", "text": "Guidelines: ", "page_idx": 30}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 30}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 30}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 30}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 30}, {"type": "text", "text": "Justification: $\\S S10$ discusses the social impact of our research. ", "page_idx": 30}, {"type": "text", "text": "Guidelines: • The answer NA means that there is no societal impact of the work performed. ", "page_idx": 30}, {"type": "text", "text": "• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 31}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 31}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 31}, {"type": "text", "text": "Justification: The paper poses no such risks. ", "page_idx": 31}, {"type": "text", "text": "Guidelines: ", "page_idx": 31}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 31}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 31}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 31}, {"type": "text", "text": "Justification: We show related asset license and consent to our work in $\\S S8$ ", "page_idx": 31}, {"type": "text", "text": "Guidelines: ", "page_idx": 31}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 31}, {"type": "text", "text": "", "page_idx": 32}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 32}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 32}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 32}, {"type": "text", "text": "Justification: We do not release new assets. In $\\S S8$ , we include asset license and consent. Guidelines: ", "page_idx": 32}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 32}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 32}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 32}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 32}, {"type": "text", "text": "Justification: Our paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 32}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 32}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 32}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 32}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 32}, {"type": "text", "text": "Justification: Our paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 32}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 32}, {"type": "text", "text": "", "page_idx": 33}]