[{"figure_path": "lWYwZklSvg/tables/tables_8_1.jpg", "caption": "Table 1: Physical world black-box attack results. Source indicates the models that the FDA patterns were optimized against, target indicates the model attacked by the FDA patterns, random indicates random pattern and ensemble indicates ensemble attack. Black-box attack results with average ASRS > 50% are highlighted in bold face. White-box attack results are indicated with blue italic font.", "description": "This table presents the results of black-box adversarial attacks on several pedestrian detection models.  The FDA (Full Distance Attack) patterns were trained against various source models (YOLOv5, Mask RCNN with ResNet and Swin backbones, Faster R-CNN, RetinaNet with PVT backbone). The table shows the average attack success rate (ASR) achieved when these trained patterns were used to attack each target model. A random pattern and an ensemble attack (combining patterns from multiple sources) are also included for comparison.  Higher ASRs indicate more successful evasion.", "section": "5 Experiments"}, {"figure_path": "lWYwZklSvg/tables/tables_18_1.jpg", "caption": "Table S1: ASRs of different patches at distances neighboring the ones used in the main paper. \"Rand\" indicates tests performed with a random patch, \"None\" indicates no patch applied during the test.", "description": "This table presents the generalization ability of the proposed FDA method across various distances.  It shows the attack success rate (ASR) for FDA patches, random patches, and no patches (control group) at several distances (5m, 9m, 15m, 21m, 28m, 38m, 45m, 50m). The results demonstrate the effectiveness of FDA across various distances, showing consistently higher ASRs than random and control groups, indicating that the model remains robust even at distances not specifically optimized during the training phase.", "section": "I Generalizing Across Different Distances"}, {"figure_path": "lWYwZklSvg/tables/tables_19_1.jpg", "caption": "Table 2: Average ASRs (across different distances) of FDA clothing targeting different white-box models evaluated at different IoU thresholds. Mean indicates mean over Average ASRs at different IOU thresholds.", "description": "This table presents the Average Success Rates (ASR) of the FDA clothing method across various distances and Intersection over Union (IoU) thresholds when used against three different object detection models: YOLOv5, Deformable DETR, and RetinaNet (with PVT backbone).  The IoU threshold represents the minimum overlap required between the predicted bounding box and the ground truth bounding box for a detection to be considered correct.  The mean column provides the average ASR across all IoU thresholds, offering a more holistic view of the model's performance.", "section": "5.3 Clothing Attacks in the Physical World"}]