[{"figure_path": "0EfUYVMrLv/tables/tables_7_1.jpg", "caption": "Table 1: The average classification error (in %) for the CIFAR10-to-CIFAR10C dataset under Gradual Shift. All results were averaged over 5 runs with different initializations. The number of data points per round was set to Nt = 10 with a duration of M = 10. The best results are highlighted in bold.", "description": "This table shows the average classification error rates for different corruption types in the CIFAR10C dataset under gradual shift conditions.  The results are averaged over five runs with different model initializations, each using a batch size of 10 data points per round, and a duration of 10 rounds before a shift in corruption severity.  The lowest error rate for each corruption type is highlighted in bold.", "section": "4.1 Experimental Setups"}, {"figure_path": "0EfUYVMrLv/tables/tables_7_2.jpg", "caption": "Table 1: The average classification error (in %) for the CIFAR10-to-CIFAR10C dataset under Gradual Shift. All results were averaged over 5 runs with different initializations. The number of data points per round was set to Nt = 10 with a duration of M = 10. The best results are highlighted in bold.", "description": "This table presents the average classification error rates for CIFAR10-to-CIFAR10C dataset under gradual shift conditions.  The experiment was repeated 5 times with different initializations, using 10 data points per round and a duration of 10 rounds per distribution.  The lowest error rates are highlighted in bold, showing the relative performance of various algorithms.", "section": "4.1 Experimental Setups"}, {"figure_path": "0EfUYVMrLv/tables/tables_9_1.jpg", "caption": "Table 3: The Average Classification Error (%) for iWildCam dataset. All results were averaged over 5 runs with different initial models. We set number of data Nt = 10 at each round.", "description": "This table presents the average classification error rates achieved by different methods on the iWildCam dataset for a real-world wildlife species classification task.  The results highlight the performance of the proposed Ada-ReAlign algorithm compared to existing methods in a real-world, non-stationary environment where the distribution of data naturally varies over time and location.", "section": "4.4 Real-World Evaluation on Wildlife Species Classification"}, {"figure_path": "0EfUYVMrLv/tables/tables_14_1.jpg", "caption": "Table 1: The average classification error (in %) for the CIFAR10-to-CIFAR10C dataset under Gradual Shift. All results were averaged over 5 runs with different initializations. The number of data points per round was set to Nt = 10 with a duration of M = 10. The best results are highlighted in bold.", "description": "This table presents the average classification error rates for CIFAR10-to-CIFAR10C dataset under gradual shift conditions.  The results are obtained by averaging over 5 runs with different initializations. The number of data points used per round (Nt) is 10, and the duration for which the data distribution remains unchanged (M) is also 10. The best performing methods for each corruption type are highlighted in bold.", "section": "4.1 Experimental Setups"}, {"figure_path": "0EfUYVMrLv/tables/tables_15_1.jpg", "caption": "Table 1: The average classification error (in %) for the CIFAR10-to-CIFAR10C dataset under Gradual Shift. All results were averaged over 5 runs with different initializations. The number of data points per round was set to Nt = 10 with a duration of M = 10. The best results are highlighted in bold.", "description": "This table presents the average classification error rates for the CIFAR10-to-CIFAR10C dataset under a gradual shift in data distribution.  The results are broken down by type of image corruption (Gaussian noise, shot noise, impulse noise, defocus blur, glass blur, motion blur, zoom blur, snow, frost, fog, brightness, contrast, elastic transform, pixelate, JPEG compression) and averaged across five runs with different random initializations.  Each run uses batches of 10 data points and a duration of 10 rounds (M=10) between shifts in distribution severity. The lowest error rate for each corruption type is highlighted in bold.", "section": "4.1 Experimental Setups"}, {"figure_path": "0EfUYVMrLv/tables/tables_15_2.jpg", "caption": "Table 6: The Average Classification Error (%) for CIFAR10-to-CIFAR10C Dataset under Sequential Shift. All results were evaluated using the largest corruption severity level 5 and averaged over 5 runs with different initial models. We set different number of data Nt at each round with duration M = 10.", "description": "This table shows the average classification error rates for the CIFAR10-to-CIFAR10C dataset under a sequential shift in data distribution.  The experiment used the highest corruption severity level (5) and ran 5 times with different initial model parameters.  The number of data points per round (Nt) was varied while maintaining a duration of 10 rounds (M=10) for each distribution. The results demonstrate how the Ada-ReAlign algorithm's performance changes with different amounts of data available during each adaptation step.", "section": "4.3 Ablation Study"}, {"figure_path": "0EfUYVMrLv/tables/tables_15_3.jpg", "caption": "Table 1: The average classification error (in %) for the CIFAR10-to-CIFAR10C dataset under Gradual Shift. All results were averaged over 5 runs with different initializations. The number of data points per round was set to Nt = 10 with a duration of M = 10. The best results are highlighted in bold.", "description": "This table presents the average classification error rates for CIFAR-10C dataset under gradual shift conditions.  The experiment was repeated 5 times with different random initializations. Each round consisted of 10 data points and the data distribution remained unchanged for 10 rounds. The lowest error rate for each corruption type is shown in bold.", "section": "4.1 Experimental Setups"}, {"figure_path": "0EfUYVMrLv/tables/tables_16_1.jpg", "caption": "Table 1: The average classification error (in %) for the CIFAR10-to-CIFAR10C dataset under Gradual Shift. All results were averaged over 5 runs with different initializations. The number of data points per round was set to Nt = 10 with a duration of M = 10. The best results are highlighted in bold.", "description": "This table presents the average classification error rates for CIFAR-10 to CIFAR-10C dataset under gradual distribution shifts.  The results are obtained by averaging over five runs with different initializations. The number of data points used in each round is 10, and the duration of a distribution is 10 rounds. The best-performing models are highlighted in bold.", "section": "4.1 Experimental Setups"}]