[{"figure_path": "nXXwYsARXB/figures/figures_1_1.jpg", "caption": "Figure 1: (left) Proposed framework called Hierarchical Decomposition of Performance Differences (namely, HDPD) helps to understand performance gaps of an ML algorithm between two domains. It decomposes the overall gap (say, in classification accuracy) into gaps due to shifts in the covariate versus outcome distribution (Aggregate). Then, it quantifies the importance of each feature to the two components (Detailed). (right) In terms of directed acyclic graphs, aggregate decompositions describe the effect of shift interventions, for instance, on the outcome Y distribution while keeping all else fixed between domains. Detailed decompositions quantify how well can we explain those shift interventions by more targeted shifts with respect to feature subsets Z, alone.", "description": "The figure demonstrates the HDPD framework, a hierarchical decomposition method for understanding ML performance discrepancies across domains.  The left panel shows a hierarchical decomposition of a performance gap into aggregate (covariate and outcome shifts) and detailed components, illustrating how the framework breaks down the overall gap into contributions from individual features. The right panel provides a graphical representation using directed acyclic graphs (DAGs), illustrating how aggregate decompositions represent the impact of interventions on the outcome distribution, while detailed decompositions quantify the contribution of feature subsets.", "section": "A unifying framework for explaining performance gaps"}, {"figure_path": "nXXwYsARXB/figures/figures_6_1.jpg", "caption": "Figure 1: (left) Proposed framework called Hierarchical Decomposition of Performance Differences (namely, HDPD) helps to understand performance gaps of an ML algorithm between two domains. It decomposes the overall gap (say, in classification accuracy) into gaps due to shifts in the covariate versus outcome distribution (Aggregate). Then, it quantifies the importance of each feature to the two components (Detailed). (right) In terms of directed acyclic graphs, aggregate decompositions describe the effect of shift interventions, for instance, on the outcome Y distribution while keeping all else fixed between domains. Detailed decompositions quantify how well can we explain those shift interventions by more targeted shifts with respect to feature subsets Z, alone.", "description": "The figure illustrates the proposed Hierarchical Decomposition of Performance Differences (HDPD) framework for explaining ML performance discrepancies across domains. The left panel shows a hierarchical decomposition of the overall performance gap into aggregate terms (covariate and outcome shifts) and further into detailed terms quantifying each feature's contribution to these shifts.  The right panel uses directed acyclic graphs (DAGs) to visually represent the aggregate and detailed decompositions, illustrating how interventions on different variable subsets affect the outcome and how these effects can be explained.", "section": "A unifying framework for explaining performance gaps"}, {"figure_path": "nXXwYsARXB/figures/figures_7_1.jpg", "caption": "Figure 1: (left) Proposed framework called Hierarchical Decomposition of Performance Differences (namely, HDPD) helps to understand performance gaps of an ML algorithm between two domains. It decomposes the overall gap (say, in classification accuracy) into gaps due to shifts in the covariate versus outcome distribution (Aggregate). Then, it quantifies the importance of each feature to the two components (Detailed). (right) In terms of directed acyclic graphs, aggregate decompositions describe the effect of shift interventions, for instance, on the outcome Y distribution while keeping all else fixed between domains. Detailed decompositions quantify how well can we explain those shift interventions by more targeted shifts with respect to feature subsets Z, alone.", "description": "This figure illustrates the Hierarchical Decomposition of Performance Differences (HDPD) framework. The left panel shows a hierarchical decomposition of the performance gap between two domains, starting from an overall gap and breaking it down into covariate and outcome shifts (aggregate level), then further decomposing these into detailed contributions of individual features (detailed level).  The right panel uses directed acyclic graphs to visualize the difference between aggregate and detailed decompositions, illustrating how targeted shifts in feature subsets can explain the overall performance gap.", "section": "A unifying framework for explaining performance gaps"}, {"figure_path": "nXXwYsARXB/figures/figures_17_1.jpg", "caption": "Figure 1: (left) Proposed framework called Hierarchical Decomposition of Performance Differences (namely, HDPD) helps to understand performance gaps of an ML algorithm between two domains. It decomposes the overall gap (say, in classification accuracy) into gaps due to shifts in the covariate versus outcome distribution (Aggregate). Then, it quantifies the importance of each feature to the two components (Detailed). (right) In terms of directed acyclic graphs, aggregate decompositions describe the effect of shift interventions, for instance, on the outcome Y distribution while keeping all else fixed between domains. Detailed decompositions quantify how well can we explain those shift interventions by more targeted shifts with respect to feature subsets Z, alone.", "description": "This figure illustrates the proposed Hierarchical Decomposition of Performance Differences (HDPD) framework for analyzing ML performance discrepancies between two domains. The left panel shows a hierarchical decomposition of the overall performance gap into aggregate and detailed components. The right panel visually represents these decompositions using directed acyclic graphs (DAGs), highlighting the effects of covariate and outcome shifts on the overall performance gap.", "section": "A unifying framework for explaining performance gaps"}, {"figure_path": "nXXwYsARXB/figures/figures_31_1.jpg", "caption": "Figure 1: (left) Proposed framework called Hierarchical Decomposition of Performance Differences (namely, HDPD) helps to understand performance gaps of an ML algorithm between two domains. It decomposes the overall gap (say, in classification accuracy) into gaps due to shifts in the covariate versus outcome distribution (Aggregate). Then, it quantifies the importance of each feature to the two components (Detailed). (right) In terms of directed acyclic graphs, aggregate decompositions describe the effect of shift interventions, for instance, on the outcome Y distribution while keeping all else fixed between domains. Detailed decompositions quantify how well can we explain those shift interventions by more targeted shifts with respect to feature subsets Z, alone.", "description": "This figure illustrates the hierarchical decomposition framework (HDPD) for analyzing ML performance discrepancies across domains.  The left panel shows a breakdown of the overall performance gap into covariate shift and outcome shift components at the aggregate and detailed levels. The right panel uses directed acyclic graphs (DAGs) to visually represent how this decomposition relates to shifts in feature and outcome distributions.", "section": "A unifying framework for explaining performance gaps"}, {"figure_path": "nXXwYsARXB/figures/figures_31_2.jpg", "caption": "Figure 2: (a) Coverage rates of 90% CIs for value of s-partial shifts for the conditional covariate (first column) and outcome shifts (second column) across dataset sizes n. Dashed horizontal line indicates 90% coverage rate. (b) Comparison of variable importance reported by proposed method HDPD (debiased) versus existing methods for conditional covariate and outcome shift terms.", "description": "Figure 2(a) shows the coverage of 90% confidence intervals for the values of partial shifts for conditional covariate and outcome shifts for different dataset sizes. The dashed horizontal line indicates the desired 90% coverage rate.  Figure 2(b) compares variable importance computed using the proposed method (HDPD, debiased) with other existing methods (WuShift, MeanChange, Oaxaca-Blinder, Plug-in).", "section": "4 Simulation"}, {"figure_path": "nXXwYsARXB/figures/figures_32_1.jpg", "caption": "Figure 3: Aggregate and detailed decompositions for performance gaps of (a) a model predicting readmission risk across patient populations and (b) a model predicting insurance coverage across US states. A subset of VI estimates is shown; see full list in Section J in the Appendix.", "description": "This figure shows the results from applying the proposed hierarchical decomposition method to two real-world datasets.  The left panel (a) shows the decomposition of the performance gap for a model predicting hospital readmission risk between two populations (general and heart failure patients).  The right panel (b) shows the decomposition for a model predicting insurance coverage between two US states (Nebraska and Louisiana). Both panels depict the aggregate decomposition into covariate and outcome shift, as well as the detailed decomposition highlighting feature contributions to the covariate and outcome shift. Specific VI (variable importance) values are presented, with reference made to a more comprehensive list in the Appendix.", "section": "Real-world data case studies"}, {"figure_path": "nXXwYsARXB/figures/figures_33_1.jpg", "caption": "Figure 3: Aggregate and detailed decompositions for performance gaps of (a) a model predicting readmission risk across patient populations and (b) a model predicting insurance coverage across US states. A subset of VI estimates is shown; see full list in Section J in the Appendix.", "description": "This figure visualizes the results of applying the Hierarchical Decomposition of Performance Differences (HDPD) framework to two real-world datasets.  Panel (a) shows the decomposition of the performance gap in a readmission risk prediction model between general patient and heart failure patient populations. Panel (b) shows the decomposition for a model predicting insurance coverage across different US states.  Each panel displays both aggregate decompositions (overall covariate and outcome shifts) and detailed decompositions (contributions of individual variables to each shift).  The figure highlights the most influential variables affecting performance, enabling targeted investigations into the root causes of performance discrepancies.", "section": "Real-world data case studies"}]