[{"figure_path": "4KeSvAvNMr/figures/figures_1_1.jpg", "caption": "Figure 1: Samples yx from Treeffuser vs. true densities, for multiple values of x under three different scenarios. Treeffuser captures arbitrarily complex conditional distributions that vary with x.", "description": "This figure shows examples of how Treeffuser, a probabilistic prediction method, performs on three different types of data distributions: multimodal, inflated, and multivariate.  The left column shows histograms of samples generated by Treeffuser for different values of the input variable x. The middle column shows the true densities of the distributions. The right column shows a combined view across all values of x and for all three scenarios. The figure demonstrates that Treeffuser successfully captures the complexity and variability of the underlying distributions across all three scenarios, accurately reflecting the true densities.", "section": "1 Introduction"}, {"figure_path": "4KeSvAvNMr/figures/figures_8_1.jpg", "caption": "Figure 1: Samples yx from Treeffuser vs. true densities, for multiple values of x under three different scenarios. Treeffuser captures arbitrarily complex conditional distributions that vary with x.", "description": "This figure shows the results of Treeffuser on three different complex distributions: a multimodal response with varying components, an inflated response with shifting support, and a multivariate response with dynamic correlations.  For each scenario, Treeffuser generates samples from the target conditional distribution, demonstrating its ability to capture the complexity of arbitrarily complex conditional distributions that vary with the input variable x. The plots visually compare the samples generated by Treeffuser with the actual true densities of the target distributions.", "section": "1 Introduction"}, {"figure_path": "4KeSvAvNMr/figures/figures_9_1.jpg", "caption": "Figure 3: Cumulative profits by method on an inventory management problem. Treeffuser produces more accurate probabilistic predictions yielding higher profits.", "description": "This figure shows the cumulative profits over 30 days for three different models used for inventory management: Treeffuser, NGBoost-Poisson, and Quantile Regression.  Both tuned and default hyperparameters are shown for each model.  The graph demonstrates that Treeffuser consistently outperforms the other models, achieving significantly higher cumulative profits, highlighting the advantages of using Treeffuser for making more accurate probabilistic predictions in this specific context.", "section": "5.3 Sales forecasting with long tails and count data"}, {"figure_path": "4KeSvAvNMr/figures/figures_16_1.jpg", "caption": "Figure 1: Samples yx from Treeffuser vs. true densities, for multiple values of x under three different scenarios. Treeffuser captures arbitrarily complex conditional distributions that vary with x.", "description": "This figure compares samples generated by Treeffuser with the true probability density functions for three different scenarios. Each scenario involves a different type of complex conditional distribution: a multimodal response with varying components, an inflated response with shifting support, and a multivariate response with dynamic correlations. The figure shows that Treeffuser accurately captures the complexity of each distribution, demonstrating its ability to learn and sample from arbitrarily complex conditional distributions.", "section": "1 Introduction"}, {"figure_path": "4KeSvAvNMr/figures/figures_16_2.jpg", "caption": "Figure 1: Samples yx from Treeffuser vs. true densities, for multiple values of x under three different scenarios. Treeffuser captures arbitrarily complex conditional distributions that vary with x.", "description": "This figure demonstrates the ability of Treeffuser to model complex conditional distributions.  It shows three scenarios: a multimodal response, an inflated response, and a multivariate response. For each scenario, Treeffuser accurately captures the true density of the response variable (y) given different values of the input variable (x), even when the true densities are multimodal, skewed, or exhibit dynamic correlations. This highlights Treeffuser's flexibility and nonparametric nature.", "section": "1 Introduction"}, {"figure_path": "4KeSvAvNMr/figures/figures_22_1.jpg", "caption": "Figure 1: Samples yx from Treeffuser vs. true densities, for multiple values of x under three different scenarios. Treeffuser captures arbitrarily complex conditional distributions that vary with x.", "description": "This figure visualizes the performance of Treeffuser in capturing complex conditional distributions.  It presents three different scenarios, each with multiple values of x, showcasing how Treeffuser generates samples (yx) that closely match the true probability density functions (PDFs). The scenarios illustrate Treeffuser's ability to handle multimodal distributions, distributions with shifting support, and multivariate distributions with dynamic correlations.  This demonstrates the model's non-parametric nature and its capacity for accurately estimating complex relationships in data.", "section": "1 Introduction"}, {"figure_path": "4KeSvAvNMr/figures/figures_22_2.jpg", "caption": "Figure 5: Dataset size vs training time on subsets of the M5 dataset. Error bars are computed over 5 runs. Treeffuser training speed grows linearly with the size of the training points.", "description": "This figure shows the relationship between the size of the training dataset and the time it takes to train the Treeffuser model.  The x-axis represents the number of samples in the dataset, and the y-axis represents the mean training time in seconds.  Error bars indicate the variability in training time across multiple runs.  The figure demonstrates that the training time scales linearly with the size of the dataset, indicating that Treeffuser is computationally efficient, especially on large datasets.", "section": "5.3 Sales forecasting with long tails and count data"}]