[{"figure_path": "fNakQltI1N/tables/tables_7_1.jpg", "caption": "Table 1: Mean ± Std. deviation MSE (×10−3) by models and datasets. Split into deterministic (top) and stochastic models (bottom). Top performing model for each setting and dataset in bold.", "description": "This table presents the Mean Squared Error (MSE) results for various time series models applied to four different datasets (ICU Sepsis, ICU Cardiac Arrest, ICU GIB, ED GIB). The models are categorized into deterministic and stochastic types.  The MSE values are reported as mean ± standard deviation (×10−3). The table highlights the best-performing model for each dataset and model type.", "section": "4.2.1 Prediction accuracy and precision: TFM and TFM-ODE"}, {"figure_path": "fNakQltI1N/tables/tables_7_2.jpg", "caption": "Table 2: Uncertainty test MSE loss for TFM-ODE and TFM with two different ICU datasets.", "description": "This table presents the uncertainty test MSE loss for both TFM-ODE and TFM models across two different ICU datasets (ICU Sepsis and ICU Cardiac Arrest).  It shows the mean and standard deviation of the MSE loss for each model and dataset, highlighting the difference in uncertainty prediction performance between TFM-ODE and TFM.", "section": "4.2 Experiments on clinical datasets"}, {"figure_path": "fNakQltI1N/tables/tables_7_3.jpg", "caption": "Table 3: Data variance MMD for by models and datasets. Split into deterministic models (top) and stochastic models (bottom). Top performing model for each setting and dataset in bold.", "description": "This table presents the Maximum Mean Discrepancy (MMD) results, a metric measuring the similarity between the predicted and true distributions of the next observation in the time series.  The results are separated into deterministic (top) and stochastic (bottom) models. The table compares the performance of several models (NeuralODE, TFM-ODE, NeuralSDE, and TFM) across four different datasets (ICU Sepsis, ICU Cardiac Arrest, ICU GIB, and ED GIB), highlighting the top-performing model for each dataset and model type.", "section": "4.2.2 Trajectory Variance Distribution Comparison"}, {"figure_path": "fNakQltI1N/tables/tables_8_1.jpg", "caption": "Table 1: Mean ± Std. deviation MSE (×10−3) by models and datasets. Split into deterministic (top) and stochastic models (bottom). Top performing model for each setting and dataset in bold.", "description": "This table presents the Mean Squared Error (MSE) achieved by different models (deterministic and stochastic) on four different datasets.  The MSE is a measure of the difference between the model's predictions and the actual values. Lower MSE indicates better performance. The table is split into two sections: deterministic models and stochastic models, with the best performing model for each dataset highlighted in bold.  The results allow for a comparison of the performance of various models for time series prediction in different contexts.", "section": "4.2.1 Prediction accuracy and precision: TFM and TFM-ODE"}]