[{"figure_path": "aUHSwmHRVb/tables/tables_18_1.jpg", "caption": "Table 1: Sequence parameters used in the real motion experiments.", "description": "This table lists the MRI sequence parameters used for acquiring real motion-corrupted data in the experiments described in Section 6.3. The parameters include flip angle, repetition time (TR), echo time (TE), inversion time (TI), turbo factor, number of shots, and other relevant details of the acquisition.  It provides a detailed technical description of the experimental setup.", "section": "D.4 MRI sequence parameters for real motion experiments"}, {"figure_path": "aUHSwmHRVb/tables/tables_20_1.jpg", "caption": "Table 2: Reconstruction performance of MotionTTT+Th-L1 in PSNR averaged over four validation examples and five randomly generated motion trajectories per example together with the average number of discarded k-space lines due to DC loss thresholding before the final reconstruction. We compare the performance of four different sampling orders random, deterministic, interleaved and linear for intra-shot motion correction.", "description": "This table shows the PSNR (Peak Signal-to-Noise Ratio) values and the number of discarded k-space lines for different sampling orders (random, deterministic, interleaved, linear) in the context of MotionTTT+Th-L1 for intra-shot motion correction.  It demonstrates the effect of different sampling strategies on reconstruction quality and efficiency by showing the trade-off between PSNR and the number of discarded lines. The higher the PSNR, the better the reconstruction quality; a lower number of discarded lines suggests a more efficient use of acquired data.  The results indicate the random and deterministic orders have similar performance.", "section": "E.2.1 Number of motion states per shot"}, {"figure_path": "aUHSwmHRVb/tables/tables_21_1.jpg", "caption": "Table 1: Sequence parameters used in the real motion experiments.", "description": "This table lists the parameters of the 3D T1-weighted Ultrafast Gradient-Echo (TFE) MRI sequence used to acquire the real motion-corrupted data in the experiments described in Section 6.3 of the paper.  The parameters include sequence type, flip angle, repetition time (TR), echo time (TE), TFE prepulse and delay, minimum inversion time delay, TFE factor, the number of shots, the duration of each shot and acquisition, the shot interval, sampling type (Cartesian), under-sampling factor, half-scan factors in the Y and Z directions, the number of auto-calibration lines, profile order (random), field of view (FOV), acquisition matrix, fold-over direction, fat shift direction, and water-fat shift. These parameters provide a detailed specification of the MRI acquisition process used in the study.", "section": "D.4 MRI sequence parameters for real motion experiments"}, {"figure_path": "aUHSwmHRVb/tables/tables_23_1.jpg", "caption": "Table 2: Reconstruction performance of MotionTTT+Th-L1 in PSNR averaged over four validation examples and five randomly generated motion trajectories per example together with the average number of discarded k-space lines due to DC loss thresholding before the final reconstruction. We compare the performance of four different sampling orders random, deterministic, interleaved and linear for intra-shot motion correction.", "description": "This table presents the results of the MotionTTT+Th-L1 method under different sampling orders (random, deterministic, interleaved, and linear) for intra-shot motion correction.  It shows the average PSNR (Peak Signal-to-Noise Ratio) achieved across four validation examples and five motion trajectories for each sampling order.  Additionally, it shows the average number of k-space lines that were discarded due to the DC loss threshold.  This data allows for comparing the effectiveness of different sampling strategies under the conditions of the experiment.", "section": "E.2.2 Sampling order"}, {"figure_path": "aUHSwmHRVb/tables/tables_23_2.jpg", "caption": "Table 2: Reconstruction performance of MotionTTT+Th-L1 in PSNR averaged over four validation examples and five randomly generated motion trajectories per example together with the average number of discarded k-space lines due to DC loss thresholding before the final reconstruction. We compare the performance of four different sampling orders random, deterministic, interleaved and linear for intra-shot motion correction.", "description": "This table presents the performance of the MotionTTT+Th-L1 method for intra-shot motion correction using four different sampling orders (random, deterministic, interleaved, and linear).  The performance is measured in Peak Signal-to-Noise Ratio (PSNR), and the number of discarded k-space lines (due to a data consistency loss threshold) is also reported for each sampling order. This data helps to analyze the impact of sampling order on the method's accuracy and efficiency.", "section": "E.2.1 Number of motion states per shot"}, {"figure_path": "aUHSwmHRVb/tables/tables_25_1.jpg", "caption": "Table 2: Reconstruction performance of MotionTTT+Th-L1 in PSNR averaged over four validation examples and five randomly generated motion trajectories per example together with the average number of discarded k-space lines due to DC loss thresholding before the final reconstruction. We compare the performance of four different sampling orders random, deterministic, interleaved and linear for intra-shot motion correction.", "description": "This table presents the results of the MotionTTT+Th-L1 method for intra-shot motion correction using four different k-space sampling orders: random, deterministic, interleaved, and linear.  The performance is measured by PSNR (Peak Signal-to-Noise Ratio) and the number of k-space lines discarded due to a data consistency (DC) loss threshold. This shows how the choice of sampling order impacts the reconstruction quality and computational efficiency of the method.", "section": "E.2.2 Sampling order"}]