[{"figure_path": "AoEeBqP8AD/figures/figures_1_1.jpg", "caption": "Figure 1: Performance (AUROC) degradation of anomaly detection methods with increasing missing rate on Adult and KDD datasets.", "description": "This figure shows the Area Under the Receiver Operating Characteristic (AUROC) curves for four different anomaly detection methods (IForest, Deep SVDD, NeuTraL AD) on two datasets (Adult and KDD).  The x-axis represents the missing data rate (percentage), and the y-axis represents the AUROC score.  The lines show how the accuracy of each method decreases as the amount of missing data increases. This illustrates the challenge of applying standard anomaly detection techniques to datasets with missing values.", "section": "1 Introduction"}, {"figure_path": "AoEeBqP8AD/figures/figures_1_2.jpg", "caption": "Figure 2: The degradation of recall rate of abnormal data on “impute-then-detect” methods.", "description": "This figure shows the recall rate degradation of different anomaly detection methods when using the naive imputation strategy (mean or median imputation) and state-of-the-art imputation methods (MissForest and GAIN) on two real-world datasets (Adult and KDD).  The results demonstrate that the naive strategy significantly reduces the recall rate as the missing data rate increases, while even the advanced imputation methods still suffer from imputation bias, leading to lower recall rates on the abnormal data.  The key observation is the negative effect of imputation bias in unsupervised anomaly detection when the training data consist solely of normal samples. The impute-then-detect methods yield lower recall rates compared to using complete data, highlighting the challenge posed by imputation bias in anomaly detection tasks.", "section": "1 Introduction"}, {"figure_path": "AoEeBqP8AD/figures/figures_3_1.jpg", "caption": "Figure 3: Visualization of Dz and Dž in 2-D latent space Z.", "description": "This figure visualizes the latent distributions Dz and Dž in a two-dimensional latent space Z. Dz represents the latent distribution of normal data, shown as a cluster of dark blue points concentrated near the origin.  Dž represents the latent distribution of pseudo-abnormal samples, which are generated by the ImAD model to mitigate imputation bias. These are shown as lighter blue points forming a ring around Dz. The figure illustrates how ImAD generates pseudo-abnormal samples in the latent space, ensuring that they are distinct from normal data while remaining relatively close to enhance the model's ability to distinguish between normal and abnormal samples.", "section": "3.2 Learning Framework of ImAD"}, {"figure_path": "AoEeBqP8AD/figures/figures_4_1.jpg", "caption": "Figure 4: ImAD framework. X and X denote the normal and pseudo-abnormal data with missing values, respectively, while X and X are the corresponding imputed data.", "description": "This figure illustrates the ImAD framework, showing how normal and pseudo-abnormal data with missing values are processed.  The normal data (X) and pseudo-abnormal data (X) are first imputed using an imputer (I) to fill in missing values, resulting in imputed data (X) and (X). These imputed datasets are then projected into a lower-dimensional latent space (Z) using a projector (P).  The pseudo-abnormal data is generated based on the latent representations of normal data.  Finally, a reconstructor (R) maps the latent space representations back to the original data space to create pseudo-abnormal samples, which are then combined with the original normal samples for anomaly detection.", "section": "3 Proposed Method"}, {"figure_path": "AoEeBqP8AD/figures/figures_7_1.jpg", "caption": "Figure 5: Two-dimensional visualization on Botnet.", "description": "This figure visualizes the effectiveness of the generated pseudo-abnormal samples learned by the ImAD model for the Botnet dataset.  The 2D latent space is shown with three types of samples: real normal samples (green), real abnormal samples (red), and the generated pseudo-abnormal samples (purple).  The visualization shows that the pseudo-abnormal samples effectively cover the region of real abnormal samples, which supports the ImAD's mechanism in mitigating imputation bias by filling in missing values for abnormal samples.", "section": "4.2 Experimental Results on Datasets with Manually Constructed Missing Values"}, {"figure_path": "AoEeBqP8AD/figures/figures_20_1.jpg", "caption": "Figure 6: The detection performance on Adult, Botnet and KDD with different latent dimension.", "description": "The figure visualizes the performance of anomaly detection on three datasets (Adult, Botnet, KDD) across various latent dimensions.  Separate plots display AUROC and AUPRC for each dataset, at two different missing rates (0.2 and 0.5).  The x-axis represents the latent dimension, while the y-axis shows the AUROC and AUPRC values, respectively. This allows for a comparison of model performance in different latent spaces and under different data completeness conditions.", "section": "4.2 Experimental Results on Datasets with Manually Constructed Missing Values"}, {"figure_path": "AoEeBqP8AD/figures/figures_21_1.jpg", "caption": "Figure 5: Two-dimensional visualization on Botnet.", "description": "This figure visualizes the results of anomaly detection on the Botnet dataset in a 2D latent space. It shows the distribution of normal samples, abnormal samples, and pseudo-abnormal samples generated by the ImAD model. The pseudo-abnormal samples effectively cover the region of real abnormal samples, which demonstrates the model's ability to generate realistic pseudo-abnormal data for mitigating imputation bias and improving the accuracy of anomaly detection.", "section": "4.2 Experimental Results on Datasets with Manually Constructed Missing Values"}, {"figure_path": "AoEeBqP8AD/figures/figures_21_2.jpg", "caption": "Figure 5: Two-dimensional visualization on Botnet.", "description": "This figure visualizes the latent space Z (reduced to 2D for visualization) of the Botnet dataset.  It shows the distribution of normal samples (blue), abnormal samples (red), and pseudo-abnormal samples generated by ImAD (green) for missing rates of 0.2 and 0.5. The visualization demonstrates that the pseudo-abnormal samples effectively cover the region occupied by the real abnormal samples, indicating the method's ability to generate meaningful pseudo-abnormal data that helps mitigate imputation bias.", "section": "4.2 Experimental Results on Datasets with Manually Constructed Missing Values"}, {"figure_path": "AoEeBqP8AD/figures/figures_24_1.jpg", "caption": "Figure 6: The detection performance on Adult, Botnet and KDD with different latent dimension.", "description": "This figure visualizes the performance of the ImAD model on three datasets (Adult, Botnet, and KDD) across various latent dimensions.  It shows how the AUROC and AUPRC metrics change as the dimensionality of the latent space used in the ImAD model varies. This helps demonstrate the model's robustness and sensitivity to changes in the latent space's dimensionality and its implications for the accuracy of anomaly detection.", "section": "4.2 Experimental Results on Datasets with Manually Constructed Missing Values"}, {"figure_path": "AoEeBqP8AD/figures/figures_24_2.jpg", "caption": "Figure 6: The detection performance on Adult, Botnet and KDD with different latent dimension.", "description": "The figure shows the performance of AUROC and AUPRC on three datasets (Adult, Botnet, and KDD) with different latent dimensions (d).  The x-axis represents the latent dimension, while the y-axis represents the AUROC and AUPRC values. Separate lines are shown for the different missing rates (0.2 and 0.5). The figure illustrates how the choice of latent dimension impacts the performance of the anomaly detection model in the presence of missing data.", "section": "4.2 Experimental Results on Datasets with Manually Constructed Missing Values"}]