[{"figure_path": "ZG84y6a7ge/tables/tables_6_1.jpg", "caption": "Table 1: Comparing with other existing SAM compression methods on SA-1B dataset. We report parameter counts, MACs, training costs, and Mean Intersection over Union (MIoU) for a comprehensive and fair comparison.", "description": "This table compares SlimSAM with other state-of-the-art (SOTA) SAM compression methods.  It presents a comparison across multiple metrics: the number of parameters (Params), the number of Multiply-Accumulate operations (MACs), the size of the training dataset used (TrainSet), batch size, number of GPUs used for training, the number of training iterations, and the mean Intersection over Union (MIoU) which is a metric for evaluating segmentation accuracy.  The table highlights SlimSAM's efficiency by showing its superior performance with significantly fewer parameters, MACs, and training data.", "section": "4.2 Comparision and Analysis"}, {"figure_path": "ZG84y6a7ge/tables/tables_6_2.jpg", "caption": "Table 1: Comparing with other existing SAM compression methods on SA-1B dataset. We report parameter counts, MACs, training costs, and Mean Intersection over Union (MIoU) for a comprehensive and fair comparison.", "description": "This table compares SlimSAM's performance against other state-of-the-art (SOTA) SAM compression methods.  It shows the parameter counts, multiply-accumulate operations (MACs), training data used, and the mean Intersection over Union (mIoU) scores achieved. The comparison highlights SlimSAM's superior performance and efficiency, particularly given its significantly reduced training data requirement.", "section": "4.2 Comparision and Analysis"}, {"figure_path": "ZG84y6a7ge/tables/tables_7_1.jpg", "caption": "Table 3: Comparison between disturbed Taylor pruning and original Taylor pruning.", "description": "This table compares the performance (MIoU) of different pruning methods. It shows that the proposed \"Disturbed Taylor Pruning\" outperforms the original \"Taylor Pruning\" method, especially when combined with the SlimSAM-77 framework.  The results highlight the effectiveness of aligning the pruning objective with the distillation target.", "section": "4.2 Comparision and Analysis"}, {"figure_path": "ZG84y6a7ge/tables/tables_7_2.jpg", "caption": "Table 4: Effect of distillation from intermediate layers and final output image embeddings.", "description": "This table shows the mean Intersection over Union (mIoU) achieved by using different distillation objectives in different steps of the SlimSAM model's alternate slimming process.  It demonstrates the effectiveness of including bottleneck and embedding features along with final image embeddings in the distillation process for improving the mIoU.  The comparison shows an improvement using this approach vs using only final image embeddings in both Step 1 and Step 2.", "section": "4.2 Comparision and Analysis"}, {"figure_path": "ZG84y6a7ge/tables/tables_8_1.jpg", "caption": "Table 5: Effect of global pruning evaluated under five different normalization approaches.", "description": "This table presents the results of an ablation study comparing different normalization methods used for global pruning.  The MIoU (mean Intersection over Union) metric is used to evaluate the performance of different normalization techniques (Mean, Max, Sum, Gaussian, Standardization) applied to global pruning. The table helps understand which normalization method yields the best performance in the context of global pruning for the SlimSAM model.", "section": "4.2 Comparision and Analysis"}, {"figure_path": "ZG84y6a7ge/tables/tables_8_2.jpg", "caption": "Table 11: The training results were compared using the varied amounts of training data but maintaining the same training iterations.", "description": "This table shows the results of experiments conducted with varying amounts of training data while keeping the number of training iterations constant.  It demonstrates how model performance (measured by MIoU) changes as the amount of training data decreases for different pruning ratios (50% and 77%).  This analysis helps determine the impact of data scarcity on the SlimSAM model's performance.", "section": "4.2 Comparision and Analysis"}, {"figure_path": "ZG84y6a7ge/tables/tables_14_1.jpg", "caption": "Table 7: Comparison between disturbed Taylor pruning and original Taylor pruning.", "description": "This table presents the mean Intersection over Union (MIoU) scores achieved by using Taylor pruning and disturbed Taylor pruning. It also shows the MIoU scores when these pruning methods are combined with the SlimSAM-50 method. The results demonstrate that the disturbed Taylor pruning consistently outperforms the original Taylor pruning, achieving higher MIoU scores at equivalent training expenditures.", "section": "A.1 Ablation Study on SlimSAM-50"}, {"figure_path": "ZG84y6a7ge/tables/tables_14_2.jpg", "caption": "Table 8: Effect of distillation from intermediate layers and final output image embeddings.", "description": "This table presents the results of an ablation study evaluating the impact of using intermediate layers in the distillation process.  The experiment compares using only final image embeddings for distillation against including bottleneck features (Step 1) and embedding features (Step 2).  The MIoU (mean Intersection over Union) metric demonstrates the effectiveness of including these additional features in the distillation process, showing an improvement in performance.", "section": "4.2 Comparision and Analysis"}, {"figure_path": "ZG84y6a7ge/tables/tables_14_3.jpg", "caption": "Table 5: Effect of global pruning evaluated under five different normalization approaches.", "description": "This table presents the results of an ablation study comparing different normalization methods used in global pruning.  It shows the mean Intersection over Union (mIoU) achieved for each normalization technique (Mean, Max, Sum, Gaussian, Standardization) when applying global pruning to the SlimSAM model.  The mIoU metric measures the model's accuracy in semantic segmentation.", "section": "4.2 Comparision and Analysis"}, {"figure_path": "ZG84y6a7ge/tables/tables_16_1.jpg", "caption": "Table 1: Comparing with other existing SAM compression methods on SA-1B dataset. We report parameter counts, MACs, training costs, and Mean Intersection over Union (MIoU) for a comprehensive and fair comparison.", "description": "This table compares SlimSAM with other state-of-the-art (SOTA) SAM compression methods.  It shows the number of parameters, Multiply-Accumulate operations (MACs), the size of the training dataset used, and the mean Intersection over Union (mIoU) achieved. The mIoU metric reflects the accuracy of semantic segmentation.  The table highlights SlimSAM's superior performance and efficiency by achieving comparable or better mIoU with significantly fewer parameters, MACs, and training data.", "section": "4.2 Comparision and Analysis"}, {"figure_path": "ZG84y6a7ge/tables/tables_16_2.jpg", "caption": "Table 11: The training results were compared using the varied amounts of training data but maintaining the same training iterations.", "description": "This table compares the model's performance (measured by MIoU) under different amounts of training data while keeping the number of training iterations constant. It shows how the model's performance changes with varying amounts of training data (10k, 5k, and 2k images) at two different pruning ratios (50% and 77%). This helps in understanding the impact of data availability on the model's performance under different compression levels.", "section": "4.2 Comparision and Analysis"}, {"figure_path": "ZG84y6a7ge/tables/tables_17_1.jpg", "caption": "Table 12: Comparing with other existing SAM compression methods on SA-1B dataset. We report parameter counts, MACs, training costs, and Mean Intersection over Union (MIoU) for a comprehensive and fair comparison.", "description": "This table compares SlimSAM's performance against other state-of-the-art (SOTA) SAM compression methods.  It shows the number of parameters, Multiply-Accumulate operations (MACs), training data used, and the mean Intersection over Union (mIoU) score achieved by each method. This allows for a direct comparison of SlimSAM's efficiency and performance relative to existing techniques.", "section": "4.2 Comparision and Analysis"}, {"figure_path": "ZG84y6a7ge/tables/tables_17_2.jpg", "caption": "Table 13: Ablation study on dynamic loss weights for distillation", "description": "This table presents the results of an ablation study that compares the performance of using a constant weight (α = 0.5) versus a dynamic weight (α = (N − n − 1)/N) for the distillation process in SlimSAM.  The study evaluates the mIoU achieved for both SlimSAM-50 and SlimSAM-77 models at steps 1 and 2 of the distillation process, highlighting the impact of using a dynamic weighting strategy on performance.", "section": "5 Ablation Study and Analysis"}]