[{"figure_path": "PtD4aZPzcR/figures/figures_2_1.jpg", "caption": "Figure 1: Left: Trade-off between 1/s (samples as a fraction of n) and the query time exponent pq for our algorithm for half-uniform distributions (solid green curve), the algorithm by [1] for general distributions (dashed green curve), our analytic lower bound (solid red curve), and a numerical evaluation of the bound from Theorem 3.2 (dashed black curve). We have fixed the space parameter pu = 1/2. The plots illustrate the asymptotic behaviour proven in Theorem 3.1 and Theorem 4.2 that as s→∞, pq = 1 − Θ(1/log s) both in the lower bound and for our algorithm for half-uniform distributions. Right: The same plot zoomed in to the upper left corner with 1/s on log-scale.", "description": "The figure shows the trade-off between the number of samples (as a fraction of n) and the query time exponent (pq) for different algorithms and bounds.  The left panel displays the overall behavior, while the right panel zooms in on the region of small sample sizes.  It compares an algorithm for half-uniform distributions proposed by the authors, an existing algorithm for general distributions, the authors' analytical lower bound, and a numerical evaluation of a tighter lower bound. The figure demonstrates that the query time exponent approaches 1 as the number of samples approaches n,  and that the improvement over linear time in k (number of distributions) is limited.", "section": "Statistical-Computational Trade-offs"}, {"figure_path": "PtD4aZPzcR/figures/figures_8_1.jpg", "caption": "Figure 1: Left: Trade-off between 1/s (samples as a fraction of n) and the query time exponent pq for our algorithm for half-uniform distributions (solid green curve), the algorithm by [1] for general distributions (dashed green curve), our analytic lower bound (solid red curve), and a numerical evaluation of the bound from Theorem 3.2 (dashed black curve). We have fixed the space parameter pu = 1/2. The plots illustrate the asymptotic behaviour proven in Theorem 3.1 and Theorem 4.2 that as s→∞, pq = 1 − Θ(1/log s) both in the lower bound and for our algorithm for half-uniform distributions. Right: The same plot zoomed in to the upper left corner with 1/s on log-scale.", "description": "This figure shows the trade-off between the number of samples (as a fraction of n) and the query time exponent for different algorithms and the lower bound. The left panel shows the full range, while the right panel zooms in on the upper-left corner for better visualization.  The algorithms are compared for both general and half-uniform distributions. The plots demonstrate the asymptotic behavior where the query time exponent approaches 1-Θ(1/log s) as the sample fraction increases for both the lower bound and the proposed algorithm in the case of half-uniform distributions.", "section": "Statistical-Computational Trade-offs"}]