[{"figure_path": "TuspoNzIdB/figures/figures_4_1.jpg", "caption": "Figure 1: Overview of Hydra. (a) Schematic representation of the space of energetically plausible density maps in a heterogeneous cryo-EM dataset. We approximate this space with a finite union of low-dimensional manifolds. The compositional states (or classes) are labeled by k. The \"conformation\" within class k refers to intrinsic coordinates within the k-th manifold. (b) Optimization pipeline. The conformations, poses, class probabilities and neural fields are optimized such as to maximize the likelihood of the observed images (\"picked particles\") under the model described in Section 3.3.", "description": "This figure provides a visual summary of the Hydra method for heterogeneous reconstruction in cryo-EM. Panel (a) illustrates the concept of approximating the space of possible density maps as a union of low-dimensional manifolds, each representing a compositional state (k). Panel (b) shows the optimization pipeline where conformations, poses, class probabilities, and neural fields are jointly optimized to maximize the likelihood of the observed images.", "section": "3 Methods"}, {"figure_path": "TuspoNzIdB/figures/figures_6_1.jpg", "caption": "Figure 2: Hydra captures strong compositional heterogeneity in the tomotwin3 dataset. (a-c) Reconstructed densities and estimated conformations with K∈ {1,3,5}. We report the number of particles in each class between parenthesis. We represent density maps using isosurfaces. (a) With K = 1 (DRGN-AI), the model fails to reconstruct the three density maps, in spite of using d = 8 dimensions to represent conformations. (b) With K = 3 (d = 2), Hydra recovers the three density maps with perfect classification accuracy. (c) With K = 5 (d = 2), the model is over-parameterized and 2 classes out of 5 end up empty at the end of optimization. (d) Ground truth density maps for the tomotwin3 dataset.", "description": "This figure demonstrates Hydra's ability to resolve compositional heterogeneity in a synthetic dataset.  It compares results using different numbers of neural fields (K=1, 3, 5) and shows that Hydra (K=3) accurately reconstructs three distinct protein structures while DRGN-AI (K=1) and an over-parameterized Hydra (K=5) fail to do so. The ground truth structures are also displayed.", "section": "4.1 Ab initio reconstruction of compositional heterogeneity"}, {"figure_path": "TuspoNzIdB/figures/figures_7_1.jpg", "caption": "Figure 3: Hydra captures compositional heterogeneity in a real dataset containing a mixture of membrane and soluble protein complexes. (a) Density maps obtained with Hydra (K = 4) on the Ryanodine receptor dataset. (b) Confusion matrix between Hydra and cryoSPARC K = 6 heterogeneous refinement (three classes representing RyR were combined for analysis). (c) Fourier shell correlation (FSC) between the Hydra density maps and refined cryoSPARC density maps. (d) Left: latent space plot and right: representative density maps from each of the latent space clusters from DRGN-AI.", "description": "This figure demonstrates Hydra's ability to resolve compositional heterogeneity in a real-world dataset of a protein mixture from red blood cells.  Panel (a) shows the 3D density maps of different protein complexes (RyR, p97, CIII) and junk obtained by Hydra. Panel (b) provides a confusion matrix comparing Hydra's classification to that of cryoSPARC's heterogeneous refinement. Panel (c) displays the Fourier Shell Correlation (FSC) curves, showing the resolution achieved by Hydra compared to cryoSPARC. Finally, Panel (d) contrasts Hydra's results with those from DRGN-AI, highlighting Hydra's superior performance in resolving both compositional and conformational heterogeneity.", "section": "4.2 Ab initio reconstruction of an experimental cryo-EM mixture dataset"}, {"figure_path": "TuspoNzIdB/figures/figures_8_1.jpg", "caption": "Figure 4: Hydra effectively recovers both compositional and conformational heterogeneity in the ribosplike dataset. Particles within each latent space are colored by class. Representative density maps are generated from the latent points denoted in white dots.", "description": "This figure demonstrates Hydra's ability to simultaneously capture compositional and conformational heterogeneity. It shows three distinct classes of macromolecules (spliceosome, ribosome, and spike protein) each exhibiting conformational variability. The latent space (low-dimensional representation of conformations) is plotted for each class.  The density maps, generated from points in latent space, illustrate the range of conformations within each class. The color-coding of particles in latent space further emphasizes the separation achieved by Hydra, showing distinct clusters for each macromolecule type.", "section": "4.3 Ab initio reconstruction of conformational and compositional heterogeneity"}, {"figure_path": "TuspoNzIdB/figures/figures_18_1.jpg", "caption": "Figure 1: Overview of Hydra. (a) Schematic representation of the space of energetically plausible density maps in a heterogeneous cryo-EM dataset. We approximate this space with a finite union of low-dimensional manifolds. The compositional states (or classes) are labeled by k. The \"conformation\" within class k refers to intrinsic coordinates within the k-th manifold. (b) Optimization pipeline. The conformations, poses, class probabilities and neural fields are optimized such as to maximize the likelihood of the observed images (\"picked particles\") under the model described in Section 3.3.", "description": "This figure illustrates the Hydra model for heterogeneous cryo-EM reconstruction. Panel (a) shows a schematic representation of the space of possible density maps as a union of low-dimensional manifolds, where each manifold represents a compositional state (k) and the conformations within each state are parameterized by intrinsic coordinates (z). Panel (b) depicts the optimization pipeline, illustrating how conformations (z), poses (φ), class probabilities (p(k)), and neural fields (θ) are jointly optimized to maximize the likelihood of the observed images.", "section": "3 Methods"}, {"figure_path": "TuspoNzIdB/figures/figures_18_2.jpg", "caption": "Figure 2: Hydra captures strong compositional heterogeneity in the tomotwin3 dataset. (a-c) Reconstructed densities and estimated conformations with K∈ {1,3,5}. We report the number of particles in each class between parenthesis. We represent density maps using isosurfaces. (a) With K = 1 (DRGN-AI), the model fails to reconstruct the three density maps, in spite of using d = 8 dimensions to represent conformations. (b) With K = 3 (d = 2), Hydra recovers the three density maps with perfect classification accuracy. (c) With K = 5 (d = 2), the model is over-parameterized and 2 classes out of 5 end up empty at the end of optimization. (d) Ground truth density maps for the tomotwin3 dataset.", "description": "This figure demonstrates the effectiveness of Hydra in resolving compositional heterogeneity.  It shows the results of reconstructing three different protein structures (6up6, 6id1, 4cr2) from a mixed dataset, using different numbers of neural fields (K).  When using only one neural field (K=1, like the prior work DRGN-AI), Hydra fails to recover the individual protein structures. However, when using three neural fields (K=3), Hydra accurately reconstructs each individual structure. Using too many fields (K=5) leads to overfitting and inaccurate results.", "section": "4.1 Ab initio reconstruction of compositional heterogeneity"}, {"figure_path": "TuspoNzIdB/figures/figures_18_3.jpg", "caption": "Figure 2: Hydra captures strong compositional heterogeneity in the tomotwin3 dataset. (a-c) Reconstructed densities and estimated conformations with K∈ {1,3,5}. We report the number of particles in each class between parenthesis. We represent density maps using isosurfaces. (a) With K = 1 (DRGN-AI), the model fails to reconstruct the three density maps, in spite of using d = 8 dimensions to represent conformations. (b) With K = 3 (d = 2), Hydra recovers the three density maps with perfect classification accuracy. (c) With K = 5 (d = 2), the model is over-parameterized and 2 classes out of 5 end up empty at the end of optimization. (d) Ground truth density maps for the tomotwin3 dataset.", "description": "This figure demonstrates the ability of Hydra to reconstruct compositional heterogeneity using a synthetic dataset (tomotwin3) containing three different protein structures.  Panel (a) shows that with only one neural field (K=1), Hydra (which is an extension of DRGN-AI) cannot distinguish the three components. Panel (b) shows that with three neural fields (K=3), Hydra perfectly recovers the three components. Panel (c) shows that with five neural fields (K=5), the model becomes over-parameterized and fails to accurately identify the different components. Panel (d) shows the ground truth densities. This highlights Hydra's ability to accurately classify and reconstruct components when the correct number of neural fields is used.", "section": "4.1 Ab initio reconstruction of compositional heterogeneity"}, {"figure_path": "TuspoNzIdB/figures/figures_19_1.jpg", "caption": "Figure 3: Hydra captures compositional heterogeneity in a real dataset containing a mixture of membrane and soluble protein complexes. (a) Density maps obtained with Hydra (K = 4) on the Ryanodine receptor dataset. (b) Confusion matrix between Hydra and cryoSPARC K = 6 heterogeneous refinement (three classes representing RyR were combined for analysis). (c) Fourier shell correlation (FSC) between the Hydra density maps and refined cryoSPARC density maps. (d) Left: latent space plot and right: representative density maps from each of the latent space clusters from DRGN-AI.", "description": "This figure demonstrates Hydra's ability to resolve compositional heterogeneity in a real-world dataset of a mixture of protein complexes.  Panel (a) shows the reconstructed density maps for each class identified by Hydra. Panel (b) presents a confusion matrix comparing Hydra's classification with that of cryoSPARC, highlighting the accuracy of Hydra's class assignments. Panel (c) illustrates the Fourier shell correlation (FSC) between density maps obtained from Hydra and cryoSPARC, assessing the quality of the reconstructions. Finally, Panel (d) showcases a comparison with DRGN-AI, highlighting Hydra's superior performance in resolving complex mixtures.", "section": "4.2 Ab initio reconstruction of an experimental cryo-EM mixture dataset"}, {"figure_path": "TuspoNzIdB/figures/figures_19_2.jpg", "caption": "Figure 4: Hydra effectively recovers both compositional and conformational heterogeneity in the ribosplike dataset. Particles within each latent space are colored by class. Representative density maps are generated from the latent points denoted in white dots.", "description": "This figure shows the results of applying the Hydra method to the ribosplike dataset, a synthetic dataset designed to test the model's ability to handle both compositional and conformational heterogeneity. The figure demonstrates the model's ability to successfully separate particles into their respective classes and capture the range of conformations within each class. Each latent space is color-coded by class, and representative density maps are generated from points in each space to illustrate the diversity of conformations.", "section": "4.3 Ab initio reconstruction of conformational and compositional heterogeneity"}, {"figure_path": "TuspoNzIdB/figures/figures_20_1.jpg", "caption": "Figure 3: Hydra captures compositional heterogeneity in a real dataset containing a mixture of membrane and soluble protein complexes. (a) Density maps obtained with Hydra (K = 4) on the Ryanodine receptor dataset. (b) Confusion matrix between Hydra and cryoSPARC K = 6 heterogeneous refinement (three classes representing RyR were combined for analysis). (c) Fourier shell correlation (FSC) between the Hydra density maps and refined cryoSPARC density maps. (d) Left: latent space plot and right: representative density maps from each of the latent space clusters from DRGN-AI.", "description": "This figure demonstrates Hydra's ability to resolve compositional heterogeneity in a real-world cryo-EM dataset.  Panel (a) shows the density maps reconstructed by Hydra, revealing four distinct components (K=4). Panel (b) compares Hydra's classification results with those from cryoSPARC, showing strong agreement. Panel (c) illustrates the high resolution achieved by Hydra using FSC, a measure of density map quality. Finally, Panel (d) contrasts Hydra's performance with the DRGN-AI method, highlighting Hydra's superior capacity for resolving complex mixtures.", "section": "4.2 Ab initio reconstruction of an experimental cryo-EM mixture dataset"}, {"figure_path": "TuspoNzIdB/figures/figures_21_1.jpg", "caption": "Figure 3: Hydra captures compositional heterogeneity in a real dataset containing a mixture of membrane and soluble protein complexes. (a) Density maps obtained with Hydra (K = 4) on the Ryanodine receptor dataset. (b) Confusion matrix between Hydra and cryoSPARC K = 6 heterogeneous refinement (three classes representing RyR were combined for analysis). (c) Fourier shell correlation (FSC) between the Hydra density maps and refined cryoSPARC density maps. (d) Left: latent space plot and right: representative density maps from each of the latent space clusters from DRGN-AI.", "description": "This figure shows the results of applying Hydra to a real dataset containing a mixture of membrane and soluble protein complexes. Panel (a) displays the density maps obtained using Hydra with 4 classes. Panel (b) presents a confusion matrix comparing Hydra's classification results with those obtained from a cryoSPARC analysis with 6 classes. Panel (c) illustrates the Fourier Shell Correlation (FSC) between density maps generated by Hydra and those refined using cryoSPARC. Finally, panel (d) shows a latent space plot and representative density maps from DRGN-AI, a competing method, to highlight the differences in their ability to capture compositional heterogeneity.", "section": "4.2 Ab initio reconstruction of an experimental cryo-EM mixture dataset"}, {"figure_path": "TuspoNzIdB/figures/figures_21_2.jpg", "caption": "Figure S7: The typical processing workflow of generating a consensus reconstruction followed by DRGN-AI heterogeneous reconstruction fails to capture the shape of non-RyR densities, as the cryoSPARC consensus reconstruction conceals compositional heterogeneity and yields a high-resolution density for RyR only. (a) Homogeneous refinement of the entire ryanodine receptor dataset against a cryoSPARC ab initio K = 1 alignment of the entire dataset (left); right: FSC curve. (b) single-class DRGN-AI fixed pose with poses from the cryoSPARC homogeneous refinement; left: densities from k-means 20 sampling of the latent space; right: latent space plots.", "description": "This figure compares the results of two different approaches for cryo-EM data processing: cryoSPARC homogeneous refinement followed by DRGN-AI fixed pose. The cryoSPARC homogeneous refinement failed to capture non-RyR densities due to its inability to handle compositional heterogeneity. Conversely, the DRGN-AI fixed pose approach, while achieving high-resolution RyR density, still didn't capture non-RyR structures effectively.", "section": "4.2 Ab initio reconstruction of an experimental cryo-EM mixture dataset"}, {"figure_path": "TuspoNzIdB/figures/figures_21_3.jpg", "caption": "Figure 3: Hydra captures compositional heterogeneity in a real dataset containing a mixture of membrane and soluble protein complexes. (a) Density maps obtained with Hydra (K = 4) on the Ryanodine receptor dataset. (b) Confusion matrix between Hydra and cryoSPARC K = 6 heterogeneous refinement (three classes representing RyR were combined for analysis). (c) Fourier shell correlation (FSC) between the Hydra density maps and refined cryoSPARC density maps. (d) Left: latent space plot and right: representative density maps from each of the latent space clusters from DRGN-AI.", "description": "Figure 3 shows the results of applying Hydra to a real dataset containing a mixture of different protein complexes (Ryanodine receptor, p97, and complex III). Panel (a) shows the density maps generated by Hydra, which successfully separates the protein complexes. Panel (b) presents a confusion matrix comparing the classification accuracy of Hydra and cryoSPARC. Panel (c) shows the Fourier shell correlation (FSC) curve, illustrating the quality of reconstruction of Hydra. Finally, panel (d) contrasts the results of Hydra with DRGN-AI, highlighting Hydra's ability to successfully capture the compositional heterogeneity of the dataset.", "section": "4.2 Ab initio reconstruction of an experimental cryo-EM mixture dataset"}, {"figure_path": "TuspoNzIdB/figures/figures_22_1.jpg", "caption": "Figure 3: Hydra captures compositional heterogeneity in a real dataset containing a mixture of membrane and soluble protein complexes. (a) Density maps obtained with Hydra (K = 4) on the Ryanodine receptor dataset. (b) Confusion matrix between Hydra and cryoSPARC K = 6 heterogeneous refinement (three classes representing RyR were combined for analysis). (c) Fourier shell correlation (FSC) between the Hydra density maps and refined cryoSPARC density maps. (d) Left: latent space plot and right: representative density maps from each of the latent space clusters from DRGN-AI.", "description": "This figure demonstrates the results of applying Hydra to an experimental dataset of a protein mixture from red blood cell lysate.  Panel (a) shows the density maps generated by Hydra, with 4 compositional states (K=4). Panel (b) provides a confusion matrix comparing Hydra's classification to that of a cryoSPARC analysis. Panel (c) displays the Fourier Shell Correlation (FSC) values showing a high level of agreement between Hydra and cryoSPARC. Finally, panel (d) shows a comparison to DRGN-AI, highlighting Hydra's superior ability to discern distinct protein complexes and conformational heterogeneity.", "section": "4.2 Ab initio reconstruction of an experimental cryo-EM mixture dataset"}]