[{"type": "text", "text": "Continuous Partitioning for Graph-Based Semi-Supervised Learning ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Chester Holtz ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Pengwen Chen ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Haliciogˇlu Data Science Institute   \nUniversity of California San Diego La Jolla, CA chholtz@ucsd.edu ", "page_idx": 0}, {"type": "text", "text": "Department of Applied Mathematics National Chung Hsing University South District, Taichung, Taiwan pengwen@email.nchu.edu.tw ", "page_idx": 0}, {"type": "text", "text": "Zhengchao Wan ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Chung-Kuan Cheng ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Department of Mathematics University of Missouri Columbia, MO zwan@missouri.edu ", "page_idx": 0}, {"type": "text", "text": "Department of Computer Science   \nUniversity of California San Diego La Jolla, CA ckcheng@ucsd.edu Gal Mishne   \nHaliciogˇlu Data Science Institute   \nUniversity of California San Diego La Jolla, CA gmishne@ucsd.edu ", "page_idx": 0}, {"type": "text", "text": "", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Laplace learning algorithms for graph-based semi-supervised learning have been shown to suffer from degeneracy at low label rates and in imbalanced class regimes. Here, we propose CutSSL: a framework for graph-based semi-supervised learning based on continuous nonconvex quadratic programming, which provably obtains integer solutions. Our framework is naturally motivated by an exact quadratic relaxation of a cardinality-constrained minimum-cut graph partitioning problem. Furthermore, we show our formulation is related to an optimization problem whose approximate solution is the mean-shifted Laplace learning heuristic, thus providing new insight into the performance of this heuristic. We demonstrate that CutSSL significantly surpasses the current state-of-the-art on $k$ -nearest neighbor graphs and large real-world graph benchmarks across a variety of label rates, class imbalance, and label imbalance regimes. Our implementation is available on github1. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "In semi-supervised learning (SSL), a learner is given access to a partially-labeled training set consisting of labeled examples and unlabeled examples. The goal in this setting is to learn a predictor that is superior to a predictor that is trained using the labeled examples alone. This framework is motivated by the high cost of obtaining annotated data on practical problems. For problems where very few labels are available, the geometry of the unlabeled data can be used to significantly improve the performance of classic machine learning models. A seminal work in graph-based semi-supervised learning is Laplace learning [38], which seeks a harmonic function that extends provided labels over the unlabeled vertices (a harmonic extension of the labeled vertices). Laplace learning and its variants have been widely applied in semi-supervised and graph-structured learning [37, 36, 2, 20]. ", "page_idx": 0}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "However, recent work [26, 1] has demonstrated that ‘vanilla’ Laplace learning methods exhibit poor prediction error at low label rates, primarily due to degenerate estimates near the decision boundary—although this can be partially addressed in practice via a simple mean-shift of the predictions [10]. Furthermore, in the context of classification, the labels often correspond to elements from a discrete set. In this setting, typically a thresholding operation is applied post hoc to the harmonic extension to map from continuous predictions to the discrete set of labels. This thresholding can further exacerbate the aforementioned degeneracy. Furthermore, when class sizes are imbalanced, approximate heuristics are often employed to ensure satisfaction of the volume (class-cardinality) prior [10, 19]. In particular, [19] apply efficient auction algorithms [5] to volume-constrained semisupervised learning. They do this by iteratively solving linearizations of a quadratic problem under volume and box constraints to reach a local solution. The authors claim convergence to a local solution due to monotonic decrease of the objective, although local solutions may be poor and convergence can be slow. ", "page_idx": 1}, {"type": "text", "text": "In this paper, we formulate cardinality-constrained semi-supervised learning as a nonconvex quadratic program, a generalization of the assignment problem. Notably, in contrast to semidefinite or spectral relaxations, our formulation is exact in that it has a $0-1$ minimizer corresponding to a maximally smooth discrete label assignment. Furthermore, our method has connections to spectral graph partitioning and the mean-shift Laplace learning heuristic. ", "page_idx": 1}, {"type": "text", "text": "Our method involves solving a sequence of quadratic programs via Alternating Direction Method of Multipliers (ADMM) [7], which exhibits robust convergence guarantees, having also been applied successfully to Quadratic Assignment Problems and similar Semi-Definite Program (SDP)-based relaxations of nonconvex Boolean constrained problems [24]. As we will show, the ADMM iterates can be solved efficiently, particularly when the underlying graph is sparsely connected. ", "page_idx": 1}, {"type": "text", "text": "Our contributions are as follows: ", "page_idx": 1}, {"type": "text", "text": "1. We introduce a framework derived from an exact formulation of a cardinality-constrained graph partitioning problem with supervision, a non-degenerate problem in the unlabeled data limit. We also prove sufficient conditions for exact recovery of integer solutions. ", "page_idx": 1}, {"type": "text", "text": "2. Numerically, we develop a scalable and convergent iterative method based on ADMM and demonstrate superior performance and scalability in low, medium, high, and imbalanced label rate and data regimes on $k$ -NN graphs (MNIST, Fashion-MNIST, and Cifar-10) as well as Planetoid citation networks and large-scale (160k-2.5M nodes) OGB graphs compared to state-of-the-art graph-based SSL algorithms. ", "page_idx": 1}, {"type": "text", "text": "3. We describe a connection to Laplace learning, and derive a simple and intuitive explanation for the efficacy of the mean-shift heuristic. ", "page_idx": 1}, {"type": "text", "text": "2 Preliminaries ", "text_level": 1, "page_idx": 1}, {"type": "text", "text": "In this section, we review graph semi-supervised learning, Laplace learning, the combinatorial minimum cut problem, and an associated continuous extension. ", "page_idx": 1}, {"type": "text", "text": "2.1 Laplace learning ", "text_level": 1, "page_idx": 1}, {"type": "text", "text": "Let $V=\\{v_{1},v_{2},\\dots,v_{M}\\}$ denote the $M$ vertices of the graph $G$ with weight matrix $W$ whose entries $w_{i j}\\geq0$ are the edge weights between $v_{i}$ and $v_{j}$ . We assume the graph is symmetric, i.e., $w_{i j}=w_{j i}$ . We define the degree $\\begin{array}{r}{d_{i}\\stackrel{\\bullet}{=}\\sum_{j=1}^{n}w_{i j}}\\end{array}$ . Without loss of generality, we assume the first $m$ vertices $l=\\{v_{1},v_{2},\\ldots,v_{m}\\}$ are assigned labels $\\left\\{\\mathbf{y}_{1},\\mathbf{y}_{2},\\dots,\\mathbf{y}_{m}\\right\\}$ , where $0<m\\ll M$ . In the context of $k$ -class classification we take each $\\mathbf{y}_{i}$ to be one of the $k$ standard basis vectors $\\{\\mathbf{e}_{1},\\mathbf{e}_{2},\\ldots,\\mathbf{e}_{k}\\}$ of the form ${\\bf e}_{i}=(0,\\dots0,1,0,\\dots,0)$ , i.e. a one-hot row vector. Let $n$ denote the number of unlabeled vertices, i.e. $n=M-m$ . The problem of graph-based semi-supervised learning is to smoothly propagate the labels over the unlabeled vertices $\\bar{u}=\\{v_{m+1},v_{m+2},\\bar{\\ldots},v_{M}\\}$ . ", "page_idx": 1}, {"type": "text", "text": "Given a graph and a set of labeled vertices, the solution of Laplace learning [38], is the minimizer of the following quadratic program with label constraints $(X_{0})_{i}=y_{i}$ : ", "page_idx": 2}, {"type": "equation", "text": "$$\n\\operatorname*{min}_{X_{0}\\in\\mathbb{R}^{M\\times k}}\\left\\{\\operatorname{tr}(X_{0}^{\\top}{\\mathcal L}X_{0}):(X_{0})_{i}=y_{i},\\,1\\leq i\\leq m\\right\\},\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "where $X_{0}\\,\\in\\,\\mathbb{R}^{M\\times k}$ , $\\mathcal{L}$ is the combinatorial graph Laplacian given by $\\mathcal{L}=D-W$ , where $D=$ $\\mathrm{diag}(W{\\bf1}_{M})$ is a diagonal matrix whose elements are the node degrees, The prediction for vertex $v_{i}$ is determined by a heuristic of thresholding the largest component of $(X_{0})_{i}$ : ", "page_idx": 2}, {"type": "equation", "text": "$$\n\\underset{j\\in\\{1,\\dots,k\\}}{\\arg\\operatorname*{max}}\\left\\{(X_{0})_{i j}\\right\\}.\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "Note that Laplace learning is also called label propagation $(L P)$ [39], since the Laplace equation associated with (1), can be solved by repeatedly replacing $(X_{0})_{i}$ with a weighted average of its neighbors. Let $\\begin{array}{r}{\\mathcal{L}=\\left[\\begin{array}{c c}{L_{l}}&{L_{l u}}\\\\ {L_{u l}}&{L_{u}}\\end{array}\\right]}\\end{array}$ and $\\boldsymbol{X_{0}}=\\left[\\begin{array}{l}{\\boldsymbol{X_{l}}}\\\\ {\\boldsymbol{X_{u}}}\\end{array}\\right]$ where $l$ and $u$ correspond to labeled and unlabeled indices, respectively. For brevity, we denote $X=X_{u}$ and $Y=X_{l}$ . The solution $\\hat{X}$ satisfies the linear system ", "page_idx": 2}, {"type": "equation", "text": "$$\nL_{u}\\hat{X}=B:=-L_{u l}Y.\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "Although Laplace learning and related algorithms work well when the number of labeled examples is sufficient, these algorithms generally suffer from two drawbacks: (1.) they typically solve a relaxation such that rather than predicting categorical values (e.g., binary one hot-encodings), they assign a real value for each class. A heuristic (usually thresholding) is necessarily applied to determine the predicted categorical label. (2.) In the low label rate regime, Laplace learning degenerates, yielding homogeneous predictions. Thus, thresholding results in poor prediction. In contrast, we propose an approach derived from a non-degenerate problem and coupled with a method to ensure exact combinatorial predictions, removing the need for heuristic thresholding. ", "page_idx": 2}, {"type": "text", "text": "2.2 Graph partitioning ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Given a graph $G=(W,V)$ , consider the discrete, cardinality-constrained graph partitioning problem ", "page_idx": 2}, {"type": "equation", "text": "$$\n\\operatorname*{min}_{P\\subseteq V}\\left\\{\\operatorname{Cut}(P,P^{c}):=\\sum_{v_{i}\\in P}\\sum_{v_{j}\\in P^{c}}w_{i j}\\right\\}\\;\\mathrm{~s.t.~}|P|=m_{1}\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "Critically, we note that this combinatorial problem is non-degenerate when $m\\ll n$ , if $m_{1}<n$ , due to the cardinality constraint on the solution [30]. Algorithms and solutions to this problem have been thoroughly studied, particularly in the context of neighborhood graphs and for formulations that replace the constraint $|P|=m_{1}$ with a penalty on the imbalance between partitions. ", "page_idx": 2}, {"type": "text", "text": "The applications of graph partitioning-inspired methods to data science are well-known, particularly various relaxations of graph cut problems, including spectral methods [31, 4], combinatorial algorithms [21, 13], and semi-definite programs (SDPs) [16, 25]. However, key drawbacks of these methods include the inexactness of the relaxation (spectral methods), high computational price due to a large number of constraints (SDPs), or slow convergence (combinatorial algorithms). ", "page_idx": 2}, {"type": "text", "text": "On the other hand, while exact continuous nonconvex formulations for graph partitioning have been studied [17], as far as we are aware, no attempts have been made to design efficient algorithms amenable to $k$ -way partitioning of large-scale datasets with partial label information. In particular, the $k$ -way graph cut generalization was studied in [17]. The developed algorithms are based on a piecewise linear refinement of an initial, continuous-valued solution to one that is integer-valued and a local minimizer of a certain nonconvex relaxation (Theorem 2.1 in their paper). These algorithms guarantee an integer solution that exhibits a valid cut with objective value greater than that of the continuous-valued extension used to initialize their method. However, note that these algorithms are prohibitively expensive, e.g., potentially requiring exhaustive search over $3^{n^{2}}$ feasible “path matrices\". ", "page_idx": 2}, {"type": "text", "text": "2.3 Graph cuts and continuous quadratic programming ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Here we restate the discrete graph partitioning problem in a form more amenable for continuous quadratic optimization, i.e. as a continuous optimization problem over $\\mathbf{x}\\in\\mathbb{R}^{M}$ . Later, we will see that this problem bears similarities to the Laplace learning problem in that the two share the same objective, but the graph partitioning problem involves additional constraints. ", "page_idx": 2}, {"type": "text", "text": "", "page_idx": 3}, {"type": "text", "text": "For simplicity, we first introduce a bipartitioning framework, $V_{0}(\\mathbf{x}):=\\{v_{i}:\\mathbf{x}_{i}=0\\}$ , $V_{1}(\\mathbf{x}):=$ $\\{v_{j}:\\mathbf{x}_{j}^{\\bar{}}=\\dot{1}\\}$ characterized by a binary vector $\\mathbf{\\bar{x}}\\in\\{0,1\\}^{M}$ . Equivalently, each binary vector $\\mathbf{x}$ determines an edge set $E_{x}=\\left\\{(i,j):\\grave{\\mathbf{x}_{i}}=0,\\mathbf{x}_{j}=1\\right\\}$ connecting two subsets $V_{0}(\\mathbf{x}),\\dot{V_{1}}(\\mathbf{x})$ . The cardinality-constrained min-cut solution is the binary vector $\\mathbf{x}$ satisfying $\\textstyle\\sum_{i}\\mathbf{x}_{i}={\\dot{m}}_{1}$ ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\underset{{\\bf x}\\in\\{0,1\\}^{M}}{\\arg\\operatorname*{min}}\\,\\left\\{\\bigl({\\bf1}_{M}-{\\bf x}\\bigr)^{\\top}W{\\bf x}\\right\\}=\\underset{{\\bf x}\\in\\{0,1\\}^{M}}{\\arg\\operatorname*{min}}\\,\\sum_{(i,j)\\in{\\cal E}_{x}}w_{i j}.\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "The equality is due to both terms being equal, i.e. $\\begin{array}{r}{\\left(\\mathbf{1}_{M}-\\mathbf{x}\\right)^{\\top}W\\mathbf{x}=\\sum_{(i,j)\\in E_{x}}w_{i j}}\\end{array}$ , over the set of binary vectors. Next, note that when $\\mathbf{x}$ is binary, $(\\mathbf{1}_{M}-\\mathbf{x})^{\\top}S\\mathbf{x}=0$ for any diagonal matrix $S$ . Hence, min-cut is equivalent to ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\operatorname*{min}_{\\mathbf{x}\\in\\{0,1\\}^{M}}\\{\\big(\\mathbf{1}_{M}-\\mathbf{x}\\big)^{\\top}(W+S)\\mathbf{x}\\}\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "The theoretical aspects of this perturbed problem were investigated in [17]. However, an algorithm to solve this problem was left as future work. ", "page_idx": 3}, {"type": "text", "text": "For completeness, we review the multi-partition generalization before proposing an efficient iterative scheme in Section 3. In particular, the choice of $S$ is characterized in [17] as a way to provide a tighter relaxation from the set of binary vectors to the real-valued box set $[0,1]^{M}$ . Essentially, the term $x^{\\top}S x$ acts as a regularizer. For instance, take $S\\,=\\,I$ . The maximizer of the quadratic $\\boldsymbol{x}^{\\top}\\boldsymbol{S}\\boldsymbol{x}=\\boldsymbol{x}^{\\top}\\boldsymbol{x}=||\\boldsymbol{x}||_{2}^{2}$ on the simplex $\\{x\\in[0,1]\\;\\;:\\;\\;\\sum_{i}x_{i}=1\\}$ are the extreme points of the simplex, i.e. the one-hot vectors. Hager and Krylyuk [17] rigorously proved that the larger the entries of $S$ , the tighter the relaxation, but the number of stationary points grows. The key condition that must be satisfied by $S$ is stated in Theorem 2.1 of [17]: $S_{i i}+S_{j j}\\,\\geq2w_{i j}$ which ensures that the min-cut problem with cardinality constraint on $V_{1}$ coincides with the following continuous quadratic optimization problem, ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\operatorname*{min}_{\\mathbf x\\in\\mathbb R^{M}}\\!\\left(\\mathbf1_{M}-\\mathbf x\\right)^{\\top}\\!(W+S)\\mathbf x\\quad\\mathrm{s.t.}\\ 0\\leq\\mathbf x_{i}\\leq1,\\quad\\mathbf1_{M}^{\\top}\\!\\mathbf x=m_{1}=|V_{1}|\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "Given $S\\neq0_{n\\times n}$ , an essential question is how to compute a solution to (7). Note that it is no longer a convex problem. Intuitively, given some quadratic (e.g., parameterized by $W$ ) with a minimum in the interior of the simplex, perturbing $W$ by $S$ results in a new, indefinite or concave quadratic with a minimum at a vertex of the simplex. ", "page_idx": 3}, {"type": "text", "text": "Our proposed framework is based on constructing a homotopy path, e.g. with $S\\,=\\,s D$ for some parameter $s$ in (7), to find high-quality stationary points at extreme points of the simplex. In other words, our proposed method computes $\\left[x(s_{0})\\right]$ for some small $s_{0}$ , and then uses $x(s_{0})$ as initialization to reach $x(s)$ for a larger value $s$ , until solutions are within some small radius $\\epsilon$ of an integral solution. By controlling the magnitude of $s$ , we control the number of critical points that trap iterative methods. ", "page_idx": 3}, {"type": "text", "text": "We illustrate these principles in Figure 1, where we visualize the level sets of the 2-d quadratic $f(x,y)=(x-0.8)^{2}-(\\dot{y}-0.2)^{2}\\stackrel{\\textstyle<}{-}s(x^{2}+y^{2})$ on the simplex $\\{(x,y)\\in[0,1]^{2}:x+y=1\\}$ for various choices of $s$ . Note that when $s=0$ , the quadratic is convex and the minimum lies in the interior of the simplex. As $s$ increases, the quadratic becomes indefinite, and eventually concave on the simplex (i.e. when $s=10$ ). As $s$ increases, the local minima on the simplex gravitate towards the “corners” (one-hot labels) until both “corners” become local minima in the extreme case. ", "page_idx": 3}, {"type": "text", "text": "3 Graph Partitioning for SSL ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "In this section, we generalize semi-supervised bi-partitioning (2-class SSL) to $k$ -way partitioning (multi-class SSL). This yields a constrained optimization problem over $n\\times k$ real-valued matrices. We generalize the previous framework to incorporate label information, introduce the conditions necessary for recovering binary-valued solutions, and develop our CutSSL algorithm. ", "page_idx": 3}, {"type": "text", "text": "3.1 Semi-supervised $k$ -way partitioning ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Before introducing label information, we transition from the bipartitioning to the $k$ -way partitioning setting. The following maximization problem, introduced in [17], is interpreted as the maximization ", "page_idx": 3}, {"type": "image", "img_path": "hCOuip5Ona/tmp/14488b2a3debcf20127161217aee736b447330792dca387b142e8022ffc3f441.jpg", "img_caption": [], "img_footnote": [], "page_idx": 4}, {"type": "text", "text": "Figure 1: Effect of perturbing $L$ by $S$ on minimizers of (10) on the simplex. Shade of level-curves denotes descent direction. Blue dots denote unique minimizers in the simplex. As the magnitude of the perturbation increases, the minimzers gravitate towards the extreme points of the simplex. ", "page_idx": 4}, {"type": "text", "text": "of the sum of intra-partition edge weights. ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\operatorname*{max}_{X\\in\\mathbb R^{M\\times k}}\\mathrm{tr}(X^{\\top}(W+S)X)\\quad\\mathrm{s.t.~}X^{\\top}\\mathbf{1}_{M}=\\mathbf{m},~X\\mathbf{1}_{k}=\\mathbf{1}_{M},~X\\geq0.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Here, the entries of the vector $\\mathbf{m}\\in\\mathbb{R}^{k}$ denote the given cardinalities of each class and $\\mathbf{1}_{k}^{\\top}\\mathbf{m}=M$ , the number of all examples. ", "page_idx": 4}, {"type": "text", "text": "To motivate the introduction of labels to the cardinality-constrained cut problem, we relate the objective of (8) with the perturbed Laplacian quadratic form: ", "page_idx": 4}, {"type": "text", "text": "Proposition 3.1 (Equivalent binary minimizers). Let $H_{S}(X)=t r(X^{\\top}({\\mathcal{L}}-S)X)$ be the quadratic form associated with the Laplacian, and let $G_{S}$ be the objective of (8), $G_{S}=t r(X^{\\top}(W+S)X)$ . Then, we have that ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\arg\\operatorname*{max}\\{G_{S}(X):X\\in\\Omega\\}=\\arg\\operatorname*{min}\\{H_{S}(X):X\\in\\Omega\\}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "equation", "text": "$$\n\\Omega=\\{X\\in\\mathbb{R}^{M\\times k}:X_{i,j}\\in\\{0,1\\},\\quad X^{\\top}\\mathbf{1}_{M}=\\mathbf{m}\\}.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Proof. Observe that ", "page_idx": 4}, {"type": "equation", "text": "$$\nH_{S}(X)+G_{S}(X)=\\langle X,D X\\rangle=||D\\mathbf{1}_{M}||_{1}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "is a constant and the minimizers and maximizers coincide. ", "page_idx": 4}, {"type": "text", "text": "The Laplace learning solution (3) alongside this proposition motivates the following Laplacian quadratic objective with perturbation $S$ , which we term CutSSL. This is our key formulation. ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\underset{X\\in\\mathbb{R}^{n\\times k}}{\\operatorname*{min}}\\left\\{F_{s}(X):=\\frac{1}{2}\\mathrm{tr}(X^{\\top}(L_{u}-S)X)-\\mathrm{tr}(X^{\\top}B)\\right\\}}\\\\ &{\\;\\;\\mathrm{s.t.}\\;\\;\\;\\;\\;X^{\\top}\\mathbf{1}_{n}=\\mathbf{m},\\;\\;X\\mathbf{1}_{k}=\\mathbf{1}_{n},\\;\\;X\\geq0,}\\end{array}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "In practice for the homotopy path, we take $S=s D$ , where we have for any feasible $X_{\\Omega}\\in\\Omega$ , ", "page_idx": 4}, {"type": "equation", "text": "$$\nF_{s}(X_{\\Omega})=F_{0}(X_{\\Omega})-s||D^{1/2}X_{\\Omega}||_{F}^{2}=F_{0}(X_{\\Omega})-s||D m||_{1}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Thus, any binary minimizer of (10) with $s~=~0$ is also a binary minimizer with $s~>~0$ . For brevity denote $L_{u,s}\\;=\\;L_{u}\\;-\\;s D$ . For real-valued $X$ , we have that the objective is $F_{s}(X)\\,=$ $F_{0}(X)-s||D^{1/2}\\dot{X}||_{F}^{2}$ . The quadratic term of the objective $F_{s}$ satisfies ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\operatorname{tr}(X^{\\top}L_{u,s}X)=\\operatorname{tr}(X^{\\top}((1-s)D_{u}-W_{u})X)=(1-s)\\sum_{i}(d_{u})_{i}\\|X_{i}\\|_{2}^{2}-\\sum_{i j}(w_{u})_{i j}\\langle X_{i},X_{j}\\rangle.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Thus, we have the following natural interpretation: ", "page_idx": 4}, {"type": "text", "text": "• When $s=0$ , the objective mirrors Laplace learning.   \n• When $0\\leq s\\leq1$ , the constrained minimizer of the quadratic encourages solutions with predictions at unlabeled high-degree vertices to have small norm.   \n• When $s>1$ , $L_{u,s}$ could be indefinite or negative definite. The minimizers are extreme points of the feasible set and correspond exactly to labels. ", "page_idx": 4}, {"type": "text", "text": "When $L_{u,s}$ satisfies a certain condition, recovery of exact binary solutions is guaranteed, i.e. the relaxation is exact if $(s-1)(D_{i i}+D_{j j})\\geq2w_{i j}$ . The following proposition characterizes the binary solutions to (10) with respect to an appropriate choice of $s$ . The proof is provided in the Appendix. ", "page_idx": 5}, {"type": "text", "text": "Proposition 3.2. Suppose s is chosen such that $(L_{u,s})_{i i}+(L_{u,s})_{j j}<2(L_{u,s})_{i j}$ for all pairs $(i,j)$ .   \nThen every local minimizer of $F_{s}(X)$ is a $0-1$ solution. ", "page_idx": 5}, {"type": "text", "text": "Note that the condition is weaker than a negative definite condition of $\\textstyle L_{u,s}$ . For instance, as $s\\to\\infty$ every extreme point of the feasible set of (10) (every feasible $0-1$ assignment) becomes a local solution. With smaller $s$ , fewer of these extreme points are local minimizers. ", "page_idx": 5}, {"type": "text", "text": "3.2 CutSSL algorithm ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "The problem introduced in (10) is amenable to the alternating direction method of multipliers (ADMM) framework [8], a flexible approach to solve non-smooth and nonconvex optimization problems by introducing “coupled” subproblems derived from a “splitting” of the primal variables. We consider the following “split” problem, introducing the variable $\\stackrel{\\triangledown}{T}\\in\\tilde{\\mathbb{R}}^{n\\times k}$ : ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\underset{X,T\\in\\mathbb{R}^{n\\times k}}{\\operatorname*{min}}\\left\\{F(X,T)=\\frac{1}{2}\\mathrm{tr}(X^{\\top}(L_{u,s})X)-\\mathrm{tr}(X^{\\top}B)\\right\\}}\\\\ &{\\mathrm{s}.\\mathrm{t}.~X^{\\top}\\mathbf{1}_{n}=\\mathbf{m},~X\\mathbf{1}_{k}=\\mathbf{1}_{n},~T\\geq0,~X=T}\\end{array}\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "Define the Lagrangian, $G(X,T,\\Lambda)$ to be the objective of the following problem: ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\underset{\\boldsymbol{\\Lambda}\\in\\mathbb{R}^{n\\times k}}{\\operatorname*{max}}\\underset{X,T\\in\\mathbb{R}^{n\\times k}}{\\operatorname*{min}}\\frac{1}{2}\\mathrm{tr}(X^{\\top}L_{u,s}X)-\\mathrm{tr}(X^{\\top}B)+\\mathrm{tr}(\\boldsymbol{\\Lambda}^{\\top}(X-T))+\\frac{1}{2}||X-T||^{2}}\\\\ &{\\mathrm{~s.t.~}X^{\\top}\\mathbf{1}_{n}=\\mathbf{m},\\,\\,\\,X\\mathbf{1}_{k}=\\mathbf{1}_{n},\\,\\,T\\geq0.}\\end{array}\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "In this instance, ADMM is implemented by searching for saddle points of $G$ via the following iterates: ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{X_{t+1}=\\underset{X\\in\\mathbb{R}^{n\\times k}}{\\arg\\operatorname*{min}}\\,G(X,T_{t},\\Lambda_{t})\\quad\\mathrm{s.t.~}X^{\\top}\\mathbf{1}_{n}=m,\\,\\,\\,X\\mathbf{1}_{k}=\\mathbf{1}_{n}}\\\\ &{T_{t+1}=\\underset{T\\in\\mathbb{R}^{n\\times k}}{\\arg\\operatorname*{min}}\\,G(X_{t+1},T,\\Lambda_{t})\\;\\mathrm{s.t.~}T\\geq0}\\\\ &{\\Lambda_{t+1}=\\Lambda_{t}+X_{t+1}-T_{t+1}}\\end{array}\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "The first-order optimality conditions on $X$ are ", "page_idx": 5}, {"type": "equation", "text": "$$\nX=\\bar{L}_{u,s}^{-1}(B+T-\\Lambda-\\mathbf{1}_{n}\\mu_{1}^{\\top}-\\mu_{2}\\mathbf{1}_{k}^{\\top}),\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $\\mu_{1}\\,\\in\\,\\mathbb{R}^{k}$ and $\\mu_{2}\\,\\in\\,\\mathbb{R}^{n}$ are multipliers associated with the constraints $X^{\\top}\\mathbf{1}_{n}\\,=\\,\\mathbf{m}$ and $X\\mathbf{1}_{k}=\\mathbf{1}_{n}$ respectively, and $\\bar{L}_{u,s}=L_{u,s}\\dot{+}I$ . The optimality conditions associated with $(\\mu_{1},\\mu_{2})$ are recovered by applying the constraint $X^{\\top}\\mathbf{1}_{n}=\\mathbf{m}$ . Let $c=\\mathbf{1}_{n}^{\\top}\\bar{L}_{u,s}^{-1}\\mathbf{1}_{n}$ . This yields ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\begin{array}{l}{{\\displaystyle\\mu_{1}=c^{-1}\\{(B+T-\\Lambda-\\mu_{2}\\mathbf{1}_{k}^{\\top})^{\\top}{\\bar{L}}_{u,s}^{-1}\\mathbf{1}_{n}-\\mathbf{m}\\}}}\\\\ {{\\displaystyle\\mu_{2}=\\frac1k\\{(B+T-\\Lambda-\\mathbf{1}_{n}\\mu_{1}^{\\top})\\mathbf{1}_{k}-{\\bar{L}}_{u,s}\\mathbf{1}_{n}\\}}}\\end{array}\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "The optimality condition for $T$ yields ", "page_idx": 5}, {"type": "equation", "text": "$$\nT=\\underset{T\\geq0}{\\arg\\operatorname*{min}}\\ \\frac{1}{2}\\|\\Lambda+X-T\\|^{2}\\implies T=\\operatorname*{max}(\\Lambda_{t}+X_{t+1},0)\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "The algorithm is summarized in Algorithm 1. Detailed derivations are provided in Appendix E.1. ", "page_idx": 5}, {"type": "text", "text": "Input: Laplacian $L$ , labels $B$ , initialization $X_{0}$ Output: One-hot label predictions $X$ ", "page_idx": 6}, {"type": "text", "text": "1: function ADMM(L¯u,s, X0)   \n2: $X\\leftarrow X_{0}$   \n3: while not converged do   \n4: $\\begin{array}{r l}&{\\bar{\\boldsymbol{X}}_{t+1}=\\bar{\\boldsymbol{L}}_{u,s}^{-1}\\[\\boldsymbol{B}+\\boldsymbol{T}_{t}-\\mathbf{1}_{n}\\mu_{1}^{\\top}-\\mu_{2}\\mathbf{1}_{k}^{\\top}-\\boldsymbol{\\Lambda}_{t}\\}}\\\\ &{\\bar{T}_{t+1}\\leftarrow\\operatorname*{max}(\\boldsymbol{\\Lambda}_{t}+\\boldsymbol{X}_{t+1},0)}\\\\ &{\\boldsymbol{\\Lambda}_{t+1}=\\boldsymbol{\\Lambda}_{t}+\\boldsymbol{X}_{t+1}-\\boldsymbol{T}_{t+1}}\\end{array}$   \n5:   \n6:   \n7: end while   \n8: return $X_{t}$   \n9: end function ", "page_idx": 6}, {"type": "text", "text": "3.3 Convergence and complexity of CutSSL ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "The convergence of the standard two-block ADMM for convex and nonconvex problems has been thoroughly established in the literature [6, 8]. Note that when $s=0$ , (10) is convex and the feasible set is non-empty. An optimal solution exists. The ADMM iterations for (11) produce a sequence $\\{(X_{t},T_{t},\\Lambda_{t})\\}$ , where $X_{t}$ is guaranteed to satisfy the equality constraints, the entries of $T_{t}$ are guaranteed to be positive and $\\Lambda_{t}$ is the multiplier for equality constraint. ", "page_idx": 6}, {"type": "text", "text": "Generally, and as we show in the Appendix, ADMM converges to a KKT point of (11) if and only if the objective, primal, and dual residuals converge [8] as $t\\to\\infty$ , i.e. ", "page_idx": 6}, {"type": "equation", "text": "$$\nr_{p}^{t+1}=||X_{t}-T_{t}||_{2},\\quad r_{d}^{t+1}=||T_{t+1}-T_{t}||_{2}\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "The iterations stop when the norms of these residuals are within specified tolerance levels. $\\epsilon_{p}\\geq0$ , $\\epsilon_{d}\\geq0$ . One may speed up the empirical rate of convergence of ADMM by adjusting a step-size parameter associated with the Lagrangian. See the Appendix for details. ", "page_idx": 6}, {"type": "text", "text": "Partitioning poses a challenge from an optimization perspective, primarily due to the nonconvexity of the quadratic objective. For example, the Poisson MBO method [10] is locally convergent in the limit and incurs complexity $O(T R)$ , where $T$ is a bound on the number of iterations the procedure is run and $O(R)$ is the cost of solving a Laplacian system. Likewise, the volume MBO method presented in [19] also claims local convergence and complexity $O(T N V(\\log(V)+N)C)$ for some constant $C$ . Preconditioned conjugate gradient can be applied to find solutions to Laplacian-like systems in nearly linear time (linear in $M$ ) [29]. Thus, the complexity of our method is dominated by the primal variable update $O(T R)$ (step 4 in Alg. 1). ", "page_idx": 6}, {"type": "text", "text": "4 Mean-shifted Laplace learning ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "In the previous section, we introduced a graph-cut-inspired framework for graph-based semisupervised learning. Here we consider a related problem formulation to (10) such that we do not limit our solutions to lie on the simplex, and set $s=0$ . This is equivalent to imposing a cardinality constraint on Laplace learning (1): ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\operatorname*{min}_{X\\in\\mathbb{R}^{n\\times k}}\\left\\{{\\frac{1}{2}}\\mathrm{tr}(X^{\\top}L_{u}X)-\\mathrm{tr}(X^{\\top}B)\\right\\}{\\mathrm{~s.t.~}}X^{\\top}\\mathbf{1}_{n}=\\mathbf{m}\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "This comparison is justified with empirical evidence on MNIST. At solutions to (10) with $s=0$ , we observe (1.) the inequality constraints $X\\geq0$ are inactive (2.) the multiplier $\\mu_{2}$ associated with the constraint $X\\mathbf{1}_{k}=\\mathbf{1}_{n}$ has infinitesimal norm (empirically order of $10^{-9}$ ) (3.) the solutions to (18) and (10) differ in norm by a tiny amount (order of $\\mathrm{i0^{-4}}$ ). ", "page_idx": 6}, {"type": "text", "text": "We will show that an approximate solution to this problem is a previously known heuristic, mean-shift Laplace learning. Our analysis of this problem provides new evidence to explain the empirical performance of this heuristic, while also revealing that it is suboptimal in some sense. ", "page_idx": 6}, {"type": "text", "text": "While Laplace learning (3) exhibits excellent results at medium and higher label rates, recent work [10, 11] has identified that the solution to the Laplace learning problem degenerates to a constant as $m\\ll M$ , i.e., as the number of unlabeled vertices is significantly larger than the number of labeled vertices. Specifically, in the low label rate regime, $\\hat{X}$ asymptotically depends only on the degrees of the labeled vertices of the graph [10, 32]: $\\begin{array}{r}{\\bar{\\hat{X}}_{i}\\approx\\bar{y}_{w}:=\\frac{\\sum_{i=1}^{m}d_{i}y_{i}}{\\sum_{j=1}^{m}d_{j}}}\\end{array}$ , thus, thresholding as in (2) results in a poor solution, concentrated on a single class. ", "page_idx": 6}, {"type": "text", "text": "", "page_idx": 7}, {"type": "text", "text": "In the nonasymptotic regime, however, Xˆ is not exactly a constant, and earlier work has demonstrated that shifting Xˆ such that the column-means are zero (i.e. the mean-shift) empirically corrects this issue. This is justified in Calder et al. [10], von Luxburg et al. [32] via a random walk argument. ", "page_idx": 7}, {"type": "text", "text": "4.1 Mean-shift as an approximate solution for cardinality-constrained SSL ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "The problem in (18) is convex since the matrix $L_{u}$ is a principal submatrix of $\\mathcal{L}$ , a positive semidefinite matrix. Additionally, the set $C_{\\mathbf{m}}=\\{X:X^{\\top}\\mathbf{1}_{n}=\\mathbf{m}\\}$ is convex and nonempty. Mean-shifted Laplace learning is one heuristic to solve this problem, by performing the the following pair of steps: ", "page_idx": 7}, {"type": "text", "text": "1) Linearization: Solve $L_{u}X=B$ to get $\\hat{X}$ . This is equivalent to vanilla Laplace learning.   \n2) Projection: Project $\\hat{X}$ onto the set $C_{m}$ : ", "page_idx": 7}, {"type": "equation", "text": "$$\n\\hat{\\bar{X}}=\\underset{X}{\\arg\\operatorname*{min}}\\left\\{\\frac{1}{2}\\|X-\\hat{X}\\|_{F}^{2}\\ \\mathrm{s.t.}\\ X^{\\top}\\mathbf{1}_{n}=\\mathbf{m}\\right\\},\n$$", "text_format": "latex", "page_idx": 7}, {"type": "text", "text": "Applying Lagrange multipliers yields $\\begin{array}{r}{\\hat{\\bar{X}}_{i j}=\\hat{X}_{i j}-\\frac{1}{n}\\left(\\sum_{i=1}^{n}\\hat{X}_{i j}-\\mathbf{m}_{j}\\right)}\\end{array}$ . Thus, mean-shift is the projection $\\hat{\\bar{X}}_{i j}$ when $\\mathbf{m}=\\mathbf{0}_{k}$ . ", "page_idx": 7}, {"type": "text", "text": "This is only an approximate solution. However, it is straightforward to characterize the optimal solutions of (18), which can be decomposed into the sum of two terms: $\\begin{array}{r}{X=Z+\\frac{1}{n}\\mathbf{1}_{n}\\mathbf{m}^{\\dagger}}\\end{array}$ . The first term is associated with the solution to (18) for $\\mathbf{m=0}$ , i.e. $\\mathbf{1}_{n}^{\\top}Z=0$ . Denote the projection $\\begin{array}{r}{P=I-\\frac{1}{n}\\mathbf{1}_{n}\\mathbf{1}_{n}^{\\top}}\\end{array}$ onto the set of $n\\times k$ matrices with mean-zero columns. Note that $Z$ is the minimizer of $\\begin{array}{r}{\\frac{1}{2}\\mathrm{tr}(Z^{\\dag}P L_{u}P Z)-\\mathrm{tr}(Z^{\\top}(P B))}\\end{array}$ and satisfies the system $Z=(P L_{u}P)^{\\dag}P B$ . The second term $\\begin{array}{r}{\\bar{\\frac{1}{n}}\\bar{\\mathbf{1}_{n}}\\mathbf{m}^{\\top}}\\end{array}$ is a constant term to correct for the true value of $\\mathbf{m}~\\mathbf{so}$ that $\\mathbf{1}_{n}^{\\top}X=\\mathbf{m}$ . Thus, it is clear that to resolve the suboptimality of the mean-shift heuristic, one must apply mean-shift to the Laplace learning solution when the labels have been shifted. This can be solved with Projected Conjugate Gradient (PCG). In the following proposition, we characterize optimal solutions to (18) in terms of the mean-shift heuristic. Naturally, we expect that as the number of labeled vertices increases, the gap becomes smaller. The proof is provided in the appendix. ", "page_idx": 7}, {"type": "text", "text": "Proposition 4.1. Let $X^{\\ast}\\in\\mathbb{R}^{n\\times k}$ be a solution to Laplace learning (18), $\\hat{X}\\in\\mathbb{R}^{n\\times k}$ be the solution to (3), and $\\hat{\\bar{X}}\\in\\mathbb{R}^{n\\times k}$ be the mean-shift heuristic (28). Let $\\begin{array}{r}{\\kappa(L_{u})=\\frac{\\lambda_{m a x}(L_{u})}{\\lambda_{m i n}(L_{u})}}\\end{array}$ and $\\hat{\\mathbf{m}}=\\mathbf{1}_{n}\\hat{X}$ . Then, $X^{*}$ is a rank-one perturbation of $\\hat{\\bar{X}}$ and $\\begin{array}{r}{||X^{*}-\\hat{\\bar{X}}||\\leq\\frac{\\kappa(L_{u})}{\\sqrt{n}}||\\mathbf{m}^{\\top}-\\hat{\\mathbf{m}}^{\\top}||+\\frac{1}{n}||\\hat{\\mathbf{m}}||}\\end{array}$ . ", "page_idx": 7}, {"type": "text", "text": "In the projection step, the rank-one perturbation (33) serves to adjust the column sum of $\\hat{X}$ to satisfy the cardinality constraint implied by $\\mathbf{m}$ . When thresholding continuous solutions to integer predictions by comparing the entries in each row of $X$ , the rank-one adjustment can play a crucial balancing role, particularly when $\\hat{\\mathbf{m}}$ , the cardinalities of the predicted labels, are far from the prior cardinalities $\\mathbf{m}$ . We emphasize that the term mˆ exactly corresponds to the degeneracy of Laplace learning $\\hat{X}$ . ", "page_idx": 7}, {"type": "text", "text": "Notably, in the low-label rate regime, the bound is dominated by the smallest eigenvalue of $L_{u}$ , the denominator of $\\kappa(L_{u})$ . This term is intimately related to the number of labeled vertices, i.e. by interlacing [14], as well as the difference in cut and cut quality, by the above proposition. Generally, the bound gets smaller as the smallest eigenvalue of $L_{u}$ increases, and this corresponds to the addition of labeled samples to the label set. ", "page_idx": 7}, {"type": "text", "text": "In the appendix, we empirically confirm this in Fig 3, where we investigate solutions generated using the mean-shift Laplace learning heuristic and the true solution to (18) on MNIST at label rates ranging from 1 per-class to 10 per-class. ", "page_idx": 7}, {"type": "text", "text": "Despite not resolving the issue of degeneracy in the theoretical sense of Calder et al. [11], we show in Sec. 5 that solving (18) exactly via PCG consistently yields better results than the mean shift heuristic, at no additional computational cost. Intuitively, our analysis implies that shifting both the solution and the labels is a superior heuristic. However, we note that while gains in accuracy of $1-2\\%$ are consistent in the very low label-rate regime, the improvement becomes marginal at higher label rates. In contrast, we demonstrate that CutSSL, which avoids degenerate solutions via recovery of integer solutions, has consistent improvement in performance across label rates. ", "page_idx": 7}, {"type": "text", "text": "", "page_idx": 8}, {"type": "text", "text": "5 Experiments ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "We evaluate our method on three image datasets: MNIST [12], Fashion-MNIST [33] and Cifar-10 [23], using pretrained autoencoders as feature extractors as in Calder et al. [10], see appendix for details. We also evaluate cutSSL on various real-world networks, including the Cora citation network and the OGB [18] Arxiv and Product networks. ", "page_idx": 8}, {"type": "table", "img_path": "hCOuip5Ona/tmp/f95b93f8aab9c8a7662483f759e3d30a9c27bfb620b81cd87bcc8ee3e33f1d26.jpg", "table_caption": ["Table 1: Cifar-10. Average accuracy over 100 trials with standard deviation in brackets. "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "Image datasets We construct a graph over the latent feature space. We used all available data to construct the graph, with $n=70$ , 000 nodes for MNIST and Fashion-MNIST, and $n=60$ , 000 nodes for Cifar-10. The graph was constructed as a $k$ -nearest neighbor graph with Gaussian edge weights given by $w_{i j}\\,=\\,\\bar{\\exp}\\,\\bigl(-4||v_{i}-v_{j}||^{2}/d_{k}(v_{i})^{2}\\bigr)$ , where $v_{i}$ are the latent variables for image $i$ , and $d_{k}(v_{i})$ is the distance in the latent space between $v_{i}$ and its $k^{\\mathrm{th}}$ nearest neighbor. We used $k=10$ in all experiments and symmetrize $W$ by replacing $W$ with $\\textstyle{\\frac{1}{2}}(W+W^{\\top})$ . ", "page_idx": 8}, {"type": "text", "text": "We compare to the state-of-the-art unconstrained graph-based SSL algorithm Poisson Learning [10] as well as variants based on the MBO procedure [19] to incorporate knowledge of class sizes. We include vanilla Laplace learning, Laplace learning with the mean-shift heuristic, and exact Laplace learning with relaxed cardinality constraints presented in Section 4. We also include a method inspired from spectral relaxations of the min-cut problem. Laplacian Eigenmaps-SSL [3] performs graph-based SSL by learning a linear predictor using the principal eigenvectors of the graph Laplacian as features. We note that our method is directly comparable to Volume- and Poisson-MBO, which also incorporate knowledge of class sizes. ", "page_idx": 8}, {"type": "text", "text": "Adopting a homotopy method implies that we solve a sequence of quadratic programs with $s_{0}~=~0$ and use the associated solution to initialize a subsequent problem with $s~>~0$ . In practice, we set $s~=~0.1$ for all experiments. The procedure presented in Alg. 1 is run for 100 iterations. In Table 1 we present the accuracy of our method on Cifar-10 across various label rates (MNIST and fMNIST results are in the appendix). CutSSL outperforms all methods across all label rates. In particular, we outperform the state-of-the-art by $2.9\\%$ when only a single sample from each class is provided and by $1.9\\%$ in the large label-rate regime. ", "page_idx": 8}, {"type": "table", "img_path": "hCOuip5Ona/tmp/7506d25dad5436caf60e36f4ebd5ac447fbac1342a807599a00fcd70c07c6598.jpg", "table_caption": ["Table 2: A citation network with 169, 343 vertices and 40 labels (“Rate=tr” means all train data). "], "table_footnote": [], "page_idx": 8}, {"type": "table", "img_path": "hCOuip5Ona/tmp/4bbf705f01bd695758bf9611e821166f0c38c35954c7e384e79b9056ca1ce28c.jpg", "table_caption": ["Table 3: A co-purchasing network with ${>}2M$ vertices and 47 labels (“Rate=tr” means all train data). "], "table_footnote": [], "page_idx": 9}, {"type": "text", "text": "Citation networks : In Figure 2 we plot accuracy and label rate for the Cora and Citeseer citation networks, demonstrating that our method generalizes beyond $k$ -NN graphs. Notably, for Cora, we outperform PoissonMBO by $7.5\\%$ at 1 label per class (see appendix). We note that the trend persists across datasets and label rates. Interestingly, LE-SSL [3] performs significantly worse across label rates. This implies that searching near the set of binary vectors is critical to achieving good predictors. ", "page_idx": 9}, {"type": "image", "img_path": "hCOuip5Ona/tmp/56d930fb6843f5e924d3399a96a1639c1887f6bb37a3d1d825739176abd61827.jpg", "img_caption": ["Figure 2: Prediction accuracy on citation networks. "], "img_footnote": [], "page_idx": 9}, {"type": "text", "text": "", "page_idx": 9}, {"type": "text", "text": "Large-scale networks: To demonstrate the scalability of our method, we provide results at 1-label rate for OGB networks Arxiv (Table 2) and Products (Table 3). These networks contain up to 2 million vertices and 47 classes. We demonstrate state-of-the-art performance in this regime, with an improvement of $\\sim5\\%$ for both. Note that $\\mathrm{{CutSSL}}$ also significantly outperforms a graph neural network-based method, GraphHop [34], designed for low label rates and which also exploits node feature information. CutSSL has double the accuracy with an order of magnitude less run-time. ", "page_idx": 9}, {"type": "text", "text": "Label/class imbalance: In the appendix, we also present results demonstrating performance under label and class imbalance. Our method exhibits superior robustness when either the label rate is imbalanced (different classes have different number of labels, see Tab. 5) or when the underlying partition sizes are imbalanced (different classes have different number of samples, see Tab. 6). ", "page_idx": 9}, {"type": "text", "text": "Additional experiments: In the appendix (section C.2), we demonstrate the efficacy of CutSSL at classifying samples with small “margin”. This is in contrast to spectral and Laplace learning-type algorithms are known to produce predictions that “bleed” across the cut boundary. We conduct ablative studies on the graph construction and choice of $S$ (section C.4). Convergence of CutSSL and recovery of integer solutions is empirically demonstrated in Figure 6. ", "page_idx": 9}, {"type": "text", "text": "6 Conclusion ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "We have proposed a novel formulation of graph-based semi supervised learning as a nonconvex continuous quadratic program that bears similarities to the mean-shift Laplace learning heuristic and graph cuts. We have presented an iterative method to solve a sequence of these problems to recover discrete predictions. Numerically, we have demonstrated that our approach consistently outperforms state-of-the-art methods on semi-supervised learning problems at low, medium, and high label rates and in imbalanced class regimes. Future work includes a rigorous analysis of exact cut-based methods for graph-based semi-supervised learning. Of particular interest are the asymptotic behavior and consistency of cut-based methods for graph-based SSL. ", "page_idx": 9}, {"type": "text", "text": "Acknowledgments and Disclosure of Funding ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "This work was partially funded by NSF award 2217058, an award from the W.M. Keck foundation, and NSTC grant 110-2115-M-005-007-MY3. ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "[1] A. E. K. Alaoui. Asymptotic behavior of $\\ell\\_p$ -based Laplacian regularization in semi-supervised learning. In Annual Conference Computational Learning Theory, 2016.   \n[2] R. Ando and T. Zhang. Learning on graph with Laplacian regularization. In B. Schölkopf, J. Platt, and T. Hoffman, editors, Advances in Neural Information Processing Systems, volume 19. MIT Press, 2006. URL https://proceedings.neurips.cc/paper/2006/file/ d87c68a56bc8eb803b44f25abb627786-Paper.pdf.   \n[3] M. Belkin and P. Niyogi. Using manifold structure for partially labelled classification. In Proceedings of the 15th International Conference on Neural Information Processing Systems, NIPS’02, page 953–960, Cambridge, MA, USA, 2002. MIT Press.   \n[4] M. Belkin and P. Niyogi. Laplacian eigenmaps for dimensionality reduction and data representation. Neural Computation, 15:1373–1396, 2003. [5] D. Bertsekas. The auction algorithm: A distributed relaxation method for the assignment problem. Annals of Operations Research, 14:105–123, 12 1988. doi: 10.1007/BF02186476.   \n[6] S. Boyd and L. Vandenberghe. Convex Optimization. Cambridge University Press, March 2004. ISBN 0521833787.   \n[7] S. Boyd, N. Parikh, E. Chu, B. Peleato, and J. Eckstein. Distributed optimization and statistical learning via the alternating direction method of multipliers. Found. Trends Mach. Learn., 3(1): 1–122, jan 2011. ISSN 1935-8237. doi: 10.1561/2200000016. URL https://doi.org/10. 1561/2200000016.   \n[8] S. Boyd, N. Parikh, E. Chu, B. Peleato, and J. Eckstein. 2011.   \n[9] J. Calder. Graphlearning python package, Jan. 2022. URL https://doi.org/10.5281/ zenodo.5850940.   \n[10] J. Calder, B. Cook, M. Thorpe, and D. Slepcˇev. Poisson learning: Graph based semi-supervised learning at very low label rates. In Proceedings of the 37th International Conference on Machine Learning, ICML’20. JMLR.org, 2020.   \n[11] J. Calder, D. Slepˇcev, and M. Thorpe. Rates of convergence for Laplacian semi-supervised learning with low labeling rates, 2020.   \n[12] L. Deng. The MNIST database of handwritten digit images for machine learning research. IEEE Signal Processing Magazine, 29(6):141–142, 2012.   \n[13] C. Fiduccia and R. Mattheyses. A linear-time heuristic for improving network partitions. In 19th Design Automation Conference, pages 175–181, 1982. doi: 10.1109/DAC.1982.1585498.   \n[14] S. Fisk. A very short proof of Cauchy’s interlace theorem for eigenvalues of Hermitian matrices, 2005.   \n[15] M. Flores, J. Calder, and G. Lerman. Analysis and algorithms for p-based semi-supervised learning on graphs. Applied and Computational Harmonic Analysis, 60:77–122, 2022. ISSN 1063- 5203. doi: https://doi.org/10.1016/j.acha.2022.01.004. URL https://www.sciencedirect. com/science/article/pii/S1063520322000045.   \n[16] M. X. Goemans and D. P. Williamson. Improved approximation algorithms for maximum cut and satisfiability problems using semidefinite programming. J. ACM, 42:1115–1145, 1995. URL https://api.semanticscholar.org/CorpusID:15794408.   \n[17] W. W. Hager and Y. S. Krylyuk. Graph partitioning and continuous quadratic programming. SIAM J. Discret. Math., 12:500–523, 1999.   \n[18] W. Hu, M. Fey, M. Zitnik, Y. Dong, H. Ren, B. Liu, M. Catasta, and J. Leskovec. Open graph benchmark: Datasets for machine learning on graphs. Advances in neural information processing systems, 33:22118–22133, 2020.   \n[19] M. Jacobs, E. Merkurjev, and S. Esedo¯glu. Auction dynamics: A volume constrained MBO scheme. Journal of Computational Physics, 354:288–310, 2018. ISSN 0021-9991. doi: https: //doi.org/10.1016/j.jcp.2017.10.036. URL https://www.sciencedirect.com/science/ article/pii/S0021999117308033.   \n[20] A. Jung, A. O. H. III, A. Mara, and S. Jahromi. Semi-supervised learning via sparse label propagation, 2016.   \n[21] B. W. Kernighan and S. Lin. An efficient heuristic procedure for partitioning graphs. The Bell System Technical Journal, 49(2):291–307, 1970. doi: 10.1002/j.1538-7305.1970.tb01770.x.   \n[22] D. P. Kingma and M. Welling. Auto-Encoding Variational Bayes. In 2nd International Conference on Learning Representations, ICLR 2014, Banff, AB, Canada, April 14-16, 2014, Conference Track Proceedings, 2014.   \n[23] A. Krizhevsky and G. Hinton. Learning multiple layers of features from tiny images. (0), 2009.   \n[24] Z. A. Liao. Branch and bound via the alternating direction method of multipliers for the quadratic assignment problem). 2016. URL https://api.semanticscholar.org/CorpusID: 160030080.   \n[25] S. Ling and T. Strohmer. Certifying global optimality of graph cuts via semidefinite relaxation: A performance guarantee for spectral clustering. Found. Comput. Math., 20(3):367–421, jun 2020. ISSN 1615-3375. doi: 10.1007/s10208-019-09421-3. URL https://doi.org/10. 1007/s10208-019-09421-3.   \n[26] B. Nadler, N. Srebro, and X. Zhou. Semi-supervised learning with the graph Laplacian: The limit of infinite unlabelled data. In Proceedings of the 22nd International Conference on Neural Information Processing Systems, NIPS’09, page 1330–1338, Red Hook, NY, USA, 2009. Curran Associates Inc. ISBN 9781615679119.   \n[27] J. Nocedal and S. J. Wright. Numerical Optimization. Springer, New York, NY, USA, 2e edition, 2006.   \n[28] S. Shekkizhar and A. Ortega. Graph construction from data by non-negative kernel regression. In ICASSP 2020 - 2020 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), pages 3892–3896, 2020. doi: 10.1109/ICASSP40776.2020.9054425.   \n[29] D. A. Spielman and S.-H. Teng. Nearly linear time algorithms for preconditioning and solving symmetric, diagonally dominant linear systems. SIAM Journal on Matrix Analysis and Applications, 35(3):835–885, 2014.   \n[30] N. G. Trillos, D. Slepcev, J. von Brecht, T. Laurent, and X. Bresson. Consistency of Cheeger and ratio graph cuts, 2014.   \n[31] U. Von Luxburg. A tutorial on spectral clustering. Statistics and computing, 17:395–416, 2007.   \n[32] U. von Luxburg, A. Radl, and M. Hein. Hitting and commute times in large random neighborhood graphs. Journal of Machine Learning Research, 15(52):1751–1798, 2014. URL http://jmlr.org/papers/v15/vonluxburg14a.html.   \n[33] H. Xiao, K. Rasul, and R. Vollgraf. Fashion-mnist: a novel image dataset for benchmarking machine learning algorithms. ArXiv, abs/1708.07747, 2017.   \n[34] T. Xie, B. Wang, and C.-C. J. Kuo. Graphhop: An enhanced label propagation method for node classification. IEEE Transactions on Neural Networks and Learning Systems, 34(11): 9287–9301, 2023. doi: 10.1109/TNNLS.2022.3157746.   \n[35] W. Zhang, S. Pan, S. Zhou, T. Walsh, and J. C. Weiss. Fairness amidst non-iid graph data: Current achievements and future directions, 2023.   \n[36] D. Zhou, O. Bousquet, T. N. Lal, J. Weston, and B. Schölkopf. Learning with local and global consistency. In NIPS, 2003. ", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "[37] D. Zhou, J. Huang, and B. Schölkopf. Learning from labeled and unlabeled data on a directed graph. In Proceedings of the 22nd International Conference on Machine Learning, ICML ’05, page 1036–1043, New York, NY, USA, 2005. Association for Computing Machinery. ISBN 1595931805. doi: 10.1145/1102351.1102482. URL https://doi.org/10.1145/1102351. 1102482. ", "page_idx": 12}, {"type": "text", "text": "[38] X. Zhu, Z. Ghahramani, and J. Lafferty. Semi-supervised learning using Gaussian fields and harmonic functions. In Proceedings of the Twentieth International Conference on International Conference on Machine Learning, ICML’03, page 912–919. AAAI Press, 2003. ISBN 1577351894. ", "page_idx": 12}, {"type": "text", "text": "[39] X. J. Zhu. Semi-supervised learning literature survey. Technical report, University of WisconsinMadison Department of Computer Sciences, 2005. ", "page_idx": 12}, {"type": "text", "text": "A Outline of appendix ", "text_level": 1, "page_idx": 12}, {"type": "text", "text": "The outline of the appendix is as follows: we first provide the proofs of the propositions presented in Sections 3 and 4. Next, we provide additional experiments to demonstrate the efficacy of our method on other standard image and citation network benchmarks (FMNIST and FashionMNIST and Planetoid) and in the presence of imbalanced labels. We also include an ablation study of $S$ and the graph construction, and an evaluation of the cut objective for different methods. Additionally, we review two existing methods for cardinality-constrained semi-supervised learning. We also provide detailed derivations and a variation of the algorithm presented in the main text which incorporates a step size. ", "page_idx": 12}, {"type": "text", "text": "B Proofs ", "text_level": 1, "page_idx": 12}, {"type": "text", "text": "Consider the CutSSL formulation: ", "page_idx": 12}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\underset{X\\in\\mathbb{R}^{n\\times k}}{\\operatorname*{min}}\\left\\{F(X)=\\frac{1}{2}\\mathrm{tr}(X^{\\top}(L_{u}-S)X)-\\mathrm{tr}(X^{\\top}B)\\right\\}}\\\\ &{\\mathrm{subject}\\;\\mathrm{to}\\;X^{\\top}\\mathbf{1}_{n}=\\mathbf{m},\\;\\;X\\mathbf{1}_{k}=\\mathbf{1}_{n},\\;\\;X\\geq0.}\\end{array}\n$$", "text_format": "latex", "page_idx": 12}, {"type": "text", "text": "The following proposition characterizes the binary solutions to (20) assuming appropriate choice of $s$ . ", "page_idx": 12}, {"type": "text", "text": "Proposition B.1 (Proposition 3.2). Suppose s is chosen such that $(L_{u,s})_{i i}+(L_{u,s})_{j j}<2(L_{u,s})_{i j}$ for all pairs $(i,j)$ . Then every local minimizer of $F$ is a $0-1$ solution. ", "page_idx": 12}, {"type": "text", "text": "Proof. Suppose $X$ is a non-binary optimal solution to (20). Assume that $X_{i_{1},i_{2}}$ lies in $(0,1)$ . The feasibility condition implies that both $X_{i_{3},i_{2}}$ and $X_{i_{1},i_{0}}$ lie in the interval $(0,1)$ for some $i_{3}$ and some $i_{0}$ . Likewise, $X_{i_{4},i_{3}}\\in(0,1)$ for some $i_{4}$ . Repeat the argument, then there exists a sequence of $l$ nonzero entries in $X$ , whose indices form a cycle, i.e., $(i_{1},i_{2},i_{3}.\\ldots i_{l})$ and $i_{l}=i_{0}$ with $l$ even. That is, $X_{i_{j},i_{j+1}}\\in(0,1),\\,X_{i_{j+2},i_{j+1}}\\in(0,1)$ for $j\\,=\\,1,3,5,\\ldots$ . The existence of a cycle in $X$ implies that we can construct $X+\\epsilon E$ feasible, where $E$ is a $0/1$ matrix with $E_{i_{j},i_{j+1}}=1$ and $E_{i_{j+2},i_{j+1}}=-1$ . Clearly, we have that ", "page_idx": 12}, {"type": "equation", "text": "$$\nE\\mathbf{1}_{k}=0\\;\\mathrm{and}\\;E^{\\top}\\mathbf{1}_{n}=0.\n$$", "text_format": "latex", "page_idx": 12}, {"type": "text", "text": "From the local optimality condition $f(X+\\epsilon E)\\geq f(X)$ , with $\\epsilon\\to0^{+}$ , the necessary conditions indicate two conditions, ", "page_idx": 12}, {"type": "equation", "text": "$$\n\\mathrm{tr}(E^{\\top}(L_{u,s}X-B))=0,~\\mathrm{tr}(E^{\\top}L_{u,s}E)\\geq0\n$$", "text_format": "latex", "page_idx": 12}, {"type": "text", "text": "for each $E$ with cycle $(i_{1},\\ldots,i_{l})$ . Since $X$ is a locally optimal solution, then $L_{u,s}X\\mathrm{~-~}B\\mathrm{~=~}$ $\\mu_{1}\\mathbf{1}_{k}^{\\top}+\\mathbf{1}_{n}\\mu_{2}^{\\top}$ holds for some vectors $\\mu_{1},\\mu_{2}$ , which ensures the condition $\\mathrm{tr}(E^{\\top}(L_{u,s}X-B))=0$ However, according to the assumption $(L_{u,s})_{i i}+(L_{u,s})_{j j}<2(L_{u,s})_{i j}$ , we have that ", "page_idx": 12}, {"type": "equation", "text": "$$\n\\mathrm{tr}(E^{\\top}L_{u,s}E)=\\sum_{j=1}^{l}2(L_{u,s})_{i_{j},i_{j}}-2(L_{u,s})_{i_{j},i_{j+1}}<0\n$$", "text_format": "latex", "page_idx": 12}, {"type": "text", "text": "i.e., the conditions for local optimality are violated. ", "page_idx": 12}, {"type": "text", "text": "Let $\\begin{array}{r}{\\mathcal{L}=\\left[\\begin{array}{c c}{L_{l}}&{L_{l u}}\\\\ {L_{u l}}&{L_{u}}\\end{array}\\right]}\\end{array}$ and $\\boldsymbol{X_{0}}=\\left[\\begin{array}{l}{\\boldsymbol{X_{l}}}\\\\ {\\boldsymbol{X_{u}}}\\end{array}\\right]$ where $l$ and $u$ correspond to labeled and unlabeled indices, respectively. The solution $\\hat{X}$ of the Laplace learning problem satisfies the linear system ", "page_idx": 13}, {"type": "equation", "text": "$$\nL_{u}\\hat{X}=B:=-L_{u l}Y.\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "Consider the cardinality constrained Laplace learning formulation ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\left.\\begin{array}{l}{{\\displaystyle\\operatorname*{min}_{X\\in\\mathbb{R}^{n\\times k}}\\left\\{f(X)=\\frac{1}{2}\\mathrm{tr}(X^{\\top}L_{u}X)-\\mathrm{tr}(X^{\\top}B)\\right\\}}}\\\\ {{\\mathrm{~s.t.~}X^{\\top}{\\bf1}_{n}={\\bf m}}}\\end{array}\\right\\}\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "In the main text, we discussed that mean-shift Laplace learning is a heuristic that recovers approximate solutions to the above convex problem for $\\mathbf{m}=\\mathbf{0}_{k}$ . The mean-shift heuristic corresponds to the following two-step procedure: ", "page_idx": 13}, {"type": "text", "text": "1) Linearization: Solve $L_{u}X=B$ to get $\\hat{X}$ ", "page_idx": 13}, {"type": "text", "text": "2) Projection: Project $\\hat{X}$ onto the orthogonal complement of ${\\mathbf{1}}_{n}$ to get Xˆ¯ = P Xˆ, where $P\\,=$ $\\begin{array}{r}{\\dot{I}-\\frac{1}{n}\\dot{\\mathbf{1}}_{n}\\mathbf{1}_{n}^{\\top}}\\end{array}$ First, we provide a detailed derivation of step 2. ", "page_idx": 13}, {"type": "text", "text": "We have ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\hat{\\bar{X}}=\\underset{X}{\\arg\\operatorname*{min}}\\left\\{\\frac{1}{2}\\|X-\\hat{X}\\|_{F}^{2}\\ \\mathrm{s.t.}\\ X^{\\top}\\mathbf{1}_{n}=\\mathbf{m}\\right\\},\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "Let $\\mathbf{m=0}$ . Applying Lagrange multipliers to (19) in order to solve step 2 yields ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\begin{array}{l}{{\\mathcal{G}}(X,{\\boldsymbol{\\mu}})=\\displaystyle\\frac12\\|X-\\hat{X}\\|_{F}^{2}+{\\boldsymbol{\\mu}}^{\\top}(X^{\\top}\\mathbf{1}_{n}-\\mathbf{m})}\\\\ {\\quad\\quad\\quad=\\left(\\displaystyle\\frac12\\|X-\\hat{X}\\|_{F}^{2}+(X{\\boldsymbol{\\mu}})^{\\top}\\mathbf{1}_{n}\\right)-{\\boldsymbol{\\mu}}^{\\top}\\mathbf{m}}\\end{array}\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "with $\\boldsymbol{\\mu}\\in{\\mathbb R}^{k}$ . The solution to (19) is given by finding the $\\mu$ which satisfies the constraint. The partial derivatives of the Lagrangian are ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\frac{\\partial\\mathcal{G}}{\\partial X_{i j}}=(X_{i j}-\\hat{X}_{i j})+\\mu_{j}=0\\implies X_{i j}=\\hat{X}_{i j}-\\mu_{j}\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "Applying the constraint $\\textstyle\\sum_{i=1}^{n}X_{i j}=\\mathbf{m}_{j}$ yields $\\begin{array}{r}{\\mu_{j}=\\frac{1}{n}(\\sum_{i=1}^{n}\\hat{X}_{1i j}-\\mathbf{m}_{j})}\\end{array}$ . The projection of $\\hat{X}$ onto $C_{\\mathbf{m}}$ is ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\hat{\\bar{X}}_{i j}=\\hat{X}_{i j}-\\frac{1}{n}\\left(\\sum_{i=1}^{n}\\hat{X}_{i j}-\\mathbf{m}_{j}\\right)\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "Here, we characterize the connection between this heuristic and the cardinality-constrained problem. ", "page_idx": 13}, {"type": "text", "text": "Proposition B.2 (Proposition 4.1). Let $X^{\\ast}\\in\\mathbb{R}^{n\\times k}$ be a solution to Laplace learning (18), $\\hat{X}\\in$ Rn×k be the solution to (3), and Xˆ¯ ∈Rn×k be the mean-shift heuristic (28). Let κ(Lu) = λλmmianx((LLuu)) and $\\hat{\\mathbf{m}}=\\hat{X}^{\\top}\\mathbf{1}_{n}$ . Then, $X^{*}$ is a rank-one perturbation of $\\hat{\\bar{X}}$ and $\\begin{array}{r}{\\|X^{*}-\\hat{\\bar{X}}\\|\\leq\\frac{\\kappa(L_{u})}{\\sqrt{n}}\\|\\mathbf{m}^{\\top}-\\hat{\\mathbf{m}}^{\\top}\\|+}\\end{array}$ $||\\hat{\\mathbf{m}}||$ . ", "page_idx": 13}, {"type": "text", "text": "Consider the first order condition of (25): ", "page_idx": 13}, {"type": "equation", "text": "$$\nL_{u}X^{*}=B+\\mathbf{1}_{n}\\mu^{\\top}\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "for some multiplier $\\boldsymbol{\\mu}\\in{\\mathbb R}^{k}$ satisfying ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\mathbf{m}=\\mu(\\mathbf{1}_{n}^{\\top}L_{u}^{-1}\\mathbf{1}_{n})+(B^{\\top}L_{u}^{-1}\\mathbf{1}_{n})\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "i.e., due to the constraint $X^{\\top}\\mathbf{1}_{n}=\\mathbf{m}$ , ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathbf{m}=(L_{u}^{-1}(B+\\mathbf{1}_{n}\\mu^{\\top}))^{\\top}\\mathbf{1}_{n}}\\\\ &{\\quad=(L_{u}^{-1}B+L_{u}^{-1}\\mathbf{1}_{n}\\mu^{\\top})^{\\top}\\mathbf{1}_{n}}\\\\ &{\\quad=\\mu(\\mathbf{1}_{n}^{\\top}L_{u}^{-1}\\mathbf{1}_{n})+(B^{\\top}L_{u}^{-1}\\mathbf{1}_{n})}\\end{array}\n$$", "text_format": "latex", "page_idx": 13}, {"type": "image", "img_path": "hCOuip5Ona/tmp/1edb7233a749f9d8a939a887247dbb63df3617e0d67e713f42564bd8ef5d4031.jpg", "img_caption": ["Figure 3: (top) Reciprocal of the small eigenvalue of $L_{u}$ (bottom) Label disagreements "], "img_footnote": [], "page_idx": 14}, {"type": "text", "text": "The first order condition implies that $X^{*}$ is determined by ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\begin{array}{r}{X^{\\ast}=L_{u}^{-1}1_{n}(\\boldsymbol{1}_{n}^{\\intercal}L_{u}^{-1}\\boldsymbol{1}_{n})^{-1}\\mathbf{m}^{\\intercal}+\\{I-L_{u}^{-1}1_{n}(\\boldsymbol{1}_{n}^{\\intercal}L_{u}^{-1}\\boldsymbol{1}_{n})^{-1}\\boldsymbol{1}_{n}^{\\intercal}\\}L_{u}^{-1}B^{\\intercal}}\\end{array}\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "Let $\\hat{X}$ denote the solution to the classic Laplace learning problem: $\\hat{X}=L_{u}^{-1}B^{\\top}$ and $\\hat{\\mathbf{m}}=1_{n}^{\\top}\\hat{X}$ . Also, let $y=L_{u}^{-1}\\boldsymbol{1}_{n}$ and introduce the notation $1_{n}^{\\top}L_{u}^{-1}1_{n}=1_{n}^{\\top}y$ . Then, we may show that $X^{*}$ is a rank-one perturbation of $\\hat{X}$ , ", "page_idx": 14}, {"type": "equation", "text": "$$\nX={\\hat{X}}+(1_{n}^{\\top}y)^{-1}y(\\mathbf{m}^{\\top}-\\mathbf{\\hat{m}}^{\\top})\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "Informally, since $\\mathcal{L}$ has a null vector ${\\mathbf{1}}_{n}$ (smallest eigenvalue 0), in the low-label rate regime, $L_{u}$ is nearly singular and $L_{u}^{-1}\\mathbf{1}_{n}$ corresponds a very large drift term. ", "page_idx": 14}, {"type": "text", "text": "Remark B.3. Denote the condition number of $\\begin{array}{r}{L_{u}\\;\\kappa(L_{u})=\\frac{\\lambda_{\\operatorname*{max}}(L_{u})}{\\lambda_{\\operatorname*{min}}(L_{u})}}\\end{array}$ λmax(Lu) . It follows that ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\begin{array}{l}{\\displaystyle||(1_{n}^{\\top}y)^{-1}y(\\mathbf{m}^{\\top}-\\hat{\\mathbf{m}}^{\\top})||\\leq(1_{n}^{\\top}y)^{-1}||y||\\cdot||\\mathbf{m}-\\hat{\\mathbf{m}}||}\\\\ {\\displaystyle\\leq\\frac{\\kappa(L_{u})}{\\sqrt{n}}||\\mathbf{m}-\\hat{\\mathbf{m}}||}\\end{array}\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "Remark B.4. ", "page_idx": 14}, {"type": "equation", "text": "$$\n||X-({\\hat{X}}-{\\frac{1}{n}}{\\hat{\\mathbf{m}}})||\\leq||(1_{n}^{\\top}y)^{-1}y(\\mathbf{m}^{\\top}-{\\hat{\\mathbf{m}}}^{\\top})||+{\\frac{1}{n}}||{\\hat{\\mathbf{m}}}||\\leq{\\frac{\\kappa(L_{u})}{\\sqrt{n}}}||\\mathbf{m}-{\\hat{\\mathbf{m}}}||+{\\frac{1}{n}}||{\\hat{\\mathbf{m}}}||\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "We note that $M$ , the total number of vertices remains a constant. $M=n+m$ , where $n$ are the number of unlabeled vertices and $m$ are the number of labeled vertices. The bound highlights the gap as $m$ varies, with $M$ fixed. As $m$ increases, $n$ decreases and $\\kappa(L_{u})$ increases (due to interlacing). Empirically, in Figure 3, we plot the difference in integer-rounded predictions and the reciprocal of the smallest eigenvalue of $L_{u}$ . We note that the reciprocal of the smallest eigenvalue of $L_{u}$ decays with the label rate, as does the difference in predictions. ", "page_idx": 14}, {"type": "text", "text": "C Additional Details and Experiments ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "In this section, we provide additional numerical evidence for the efficacy of our method. ", "page_idx": 14}, {"type": "text", "text": "See the Colab link provided in the abstract for an implementation of the algorithm in Python and NumPy and the graphlearning package [9]. All experiments were evaluated on Colab instances. These instances were equipped with 2-core AMD EPYC 7B12 CPUs and 13 GB of ram. ", "page_idx": 14}, {"type": "text", "text": "We additionally explore failure cases of our method—examples of data which our method incorrectly classifies; a setting in which emphasizes an imbalance in the label rate for each class; and an ablation study on the choice of the diagonal perturbation matrix $S$ . ", "page_idx": 14}, {"type": "image", "img_path": "hCOuip5Ona/tmp/d117ab0c40f5e7b686623761a220de90403d80c6e082314feeac2130c56ad7a7.jpg", "img_caption": ["Figure 4: Predicted label distribution on MNIST at 1 label per class. Vanilla Laplace learning (orange) is degenerate. The mean-shift heuristic (green) imposes a constraint on the predictions corresponding to a balanced prior on the class distribution. Shifting the labels (blue) is insufficient to enforce the prior. "], "img_footnote": [], "page_idx": 15}, {"type": "text", "text": "C.1 MNIST and Fashion-MNIST ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "For MNIST and Fashion-MNIST, we used variational autoencoders with 3 fully connected layers of sizes (784,400,20) and (784,400,30), respectively, followed by a symmetrically defined decoder. The autoencoder was trained for 100 epochs on each dataset. The autoencoder architecture, loss, and training are similar to Kingma and Welling [22]. ", "page_idx": 15}, {"type": "text", "text": "For each dataset, we construct a graph over the latent feature space. We used all available data to construct the graph, with $n=70$ , 000 nodes for MNIST and Fashion-MNIST, and $n=60$ , 000 nodes for Cifar-10. The graph was constructed as a $k$ -nearest neighbor graph with Gaussian edge weights given by ", "page_idx": 15}, {"type": "equation", "text": "$$\nw_{i j}=\\exp\\left(-4||x_{i}-x_{j}||^{2}/d_{k}(x_{i})^{2}\\right),\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "where $x_{i}$ are the latent variables for image $i$ , and $d_{k}(x_{i})$ is the distance in the latent space between $x_{i}$ and its $k^{\\mathrm{th}}$ nearest neighbor. We used $k=10$ in all experiments and symmetrize $W$ . ", "page_idx": 15}, {"type": "text", "text": "Table 4: Average accuracy over 100 trials with standard deviation in brackets. Best is bolded. ", "page_idx": 15}, {"type": "table", "img_path": "hCOuip5Ona/tmp/7806650a6b97a966fad73aba64505f8ad9fca2fc973f9ddc720237851d7d97a7.jpg", "table_caption": [], "table_footnote": [], "page_idx": 15}, {"type": "text", "text": "In Table 4 we present results at a variety of label rates on the MNIST and FashionMNIST datasets, demonstrating improved classification accuracy and lower classification variance accross all datasets. ", "page_idx": 15}, {"type": "text", "text": "To demonstrate the degeneracy of Laplace learning and the mean shift heuristic in the low label regime, we visualize the distribution of class predictions for MNIST given 1 labeled sampled per class in Figure 4. Vanilla Laplace learning predictions (orange) are concentrated on label ‘7’, with very low prediction accuracy. Solving Laplace learning for shifted labels (blue) still shows an imbalanced class distribution, with a slight increase in performance, whereas mean-shifted Laplace learning (green) exhibits balanced class predictions and a significant increase in performance. ", "page_idx": 15}, {"type": "text", "text": "We demonstrate the robustness of CutSSL to two versions of “imbalance”: imbalance in the label distribution (Tab. 5) and imbalance in the underlying class distribution (Tab. 6). Notably, our method exhibits superior robustness in both cases. ", "page_idx": 16}, {"type": "table", "img_path": "hCOuip5Ona/tmp/7d1e4a7a17cb375918d3bd65d828087f5c3bf3e9a5cb4a87a23eb47782dc9875.jpg", "table_caption": ["Table 5: Imbalanced label regime. Odd classes have 1 label, even classes have 5 labels. "], "table_footnote": [], "page_idx": 16}, {"type": "table", "img_path": "hCOuip5Ona/tmp/dcf8da453bba901777ed50436373471f45293e74407d14921fd992b55be4567c.jpg", "table_caption": ["Table 6: Imbalanced class regime. There are 10 times as many samples for each even class than there are for the odd classes, and one labeled node for each odd class. "], "table_footnote": [], "page_idx": 16}, {"type": "text", "text": "C.2 Graph learning identifies hard samples ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Table 7: Accuracy of different method on the top $5\\%$ , $10\\%$ , $20\\%$ of samples with the smallest margin. ", "page_idx": 16}, {"type": "table", "img_path": "hCOuip5Ona/tmp/69892a0e69fd402dd868cf4ab07b9ccfd64d3bdbdc1115f2163a0d7a81a33f24.jpg", "table_caption": [], "table_footnote": [], "page_idx": 16}, {"type": "text", "text": "Recall that Laplace learning solves a problem of the form ", "page_idx": 16}, {"type": "equation", "text": "$$\nL_{u}X_{\\mathrm{lap}}=B:=-L_{u l}Y.\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "It is then necessary to map the continuous-valued predictions given by $X_{\\mathrm{lap}}$ to elements in the label-set. Usually, the following post-hoc rounding step is performed: ", "page_idx": 16}, {"type": "equation", "text": "$$\n\\ell(i)=\\mathop{\\mathrm{arg\\,\\,\\,max}}_{j\\in1,\\dots,k}\\,(X_{\\mathrm{lap}})_{i j}.\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "However, there is one significant issue with this heuristic, as implied by proposition 4.1 in our paper. At low-label rates, $L_{u}$ is nearly singular and dominated by a large drift-term associated with the vector $L_{u}^{-1}\\mathbf{1}_{n}$ . This term is essentially a constant that is governed by the underlying graph and the distribution of the labeled vertices, but it can dominate any “useful” information and hinder the threshold heurstic. Notably, in the extreme case, thresholding in the low label rate regime results in one class dominating the predictions. This is presented in figure 5, which demonstrates that when the column-argmax heuristic is adopted a single class prediction dominates the rest. ", "page_idx": 16}, {"type": "text", "text": "This particular degeneracy is especially relevant for vertices near the decision boundary- e.g. vertices with corresponding rows in $X_{\\mathrm{lap}}$ that have small margin, where margin is defined ", "page_idx": 16}, {"type": "equation", "text": "$$\n\\operatorname{margin}(i)=\\operatorname*{max}_{j\\in[k]}(X_{\\mathrm{lap}})_{i j}-\\operatorname*{max}_{l\\in[k],:l\\neq j}(X_{\\mathrm{lap}})_{i j}\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "To illustrate this issue and how CutSSL addresses it, in Tab. 7 we evaluate Laplace and Poisson learning (methods that produce continuous-valued predictions) on the Cifar-10 dataset with one sample labeled per class. We then consider the accuracy of each method on the top $5\\%$ , $10\\%$ , $20\\%$ of samples with the smallest margin. We see that CutSSL, which makes discrete predictions, performs much better on samples with small margin. ", "page_idx": 16}, {"type": "text", "text": "", "page_idx": 17}, {"type": "text", "text": "Here, we provide examples of misclassified samples that lie on the “boundary” of their respective partitions. The node boundary of a set $V_{1}$ with respect to a set $V_{2}$ is the set of vertices $v$ in $V_{1}$ such that for some vertex $u$ in $V_{2}$ , there is an edge joining $u$ to $v$ . We show that the examples presented in Figure 5, particularly in the top row for MNIST, correspond to digits which are messily written or easily confused (bottom, Fashion-MNIST). We hypothesize that these challenging samples lie on the cut-boundary between partitions. ", "page_idx": 17}, {"type": "image", "img_path": "hCOuip5Ona/tmp/53729238ae8ab811cf8fe4723222c23f1bc815f35e6d3fa45083ff3ffc4ad30e.jpg", "img_caption": ["Figure 5: (a) Random sample of misclassified images on the cut-boundary on MNIST. (b) misclassified images on the cut-boundary of FashionMnist. "], "img_footnote": [], "page_idx": 17}, {"type": "text", "text": "C.3 Planetoid (Cora, Citeseer, Pubmed) ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "In the main text and earlier in the appendix, we provided numerical results on three popular image datasets. The graphs in those datasets are constructed as kNN graphs. In this section, we evaluate our method on non-kNN graphs corresponding to citation networks, where the graph is given. In these networks, the vertices represent documents and their links refer to citations between documents, while the label corresponds to the topic of the document. Due to the smaller size of these graphs, we set $s=0.05$ . We show in Fig. 2 that our method continues to exhibit significant improvement, beyond the state-of-the-art on these graphs. ", "page_idx": 17}, {"type": "text", "text": "In Table 8, we again outperform competing methods across all datasets and label rates. For example, on Citeseer at 100 labels per class, we outperform Poisson-MBO by $9.4\\%$ . ", "page_idx": 17}, {"type": "text", "text": "We omit results on Volume-MBO [19] due to runtime errors when evaluating the method on these graphs. ", "page_idx": 17}, {"type": "text", "text": "C.4 Ablation study of $S$ and cut objective and graph construction ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "The two underlying motivations of our work are that (1.) the graph-based machine learning setting necessitates the assumption that class structure is tied to the cut structure of the graph (2.) searching for near-integer solutions when solving the semi-supervised partitioning problem is critical at lowlabel rates. We demonstrate this below by evaluating various choices of $S$ as well as evaluating the quality of the integer partitioning implied by the integer-rounded predictions made by various methods across datasets in Table 9. ", "page_idx": 17}, {"type": "text", "text": "Additionally, we discuss the choice of $S\\,=\\,s D$ . $s$ is the primary hyperparameter of the CutSSL algorithm. As mentioned in the main text, our choice of $S$ is motivated from the perspective of regularization. A large enough choice of $s$ results in an indefinite or concave problem that has a combinatorial number of local minima. By choosing an appropriate sequence of $s$ , we can control the number of poor local minima. In Figure 6(a) we demonstrate convergence with respect to the objective of (10) and (b) proximity to an integral solution with various choices of $s$ . In Figure 7, we plot various measures associated with three different sequences $(s_{0},s_{1},\\dotsc,s_{T})^{2}$ , with $s_{0}=0$ and $s_{T}=0.5$ . Each $s_{t}$ is determined by $s_{t}=s_{t-1}+d$ for some fixed constant $d$ . It can be seen that ", "page_idx": 17}, {"type": "text", "text": "Table 8: Average accuracy over 100 trials evaluated on the largest connected subgraph with standard deviation in brackets. Best is bolded. ", "page_idx": 18}, {"type": "table", "img_path": "hCOuip5Ona/tmp/0ca5e49f1af69a591ff448d4e89e5ee1784bfe714f275ec646c81742402d84ec.jpg", "table_caption": [], "table_footnote": [], "page_idx": 18}, {"type": "table", "img_path": "hCOuip5Ona/tmp/641e7a90577e94148fb565a13c959ce9763cea42adc1b4a0575ec56981724dd2.jpg", "table_caption": ["Table 9: Average cut value, given by $t r(X^{\\top}W X)$ over 100 trials evaluated with standard deviation in brackets. Units are $10^{3}$ . Best is bolded. "], "table_footnote": [], "page_idx": 18}, {"type": "text", "text": "(1.) that $s$ need not be chosen to exactly satisfy the condition in Proposition. 3.2, i.e. may be chosen significantly less than the proposition implies to recover an integer solution. And (2.) our formulation is reasonably robust to the choice of the sequence of $s$ , i.e. one only needs to select a few values of $s$ on which to run the algorithm ( $d$ can be chosen quite large). As mentioned in the main text, for our experiments we use sequences of length 3 (i.e. 3 s). ", "page_idx": 18}, {"type": "text", "text": "In Table 10 we report the change in accuracy for various choices of the parameter $k$ , used in the construction of the underlying $k$ -NN graph. The change is reported with respect to $k=10$ (the value used in results reported in the rest of the experiments). Mean and standard deviation are provided in parenthesis over 100 trials. We do observe some variation in the accuracy, however the results are mostly robust to different choices of $k$ . Notably, the relative performance remains consistent (i.e., ", "page_idx": 18}, {"type": "image", "img_path": "hCOuip5Ona/tmp/6ff1bf997f8ded0932d203624f02f10857ef58671af0f49a7c105fd98ee283ef.jpg", "img_caption": ["Figure 6: (a) Cut value of class assignments with respect to $\\mathcal{L}$ . Strict descent is not guaranteed due to nonconvexity. (b) Distribution over $\\operatorname*{max}_{i}X_{i}$ for various choices of $s$ on Cifar-10. Larger $s$ leads to Boolean-valued solutions. "], "img_footnote": [], "page_idx": 19}, {"type": "image", "img_path": "hCOuip5Ona/tmp/09e458d3e0c3d90744840a4bc298eb3cd42c67daa45deec69c96f53627d0e0d3.jpg", "img_caption": ["Figure 7: Comparison between different sequences of $s$ on MNIST. For various $s$ over three sequences, we plot the cut objective (a), accuracy (b), and proximity to integral solution (c). "], "img_footnote": [], "page_idx": 19}, {"type": "text", "text": "CutSSL continues to outperform the other methods). One very interesting observation is that for CutSSL, the accuracy tends to improve with the value of $k$ , although it’s possible that the accuracy could deteriorate for larger values of $k$ . ", "page_idx": 19}, {"type": "table", "img_path": "hCOuip5Ona/tmp/e630ea934fd2ecefc67ed2c43716987ce08677fd80398ff4c3472131f10227eb.jpg", "table_caption": ["Table 10: Ablation study on neighborhood graph construction (choice of $k$ ). "], "table_footnote": [], "page_idx": 19}, {"type": "text", "text": "In Table 11 we evaluate the effect mechanism used to construct the graph on MNIST. First, we evaluate two variants of weighting edges of the KNN-based method adopted in the main text. Singular refers to weights of the form $\\bar{w_{i j}}=\\bar{1}/||x_{i}-x_{j}||_{2}$ , where $x_{i}$ and $x_{j}$ are the features of the $i$ -th and $j$ -th data points. Uniform refers to $w_{i j}=1$ , i.e. an unweighted graph. In the third column, we evaluate a more sophisticated method for graph construction based on Non-Negative kernel regression (NNK) [28]. As opposed to the KNN-based methods, which only consider the distance (or similarity) between the query and the data, the NNK-based method takes into account the relative position of the neighbors themselves. Note that our CutSSL out-performs Poisson-MBO for the different graph weighting methods and NNK construction. ", "page_idx": 19}, {"type": "text", "text": "D Details of Previous work ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "In this section, we provide further details on two state of the art methods for volume-preserving label refinement. ", "page_idx": 19}, {"type": "table", "img_path": "hCOuip5Ona/tmp/fb129fb12558460dda062ce5457035334bfcec4720d44502f1476098579b3f37.jpg", "table_caption": ["Table 11: Ablation study on neighborhood graph construction (choice of $w_{i j}$ ). "], "table_footnote": [], "page_idx": 20}, {"type": "text", "text": "D.1 PoissonMBO [10] ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "[10] propose a graph-cut method to incrementally adjust a seed decision boundary so as to improve the label accuracy and account for prior knowledge of class sizes. The proposed method applies several steps of gradient descent on the graph-cut problem: ", "page_idx": 20}, {"type": "equation", "text": "$$\n\\operatorname*{min}_{u}\\frac{1}{2}||\\nabla u||_{\\ell^{2}(X)^{2}}^{2}+\\frac{1}{\\tau}\\sum_{i=1}^{n}\\prod_{j=1}^{k}|u(x_{i})-u_{j}|^{2}\n$$", "text_format": "latex", "page_idx": 20}, {"type": "text", "text": "More concretely, the time-spitting scheme that alternates gradient descent on two energy functionals is employed: ", "page_idx": 20}, {"type": "equation", "text": "$$\n\\begin{array}{l l}{\\displaystyle E_{1}({\\boldsymbol u}):=\\frac{1}{2}||\\nabla{\\boldsymbol u}||_{\\ell^{2}(X)^{2}}^{2}-\\mu\\displaystyle\\sum_{j=1}^{m}(y_{k}-\\bar{y})\\cdot{\\boldsymbol u}(x_{j})}\\\\ {\\displaystyle E_{2}({\\boldsymbol u}):=\\frac{1}{\\tau}\\sum_{i=1}^{n}\\displaystyle\\prod_{j=1}^{k}|{\\boldsymbol u}({\\boldsymbol x}_{i})-{\\boldsymbol u}_{j}|^{2}}\\end{array}\n$$", "text_format": "latex", "page_idx": 20}, {"type": "text", "text": "The first term $E_{1}$ corresponds to the Poisson learning objective. Gradient descent on the second term $E_{2}$ , when $\\tau>0$ is small, amounts to projecting each $u(x_{i})\\in\\mathbb{R}^{k}$ to the closest label vector $e_{j}\\in S_{k}$ , while preserving the volume constraint $(u)X=b$ . This projection is approximated this by the following procedure: Let $P r o j(S_{k}):\\mathbb{R}^{k}\\rightarrow S_{k}$ be the closest point projection, let $s_{1},\\ldots,s_{k}>0$ be positive weights, and set ", "page_idx": 20}, {"type": "equation", "text": "$$\nu^{t+1}(x_{i})=\\mathrm{Proj}_{S_{k}}(\\mathrm{diag}(s_{1},\\ldots,s_{k})u^{t}(x_{i}))\n$$", "text_format": "latex", "page_idx": 20}, {"type": "text", "text": "where $\\mathrm{diag}(s_{1},\\ldots,s_{k})$ is the diagonal matrix with diagonal entries $s_{1},\\ldots,s_{k}$ . We use a simple gradient descent scheme to choose the weights $s_{1},\\ldots,s_{k}>0$ so that the volume constraint $(u^{t+\\Bar{1}})\\check{X}=b$ holds. ", "page_idx": 20}, {"type": "text", "text": "Note that Poisson MBO requires a fidelity parameter $\\mu$ , two parameters $N_{i n n e r}$ and $N_{o u t e r}$ , and a time step parameter $\\tau$ , and additional clipping values $s_{m i n}$ and $s_{m a x}$ . ", "page_idx": 20}, {"type": "text", "text": "D.2 VolumeMBO [19] ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "The work of [19] provides an alternative way to enforce explicit class balance constraints with a volume constrained MBO method based on auction dynamics. Their method uses a graph-cut based approach with a Voronoi-cell based initialization. ", "page_idx": 20}, {"type": "text", "text": "More concretely, the solve a volume-constrained cut problem via successive linearizations. I.e., each iteration of the algorithm necessitates finding a solution to the following problem: ", "page_idx": 20}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\underset{Z}{\\operatorname*{max}}-W Z}\\\\ &{\\mathrm{s.t.}~Z1=1,~Z\\geq0,~Z^{\\top}1=m}\\end{array}\n$$", "text_format": "latex", "page_idx": 20}, {"type": "text", "text": "E Algorithm derivations ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Here, we describe algorithms referenced in the main text, including a projected CG method for solving (18) and a variant of the ADMM method introduced to solve (8) that incorporates a step size parameter. ", "page_idx": 20}, {"type": "text", "text": "E.1 Detailed derivation of iterates $X$ $\\!\\,,\\mu_{1},\\mu_{2}$ in Sec. 3.2 ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Here, we provide the details on the derivations of the ADMM iterates and Lagrange multiplier updates $\\mu_{1}$ and $\\mu_{2}$ . ", "page_idx": 21}, {"type": "text", "text": "First, define the Lagrangian, $G(X,T,\\Lambda)$ to be the objective of the following problem: ", "page_idx": 21}, {"type": "equation", "text": "$$\n\\begin{array}{l}{\\displaystyle\\operatorname*{max}_{\\Lambda\\in\\mathbb{R}^{n\\times k}}\\displaystyle\\operatorname*{min}_{X,T\\in\\mathbb{R}^{n\\times k}}\\frac{1}{2}t r(X^{\\top}L_{u,s}X)-t r(X^{\\top}B)}\\\\ {\\displaystyle+\\,t r(\\Lambda^{\\top}(X-T))+\\frac{1}{2}||X-T||^{2}}\\\\ {\\mathrm{~s.t.~}X^{\\top}\\mathbf{1}_{n}=\\mathbf{m},\\ X\\mathbf{1}_{k}=\\mathbf{1}_{n},\\ T\\geq0.}\\end{array}\n$$", "text_format": "latex", "page_idx": 21}, {"type": "text", "text": "The first-order optimality conditions on $X$ are ", "page_idx": 21}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{0=L_{u,s}X-B+\\Lambda+(X-T)+\\mathbf{1}_{n}\\mu_{1}^{\\top}+\\mu_{2}\\mathbf{1}_{k}^{\\top}}\\\\ &{\\implies X=\\bar{L}_{u,s}^{-1}(B+T-\\Lambda-\\mathbf{1}_{n}\\mu_{1}^{\\top}-\\mu_{2}\\mathbf{1}_{k}^{\\top}),}\\end{array}\n$$", "text_format": "latex", "page_idx": 21}, {"type": "text", "text": "where $\\mu_{1}\\,\\in\\,\\mathbb{R}^{k}$ and $\\mu_{2}\\,\\in\\,\\mathbb{R}^{n}$ are associated with the constraints $X^{\\top}\\mathbf{1}_{n}\\,=\\,\\mathbf{m}$ and $X\\mathbf{1}_{k}\\,=\\,\\mathbf{1}_{n}$ respectively, and $\\bar{L}_{u,s}=L_{u,s}+I$ . The optimality conditions associated with $(\\mu_{1},\\mu_{2})$ are recovered by applying the constraint $X^{\\top}\\mathbf{1}_{n}=\\mathbf{m}$ . ", "page_idx": 21}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathbf{m}=X^{\\top}\\mathbf{1}_{n}}\\\\ &{\\quad=\\{\\bar{L}_{u,s}^{-1}(B+T-\\Lambda-\\mathbf{1}_{n}\\mu_{1}^{\\top}-\\mu_{2}\\mathbf{1}_{k}^{\\top})\\}^{\\top}\\mathbf{1}_{n}}\\\\ &{\\quad=(B+T-\\Lambda-\\mathbf{1}_{n}\\mu_{1}^{\\top}-\\mu_{2}\\mathbf{1}_{k}^{\\top})^{\\top}\\bar{L}_{u,s}^{-1}\\mathbf{1}_{n}.}\\end{array}\n$$", "text_format": "latex", "page_idx": 21}, {"type": "text", "text": "Let $c=\\mathbf{1}_{n}^{\\top}\\bar{L}_{u,s}^{-1}\\mathbf{1}_{n}$ . ", "page_idx": 21}, {"type": "text", "text": "Solving for $\\mu_{1}$ , ", "page_idx": 21}, {"type": "equation", "text": "$$\n\\begin{array}{r}{(B+T-\\Lambda-\\mu_{2}\\boldsymbol{1}_{k}^{\\top})^{\\top}\\bar{L}_{u,s}^{-1}\\mathbf{1}_{n}-\\mathbf{m}=\\mu_{1}c}\\end{array}\n$$", "text_format": "latex", "page_idx": 21}, {"type": "text", "text": "and ", "page_idx": 21}, {"type": "equation", "text": "$$\n\\mu_{1}=c^{-1}\\{(B+T-\\Lambda-\\mu_{2}\\mathbf{1}_{k}^{\\top})^{\\top}{\\bar{L}}_{u,s}^{-1}\\mathbf{1}_{n}-\\mathbf{m}\\}\n$$", "text_format": "latex", "page_idx": 21}, {"type": "text", "text": "Similarly, ", "page_idx": 21}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathbf{1}_{n}=X\\mathbf{1}_{k}}\\\\ &{\\phantom{\\quad}=\\{{\\bar{L}}_{u,s}^{-1}(B+T-\\Lambda-\\mathbf{1}_{n}\\mu_{1}^{\\top}-\\mu_{2}\\mathbf{1}_{k}^{\\top})\\}\\mathbf{1}_{k}}\\\\ &{\\phantom{\\quad}={\\bar{L}}_{u,s}^{-1}\\{(B+T-\\Lambda-\\mathbf{1}_{n}\\mu_{1}^{\\top}-\\mu_{2}\\mathbf{1}_{k}^{\\top})\\}\\mathbf{1}_{k}}\\end{array}\n$$", "text_format": "latex", "page_idx": 21}, {"type": "text", "text": "Solving for $\\mu_{2}$ , ", "page_idx": 21}, {"type": "equation", "text": "$$\n(B+T-\\Lambda-\\mathbf{1}_{n}\\mu_{1}^{\\top})\\mathbf{1}_{k}-{\\bar{L}}_{u,s}\\mathbf{1}_{n}=k\\mu_{2}\n$$", "text_format": "latex", "page_idx": 21}, {"type": "text", "text": "and ", "page_idx": 21}, {"type": "equation", "text": "$$\n\\mu_{2}=\\frac{1}{k}\\{(B+T-\\Lambda-{\\bf1}_{n}\\mu_{1}^{\\top}){\\bf1}_{k}-\\bar{L}_{u,s}{\\bf1}_{n}\\}\n$$", "text_format": "latex", "page_idx": 21}, {"type": "text", "text": "E.2 ADMM with adaptive step size for CutSSL ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "In this section, we introduce a variation of the algorithm presented in the main text. Here, we augment the algorithm with an additional tunable parameter $\\beta$ . This parameter offers flexibility depending on structure of the problem. In particular, the update to $X$ is characterized by a linear system with matrix $L_{u,s}+\\beta I$ . To ensure efficient computation of its inverse, $\\beta$ needs to be chosen sufficiently large. However, the price of a large $\\beta$ is convergence to an integer solution. This tradeoff needs to be carefully considered in the context of the graph and the label rate when selecting $\\beta$ . For all our experiments, we choose $\\beta=1$ . ", "page_idx": 21}, {"type": "text", "text": "One may speed up the empirical rate of convergence of ADMM-type algorithms by integrating an adaptive step-size with the quadratic dual term in the augmented Lagrangian. ", "page_idx": 21}, {"type": "text", "text": "First, introduce multipliers $\\mu_{1}\\in\\mathbb{R}^{k},\\mu_{2}\\in\\mathbb{R}^{n},\\nu\\in\\mathbb{R}^{n\\times k}$ and recall the Lagrangian associated with (20). ", "page_idx": 21}, {"type": "equation", "text": "$$\n\\widehat{\\gamma}(X,\\mu_{1},\\mu_{2},\\nu)=\\frac{1}{2}t r(X^{\\top}L_{u,s}X)-t r(X^{\\top}B)-\\mu_{2}^{\\top}(X\\mathbf{1}_{k}-\\mathbf{1}_{n})-\\mu_{1}^{\\top}(X^{\\top}\\mathbf{1}_{n}-\\mathbf{m})-t r(\\nu^{\\top}X).\n$$", "text_format": "latex", "page_idx": 21}, {"type": "text", "text": "The KKT condition of $X$ in (47) is ", "page_idx": 22}, {"type": "equation", "text": "$$\n\\nu=L_{u,s}X-B-\\mathbf{1}_{n}\\mu_{1}^{\\top}-\\mu_{2}\\mathbf{1}_{k}^{\\top}\\geq0,\n$$", "text_format": "latex", "page_idx": 22}, {"type": "text", "text": "and $X_{i j}=0$ must hold for those $(i,j)$ with $\\nu_{i j}>0$ . ", "page_idx": 22}, {"type": "text", "text": "As mentioned in the main text, ADMM is carried out to reach a saddle point of $\\mathrm{max}_{\\Lambda}\\operatorname*{min}_{X,T}\\mathcal{G}_{\\beta}(X,T,\\Lambda)$ where ", "page_idx": 22}, {"type": "equation", "text": "$$\n\\mathcal{G}(\\boldsymbol{X},\\boldsymbol{T},\\boldsymbol{\\Lambda})=\\frac12t r(\\boldsymbol{X}^{\\top}\\boldsymbol{L}_{u,s}\\boldsymbol{X})-t r(\\boldsymbol{X}^{\\top}\\boldsymbol{B})+t r(\\boldsymbol{\\Lambda}^{\\top}(\\boldsymbol{X}-\\boldsymbol{T}))+\\frac\\beta2||\\boldsymbol{X}-\\boldsymbol{T}||_{F}^{2}\n$$", "text_format": "latex", "page_idx": 22}, {"type": "text", "text": "subject to ", "page_idx": 22}, {"type": "equation", "text": "$$\nT\\geq0,X\\mathbf{1}_{k}=\\mathbf{1}_{n},X^{\\top}\\mathbf{1}_{n}=\\mathbf{m}.\n$$", "text_format": "latex", "page_idx": 22}, {"type": "text", "text": "To implement the update of $X$ , we observe that the optimality condition of $X$ is ", "page_idx": 22}, {"type": "equation", "text": "$$\nL_{u,s}X-B+\\Lambda+\\beta(X-T)-\\mathbf{1}_{n}\\mu_{1}^{\\top}-\\mu_{2}\\mathbf{1}_{k}^{\\top}=0\n$$", "text_format": "latex", "page_idx": 22}, {"type": "text", "text": "Decompose $X$ . $X=X_{0}+X_{1}$ , where $X_{1}$ is the fixed matrix $X_{1}=n^{-1}\\mathbf{1}_{n}\\mathbf{m}^{\\top}$ . This decomposition implies that $X_{0}$ has sum-zero rows and columns, i.e. $X_{0}\\mathbf{1}_{k}=0$ and $X_{0}^{\\top}\\mathbf{1}_{n}=0$ . Hence, we can determine $X_{0}$ from ", "page_idx": 22}, {"type": "equation", "text": "$$\n\\begin{array}{r}{L_{u,s}X_{0}+\\beta X_{0}=\\mathbf{1}_{n}\\mu_{1}^{\\top}+\\mu_{2}\\mathbf{1}_{k}^{\\top}-L_{u,s}X_{1}-\\beta X_{1}+\\beta T-\\Lambda+B.}\\end{array}\n$$", "text_format": "latex", "page_idx": 22}, {"type": "text", "text": "Apply the projections $P_{1}=I-\\mathbf{1}_{n}\\mathbf{1}_{n}^{\\top}/n$ and $P_{2}=I-\\mathbf{1}_{k}\\mathbf{1}_{k}^{\\top}/k$ to remove the column and row sums on both sides (to eliminate $\\mu_{1}$ and $\\mu_{2}$ ): ", "page_idx": 22}, {"type": "equation", "text": "$$\nX_{0}=(P_{1}L_{u,s}P_{1}+\\beta P_{1})^{\\dagger}P_{1}(-L_{u,s}X_{1}-\\beta X_{1}+\\beta T-\\Lambda+B)P_{2},\n$$", "text_format": "latex", "page_idx": 22}, {"type": "text", "text": "Next, the update of $T$ and $\\Lambda$ proceed as before: ", "page_idx": 22}, {"type": "equation", "text": "$$\nT\\gets\\operatorname*{max}(\\beta^{-1}\\Lambda+X,0),\\quad\\Lambda\\gets\\Lambda+\\beta(X-T)\n$$", "text_format": "latex", "page_idx": 22}, {"type": "text", "text": "Once ADMM converges, i.e., $\\vert\\vert X-T\\vert\\vert\\to0$ , according to (54) and $T\\geq0$ , we have that $\\Lambda_{i j}\\leq0$ and $\\Lambda_{i j}=0$ holds for $X_{i j}>0$ . Additionally, by (51), we have ", "page_idx": 22}, {"type": "equation", "text": "$$\n\\begin{array}{r}{L_{u,s}X-B-\\mathbf{1}_{n}\\mu_{1}^{\\top}-\\mu_{2}\\mathbf{1}_{k}^{\\top}=-\\Lambda\\geq0,}\\end{array}\n$$", "text_format": "latex", "page_idx": 22}, {"type": "text", "text": "i.e., we reach a KKT point associated with the condition (48). ", "page_idx": 22}, {"type": "text", "text": "E.3 Projected Conjugate Gradient for Laplace learning with cardinality constraints ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Consider the problem ", "page_idx": 22}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\underset{X\\in\\mathbb{R}^{n\\times k}}{\\operatorname*{min}}\\left\\{f(X)=\\frac{1}{2}t r(X^{\\top}L_{u}X)-t r(X^{\\top}B)\\right\\}}\\\\ &{\\mathrm{~s.t.~}X^{\\top}\\mathbf{1}_{n}=\\mathbf{m}}\\end{array}\n$$", "text_format": "latex", "page_idx": 22}, {"type": "text", "text": "In practice, large-scale Laplacian linear systems are typically solved using preconditioned conjugate gradient. Given the associated equality-constrained problem ", "page_idx": 22}, {"type": "equation", "text": "$$\n\\begin{array}{l}{\\displaystyle\\operatorname*{min}_{X}\\frac{1}{2}\\langle X,L_{u}X\\rangle-\\langle X,B\\rangle}\\\\ {\\displaystyle\\operatorname{s.t.}X^{\\top}\\mathbf{1}_{n}=\\mathbf{m}}\\end{array}\n$$", "text_format": "latex", "page_idx": 22}, {"type": "text", "text": "One practical modification of conjugate gradient involves first choosing a feasible initialization $X_{0}$ satisfying $X^{\\top}\\mathbf{1}_{n}=\\mathbf{m}$ and running projected conjugate gradient Chapter 16.3 [27], ensuring that intermediate residuals—update directions—lie in the orthogonal complement of ${\\bf1}_{n}$ . Termination is determined according to the residual. ", "page_idx": 22}, {"type": "text", "text": "F Limitations and Broader Impact ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Here, we list several limitations and briefly touch upon the broader societal impact of our method. ", "page_idx": 23}, {"type": "text", "text": "• Underlying graph structure: Much of this work relies on the structure of the underlying graph. In this work, we explored the applicability of our method to $k$ -NN graphs, generated from neural network-derived features and citation networks. • The choice of $S=s D$ is one heuristic that satisfies the conditions outlined in Hager’s paper [17]. We are currently exploring the effect of different choices of $S$ on the convergence and overall efficacy of our method. Additionally, it is interesting to consider how the graph structure, number of unlabeled and labeled nodes might inform better choices of $S$ . ", "page_idx": 23}, {"type": "text", "text": "Regarding the broader societal impact of our method, we have introduced a new method for graph learning that improves on the state of the art across multiple label-rate regimes. The development of such methods has positive and negative ramifications for civil liberties and human rights. While the positive ramifications are relatively clear—models which require less data are cheaper to train and are generally “lower-impact”—the negative consequences are not immediately obvious. The above question is explored in greater detail in the context of semi-supervised graph learning in Fairness Zhang et al. [35]. The principal claim made by Zhang et al. [35] is that when quantities of unlabeled data are provided, label propagation may be modified to improve fairness. ", "page_idx": 23}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Justification: We confirm that the claims made in the abstract and introduction are accurately justified by experiments and theoretical results presented in the main text. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 24}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Justification: We have included a discussion on the limitations of our method in section F in the appendix. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 24}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "Justification: For each theoretical statement, we provide a complete proof in section B in the appendix. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 25}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "Justification: We have taken steps to ensure reproducibility, e.g. by providing the implementation of the core algorithm and experimental setup in Colab. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 25}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 26}, {"type": "text", "text": "Justification: An implementation of the core algorithm and experimental setup is provided in a footnote in the abstract. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 26}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 26}, {"type": "text", "text": "Justification: Experimental details are provided in section C in the appendix. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 26}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Justification: Standard deviations are provided for the statistics reported in the main text. Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 26}, {"type": "text", "text": "", "page_idx": 27}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 27}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 27}, {"type": "text", "text": "Justification: The details of the computational resources are provided in section C. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 27}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 27}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 27}, {"type": "text", "text": "Justification: We confirm that the research conducted in the paper conforms with the NeurIPS Code of Ethics. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 27}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 27}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 27}, {"type": "text", "text": "Justification: We have included a discussion of the broader impact of our work in section F in the appendix. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed. • If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact. ", "page_idx": 27}, {"type": "text", "text": "• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 28}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 28}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 28}, {"type": "text", "text": "Justification: We use standard image, citation, and product network benchmarks to evaluate our method. ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 28}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 28}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 28}, {"type": "text", "text": "Justification: We have included citations to benchmarks and code where appropriate. Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 28}, {"type": "text", "text": "", "page_idx": 29}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 29}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 29}, {"type": "text", "text": "Justification: Beyond code to reproduce our method, we have not introduced new assets in this work. ", "page_idx": 29}, {"type": "text", "text": "Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 29}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 29}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 29}, {"type": "text", "text": "Justification: Our work does not involve crowdsourcing or research with human subjects. Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 29}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 29}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 29}, {"type": "text", "text": "Justification: The paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 29}, {"type": "text", "text": "", "page_idx": 30}]