[{"figure_path": "ojIhvhQBAQ/figures/figures_8_1.jpg", "caption": "Figure 3: If x lies within a balanced convex set K, then many points close to x lie within K as well, i.e., there is a cone R' with R' ⊆ B(x, e) ∩ K, where B(x, ρ) is a ball around x. The ball centered at xe exists due to the fact that K is balanced: any balanced convex set contains some ball with non-negligible radius. The convex hull of x and the ball at xĉ lies within K. (See also Fig. 3)", "description": "This figure illustrates a key geometric property of balanced convex sets used in the proof of Lemma E.12.  It shows that if a point x lies within a balanced convex set K, then a substantial portion of a ball centered at x (B(x, ρ)) also lies within K.  This is because a balanced convex set must contain a smaller ball (with non-negligible radius) somewhere within it. The diagram visually represents this by showing a cone (R') within both the ball B(x, ρ) and the set K, highlighting the significant overlap.", "section": "B.1 Boundary Smoothness of Structured Concepts"}, {"figure_path": "ojIhvhQBAQ/figures/figures_26_1.jpg", "caption": "Figure 2: Discretization of smooth boundary", "description": "This figure illustrates how to discretize the disagreement region between two functions with smooth boundaries in order to obtain a localized discrepancy tester. The figure shows two functions, F and F, along with their respective boundaries. A grid is overlaid onto the region near the boundaries. The grid cells that have non-zero intersection with the disagreement region (shaded areas) are identified. The shaded regions show where the two functions disagree. By bounding the probability mass of these shaded areas, the discrepancy between the two functions can be bounded. This is achieved by bounding the probability of falling in each of the cells according to its size (proportionally to the region's thickness) and the anti-concentration property.", "section": "D Cylindrical Grids Tester"}, {"figure_path": "ojIhvhQBAQ/figures/figures_37_1.jpg", "caption": "Figure 3: If x lies within a balanced convex set K, then many points close to x lie within K as well, i.e., there is a cone R' with R' ⊆ B(x, ρ) ∩ K, where B(x, ρ) is a ball around x. The ball centered at xĉ exists due to the fact that K is balanced: any balanced convex set contains some ball with non-negligible radius. The convex hull of x and the ball at xĉ lies within K. (See also Fig. 3)", "description": "This figure illustrates the concept of local balancedness for convex sets.  If a point x is inside a balanced convex set K, then a significant portion of the points in a small region around x (denoted by B(x, ρ)) are also in K. This is because a balanced convex set contains a ball of non-negligible radius, and the convex hull of x and this ball is a subset of K. The cone R' visually represents the substantial portion of the neighborhood B(x, ρ) that lies within K, highlighting the concept of local balancedness.", "section": "Appendix B"}]