[{"figure_path": "2pgc5xDJ1b/figures/figures_1_1.jpg", "caption": "Figure 1: Inferring the out-of-sample losses of a policy π. (a) The loss L is bounded by an upper limit la with a probability of at least 1 - a. The RCT-based limit curve uses only trial data, whereas the other limit curves also utilize a sampling model trained using additional covariate data X from the target population. Each limit curve in blue is certified to provide valid inferences for models miscalibrated up to a degree I defined in (3). (b) Gap between the actual probability of exceeding the limit, L > la, and the nominal probability of miscoverage a. A negative gap means the inference la is invalid, while a positive gap implies it is valid but conservative. Details of the experiment are presented in Section 5.1.", "description": "The figure shows how to infer the out-of-sample losses of a policy π using both trial data and additional covariate data from the target population. Subfigure (a) shows limit curves for different degrees of model miscalibration, demonstrating that the proposed method provides valid inferences even with miscalibrated models. Subfigure (b) shows the miscoverage gap, which is the difference between the actual probability of exceeding the limit and the nominal probability. A positive gap means that the inference is valid but conservative, while a negative gap indicates that the inference is invalid.", "section": "1 Introduction"}, {"figure_path": "2pgc5xDJ1b/figures/figures_2_1.jpg", "caption": "Figure 2: Causal structure of process (a) under policy as well as (b) the trial study. Sampling indicator S distinguishes between the two. For the important case of RCT, assignment of A is not influenced by any covariates so that the path X → A is eliminated.", "description": "This figure shows the causal structure of the decision process under a policy (Figure 2(a)) and in a trial study (Figure 2(b)).  The variable S is an indicator for whether the data comes from the target population (S=0) or the trial population (S=1).  The figure shows the causal relationships between covariates X, unmeasured selection factors U, actions A, and losses L.  The key difference between (a) and (b) is that in the RCT scenario (b), there is no direct causal link between the covariates X and the actions A.", "section": "2 Problem Formulation"}, {"figure_path": "2pgc5xDJ1b/figures/figures_3_1.jpg", "caption": "Figure 3: (a) Omitting measured selection factors to benchmark credible values for Γ in (3). (b) Inferred blood mercury levels [µg/L] in a target population under 'high' and 'low' seafood consumption (π₁ and πο, respectively). Limit curves for degrees of odds miscalibration Γ∈ [1, 2].", "description": "Figure 3(a) shows how omitting measured covariates (age, income, education) from the model of selection odds p(S|X) helps in establishing credible values for the parameter Γ, representing the degree of miscalibration. Figure 3(b) displays the inferred blood mercury levels for a target population based on different seafood consumption policies ('high' - π₁, 'low' - πο). The limit curves, illustrating upper bounds for losses under these policies, are depicted for different levels of odds miscalibration (Γ = 1, 1.5, 2).", "section": "5 Numerical Experiments"}, {"figure_path": "2pgc5xDJ1b/figures/figures_6_1.jpg", "caption": "Figure 4: Reliability diagram of the observed odds against the average predicted nominal odds obtained from models p(S|X).", "description": "This figure shows a reliability diagram.  A reliability diagram is a graphical way to assess the calibration of a predictive model, specifically focusing on how well predicted probabilities align with observed outcomes.  The x-axis shows the average predicted probability (nominal odds), and the y-axis shows the average observed probability (true odds). A perfectly calibrated model would have all points lying along the diagonal line. Deviations from the diagonal indicate miscalibration. This diagram specifically examines the model p(S|X) used for estimating the probability of an individual being sampled from the target population (S=0) or trial population (S=1) given their covariates X. The plot shows results for XGBoost model, which appears reasonably well-calibrated.", "section": "4 Method"}, {"figure_path": "2pgc5xDJ1b/figures/figures_6_2.jpg", "caption": "Figure 1: Inferring the out-of-sample losses of a policy π. (a) The loss L is bounded by an upper limit la with a probability of at least 1 - a. The RCT-based limit curve uses only trial data, whereas the other limit curves also utilize a sampling model trained using additional covariate data X from the target population. Each limit curve in blue is certified to provide valid inferences for models miscalibrated up to a degree I defined in (3). (b) Gap between the actual probability of exceeding the limit, L > la, and the nominal probability of miscoverage a. A negative gap means the inference la is invalid, while a positive gap implies it is valid but conservative. Details of the experiment are presented in Section 5.1.", "description": "This figure shows the results of an experiment to infer the out-of-sample losses of a policy.  It compares the performance of using only randomized controlled trial (RCT) data versus also using additional covariate data from the target population and a sampling model.  The plots show the upper bound of the loss with a given probability, along with the gap between the actual and nominal probabilities of exceeding that bound.  This demonstrates the method's ability to provide valid inferences even with miscalibrated models.", "section": "5 Numerical Experiments"}, {"figure_path": "2pgc5xDJ1b/figures/figures_7_1.jpg", "caption": "Figure 5: Odds p(S = 0|X)/p(S = 1|X) compared with nominal odds obtained from logistic and XGBoost models p(S|X). The dots are a random subsample of the trial samples.", "description": "This figure compares the true selection odds (the ratio of the probability of being from the target population to the probability of being from the trial population, given covariates X) to the selection odds predicted by two different models: a logistic model and an XGBoost model.  The heatmaps represent the estimated odds from each model.  The dots show a random sample of points from the trial data.  The purpose of the figure is to visually show how well the models capture the true selection odds. It demonstrates that the XGBoost model is a better fit for this specific dataset.", "section": "5.1 Illustrations using synthetic data"}, {"figure_path": "2pgc5xDJ1b/figures/figures_7_2.jpg", "caption": "Figure 5: Odds p(S = 0|X)/p(S = 1|X) compared with nominal odds obtained from logistic and XGBoost models p(S|X). The dots are a random subsample of the trial samples.", "description": "This figure compares the true odds of selection (p(S=0|X)/p(S=1|X)) with the odds predicted by two different models: a logistic model and an XGBoost model.  The true odds represent the actual probability of an individual from the target population being sampled in the trial, given their covariates X. The predicted odds from the models aim to estimate these true odds. The plots visualize the results for two different target populations (A and B). Each subplot displays a heatmap showing the true odds (leftmost column) and the predicted odds from each model. The dots represent a random selection of the data from the trial population. The visual comparison helps assess the accuracy of the different models in predicting the true selection odds and can inform the level of potential model miscalibration (Γ).", "section": "5.1 Illustrations using synthetic data"}, {"figure_path": "2pgc5xDJ1b/figures/figures_8_1.jpg", "caption": "Figure 6: Evaluating a ‘treat all’ policy π₁ for target population B. (a) Benchmarking the degree of miscalibration Γ using omitted covariates. (b) Miscoverage gaps when degree of miscalibration Γ∈ [1, 2].", "description": "This figure shows the results of benchmarking the degree of miscalibration (Γ) for the \"treat all\" policy (π₁) applied to target population B.  Panel (a) shows how the selection odds ratio changes when covariates are omitted, providing a benchmark to choose a reasonable Γ value.  Panel (b) illustrates the miscoverage gap – the difference between the nominal and actual probability of exceeding a loss limit (lα) – for different Γ values and nominal probabilities (α).  A positive gap indicates a valid, but conservative, inference; a negative gap signifies an invalid inference. This analysis helps determine the credibility of the policy evaluation under varying degrees of model miscalibration.", "section": "5 Numerical Experiments"}, {"figure_path": "2pgc5xDJ1b/figures/figures_16_1.jpg", "caption": "Figure 5: Odds p(S = 0|X)/p(S = 1|X) compared with nominal odds obtained from logistic and XGBoost models p(S|X). The dots are a random subsample of the trial samples.", "description": "This figure compares the true selection odds (the ratio of probabilities of being in the target population given covariates X) with the selection odds predicted by logistic and XGBoost models. It helps to assess the quality of the sampling model used in the proposed method.  The dots represent a random sample from the trial data, providing a visual comparison of the model predictions against the true ratios.", "section": "5.1 Illustrations using synthetic data"}, {"figure_path": "2pgc5xDJ1b/figures/figures_16_2.jpg", "caption": "Figure 5: Odds p(S = 0|X)/p(S = 1|X) compared with nominal odds obtained from logistic and XGBoost models p(S|X). The dots are a random subsample of the trial samples.", "description": "This figure compares the true selection odds, p(S=0|X)/p(S=1|X), with the selection odds predicted by a logistic regression model and an XGBoost model. The true odds represent the ratio of the probability of observing a sample from the target population to the probability of observing a sample from the trial population, conditional on the covariates X.  The logistic and XGBoost models are trained on the trial data to estimate this ratio. The dots represent a random subsample of the trial samples.  The visualization helps assess the accuracy and calibration of the models in estimating the selection odds, which is crucial for the proposed policy evaluation method.", "section": "5.1 Illustrations using synthetic data"}, {"figure_path": "2pgc5xDJ1b/figures/figures_17_1.jpg", "caption": "Figure 3: (a) Omitting measured selection factors to benchmark credible values for Γ in (3). (b) Inferred blood mercury levels [µg/L] in a target population under 'high' and 'low' seafood consumption (π₁ and πο, respectively). Limit curves for degrees of odds miscalibration Γ∈ [1, 2].", "description": "Figure 3(a) shows how omitting certain measured selection factors from the model can help determine credible values for the parameter Γ, which represents the degree of odds miscalibration in the model. Figure 3(b) displays the inferred blood mercury levels in a target population under two different seafood consumption policies, 'high' and 'low', represented by π₁ and πο respectively.  The figure includes limit curves illustrating the uncertainty associated with varying degrees of model miscalibration (Γ values between 1 and 2).", "section": "5 Numerical Experiments"}, {"figure_path": "2pgc5xDJ1b/figures/figures_17_2.jpg", "caption": "Figure 4: Reliability diagram of the observed odds against the average predicted nominal odds obtained from models p(S|X).", "description": "This figure shows the reliability of the models used to estimate the selection odds p(S|X). A well-calibrated model should have points close to the diagonal line. The plot suggests that the XGBoost model is better calibrated than the logistic model, especially in the higher ranges of nominal odds, where the logistic model underestimates the true odds.", "section": "4 Method"}, {"figure_path": "2pgc5xDJ1b/figures/figures_17_3.jpg", "caption": "Figure 3: (a) Omitting measured selection factors to benchmark credible values for  Γ in (3). (b) Inferred blood mercury levels [µg/L] in a target population under 'high' and 'low' seafood consumption (π₁ and πο, respectively). Limit curves for degrees of odds miscalibration Γ∈ [1, 2].", "description": "This figure shows how to benchmark credible values for the parameter  Γ, which represents the degree of miscalibration in the model of the sampling mechanism.  Panel (a) demonstrates this by omitting measured selection factors (age, income, education) and calculating the ratio of odds for each.  The resulting distribution helps determine a range of plausible values for  Γ. Panel (b) displays inferred blood mercury levels in a target population under different seafood consumption policies ('high' and 'low'), using limit curves for several values of  Γ. The limit curves provide bounds on the loss with a specified probability, showing how external validity (generalizability) changes under varying degrees of model miscalibration.", "section": "5 Numerical Experiments"}, {"figure_path": "2pgc5xDJ1b/figures/figures_17_4.jpg", "caption": "Figure 4: Reliability diagram of the observed odds against the average predicted nominal odds obtained from models p(S|X).", "description": "This figure shows a reliability diagram comparing observed odds ratios to predicted odds ratios from logistic and XGBoost models.  The models aim to estimate the probability of an individual being sampled from the target population given their covariates, p(S=0|X).  The reliability diagram visually assesses the calibration of these models.  A perfectly calibrated model would show points along the diagonal line. Deviations from the diagonal indicate miscalibration, with points above the line suggesting overestimation and points below underestimation of the probability.  The plot helps assess the credibility of the models used to handle sampling bias.", "section": "4 Method"}, {"figure_path": "2pgc5xDJ1b/figures/figures_18_1.jpg", "caption": "Figure 3: (a) Omitting measured selection factors to benchmark credible values for Γ in (3). (b) Inferred blood mercury levels [µg/L] in a target population under 'high' and 'low' seafood consumption (π₁ and πο, respectively). Limit curves for degrees of odds miscalibration Γ∈ [1, 2].", "description": "This figure shows how to benchmark credible values for the parameter Γ, which represents the degree of miscalibration allowed in the model of the sampling pattern.  Panel (a) uses a real-world dataset to show how omitting different variables impacts the selection odds, providing a range for credible Γ values. Panel (b) then shows the impact of those Γ values on the inference of blood mercury levels in a target population under different seafood consumption policies.", "section": "5 Numerical Experiments"}, {"figure_path": "2pgc5xDJ1b/figures/figures_19_1.jpg", "caption": "Figure 1: Inferring the out-of-sample losses of a policy π. (a) The loss L is bounded by an upper limit la with a probability of at least 1 - a. The RCT-based limit curve uses only trial data, whereas the other limit curves also utilize a sampling model trained using additional covariate data X from the target population. Each limit curve in blue is certified to provide valid inferences for models miscalibrated up to a degree I defined in (3). (b) Gap between the actual probability of exceeding the limit, L > la, and the nominal probability of miscoverage a. A negative gap means the inference la is invalid, while a positive gap implies it is valid but conservative. Details of the experiment are presented in Section 5.1.", "description": "This figure shows the results of an experiment to evaluate the out-of-sample losses of a policy π using different methods. Subfigure (a) shows limit curves that bound the loss L with a given probability.  The RCT-based curve only uses trial data, while other curves incorporate additional data from the target population and a sampling model to improve generalization. Subfigure (b) shows the gap between the actual and nominal probabilities of exceeding the loss limit, indicating the validity of the inferences.", "section": "5 Numerical Experiments"}, {"figure_path": "2pgc5xDJ1b/figures/figures_19_2.jpg", "caption": "Figure 1: Inferring the out-of-sample losses of a policy π. (a) The loss L is bounded by an upper limit la with a probability of at least 1 - a. The RCT-based limit curve uses only trial data, whereas the other limit curves also utilize a sampling model trained using additional covariate data X from the target population. Each limit curve in blue is certified to provide valid inferences for models miscalibrated up to a degree I defined in (3). (b) Gap between the actual probability of exceeding the limit, L > la, and the nominal probability of miscoverage a. A negative gap means the inference la is invalid, while a positive gap implies it is valid but conservative. Details of the experiment are presented in Section 5.1.", "description": "This figure shows the results of an experiment evaluating the out-of-sample losses of a policy.  Subfigure (a) displays limit curves showing the upper bound of the loss with a certain probability. The curves are generated using different methods, some incorporating additional data from the target population. Subfigure (b) shows the difference between the expected and actual probabilities of exceeding the loss limit, demonstrating the validity and conservatism of the approach.", "section": "5 Numerical Experiments"}, {"figure_path": "2pgc5xDJ1b/figures/figures_19_3.jpg", "caption": "Figure 1: Inferring the out-of-sample losses of a policy π. (a) The loss L is bounded by an upper limit lα with a probability of at least 1 − α. The RCT-based limit curve uses only trial data, whereas the other limit curves also utilize a sampling model trained using additional covariate data X from the target population. Each limit curve in blue is certified to provide valid inferences for models miscalibrated up to a degree Γ defined in (3). (b) Gap between the actual probability of exceeding the limit, L > lα, and the nominal probability of miscoverage α. A negative gap means the inference lα is invalid, while a positive gap implies it is valid but conservative. Details of the experiment are presented in Section 5.1.", "description": "This figure shows the results of an experiment to infer the out-of-sample losses of a policy.  The left subplot (a) displays limit curves showing the upper bound of the loss with a specified probability (1-α).  The curves based on RCT data alone are compared to curves that also incorporate a sampling model trained on additional data from the target population.  The right subplot (b) shows the difference between the actual and nominal probabilities of exceeding the loss limit, illustrating the validity of the inferences.", "section": "5 Numerical Experiments"}, {"figure_path": "2pgc5xDJ1b/figures/figures_19_4.jpg", "caption": "Figure 1: Inferring the out-of-sample losses of a policy π. (a) The loss L is bounded by an upper limit la with a probability of at least 1 - a. The RCT-based limit curve uses only trial data, whereas the other limit curves also utilize a sampling model trained using additional covariate data X from the target population. Each limit curve in blue is certified to provide valid inferences for models miscalibrated up to a degree I defined in (3). (b) Gap between the actual probability of exceeding the limit, L > la, and the nominal probability of miscoverage a. A negative gap means the inference la is invalid, while a positive gap implies it is valid but conservative. Details of the experiment are presented in Section 5.1.", "description": "This figure shows how to infer out-of-sample losses using a policy. The left graph (a) shows that the loss L is bounded by an upper limit, and the right graph (b) shows that the inference is valid but conservative when there is a positive gap between the actual probability of exceeding the limit and the nominal probability of miscoverage.", "section": "5 Numerical Experiments"}, {"figure_path": "2pgc5xDJ1b/figures/figures_20_1.jpg", "caption": "Figure 1: Inferring the out-of-sample losses of a policy π. (a) The loss L is bounded by an upper limit la with a probability of at least 1 - a. The RCT-based limit curve uses only trial data, whereas the other limit curves also utilize a sampling model trained using additional covariate data X from the target population. Each limit curve in blue is certified to provide valid inferences for models miscalibrated up to a degree I defined in (3). (b) Gap between the actual probability of exceeding the limit, L > la, and the nominal probability of miscoverage a. A negative gap means the inference la is invalid, while a positive gap implies it is valid but conservative. Details of the experiment are presented in Section 5.1.", "description": "This figure shows how to infer out-of-sample losses for a given policy π. The left panel (a) shows how the loss L is bounded by an upper limit  with probability 1-α.  It compares limit curves obtained using only Randomized Controlled Trial (RCT) data versus additional covariate data from the target population, showing the benefits of including the extra data for making valid inferences. The right panel (b) displays the gap between the actual and nominal probabilities of exceeding the limit, illustrating the method's accuracy and conservativeness.", "section": "5.1 Illustrations using synthetic data"}, {"figure_path": "2pgc5xDJ1b/figures/figures_20_2.jpg", "caption": "Figure 1: Inferring the out-of-sample losses of a policy π. (a) The loss L is bounded by an upper limit lα with a probability of at least 1 - α. The RCT-based limit curve uses only trial data, whereas the other limit curves also utilize a sampling model trained using additional covariate data X from the target population. Each limit curve in blue is certified to provide valid inferences for models miscalibrated up to a degree Γ defined in (3). (b) Gap between the actual probability of exceeding the limit, L > lα, and the nominal probability of miscoverage α. A negative gap means the inference lα is invalid, while a positive gap implies it is valid but conservative. Details of the experiment are presented in Section 5.1.", "description": "This figure shows the results of an experiment to estimate the out-of-sample losses of a policy using both trial data and additional covariate data from the target population.  Panel (a) displays limit curves showing an upper bound on the loss with a given probability. The curves based on trial data alone are valid only for the trial population, while curves using the sampling model trained on additional data are valid for the target population. Panel (b) shows the miscoverage gap, which indicates the validity of the inferences and shows the performance of the method for various degrees of model miscalibration.", "section": "1 Introduction"}, {"figure_path": "2pgc5xDJ1b/figures/figures_20_3.jpg", "caption": "Figure 1: Inferring the out-of-sample losses of a policy π. (a) The loss L is bounded by an upper limit la with a probability of at least 1 - a. The RCT-based limit curve uses only trial data, whereas the other limit curves also utilize a sampling model trained using additional covariate data X from the target population. Each limit curve in blue is certified to provide valid inferences for models miscalibrated up to a degree I defined in (3). (b) Gap between the actual probability of exceeding the limit, L > la, and the nominal probability of miscoverage a. A negative gap means the inference la is invalid, while a positive gap implies it is valid but conservative. Details of the experiment are presented in Section 5.1.", "description": "This figure shows the results of inferring out-of-sample losses of a policy using two methods. The first method uses only randomized controlled trial (RCT) data, while the second method incorporates additional covariate data from the target population and a sampling model.  Subfigure (a) displays limit curves showing the upper bound of the loss with a specified probability. Subfigure (b) shows the difference between the actual and nominal probabilities of exceeding the loss limit, indicating the validity and conservatism of the inferences.", "section": "1 Introduction"}, {"figure_path": "2pgc5xDJ1b/figures/figures_20_4.jpg", "caption": "Figure 1: Inferring the out-of-sample losses of a policy π. (a) The loss L is bounded by an upper limit lα with a probability of at least 1 − α. The RCT-based limit curve uses only trial data, whereas the other limit curves also utilize a sampling model trained using additional covariate data X from the target population. Each limit curve in blue is certified to provide valid inferences for models miscalibrated up to a degree Γ defined in (3). (b) Gap between the actual probability of exceeding the limit, L > lα, and the nominal probability of miscoverage α. A negative gap means the inference lα is invalid, while a positive gap implies it is valid but conservative. Details of the experiment are presented in Section 5.1.", "description": "This figure shows the results of an experiment to evaluate the out-of-sample losses of a policy (π).  Subfigure (a) compares different methods for bounding the loss, showing how the inclusion of additional data from the target population improves the accuracy and validity of the bounds. Subfigure (b) analyzes the accuracy of the loss bounds by plotting the miscoverage gap against the target miscoverage probability (α). A positive gap indicates the inference is valid but conservative, while a negative gap indicates it is invalid.", "section": "1 Introduction"}, {"figure_path": "2pgc5xDJ1b/figures/figures_20_5.jpg", "caption": "Figure 5: Odds p(S = 0|X)/p(S = 1|X) compared with nominal odds obtained from logistic and XGBoost models p(S|X). The dots are a random subsample of the trial samples.", "description": "This figure compares the true selection odds (the ratio of probabilities of an individual being from the target population given covariates X to that of being from the trial population) against the selection odds predicted by two models: a logistic model and an XGBoost model.  The plots show the odds ratio on the y-axis and x0 (one of the covariates) on the x-axis. The color gradients represent varying values of x1 (the other covariate). The dots represent a random subset of data points from the trial population. This visual comparison helps to assess the accuracy of the two different models in capturing the true relationship between the covariates and selection probability.", "section": "5.1 Illustrations using synthetic data"}, {"figure_path": "2pgc5xDJ1b/figures/figures_20_6.jpg", "caption": "Figure 5: Odds p(S = 0|X)/p(S = 1|X) compared with nominal odds obtained from logistic and XGBoost models p(S|X). The dots are a random subsample of the trial samples.", "description": "This figure compares the true selection odds, p(S=0|X)/p(S=1|X), which represent the ratio of probabilities of an individual belonging to the target population versus the trial population given their covariates X, against the estimated odds from two different models: a logistic regression model and a gradient boosted tree model (XGBoost).  The plots show heatmaps representing the odds from each model and the true odds, with dots indicating a random subset of data points from the trial sample. This visualization helps to assess the accuracy and calibration of the probability models used for estimating the selection odds, which is crucial for accurate policy evaluation.", "section": "5.1 Illustrations using synthetic data"}, {"figure_path": "2pgc5xDJ1b/figures/figures_20_7.jpg", "caption": "Figure 5: Odds p(S = 0|X)/p(S = 1|X) compared with nominal odds obtained from logistic and XGBoost models p(S|X). The dots are a random subsample of the trial samples.", "description": "This figure compares the true selection odds (p(S=0|X)/p(S=1|X)) with the selection odds predicted by two different models (logistic and XGBoost) using data from the trial population. The heatmaps represent the predicted odds and the dots show a random sample from the trial data. This visualization helps to understand the quality of the two models in predicting the selection mechanism, crucial for the method proposed in the paper.", "section": "5.1 Illustrations using synthetic data"}, {"figure_path": "2pgc5xDJ1b/figures/figures_20_8.jpg", "caption": "Figure 5: Odds p(S = 0|X)/p(S = 1|X) compared with nominal odds obtained from logistic and XGBoost models p(S|X). The dots are a random subsample of the trial samples.", "description": "This figure compares the true selection odds, p(S=0|X)/p(S=1|X), to the selection odds predicted by two different models: a logistic model and an XGBoost model. The true selection odds are unknown, but the figure displays them to benchmark the accuracy of the models. Each model gives a prediction of the probability that a data point comes from the target population versus the trial population, given the covariates X. This figure illustrates how well the models can predict the selection odds. For each model, a heatmap shows the odds predicted by the model for different values of covariates. These heatmaps are overlaid with points representing a random subsample from the trial data, colored by whether they originate from the trial population (green) or the target population (black). This visualization helps to assess how well the model captures the actual selection process and to benchmark the choice of models and hyperparameters for the next steps of the proposed method.", "section": "5.1 Illustrations using synthetic data"}]