[{"figure_path": "2pgc5xDJ1b/tables/tables_7_1.jpg", "caption": "Table 1: Means and variances of covariate distribution p(X, U|S) in (15).", "description": "This table shows the means (μ) and variances (σ²) of the covariates X, U in the target populations (A, B) and the trial population.  The data is drawn from a multivariate normal distribution N(μ, Σ), where μ represents the means and Σ the covariance matrix. The covariates X and U are used to model the sampling process (in Equation 15) and to calculate the odds ratio and loss.", "section": "5.1 Illustrations using synthetic data"}, {"figure_path": "2pgc5xDJ1b/tables/tables_15_1.jpg", "caption": "Table 2: Hyperparameters used for XGBoost in Section 5.1.", "description": "This table lists the hyperparameters used for training the XGBoost model in Section 5.1 of the paper.  The XGBoost model is used for policy evaluation, specifically for modeling the sampling pattern of individuals in the trial and target populations. The hyperparameters control various aspects of the model's training process, such as the number of trees, tree depth, learning rate, and regularization parameters. These settings are crucial for achieving a well-calibrated model that accurately reflects the relationship between covariates and the sampling probability. ", "section": "5 Numerical Experiments"}, {"figure_path": "2pgc5xDJ1b/tables/tables_15_2.jpg", "caption": "Table 3: Hyperparameters used for XGBoost in Section 5.2.", "description": "This table lists the hyperparameters used for training the XGBoost model in Section 5.2 of the paper, which focuses on real-world data experiments involving seafood consumption and blood mercury levels.  The hyperparameters control various aspects of the model's training process, such as the number of trees, tree depth, learning rate, objective function, minimum child weight, subsampling ratio, and column subsampling ratio.  The `scale_pos_weight` parameter addresses class imbalance in the dataset.", "section": "5 Numerical Experiments"}, {"figure_path": "2pgc5xDJ1b/tables/tables_16_1.jpg", "caption": "Table 1: Means and variances of covariate distribution p(X, U|S) in (15).", "description": "This table presents the means (μ) and variances (σ²) of the covariate distributions used in the synthetic data experiments.  The distributions are for two-dimensional covariates X and an unmeasured selection factor U, conditioned on the sampling indicator S (0 for target, 1 for trial).  Four different target populations (A, B, C, D) are shown, along with the trial population. The values allow for a controlled level of covariate shift between the trial and target populations.  These distributions are used in Equation 15 of the paper.", "section": "5.1 Illustrations using synthetic data"}]