[{"figure_path": "i4gqCM1r3z/tables/tables_5_1.jpg", "caption": "Table 1: Performance of target models on ACS Income tasks. Regression tasks are evaluated using r2, which indicates the portion of explained variance, and classification tasks are evaluated using F1 score since class labels are not balanced.", "description": "This table presents the performance of different models (Ridge Regression, Logistic Regression, and Linear SVM) on the American Community Survey (ACS) Income dataset.  The performance is measured using two metrics: R-squared (R2) for regression tasks, indicating the proportion of variance explained by the model, and F1-score for classification tasks, a common metric for imbalanced datasets.  The table shows results for three states (NY, CA, TX) and with and without Random Fourier Features (RBF).", "section": "D.1 ACS Income Tasks"}, {"figure_path": "i4gqCM1r3z/tables/tables_17_1.jpg", "caption": "Table 1: Performance of target models on ACS Income tasks. Regression tasks are evaluated using r2, which indicates the portion of explained variance, and classification tasks are evaluated using F1 score since class labels are not balanced.", "description": "This table presents the performance of different models (Ridge Regression, Logistic Regression, and Linear SVM) on American Community Survey (ACS) income data for three different states (NY, CA, TX).  The performance is measured using R-squared (R2) for regression tasks and F1-score for classification tasks.  The use of F1-score is justified by the class imbalance in the dataset.  Additionally, the table shows results both with and without random fourier features.", "section": "D.1 ACS Income Tasks"}, {"figure_path": "i4gqCM1r3z/tables/tables_17_2.jpg", "caption": "Table 2: Out of sample accuracy of target models on Image tasks", "description": "This table shows the out-of-sample accuracy of three different models (Linear Cross-Entropy, RBF Ridge, and RBF Cross Entropy) on three image datasets (CIFAR10, MNIST, and Fashion MNIST).  The accuracy represents the model's performance on unseen data, indicating its generalization ability.  Higher accuracy suggests better model performance and generalization.", "section": "D.2 Image tasks"}]