[{"figure_path": "gYa94o5Gmq/figures/figures_1_1.jpg", "caption": "Figure 1: (a) The performance of classic DAOD method AT [38] on Real-to-Art (P2C) adaptation task during training. It suffers from performance degradation as the training goes on. The proposed DAS outperforms previous unsupervised model evaluation methods and selects desirable checkpoints without accessing any labels in the target domain. (b) The motivation of the work. We propose a Detection Adaptation Score including a Prototypical Distance Ratio (PDR) score and Flatness Index Score (FIS) to evaluate the model performance in an unsupervised way. It can be a good substitute metric for using annotations for DAOD model evaluation.", "description": "This figure shows two subfigures. Subfigure (a) illustrates the performance degradation of the classic Domain Adaptive Object Detection (DAOD) method, AT [38], during training on the Real-to-Art (P2C) adaptation task, highlighting the issue of performance drop as the training progresses. It also demonstrates the superiority of the proposed Detection Adaptation Score (DAS) in selecting checkpoints without using any target domain labels.  Subfigure (b) explains the motivation behind the proposed work, illustrating the architecture of the proposed DAS method, which combines a Prototypical Distance Ratio (PDR) score and a Flatness Index Score (FIS) to evaluate model performance in an unsupervised manner, effectively replacing the need for annotations in DAOD model evaluation.", "section": "1 Introduction"}, {"figure_path": "gYa94o5Gmq/figures/figures_7_1.jpg", "caption": "Figure 2: The comparison of different unsupervised model evaluation methods for DAOD. The experiments are conducted on real-to-art adaptation (P2C) using AT. Note that the directions of all scores are unified.", "description": "This figure compares different unsupervised model evaluation methods for Domain Adaptive Object Detection (DAOD) on the Real-to-Art adaptation task using the Adaptive Teacher (AT) method.  It shows the performance (mAP) of the AT model at various checkpoints during training, along with the scores of different evaluation methods (PS, ES, ATC, BoS, DAS).  The goal is to find an effective method that accurately predicts the model's performance on the target domain without using any target domain labels. The plot shows that the proposed Detection Adaptation Score (DAS) correlates best with the actual mAP, indicating it's superior to other methods for unsupervised model evaluation.", "section": "4 Experiments"}, {"figure_path": "gYa94o5Gmq/figures/figures_7_2.jpg", "caption": "Figure 3: Hyperprameter tuning on AT [38] using our DAS. (a) λdis that controls the weight of adversarial loss from domain discriminator. (b) λunsup that controls the weight of unsupervised loss.", "description": "This figure shows the results of hyperparameter tuning experiments conducted using the proposed Detection Adaptation Score (DAS) method on the Adaptive Teacher (AT) object detection model.  Two hyperparameters are tuned: λdis, which controls the weight of the adversarial loss from the domain discriminator; and λunsup, which controls the weight of the unsupervised loss.  The plots illustrate the impact of varying these hyperparameters on the DAS score and the mean average precision (mAP) achieved, demonstrating how DAS can be used for effective hyperparameter tuning in domain adaptation.", "section": "4 Experiments"}, {"figure_path": "gYa94o5Gmq/figures/figures_14_1.jpg", "caption": "Figure 4: The performance gap among the last checkpoint, our DAS, and Oracle checkpoint. (a) real-to-art adaptation, (b) the weather adaptation, and (c) the synthetic-to-real adaptation.", "description": "This figure compares the performance gap between the last checkpoint of the training process and the oracle checkpoint (using ground truth labels) for three different domain adaptation scenarios: real-to-art, weather, and synthetic-to-real.  The bars represent the difference in mAP between the last checkpoint and the oracle checkpoint for each of four different DAOD frameworks.  The figure demonstrates the significant performance gains achievable by using the proposed DAS method to select optimal checkpoints.", "section": "4 Experiments"}]