[{"type": "text", "text": "Multivariate Probabilistic Time Series Forecasting with Correlated Errors ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Vincent Zhihao Zheng McGill University Montréal, QC, Canada zhihao.zheng@mail.mcgill.ca ", "page_idx": 0}, {"type": "text", "text": "Lijun Sun∗   \nMcGill University   \nMontréal, QC, Canada   \nlijun.sun@mcgill.ca ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Accurately modeling the correlation structure of errors is critical for reliable uncertainty quantification in probabilistic time series forecasting. While recent deep learning models for multivariate time series have developed efficient parameterizations for time-varying contemporaneous covariance, but they often assume temporal independence of errors for simplicity. However, real-world data often exhibit significant error autocorrelation and cross-lag correlation due to factors such as missing covariates. In this paper, we introduce a plug-and-play method that learns the covariance structure of errors over multiple steps for autoregressive models with Gaussian-distributed errors. To ensure scalable inference and computational efficiency, we model the contemporaneous covariance using a lowrank-plus-diagonal parameterization and capture cross-covariance through a group of independent latent temporal processes. The learned covariance matrix is then used to calibrate predictions based on observed residuals. We evaluate our method on probabilistic models built on RNNs and Transformer architectures, and the results confirm the effectiveness of our approach in improving predictive accuracy and uncertainty quantification without significantly increasing the parameter size. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Uncertainty quantification is crucial in time series forecasting, especially for applications that need more detailed insights than point forecasts. Probabilistic time series forecasting with deep learning (DL) has attracted attention for its ability to capture complex, nonlinear dependencies and provide the probability distribution of target variables [1, 2]. In multivariate time series, autoregressive models are widely used for probabilistic forecasting [3–5], modeling the joint one-step-ahead predictive distribution and generating multistep-ahead predictions in a rolling manner. To enable scalable learning, these models often assume that errors are independent over time. Typically, time series variables follow a Gaussian distribution $\\mathbf{z}_{t}=m(\\mathbf{h}_{t})+\\eta_{t}$ , where $m(\\cdot)$ is the mean function and $\\pmb{\\eta}_{t}\\sim\\mathcal{N}(\\mathbf{0},\\pmb{\\Sigma}_{t})$ is a stochastic error process with contemporaneous covariance matrix $\\Sigma_{t}$ . The assumption of time-independence implies $\\mathrm{Cov}(\\eta_{s},\\eta_{t})=\\mathbf{0}$ , $\\forall s\\neq t$ . This holds when the model can account for all correlations between successive time steps through hidden states determined by previous values. However, real-world data often violate this assumption, as residuals exhibit substantial cross-correlation due to omission of important covariates and model misspecification. ", "page_idx": 0}, {"type": "text", "text": "Modeling error autocorrelation (or cross-correlation) is a key area of research in statistical time series models. A common approach is to assume that the error series follows a dependent temporal process, such as an autoregressive integrated moving average (ARIMA) model [6]. Deep learning models face similar challenges. Previous studies have attempted to incorporate temporally-correlated errors into the training process by modifying the loss function [7, 8]. However, these methods, based on deterministic output, are not easily applicable to probabilistic forecasting models, particularly in a multivariate setting. A notable innovation is the batch training method introduced by Zheng et al. [9], which trains a univariate probabilistic forecasting model using generalized least squares (GLS) loss over batched errors. This approach parameterizes a dynamic covariance matrix to capture error autocorrelation, which is then used to calibrate the predictive distribution of time series variables. While this method consistently improves probabilistic forecasting performance compared to naive training (i.e., without considering autocorrelated errors); however, it is only applicable to univariate models, such as DeepAR [10]. ", "page_idx": 0}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "In this paper, we introduce an efficient method for learning error cross-correlation in multivariate probabilistic forecasting models. Our focus is on deep learning models that are autoregressive with Gaussian-distributed errors. Modeling cross-correlation in multivariate models presents challenges due to increased dimensionality, as the covariance matrix scales with the number of time series $N$ . To address this computational challenge, we propose characterizing error cross-correlation through a set of independent latent temporal processes using a low-rank parameterization of the covariance matrix. This approach prevents the computational cost from growing with the number of time series. Our method offers a general-purpose approach to multivariate probabilistic forecasting models, offering significantly improved predictive accuracy. ", "page_idx": 1}, {"type": "text", "text": "Contributions: ", "text_level": 1, "page_idx": 1}, {"type": "text", "text": "1. We introduce a plug-and-play method for training autoregressive multivariate probabilistic forecasting models using a redesigned GLS loss. (§4)   \n2. We propose an efficient parameterization of the error covariance matrix across multiple steps, enabling efficient computation of its inverse and determinant through matrix inversion and determinant lemmas. (§4.1)   \n3. The learned covariance matrix is used to fine-tune the predictive distribution based on observed residuals. $(\\S4.2)$   \n4. We demonstrate that the proposed method effectively captures error cross-correlation and improves prediction quality. Notably, these improvements are achieved through a statistical formulation without significantly increasing the size of model parameters. (§5) ", "page_idx": 1}, {"type": "text", "text": "2 Probabilistic Time Series Forecasting ", "text_level": 1, "page_idx": 1}, {"type": "text", "text": "Denote $\\mathbf{z}_{t}=\\left[z_{1,t},\\ldots,z_{N,t}\\right]^{\\top}\\in\\mathbb{R}^{N}$ as the vector of time series variables at time step $t$ , where $N$ is the number of time series. Probabilistic time series forecasting can be formulated as estimating the joint conditional distribution $p\\left(\\mathbf{z}_{T+1:T+Q}\\mid\\mathbf{z}_{T-P+1:T};\\mathbf{x}_{T-P+1:T+Q}\\right)$ given the observed history $\\{\\mathbf{z}_{t}\\}_{t=1}^{T}$ , where $\\mathbf{z}_{t_{1}:t_{2}}=[\\mathbf{z}_{t_{1}},\\ldots,\\mathbf{z}_{t_{2}}]$ and $\\mathbf{x}_{t}$ are known time-dependent covariates (e.g., time of day, day of week) for all future time steps. In essence, the problem involves predicting the time series values for $Q$ future time steps using all available covariates and $P$ steps of historical time series data: ", "page_idx": 1}, {"type": "equation", "text": "$$\np\\left(\\mathbf{z}_{T+1:T+Q}\\mid\\mathbf{z}_{T-P+1:T};\\mathbf{x}_{T-P+1:T+Q}\\right)=\\prod_{t=T+1}^{T+Q}p\\left(\\mathbf{z}_{t}\\mid\\mathbf{z}_{t-P:t-1};\\mathbf{x}_{t-P:t}\\right),\n$$", "text_format": "latex", "page_idx": 1}, {"type": "text", "text": "which becomes an autoregressive model that can be used for either one-step-ahead ( $Q\\,=\\,1)$ ) or multistep-ahead forecasting in a rolling manner. When performing multistep-ahead forecasting, samples are drawn in the prediction range $(t\\geq T+1)$ and fed back for the next time step until the end of the desired prediction range. In neural networks, the conditioning information is commonly encoded into a state vector $\\mathbf{h}_{t}$ . Hence, Eq. (1) can be expressed more concisely: ", "page_idx": 1}, {"type": "equation", "text": "$$\np\\left(\\mathbf{z}_{T+1:T+Q}\\mid\\mathbf{z}_{T-P+1:T};\\mathbf{x}_{T-P+1:T+Q}\\right)=\\prod_{t=T+1}^{T+Q}p\\left(\\mathbf{z}_{t}\\mid\\mathbf{h}_{t}\\right),\n$$", "text_format": "latex", "page_idx": 1}, {"type": "text", "text": "where $\\mathbf{h}_{t}$ is mapped to the parameters of a parametric distribution (e.g., multivariate Gaussian). ", "page_idx": 1}, {"type": "text", "text": "Existing autoregressive models typically assume that the error at each time step is independent, meaning that $\\mathbf{z}_{t}$ follows a multivariate Gaussian distribution: ", "page_idx": 1}, {"type": "equation", "text": "$$\n\\mathbf{z}_{t}\\mid\\mathbf{h}_{t}\\sim\\mathcal{N}\\left(\\pmb{\\mu}(\\mathbf{h}_{t}),\\pmb{\\Sigma}(\\mathbf{h}_{t})\\right),\n$$", "text_format": "latex", "page_idx": 1}, {"type": "text", "text": "where $\\pmb{\\mu}(\\cdot)$ and $\\Sigma(\\cdot)$ map $\\mathbf{h}_{t}$ to the mean and covariance parameters of a multivariate Gaussian distribution. This formulation can be decomposed as $\\mathbf{z}_{t}\\,=\\,\\pmb{\\mu}_{t}+\\pmb{\\eta}_{t}$ with $\\pmb{\\eta}_{t}\\sim\\mathcal{N}(\\mathbf{0},\\pmb{\\Sigma}_{t})$ . The temporally independent error assumption corresponds to $\\mathrm{Cov}(\\eta_{s},\\eta_{t})=\\mathbf{0}$ for any time points $s$ and $t$ where $s\\neq t$ . Fig. 1 provides an empirical example of the contemporaneous covariance matrix $\\mathrm{Cov}(\\eta_{t},\\eta_{t})$ and cross-covariance matrix $\\mathrm{Cov}(\\eta_{t-\\Delta},\\eta_{t}),\\Delta=1,2,\\bar{3}$ . The results are calculated based on the prediction residuals of GPVar [3] on the m4_hourly dataset. While multivariate models primarily focus on contemporaneous covariance, the residuals clearly exhibit temporal dependence, as $\\mathrm{Cov}(\\eta_{t-\\Delta},\\eta_{t})\\neq\\mathbf{0}$ . This non-zero cross-covariance suggests that residuals still contain valuable information, which can be leveraged to improve predictions. ", "page_idx": 1}, {"type": "image", "img_path": "cAFvxVFaii/tmp/6ee8c1fb626ccff6228620fc3964ec76b1f227ede3dc580265d76fec837572a4.jpg", "img_caption": ["Figure 1: Contemporaneous covariance matrix $\\mathrm{Cov}(\\eta_{t},\\eta_{t})$ and cross-covariance matrix $\\mathrm{Cov}(\\eta_{t-\\Delta},\\eta_{t}),\\Delta\\,=\\,1,2,3,$ , calculated based on the one-step-ahead prediction residuals of GPVar on a batch of time series from the $\\mathtt{m4.}$ _hourly dataset. For visualization clarity, covariance are clipped to the range $[0,0.6]$ . "], "img_footnote": [], "page_idx": 2}, {"type": "text", "text": "", "page_idx": 2}, {"type": "text", "text": "3 Related Work ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "3.1 Probabilistic Time Series Forecasting ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Probabilistic forecasting aims to model the probability distribution of target variables, unlike deterministic forecasting, which produces only point estimates. There are two main approaches: parametric probability density functions (PDFs) and quantile functions [2]. For example, MQ-RNN [11] generates quantile forecasts using a sequence-to-sequence (Seq2Seq) RNN architecture. In contrast, PDF-based approaches assume a specific distribution (e.g., Gaussian, Poisson) and use neural networks to generate the distribution parameters. DeepAR [10], for instance, uses an RNN to model hidden state transitions, while its multivariate version, GPVar [3], employs a Gaussian copula to transform observations into Gaussian variables, assuming a joint multivariate Gaussian distribution. ", "page_idx": 2}, {"type": "text", "text": "Neural networks can also generate probabilistic model parameters. The deep state space model (SSM) [12] uses an RNN to generate SSM parameters. The normalizing Kalman fliter (NKF) [13] combines normalizing flows (NFs) with the linear Gaussian state space model (LGM) to model nonlinear dynamics and evaluate the PDF of observations. NKF uses RNNs to produce LGM parameters at each time step, then transforms the LGM output into observations using NFs. Wang et al. [14] proposed the deep factor model, which includes a deterministic global component parameterized by an RNN and a random component from any classical probabilistic model (e.g., Gaussian white noise) to represent random effects. Some methods improve expressive conditioning for probabilistic forecasting by using Transformer instead of RNNs to model latent state dynamics, thus breaking the Markovian assumption in RNNs [15]. Other approaches adopt more flexible distribution forms, including normalizing flows [4], diffusion models [5], and copulas [16, 17]. For a recent and comprehensive review, we refer readers to Benidis et al. [2]. ", "page_idx": 2}, {"type": "text", "text": "3.2 Modeling Correlated Errors ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Error correlation in time series has been extensively studied in econometrics and statistics [18, 6, 19]. In multivariate time series, correlation structure is characterized by contemporaneous covariance $\\mathrm{Var}(\\pmb{\\eta}_{t})=\\mathrm{Cov}(\\pmb{\\eta}_{t},\\pmb{\\eta}_{t})$ and cross-covariance $\\mathrm{Cov}(\\eta_{t-\\Delta},\\eta_{t})$ . Cross-covariance includes both the autocovariance of errors $\\operatorname{Cov}(\\eta_{i,t-\\Delta},\\eta_{i,t})$ and the cross-lag covariance $\\mathrm{Cov}(\\eta_{i,t-\\Delta},\\eta_{j,t})$ between pairs of components in the multivariate series. Contemporaneous covariance captures the correlation among individual time series at a specific point in time. In the univariate setting, DeepAR [10] achieves probabilistic forecasting by modeling the contemporaneous covariance, assuming that errors are independent over time. To address autocorrelation, Sun et al. [7] re-parameterized the input and output of neural networks to model first-order error autocorrelation, effectively capturing serially correlated errors using an AR(1) process. This method improves the performance of one-step-ahead neural forecasting models, allowing joint optimization of base and error regressors, but is limited to deterministic models. In spatial modeling, Saha et al. [20] introduced the RF-GLS model, which uses random forests to estimate nonlinear covariate effects and Gaussian processes (GP) to model spatial random effects. The RF-GLS model assumes that the error process follows an $\\operatorname{AR}(p)$ process to accommodate autocorrelated errors. Zheng et al. [9] proposed training a probabilistic forecasting model with a GLS loss that explicitly models the time-varying autocorrelation of batched error terms, extending DeepAR to incorporate autocorrelated errors. ", "page_idx": 2}, {"type": "text", "text": "", "page_idx": 3}, {"type": "text", "text": "In the multivariate setting, most existing work focuses on modeling contemporaneous covariance, assuming that $\\pmb{\\eta}_{t}$ is independently distributed, which implies $\\mathrm{Cov}(\\eta_{t-\\Delta},\\eta_{t})=\\mathbf{0}$ . For example, GPVar [3] generalizes DeepAR [10] to account for correlations between time series by viewing the distribution of time series variables as a Gaussian process. In Seq2Seq models, correlations can span across series and forecasting steps, as predictions for future time steps are generated simultaneously. Since predictions for future time steps are generated simultaneously, we refer to these correlations as contemporaneous correlations within the scope of this study. Choi et al. [21] introduced a dynamic mixture of matrix Gaussian distributions to capture contemporaneous covariance of errors in Seq2Seq models. One exception that explicitly models error cross-correlation is [8], where the authors assume that the matrix-variate error term of a multivariate Seq2Seq model follows a matrix autoregressive (AR) process with seasonal lags. However, applying this technique to probabilistic forecasting models is not straightforward. ", "page_idx": 3}, {"type": "text", "text": "To the best of our knowledge, our work is the first to model cross-covariance in multivariate probabilistic time series forecasting. The closest related studies are by Zheng et al. [9] and Zheng et al. [8]. Zheng et al. [9] applies GLS loss in the temporal domain to model autocorrelated errors, but their approach is tailored for univariate time series. Zheng et al. [8] models cross-covariance in multivariate forecasting models, but their method is limited to deterministic models and requires predefined seasonal lags in the error autoregressive process. Our work extends [9] to the multivariate setting, enabling the modeling of the correlation structure of multivariate errors across multiple steps. In addition, we distinguish our approach from methods that directly model the distribution of time series variables, such as Copulas [16, 17], where no decomposition of the error term is provided. ", "page_idx": 3}, {"type": "text", "text": "4 Our Method ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Our methodology builds upon the formulation outlined in Eq. (2), employing an autoregressive model as its foundational framework. Using an RNN as an example, a probabilistic forecasting model consists of two components. Firstly, it incorporates a transition model $f_{\\Theta}$ to capture the dynamics of state transitions $\\mathbf{h}_{t}=f_{\\Theta}\\left(\\mathbf{h}_{t-1},\\mathbf{z}_{t-1},\\mathbf{x}_{t}\\right)$ , thus inherently having autoregressive properties. Second, it integrates a distribution head, represented by $\\theta$ , which maps $\\mathbf{h}_{t}$ to the parameters of the desired probability distribution. Following GPVar [3], our approach employs the multivariate Gaussian distribution as the distribution head. The time series variable can be decomposed into a deterministic mean component and a random error component ${\\bf z}_{t}={\\pmb{\\mu}}_{t}+{\\pmb{\\eta}}_{t}$ , where $\\pmb{\\eta}_{t}\\sim\\mathcal{N}(\\mathbf{0},\\pmb{\\Sigma}_{t})$ . To efficiently model the covariance $\\Sigma_{t}$ for large $N$ , GPVar adopts a low-rank-plus-diagonal parameterization $\\mathbf{\\boldsymbol{\\Sigma}}_{t}\\,=\\,L_{t}\\mathbf{\\boldsymbol{L}}_{t}^{\\top}+\\operatorname{diag}\\left(\\mathbf{\\boldsymbol{d}}_{t}\\right)$ , where ${\\bf L}_{t}\\,\\in\\,\\mathbb{R}^{N\\times R}$ $(R\\ll N)$ and $\\pmb{d}_{t}\\,\\in\\,\\mathbb{R}_{+}^{N}$ . Autoregressive models based on Gaussian likelihood typically assume that $\\pmb{\\eta}_{t}$ are independently distributed following a multivariate Gaussian distribution. The log-likelihood of the distribution serves as the loss function for optimizing the model: ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\mathcal{L}=\\sum_{t=1}^{T}\\log p\\left(\\mathbf{z}_{t}\\mid\\theta\\left(\\mathbf{h}_{t}\\right)\\right)\\propto\\sum_{t=1}^{T}-\\frac{1}{2}[\\ln\\vert\\boldsymbol{\\Sigma}_{t}\\vert+\\eta_{t}^{\\top}\\boldsymbol{\\Sigma}_{t}^{-1}\\eta_{t}].}\\end{array}\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "The parameters $\\theta(\\mathbf{h}_{t})$ are parameterized as $(\\pmb{\\mu}_{t},\\pmb{L}_{t},\\mathbf{d}_{t})$ , where $\\pmb{\\mu}_{t}\\in\\mathbb{R}^{N}$ represents the mean vector of the distribution. $\\pmb{L}_{t}$ and ${\\bf d}_{t}$ correspond to the covariance factor and diagonal elements in the lowrank parameterization of the multivariate Gaussian distribution. We use shared mapping functions for all time series: ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mu_{i}(\\mathbf{h}_{i,t})=\\tilde{\\mu}(\\mathbf{h}_{i,t})=\\mathbf{w}_{\\mu}^{\\top}\\mathbf{h}_{i,t},}\\\\ &{d_{i}(\\mathbf{h}_{i,t})=\\tilde{d}(\\mathbf{h}_{i,t})=\\log(1+\\exp(\\mathbf{w}_{d}^{\\top}\\mathbf{h}_{i,t})),}\\\\ &{l_{i}(\\mathbf{h}_{i,t})=\\tilde{l}(\\mathbf{h}_{i,t})=W_{l}\\mathbf{h}_{i,t},}\\end{array}\n$$", "text_format": "latex", "page_idx": 3}, {"type": "image", "img_path": "cAFvxVFaii/tmp/d4161048a10b7102a6e30aac1b7d14f4fb9a371b4420443368ebdce33f27f854.jpg", "img_caption": ["Figure 2: Graphic illustration of Eq. (8), where $B$ is the number of time series in a batch, $R$ is the rank of the covariance factor, $D$ is the time window we consider cross-correlation, $P$ and $Q$ are the conditioning range and prediction range. Cross-correlation is modeled by introducing correlation in each row of matrix rt−D+1:t. "], "img_footnote": [], "page_idx": 4}, {"type": "text", "text": "where $\\mathbf{h}_{i,t}\\in\\mathbb{R}^{H}$ , $\\mathbf{w}_{\\mu}\\in\\mathbb{R}^{H}$ , $\\mathbf{w}_{d}\\in\\mathbb{R}^{H}$ , and $W_{l}\\,\\in\\,\\mathbb{R}^{R\\times H}$ are parameters. Since the parameters of the mapping functions are shared across all time series, we can use a random subset of time series to compute the Gaussian likelihood-based loss in each optimization step, as any subset of $\\mathbf{z}_{t}$ will still follow a multivariate Gaussian distribution. In other words, we can train the model with a substantially reduced batch size $B<N$ . ", "page_idx": 4}, {"type": "text", "text": "4.1 Training with Correlated Errors ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "We build upon the approach introduced in [9] to address cross-correlated errors in a multivariate context by introducing time-dependent error terms $\\pmb{\\eta}_{t}$ into the GLS loss. In many existing deep probabilistic forecasting models, such as GPVar [3], a training batch typically consists of a sample slice of $B$ time series spanning a temporal length of $P+Q$ , where $P$ is the conditioning range and $Q$ is the prediction range. The Gaussian likelihood is evaluated independently at each time step within the prediction range through one-step-ahead predictions. However, this approach overlooks the serial correlation of errors across consecutive time steps. To address this limitation, we propose modifying the likelihood function by introducing a dynamic covariance that accommodates the temporal dependence of the error term, as illustrated in Fig. 2. To achieve this, we organize $D$ smaller slices of time series with a temporal length of $P+1$ (i.e., $Q=1,$ ), sorted by the prediction start time in sequential order, where $D$ represents the time horizon over which we consider cross-correlation. The new batch structure effectively reconstructs the conventional training batch, covering the same time horizon when $D=Q$ . An example of the collection of target time series variables in a batch covering cross-correlation horizon $D$ is given by ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathbf z_{t-D+1}=\\pmb{\\mu}_{t-D+1}+\\pmb{\\eta}_{t-D+1},}\\\\ &{\\mathbf z_{t-D+2}=\\pmb{\\mu}_{t-D+2}+\\pmb{\\eta}_{t-D+2},}\\\\ &{\\qquad\\qquad\\cdot\\cdot\\cdot}\\\\ &{\\qquad\\mathbf z_{t}=\\pmb{\\mu}_{t}+\\pmb{\\eta}_{t},}\\end{array}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where for time point $t^{\\prime},\\pmb{\\mu}_{t^{\\prime}},\\pmb{L}_{t^{\\prime}}$ and $\\mathbf{d}_{t^{\\prime}}$ are the outputs of the model. The covariance parameterization in GPVar corresponds to ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\pmb{\\eta}_{t^{\\prime}}=\\pmb{L}_{t^{\\prime}}\\mathbf{r}_{t^{\\prime}}+\\varepsilon_{t^{\\prime}},\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $\\mathbf{r}_{t^{\\prime}}\\,\\sim\\,\\mathcal{N}(\\mathbf{0},\\mathbf{I}_{R})$ is a low-dimensional latent variable, and $\\boldsymbol\\varepsilon_{t^{\\prime}}\\,\\sim\\,\\mathcal{N}(\\mathbf{0},\\mathrm{diag}\\left(\\mathbf{d}_{t^{\\prime}}\\right))$ is an additional error independent of $\\mathbf{r}_{t^{\\prime}}$ . We denote $z_{t}^{\\mathrm{bat}}=\\mathrm{vec}\\left(\\mathbf{z}_{t-D+1:t}\\right)\\in\\mathbb{R}^{D B}$ as the collection of target time series variables in a batch, where $\\operatorname{vec}({\\cdot})$ is an operator that stacks all the columns of a matrix into a vector. Similarly, we define $\\mu_{t}^{\\mathrm{bat}}\\in\\mathbb{R}^{D B}$ rt , $\\pmb{r}_{t}^{\\mathrm{bat}}\\in\\mathbb{R}^{D R}$ , $\\varepsilon_{t}^{\\mathrm{bat}}\\in\\mathbb{R}^{D B}$ , $d_{t}^{\\mathrm{bat}}\\in\\mathbb{R}_{+}^{D B}$ , and $L_{t}^{\\mathrm{bat}}=\\mathrm{blkdiag}(\\{L_{t^{\\prime}}\\}_{t^{\\prime}=t-D+1}^{t})\\in\\mathbb{R}^{D B\\times D R}$ , where $L_{t}^{\\mathrm{bat}}$ has a block diagonal structure (see Fig. 2). The batch-wise decomposition is then expressed as ", "page_idx": 4}, {"type": "equation", "text": "$$\nz_{t}^{\\mathrm{bat}}=\\mu_{t}^{\\mathrm{bat}}+L_{t}^{\\mathrm{bat}}r_{t}^{\\mathrm{bat}}+\\varepsilon_{t}^{\\mathrm{bat}}.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "image", "img_path": "cAFvxVFaii/tmp/ded7bc143e0dd6c43022ab1809a1c063c19b70f9236aef127bd2a5459f45ceb6.jpg", "img_caption": [], "img_footnote": [], "page_idx": 5}, {"type": "text", "text": "Figure 3: Illustration of the training process. Following [3], time series dimensions are randomly sampled, and the base model (e.g., RNNs) is unrolled for each dimension individually (e.g., 1, 2, 4, followed by 1, 3, 4 as depicted). The model parameters are shared across all time series dimensions. A batch of time series variables $z_{t}^{\\mathrm{bat}}$ contains time series vectors $\\boldsymbol{z}_{t}$ covering time steps from $t-D+1$ to $t$ . In contrast to [3], our approach explicitly models dependencies over the extended temporal window from $t-D+1$ to $t$ during training. ", "page_idx": 5}, {"type": "text", "text": "The default GPVar model assumes the latent variable $\\mathbf{\\boldsymbol{r}}_{t}$ is temporally independent, meaning $\\mathrm{Cov}\\left(\\pmb{r}_{s},\\pmb{r}_{t}\\right)=\\mathbf{0},\\forall s\\neq t$ . However, this assumption cannot capture the potential cross-correlation in the errors. To address this, we introduce temporal dependencies in the latent variable within a batch by assuming $\\boldsymbol{r}_{t}^{\\mathrm{bat}}\\sim\\mathcal{N}\\left(\\mathbf{0},\\boldsymbol{C}_{t}\\otimes\\mathbf{I}_{R}\\right)$ , where $C_{t}$ is a dynamic $D\\times D$ correlation matrix. This approach assumes that the rows in the matrix $\\mathbf{r}_{t-D+1:t}=\\left[\\mathbf{r}_{t-D+1},\\ldots,\\mathbf{r}_{t}\\right]$ are independent and identically distributed, following $\\mathcal{N}(\\mathbf{0},C_{t})$ . To efficiently capture dynamic patterns over time, we follow Zheng et al. [9] and express Ct as a dynamic weighted sum base kernel matrices: Ct =  mM= $\\begin{array}{r}{C_{t}=\\sum_{m=1}^{M}w_{m,t}\\pmb{K}_{m}}\\end{array}$ where $w_{m,t}\\ge0$ (with $\\begin{array}{r}{\\sum_{m}w_{m,t}=1}\\end{array}$ ) represents the weights for each component. For simplicity, we model each component $\\kappa_{m}$ using a kernel matrix generated from a squared-exponential (SE) kernel function, where the $(i,j)$ -th entry is $\\begin{array}{r}{K_{m}^{i j}=\\exp(-\\frac{(i-j)^{2}}{l_{m}^{2}})}\\end{array}$ (il−2j) ), with different lengthscales lm (e.g., $l=1,2,3,\\dots)$ . In addition, we incorporate an identity matrix into the additive structure to account for the independent noise process. This parameterization ensures that $C_{t}$ is a positive definite symmetric matrix with unit diagonals, making it a valid correlation matrix. The weights for these components are derived from the hidden state $\\mathbf{h}_{t}$ at each time step through a small neural network, with the number of nodes in the output layer set to $M$ (i.e., the number of components). A softmax layer is used to ensure that these weights are summed up to 1. Note that the parameters of this network will be learned simultaneously with those of the base model. ", "page_idx": 5}, {"type": "text", "text": "Marginalizing out $r_{t}^{\\mathrm{bat}}$ in Eq. (8), we have $\\boldsymbol{z}_{t}^{\\mathrm{bat}}\\sim\\mathcal{N}\\left(\\boldsymbol{\\mu}_{t}^{\\mathrm{bat}},\\boldsymbol{\\Sigma}_{t}^{\\mathrm{bat}}\\right)$ with covariance ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\Sigma_{t}^{\\mathrm{bat}}=(L_{t}^{\\mathrm{bat}})(C_{t}\\otimes\\mathbf{I}_{R})(L_{t}^{\\mathrm{bat}})^{\\top}+\\mathrm{diag}(d_{t}^{\\mathrm{bat}}).\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "It is straightforward to derive that for any $i,j\\in\\{0,1,\\ldots,D-1\\}$ and $i\\neq j$ , the proposed model creates cross-covariance Cov $\\left(\\eta_{t-i},\\eta_{t-j}\\right)=C_{t}^{i j}L_{t-i}L_{t-j}^{\\top}$ between times $t-i$ and $t-j$ , which is no longer 0. While this parameterization results in a non-stationary multivariate process through varying coregionalization [22, 23], a key difference is that both the coregionalization coefficient matrix $\\pmb{L}_{t}$ and the temporal correlation $\\textstyle C_{t}$ are generated by a deep neural network. In this sense, our model can better characterize the empirical cross-covariance matrices of the residuals (see empirical examples in Fig. 1). As $\\pmb{\\mu}_{t}^{\\mathrm{bat}},\\pmb{L}_{t}^{\\mathrm{bat}}$ , and $d_{t}^{\\mathrm{bat}}$ are default outputs of the base probabilistic model, we can compute the overall likelihood (with overlapped data) as ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\mathcal{L}=\\sum_{t=D}^{T}\\log p\\left(z_{t}^{\\mathrm{{bat}}}\\mid\\mu_{t}^{\\mathrm{{bat}}},\\Sigma_{t}^{\\mathrm{{bat}}}\\right).\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "Here, computing the log-likelihood involves evaluating the inverse and the determinant of $\\boldsymbol{\\Sigma}_{t}^{\\mathrm{bat}}$ with size $D B\\times D B$ , for which a naive implementation has a prohibitive time complexity of $\\mathcal{O}\\left(D^{3}B^{3}\\right)$ . However, our parameterization of $\\boldsymbol{\\Sigma}_{t}^{\\mathrm{bat}}$ as $E+A C A^{\\top}$ , where $E\\,=\\,\\mathrm{diag}(d_{t}^{\\mathrm{bat}})$ , $A=L_{t}^{\\mathrm{bat}}$ , and $C=C_{t}\\otimes\\mathbf{I}_{R}$ , allows us to leverage the Sherman–Morrison–Woodbury identity (matrix inversion lemma) and the companion matrix determinant lemma to simplify the computation: ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\quad(E+A C A^{\\top})^{-1}=E^{-1}-E^{-1}A(C^{-1}+A^{\\top}E^{-1}A)^{-1}A^{\\top}E^{-1},}\\\\ &{\\operatorname*{det}\\left(E+A C A^{\\top}\\right)=\\operatorname*{det}\\left(C^{-1}+A^{\\top}E^{-1}A\\right)\\operatorname*{det}\\left(C\\right)\\operatorname*{det}\\left(E\\right).}\\end{array}\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "Then, the likelihood calculation only requires computing the inverse and determinant of a $D R\\times D R$ matrix, specifically $\\boldsymbol{C}^{-1}+\\boldsymbol{A}^{\\top}\\boldsymbol{E}^{-1}\\boldsymbol{A}$ . These computations can be efficiently performed using Cholesky factorization. Detailed computations are provided in Appendix $\\S\\mathrm{A}.2$ . ", "page_idx": 5}, {"type": "text", "text": "Modeling the latent process $\\pmb{r}_{t}$ offers several advantages. Firstly, because $\\pmb{r}_{t}$ has a much lower dimension than $\\varepsilon_{t}$ , modeling the cross-correlation of $\\pmb{r}_{t}$ results in a significantly smaller $D R\\times D R$ covariance matrix compared to the $D B\\times D B$ covariance matrix of $\\varepsilon_{t}$ . Secondly, since $\\pmb{r}_{t}$ follows an isotropic Gaussian distribution, the covariance of $r_{t}^{\\mathrm{bat}}$ can be parameterized with a Kronecker structure $C_{t}\\otimes\\mathbf{I}_{R}$ . This greatly simplifies the task into learning a $D\\times D$ correlation matrix shared by all time series in a batch. Lastly, similar to GPVar, we can still train the model in an end-to-end manner using a subset of time series in each iteration to ensure computational efficiency (Fig. 3). ", "page_idx": 6}, {"type": "text", "text": "4.2 Multistep-ahead Rolling Prediction ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "Autoregressive models perform multistep-ahead forecasting in an iterative manner, where the model generates a sample at each time step during prediction, using it as input for the subsequent step, and continuing this process until the desired prediction range is reached. Our approach enhances this process, similar to Zheng et al. [9], by offering additional calibration based on the learned correlation matrix $C_{t}$ . Assuming observations are available up to time step $t$ , the conditional distribution of $\\pmb{\\eta}_{t+1}$ given errors in the past $(D-1)$ steps, can be derived as ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\eta_{t+1}\\mid\\eta_{t},\\eta_{t-1},\\ldots,\\eta_{t-D+2}\\sim\\mathcal{N}\\left(\\Sigma_{*}\\Sigma_{\\mathrm{obs}}^{-1}\\eta_{\\mathrm{obs}},\\Sigma_{t+1}-\\Sigma_{*}\\Sigma_{\\mathrm{obs}}^{-1}\\Sigma_{*}^{\\top}\\right),}\\end{array}\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "where $\\eta_{\\mathrm{obs}}=\\mathrm{vec}\\left(\\left[\\eta_{t-D+2},\\ldots,\\eta_{t-1},\\eta_{t}\\right]\\right)\\in\\mathbb R^{(D-1)B}$ represents the set of residuals, accessible at forecasting step $t+1$ . Here, $\\pmb{\\Sigma}_{\\mathrm{obs}}$ is a $(D-1)B\\times(D-1)B$ partition of $\\boldsymbol{\\Sigma}_{t+1}^{\\mathrm{bat}}$ that captures the covariance of $\\eta_{\\mathrm{obs}}$ , and $\\pmb{\\Sigma}_{*}$ is a $B\\times(D-1)B$ partition of $\\boldsymbol{\\Sigma}_{t+1}^{\\mathrm{bat}}$ representing the covariance between $\\pmb{\\eta}_{t+1}$ and $\\eta_{\\mathrm{obs}}$ , i.e., $\\boldsymbol{\\Sigma}_{t+1}^{\\mathrm{bat}}=\\left[\\begin{array}{c c}{\\boldsymbol{\\Sigma}_{\\mathrm{obs}}}&{\\boldsymbol{\\Sigma}_{\\ast}^{\\intercal}}\\\\ {\\boldsymbol{\\Sigma}_{\\ast}}&{\\boldsymbol{\\Sigma}_{t+1}}\\end{array}\\right]$ . For conciseness, we omit the time index $t$ in $\\pmb{\\Sigma}_{\\mathrm{obs}}$ , $\\Sigma_{*}$ and $\\eta_{\\mathrm{obs}}$ . Since $\\pmb{\\mu}_{t+1}$ is a deterministic output from the base model, a sample of the target variables $\\tilde{\\mathbf{z}}_{t+1}$ can be derived by first drawing a sample $\\tilde{\\pmb{\\eta}}_{t+1}$ from Eq. (12), then combining it with the predicted mean vector $\\pmb{\\mu}_{t+1}$ as $\\tilde{\\mathbf{z}}_{t+1}=\\mu_{t+1}+\\tilde{\\eta}_{t+1}$ . It should be noted that we can still leverage the Sherman-Morrison-Woodbury identity when computing the inverse $\\Sigma_{\\mathrm{obs}}^{-1}$ . ", "page_idx": 6}, {"type": "text", "text": "By taking the sample $\\tilde{\\pmb{\\eta}}_{t+1}$ as an observed residual, we can iteratively apply the process described in Eq. (12) to derive a trajectory of $\\{\\tilde{\\mathbf{z}}_{t+q}\\}_{q=1}^{Q}$ . Repeating this procedure allows us to generate multiple samples, characterizing the predictive distribution at each time step. ", "page_idx": 6}, {"type": "text", "text": "5 Experiments ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "5.1 Evaluation of Predictive Performance ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "Datasets. We use widely recognized time series benchmarking datasets from GluonTS [24]. The prediction range $(Q)$ for each dataset follows the configurations provided by GluonTS. We applied a sequential split into training, validation, and testing sets for each dataset. Each dataset was standardized using the mean and standard deviation from the training set, and predictions were rescaled to their original values for evaluation. Further details on the datasets can be found in Appendix $\\S\\mathrm{A.l}$ . ", "page_idx": 6}, {"type": "text", "text": "Base probabilistic models. We integrated the proposed method into two distinct autoregressive models: the RNN-based GPVar [3] and the decoder-only Transformer [25]. These models are trained to generate distribution parameters as described in $\\S4$ . Our approach can be applied to other autoregressive multivariate models with minimal adjustments, provided the final prediction follows a multivariate Gaussian distribution. The implementation is based on using PyTorch Forecasting [26]. Both models use lagged time series values and additional features or covariates as inputs. Details on model training $(\\S\\mathrm{A}.3)$ , hyperparameter tuning $(\\S\\mathrm{A}.5)$ , and the base model $(\\S\\mathrm{A}.6)$ are provided in Appendix $\\S\\mathrm{A}$ . The code is available at https://github.com/rottenivy/mv_pts_correlatederr. ", "page_idx": 6}, {"type": "text", "text": "Dynamic correlation matrix. We introduce a limited number of additional parameters to project the state vector $\\mathbf{h}_{t}$ into component weights $w_{m,t}$ , which are used to generate the dynamic correlation matrix $\\textstyle C_{t}$ . The number of base kernels $(M)$ for generating $\\textstyle C_{t}$ and the associated lengthscale set $\\{l_{m}\\}_{m=1}^{M-1}$ are treated as hyperparameters. We perform a grid search over $M=2,3,4$ and two sets of lengthscales— and . Models with the best validation loss are selected. These different lengthscales capture varying correlation decay rates, enabling the model to account for different temporal patterns. The time-varying component weights enable dynamic adaptation to changing correlation structures over time. ", "page_idx": 6}, {"type": "table", "img_path": "cAFvxVFaii/tmp/0d395fe6912a99683b15e90fa0a51dca0892c0451ca82e87d8f57aade8980dea.jpg", "table_caption": ["Table 1: $\\mathrm{CRPS}_{\\mathrm{sum}}$ accuracy comparison. “w/o” denotes methods without time-dependent errors, while “w/” indicates our method. Bold values show models with time-dependent errors performing better. Mean and standard deviation are obtained from 10 runs of each model. "], "table_footnote": [], "page_idx": 7}, {"type": "text", "text": "", "page_idx": 7}, {"type": "text", "text": "Baselines. We evaluate the proposed method by comparing it with a baseline model trained without accounting for error cross-correlation (Eq. (4)). The baseline model represents a special case of our model with $C_{t}=I_{D}$ . To ensure a straightforward and fair comparison, we align the cross-correlation range $(D)$ with the prediction range $(Q)$ , ensuring identical data sampling processes for both methods. Additionally, we set $P=Q$ following the default configuration in GluonTS. We also include VAR and GARCH as naive baseline models (see Appendix $\\S\\mathrm{A}.4\\rangle$ . ", "page_idx": 7}, {"type": "text", "text": "Metrics. We use the Continuous Ranked Probability Score (CRPS) [27] as the main metric: ", "page_idx": 7}, {"type": "equation", "text": "$$\n\\mathrm{CRPS}(F,z)=\\mathbb{E}_{F}|Z-z|-\\frac{1}{2}\\mathbb{E}_{F}\\left|Z-Z^{\\prime}\\right|,\n$$", "text_format": "latex", "page_idx": 7}, {"type": "text", "text": "where $F$ is the cumulative distribution function (CDF) of the predicted variable, $z$ is the observation, $Z$ and $Z^{\\prime}$ are independent copies of the prediction samples associated with the distribution $F$ . To evaluate multivariate dependencies in the time series data, we compute $\\mathrm{CRPS}_{\\mathrm{sum}}$ by first summing both the forecast and ground-truth values across all time series and then calculating the CRPS over the resulting sums [3, 16, 17]. As $\\mathrm{CRPS}_{\\mathrm{sum}}$ may overlook model performance on individual dimensions [28], we also report additional metrics, e.g., the energy score [27, 29], in Appendix $\\S B.1$ . ", "page_idx": 7}, {"type": "text", "text": "Training dynamics. Our approach incurs additional training costs per optimization step due to the more complex likelihood function. As shown in Appendix $\\S B.3$ , the training time per epoch for models using our method is generally longer than that of baseline methods. However, our parameterization allows for scalability to large time series datasets by using a small random subset of time series at each optimization step during training. ", "page_idx": 7}, {"type": "text", "text": "Benchmark results. The $\\mathrm{CRPS}_{\\mathrm{sum}}$ results are presented in Table 1. Our method achieves an average improvement of $13.79\\%$ for GPVar and $6.91\\%$ for the Transformer model. It is important to note that the degree of performance enhancement varies across different base models and datasets, influenced by factors such as the inherent data characteristics and the performance of different model architectures. The alignment between the actual correlation structure and our kernel assumption also plays a crucial role in the effectiveness of our method. Additionally, our approach demonstrates consistent improvements across five different metrics, with significant gains in multivariate metrics such as the energy score (Appendix $\\S B.2)$ . ", "page_idx": 7}, {"type": "text", "text": "To provide further insights, we compare the residual autocorrelation and cross-lag correlation with and without applying our method in Appendix $\\S B.5.1$ , showing that our method effectively reduces cross-correlations in many scenarios. We use ACF plot comparisons to illustrate the reduction in autocorrelation and cross-correlation plot comparisons to demonstrate the decrease in cross-lag correlation. The residuals generated by the model with our method exhibit weaker cross-correlations, which is particularly enhanced by the calibration process during prediction (§4.2). ", "page_idx": 7}, {"type": "text", "text": "Furthermore, Appendix $\\S B.5.2$ separates the accuracy improvement over forecast steps for each dataset. The performance improvement is shown to be related to both the absolute time across the temporal span of the dataset (especially for time series with strong periodic patterns) and the relative time over the prediction horizon. ", "page_idx": 7}, {"type": "image", "img_path": "cAFvxVFaii/tmp/3739b471f72843c538764aa18eb68c5485c72580eee9e1077107a9ebc1544fb9.jpg", "img_caption": ["Figure 4: (a) Component weights for generating $\\textstyle C_{t}$ for a batch of time series $B=8,$ ) from the $\\mathtt{m4.}$ _hourly dataset obtained by the GPVar model. Parameters $v_{0},w_{1},w_{2}$ represent the component weights of the kernel matrices associated with lengthscales $l=0.5,1.5,2.5$ , and $w_{3}$ is the component weight of the identity matrix. Shaded areas distinguish different days; (b) The autocorrelation function (ACF) indicated by the correlation matrix $C_{t}$ at 17:00. Given the rapid decay of the ACF, we only plot 12 lags to enhance visualization; (c) The corresponding covariance matrix of the associated target variables $\\boldsymbol{\\Sigma}_{t}^{\\mathrm{bat}}$ at 17:00. A zoom-in view of a $3B\\times3B$ region is illustrated in the plot, where the diagonal blocks represent $B\\times B$ covariance matrices $\\Sigma_{t^{\\prime}}$ of $\\mathbf{z}_{t^{\\prime}}$ over three consecutive time steps. The off-diagonal blocks describe the cross-covariance $\\operatorname{Cov}\\!\\left(\\mathbf{z}_{t-\\Delta},\\mathbf{z}_{t}\\right)$ , $\\forall\\Delta\\neq0$ . For visualization clarity, covariance values are clipped to the range $[0,0.03]$ . "], "img_footnote": [], "page_idx": 8}, {"type": "text", "text": "", "page_idx": 8}, {"type": "text", "text": "5.2 Model Interpretation ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "Our method captures error cross-correlation through the dynamic construction of a covariance matrix, achieved by combining kernel matrices with varying lengthscales in a dynamically weighted sum. A small lengthscale corresponds to short-range positive correlations, while a large lengthscale captures positive correlations over longer lags. ", "page_idx": 8}, {"type": "text", "text": "In Fig. 4, we depict the dynamic component weights and the resulting autocorrelation function (the first row of the correlation matrix $\\textstyle C_{t}$ ) for a batch of time series from the $\\mathtt{m4.}$ _hourly dataset spanning a four-day window. We also provide the covariance matrix of $z_{t}^{\\mathrm{bat}}$ using the correlation matrix and model outputs at a specific time of day. The component weight $w_{3}$ , corresponding to the identity matrix, dominates throughout the observation period. This suggests that the error correlation is generally mild over time. This behavior is influenced by the Kronecker structure used to parameterize the covariance over the low-dimensional latent variables $\\boldsymbol{r}_{t}$ , which assumes all latent processes share the same autocorrelation structure. Given the Kronecker structure, the model tends to learn the mildest temporal correlation among the time series in a batch. ", "page_idx": 8}, {"type": "text", "text": "Moreover, we observe that the dynamic component weights adjust the correlation strengths. Specifically, when the weight assigned to the identity matrix $\\left(w_{3}\\right)$ increases, the error process tends to be more independent. In contrast, when the weights assigned to the other kernel matrices $(w_{0},w_{1}$ , and $w_{2}$ ) are larger, the error process becomes more correlated, as the kernel matrices with different lengthscales combine to formulate a specific correlation structure. Fig. 4(a) demonstrates pronounced daily patterns in temporal correlation, particularly when errors exhibit increased correlation around 17:00 each day. The corresponding autocorrelation function is shown in Fig. 4(b). Fig. 4(c) illustrates the corresponding covariance matrix of the associated target variables within the cross-correlation horizon. The diagonal blocks represent the contemporaneous covariance $\\Sigma_{t}$ of $\\mathbf{z}_{t}$ at each time step, while the off-diagonal blocks capture the cross-covariance $\\operatorname{Cov}\\!\\left(\\mathbf{z}_{t-\\Delta},\\mathbf{z}_{t}\\right)$ for $\\forall\\Delta\\neq0$ , effectively modeled by our approach. The zoomed-in view provides a $3B\\times3B$ region that illustrates the cross-covariance within two lags. We observe that the cross-covariance is most pronounced at lag 1, consistent with the observation in Fig. 4(a) that the component weight $w_{0}$ , assigned to the base kernel matrix with lengthscale $l=0.5$ , is more pronounced than $w_{1}$ and $w_{2}$ . ", "page_idx": 8}, {"type": "text", "text": "6 Discussion ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "In this section, we discuss factors that influence the performance of our method. Specifically, we highlight the effectiveness of our model in long-term forecasting across various scenarios. We also discuss the effect of scaling up to larger batch sizes during prediction. Additionally, we examine the impact of non-Gaussian errors on model performance. ", "page_idx": 8}, {"type": "text", "text": "", "page_idx": 9}, {"type": "text", "text": "Long-term forecasting. The advantage of modeling error correlation can vary in long-term forecasting, especially in autoregressive predictions where errors accumulate and propagate over time. Using residuals from previous time steps to calibrate forecasts may be beneficial for non-stationary segments of the time series. However, for time series with strong periodic effects, the model may also rely on seasonal lags. As shown in Fig. 21 and Fig. 22 of the Appendix, the advantage of modeling error correlation can decrease in longer-term forecasts compared to shorter-term forecasts for some datasets with strong periodic effects (e.g., the traffic dataset in Fig. 21). It is not necessarily true that the advantage diminishes for long-horizon predictions, as the effectiveness of our method depends on the quality of predictions during inference. In cases where the model provides accurate long-term forecasts, the benefit of modeling correlated errors may be less pronounced. ", "page_idx": 9}, {"type": "text", "text": "Scalability. Increasing the number of time series $B$ in a batch leads to higher training costs. Because the model requires numerous iterations over the dataset for optimization, using a large $B$ during training is not feasible. However, during prediction, the batch size can be increased to leverage more information. This may enhance both prediction accuracy and error calibration, provided sufficient memory is available. We demonstrate the effect of increasing batch size during prediction in Appendix $\\S B.4$ through additional experiments. Both models, with and without our method, show improvement from increased batch sizes during prediction, as reflected by a decrease in $\\mathrm{CRPS}_{\\mathrm{sum}}$ . ", "page_idx": 9}, {"type": "text", "text": "Non-Gaussian errors. For the baseline model, assuming Gaussian errors may lead to model misspecification, resulting in more correlated residuals. To address this issue, we also trained the baseline models using the likelihood of a multivariate $t$ -distribution; the results are presented in Table 15 of the Appendix. Although using an alternative distribution can lead to better performance on some datasets without our method, we observed that our method effectively closes the performance gap when the $t$ -distribution outperforms the Gaussian assumption. We chose the Gaussian distribution for its beneficial properties, including its marginalization rule and well-defined conditional distributions, both essential for statistically consistent model training and reliable inference. Thus, a more effective approach could involve first transforming the original observations into Gaussian-distributed data using a Gaussian Copula [3], followed by applying our method. ", "page_idx": 9}, {"type": "text", "text": "7 Conclusion and Broader Impacts ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "This paper presents a novel approach for addressing error cross-correlation in multivariate probabilistic time series forecasting, specifically for models with autoregressive properties and Gaussian distribution outputs. We construct a dynamic covariance matrix using a small set of independent and identically distributed latent temporal processes. These latent processes effectively model temporal correlation and integrate seamlessly into the base model, where the contemporaneous covariance is parameterized by a low-rank-plus-diagonal structure. This approach enables the modeling and prediction of a time-varying covariance matrix for the target time series variables. The experimental results demonstrate its effectiveness in enhancing uncertainty quantification. ", "page_idx": 9}, {"type": "text", "text": "Our contributions are two-fold. First, our approach relaxes the time-independent error assumption during the training process for probabilistic forecasting models, addressing the reality that residuals are typically time-dependent. Second, the learned cross-correlation improves multistep-ahead predictions by refining the distribution output at each forecasting step. These enhancements to existing models have broader implications for fields such as finance, healthcare, and energy, where improved forecasts and uncertainty quantification can lead to more informed decisions. ", "page_idx": 9}, {"type": "text", "text": "There are several avenues for future research. First, the Kronecker structure $C_{t}\\otimes\\mathbf{I}_{R}$ for the covariance matrix of the latent variable $r_{t}^{\\mathrm{bat}}$ may be too restrictive for multivariate time series problems. Exploring more flexible covariance structures, such as employing different $\\boldsymbol{C}_{r,t}$ matrices for each latent temporal process as in the linear model of coregionalization (LMC, [22, 23]), could be a promising direction for further investigation. Second, the parameterization of $C_{t}$ could be expanded. Instead of using SE kernels, $C_{t}$ could be parameterized as fully learnable positive definite symmetric Toeplitz matrices. For example, an $\\operatorname{AR}(p)$ process has a covariance structure in Toeplitz form, allowing for the modeling of negative correlations. This alternative approach could offer greater flexibility in capturing complex correlation patterns in multivariate time series data. ", "page_idx": 9}, {"type": "text", "text": "Acknowledgments and Disclosure of Funding ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "We acknowledge the support from the Natural Sciences and Engineering Research Council (NSERC) of Canada (Discovery Grant). Vincent Zhihao Zheng also acknowledges the support received from the FRQNT B2X Doctoral Scholarship Program. ", "page_idx": 10}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "[1] Tilmann Gneiting and Matthias Katzfuss. Probabilistic forecasting. Annual Review of Statistics and Its Application, 1(1):125–151, 2014. [2] Konstantinos Benidis, Syama Sundar Rangapuram, Valentin Flunkert, Yuyang Wang, Danielle Maddix, Caner Turkmen, Jan Gasthaus, Michael Bohlke-Schneider, David Salinas, Lorenzo Stella, et al. Deep learning for time series forecasting: Tutorial and literature survey. ACM Computing Surveys, 55(6):1–36, 2022. [3] David Salinas, Michael Bohlke-Schneider, Laurent Callot, Roberto Medico, and Jan Gasthaus. Highdimensional multivariate forecasting with low-rank gaussian copula processes. Advances in Neural Information Processing Systems, 32, 2019.   \n[4] Kashif Rasul, Abdul-Saboor Sheikh, Ingmar Schuster, Urs Bergmann, and Roland Vollgraf. Multivariate probabilistic time series forecasting via conditioned normalizing flows. In International Conference on Learning Representations, 2021.   \n[5] Kashif Rasul, Calvin Seward, Ingmar Schuster, and Roland Vollgraf. Autoregressive denoising diffusion models for multivariate probabilistic time series forecasting. In International Conference on Machine Learning, pages 8857–8868. PMLR, 2021.   \n[6] Rob J Hyndman and George Athanasopoulos. Forecasting: Principles and Practice. OTexts, 2018.   \n[7] Fan-Keng Sun, Chris Lang, and Duane Boning. Adjusting for autocorrelated errors in neural networks for time series. Advances in Neural Information Processing Systems, 34:29806–29819, 2021. [8] Vincent Zhihao Zheng, Seongjin Choi, and Lijun Sun. Enhancing deep traffic forecasting models with dynamic regression. arXiv preprint arXiv:2301.06650, 2023.   \n[9] Vincent Zhihao Zheng, Seongjin Choi, and Lijun Sun. Better batch for deep probabilistic time series forecasting. In International Conference on Artificial Intelligence and Statistics, pages 91–99. PMLR, 2024.   \n[10] David Salinas, Valentin Flunkert, Jan Gasthaus, and Tim Januschowski. Deepar: Probabilistic forecasting with autoregressive recurrent networks. International Journal of Forecasting, 36(3):1181–1191, 2020.   \n[11] Ruofeng Wen, Kari Torkkola, Balakrishnan Narayanaswamy, and Dhruv Madeka. A multi-horizon quantile recurrent forecaster. arXiv preprint arXiv:1711.11053, 2017.   \n[12] Syama Sundar Rangapuram, Matthias W Seeger, Jan Gasthaus, Lorenzo Stella, Yuyang Wang, and Tim Januschowski. Deep state space models for time series forecasting. Advances in Neural Information Processing Systems, 31, 2018.   \n[13] Emmanuel de Bézenac, Syama Sundar Rangapuram, Konstantinos Benidis, Michael Bohlke-Schneider, Richard Kurle, Lorenzo Stella, Hilaf Hasson, Patrick Gallinari, and Tim Januschowski. Normalizing kalman filters for multivariate time series analysis. Advances in Neural Information Processing Systems, 33:2995–3007, 2020.   \n[14] Yuyang Wang, Alex Smola, Danielle Maddix, Jan Gasthaus, Dean Foster, and Tim Januschowski. Deep factors for forecasting. In International Conference on Machine Learning, pages 6607–6617. PMLR, 2019.   \n[15] Binh Tang and David S Matteson. Probabilistic transformer for time series analysis. Advances in Neural Information Processing Systems, 34:23592–23608, 2021.   \n[16] Alexandre Drouin, Étienne Marcotte, and Nicolas Chapados. Tactis: Transformer-attentional copulas for time series. In International Conference on Machine Learning, pages 5447–5493. PMLR, 2022.   \n[17] Arjun Ashok, Étienne Marcotte, Valentina Zantedeschi, Nicolas Chapados, and Alexandre Drouin. Tactis-2: Better, faster, simpler attentional copulas for multivariate time series. In International Conference on Learning Representations, 2024.   \n[18] Raquel Prado, Marco AR Ferreira, and Mike West. Time Series: Modeling, Computation, and Inference. CRC Press, 2021.   \n[19] James Douglas Hamilton. Time Series Analysis. Princeton University Press, 2020.   \n[20] Arkajyoti Saha, Sumanta Basu, and Abhirup Datta. Random forests for spatially dependent data. Journal of the American Statistical Association, 118(541):665–683, 2023.   \n[21] Seongjin Choi, Nicolas Saunier, Vincent Zhihao Zheng, Martin Trepanier, and Lijun Sun. Scalable dynamic mixture model with full covariance for probabilistic traffic forecasting. arXiv preprint arXiv:2212.06653, 2022.   \n[22] Alan E Gelfand, Alexandra M Schmidt, Sudipto Banerjee, and CF Sirmans. Nonstationary multivariate process modeling through spatially varying coregionalization. Test, 13:263–312, 2004.   \n[23] Rui Meng, Braden Soper, Herbert KH Lee, Vincent X Liu, John D Greene, and Priyadip Ray. Nonstationary multivariate gaussian processes for electronic health records. Journal of Biomedical Informatics, 117: 103698, 2021.   \n[24] Alexander Alexandrov, Konstantinos Benidis, Michael Bohlke-Schneider, Valentin Flunkert, Jan Gasthaus, Tim Januschowski, Danielle C Maddix, Syama Rangapuram, David Salinas, Jasper Schulz, et al. Gluonts: Probabilistic and neural time series modeling in python. The Journal of Machine Learning Research, 21 (1):4629–4634, 2020.   \n[25] Alec Radford, Karthik Narasimhan, Tim Salimans, Ilya Sutskever, et al. Improving language understanding by generative pre-training. 2018.   \n[26] Jan Beitner. Pytorch forecasting. https://pytorch-forecasting.readthedocs.io, 2020.   \n[27] Tilmann Gneiting and Adrian E Raftery. Strictly proper scoring rules, prediction, and estimation. Journal of the American Statistical Association, 102(477):359–378, 2007.   \n[28] Alireza Koochali, Peter Schichtel, Andreas Dengel, and Sheraz Ahmed. Random noise vs. state-of-the-art probabilistic forecasting methods: A case study on crps-sum discrimination ability. Applied Sciences, 12 (10):5104, 2022.   \n[29] Étienne Marcotte, Valentina Zantedeschi, Alexandre Drouin, and Nicolas Chapados. Regions of reliability in the evaluation of multivariate probabilistic forecasts. In International Conference on Machine Learning, pages 23958–24004. PMLR, 2023.   \n[30] Dheeru Dua and Casey Graff. Uci machine learning repository. URL https://archive.ics.uci.edu/ml/index.php, 2017.   \n[31] Spyros Makridakis, Evangelos Spiliotis, and Vassilios Assimakopoulos. The m4 competition: 100,000 time series and 61 forecasting methods. International Journal of Forecasting, 36(1):54–74, 2020.   \n[32] Guokun Lai, Wei-Cheng Chang, Yiming Yang, and Hanxiao Liu. Modeling long-and short-term temporal patterns with deep neural networks. In The 41st International ACM SIGIR Conference on Research & Development in Information Retrieval, pages 95–104, 2018.   \n[33] Spyros Makridakis, Allan Andersen, Robert Carbone, Robert Fildes, Michele Hibon, Rudolf Lewandowski, Joseph Newton, Emanuel Parzen, and Robert Winkler. The accuracy of extrapolation (time series) methods: Results of a forecasting competition. Journal of Forecasting, 1(2):111–153, 1982.   \n[34] Chao Chen, Karl Petty, Alexander Skabardonis, Pravin Varaiya, and Zhanfeng Jia. Freeway performance measurement system: mining loop detector data. Transportation Research Record, 1748(1):96–102, 2001.   \n[35] Caltrans. Caltrans performance measurement system. URL https://pems.dot.ca.gov/, 2015.   \n[36] NYC Taxi Limousine Commission. Uber tlc foil response, 2015.   \n[37] Jan Gasthaus, Konstantinos Benidis, Yuyang Wang, Syama Sundar Rangapuram, David Salinas, Valentin Flunkert, and Tim Januschowski. Probabilistic forecasting with spline quantile function rnns. In The 22nd International Conference on Artificial Intelligence and Statistics, pages 1901–1910. PMLR, 2019.   \n[38] Helmut Lütkepohl. New Introduction to Multiple Time Series Analysis. Springer Science & Business Media, 2005.   \n[39] Roy Van der Weide. Go-garch: a multivariate generalized orthogonal garch model. Journal of Applied Econometrics, 17(5):549–564, 2002.   \n[40] Robert Engle. Dynamic conditional correlation: A simple class of multivariate generalized autoregressive conditional heteroskedasticity models. Journal of Business & Economic Statistics, 20(3):339–350, 2002.   \n[41] Skipper Seabold and Josef Perktold. Statsmodels: econometric and statistical modeling with python. SciPy, 7:1, 2010.   \n[42] Prashant Srivastava. mgarch. https://pypi.org/project/mgarch/, 2022.   \n[43] Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz Kaiser, and Illia Polosukhin. Attention is all you need. Advances in Neural Information Processing Systems, 30, 2017.   \n[44] Lei Bai, Lina Yao, Can Li, Xianzhi Wang, and Can Wang. Adaptive graph convolutional recurrent network for traffic forecasting. Advances in Neural Information Processing Systems, 33:17804–17815, 2020.   \n[45] Shun-Yao Shih, Fan-Keng Sun, and Hung-yi Lee. Temporal pattern attention for multivariate time series forecasting. Machine Learning, 108:1421–1441, 2019.   \n[46] Massimo Guidolin and Manuela Pedio. Essentials of Time Series for Financial Applications. Academic Press, 2018. ", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "Appendix ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "Table of Contents ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "A Experimental Details 14 ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "A.1 Datasets . . .14   \nA.2 Multivariate Likelihood with Autocorrelated Errors .15   \nA.3 Training Procedure . . 16   \nA.4 Naive Baseline Description . 16   \nA.5 Hyperparameter Search . 17   \nA.6 Base Model Description and Input Features . 17 ", "page_idx": 13}, {"type": "text", "text": "B Metrics and Additional Results ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "B.1 Metric Definition .19   \nB.1.1 Continuous Ranked Probability Score . 19   \nB.1.2 Quantile Loss . . . . . 20   \nB.1.3 Energy Score . 20   \nB.1.4 Root Relative Mean Squared Error . 20   \nB.2 Results on Other Metrics . . .20   \nB.3 Training Dynamics . . . 20   \nB.4 Effect of the Number of Time Series during Prediction . 20   \nB.5 Additional Model Interpretation . . . 24   \nB.5.1 Comparison of Residual Correlation . 24   \nB.5.2 Performance Breakdown at Each Forecast Step .24   \nB.6 Alternative Parametrization of $C_{t}$ . . . .29   \nB.6.1 Learnable Lengthscales . . 29   \nB.6.2 Using Autocorrelations of an $\\operatorname{AR}(p)$ process . 30   \nB.7 Alternative Error Assumptions . . . .31   \nB.8 Qualitative Results on Forecasting . 32 ", "page_idx": 13}, {"type": "text", "text": "A Experimental Details ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "A.1 Datasets ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "We performed experiments on a diverse set of real-world datasets obtained from GluonTS [24]. These datasets include: ", "page_idx": 13}, {"type": "text", "text": "• electricity [30]: Hourly electricity consumption data collected from a total of 370 households over the period spanning from January 2012 to June 2014.   \n• m4_hourly [31]: Hourly time series data from various domains, covering microeconomics, macroeconomics, finance, industry, demographics, and various other fields, are sourced from the M4-competition.   \n• exchange_rate [32]: Daily exchange rate information for eight different countries spanning the period from 1990 to 2016.   \n• m1_quarterly [33]: Quarterly time series data spanning seven different domains.   \n• pems03 [34]: Traffic flow records obtained from Caltrans District 3 and accessed through the Caltrans Performance Measurement System (PeMS). The records are aggregated at a 5-minute interval.   \n• solar [32]: Hourly time series representing solar power production data in the state of Alabama for the year 2006.   \n• traffic [35]: Hourly traffic occupancy rates recorded by sensors installed in the San Francisco freeway system between January 2008 and June 2008.   \n• uber_hourly [36]: Hourly time series of Uber pickups in New York City spanning from February to July 2015.   \n• wikipedia [37]: Daily page views for 2,000 Wikipedia pages spanning from January 2012 to March 2014. ", "page_idx": 13}, {"type": "text", "text": "", "page_idx": 14}, {"type": "text", "text": "These datasets are widely employed for benchmarking time series forecasting models, following their default configurations in GluonTS, including granularity, prediction range $(Q)$ , and the number of rolling evaluations. For each dataset, we performed a sequential split into training, validation, and testing sets, with the temporal length of the validation set matching that of the testing set. The temporal length of the testing set was determined by considering the prediction range and the required number of rolling evaluations. For instance, the testing horizon for the traffic dataset is computed as $24+7-1\\,=\\,30$ time steps. As a result, the model will predict 24 steps $(Q)$ sequentially, with 7 distinct consecutive prediction start timestamps, also known as 7 forecast instances. In our experiments, we align the conditioning range $(P)$ with the prediction range $(Q)$ , maintaining consistency with the default setting in GluonTS. For simplicity, we set the autocorrelation horizon $(D)$ to also match the prediction range $(Q)$ . Essentially, in this paper, we have $P=Q=D$ . Each dataset was standardized using the mean and standard deviation from the training set. Predictions were rescaled to their original values for computing evaluation metrics. The statistics of all datasets are summarized in Table 2. ", "page_idx": 14}, {"type": "table", "img_path": "cAFvxVFaii/tmp/555775a4133de10ac781d4b08c8a0de22a377b2f180a4e6c6e22ae1b28b258c3.jpg", "table_caption": ["Table 2: Dataset summary. "], "table_footnote": [], "page_idx": 14}, {"type": "text", "text": "A.2 Multivariate Likelihood with Correlated Errors ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "The probability density function of a multivariate normal distribution with autocorrelated errors, as described in $\\S4.1$ , is defined in Eq. (14). For simplicity, we omit the subscript $t$ and superscript bat for all notations: ", "page_idx": 14}, {"type": "equation", "text": "$$\nf(z)=(2\\pi)^{-B/2}|\\Sigma|^{-1/2}\\exp{\\left(-\\frac{1}{2}\\left(z-\\mu\\right)^{\\top}\\Sigma^{-1}\\left(z-\\mu\\right)\\right)}.\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "We use the negative log likelihood (NLL) of an observed $_{z}$ as the loss function for training our model. The NLL can be calculated as the negative log of the probability density function in Eq. (14): ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\mathcal{L}_{N L L}=-\\ln L\\left(z\\right)=\\frac{1}{2}\\left[\\ln|\\boldsymbol{\\Sigma}|+\\left(z-\\mu\\right)^{\\top}\\boldsymbol{\\Sigma}^{-1}\\left(z-\\mu\\right)+B\\ln\\left(2\\pi\\right)\\right],\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "where $B$ is the number of time series in a batch. The covariance matrix is parameterized as $\\pmb{\\Sigma}=$ $L(C\\otimes\\mathbf{I}_{R})L^{\\top}+E$ . In this parameterization, $\\pmb{L}\\in\\mathbb{R}^{D B\\times D R}$ is the covariance factor, $\\boldsymbol{C}\\in\\mathbb{R}^{D\\times D}$ is the autocorrelation matrix, $\\mathbf{\\dot{E}}=\\mathrm{diag}(\\mathbf{\\boldsymbol{d}})$ , and ${\\pmb d}\\in\\mathbb{R}_{+}^{D B}$ are the diagonal elements. The bottleneck in evaluating this NLL lies in the calculation of the inverse and determinant of $\\Sigma$ . Therefore, we can simplify the calculation using the Sherman–Morrison–Woodbury identity (matrix inversion lemma) and the companion matrix determinant lemma: ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\Sigma^{-1}=\\Big(E+L\\left(C\\otimes\\mathbf{I}_{R}\\right)L^{\\top}\\Big)^{-1}}\\\\ &{\\quad\\quad=E^{-1}-E^{-1}L\\left(\\left(C\\otimes\\mathbf{I}_{R}\\right)^{-1}+L^{\\top}E^{-1}L\\right)^{-1}L^{\\top}E^{-1}.}\\end{array}\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "Consequently, the Mahalanobis term in Eq. (15) becomes: ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\eta^{\\top}\\Sigma^{-1}\\eta=\\eta^{\\top}E^{-1}\\eta-\\eta^{\\top}E^{-1}L\\left(\\left(C\\otimes\\mathbf{I}_{R}\\right)^{-1}+L^{\\top}E^{-1}L\\right)^{-1}L^{\\top}E^{-1}\\eta}\\\\ &{\\qquad\\qquad=\\eta^{\\top}E^{-1}\\eta-\\eta^{\\top}E^{-1}L\\left(L_{c a p}L_{c a p}^{\\top}\\right)^{-1}L^{\\top}E^{-1}\\eta}\\\\ &{\\qquad\\qquad=\\eta^{\\top}E^{-1}\\eta-\\left(L_{c a p}^{-1}L^{\\top}E^{-1}\\eta\\right)^{\\top}\\left(L_{c a p}^{-1}L^{\\top}E^{-1}\\eta\\right)}\\\\ &{\\qquad\\qquad=\\eta^{\\top}E^{-1}\\eta-k^{\\top}k,}\\end{array}\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "where $\\begin{array}{r l r}{k}&{{}=}&{L_{c a p}^{-1}L^{\\top}E^{-1}\\eta}\\end{array}$ . $L_{c a p}$ is the Cholesky factor of the capacitance matrix $\\left((C\\otimes\\mathbf{I}_{R})^{-1}+L^{\\top}E^{-1}L\\right)$ . The computation of $\\pmb{k}$ can be efficiently resolved by solving the linear system of equations $\\dot{L}_{c a p}k=\\boldsymbol{L}^{\\top}\\boldsymbol{E}^{-1}\\eta$ . Since $\\boldsymbol{E}$ is a diagonal matrix, the only matrix inverse we need to calculate in Eq. (17) is $\\left(C\\otimes\\mathbf{I}_{R}\\right)^{-1}$ , which can be further simplified as $C^{-1}\\otimes{\\bf I}_{R}$ . Recall that $_{C}$ is a $D\\times D$ autocorrelation matrix. Therefore, calculating its inverse is much easier than computing the inverse of $\\Sigma$ , which is a $D B\\times D B$ matrix. Moreover, the computational cost does not scale with the number of time series $B$ in a batch. ", "page_idx": 15}, {"type": "text", "text": "The calculation of the determinant can also be greatly simplified with our parameterization: ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\begin{array}{l}{{\\displaystyle\\ln\\bigl|\\mathbf{\\boldsymbol{\\Sigma}}\\bigr|=\\ln\\bigl|\\mathbf{\\boldsymbol{E}}+\\mathbf{\\boldsymbol{L}}\\left(\\mathbf{\\boldsymbol{C}}\\otimes\\mathbf{\\boldsymbol{I}}_{R}\\right)\\mathbf{\\boldsymbol{L}}^{\\top}\\bigr|}\\ ~}\\\\ {{\\displaystyle~~~~~~~=\\ln\\bigl|\\left(\\mathbf{\\boldsymbol{C}}\\otimes\\mathbf{\\boldsymbol{I}}_{R}\\right)^{-1}+\\mathbf{\\boldsymbol{L}}^{\\top}\\mathbf{\\boldsymbol{E}}^{-1}\\mathbf{\\boldsymbol{L}}\\bigr|+\\ln\\bigl|\\mathbf{\\boldsymbol{C}}\\otimes\\mathbf{\\boldsymbol{I}}_{R}\\bigr|+\\ln\\bigl|\\mathbf{\\boldsymbol{E}}\\bigr|}\\ ~}\\\\ {{\\displaystyle~~~~~~~=2\\sum_{i}^{D R}\\ln\\bigl[\\mathbf{\\boldsymbol{L}}_{c a p}\\bigr]_{i,i}+2R\\sum_{i}^{D}\\ln\\left[\\mathbf{\\boldsymbol{L}}_{C}\\right]_{i,i}+\\sum_{i}^{D B}\\ln\\left[\\mathbf{\\boldsymbol{E}}\\right]_{i,i},}}\\end{array}\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "where $L_{C}$ is the Cholesky factor of the autocorrelation matrix $_{C}$ . ", "page_idx": 15}, {"type": "text", "text": "A.3 Training Procedure ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "Compute used All models in the paper were trained in an Anaconda environment with access to one AMD Ryzen Threadripper PRO 5955WX CPU and four NVIDIA RTX A5000 GPUs (each with 24 GB of memory). ", "page_idx": 15}, {"type": "text", "text": "Batch size We adopt the approach of GPVar [3] by using $B=20$ time series in a sample slice and a batch size of 16. Because our data sampler selects one slice of time series as a batch instead of sampling 16 slices simultaneously, we set accumulate_grad_batches to 16 to achieve an effective batch size of 16. ", "page_idx": 15}, {"type": "text", "text": "Training loop Each epoch involves training the model on up to 400 batches from the training set, followed by computing the NLL on the validation set. Training stops when any of the following conditions are met: ", "page_idx": 15}, {"type": "text", "text": "• A total of 10,000 gradient updates have been performed during model training, • No improvement in the best NLL value on the validation set is observed for 10 consecutive epochs. ", "page_idx": 15}, {"type": "text", "text": "We select the version of the model that achieved the best NLL value on the validation set. ", "page_idx": 15}, {"type": "text", "text": "A.4 Naive Baseline Description ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "In this paper, we employ VAR [38] (Vector Autoregression) and GARCH [39] (Generalized Autoregressive Conditionally Heteroskedasticity) as two naive baseline models. The $\\operatorname{VAR}(p)$ model is defined as ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\mathbf{z}_{t}=\\mathbf{c}+A_{1}\\mathbf{z}_{t-1}+\\cdot\\cdot\\cdot+A_{p}\\mathbf{z}_{t-p}+\\epsilon_{t},\\epsilon_{t}\\sim\\mathcal{N}(\\mathbf{0},\\Sigma_{\\epsilon}),}\\end{array}\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "where $A_{i}$ is an $N\\times N$ coefficient matrix, and $\\mathbf{c}$ is the intercept. We use a VAR model of lag 1 (i.e., a VAR(1) model) in the experiments. The parameters of Eq. (19) are estimated using ordinary least squares (OLS), following the procedure in [38]. ", "page_idx": 15}, {"type": "text", "text": "The GARCH model describes the conditional covariance matrix of the error term in a multivariate system. Suppose the model for the conditional mean is an AR(1) model: ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\begin{array}{r}{{\\bf z}_{t}={\\bf c}+A_{1}{\\bf z}_{t-1}+\\boldsymbol{\\epsilon}_{t},}\\end{array}\n$$", "text_format": "latex", "page_idx": 15}, {"type": "equation", "text": "$$\n\\boldsymbol{\\epsilon}_{t}=\\boldsymbol{H}_{t}^{1/2}\\mathbf{e}_{t},\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "where $\\textstyle H_{t}$ is an $N\\times N$ conditional covariance matrix, and $\\mathbf{e}_{t}$ is an $N\\times1$ standard normal vector, $\\mathbf{e}_{t}\\sim$ $\\mathcal{N}(\\mathbf{0},\\mathbf{I}_{N})$ . In the experiments, we use the DCC-GARCH $(1,1)$ model [40], where the conditional covariance matrix $\\textstyle H_{t}$ is defined as ", "page_idx": 16}, {"type": "equation", "text": "$$\nH_{t}=D_{t}R_{t}D_{t},\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "where $D_{t}=\\mathrm{diag}\\left(\\mathbf{h}_{t}\\right)^{1/2}$ , and $\\mathbf{h}_{t}$ contains the variances for each time series. $\\textstyle R_{t}$ is the conditional correlation matrix in the DCC-GARCH model. The parameters of the DCC-GARCH model are estimated with the log-likelihood function: ", "page_idx": 16}, {"type": "equation", "text": "$$\n\\mathcal{L}=-\\frac{1}{2}\\sum_{t=1}^{T}\\left[N\\ln\\left(2\\pi\\right)+2\\ln\\!\\left|D_{t}\\right|+\\ln\\!\\left|R_{t}\\right|+\\mathbf{e}_{t}^{\\top}R_{t}^{-1}\\mathbf{e}_{t}\\right].\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "In this paper, we implement the VAR model using statsmodels [41] and the DCC-GARCH model using mgarch [42]. ", "page_idx": 16}, {"type": "text", "text": "A.5 Hyperparameter Search ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "The hyperparameters and training configuration largely align with those used in the GPVar paper [3]. All DL models are trained using the Adam optimizer with l2 regularization set to 1e-8, and gradients are clipped at 10.0. For all methods, we limit the total number of gradient updates to 10,000 and decay the learning rate by a factor of 2 after 500 consecutive updates without improvement. Table 3 lists the parameters that are tuned, as well as the hyperparameters that are kept constant across all datasets and not subject to tuning. ", "page_idx": 16}, {"type": "table", "img_path": "cAFvxVFaii/tmp/08461e841020b60b68ae5af0cbee97a02c078d3b52da355952d1103272cf2629.jpg", "table_caption": ["Table 3: Hyperparameters values that are fixed or searched over a range during hyperparameter tuning. "], "table_footnote": [], "page_idx": 16}, {"type": "text", "text": "To tune the hyperparameters of each model, we conduct a grid search over nine parameters on each dataset. The best hyperparameters for each base model–dataset combination are selected based on the lowest validation loss. Once the optimal learning rate and hidden size are determined, we apply the same hyperparameters to models both with and without our method. ", "page_idx": 16}, {"type": "text", "text": "The number of base kernels $(M)$ for generating $\\textstyle C_{t}$ and the associated lengthscale set $\\{l_{m}\\}_{m=1}^{M-1}$ are two additional hyperparameters when applying our method. The optimal values of $M$ and $\\{l_{m}\\}_{m=1}^{M-1}$ are selected in a similar manner via hyperparameter search. The values of $M$ and $\\{l_{m}\\}_{m=1}^{M-1}$ explored during hyperparameter tuning are shown in Table 4. There are six possible combinations. For example, if we set $M=3$ and choose the initial lengthscale to be 1.0, the lengthscales for generating the component kernels will be $\\{1.0,2.0\\}$ since the last weight corresponds to the identity matrix. ", "page_idx": 16}, {"type": "text", "text": "A.6 Base Model Description and Input Features ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "The input to the base models consists of lagged time series values and generic features that encode time and identify each time series. The number of lagged values used is determined by the timefrequency of each dataset. Specifically, we use lags [1, 24, 168] for hourly data; [1, 7, 14] for daily data; and [1, 2, 4, 12, 24, 48] for data with a granularity of less than one hour. For all other datasets, we only use the lag-1 values. ", "page_idx": 16}, {"type": "text", "text": "Table 4: Hyperparameters values of our method that are searched over a range during hyperparameter tuning. ", "page_idx": 17}, {"type": "table", "img_path": "cAFvxVFaii/tmp/32adf5c584e3dc5e97b359e95baa9ffd14c2e1168013a46521c149518852b59b.jpg", "table_caption": [], "table_footnote": [], "page_idx": 17}, {"type": "text", "text": "We use generic features to represent time. For datasets with a granularity of one hour or less, we include features for the hour of the day and the day of the week. For daily datasets, we use the day of the week feature. Additionally, each time series is distinguished by an identifier number. All features are encoded with a single value; for example, the hour of the day feature takes values in [0, 23]. These feature values are concatenated with the RNN or Transformer input at each time step to generate the model input vector $\\mathbf{y}_{t}$ . ", "page_idx": 17}, {"type": "text", "text": "As illustrated in $\\S4$ , our method requires a state vector $\\mathbf{h}_{t}$ at each time step to generate the parameters for the predictive distribution and the dynamic weights for correlation matrix kernels. We use two different neural architectures for this purpose: RNN and Transformer, both of which preserve autoregressive properties. Specifically, we use an LSTM as our base model for the RNN and a decoder-only Transformer (i.e., the GPT model [25]) for the Transformer. Table 5 and Table 6 summarize the number of parameters for the GPVar and Transformer models across each dataset. ", "page_idx": 17}, {"type": "table", "img_path": "cAFvxVFaii/tmp/492e3e3a409afd21f9145aaee0fb53645e840bf315ffd54ecfc1d410d8e55043.jpg", "table_caption": ["Table 5: Number of parameters of the GPVar model for each dataset. "], "table_footnote": [], "page_idx": 17}, {"type": "table", "img_path": "cAFvxVFaii/tmp/7695ecb3907769e7a3c6da1eb82ae485d4228275f9233a00c7231d6b2b2bb74c.jpg", "table_caption": ["Table 6: Number of parameters of the Transformer model for each dataset. "], "table_footnote": [], "page_idx": 17}, {"type": "text", "text": "LSTM, a type of RNN architecture, is designed to model sequences and time series data. Unlike traditional RNNs, LSTMs can learn long-term dependencies, making them effective for tasks requiring context and memory over long sequences. A decoder-only Transformer is primarily used for sequence generation tasks, such as text generation, language modeling, and machine translation. It is a simplified version of the original Transformer model introduced by Vaswani et al. [43], consisting of only the decoder component. The LSTM model can be formulated as ", "page_idx": 17}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathbf{f}_{t}=\\sigma(\\mathbf{W}_{f}\\cdot[\\mathbf{h}_{t-1},\\mathbf{y}_{t}]+\\mathbf{b}_{f}),}\\\\ &{\\mathbf{i}_{t}=\\sigma(\\mathbf{W}_{i}\\cdot[\\mathbf{h}_{t-1},\\mathbf{y}_{t}]+\\mathbf{b}_{i}),}\\\\ &{\\tilde{\\mathbf{C}}_{t}=\\operatorname{tanh}(\\mathbf{W}_{C}\\cdot[\\mathbf{h}_{t-1},\\mathbf{y}_{t}]+\\mathbf{b}_{C}),}\\\\ &{\\mathbf{C}_{t}=\\mathbf{f}_{t}\\odot\\mathbf{C}_{t-1}+\\mathbf{i}_{t}\\odot\\tilde{\\mathbf{C}}_{t},}\\\\ &{\\mathbf{o}_{t}=\\sigma(\\mathbf{W}_{o}\\cdot[\\mathbf{h}_{t-1},\\mathbf{y}_{t}]+\\mathbf{b}_{o}),}\\\\ &{\\mathbf{h}_{t}=\\mathbf{o}_{t}\\odot\\operatorname{tanh}(\\mathbf{C}_{t}),}\\end{array}\n$$", "text_format": "latex", "page_idx": 18}, {"type": "text", "text": "where $\\mathbf{y}_{t}$ is the input at each time step. The decoder-only Transformer can be formulated as ", "page_idx": 18}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathbf{Q}=\\mathbf{Y}_{t}\\mathbf{W}_{Q},}\\\\ &{\\mathbf{K}=\\mathbf{Y}_{t}\\mathbf{W}_{K},}\\\\ &{\\mathbf{V}=\\mathbf{Y}_{t}\\mathbf{W}_{V},}\\\\ &{\\mathbf{M}=\\mathrm{Mask}(\\mathbf{K}),}\\\\ &{\\mathbf{Z}=\\mathrm{Softmax}\\left(\\frac{\\mathbf{Q}\\mathbf{K}^{T}}{\\sqrt{d_{k}}}+\\mathbf{M}\\right)\\mathbf{V},}\\\\ &{\\mathbf{H}_{t}=\\mathrm{LayerNorm}(\\mathbf{Y}_{t}+\\mathbf{Z}),}\\\\ &{\\mathbf{F}\\mathbf{N}=\\mathrm{ReLU}(\\mathbf{H}_{t}\\mathbf{W}_{1}+\\mathbf{b}_{1})\\mathbf{W}_{2}+\\mathbf{b}_{2},}\\\\ &{\\mathbf{H}_{t}=\\mathrm{LayerNorm}(\\mathbf{H}_{t}+\\mathbf{F}\\mathbf{F}\\mathbf{N}),}\\end{array}\n$$", "text_format": "latex", "page_idx": 18}, {"type": "text", "text": "where $\\mathbf{H}_{t}$ is the output containing state vectors for all time steps, and $\\mathbf{M}$ is a square causal mask for the sequence to preserve autoregressive properties. ", "page_idx": 18}, {"type": "text", "text": "B Metrics and Additional Results ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "B.1 Metric Definition ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "In this paper, we repeated the evaluation process on the testing set ten times to compute the mean and standard deviation of all metrics. Metrics calculated in each independent evaluation are based on the average results from all forecast instances in the testing set. For example, the $\\mathrm{CRPS}_{\\mathrm{sum}}$ reported for traffic is the average $\\mathrm{CRPS}_{\\mathrm{sum}}$ of seven forecast instances in its testing set. 100 prediction samples were drawn for all evaluation processes. ", "page_idx": 18}, {"type": "text", "text": "B.1.1 Continuous Ranked Probability Score ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "The Continuous Ranked Probability Score (CRPS) is defined as: ", "page_idx": 18}, {"type": "equation", "text": "$$\n\\mathrm{CRPS}\\left(F,z\\right)=\\mathbb{E}_{F}|Z-z|-\\frac{1}{2}\\,\\mathbb{E}_{F}|Z-Z^{\\prime}|,\n$$", "text_format": "latex", "page_idx": 18}, {"type": "text", "text": "where $F$ is the cumulative distribution function (CDF) of the predicted variable, $z$ is the observation, $Z$ and $Z^{\\prime}$ are independent copies of a set of prediction samples associated with the distribution $F$ . For a single forecast instance, we calculate the average CRPS across time series and over the prediction horizon: ", "page_idx": 18}, {"type": "equation", "text": "$$\n\\mathbb{E}_{i,t}\\left[\\mathrm{CRPS}\\left(F_{i,t},z_{i,t}\\right)\\right],\n$$", "text_format": "latex", "page_idx": 18}, {"type": "text", "text": "where we use the empirical CDF to represent $F_{i,t}$ when predicting $z_{i,t}$ . Since CRPS only compares a single ground-truth value to its predicted distribution, we also calculate the $\\mathrm{CRPS}_{\\mathrm{sum}}$ [3, 16, 17] to assess multivariate dependencies in the time series data. $\\mathrm{CRPS}_{\\mathrm{sum}}$ is computed by summing both the forecasted and ground-truth values across all time series and then calculating the CRPS over the resulting sums: ", "page_idx": 18}, {"type": "equation", "text": "$$\n\\mathbb{E}_{t}\\left[\\mathrm{CRPS}\\left(F_{t},\\sum_{i}z_{i,t}\\right)\\right],\n$$", "text_format": "latex", "page_idx": 18}, {"type": "text", "text": "where the empirical $F_{t}$ is obtained by summing samples across time series. ", "page_idx": 18}, {"type": "text", "text": "B.1.2 Quantile Loss ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "The Quantile Loss ( $\\boldsymbol{\\rho}$ -risk) is another metric used in [10] to evaluate the performance of probabilistic forecasting: ", "page_idx": 19}, {"type": "equation", "text": "$$\nL_{\\rho}\\left(z,\\hat{z}^{\\rho}\\right)=2\\left(\\hat{z}^{\\rho}-z\\right)\\left(\\left(1-\\rho\\right)\\mathrm{I}_{\\hat{z}^{\\rho}>z}-\\rho\\mathrm{I}_{\\hat{z}^{\\rho}\\leq z}\\right),\n$$", "text_format": "latex", "page_idx": 19}, {"type": "text", "text": "where I is a binary indicator function that equals 1 when the condition is met, $\\hat{z}^{\\rho}$ represents the predicted $\\rho$ -quantile, and $z$ represents the ground truth value. The quantile loss serves as a metric to assess the accuracy of a given quantile $\\rho$ from the predictive distribution. We summarize the quantile losses over the testing set across all time series segments by computing a normalized summation of these losses: $\\begin{array}{r}{\\left(\\sum_{i,t}L_{\\rho}\\left(z_{i,t},\\hat{z}_{i,t}^{\\rho}\\right)\\right)/\\left(\\sum_{i,t}z_{i,t}\\right)^{\\cdot}}\\end{array}$ . In this paper, we evaluate the 0.5-risk and the 0.9-risk following Salinas et al. [10]. ", "page_idx": 19}, {"type": "text", "text": "B.1.3 Energy Score ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "The Energy Score $\\mathrm{(ES)}$ generalizes the CRPS to evaluate distributional forecasts of a vector-valued random variable and is thus another multivariate metric used in this paper: ", "page_idx": 19}, {"type": "equation", "text": "$$\n\\mathrm{ES}(P,\\mathbf{z})=\\underset{z\\sim P}{\\mathbb{E}}\\|Z-\\mathbf{z}\\|_{2}^{\\beta}-\\frac{1}{2}\\underset{Z^{\\prime}\\sim P}{\\mathbb{E}}\\|Z-Z^{\\prime}\\|_{2}^{\\beta},\n$$", "text_format": "latex", "page_idx": 19}, {"type": "text", "text": "where $\\lVert\\mathbf{z}\\rVert_{2}$ is the Euclidean norm. In this paper, we use $\\beta=1$ , following [17]. Since we also want to aggregate over the prediction horizon, we calculate the Frobenius norm of the matrix $\\|\\mathbf{z}_{t+1:t+Q}\\|_{F}$ in practice. ", "page_idx": 19}, {"type": "text", "text": "B.1.4 Root Relative Mean Squared Error ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "The Root Relative Mean Squared Error (RRMSE) is a metric commonly used for point forecasts [44, 32, 45]. RRMSE is defined as: ", "page_idx": 19}, {"type": "equation", "text": "$$\n\\mathrm{RRMSE}=\\frac{\\sqrt{\\sum_{t=1}^{Q}\\lVert\\mathbf{z}_{t}-\\hat{\\mathbf{z}}_{t}\\rVert_{2}^{2}}}{\\sqrt{\\sum_{t=1}^{Q}\\lVert\\mathbf{z}_{t}-\\bar{\\mathbf{z}}\\rVert_{2}^{2}}},\n$$", "text_format": "latex", "page_idx": 19}, {"type": "text", "text": "where $\\hat{\\mathbf{z}}_{t}$ is obtained by taking the mean of our prediction samples, and $\\bar{\\bf z}$ is the mean value of the entire forecast instance. We use this metric to evaluate the mean prediction performance of our model. ", "page_idx": 19}, {"type": "text", "text": "B.2 Results on Other Forecasting Metrics ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "We present the results for CRPS (Table 7), the 0.5-risk (Table 8), the 0.9-risk (Table 9), ES (Table 10), and RRMSE (Table 11). An “N/A” entry in the tables indicates that the naive baseline models could not be properly fitted to this dataset. We observe consistent performance improvements in the base models using our method across different evaluation metrics. Notably, in the multivariate metric ES, our method shows significant improvement, reducing the score by an average of $5.58\\%$ for GPVar and $3.21\\%$ for the Transformer. ", "page_idx": 19}, {"type": "text", "text": "B.3 Training Dynamics ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "In Fig. 5 and Fig. 6, we compare the training dynamics of the base models trained with and without our method. Note that the likelihood losses of the two methods are not directly comparable, even for the same dataset and base model, due to differences in the likelihood structures. We observe that while our method introduces more complexity into the likelihood function, there is no evidence that it significantly prolongs model convergence. On the contrary, our method can speed up convergence for some datasets in terms of the training steps used. We also report the training time in Table 12. ", "page_idx": 19}, {"type": "text", "text": "B.4 Effect of the Number of Time Series during Prediction ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "The number of time series does not impact training, as the model is trained using a random subset of $B$ time series at a time, independent of the total number of time series $N$ . However, during prediction, the batch size can be increased beyond the training batch size of $B=20$ for multistep-ahead rolling ", "page_idx": 19}, {"type": "table", "img_path": "cAFvxVFaii/tmp/4574fccf2ceff5035ae6f0c3de7fb53cc3a499e810fabd767e41a226292d4527.jpg", "table_caption": ["Table 7: Comparison of CRPS accuracy. “w/o” denotes methods without time-dependent errors, while “w/” indicates our method. Boldface values indicate that models considering time-dependent errors have better performance. Mean and standard deviation are obtained from 10 runs of each model. "], "table_footnote": [], "page_idx": 20}, {"type": "table", "img_path": "cAFvxVFaii/tmp/d8e3394ea72b303c251fa4207478ec52e7d7473349e7e27de098e7dfa5bcee3b.jpg", "table_caption": ["Table 8: Comparison of 0.5-risk accuracy. “w/o” denotes methods without time-dependent errors, while “w/” indicates our method. Boldface values indicate that models considering time-dependent errors have better performance. Mean and standard deviation are obtained from 10 runs of each model. "], "table_footnote": [], "page_idx": 20}, {"type": "table", "img_path": "cAFvxVFaii/tmp/7e69ae004c48237933feb2049bf5246c46405f00249fbfff151bd8de08d94cb1.jpg", "table_caption": ["Table 9: Comparison of 0.9-risk accuracy. “w/o” denotes methods without time-dependent errors, while “w/” indicates our method. Boldface values indicate that models considering time-dependent errors have better performance. Mean and standard deviation are obtained from 10 runs of each model. "], "table_footnote": [], "page_idx": 20}, {"type": "table", "img_path": "cAFvxVFaii/tmp/5a8209a70fba68a6fa01224f25391f2f668488ea5f79dded9f75e1332db105c3.jpg", "table_caption": ["Table 10: Comparison of ES accuracy. “w/o” denotes methods without time-dependent errors, while “w/” indicates our method. Boldface values indicate that models considering time-dependent errors have better performance. Mean and standard deviation are obtained from 10 runs of each model. "], "table_footnote": [], "page_idx": 21}, {"type": "table", "img_path": "cAFvxVFaii/tmp/eaeaa68f793238c98a9f75a77b4e844d73d1f966d26893b6ae73f338f4a2e40a.jpg", "table_caption": ["Table 11: Comparison of RRMSE accuracy. “w/o” denotes methods without time-dependent errors, while “w/” indicates our method. Boldface values indicate that models considering time-dependent errors have better performance. Mean and standard deviation are obtained from 10 runs of each model. "], "table_footnote": [], "page_idx": 21}, {"type": "table", "img_path": "cAFvxVFaii/tmp/5de38aa0ac64ceff31c719fab499f19b640d7aa4e29d17ff3619c3b12c7576e9.jpg", "table_caption": ["Table 12: Training cost comparison. “w/o” denotes methods without time-dependent errors, while “w/” indicates our method. "], "table_footnote": [], "page_idx": 21}, {"type": "image", "img_path": "cAFvxVFaii/tmp/d7ce7bf2fdaf236b8eb38b851478af0571a47703b4ab7d4206489b2b6f44daa8.jpg", "img_caption": [], "img_footnote": [], "page_idx": 22}, {"type": "text", "text": "Figure 5: Training loss/validation loss vs training time of the GPVar model. “w/o” denotes methods without time-dependent errors, while “w/” indicates our method. ", "page_idx": 22}, {"type": "image", "img_path": "cAFvxVFaii/tmp/7927dbf3b78a158b5efe9d408d1a8f4622534448f1a23d70b57e6615f141b298.jpg", "img_caption": [], "img_footnote": [], "page_idx": 22}, {"type": "text", "text": "Figure 6: Training loss/validation loss vs training time of the Transformer model. “w/o” denotes methods without time-dependent errors, while “w/” indicates our method. ", "page_idx": 22}, {"type": "text", "text": "predictions. This allows more information to be utilized, potentially improving both predictions and error calibration, provided that memory capacity permits. We conducted an additional experiment to demonstrate the effect of increasing the batch size during inference (Fig. 7). ", "page_idx": 23}, {"type": "image", "img_path": "cAFvxVFaii/tmp/17c90360b8dd90c32c9bd674a6037e29149231a4ac64654c51aefad62c701588.jpg", "img_caption": ["Figure 7: The influence of the number of time series in a batch on the performance of inference. \"w/o\" denotes methods without time-dependent errors, while \"w/\" indicates our method. We only show some datasets here because the remaining datasets have fewer than $B=20$ time series in the testing set. "], "img_footnote": [], "page_idx": 23}, {"type": "text", "text": "B.5 Additional Model Interpretation ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "In this section, we provide further insights into how our method improves the base model. We illustrate these improvements by comparing the cross-correlations of the residuals from models with and without our method. Additionally, we demonstrate the performance of our method over the prediction horizon in multistep-ahead forecasting. ", "page_idx": 23}, {"type": "text", "text": "B.5.1 Comparison of Residual Correlation ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Recall that our method models both the autocovariance of errors $\\mathrm{Cov}(\\eta_{i,t-\\Delta},\\eta_{i,t})$ and the cross-lag covariance $\\mathrm{Cov}(\\eta_{i,t-\\Delta},\\eta_{j,t})$ between all pairs of components in the multivariate series. With the calibration process introduced in $\\S4.2$ , our method is expected to reduce error cross-correlations, including autocorrelation and cross-lag correlation. Here, we compare the empirical ACF of the residuals $\\eta_{i,t}$ of a single time series $i$ , as well as the empirical cross-correlations of $\\pmb{\\eta}_{t}$ across multiple time series. ", "page_idx": 23}, {"type": "text", "text": "We begin by comparing the ACF of the one-step-ahead prediction residuals with and without our method. The comparisons are provided for the following datasets: solar (Fig. 8), electricity (Fig. 9), traffic (Fig. 10), wiki (Fig. 11), m4_hourly (Fig. 12), pems03 (Fig. 13), and uber_hourly (Fig. 14). We observe that the autocorrelation of the residuals is reduced after applying our method. ", "page_idx": 23}, {"type": "text", "text": "Next, we compare the cross-correlations of the one-step-ahead prediction residuals with and without our method. The comparisons are provided for the following datasets: electricity (Fig. 15), traffic (Fig. 16), wiki (Fig. 17), m4_hourly (Fig. 18), pems03 (Fig. 19), and uber_hourly (Fig. 20). We also observe that the cross-correlations of the residuals are reduced after applying our method. ", "page_idx": 23}, {"type": "text", "text": "B.5.2 Performance Breakdown at Each Forecast Step ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "To investigate our performance gain at each forecast step, we calculate the $\\mathrm{CRPS}_{\\mathrm{sum}}$ for each forecast step. The results are shown in Fig. 21 for GPVar and Fig. 22 for the Transformer. Note that the $\\mathrm{CRPS}_{\\mathrm{sum}}$ reported in this section may have different scales compared to previous sections because they are not normalized. In multistep-ahead forecasting, since the predicted values are used as inputs for subsequent predictions within the prediction range, the residuals accumulate the effects of inaccuracies from previous steps. Therefore, the performance improvement depends not only on our modeling of error correlations but also on the properties of the residuals. These properties can be influenced by the absolute and relative time of the forecast and the seasonality of the data. For data without strong seasonality, residuals tend to be larger when predicting further ahead, making error accumulation more apparent. Conversely, for data with strong seasonality, the impact of error accumulation can vary. We observe that, in most scenarios, $\\mathrm{CRPS}_{\\mathrm{sum}}$ is reduced at the early forecasting stages. As predictions extend further into the future, some datasets (e.g., traffic in Fig. 21) show decreased improvement, likely due to seasonality effects. Conversely, other datasets (e.g., wiki in Fig. 21) exhibit larger improvements further into the future, possibly because the residuals accumulate over the steps. ", "page_idx": 23}, {"type": "image", "img_path": "cAFvxVFaii/tmp/c9c78719fbb28e3b7bc30c06e29e342df6cb3f2dfc604932ac6580b788b343e8.jpg", "img_caption": ["Figure 8: ACF comparison of the one-step-ahead prediction residuals with and without our method. The results depict the prediction outcomes generated by GPVar for four time series in the solar dataset. "], "img_footnote": [], "page_idx": 24}, {"type": "image", "img_path": "cAFvxVFaii/tmp/d3a261b56d7cf04b7b85e52f8f65ffaec6f95d9a4c63aae95c6ab4279450d036.jpg", "img_caption": ["Figure 9: ACF comparison of the one-step-ahead prediction residuals with and without our method. The results depict the prediction outcomes generated by GPVar for four time series in the electricity dataset. "], "img_footnote": [], "page_idx": 24}, {"type": "image", "img_path": "cAFvxVFaii/tmp/b4e3ff2b6b75d94bcf4f1e693a0950268bdf54cff617aa3a35aa7a0a48e58d17.jpg", "img_caption": ["Figure 10: ACF comparison of the one-step-ahead prediction residuals with and without our method. The results depict the prediction outcomes generated by GPVar for four time series in the traffic dataset. "], "img_footnote": [], "page_idx": 24}, {"type": "image", "img_path": "cAFvxVFaii/tmp/c0d855b3110c6e623861673277633e6b8593b9d584c9b8f92a38ae9d0034e674.jpg", "img_caption": ["Figure 11: ACF comparison of the one-step-ahead prediction residuals with and without our method. The results depict the prediction outcomes generated by GPVar for four time series in the wiki dataset. ", ""], "img_footnote": [], "page_idx": 25}, {"type": "image", "img_path": "cAFvxVFaii/tmp/56df4d0bbbc4dc42e6af2ae6ca61ccb25f64c93331b94c6041c7190b83c4b753.jpg", "img_caption": ["Figure 12: ACF comparison of the one-step-ahead prediction residuals with and without our method. The results depict the prediction outcomes generated by GPVar for four time series in the m4_hourly dataset. "], "img_footnote": [], "page_idx": 25}, {"type": "image", "img_path": "cAFvxVFaii/tmp/fdf3c454e4e0920d967aa46346546a9b585b9206fe23bf708fc52dfb38374bdf.jpg", "img_caption": ["Figure 13: ACF comparison of the one-step-ahead prediction residuals with and without our method. The results depict the prediction outcomes generated by GPVar for four time series in the pems03 dataset. "], "img_footnote": [], "page_idx": 25}, {"type": "image", "img_path": "cAFvxVFaii/tmp/bfecb4c8b6f5ad2dce08a5eb51eef50a45f4d64752d38ba603323db77c391b52.jpg", "img_caption": ["Figure 14: ACF comparison of the one-step-ahead prediction residuals with and without our method. The results depict the prediction outcomes generated by GPVar for four time series in the uber_hourly dataset. "], "img_footnote": [], "page_idx": 26}, {"type": "image", "img_path": "cAFvxVFaii/tmp/2e9f055bb32a903a2a73c14ed5128a1156844a0fe7c4efd90c28800369131beb.jpg", "img_caption": ["Figure 15: Cross-correlation comparison of the one-step-ahead prediction residuals with and without our method. The results depict the prediction outcomes generated by GPVar for four time series in the electricity dataset. "], "img_footnote": [], "page_idx": 26}, {"type": "image", "img_path": "cAFvxVFaii/tmp/ae8f235b6a584be4f926001048af98769edfb133f0bf1b91c71bd20ce6d0599c.jpg", "img_caption": ["Figure 16: Cross-correlation comparison of the one-step-ahead prediction residuals with and without our method. The results depict the prediction outcomes generated by GPVar for four time series in the traffic dataset. "], "img_footnote": [], "page_idx": 26}, {"type": "image", "img_path": "cAFvxVFaii/tmp/f311820386bcc26b001180c5f7f07a9a6a7da77006db5cd7f1ec4253c3e5e98c.jpg", "img_caption": ["Figure 17: Cross-correlation comparison of the one-step-ahead prediction residuals with and without our method. The results depict the prediction outcomes generated by GPVar for four time series in the wiki dataset. "], "img_footnote": [], "page_idx": 27}, {"type": "image", "img_path": "cAFvxVFaii/tmp/978c37a9e7ae5a3d4037d76576d2d04ce4908accf971d71d21e3aa9bb85abcf3.jpg", "img_caption": ["Figure 18: Cross-correlation comparison of the one-step-ahead prediction residuals with and without our method. The results depict the prediction outcomes generated by GPVar for four time series in the m4_hourly dataset. "], "img_footnote": [], "page_idx": 27}, {"type": "image", "img_path": "cAFvxVFaii/tmp/854988fc67d13433f781c9d51b1703c39ab6af1430080ed86085e4df781d4cba.jpg", "img_caption": ["Figure 19: Cross-correlation comparison of the one-step-ahead prediction residuals with and without our method. The results depict the prediction outcomes generated by GPVar for four time series in the pems03 dataset. "], "img_footnote": [], "page_idx": 27}, {"type": "image", "img_path": "cAFvxVFaii/tmp/d1a792bc0819f3c97220774f29468dd96c2b500ca527920630ce01b8c936d451.jpg", "img_caption": ["Figure 20: Cross-correlation comparison of the one-step-ahead prediction residuals with and without our method. The results depict the prediction outcomes generated by GPVar for four time series in the uber_hourly dataset. "], "img_footnote": [], "page_idx": 28}, {"type": "text", "text": "", "page_idx": 28}, {"type": "image", "img_path": "cAFvxVFaii/tmp/87360dbbac8a1dfcf714d846730de795d4e4ea8da00566b13d18dfb54a867186.jpg", "img_caption": ["Figure 21: Step-wise $\\mathrm{CRPS}_{\\mathrm{sum}}$ accuracy of GPVar. “w/o” denotes methods without time-dependent errors, while “w/” indicates our method. "], "img_footnote": [], "page_idx": 28}, {"type": "text", "text": "B.6 Alternative Parametrization of $\\textstyle C_{t}$ ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "B.6.1 Learnable Lengthscales ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "In this paper, the lengthscales are fixed when generating the correlation matrix $\\textstyle C_{t}$ , and the flexibility of $C_{t}$ comes from dynamically generating the component weights of the kernel matrices. Making these lengthscales learnable parameters to find the optimal set of $\\{l_{m}\\}_{m=1}^{M-1}$ is another approach we can explore to increase modeling flexibility. Based on the best model identified in Table 1, we experiment with treating the lengthscales as learnable parameters, jointly optimized with the base model. The results are shown in Table 13. We do not observe significant improvement from learnable lengthscales. ", "page_idx": 28}, {"type": "image", "img_path": "cAFvxVFaii/tmp/df08dd1c61464d83d0967f7c1824acb139a775e56430fd9ec6a0af50056a55dd.jpg", "img_caption": ["Figure 22: Step-wise $\\mathrm{CRPS}_{\\mathrm{sum}}$ accuracy of Transformer. “w/o” denotes methods without timedependent errors, while “w/” indicates our method. "], "img_footnote": [], "page_idx": 29}, {"type": "text", "text": "", "page_idx": 29}, {"type": "table", "img_path": "cAFvxVFaii/tmp/18502a0cef7f5332462ade1308df587b59b5ad689830291e30bc8aa913bc172c.jpg", "table_caption": ["Table 13: Comparison of $\\mathrm{CRPS}_{\\mathrm{sum}}$ accuracy. “w/o” denotes methods without time-dependent errors, while “w/” indicates our method. “w/ $(l)^{\\bullet}$ indicates the lengthscales are learnable parameters. Boldface values indicate that models considering time-dependent errors have better performance. Mean and standard deviation are obtained from 10 runs of each model. "], "table_footnote": [], "page_idx": 29}, {"type": "text", "text": "B.6.2 Using Autocorrelations of an $\\mathbf{A}\\mathbf{R}(p)$ process ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "One could parameterize $\\textstyle C_{t}$ as fully learnable, positive definite symmetric Toeplitz matrices. For instance, an $\\operatorname{AR}(p)$ process has an autocorrelation matrix with a Toeplitz structure, allowing the modeling of negative correlations. This alternative approach may offer more flexibility in capturing complex correlation patterns in multivariate time series data. The autocorrelations of an $\\mathrm{AR}(\\bar{p)}$ process can be obtained by solving a set of equations known as the Yule-Walker equations [46]. For example, if we consider an $\\operatorname{AR}(2)$ process and let $\\rho_{k}$ be the autocorrelation at $\\log k$ : ", "page_idx": 29}, {"type": "equation", "text": "$$\nz_{t}=\\phi_{1}z_{t-1}+\\phi_{2}z_{t-2}+\\epsilon_{t}.\n$$", "text_format": "latex", "page_idx": 29}, {"type": "text", "text": "where $\\phi_{1}$ and $\\phi_{2}$ are the coefficients. We have $\\rho_{0}=1$ by definition and: ", "page_idx": 29}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\rho_{1}=\\phi_{1}\\rho_{0}+\\phi_{2}\\rho_{1},}\\\\ &{\\qquad\\ldots}\\\\ &{\\rho_{k}=\\phi_{1}\\rho_{k-1}+\\phi_{2}\\rho_{k-2},k\\geq2.}\\end{array}\n$$", "text_format": "latex", "page_idx": 29}, {"type": "text", "text": "Since $\\rho_{0}=1$ , we can solve for $\\rho_{1}$ : ", "page_idx": 29}, {"type": "equation", "text": "$$\n\\rho_{1}=\\frac{\\phi_{1}}{1-\\phi_{2}},\n$$", "text_format": "latex", "page_idx": 29}, {"type": "equation", "text": "$$\n\\rho_{k}=\\phi_{1}\\rho_{k-1}+\\phi_{2}\\rho_{k-2},k\\geq2.\n$$", "text_format": "latex", "page_idx": 30}, {"type": "text", "text": "The collection $\\left\\{\\rho_{0},\\rho_{1},\\dots,\\rho_{k},\\dots,\\rho_{D-1}\\right\\}$ forms the first row or column of a Toeplitz matrix and can be used to parameterize $\\textstyle C_{t}$ . We perform a hyperparameter search to find the best AR order $p$ based on the validation loss. As shown in Table 14, while the correlation matrix $\\textstyle C_{t}$ parameterized by an AR process shows promise in modeling both positive and negative correlations, it does not empirically provide an overall improvement compared to the kernel method used in this paper. This may be because cross-correlations in time series are predominantly positive. However, the AR method does show significant improvements on certain datasets where the kernel method does not perform well. For example, the AR method greatly improves GPVar on exchange_rate and the Transformer on electricity. ", "page_idx": 30}, {"type": "table", "img_path": "cAFvxVFaii/tmp/24285d6d6fd71ec449446039de456ca46f551993dec19060b93ebdfdc9e66640.jpg", "table_caption": ["Table 14: Comparison of $\\mathrm{CRPS}_{\\mathrm{sum}}$ accuracy. “w/o” denotes methods without time-dependent errors, while “w/” indicates our method. “w/ (AR)” indicates $C_{t}$ is parameterized by an AR process. Boldface values indicate that models considering time-dependent errors have better performance. Mean and standard deviation are obtained from 10 runs of each model. "], "table_footnote": [], "page_idx": 30}, {"type": "text", "text": "B.7 Alternative Error Assumptions ", "text_level": 1, "page_idx": 30}, {"type": "text", "text": "A more suitable likelihood function can regularize the training process, potentially reducing residual correlations. For example, assuming the errors follow a multivariate $t$ -distribution improves the robustness of the model to outliers. Additionally, a stronger base model can help produce residuals that are more independent. Based on these considerations, we designed our approach to adapt dynamically to varying levels of error correlation. The weighted correlation matrix assigns greater weight to the identity matrix when the errors exhibit lower correlation. ", "page_idx": 30}, {"type": "text", "text": "We also trained the baseline models using the likelihood of the multivariate $t$ -distribution, and the results are shown in Table 15. While using an alternative distribution can lead to better performance on certain datasets when our method is not applied, we observed that our method effectively closes the performance gap in cases where the multivariate Gaussian assumption is outperformed by the $t$ -distribution. ", "page_idx": 30}, {"type": "text", "text": "An important feature of our method is the ability to use a subset of time series in each training batch for model optimization, which enhances scalability. For the multivariate $t^{\\th}$ -distribution, the distribution of these subsets of $\\mathbf{z}_{t}$ should have the same degrees of freedom as the full distribution of $\\mathbf{z}_{t}$ . However, since the degrees of freedom are treated as an additional output of the model in each training batch, they are not guaranteed to be consistent across batches. While this is not problematic for deep learning, it violates the marginalization property of the $t$ -distribution from a statistical standpoint. ", "page_idx": 30}, {"type": "text", "text": "We chose Gaussian noise for its beneficial properties, including its marginalization rule and welldefined conditional distribution, both essential for statistically consistent model training and reliable inference. To address model misspecification, a more effective approach could involve first transforming the original observations into Gaussian-distributed data using a Gaussian Copula [3], and then applying our method. ", "page_idx": 30}, {"type": "text", "text": "Table 15: $\\mathrm{CRPS}_{\\mathrm{sum}}$ accuracy comparison. \"w/o\" denotes methods without time-dependent errors, while \"w/\" indicates our method. Bold values show models with time-dependent errors performing better. Mean and standard deviation are obtained from 10 runs of each model. \"N/A\" indicates that the model could not be properly fitted.. ", "page_idx": 31}, {"type": "table", "img_path": "cAFvxVFaii/tmp/8ae6a711182e8a8c270cc2aa0364d45d1db8e4fae02b5e9cdedfdcf88fd0c6a9.jpg", "table_caption": [], "table_footnote": [], "page_idx": 31}, {"type": "text", "text": "B.8 Qualitative Results on Forecasting ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "In this section, we provide qualitative analysis of the actual prediction performance by visualizing the predictions. ", "page_idx": 31}, {"type": "image", "img_path": "cAFvxVFaii/tmp/b1c0358adcd3d1173ea06388ea94299a46e667aada20c97df0e4062049c7846f.jpg", "img_caption": ["Figure 23: Visualization of forecasting results on exchange_rate using GPVar with our method. "], "img_footnote": [], "page_idx": 31}, {"type": "image", "img_path": "cAFvxVFaii/tmp/64b3bc923c2a6a149328457493d7e2be1e1f8192d6de694885d73b4b729c0e90.jpg", "img_caption": ["Figure 24: Visualization of forecasting results on solar using GPVar with our method. "], "img_footnote": [], "page_idx": 32}, {"type": "image", "img_path": "cAFvxVFaii/tmp/9432c8a1a4ced899613833c005c00c9186a5e34c015ad21a5e009e86c9232359.jpg", "img_caption": ["Figure 25: Visualization of forecasting results on electricity using GPVar with our method. "], "img_footnote": [], "page_idx": 32}, {"type": "image", "img_path": "cAFvxVFaii/tmp/480fa9605f7c2bc47afa21afc643cbc7ea6d37907b3384f97f8cea664a89acf1.jpg", "img_caption": ["Figure 26: Visualization of forecasting results on traffic using GPVar with our method. "], "img_footnote": [], "page_idx": 33}, {"type": "image", "img_path": "cAFvxVFaii/tmp/b057a758586e1ef7b6a11f54d401fb8959791df6cbac1649541581c8e93fab48.jpg", "img_caption": ["Figure 27: Visualization of forecasting results on wiki using GPVar with our method. "], "img_footnote": [], "page_idx": 33}, {"type": "image", "img_path": "cAFvxVFaii/tmp/dc0c78bbad8bff79237a1ee83c1731427195350a3e65e765661f759601bb78ec.jpg", "img_caption": ["Figure 28: Visualization of forecasting results on $\\mathtt{m4.}$ _hourly using GPVar with our method. "], "img_footnote": [], "page_idx": 34}, {"type": "image", "img_path": "cAFvxVFaii/tmp/65f2d5cd399da9d4449bdeca1ed40360eb324d620b5bb8d0f86780a76306257e.jpg", "img_caption": ["Figure 29: Visualization of forecasting results on pems03 using GPVar with our method. "], "img_footnote": [], "page_idx": 34}, {"type": "image", "img_path": "cAFvxVFaii/tmp/7d5a099ce1f1be77c1be517aad193a574274526de56819c90bf365f205c1e94f.jpg", "img_caption": ["Figure 30: Visualization of forecasting results on uber_hourly using GPVar with our method. "], "img_footnote": [], "page_idx": 35}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 36}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 36}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 36}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 36}, {"type": "text", "text": "Justification: The abstract and/or introduction have clearly stated the claims made, including the contributions made in the paper and important assumptions and limitations. ", "page_idx": 36}, {"type": "text", "text": "Guidelines: ", "page_idx": 36}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 36}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 36}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 36}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 36}, {"type": "text", "text": "Justification: We have discussed the limitations of the work in the \"Conclusion\" section. Guidelines: ", "page_idx": 36}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 36}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 36}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 36}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 36}, {"type": "text", "text": "Justification: We do not have theoretical result in this study. Guidelines: ", "page_idx": 37}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 37}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 37}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 37}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 37}, {"type": "text", "text": "Justification: We have fully disclosed all the information needed to reproduce the main experimental results of the paper in the Appendix. ", "page_idx": 37}, {"type": "text", "text": "Guidelines: ", "page_idx": 37}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 37}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 37}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 37}, {"type": "text", "text": "Answer: [No] ", "page_idx": 38}, {"type": "text", "text": "Justification: The code will be released after the paper is accepted. However, we have provided a sufficient amount of experimental details in the Appendix. ", "page_idx": 38}, {"type": "text", "text": "Guidelines: ", "page_idx": 38}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 38}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 38}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 38}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 38}, {"type": "text", "text": "Justification: The paper specified all the training and test details necessary to understand the results. ", "page_idx": 38}, {"type": "text", "text": "Guidelines: ", "page_idx": 38}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 38}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 38}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 38}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 38}, {"type": "text", "text": "Justification: We ran all of our experiments for 10 times to calculate the standard deviation. Guidelines: ", "page_idx": 38}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 38}, {"type": "text", "text": "", "page_idx": 39}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 39}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 39}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 39}, {"type": "text", "text": "Justification: The paper has indicated the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage. ", "page_idx": 39}, {"type": "text", "text": "Guidelines: ", "page_idx": 39}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 39}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 39}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 39}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 39}, {"type": "text", "text": "Justification: The research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics. ", "page_idx": 39}, {"type": "text", "text": "Guidelines: ", "page_idx": 39}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 39}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 39}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 39}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 39}, {"type": "text", "text": "Justification: We have discussed societal impacts in the last section of this paper. ", "page_idx": 39}, {"type": "text", "text": "Guidelines: ", "page_idx": 39}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed.   \n• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 39}, {"type": "text", "text": "", "page_idx": 40}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 40}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 40}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 40}, {"type": "text", "text": "Justification: The paper poses no such risks. ", "page_idx": 40}, {"type": "text", "text": "Guidelines: ", "page_idx": 40}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 40}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 40}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 40}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 40}, {"type": "text", "text": "Justification: The creators or original owners of assets (e.g., code, data, models), used in the paper, have been properly credited. The license and terms of use have been explicitly mentioned and properly respected. ", "page_idx": 40}, {"type": "text", "text": "Guidelines: ", "page_idx": 40}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 40}, {"type": "text", "text": "", "page_idx": 41}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 41}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 41}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 41}, {"type": "text", "text": "Justification: The paper does not release new assets. ", "page_idx": 41}, {"type": "text", "text": "Guidelines: ", "page_idx": 41}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 41}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 41}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 41}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 41}, {"type": "text", "text": "Justification: The paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 41}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 41}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 41}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 41}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 41}, {"type": "text", "text": "Justification: The paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 41}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 41}]