[{"figure_path": "fx6aSBMu6z/tables/tables_7_1.jpg", "caption": "Table 1: Datasets for node classification", "description": "This table presents the characteristics of five datasets used for node classification in the paper.  For each dataset, it lists the number of nodes, edges, features per node, and the number of classes.", "section": "4.1 Node Classification"}, {"figure_path": "fx6aSBMu6z/tables/tables_7_2.jpg", "caption": "Table 2: Datasets for graph classification", "description": "This table presents the characteristics of five graph datasets used for graph classification experiments in the paper. For each dataset, it lists the number of graphs, the average number of nodes per graph, the average number of edges per graph, and the number of classes.", "section": "4 Experiments"}, {"figure_path": "fx6aSBMu6z/tables/tables_7_3.jpg", "caption": "Table 3: Node classification performance based on accuracy. A.R. is the average rank.", "description": "This table presents the node classification accuracy results for various models on five real-world datasets (Cora, CiteSeer, PubMed, Computers, and CS).  The models compared include DGI, VGAE, SSL-GCN, GraphSage, GraphMAE, S2GAE, and the proposed HC-GAE.  The accuracy is presented as mean ± standard deviation.  The average rank (A.R.) across the datasets is also included to provide a summary comparison of model performance.", "section": "4.1 Node Classification"}, {"figure_path": "fx6aSBMu6z/tables/tables_8_1.jpg", "caption": "Table 4: Graph classification performance based on accuracy. A.R. is the average rank.", "description": "This table presents the results of graph classification experiments on five benchmark datasets (IMDB-B, IMDB-M, PROTEINS, COLLAB, MUTAG).  It compares the accuracy of the proposed HC-GAE model against several baselines, including a graph kernel (WLSK), supervised GNNs (DGCNN, DiffPool), and other self-supervised GAEs (Graph2Vec, InfoGCL, GraphMAE, S2GAE). The average rank (A.R.) across datasets is also provided to summarize the relative performance of each method.", "section": "4.2 Graph Classification"}]