[{"figure_path": "93qSRpucpN/tables/tables_3_1.jpg", "caption": "Table 1: Results (maximum normalized score) on continuous tasks.", "description": "This table presents the maximum normalized scores achieved by different methods on four continuous tasks: Superconductor, Ant Morphology, D'Kitty Morphology, and Rosenbrock.  The \"D(best)\" row indicates the best score obtained from the offline dataset itself.  Each method's performance is reported as the mean ± standard error across 8 independent runs.  The table allows for a comparison of various optimization methods, including gradient-based approaches (Grad, COMs, ROMA, NEMO, IOM, BDI), VAE-based methods (CbAS, Auto.CbAS), GAN-based methods (MIN), and diffusion models (DDOM, RGD).  The results demonstrate the relative performance of each method in optimizing for continuous design spaces.", "section": "4.4 Results and Analysis"}, {"figure_path": "93qSRpucpN/tables/tables_6_1.jpg", "caption": "Table 1: Results (maximum normalized score) on continuous tasks.", "description": "This table presents the maximum normalized scores achieved by different methods on four continuous optimization tasks: Superconductor, Ant Morphology, D'Kitty Morphology, and Rosenbrock.  The scores represent the performance of each method in maximizing the objective function for each task. The \"D(best)\" row indicates the best score obtained within the offline dataset used for training.", "section": "4.4 Results and Analysis"}, {"figure_path": "93qSRpucpN/tables/tables_6_2.jpg", "caption": "Table 2: Results (maximum normalized score) on discrete tasks & ranking on all tasks.", "description": "This table presents the maximum normalized scores achieved by different methods on three discrete tasks: TF Bind 8, TF Bind 10, and NAS.  It also provides the mean and median ranking of each method across all seven tasks (four continuous and three discrete) considered in the paper.  The best design found in the offline dataset, denoted as D(best), serves as a baseline for comparison.  The results highlight the superior performance of RGD in most of the tasks.", "section": "4.4 Results and Analysis"}, {"figure_path": "93qSRpucpN/tables/tables_7_1.jpg", "caption": "Table 3: Ablation studies on RGD.", "description": "This table presents the results of ablation studies performed on the Robust Guided Diffusion (RGD) method.  It shows the impact of removing key components of RGD, specifically the proxy-enhanced sampling module and the diffusion-based proxy refinement module.  The table also includes results for a direct gradient update approach, serving as a baseline.  The results, presented as maximum normalized scores, are shown for each task and each ablation variant.  The data helps understand the contribution of each module to the overall performance of RGD.", "section": "4.5 Ablation Studies"}, {"figure_path": "93qSRpucpN/tables/tables_11_1.jpg", "caption": "Table 4: Computational Overhead (in seconds).", "description": "This table presents the computational cost in seconds for each process in the RGD model across four different tasks: Superconductor, Ant, D'Kitty, and NAS. The processes include proxy training, diffusion training, proxy-enhanced sampling, diffusion-based proxy refinement, and the overall computational cost.  The table shows that the diffusion-based proxy refinement step is significantly more computationally expensive than the other steps. ", "section": "4.3 Experimental Configuration"}, {"figure_path": "93qSRpucpN/tables/tables_12_1.jpg", "caption": "Table 1: Results (maximum normalized score) on continuous tasks.", "description": "This table presents the maximum normalized scores achieved by different methods on four continuous tasks: Superconductor, Ant Morphology, D'Kitty Morphology, and Rosenbrock.  The scores represent the performance of each method in optimizing the respective black-box functions.  D(best) indicates the best score achieved within the offline dataset itself, providing a baseline comparison for the algorithms.  The table highlights the performance of RGD in comparison to other methods in the same category.", "section": "4.4 Results and Analysis"}, {"figure_path": "93qSRpucpN/tables/tables_12_2.jpg", "caption": "Table 2: Results (maximum normalized score) on discrete tasks & ranking on all tasks.", "description": "This table presents the performance of various methods on three discrete tasks (TF Bind 8, TF Bind 10, NAS) and their overall ranking across all tasks.  The scores are maximum normalized scores, and the ranking considers both mean and median ranks.  It compares the proposed RGD method with several baseline and state-of-the-art methods. D(best) indicates the performance of the best design found in the offline dataset.", "section": "4.4 Results and Analysis"}, {"figure_path": "93qSRpucpN/tables/tables_13_1.jpg", "caption": "Table 7: Comparative Results of Proxy Integration with COMs, ROMA, and ours.", "description": "This table compares the performance of three different proxy integration methods: COMs, ROMA, and the proposed method (Ours). The results are shown for two tasks: Ant Morphology and TF Bind 10. The \"No proxy\" row shows the performance of the proxy-free diffusion without any proxy integration. The \"Vanilla proxy\" row shows the performance using a standard proxy. The table demonstrates that the proposed method outperforms the other methods in both tasks.", "section": "4.5 Ablation Studies"}, {"figure_path": "93qSRpucpN/tables/tables_13_2.jpg", "caption": "Table 8: Results of Annealing Approaches.", "description": "This table presents the results of applying different annealing strategies to the strength parameter ω in the RGD method for the Ant Morphology and TF Bind 10 tasks.  The ‘RGD’ row shows the results obtained using the standard RGD method. The ‘ω=2.0’ row represents the results when the initial value of ω is set to 2.0 without annealing.  The ‘Increase’ row shows results obtained when ω is increased from 0.0 to 4.0, and ‘Decrease’ row shows results when ω is decreased from 4.0 to 0.0, in both cases using a cosine function across diffusion steps t.", "section": "4.5 Ablation Studies"}]