[{"figure_path": "iChQIJtjHB/figures/figures_7_1.jpg", "caption": "Figure 1: Comparison between the objective value p2s from solving the degree-2s S-SOS SDP and the objective value p* resulting from the best-possible lower bound c*(w) for noise drawn as ω ~ Uniform(−1,1). p* = ∫ c*(w)dν(w) ≈ 0.1187 is plotted as the line in black and the p2s values are shown as blue dots (left) with the gap between the values p* − p2s (right).", "description": "The figure shows the convergence of the S-SOS hierarchy for a simple quadratic SOS function. The left panel displays the objective values (p2s) obtained from solving the degree-2s S-SOS SDP for different degrees (s), plotted against the theoretical optimal value (p*).  The right panel shows the difference (p* - p2s) highlighting the convergence rate as the degree increases.", "section": "3 Numerical experiments"}, {"figure_path": "iChQIJtjHB/figures/figures_23_1.jpg", "caption": "Figure 2: Lower bound functions for basis function degree d = 2, 4 (left) and the optimality gap to the true lower bound c*(ω) – c2s(ω) (right)", "description": "This figure shows two plots. The left plot shows the lower bound functions c* (ω) (green), c₄(ω) (blue), and c₈(ω) (red) for the simple quadratic potential  f(x,ω) = (x − ω)² + (ωx)² as a function of ω. The right plot shows the difference between the true lower bound c* (ω) and the approximate lower bound functions c₄(ω) and c₈(ω) for the same simple quadratic potential.  The plots illustrate how the accuracy of the approximate lower bound improves as the degree of the polynomial used to approximate c* (ω) increases from 4 (2s=4) to 8 (2s=8).", "section": "3.1 Simple quadratic SOS function"}, {"figure_path": "iChQIJtjHB/figures/figures_24_1.jpg", "caption": "Figure 3: Different lower-bounding functions for degree-4 S-SOS done on the simple quadratic potential f(x, w) = (x − ω)² + (wx)². The true lower-bounding function c* (w) is plotted in black.", "description": "This figure shows different lower-bounding functions obtained using degree-4 stochastic sum-of-squares (S-SOS) for the simple quadratic potential f(x, w) = (x − ω)² + (wx)² with different noise standard deviations (σ).  Each colored line represents a different noise level (σ = 0.001, 0.01, 0.1, 1.0, 10.0), showing how the approximation to the true lower bound (black line) changes with increasing noise. The plot illustrates the effect of noise on the accuracy of the S-SOS approximation to the optimal lower bound.", "section": "3.1 Simple quadratic SOS function"}, {"figure_path": "iChQIJtjHB/figures/figures_28_1.jpg", "caption": "Figure 1: Comparison between the objective value ps from solving the degree-2s S-SOS SDP and the objective value p* resulting from the best-possible lower bound c*(w) for noise drawn as ω ~ Uniform(−1,1). p* = ∫ c*(w)dν(w) =  ≈ 0.1187 is plotted as the line in black and the ps values are shown as blue dots (left) with the gap between the values p* - ps (right).", "description": "The figure shows the convergence of the S-SOS hierarchy for a simple quadratic function. The left panel shows the objective values (ps) of the degree-2s S-SOS SDP converging towards the optimal value (p*) as the degree (s) increases.  The right panel shows the gap (p* - ps) between the objective values and the optimal value, demonstrating exponential convergence.", "section": "3 Numerical experiments"}]