[{"figure_path": "8VKxTlnejE/figures/figures_2_1.jpg", "caption": "Figure 1: Compared with (a) local CNN-based RD4AD [12] and (b) global Transformer-based UniAD [47], ours MambaAD with linear complexity is capable of integrating the advantages of both global and local modeling, and multi-scale features endow it with more refined prediction accuracy.", "description": "This figure compares three different anomaly detection models: RD4AD, UniAD, and the proposed MambaAD. RD4AD utilizes a CNN-based decoder to capture local context but struggles with long-range dependencies. UniAD employs a transformer-based decoder, enabling superior global modeling but suffering from quadratic complexity. In contrast, MambaAD leverages the Mamba architecture, which balances global and local modeling capabilities with linear complexity, leading to superior performance. This is reflected in its use of multi-scale features for refined prediction accuracy.", "section": "1 Introduction"}, {"figure_path": "8VKxTlnejE/figures/figures_3_1.jpg", "caption": "Figure 1: Compared with (a) local CNN-based RD4AD [12] and (b) global Transformer-based UniAD [47], ours MambaAD with linear complexity is capable of integrating the advantages of both global and local modeling, and multi-scale features endow it with more refined prediction accuracy.", "description": "This figure compares three different anomaly detection models: RD4AD, UniAD, and the proposed MambaAD. RD4AD is a local CNN-based model, UniAD is a global transformer-based model, and MambaAD integrates both global and local modeling capabilities.  The comparison highlights MambaAD's linear complexity, which allows it to handle multi-scale features for improved accuracy.", "section": "1 Introduction"}, {"figure_path": "8VKxTlnejE/figures/figures_4_1.jpg", "caption": "Figure 3: Hybrid Scanning directions and methods. (a) The Hilbert scanning method with 8 scanning directions is used for HS Encoder and Decoder. (b) The other four scanning methods for comparison.", "description": "This figure shows different scanning methods and directions used in the Hybrid Scanning (HS) encoder and decoder of the proposed HSS block.  Panel (a) illustrates the Hilbert scanning method, which uses 8 directions to scan the feature map, providing a comprehensive coverage of both local and global information.  Panel (b) shows four other scanning methods (Sweep, Scan, Z-Order, Zigzag) for comparison, highlighting the advantages of the Hilbert method in capturing long-range dependencies and handling various anomalous features.", "section": "3.4 Hybrid State Space Block"}, {"figure_path": "8VKxTlnejE/figures/figures_6_1.jpg", "caption": "Figure 1: Compared with (a) local CNN-based RD4AD [12] and (b) global Transformer-based UniAD [47], ours MambaAD with linear complexity is capable of integrating the advantages of both global and local modeling, and multi-scale features endow it with more refined prediction accuracy.", "description": "This figure compares three different anomaly detection models: RD4AD, UniAD, and the proposed MambaAD. RD4AD uses CNNs, focusing on local features; UniAD uses Transformers, focusing on global features.  MambaAD combines both approaches for a more comprehensive solution.  The illustration highlights that MambaAD leverages multi-scale features and benefits from linear complexity, indicating a potentially more efficient and accurate model.", "section": "1 Introduction"}]