[{"figure_path": "ADJASE9uQ2/figures/figures_1_1.jpg", "caption": "Figure 1: Existing methods suffer from blurring artifacts.", "description": "This figure visually compares the results of different image super-resolution (SR) methods on a sample image from the Urban100 dataset.  It highlights the blurring artifacts produced by existing methods (Percentile [27], DBDC+Pac [41]) compared to the sharp, detailed reconstruction of the proposed method (Ours) and the full-precision (FP) model. The ground truth high-resolution image (HR) is also shown for reference.  This demonstrates that the authors' approach significantly improves the visual quality of SR, particularly in terms of artifact reduction.", "section": "Introduction"}, {"figure_path": "ADJASE9uQ2/figures/figures_2_1.jpg", "caption": "Figure 2: The overall pipeline of our proposed 2DQuant method. The whole pipeline contains two stages, optimizing the clipping bound from coarse to fine. In stage 1, we design DOBI to efficiently obtain the coarse bound. In stage 2, DQC is performed to finetune clipping bounds and guarantee the quantized model learns the full-precision (FP) model's feature and output information.", "description": "This figure illustrates the two-stage process of the 2DQuant method for post-training quantization.  The first stage, Distribution-Oriented Bound Initialization (DOBI), uses two strategies to efficiently find a coarse clipping bound for weight and activation quantization. The second stage, Distillation Quantization Calibration (DQC), further refines these bounds by training the quantized model to mimic the behavior of its full-precision counterpart, ensuring that both intermediate features and final outputs closely match. This two-step approach aims to balance speed and accuracy in low-bit quantization.", "section": "Methodology"}, {"figure_path": "ADJASE9uQ2/figures/figures_3_1.jpg", "caption": "Figure 3: Quantization scheme for SwinIR Transformer blocks. Fake quantization and INT arithmetic are performed in all compute-intensive operators including all linear layers and batch matmul. Lower bits such as 3 or even 2 are also permitted. Dropout of attention and projection is ignored", "description": "This figure illustrates how the quantization scheme is applied to the SwinIR Transformer blocks.  The process involves applying fake quantization and integer arithmetic to computationally intensive operations such as linear layers and batch matrix multiplications. The scheme can handle lower bit depths (3 or 2 bits) and ignores dropout operations in attention and projection layers.  It shows the flow of data through the various stages of the block, highlighting which parts are processed using full-precision floating-point (FP32) and which parts are processed using integer arithmetic (INT4).", "section": "3.1 Analysis of data distribution"}, {"figure_path": "ADJASE9uQ2/figures/figures_4_1.jpg", "caption": "Figure 4: The selected representative distribution of activations (Row 1) and weights (Row 2). The range of data is marked in the figure. All weights obey symmetric distribution. The attention map and the input of FC2 are asymmetric due to softmax function and GELU function.", "description": "This figure visualizes the distributions of activations and weights in different layers of the SwinIR Transformer model.  The top row shows the distributions of activations, highlighting the differences in distribution shapes (symmetric vs. asymmetric) for different layers and their activation functions (Softmax, GELU). The bottom row shows the distributions of weights, which are generally symmetric around zero for all linear layers. The range of values for each distribution is indicated.", "section": "3.1 Analysis of data distribution"}, {"figure_path": "ADJASE9uQ2/figures/figures_5_1.jpg", "caption": "Figure 5: The bound percentile of DOBI and DQC.", "description": "This figure shows the percentile of the quantizer bounds obtained using the Distribution-Oriented Bound Initialization (DOBI) method and after further fine-tuning with Distillation Quantization Calibration (DQC).  The x-axis represents the index of quantizers, and the y-axis represents the percentile.  The blue line shows the lower bound percentile from DOBI, while the orange line shows the same after DQC. Similarly, the other lines represent the upper bound percentiles before and after DQC. The figure illustrates how DQC refines the bounds calculated by DOBI, resulting in tighter bounds.", "section": "4.2 Comparison with state-of-the-art methods"}, {"figure_path": "ADJASE9uQ2/figures/figures_7_1.jpg", "caption": "Figure 6: Visual comparison for image SR (×4) in some challenging cases.", "description": "This figure shows a visual comparison of the results obtained by different super-resolution (SR) methods on three challenging images from the Urban100 dataset at a scale factor of ×4. The methods compared include Bicubic interpolation, MinMax, Percentile, DBDC+Pac, DOBI, 2DQuant, and the full-precision (FP) SwinIR model.  The images highlight the differences in the quality of the reconstructed images and how 2DQuant compares to the state-of-the-art and other quantization methods.", "section": "4.2 Comparison with state-of-the-art methods"}]