[{"figure_path": "qamfjyhPeg/tables/tables_25_1.jpg", "caption": "Table 1: Single shift test-time adaptation. Accuracy evaluated on ImageNet-C, averaged over all 15 corruptions of severity level 5. Detailed results are in Table 2. We attribute COTTA's inferior performance to its learning rate being tuned for the continual setting; see Appendix F.2 for details.", "description": "This table presents the average test-time adaptation accuracy results on ImageNet-C dataset for different methods.  The accuracy is calculated over all 15 corruption types at severity level 5.  COTTA's lower performance is attributed to its learning rate being optimized for the continual shift setting.", "section": "4 Experiments"}, {"figure_path": "qamfjyhPeg/tables/tables_25_2.jpg", "caption": "Table 2: Summary of performance metrics of adaptation methods on the ImageNet-C dataset, evaluated for each type of corruption at severity level 5. The results are evaluated on 10 independent experiments, conducted for each method and corruption type; standard error is presented.", "description": "This table presents a detailed breakdown of the performance of different test-time adaptation methods on the ImageNet-C dataset.  It shows the accuracy achieved by each method for each of the 15 different corruption types at severity level 5. The results are averaged over 10 independent experimental runs, and standard errors are included to show variability.", "section": "F.2.2 Additional experiments: single shift"}, {"figure_path": "qamfjyhPeg/tables/tables_26_1.jpg", "caption": "Table 3: Results of adaptation on in-distribution ImageNet data.", "description": "This table presents the results of applying different test-time adaptation methods to the ImageNet validation set (in-distribution data).  It compares the top-1 and top-5 accuracy, empirical calibration error (ECE), and the change in model parameters (||w||) for each method.  Lower values for ECE and ||w|| indicate better performance and less modification to the original model.", "section": "Experiments"}, {"figure_path": "qamfjyhPeg/tables/tables_26_2.jpg", "caption": "Table 1: Single shift test-time adaptation. Accuracy evaluated on ImageNet-C, averaged over all 15 corruptions of severity level 5. Detailed results are in Table 2. We attribute COTTA's inferior performance to its learning rate being tuned for the continual setting; see Appendix F.2 for details.", "description": "This table presents the average accuracy of different test-time adaptation methods on ImageNet-C dataset when facing a single corruption type at severity level 5.  It shows the performance of several methods including the proposed POEM method and baselines like TENT, COTTA, EATA, and SAR.  The table highlights the superior performance of the proposed method compared to the others. Detailed results broken down by each corruption type are available in Table 2.", "section": "4 Experiments"}]