[{"figure_path": "aJDGfynRw7/figures/figures_3_1.jpg", "caption": "Figure 1: The illustration of our new instance weighting method.", "description": "This figure illustrates the proposed instance weighting method in the IWBVT approach.  The left side shows how the probability distribution P(ŷi|Li) and the complementary entropy Ent(P<sub>i</sub>) are used to estimate the weight wi for each instance xi. The right side displays four scenarios based on different combinations of P(ŷi|Li) and Ent(P<sub>i</sub>), showing how the weight wi is adjusted (increased or decreased) accordingly.", "section": "3.1 Instance weighting for crowdsourcing"}, {"figure_path": "aJDGfynRw7/figures/figures_8_1.jpg", "caption": "Figure 2: The model quality (%) comparisons of MV, IWMV, LAWMV, MNLDP, AVNC, MVNC and NWVNC before and after using IWBVT on Leaves and Income.", "description": "This figure compares the model quality (in percentage) of seven different algorithms (MV, IWMV, LAWMV, MNLDP, AVNC, MVNC, and NWVNC) before and after applying the proposed IWBVT method on two real-world datasets: Leaves and Income.  The bars represent the model quality for each algorithm on each dataset, with the blue bars showing the original performance and green showing the improvement after IWBVT is applied. It illustrates the effectiveness of IWBVT in enhancing the performance of various state-of-the-art algorithms in real-world scenarios.", "section": "5.3 Experiments on real-world datasets"}, {"figure_path": "aJDGfynRw7/figures/figures_9_1.jpg", "caption": "Figure 3: The ablation experiment comparisons of IWBVT and its components on Leaves and Income.", "description": "Figure 3(a) shows the bias and variance of the model trained with true labels, labels inferred by MV, labels with instance weighting, and labels with both instance weighting and bias-variance trade-off. Figure 3(b) shows the model quality of these four models. The results demonstrate that instance weighting and bias-variance trade-off improve the model quality. ", "section": "5.3 Experiments on real-world datasets"}]