[{"figure_path": "26BdXIY3ik/figures/figures_3_1.jpg", "caption": "Figure 1: Global overview of the TFGDA model. STSA strategy encodes critical structure information of graphs into spherical space (Lstsa = Lstr(Gº) + Lstr(Gt)), greatly improving the model's generalization. SDA strategy aims to extract domain-invariant node features by minimizing domain discrepancy on sphere (Lsda). Moreover, to effectively solve the overfitting issue, RNC strategy is introduced to guide the discriminative clustering of unlabeled nodes (Lrnc = Lmi(Q) + Lmi(Q⁺)).", "description": "This figure illustrates the TFGDA model's architecture, highlighting its three main components: STSA for structure alignment, SDA for domain alignment, and RNC for robust clustering.  The model processes both source and target graphs, encoding topological structure information and aligning feature distributions in a spherical space to mitigate domain discrepancy and overfitting. The RNC component enhances model robustness by guiding discriminative clustering of unlabeled nodes.", "section": "4.2 Network Architecture"}, {"figure_path": "26BdXIY3ik/figures/figures_9_1.jpg", "caption": "Figure 2: The t-SNE visualization of representations learned by SGDA, TFGDA and its two variants on A→C task with 5% label rate. In all subfigures, the marks and × represent the source domain and target domain, respectively. Fig 2(a-d) depict category domain (Different colors denotes different classes). Fig 2(e-h) depict domain alignment (Red: Source domain; Blue: Target domain).", "description": "This figure visualizes the representations learned by SGDA, TFGDA, and two of its variants using t-SNE on the A→C transfer task with a 5% label rate.  The top row shows the visualization of different categories, while the bottom row visualizes the alignment between source and target domains.  The figure demonstrates how TFGDA improves category separation and domain alignment compared to SGDA.", "section": "5.3 Analysis and Ablation Study"}, {"figure_path": "26BdXIY3ik/figures/figures_9_2.jpg", "caption": "Figure 3: The trend of Micro-F1 during training. Figure 4: Performance with different label rates.", "description": "This figure actually contains two sub-figures. The left one shows the training curves of different variants of the proposed model (TFGDA) and some baseline models (SGDA, TFGDA-S, TFGDA-R, etc.) on two tasks (A→C and A→D). The right one shows the performance of different models with different label rates on the same two tasks. The figures indicate that the proposed model converges more smoothly and quickly, and achieves better performance than baselines under different label rates.", "section": "5.3 Analysis and Ablation Study"}, {"figure_path": "26BdXIY3ik/figures/figures_17_1.jpg", "caption": "Figure 5: Transfer performance with different domain alignment strategies A→C and A→D.", "description": "The bar chart compares the performance of TFGDA with different domain alignment strategies on two transfer tasks: A→C and A→D. The baseline model is TFGDA-S, and various alignment strategies such as AT, SWD, CMMD, and SAT are added to TFGDA-S.  TFGDA-D, which uses the SDA strategy, serves as a comparison point. The chart shows that TFGDA-D generally achieves the best performance compared to the baseline and other methods in both Micro-F1 and Macro-F1 scores. This suggests that the SDA strategy is effective for aligning feature distributions.", "section": "A.3.1 More Ablation Study"}, {"figure_path": "26BdXIY3ik/figures/figures_18_1.jpg", "caption": "Figure 2: The t-SNE visualization of representations learned by SGDA, TFGDA and its two variants on A→C task with 5% label rate. In all subfigures, the marks and × represent the source domain and target domain, respectively. Fig 2(a-d) depict category domain (Different colors denotes different classes). Fig 2(e-h) depict domain alignment (Red: Source domain; Blue: Target domain).", "description": "This figure visualizes the t-SNE representations of node features learned by SGDA, TFGDA, and two variants of TFGDA on the A→C task using a 5% label rate. The visualization helps understand how different models perform domain adaptation.  Subfigures (a-d) show the clustering of nodes into different categories (colors), while subfigures (e-h) illustrate the alignment of source and target domains (red and blue, respectively).  The comparison aims to highlight TFGDA's improved ability to separate categories and align domains.", "section": "5.3 Analysis and Ablation Study"}, {"figure_path": "26BdXIY3ik/figures/figures_18_2.jpg", "caption": "Figure 2: The t-SNE visualization of representations learned by SGDA, TFGDA and its two variants on A→C task with 5% label rate. In all subfigures, the marks and × represent the source domain and target domain, respectively. Fig 2(a-d) depict category domain (Different colors denotes different classes). Fig 2(e-h) depict domain alignment (Red: Source domain; Blue: Target domain).", "description": "This figure visualizes the t-SNE representations learned by SGDA, TFGDA, and two variants of TFGDA on the A→C transfer task with a 5% label rate.  The visualization shows the separation of different classes (a-d) and the alignment of source and target domains (e-h).  The results demonstrate that TFGDA improves the separation of classes and alignment of domains compared to SGDA.", "section": "5.3 Analysis and Ablation Study"}, {"figure_path": "26BdXIY3ik/figures/figures_18_3.jpg", "caption": "Figure 1: Global overview of the TFGDA model. STSA strategy encodes critical structure information of graphs into spherical space (Lstsa = Lstr(G³) + Lstr(Gt)), greatly improving the model's generalization. SDA strategy aims to extract domain-invariant node features by minimizing domain discrepancy on sphere (Lsda). Moreover, to effectively solve the overfitting issue, RNC strategy is introduced to guide the discriminative clustering of unlabeled nodes (Lrnc = Lmi(Q) + Lmi(Q⁺)).", "description": "This figure shows the overall architecture of the TFGDA model, highlighting the three main components: Subgraph Topological Structure Alignment (STSA), Sphere-guided Domain Alignment (SDA), and Robustness-guided Node Clustering (RNC).  STSA encodes the topological structure of the graphs into a spherical space to improve generalization, while SDA aligns feature distributions across domains within this space. RNC addresses overfitting by guiding discriminative clustering of unlabeled nodes.", "section": "4.2 Network Architecture"}]