[{"figure_path": "fAlcxvrOEX/tables/tables_9_1.jpg", "caption": "Table 1: Vulnerability of different FR systems across different morphing attacks on the SYN-MAD 2022 dataset. FMR = 0.1%.", "description": "This table presents the effectiveness of various face morphing attacks against three different face recognition (FR) systems.  It compares the performance of several morphing techniques, including traditional methods (Webmorph, MIPGAN-I, MIPGAN-II), previous diffusion-model-based attacks (DiM-A, Fast-DiM, Morph-PIPE), and the proposed AdjointDEIS method. The results are presented in terms of MMPMR (Mated Morph Presentation Match Rate) at a 0.1% False Match Rate (FMR).  The NFE (number of forward evaluations) provides a measure of the computational cost of each attack.  Lower NFE values indicate a more efficient attack, while higher MMPMR values suggest greater vulnerability of the FR systems.", "section": "5 Experiments"}, {"figure_path": "fAlcxvrOEX/tables/tables_23_1.jpg", "caption": "Table 2: Impact of number of discretization steps, M, on face morphing with AdjointDEIS. FMR = 0.1%.", "description": "This table shows the impact of the number of discretization steps (M) used in the AdjointDEIS algorithm on the performance of face morphing attacks. The results are measured by the MMPMR metric (Mated Morph Presentation Match Rate) at a False Match Rate (FMR) of 0.1% across three different Face Recognition (FR) systems: AdaFace, ArcFace, and ElasticFace.  As the number of discretization steps decreases, the performance of the morphing attack also decreases. This indicates that using a sufficient number of steps in the AdjointDEIS solver is crucial for achieving high performance in generating effective morphed faces.", "section": "Additional Experiments"}, {"figure_path": "fAlcxvrOEX/tables/tables_24_1.jpg", "caption": "Table 3: Impact of learning rate, η, on face morphing with AdjointDEIS. FMR = 0.1%.", "description": "This table presents the results of experiments evaluating the effect of different learning rates (η) on the performance of the AdjointDEIS method for face morphing.  It shows the MMPMR (Mated Morph Presentation Match Rate) achieved using different learning rates with varying numbers of discretization steps (M) for both ODE and SDE variants of the AdjointDEIS algorithm. A higher MMPMR indicates better performance in creating successful morphs. The False Match Rate (FMR) was kept constant at 0.1%.", "section": "E Additional Experiments"}, {"figure_path": "fAlcxvrOEX/tables/tables_27_1.jpg", "caption": "Table 4: Comparison of different guidance methods for diffusion models.", "description": "This table compares several training-free guided diffusion methods.  The comparison is based on whether each method solves for diffusion ODEs or SDEs, optimizes the initial latent state (xT), and/or optimizes the conditional information (z, θ).  It highlights the differences in approach and capabilities among various techniques.", "section": "H Additional Related Work"}, {"figure_path": "fAlcxvrOEX/tables/tables_28_1.jpg", "caption": "Table 5: Comparison of adjoint sensitivity algorithms for diffusion models.", "description": "This table compares AdjointDPM and AdjointDEIS methods by highlighting key differences in their discretization domain (whether they operate over \\(\\rho\\) or \\(\\lambda\\)), solver type (black box ODE solver vs. custom solver), handling of closed-form SDE coefficients, interoperability with existing samplers, decoupled ODE schedules, and support for SDEs.  AdjointDEIS offers advantages in several aspects, including its use of custom solvers and support for SDEs.", "section": "H Additional Related Work"}]