[{"figure_path": "DpByqSbdhI/tables/tables_6_1.jpg", "caption": "Table 1: Zero-Shot performance. We bold the best and underline the second best. UniMTS performs the best compared with both baselines and our model ablations. The last column shows the average performance across 18 datasets with standard deviation.", "description": "This table presents the zero-shot performance results of UniMTS and several baseline models across 18 motion time series classification benchmark datasets.  The results are categorized by dataset and difficulty level (easy, medium, hard).  For each dataset, accuracy (Acc), F1-score (F1), and top-2 retrieval performance (R@2) are reported. UniMTS consistently outperforms the baselines across all datasets and metrics, demonstrating its superior generalization capabilities.", "section": "4.2 Zero-Shot Results"}, {"figure_path": "DpByqSbdhI/tables/tables_8_1.jpg", "caption": "Table 1: Zero-Shot performance. We bold the best and underline the second best. UniMTS performs the best compared with both baselines and our model ablations. The last column shows the average performance across 18 datasets with standard deviation.", "description": "This table presents the zero-shot performance results of UniMTS and several baselines across 18 benchmark datasets for motion time series classification.  The results show accuracy, F1 score, and top-2 retrieval performance (R@2) for each dataset, categorized by difficulty level (Easy, Medium, Hard).  UniMTS consistently outperforms the baselines, demonstrating its superior generalizability.", "section": "4.2 Zero-Shot Results"}, {"figure_path": "DpByqSbdhI/tables/tables_16_1.jpg", "caption": "Table 1: Zero-Shot performance. We bold the best and underline the second best. UniMTS performs the best compared with both baselines and our model ablations. The last column shows the average performance across 18 datasets with standard deviation.", "description": "This table presents the results of a zero-shot learning experiment on 18 motion time series classification benchmark datasets.  The model, UniMTS, is compared against several other methods (ImageBind, IMU2CLIP, IMUGPT, HARGPT, LLaVA).  The table shows the accuracy, F1-score, and R@2 (top-2 retrieval) for each dataset and the average across all datasets.  UniMTS significantly outperforms all other models in zero-shot classification.", "section": "4.2 Zero-Shot Results"}]