[{"figure_path": "8iPobEKUUA/figures/figures_1_1.jpg", "caption": "Figure 1: PMBR decoding only requires a subset of the utility computations to approximate the output of MBR decoding. The method approximates the unknown values by running a matrix completion algorithm which exploits the low-rank nature of the MBR matrix. Once the full matrix is recovered, the method behaves similar to the vanilla MBR decoding method where the hypothesis with the highest average score is selected.", "description": "This figure illustrates the core idea of PMBR (Probabilistic Minimum Bayes Risk) decoding.  It shows how PMBR uses matrix completion to efficiently approximate the full MBR decoding process. Instead of computing all pairwise utility scores between candidate hypotheses and pseudo-references (which is computationally expensive in vanilla MBR decoding), PMBR only computes scores for a random subset of pairs. Then, a matrix completion algorithm (ALS in this case) is used to fill in the missing entries, approximating the full utility matrix.  The hypothesis with the highest average score across all (now approximated) pseudo-references is then selected as the final translation.", "section": "2 Work"}, {"figure_path": "8iPobEKUUA/figures/figures_4_1.jpg", "caption": "Figure 2: Plot the singular values of an example 124x124 MBR matrix using logscale. We observe a sharp drop after the first singular value for the two utility metrics indicating that the matrix is rank-1. With this matrix formulation, MBR decoding reduces to picking the row with the highest average (since each row maps to one sample in the hypotheses list).", "description": "This figure shows the singular value decomposition of a 124x124 Minimum Bayes Risk (MBR) matrix, using two different utility metrics (MetricX and chrF).  The plot demonstrates that the singular values sharply decrease after the first one, indicating that the matrix is effectively rank-1.  This low-rank property is a key observation supporting the paper's proposed approximation method.  Because the matrix is nearly rank-1, MBR decoding simplifies to finding the row with the highest average value.", "section": "4 MBR Matrix"}, {"figure_path": "8iPobEKUUA/figures/figures_6_1.jpg", "caption": "Figure 3: We scored WMT22 DeEn dataset 1000 times for each budget available. Each scoring picks without replacement 128 samples from the 1024 samples available for each sentence. The highlighted area shows the standard deviation of the scores.", "description": "This figure shows the performance of different MBR decoding approximation methods (PMBR, NxK, SxS) compared to the full MBR method.  The x-axis represents the number of utility calls (computational budget), and the y-axis shows the quality scores (MetricX and COMET).  The shaded areas represent the standard deviations of the scores across multiple runs. The plot demonstrates that PMBR achieves similar quality to the full MBR method while significantly reducing the number of computations.", "section": "6 Experimental Setup"}, {"figure_path": "8iPobEKUUA/figures/figures_13_1.jpg", "caption": "Figure 3: We scored WMT22 DeEn dataset 1000 times for each budget available. Each scoring picks without replacement 128 samples from the 1024 samples available for each sentence. The highlighted area shows the standard deviation of the scores.", "description": "This figure displays the results of scoring the WMT22 DeEn dataset 1000 times for various budget levels, using 128 samples per sentence. The x-axis shows the number of utility calls (computations), representing different budget levels.  The y-axis shows both the MetricX and COMET scores, representing translation quality.  The lines represent different decoding methods: full MBR (the most accurate but computationally expensive), and three approximation methods (PMBR, SxS, NxK). The shaded area around each line indicates the standard deviation of the scores across the 1000 runs, providing a measure of the variability in the results for each method.", "section": "6 Experimental Setup"}, {"figure_path": "8iPobEKUUA/figures/figures_14_1.jpg", "caption": "Figure 3: We scored WMT22 DeEn dataset 1000 times for each budget available. Each scoring picks without replacement 128 samples from the 1024 samples available for each sentence. The highlighted area shows the standard deviation of the scores.", "description": "This figure displays the results of scoring the WMT22 DeEn dataset 1000 times for various budget levels.  Each scoring instance randomly selects 128 samples from the available 1024 samples for each sentence.  The shaded regions represent the standard deviation of the scores across these multiple runs.  The figure compares the performance of four decoding methods: full MBR, approximate PMBR, approximate SxS, and approximate NxK, demonstrating how their MetricX and COMET scores vary with different computational budgets.", "section": "6 Experimental Setup"}, {"figure_path": "8iPobEKUUA/figures/figures_14_2.jpg", "caption": "Figure 3: We scored WMT22 DeEn dataset 1000 times for each budget available. Each scoring picks without replacement 128 samples from the 1024 samples available for each sentence. The highlighted area shows the standard deviation of the scores.", "description": "This figure shows the performance of four different decoding methods (full MBR, PMBR, NxK, and SxS) on the WMT22 German-English translation task, using both MetricX and COMET metrics.  The x-axis represents the number of utility calls (a measure of computational cost), while the y-axis represents the quality scores (MetricX and COMET).  The shaded areas indicate the standard deviation across 1000 runs for each method and budget, demonstrating the consistency and reliability of the results. The figure highlights that PMBR closely matches the performance of full MBR while significantly reducing the number of utility calls, showcasing its efficiency.", "section": "6 Experimental Setup"}, {"figure_path": "8iPobEKUUA/figures/figures_15_1.jpg", "caption": "Figure 3: We scored WMT22 DeEn dataset 1000 times for each budget available. Each scoring picks without replacement 128 samples from the 1024 samples available for each sentence. The highlighted area shows the standard deviation of the scores.", "description": "This figure compares the performance of several Minimum Bayes Risk (MBR) decoding approximation methods against the full MBR method on the WMT22 English-German translation task.  The x-axis represents the number of utility calls (a measure of computational cost), and the y-axis shows the resulting MetricX and COMET scores, which measure translation quality.  Different colors represent different approximation methods (PMBR, NxK, and SxS). The shaded area illustrates the standard deviation of the scores across multiple runs for each method and budget.", "section": "6 Experimental Setup"}, {"figure_path": "8iPobEKUUA/figures/figures_16_1.jpg", "caption": "Figure 3: We scored WMT22 DeEn dataset 1000 times for each budget available. Each scoring picks without replacement 128 samples from the 1024 samples available for each sentence. The highlighted area shows the standard deviation of the scores.", "description": "This figure displays the results of scoring the WMT22 DeEn dataset 1000 times using different budget levels for five different decoding methods: full MBR, PMBR with SVT, PMBR with ALS, NxK, and SxS.  The x-axis shows the number of utility calls made, which is directly related to the computational cost.  The y-axis shows the achieved scores, broken into two subplots: one for MetricX and another for COMET. The shaded regions around the lines represent the standard deviation of the scores across the 1000 runs for each method and budget, illustrating the variability of the results. The dashed horizontal line represents the score achieved by the full MBR method, serving as a baseline for comparison.  The plot helps to visualize the trade-off between computational cost (number of utility calls) and the quality of the approximation (MetricX and COMET scores) for different MBR approximation techniques.", "section": "6 Experimental Setup"}, {"figure_path": "8iPobEKUUA/figures/figures_17_1.jpg", "caption": "Figure 9: Plot the singular values of an example 124x124 MBR matrix using logscale. The plot on the left shows the case where both the samples for hypotheses and pseudo-references lists, while the right shows the case when they are different. Both plots follow a similar pattern.", "description": "This figure empirically demonstrates the low-rank nature of the MBR matrix, regardless of whether the same set of samples is used for hypotheses and pseudo-references.  The plots display the singular values for two scenarios. The left shows the case where the samples for hypotheses and pseudo-references are the same, while the right depicts the case with different sample sets.  Both scenarios exhibit a sharp decline in singular values after the first, supporting the low-rank assumption central to the proposed PMBR method.", "section": "4 MBR Matrix"}, {"figure_path": "8iPobEKUUA/figures/figures_17_2.jpg", "caption": "Figure 3: We scored WMT22 DeEn dataset 1000 times for each budget available. Each scoring picks without replacement 128 samples from the 1024 samples available for each sentence. The highlighted area shows the standard deviation of the scores.", "description": "This figure displays the performance of four different decoding methods (full MBR, PMBR, NxK, and SxS) on the WMT22 DeEn dataset.  The x-axis represents the number of utility calls, which reflects the computational cost. The y-axis shows the scores obtained using MetricX and COMET22. Each method is tested 1000 times with 128 samples randomly selected from the available 1024 samples for each sentence.  The shaded area represents the standard deviation, illustrating the variability of the results.  The plot showcases how the approximation methods perform compared to the full MBR method across different computational budgets.", "section": "6 Experimental Setup"}]