[{"figure_path": "tmX1AUmkl6/tables/tables_3_1.jpg", "caption": "Table 1: Formulations of dynamics scores at different temporal granularities.", "description": "This table presents the mathematical formulas used to calculate dynamics scores at three different temporal granularities: inter-frame, inter-segment, and video-level.  Each granularity has multiple dynamics scores, which are combined to provide a comprehensive evaluation of the video's dynamic properties. The formulas involve metrics like optical flow strength, structural similarity index (SSIM), perceptual hash distance (PHASHD), autocorrelation factor (ACF), and temporal entropy.  These scores capture various aspects of video dynamics, from low-level changes between consecutive frames to high-level changes in the overall content.", "section": "3 Dynamics Evaluation Protocol"}, {"figure_path": "tmX1AUmkl6/tables/tables_6_1.jpg", "caption": "Table 2: Correlation between the dynamics metric with the existing metrics including Naturalness (Nat), Visual Quality [45] (VQ), Motion Smoothness (MS) [24], Subject Consistency(SC) [24] and Background Consistency(BC) [24]. 'PC' denotes Pearson's correlation, and 'KC' denotes Kendall's correlation.", "description": "This table presents the correlation coefficients between the proposed dynamics metric and five existing metrics: Naturalness, Visual Quality, Motion Smoothness, Subject Consistency, and Background Consistency.  Pearson's and Kendall's correlation coefficients are provided to assess the strength and direction of the relationships.  The negative correlations suggest an inverse relationship between dynamics and existing metrics, indicating a potential issue where models may \"cheat\" by generating low-dynamic videos to achieve high scores on these traditional metrics.", "section": "4 Improving Existing Metrics with Dynamics"}, {"figure_path": "tmX1AUmkl6/tables/tables_7_1.jpg", "caption": "Table 4: Evaluation of dynamics across text-to-video models at multiple temporal levels. Metrics include inter-frame (Mrange), inter-segment (Mrange), and video-level (Mrange) dynamics range and overall dynamics range (Mrange) also shown. Dynamics ranges and dynamics controllability (Mcontrol) are from 0 to 100, where higher scores indicate better performance.", "description": "This table presents a quantitative evaluation of various text-to-video (T2V) models based on their performance across different temporal granularities.  It assesses the models' ability to generate videos with diverse dynamics, measuring their performance in terms of dynamics range (across inter-frame, inter-segment, video-level and overall) and the controllability of the generated video's dynamic properties.  Higher scores indicate superior performance in generating dynamic videos that align with the intended dynamics level. ", "section": "5 Experiment"}, {"figure_path": "tmX1AUmkl6/tables/tables_7_2.jpg", "caption": "Table 3: Human alignment by correlation between dynamics scores and human ratings on the proposed DEVIL benchmark. Video generation is based on text prompts in DEVIL. \"PC\" denotes Pearson's correlation, “KC” Kendall's correlation, and “WR” the win ratio.", "description": "This table presents the results of a human alignment assessment. It shows the correlation (Pearson's, Kendall's, and Win Ratio) between the automatically calculated dynamics scores (at various temporal granularities: Inter-frame, Inter-segment, and Video level) and human ratings for those same dynamics.  Higher correlation values indicate better alignment between automated and human assessments of video dynamics.", "section": "5.1 Human Alignment Assessment"}, {"figure_path": "tmX1AUmkl6/tables/tables_8_1.jpg", "caption": "Table 6: Evaluation of existing metrics and improved metrics. These metrics include Motion Smoothness (MS), Background Consistency(BC), Subject Consistency(SC), and Naturalness (Nat).", "description": "This table presents a comparison of existing and improved metrics for evaluating text-to-video (T2V) generation models.  The existing metrics are Motion Smoothness (MS), Background Consistency (BC), Subject Consistency (SC), and Naturalness (Nat).  The improved metrics are also MS, BC, SC, and Nat but have been enhanced by incorporating the human-aligned dynamics score.  The table shows the scores for each metric for several state-of-the-art T2V models.  The purpose is to demonstrate how incorporating dynamic considerations improves the evaluation metrics.", "section": "5 Improved Evaluation Metrics"}, {"figure_path": "tmX1AUmkl6/tables/tables_8_2.jpg", "caption": "Table 5: Influence of frame rate on the consistency of dynamics scores with human evaluation (measured by Pearson's correlation).", "description": "This table presents the Pearson correlation coefficients between dynamics scores and human evaluations at various frame rates (4 FPS, 8 FPS, 16 FPS) across three temporal granularities: Inter-frame, Inter-segment, and Video.  The \"Origin\" column shows the correlation coefficients using the original frame rates of the videos, demonstrating the robustness and consistency of the dynamics scores regardless of frame rate variations. High correlation values indicate strong agreement between the automatically calculated dynamics scores and human judgments.", "section": "5.2 Influence of Frame Rate"}, {"figure_path": "tmX1AUmkl6/tables/tables_13_1.jpg", "caption": "Table 7: Comparison of keyframe-based and proportional video segmentation methods", "description": "This table compares the performance of two video segmentation methods: keyframe-based and proportional, in the context of inter-segment dynamics.  It shows the Pearson's and Kendall's correlation coefficients between the dynamics scores obtained using each segmentation method and human evaluations, as well as the Win Ratio.  The results indicate that both methods achieve comparable levels of correlation with human evaluations.", "section": "A Inter-segment Dynamics"}, {"figure_path": "tmX1AUmkl6/tables/tables_13_2.jpg", "caption": "Table 8: Influence of the proportion factor r on the performance of inter-segment dynamics", "description": "This table presents the results of an experiment evaluating the impact of the proportion factor (r) used in the inter-segment dynamics calculation on the correlation between the calculated dynamics scores and human evaluations.  The proportion factor determines how the video is segmented for analysis. Three different values of r (1/8, 1/4, 1/2) were tested, and the table shows Pearson's and Kendall's correlation coefficients for each.  Higher correlation coefficients indicate better agreement between the automated metric and human judgment.", "section": "3.2 Dynamics Scores"}, {"figure_path": "tmX1AUmkl6/tables/tables_13_3.jpg", "caption": "Table 9: Influence of video length the performance of inter-segment dynamics.", "description": "This table shows the correlation between human evaluation scores and inter-segment dynamics scores for videos of different lengths (2, 4, and 8 seconds).  It demonstrates the robustness of the inter-segment dynamics metric across varying video durations, maintaining high correlation regardless of video length.", "section": "A Inter-segment Dynamics"}, {"figure_path": "tmX1AUmkl6/tables/tables_14_1.jpg", "caption": "Table 10: Weights of each dynamics score in the human alignment module.", "description": "This table shows the weights assigned to each dynamics score (calculated at different temporal granularities: inter-frame, inter-segment, and video-level) during the human alignment module.  These weights are used to combine the empirically defined dynamics scores and create a more human-aligned overall dynamics score. The 'Typical Value' column provides a sense of the typical magnitude for each score, which helps interpret the weight's influence in the aggregation process.", "section": "3.3 Human Aligned Dynamics Scores"}, {"figure_path": "tmX1AUmkl6/tables/tables_14_2.jpg", "caption": "Table 6: Evaluation of existing metrics and improved metrics. These metrics include Motion Smoothness (MS), Background Consistency(BC), Subject Consistency(SC), and Naturalness (Nat).", "description": "This table compares the performance of existing evaluation metrics (Motion Smoothness, Background Consistency, Subject Consistency, and Naturalness) with improved metrics incorporating the dynamics scores.  It shows the scores for each metric across several text-to-video generation models. The improved metrics demonstrate better performance by addressing the negative correlation between existing metrics and video dynamics.", "section": "4 Improving Existing Metrics with Dynamics"}, {"figure_path": "tmX1AUmkl6/tables/tables_18_1.jpg", "caption": "Table 4: Evaluation of dynamics across text-to-video models at multiple temporal levels. Metrics include inter-frame (Mfange), inter-segment (Mange), and video-level (Mrange) dynamics range and overall dynamics range (Mrange) also shown. Dynamics ranges and dynamics controllability (Mcontrol) are from 0 to 100, where higher scores indicate better performance.", "description": "This table presents a quantitative evaluation of various text-to-video (T2V) models across different temporal granularities (inter-frame, inter-segment, video-level).  The metrics used are dynamics range, reflecting the variety of movement and change within the generated video, and dynamics controllability, which measures how well the model aligns the dynamics of the video to the dynamics implied by the input text. Higher scores in both indicate better model performance. The table facilitates comparison between different models in terms of their ability to generate videos with appropriate and diverse dynamics.", "section": "5.1 Human Alignment Assessment"}, {"figure_path": "tmX1AUmkl6/tables/tables_18_2.jpg", "caption": "Table 3: Human alignment by correlation between dynamics scores and human ratings on the proposed DEVIL benchmark. Video generation is based on text prompts in DEVIL. \"PC\" denotes Pearson's correlation, “KC” Kendall's correlation, and “WR” the win ratio.", "description": "This table presents the correlation analysis results to evaluate the consistency between human-assigned scores and the automatically generated dynamics scores from different temporal granularities, including inter-frame, inter-segment, and video-level. The correlations were measured using Pearson's correlation, Kendall's correlation, and win ratio (WR). High correlation values suggest high consistency, indicating that the dynamics metrics accurately reflect human perception of video dynamics.", "section": "5.1 Human Alignment Assessment"}]