[{"figure_path": "MWHRxKz4mq/figures/figures_5_1.jpg", "caption": "Figure 1: Our mechanistic identifier learns the underlying time-invariant parameters θ, providing a versatile neural emulator for downstream causal analysis.", "description": "This figure illustrates the architecture of the proposed \"mechanistic identifier,\" a neural network designed for identifying time-invariant physical parameters (θ) from real-world time-series data and using these parameters for downstream causal analysis.  The input is a complete trajectory of the system's state (represented as a sequence of maps of the globe). This trajectory is passed to an encoder that extracts a representation of the time-invariant parameters. A mechanistic neural network (MNN) solver is then used to decode the parameters back into a representation of the trajectory. The figure also highlights how interventions can be performed to understand the causal effect of specific parameters on the system. By manipulating the estimated parameter (θ) and feeding it back into the MNN, the model generates a modified trajectory. This allows the analysis of the causal impact of changing specific parameters, such as reconstructing \"colder seas\" by adjusting a related parameter.", "section": "4 CRL-construct of Identifiable Neural Emulators for Dynamical Systems"}, {"figure_path": "MWHRxKz4mq/figures/figures_7_1.jpg", "caption": "Figure 1: Our mechanistic identifier learns the underlying time-invariant parameters θ, providing a versatile neural emulator for downstream causal analysis.", "description": "This figure illustrates the architecture of the proposed mechanistic identifier model. The model takes an input trajectory, encodes it into a latent representation of time-invariant parameters, and then uses these parameters to reconstruct the trajectory using a mechanistic solver, which approximates the underlying dynamical system.  The time-invariant parameters are used for downstream causal analysis, such as out-of-distribution classification or treatment effect estimation. The figure highlights the key components of the model: the encoder, the mechanistic solver, and the downstream causal analysis tasks.", "section": "4 CRL-construct of Identifiable Neural Emulators for Dynamical Systems"}, {"figure_path": "MWHRxKz4mq/figures/figures_8_1.jpg", "caption": "Figure 3: Prediction accuracy on layer thickness parameter on wind simulation data, evaluated on individual encoding partitions S1, S2, S3. Results averaged from three random runs.", "description": "This figure shows the prediction accuracy of the layer thickness parameter in a wind simulation experiment.  The model's learned representation is split into three partitions (S1, S2, S3), each encoding different aspects of the data.  The accuracy is evaluated separately for each partition. The results demonstrate the model's ability to successfully identify the layer thickness parameter. Specifically, high accuracy is observed for partition S1, suggesting this part captures the target information efficiently, while lower accuracy in other partitions indicates they might capture less relevant information for this task.", "section": "6.2 Wind Simulation"}, {"figure_path": "MWHRxKz4mq/figures/figures_8_2.jpg", "caption": "Figure 1: Our mechanistic identifier learns the underlying time-invariant parameters θ, providing a versatile neural emulator for downstream causal analysis.", "description": "The figure illustrates the architecture of the proposed \"mechanistic identifier.\"  It's a neural network model that learns underlying time-invariant physical parameters (θ) from input trajectories. These parameters are crucial for understanding the underlying dynamical system. The model uses an encoder to extract information from the input trajectory, subsequently feeding this information into an ODE (Ordinary Differential Equation) representation, solved by a mechanistic solver. The output is then used for downstream causal analysis, including tasks like OOD classification and treatment-effect estimation.", "section": "4 CRL-construct of Identifiable Neural Emulators for Dynamical Systems"}, {"figure_path": "MWHRxKz4mq/figures/figures_9_1.jpg", "caption": "Figure 4: Left: Underlying causal model for SST-V2 data, θ: covariates (latitude-related parameters of interest), X: outcome (zonal average temperature), T: treatment (tropical T = 0 or polar T = 1). Right: Comparison on ATE change ratio between identified and non-identified parameters, computed by ATE(year)-ATE(1990)/ATE(1990), averaged over three runs.", "description": "The figure shows a causal model and a comparison of results for estimating the average treatment effect (ATE) using identified and non-identified parameters on sea surface temperature data. The causal model (left panel) illustrates the relationship between latitude-related parameters (θ), climate zones (T), and zonal average temperature (X).  The right panel shows that using identified parameters leads to a clearer increasing trend in ATE over time, reflecting global warming, while using non-identified parameters results in a less clear and more erratic trend.", "section": "6.3 Real-world Sea Surface Temperature"}, {"figure_path": "MWHRxKz4mq/figures/figures_18_1.jpg", "caption": "Figure 1: Our mechanistic identifier learns the underlying time-invariant parameters θ, providing a versatile neural emulator for downstream causal analysis.", "description": "The figure illustrates the architecture of the proposed mechanistic identifier. It consists of an encoder that takes an input trajectory and outputs time-invariant parameters. These parameters are then used by a mechanistic neural network (MNN) solver to reconstruct the trajectory, which can be used for downstream causal analysis tasks.  The figure also shows the relationship between the learned representations and the downstream causal tasks.", "section": "4 CRL-construct of Identifiable Neural Emulators for Dynamical Systems"}, {"figure_path": "MWHRxKz4mq/figures/figures_19_1.jpg", "caption": "Figure 1: Our mechanistic identifier learns the underlying time-invariant parameters θ, providing a versatile neural emulator for downstream causal analysis.", "description": "The figure illustrates the architecture of the proposed mechanistic identifier, which combines causal representation learning with dynamical systems. It takes an input trajectory, encodes it to extract time-invariant parameters (θ), and then uses a mechanistic neural network (MNN) to reconstruct the trajectory.  This process allows for downstream causal analysis tasks such as OOD classification or treatment effect estimation, based on the learned parameters. The identifier is trained using multi-view causal representation learning, which enables the identification of shared parameters between multiple trajectories.", "section": "4 CRL-construct of Identifiable Neural Emulators for Dynamical Systems"}, {"figure_path": "MWHRxKz4mq/figures/figures_19_2.jpg", "caption": "Figure 7: SST-V2: mechanistic identifier reconstruction over long-term time series. Results are produced by concatenating subsequently predicted chunks.", "description": "The figure shows the results of using a mechanistic identifier to reconstruct long-term time series data from the SST-V2 dataset.  Three different locations (loc 1, loc 2, loc 3) are shown, each with the ground truth time series in gray and the reconstruction from the model in blue. The reconstructions are generated by concatenating shorter predictions made by the model, highlighting the model's ability to forecast over longer time horizons.  The quality of the reconstruction varies somewhat across the locations.", "section": "6.3 Real-world Sea Surface Temperature"}, {"figure_path": "MWHRxKz4mq/figures/figures_20_1.jpg", "caption": "Figure 1: Our mechanistic identifier learns the underlying time-invariant parameters θ, providing a versatile neural emulator for downstream causal analysis.", "description": "This figure illustrates the architecture of the proposed \"mechanistic identifier.\"  The identifier takes an input trajectory (e.g., time series data) and uses an encoder to learn a representation that isolates the time-invariant, trajectory-specific physical parameters (θ). These parameters are then used to drive a mechanistic ODE solver, which produces a reconstructed trajectory. This reconstructed trajectory can then be used for various downstream causal analysis tasks, such as out-of-distribution classification or treatment effect estimation. The figure highlights the key components: the input trajectory, encoder, ODE representation (with parameters θ), solver, reconstruction, and downstream tasks.  Importantly, the model is designed to be identifiable, meaning that the learned parameters accurately reflect the true underlying physical parameters, allowing for reliable causal inference.", "section": "CRL-construct of Identifiable Neural Emulators for Dynamical Systems"}]