[{"figure_path": "09RKw0vXjR/tables/tables_2_1.jpg", "caption": "Table 1: Objective values of the plain IHT and our method for k ∈ {1, 20, 160, 1280}", "description": "This table compares the objective values achieved by the plain IHT and the proposed Fast IHT method for different sparsity levels (k).  The results demonstrate that both methods achieve the same objective values, confirming the theoretical guarantee that the proposed method does not compromise accuracy while significantly reducing computation time.", "section": "5.2 Accuracy"}, {"figure_path": "09RKw0vXjR/tables/tables_6_1.jpg", "caption": "Table 1: Objective values of the plain IHT and our method for k ∈ {1, 20, 160, 1280}", "description": "This table presents a comparison of objective values achieved by the plain IHT and the proposed fast IHT method for different sparsity levels (k).  The objective function is the mean squared error in the linear regression model.  The results demonstrate that both methods achieve practically identical objective values across various datasets and sparsity levels, thereby validating the claim that the proposed method maintains accuracy while improving speed.", "section": "5 Experiment"}, {"figure_path": "09RKw0vXjR/tables/tables_9_1.jpg", "caption": "Table 1: Objective values of the plain IHT and our method for k ∈ {1, 20, 160, 1280}.", "description": "This table presents a comparison of objective values obtained using the plain Iterative Hard Thresholding (IHT) method and the proposed fast IHT method for various values of k (the number of non-zero elements in the parameter vector).  The results are shown for four different datasets: gisette, robert, ledgar, real-sim, and epsilon. Each row represents a dataset, while the columns represent the objective function values achieved by the plain IHT and the proposed method for different values of k. The table demonstrates that the proposed method achieves the same objective values as the plain IHT, showing its accuracy and effectiveness.", "section": "5 Experiment"}]