[{"figure_path": "IOKLUxB05h/tables/tables_6_1.jpg", "caption": "Table 1: Zero-shot Range Estimation. Our LE-SINR approach enables zero-shot range estimation given a range or habitat description for a particular species. All models were trained with a maximum of 1,000 observations per species and uniformly sampled negatives, using the AN_full loss. ‘+Env’ indicates models trained with additional environmental features as input, as in SINR [10]. ‘+Eval Sp.’ indicates models that had observed data from the evaluation species during training. LE-SINR matches Oracle SINR performance when explicit species tokens are available, i.e., the model is trained with evaluation species, and we also show the performance on the observed species using the text-based species encoders for completeness in the Appendix.", "description": "This table presents the results of a zero-shot range estimation experiment.  It compares the performance of the proposed LE-SINR model against several baselines, including a constant prediction and model mean.  The LE-SINR model is tested with and without environmental features and with and without access to training data for the evaluation species.  The results show that the LE-SINR method significantly outperforms the baselines, demonstrating the effectiveness of zero-shot range estimation using textual descriptions.  Additionally, using text from both habitat and range descriptions leads to improved performance.", "section": "4 Results"}, {"figure_path": "IOKLUxB05h/tables/tables_6_2.jpg", "caption": "Table 2: LE-SINR Ablations. Impact of various design choices, such as species description (range and habitat vs. taxonomy in LD-SDM [28]), location encoders, and the loss function on the zero-shot performance of LE-SINR. All models were trained without ‘Eval Sp’ and using ‘Env’ when appropriate. LD-SDM† is our model and text encoder but trained with taxonomic text as in [28].", "description": "This ablation study analyzes the impact of different design choices on the zero-shot performance of the LE-SINR model.  It investigates the effects of using different types of species descriptions (range, habitat, vs. taxonomy from LD-SDM), different location encoders (Spherical Harmonics, GeoCLIP), and different loss functions (SatCLIP vs. the authors' method). The results show the relative contribution of each design choice to the overall performance of the LE-SINR model in a zero-shot range estimation setting.  The table compares different model configurations across two metrics (IUCN and S&T).", "section": "4 Results"}, {"figure_path": "IOKLUxB05h/tables/tables_12_1.jpg", "caption": "Table 1: Zero-shot Range Estimation. Our LE-SINR approach enables zero-shot range estimation given a range or habitat description for a particular species. All models were trained with a maximum of 1,000 observations per species and uniformly sampled negatives, using the AN_full loss. ‘+Env’ indicates models trained with additional environmental features as input, as in SINR [10]. ‘+Eval Sp.’ indicates models that had observed data from the evaluation species during training. LE-SINR matches Oracle SINR performance when explicit species tokens are available, i.e., the model is trained with evaluation species, and we also show the performance on the observed species using the text-based species encoders for completeness in the Appendix.", "description": "This table presents the results of a zero-shot range estimation experiment comparing different methods.  The LE-SINR model, which combines language and observational data, is compared against several baselines and an oracle model. The results show that LE-SINR significantly outperforms the baselines, achieving performance comparable to the oracle model when using range descriptions.", "section": "4 Results"}]