[{"figure_path": "5pJfDlaSxV/figures/figures_1_1.jpg", "caption": "Figure 1: Distribution of prediction set sizes for vanilla conformal prediction (vanilla CP) which violates Eq. (2), as well as for our proposed robust algorithms (VRCP–I and VRCP–C) along with the SotA (RSCP+ and RSCP+ (PTT), see Section 3) on the CIFAR10 dataset. As we observe, VRCP-I and VRCP-C closely resemble the spread of vanilla CP prediction set sizes, whilst the SotA falls short of achieving this. Here we use an adversarial perturbation of radius € = 0.02, error rate a = 0.1, number of splits nsplits = 50 and smoothing parameter (used in RSCP+ and RSCP+ (PTT)) σ = 2€.", "description": "The figure shows the distribution of prediction set sizes for different conformal prediction methods on the CIFAR10 dataset under adversarial attacks.  Vanilla CP violates the coverage guarantee, while VRCP-I and VRCP-C maintain it and have similar set size distributions to vanilla CP.  The state-of-the-art methods (RSCP+ and RSCP+ with post-training transformation (PTT)) fail to achieve the same level of performance, producing much larger prediction sets.", "section": "5 Evaluation"}, {"figure_path": "5pJfDlaSxV/figures/figures_7_1.jpg", "caption": "Figure 2: Marginal Coverage and Average Set Sizes on CIFAR100 with 95% confidence intervals.", "description": "This figure shows the impact of increasing the number of Monte Carlo samples (nmc) and the impact of increasing epsilon (e) on the marginal coverage and average set sizes of various methods, including VRCP-I, VRCP-C, RSCP+, and RSCP+ (PTT).  The left panel displays results varying nmc, while keeping epsilon constant; the right panel shows results by varying epsilon while keeping nmc constant.  The shaded regions represent the 95% confidence intervals. The figure demonstrates VRCP's robustness in maintaining nominal coverage across varying hyperparameter values while producing significantly smaller prediction regions than the comparison methods.", "section": "5.1 Classification Experiments"}, {"figure_path": "5pJfDlaSxV/figures/figures_7_2.jpg", "caption": "Figure 2: Marginal Coverage and Average Set Sizes on CIFAR100 with 95% confidence intervals.", "description": "This figure shows the impact of increasing the size of adversarial perturbations (epsilon) on both marginal coverage and average prediction set size for different methods on the CIFAR100 dataset.  It compares the performance of VRCP-I, VRCP-C, RSCP+, and RSCP+ (PTT). The x-axis represents the magnitude of adversarial perturbations (epsilon), while the y-axis on the left shows the marginal coverage and the y-axis on the right shows the average prediction set size. The shaded areas represent 95% confidence intervals. The figure demonstrates that VRCP methods maintain high coverage while producing relatively smaller prediction sets compared to the other methods.", "section": "5.1 Classification Experiments"}]