[{"figure_path": "CTIFk7b9jU/figures/figures_1_1.jpg", "caption": "Figure 1: Regional Motions in Cardiac: The left sequential MRI frames within a heartbeat cycle illustrate that motion direction and intensity are completely different between the right atrium and myocardium during End-diastole and End-systole. Formulate Cardiac Motion as Prior Knowledge: The right figure depicts the regions of motion trajectory across the heartbeat cycle, alongside the probability distributions of motion trajectory. Curves (Middle) are the motion trajectory changes of different MRI sequences (Left). Highlighting the cardiac motion trajectory that follows a certain pattern can be modelled as prior knowledge via the Gaussian Process (Right).", "description": "The figure is composed of two parts. The left part shows sequential MRI frames of a heartbeat cycle, highlighting the differences in motion direction and intensity between the right atrium and myocardium during end-diastole and end-systole. The right part illustrates how the cardiac motion trajectory can be modeled as prior knowledge using a Gaussian process, showing regions of motion trajectory across the heartbeat cycle and their probability distributions.", "section": "1 Introduction"}, {"figure_path": "CTIFk7b9jU/figures/figures_2_1.jpg", "caption": "Figure 2: Comparsion between our GPTrack (a) and conventional registration framework (b).", "description": "This figure compares the proposed GPTrack framework with conventional registration frameworks.  The GPTrack (a) shows a bidirectional approach, using both forward and backward flows to aggregate sequential information through GP layers. This contrasts with conventional methods (b), which only compare pairs of images sequentially.  The GPTrack's bidirectional recursive structure, with Gaussian processes encoding spatial and temporal dynamics, aims to improve tracking precision and temporal consistency.", "section": "3.1 Diffeomorphic Tracking of Cardiac Motion"}, {"figure_path": "CTIFk7b9jU/figures/figures_3_1.jpg", "caption": "Figure 3: The overview pipeline of GPTrack (one layer). The x, h, h and z denote input, forward hidden states, backward hidden states and latent coordinates. Feature ft with probabilistic prior on the latent space via Gaussian Process then enters the decoder to predict the motion field 4. Subscript t denotes the t-th position in total T moments. elu(·) represent the exponential linear units [42].", "description": "This figure shows the architecture of GPTrack, a novel framework for cardiac motion tracking.  It consists of a GPTrack layer, a Gaussian Process (GP) layer, and a decoder. The GPTrack layer takes the input data (x) and hidden states (h) from both forward and backward passes to aggregate spatial and temporal information. The GP layer models the cardiac motion dynamics using a probabilistic prior on the latent space. The decoder predicts the motion field (φ). The figure also highlights the use of linear self-attention, layer normalization, and exponential linear units (ELUs) within the GPTrack cell.", "section": "3.2 Motion Tracking with Gaussian Process Latent Coding"}, {"figure_path": "CTIFk7b9jU/figures/figures_8_1.jpg", "caption": "Figure 4: The visualization in 3D Echocardiogram video of motion tracking error. We visualised the last frame of tracking result and ground truth from 32 consecutive frames in CardiacUDA [17]. Colours Red, Blue, Green and Orange denote cardiac structures RA, RV, LV and LA, respectively.", "description": "This figure visualizes the motion tracking results from different methods on a 3D echocardiogram video, comparing the last frame of the tracking result with the ground truth. Four cardiac structures (RA, RV, LV, LA) are color-coded for better visualization and comparison. It demonstrates the performance of the proposed GPTrack method against existing state-of-the-art approaches.", "section": "4.3 Results"}, {"figure_path": "CTIFk7b9jU/figures/figures_8_2.jpg", "caption": "Figure 4: The visualization in 3D Echocardiogram video of motion tracking error. We visualised the last frame of tracking result and ground truth from 32 consecutive frames in CardiacUDA [17]. Colours Red, Blue, Green and Orange denote cardiac structures RA, RV, LV and LA, respectively.", "description": "This figure visualizes the results of motion tracking on 3D echocardiogram videos from the CardiacUDA dataset.  It compares the last frame of tracking results from several methods (SyN, VM-SSD, VM-DIF, DiffuseMorph, DeepTag, FSDiffReg, and the proposed GPTrack) against the ground truth.  Each cardiac structure (Right Atrium, Right Ventricle, Left Ventricle, Left Atrium) is color-coded for easy comparison, highlighting the precision of different approaches in motion tracking.", "section": "4.3 Results"}, {"figure_path": "CTIFk7b9jU/figures/figures_9_1.jpg", "caption": "Figure 6: The Tracking Error performed by different methods in 32 consecutive frames of CardiacUDA [17] full annotated set.", "description": "This figure compares the tracking error of GPTrack and several other methods across 32 consecutive frames from the CardiacUDA dataset. It visually demonstrates the superior performance of GPTrack in maintaining accuracy over a longer sequence compared to other methods that show increasing error over time. The graph highlights the effectiveness of incorporating the Gaussian process and bidirectional recursive manner into the GPTrack framework for improved temporal consistency in cardiac motion tracking.", "section": "4.4 Ablation Study"}, {"figure_path": "CTIFk7b9jU/figures/figures_16_1.jpg", "caption": "Figure 1: Regional Motions in Cardiac: The left sequential MRI frames within a heartbeat cycle illustrate that motion direction and intensity are completely different between the right atrium and myocardium during End-diastole and End-systole. Formulate Cardiac Motion as Prior Knowledge: The right figure depicts the regions of motion trajectory across the heartbeat cycle, alongside the probability distributions of motion trajectory. Curves (Middle) are the motion trajectory changes of different MRI sequences (Left). Highlighting the cardiac motion trajectory that follows a certain pattern can be modelled as prior knowledge via the Gaussian Process (Right).", "description": "This figure shows the differences in motion between the right atrium and myocardium during a heartbeat cycle. The left side displays sequential MRI frames illustrating these differences in motion direction and intensity.  The right side presents a model of cardiac motion as prior knowledge using a Gaussian process. It shows motion trajectories across the heartbeat cycle with probability distributions. This visualizes the pattern of cardiac motion which can be modeled using Gaussian processes.", "section": "1 Introduction"}, {"figure_path": "CTIFk7b9jU/figures/figures_17_1.jpg", "caption": "Figure B2: The visualization in 3D Echocardiogram video of estimated motion field and motion tracking error. We visualised tracking results from the first frame to the last frame, with ground truth from 8 consecutive frames in CardiacUDA [17]. Colours Red, Blue, Green and Orange denote cardiac structures RA, RV, LV and LA, respectively.", "description": "This figure visualizes the estimated motion field and motion tracking error from a 3D echocardiogram video using the proposed GPTrack method.  It shows a comparison between the tracking results and ground truth for eight consecutive frames from the CardiacUDA dataset. The visualization highlights the different cardiac structures (RA, RV, LV, LA) with distinct colors, allowing for a clear assessment of the tracking accuracy and the spatial distribution of errors.", "section": "B Additional Quantitative Results and Visualization"}]