[{"figure_path": "yOe6ajdslI/tables/tables_7_1.jpg", "caption": "Table 1: Average test AUCs with different class-prior pairs. Values in bold are not statistically different at the 5% level from the best performing method in each row according to a paired t-test. '# best' row represents the number of results of each method that are the best or comparable to it.", "description": "This table presents the average test AUCs achieved by different AUC maximization methods under various class-prior settings on four datasets (MNIST, FashionMNIST, SVHN, CIFAR10).  The results are categorized by dataset, the prior probability of the positive class in the test data (πte), and the applied method.  Statistical significance is determined using a paired t-test at a 5% significance level. The '# best' row indicates how many times each method performed best or comparably to the best.", "section": "5.4 Results"}, {"figure_path": "yOe6ajdslI/tables/tables_7_2.jpg", "caption": "Table 2: Results with estimated class-priors on the training distribution Test: average test AUCs [%] over different class-priors on the test distribution when training class-prior  is 0.1. FMNIST is an acronym for FashionMNIST.", "description": "This table compares the performance of the proposed AUC maximization method using true and estimated class priors on the training data.  The results show that using the estimated class prior achieves comparable performance to the method using the true class prior.  The table includes results for four different datasets: MNIST, FashionMNIST, SVHN, and CIFAR10, each with a different test class prior.", "section": "5. Experiments"}, {"figure_path": "yOe6ajdslI/tables/tables_9_1.jpg", "caption": "Table 3: Results of the proposed method with different numbers of unlabeled data in the test distribution: average test AUCs over different class-prior pairs πte in the test distribution within {0.1, 0.2, 0.3} when training class-prior πtr is 0.1. ‘Base’ represents the result of puAUC that does not use unlabeled data in the test distribution.", "description": "This table shows the average test AUCs of the proposed method with different numbers of unlabeled data in the test distribution. The class-prior in the training distribution is fixed at 0.1, while the class-prior in the test distribution varies across three values (0.1, 0.2, 0.3).  The results are compared against a baseline method (puAUC) that does not use any unlabeled data from the test distribution.", "section": "5.4 Results"}, {"figure_path": "yOe6ajdslI/tables/tables_9_2.jpg", "caption": "Table 1: Average test AUCs with different class-prior pairs. Values in bold are not statistically different at the 5% level from the best performing method in each row according to a paired t-test. '# best' row represents the number of results of each method that are the best or comparable to it.", "description": "This table presents the average test AUCs achieved by different AUC maximization methods under positive distribution shift with four imbalanced datasets (MNIST, FashionMNIST, SVHN, CIFAR10).  Each dataset is evaluated under three different class prior scenarios in the test data (0.1, 0.2, and 0.3). The table also indicates the number of times each method produced the best or comparable results across all datasets and scenarios.", "section": "5.4 Results"}, {"figure_path": "yOe6ajdslI/tables/tables_15_1.jpg", "caption": "Table 5: Comparison with the proposed methods that use the loss corrections. Ours w/ nn used the non-negative loss correction and Ours w/ b uses b = (1 − πte)(1 – πtr)/2 for the correction: average test AUCs over different class-prior pairs πte in the test distribution within {0.1, 0.2, 0.3} when training class-prior πtr is 0.1.", "description": "This table compares the performance of three variations of the proposed AUC maximization method.  The original method ('Ours') is compared against versions that incorporate two different loss corrections ('Ours w/ nn' and 'Ours w/ b'). The loss corrections aim to prevent overfitting by addressing potential issues with negative empirical risk estimates. The table shows the average test AUC for each method across different class-prior values (πte) in the test data, while keeping the training class-prior (πtr) constant at 0.1.", "section": "B Proposed Method with Loss Corrections"}, {"figure_path": "yOe6ajdslI/tables/tables_17_1.jpg", "caption": "Table 6: Comparison with BPURR: average test AUCs for each test class-prior. Values in bold are not statistically different at the 5% level from the best performing method in each row according to a paired t-test. FMNIST is an acronym for FashionMNIST.", "description": "This table compares the performance of the proposed method against BPURR, another method designed for positive distribution shift, across four datasets (MNIST, FashionMNIST, SVHN, CIFAR10) at varying test-set class-prior values.  The table shows that the proposed method either outperforms or performs comparably to BPURR in most cases, indicating it is a more robust and effective approach for maximizing AUC under positive distribution shift.", "section": "5.2 Comparison Methods"}, {"figure_path": "yOe6ajdslI/tables/tables_18_1.jpg", "caption": "Table 1: Average test AUCs with different class-prior pairs. Values in bold are not statistically different at the 5% level from the best performing method in each row according to a paired t-test. '# best' row represents the number of results of each method that are the best or comparable to it.", "description": "This table presents the average test AUC scores achieved by different AUC maximization methods across four datasets (MNIST, FashionMNIST, SVHN, CIFAR10) under various class-prior settings (πte).  The results are compared using a paired t-test to determine statistical significance, indicating which methods perform comparably to the best.  The '# best' row summarizes how frequently each method achieved the highest or comparable AUC.", "section": "5.4 Results"}, {"figure_path": "yOe6ajdslI/tables/tables_18_2.jpg", "caption": "Table 8: Results with tabular data: average test AUCs over different class-prior pairs πte in the test distribution within {0.1, 0.2, 0.3} when training class-prior πtr is 0.1. Boldface denotes the best and comparable methods according to the paired t-test and the significance level of 5%.", "description": "This table presents the average test AUCs achieved by different methods on two tabular datasets, HReadmission and Hypertension, under positive distribution shift scenarios.  Each dataset has three different test class-prior values (0.1, 0.2, and 0.3). The table compares the proposed method's performance against several baselines, highlighting the best-performing method for each scenario using a paired t-test at the 5% significance level.", "section": "E.3 Results with Tabular Datasets"}, {"figure_path": "yOe6ajdslI/tables/tables_19_1.jpg", "caption": "Table 1: Average test AUCs with different class-prior pairs. Values in bold are not statistically different at the 5% level from the best performing method in each row according to a paired t-test. '# best' row represents the number of results of each method that are the best or comparable to it.", "description": "This table presents the average test AUCs achieved by different AUC maximization methods across four datasets (MNIST, Fashion-MNIST, SVHN, CIFAR10) under varying class prior conditions in the test data.  The results are compared using a paired t-test to determine statistical significance. The '# best' row summarizes how often each method achieved the highest or comparable AUC across all conditions.", "section": "5.4 Results"}, {"figure_path": "yOe6ajdslI/tables/tables_19_2.jpg", "caption": "Table 1: Average test AUCs with different class-prior pairs. Values in bold are not statistically different at the 5% level from the best performing method in each row according to a paired t-test. '# best' row represents the number of results of each method that are the best or comparable to it.", "description": "This table presents the average test AUCs achieved by different AUC maximization methods across four datasets (MNIST, FashionMNIST, SVHN, CIFAR10) under varying class-prior conditions in the test data.  The results are compared using a paired t-test to determine statistical significance. The '# best' row summarizes how often each method achieved the best or comparable performance.", "section": "5.4 Results"}, {"figure_path": "yOe6ajdslI/tables/tables_20_1.jpg", "caption": "Table 1: Average test AUCs with different class-prior pairs. Values in bold are not statistically different at the 5% level from the best performing method in each row according to a paired t-test. '# best' row represents the number of results of each method that are the best or comparable to it.", "description": "This table presents the average test AUCs achieved by different AUC maximization methods across four datasets (MNIST, FashionMNIST, SVHN, CIFAR10) under varying class-prior conditions in both training and testing distributions.  The results are statistically analyzed using a paired t-test to identify methods that perform comparably to the best-performing method.  The '# best' row summarizes the number of times each method achieves the best or comparable performance.", "section": "5.4 Results"}]