[{"figure_path": "TLUGoShY30/figures/figures_3_1.jpg", "caption": "Figure 1: We perform Monte Carlo sampling at the viewpoint. When the sampling ray from the point is not blocked, it is the direct illumination from environmental lighting. When the sampling ray hits an object, we divide this indirect illumination from the object into diffuse light and specular light. We sample the diffuse light from a diffuse map that is optimized through self-supervision. For specular light, we only need to partially trace the rays in a small specular lobe along the reflective direction. The gradients are backward along the tracing path, and are passed to optimize kd, korm, normals, and environment maps.", "description": "This figure illustrates the multi-times Monte Carlo sampling method used in Ref-MC2.  It shows how the method traces rays from the camera viewpoint, handling both direct and indirect illumination. Direct illumination comes straight from the light source, while indirect illumination is calculated by tracing rays that bounce off surfaces multiple times.  The diagram highlights the use of a diffuse map (for efficient diffuse lighting calculations) and selective sampling for specular highlights, reducing computation. Gradients are then used to optimize material parameters (kd, korm), surface normals, and environment maps.", "section": "3.2 Multi-times Monte Carlo Sampling"}, {"figure_path": "TLUGoShY30/figures/figures_4_1.jpg", "caption": "Figure 2: Differences between previous SDF architectures and the architecture for inter-reflections.", "description": "The figure compares two SDF (Signed Distance Function) architectures.  (a) shows a traditional SDF architecture with separate MLPs (Multi-Layer Perceptrons) for diffuse and reflective components, using IPE (Integrated Positional Encoding). (b) illustrates the architecture proposed in the paper for handling inter-reflections. It replaces the diffuse MLP with a simpler SG (Spherical Gaussian) representation and uses SGE (Spherical Gaussian Encoding) for the reflective component, improving efficiency and accuracy in scenes with multiple reflections. The geometry comparison (c) visually demonstrates the improved quality of geometry reconstruction achieved by the proposed architecture.", "section": "3.3 Geometry Initialization"}, {"figure_path": "TLUGoShY30/figures/figures_6_1.jpg", "caption": "Figure 3: Qualitative comparison. The results of renderings, materials, and environment maps are presented. Note that, the material of Nefii contains only roughness without metalness. Our method achieves the best renderings with clear reflections, compared to other inverse rendering methods. Our method is also superior to others in the disentanglement of materials and environment maps.", "description": "This figure compares the results of four different inverse rendering methods (Ours, Nvdiffrec, Nvdiffrecmc, and Nefii) against ground truth. The comparison is done across three aspects: renderings, materials, and detail & probes.  The results show that the proposed method, \"Ours,\" produces the most realistic renderings with clear reflections.  The method also excels at disentangling materials and accurately reconstructing environment maps, unlike the other methods which suffer from artifacts or incomplete material representations.", "section": "4.2 Comparison with Baseline"}, {"figure_path": "TLUGoShY30/figures/figures_7_1.jpg", "caption": "Figure 4: Ablation study on the depth of ray tracing, i.e., the times of Monte Carlo sampling. The results with depth=1 show fewer and darker reflections compared to the ground truth. ka maps also illustrate the limited capacity to disentangle the material from environmental light, for example, mistaking the diffuse color of the table as the color of the sky. In contrast, with depth=2 or 3, results show more realistic renderings and disentangled materials.", "description": "This figure presents an ablation study on the effect of varying the depth (number of times) of Monte Carlo sampling during ray tracing on the quality of inverse rendering results.  The results demonstrate that increasing the sampling depth leads to more accurate rendering of reflections and better separation of material properties from environmental lighting.  With only one level of ray tracing (depth=1), reflections are significantly under-represented and there is difficulty in separating material color from background lighting. However, with two or three levels of ray tracing (depth=2 or 3), the reflections are significantly more realistic and the materials appear more accurate and distinct from the background.", "section": "4.3 Multi-times Monte Carlo Sampling"}, {"figure_path": "TLUGoShY30/figures/figures_7_2.jpg", "caption": "Figure 5: Ablation study on geometric initialization. As shown, a better-quality geometry can significantly improve the material learning and also refine the rendering results.", "description": "This figure presents an ablation study on the impact of geometric initialization on the performance of the proposed method.  The top row shows the ground truth renderings, results without using initial geometry, and results with a well-initialized geometry for a scene with a teapot and several metallic spheres. The bottom row presents the same comparison for a scene with a toaster and metallic spheres. The right half of the figure shows the learned kd (diffuse albedo), korm (roughness), normals, and probe maps for each condition, illustrating the improvement in material disentanglement and rendering quality when using a high-quality initial geometry.", "section": "4.3 Multi-times Monte Carlo Sampling"}, {"figure_path": "TLUGoShY30/figures/figures_8_1.jpg", "caption": "Figure 6: Real scene geometry comparison. We compare our reconstructed geometry with NeRO, Nvdiffrec and Nvdiffrecmc. Our reconstructed geometry demonstrates superior results.", "description": "This figure compares the 3D geometry reconstruction results of the proposed method (Ref-MC2) against three other methods (NeRO, Nvdiffrec, and Nvdiffrecmc) on a real-world scene of a coral.  The ground truth geometry is also shown for reference. The comparison highlights the superior quality and accuracy of the geometry generated by Ref-MC2 in capturing the fine details and overall structure of the coral compared to the other methods.", "section": "4.4 Geometry"}, {"figure_path": "TLUGoShY30/figures/figures_9_1.jpg", "caption": "Figure 7: Relighting and editing. We compose the reconstructed objects in a unified scene and change the environmental light. The relighting results show our strong ability to disentangle the light and shading. We also perform material edits which shows the flexibility in wide applications.", "description": "This figure demonstrates the ability of the proposed method, Ref-MC2, to perform relighting and material editing on reconstructed 3D scenes. The left half shows how different lighting conditions can be applied to a scene with various objects while maintaining the quality of the reconstruction. The right half showcases material editing capabilities; users can change the material properties of individual objects (e.g., metalness, roughness, color) to achieve a variety of visual effects. These examples highlight the method's ability to disentangle lighting and material parameters, making it suitable for various downstream applications.", "section": "4.5 Relighting and Material Editing"}, {"figure_path": "TLUGoShY30/figures/figures_9_2.jpg", "caption": "Figure 6: Real scene geometry comparison. We compare our reconstructed geometry with NeRO, Nvdiffrec and Nvdiffrecmc. Our reconstructed geometry demonstrates superior results.", "description": "This figure presents a qualitative comparison of the 3D geometry reconstruction results obtained by the proposed method (Ours) against three other state-of-the-art methods: NeRO, Nvdiffrec, and Nvdiffrecmc.  The comparison uses real-world scenes and showcases the superior ability of the proposed method to accurately reconstruct complex geometries, especially in challenging scenes with intricate details and reflective surfaces. The results highlight that the proposed method produces more accurate and visually appealing 3D models.", "section": "4.4 Geometry"}]