[{"figure_path": "ltnDg0EzF9/tables/tables_5_1.jpg", "caption": "Table 1: We assess the quality of image relighting using the multi-illumination dataset [38]. Our method, when evaluated on raw output, significantly outperforms all other unsupervised approaches and achieves competitive results compared to the supervised SA-SA [22], which requires ground truth light supervision. When we correct the colors by eliminating global color drift caused by light ambiguity, our method surpasses all other approaches. Additionally, warming up the model as a denoising autoencoder proves beneficial compared to when it is not warmed up (σ = 0).", "description": "This table presents a quantitative comparison of the proposed relighting method against several state-of-the-art methods.  The comparison is based on the multi-illumination dataset [38] and uses RMSE and SSIM metrics to evaluate the quality of raw output and color-corrected relighting results.  The results demonstrate that the proposed method significantly outperforms other unsupervised approaches and achieves competitive performance compared to a supervised method. The impact of model warm-up is also analyzed.", "section": "4.2 Evaluating image relighting"}, {"figure_path": "ltnDg0EzF9/tables/tables_8_1.jpg", "caption": "Table 3: We benchmark our albedo esimation on test set of IIW dataset [5] and compare with others, though the reliability has been questioned by recent papers [16]. Flat denotes postprocessing images with flattening [10]. Despite our model never being trained on albedo maps or CG data, our best configuration significantly outperforms all other methods suggesting our model learns high-quality intrinsic representations", "description": "This table presents a benchmark of the model's albedo estimation performance on the IIW dataset, comparing it against other state-of-the-art methods. Notably, the model achieves competitive results despite not being trained on albedo maps or computer-generated imagery, highlighting its ability to learn high-quality intrinsic representations.", "section": "4.3 Zero-shot albedo evaluation"}]