[{"figure_path": "nIeufGuQ9x/tables/tables_3_1.jpg", "caption": "Table 1: State-of-the-art comparison on F3D<sub>s</sub> and KITTI<sub>s</sub>. The models are only trained on F3D<sub>s</sub> without occlusions. The number of time steps is set to 20 for training and 2 for inference. The bold and the underlined numbers represent the best and the second best performance respectively.", "description": "This table compares the proposed DiffSF model's performance against other state-of-the-art methods on the F3D<sub>s</sub> and KITTI<sub>s</sub> datasets.  The models were trained only on the F3D<sub>s</sub> dataset (without occlusions) and evaluated using four metrics: EPE3D, ACCs, ACCR, and Outliers.  The number of diffusion time steps used for training and inference is specified. Bold and underlined values indicate the best and second-best performance, respectively.  This demonstrates the model's accuracy and robustness, especially considering that it wasn't trained on the KITTI<sub>s</sub> dataset.", "section": "4.4 State-of-the-art Comparison"}, {"figure_path": "nIeufGuQ9x/tables/tables_6_1.jpg", "caption": "Table 1: State-of-the-art comparison on F3Dₛ and KITTIs. The models are only trained on F3Dₛ without occlusions. The number of time steps is set to 20 for training and 2 for inference. The bold and the underlined numbers represent the best and the second best performance respectively.", "description": "This table compares the proposed DiffSF model to other state-of-the-art scene flow estimation methods on the FlyingThings3D (F3Dₛ) and KITTI (KITTIs) datasets.  The models were trained only on the F3Dₛ dataset (without occlusions), making it a generalization test on the KITTI dataset.  The metrics used are Endpoint Error (EPE3D), Accuracy within 5cm (ACCS), Accuracy within 10cm (ACCR), and the percentage of outliers.  The number of diffusion time steps used during training and inference are specified.", "section": "4.4 State-of-the-art Comparison"}, {"figure_path": "nIeufGuQ9x/tables/tables_6_2.jpg", "caption": "Table 2: State-of-the-art comparison on F3D。 and KITTI,. The models are only trained on F3D。 with occlusions. The number of time steps is set to 20 for training and 2 for inference.", "description": "This table compares the performance of DiffSF against other state-of-the-art methods on the F3D dataset with occlusions and KITTI dataset.  The metrics used are End Point Error 3D (EPE3D), Accuracy within 5cm (ACCs), Accuracy within 10cm (ACCR), and Outliers.  It highlights DiffSF's performance when trained only on data with occlusions and its generalization ability on the KITTI dataset.", "section": "4.4 State-of-the-art Comparison"}, {"figure_path": "nIeufGuQ9x/tables/tables_7_1.jpg", "caption": "Table 3: State-of-the-art comparison on Waymo-Open dataset. The number of time steps is set to 20 for training and 2 for inference.", "description": "This table compares the performance of DiffSF against other state-of-the-art methods on the Waymo-Open dataset.  It shows that DiffSF achieves better performance in terms of EPE3D, ACCs, ACCR, and Outliers, demonstrating its effectiveness in handling challenging real-world scenarios.", "section": "4.4 State-of-the-art Comparison"}, {"figure_path": "nIeufGuQ9x/tables/tables_8_1.jpg", "caption": "Table 4: Ablation study on the number of global-cross transformer layers on F3D. The number of feature channels is set to 128. The number of time steps is set to 5 for training and 1 for inference.", "description": "This table presents the ablation study on the number of global-cross transformer layers used in the model. The study was conducted on the F3D dataset with 128 feature channels and 5 training steps, 1 inference step. The results (EPE3D, ACCs, ACCR, Outliers) are shown for both the complete dataset and the non-occluded subset.  The table shows how different numbers of layers (8, 10, 12, 14, 16) affect the model's performance.", "section": "4.6 Ablation Study"}, {"figure_path": "nIeufGuQ9x/tables/tables_8_2.jpg", "caption": "Table 5: Ablation study on the number of feature channels on F3D. The number of global-cross transformer layers is set to 14. The number of time steps is set to 5 for training and 1 for inference.", "description": "This table presents the ablation study on the number of feature channels used in the model's architecture for scene flow estimation on the F3D dataset.  The results show how the model's performance (EPE3D, ACCs, ACCR, and Outliers) varies with different numbers of feature channels (32, 64, and 128) while keeping the number of global-cross transformer layers and time steps constant. It aims to determine the optimal number of feature channels for achieving the best performance.", "section": "4.6 Ablation Study"}, {"figure_path": "nIeufGuQ9x/tables/tables_9_1.jpg", "caption": "Table 1: State-of-the-art comparison on F3Dₛ and KITTIₛ. The models are only trained on F3Dₛ without occlusions. The number of time steps is set to 20 for training and 2 for inference. The bold and the underlined numbers represent the best and the second best performance respectively.", "description": "This table presents a comparison of the proposed DiffSF model against state-of-the-art methods on two scene flow datasets: F3Dₛ (FlyingThings3D without occlusions) and KITTIₛ (KITTI without occlusions).  The models were trained only on the F3Dₛ dataset.  The evaluation metrics used are EPE3D (Endpoint Error), ACCs (percentage of points with an endpoint error smaller than 5cm or relative error less than 5%), ACCr (percentage of points with an endpoint error smaller than 10cm or relative error less than 10%), and Outliers (percentage of points with an endpoint error larger than 30cm or relative error larger than 10%).  The number of diffusion steps used during training was 20 and during inference was 2. Bold values indicate the best performance, while underlined values indicate second-best.", "section": "4.4 State-of-the-art Comparison"}, {"figure_path": "nIeufGuQ9x/tables/tables_9_2.jpg", "caption": "Table 7: Ablation Study compare to baseline GMSF on F3D。", "description": "This table presents an ablation study comparing the performance of the proposed DiffSF method against the baseline GMSF method on the F3D dataset. It analyzes the impact of incorporating improved architecture and the diffusion process on the overall performance, showing improvement in accuracy and robustness metrics when both improvements are included.", "section": "4.6 Ablation Study"}]