[{"figure_path": "crlvDzDPgM/figures/figures_1_1.jpg", "caption": "Figure 1: The pipeline of subgraph-based methods includes subgraph selection and subgraph encoding. In this work, we focus specifically on searching for components within the red-dotted lines.", "description": "This figure illustrates the general pipeline of subgraph-based methods for drug-drug interaction prediction.  It starts with the input drug interaction network (GDDI). A subgraph selection module then extracts a subgraph (Gu,v) relevant to a specific query pair of drugs (u,v). This subgraph is further encoded using a subgraph encoding module that learns a representation. Finally, this representation is used by a predictor to generate the prediction of drug-drug interaction (Yuv). The figure highlights the two key components, subgraph selection and subgraph encoding, that the authors' proposed method focuses on improving.", "section": "1 Introduction"}, {"figure_path": "crlvDzDPgM/figures/figures_7_1.jpg", "caption": "Figure 2: Comparison on convergence between the searched architectures by CSSE-DDI and human-designed methods.", "description": "This figure compares the training time and performance of CSSE-DDI against two other methods: KnowDDI and CompGCN.  The left panel shows the F1 scores on the DrugBank dataset over training time in hours, while the right panel shows the ROC-AUC scores on the TWOSIDES dataset over training time in minutes.  CSSE-DDI demonstrates superior convergence speed and ultimately achieves higher performance in both datasets, showcasing the benefits of its adaptive subgraph selection and encoding strategies.", "section": "4.2 Performance Comparison in S0 settings"}, {"figure_path": "crlvDzDPgM/figures/figures_8_1.jpg", "caption": "Figure 2: Comparison on convergence between the searched architectures by CSSE-DDI and human-designed methods.", "description": "This figure compares the training efficiency and performance of the proposed CSSE-DDI method against existing human-designed methods (CompGCN and KnowDDI). The plots show the learning curves for F1 score, accuracy, and Cohen's Kappa on the DrugBank dataset (Figure 2a) and ROC-AUC, PR-AUC, and AP@50 on the TWOSIDES dataset (Figure 2b).  CSSE-DDI demonstrates faster convergence and superior performance compared to baselines, highlighting the benefits of automated search for model architecture.", "section": "4.2 Performance Comparison in S0 settings"}, {"figure_path": "crlvDzDPgM/figures/figures_8_2.jpg", "caption": "Figure 4: Visualization of the searched subgraphs corresponding to the specific drug pairs.", "description": "This figure visualizes two example subgraphs identified by the CSSE-DDI model for specific drug pairs from the DrugBank dataset.  Each subgraph highlights the relationships between drugs, illustrating the model's ability to identify relevant contextual information for accurate prediction. The subgraphs reveal domain concepts such as pharmacokinetics and metabolic interactions, demonstrating the model's capacity to capture nuanced details that impact drug interactions.", "section": "4.6 Case Study"}, {"figure_path": "crlvDzDPgM/figures/figures_9_1.jpg", "caption": "Figure 5: The searched encoding functions on all benchmark datasets.", "description": "This figure visualizes the encoding functions searched by the CSSE-DDI model across different datasets (DrugBank and TWOSIDES).  It shows the specific combinations of operations (CORR, MULT, MLP, etc.) and aggregation functions (SUM, MEAN, CONCAT) discovered through the search process. The variation in the encoding functions highlights the model's ability to adapt to the diverse interaction patterns in different datasets. For example, the DrugBank dataset, which features asymmetric interactions, predominantly employs CORR operations, while the symmetric TWOSIDES dataset shows a preference for MULT operations. This visualization illustrates the data-specific nature of the learned encoding functions.", "section": "4.6.2 Data-specific Encoding Function"}, {"figure_path": "crlvDzDPgM/figures/figures_18_1.jpg", "caption": "Figure 6: Distribution of the searched subgraph scopes by CSSE-DDI on all benchmark datasets.", "description": "The figure shows a bar chart visualizing the distribution of subgraph scopes selected by the CSSE-DDI model across two benchmark datasets, DrugBank and TWOSIDES.  The x-axis represents different subgraph scope combinations (e.g., (1,1), (1,2), etc.), indicating the number of hops considered from each node of a drug pair in the subgraph sampling process. The y-axis represents the frequency of each subgraph scope being selected by the model. The chart visually compares the scope selection preferences between the two datasets, showing variations in the model's subgraph sampling strategies depending on the characteristics of the data.", "section": "C More Experimental Results"}]