[{"figure_path": "crlvDzDPgM/tables/tables_1_1.jpg", "caption": "Table 1: Comparing with existing methods. \"-\" represents not applicable.", "description": "This table compares the proposed method, CSSE-DDI, with existing methods for drug-drug interaction prediction.  It highlights whether each method uses fine-grained subgraph selection and data-specific encoding functions, showing that CSSE-DDI uniquely incorporates both features, unlike other methods that might use one or neither.", "section": "Related Works"}, {"figure_path": "crlvDzDPgM/tables/tables_5_1.jpg", "caption": "Table 2: CSSE-DDI achieves the best predictive performance compared to state-of-the-art baselines in DDI prediction. Average and standard deviation of five runs are reported. For these metrics, higher values always indicate better performance.", "description": "This table compares the performance of the proposed CSSE-DDI model against various baseline methods for drug-drug interaction (DDI) prediction on two benchmark datasets: DrugBank (multi-class) and TWOSIDES (multi-label).  The metrics used for evaluation include F1 score, accuracy, Cohen's kappa, ROC-AUC, PR-AUC, and AP@50, depending on the dataset. The table shows that CSSE-DDI consistently outperforms all baselines across different evaluation metrics, demonstrating its effectiveness in DDI prediction.", "section": "4.2 Performance Comparison in S0 settings"}, {"figure_path": "crlvDzDPgM/tables/tables_7_1.jpg", "caption": "Table 2: CSSE-DDI achieves the best predictive performance compared to state-of-the-art baselines in DDI prediction. Average and standard deviation of five runs are reported. For these metrics, higher values always indicate better performance.", "description": "This table presents a comparison of the performance of the proposed CSSE-DDI model against various existing methods for drug-drug interaction (DDI) prediction on two benchmark datasets, DrugBank and TWOSIDES.  The table shows performance metrics like F1 Score, Accuracy, Cohen's Kappa, ROC-AUC, PR-AUC, and AP@50 for multi-class and multi-label classification tasks, respectively.  It highlights the superiority of CSSE-DDI across different model types (GNN-based, Subgraph-based, and NAS-based) and variations of CSSE-DDI itself. Higher values indicate better performance.", "section": "4.2 Performance Comparison in S0 settings"}, {"figure_path": "crlvDzDPgM/tables/tables_7_2.jpg", "caption": "Table 2: CSSE-DDI achieves the best predictive performance compared to state-of-the-art baselines in DDI prediction. Average and standard deviation of five runs are reported. For these metrics, higher values always indicate better performance.", "description": "This table compares the performance of the proposed method, CSSE-DDI, against various baselines on two datasets (DrugBank and TWOSIDES) for two prediction tasks (multi-class and multi-label).  It shows that CSSE-DDI outperforms other methods across multiple metrics (F1 Score, Accuracy, Cohen's Kappa, ROC-AUC, PR-AUC, AP@50) indicating its superior performance in DDI prediction.  The table also includes variants of CSSE-DDI to showcase the impact of different design choices.", "section": "4.2 Performance Comparison in S0 settings"}, {"figure_path": "crlvDzDPgM/tables/tables_8_1.jpg", "caption": "Table 4: Experimental results in S1 setting.", "description": "This table presents the performance comparison of different methods in the S1 setting of the drug-drug interaction (DDI) prediction task.  The S1 setting is more challenging than the S0 setting because it involves predicting interactions where one drug is novel (not in the training data). The table shows the results on two benchmark datasets, DrugBank and TWOSIDES, using metrics appropriate for multi-class (DrugBank) and multi-label (TWOSIDES) classification. The methods compared include various GNN and subgraph-based methods, and the proposed CSSE-DDI method. The metrics reported include F1 score, Accuracy, Cohen's Kappa (DrugBank), and ROC-AUC, PR-AUC, and Accuracy (TWOSIDES).  Higher values indicate better performance.", "section": "4.5 Performance Comparison in S1 settings"}, {"figure_path": "crlvDzDPgM/tables/tables_16_1.jpg", "caption": "Table 2: CSSE-DDI achieves the best predictive performance compared to state-of-the-art baselines in DDI prediction. Average and standard deviation of five runs are reported. For these metrics, higher values always indicate better performance.", "description": "This table presents a comparison of the performance of the proposed CSSE-DDI method against various baselines on two datasets, DrugBank and TWOSIDES.  For each dataset and method, it lists the F1 Score, Accuracy, Cohen's Kappa (for DrugBank), ROC-AUC, PR-AUC, and AP@50 (for TWOSIDES).  The results demonstrate that CSSE-DDI outperforms all other methods across these metrics, highlighting its superior performance in predicting drug-drug interactions.", "section": "4.2 Performance Comparison in S0 settings"}, {"figure_path": "crlvDzDPgM/tables/tables_17_1.jpg", "caption": "Table 2: CSSE-DDI achieves the best predictive performance compared to state-of-the-art baselines in DDI prediction. Average and standard deviation of five runs are reported. For these metrics, higher values always indicate better performance.", "description": "This table presents a comparison of the performance of the proposed CSSE-DDI model against various baseline methods on two benchmark datasets (DrugBank and TWOSIDES) for two different prediction tasks (SO and S1).  The metrics used for evaluation are F1 score, accuracy, Cohen's kappa, ROC-AUC, PR-AUC, and AP@50, depending on the dataset and task.  The results highlight the superior performance of CSSE-DDI across different evaluation metrics.", "section": "4.2 Performance Comparison in S0 settings"}, {"figure_path": "crlvDzDPgM/tables/tables_17_2.jpg", "caption": "Table 2: CSSE-DDI achieves the best predictive performance compared to state-of-the-art baselines in DDI prediction. Average and standard deviation of five runs are reported. For these metrics, higher values always indicate better performance.", "description": "This table compares the performance of the proposed CSSE-DDI model against various baseline models for drug-drug interaction (DDI) prediction on two benchmark datasets, DrugBank and TWOSIDES.  It shows the F1 score, accuracy, Cohen's Kappa, ROC-AUC, PR-AUC and AP@50 for different models across two types of DDI prediction tasks. The results demonstrate CSSE-DDI's superior performance.", "section": "4.2 Performance Comparison in S0 settings"}, {"figure_path": "crlvDzDPgM/tables/tables_18_1.jpg", "caption": "Table 2: CSSE-DDI achieves the best predictive performance compared to state-of-the-art baselines in DDI prediction. Average and standard deviation of five runs are reported. For these metrics, higher values always indicate better performance.", "description": "This table presents a comparison of the performance of the proposed CSSE-DDI model against various baseline models for drug-drug interaction (DDI) prediction on two benchmark datasets (DrugBank and TWOSIDES).  It shows that CSSE-DDI outperforms other methods in terms of F1 score, accuracy, Cohen's Kappa, ROC-AUC, PR-AUC, and AP@50, demonstrating its superior performance in DDI prediction tasks. The results are averaged over five runs with standard deviation included.", "section": "4.2 Performance Comparison in S0 settings"}]