[{"figure_path": "4FwlejUlg5/tables/tables_8_1.jpg", "caption": "Table 1: Comparison of CiVAE with baselines under latent post-treatment bias on various datasets.", "description": "This table compares the performance of the proposed CiVAE model against various baseline methods for causal effect estimation.  The comparison is done across four datasets: two simulated datasets (LatentMediator and LatentCorrelator) and two real-world datasets from a company (Company (Age) and Company (Gender)). The table shows the estimated Average Treatment Effect (ATE) and its error for each method and dataset.  The \"True ATE\" row indicates the ground truth ATE values for each dataset. The results demonstrate the robustness of CiVAE in the presence of latent post-treatment bias, as evidenced by its performance compared to other methods, particularly in the LatentMediator dataset.", "section": "5.2.1 Results and Analysis"}, {"figure_path": "4FwlejUlg5/tables/tables_18_1.jpg", "caption": "Table 2: Comparison of CiVAE with baselines when intra-interactions among M exist.", "description": "This table compares the performance of CiVAE against other baseline methods in a scenario where intra-interactions exist among the latent mediators (M).  It shows the estimated ATE (Average Treatment Effect) and the error for each method across four datasets: LatentMediator, LatentCorrelator, Company (Age), and Company (Gender). The \"True ATE\" row indicates the actual ATE values for each dataset, providing a benchmark against which the methods are evaluated.  Note that intra-interaction means that the latent post-treatment variables (M) influence each other. The error metric used is not specified in the provided context.", "section": "5.2.1 Results and Analysis"}, {"figure_path": "4FwlejUlg5/tables/tables_18_2.jpg", "caption": "Table 3: Comparison of CiVAE with baselines when inter-interactions between C and M exist.", "description": "This table presents a comparison of the proposed CiVAE model against several baseline methods in scenarios involving interactions between latent confounders (C) and latent post-treatment variables (M).  It shows the estimated Average Treatment Effect (ATE) and its error for each method across four different datasets: LatentMediator, LatentCorrelator, Company (Age), and Company (Gender). The true ATE for each dataset is also provided for comparison. The results illustrate CiVAE's performance relative to other methods when there are complex interactions between latent variables influencing the causal effect estimation.", "section": "5.2.1 Results and Analysis"}]