[{"figure_path": "bKuxygBW2Y/tables/tables_6_1.jpg", "caption": "Table 1: State-of-the-art comparison for the surround-view BEV map layout estimation on the nuScenes validation set. MapPrior [17] uses a fixed IoU threshold of 0.5, while other methods apply the threshold that maximizes IoU according to their original settings. In our method, we adopt a constant IoU threshold of 0.5 to ensure a fairer comparison across all existing approaches. We only evaluate different approaches in the camera-only setting.", "description": "This table presents a comparison of the proposed VQ-Map model's performance against other state-of-the-art methods for surround-view BEV map layout estimation on the nuScenes validation set.  The comparison is based on the Intersection over Union (IoU) metric across six map layout classes and the mean IoU.  A consistent IoU threshold of 0.5 is used for a fair comparison, unlike other methods that may have used varying thresholds for optimization.", "section": "4.2 State-of-the-Art Comparison"}, {"figure_path": "bKuxygBW2Y/tables/tables_7_1.jpg", "caption": "Table 2: State-of-the-art comparison for the monocular BEV map layout estimation on the nuScenes and Argoverse validation sets using the IoU (%) metric. Our VQ-Map uses the IoU threshold of 0.5 while other methods choose the best threshold following their original settings. During the evaluation process, grid cells that cannot be reached by LiDAR are ignored [39].", "description": "This table compares the performance of the proposed VQ-Map model against other state-of-the-art methods for monocular BEV map layout estimation.  It uses the Intersection over Union (IoU) metric and shows results on both the nuScenes and Argoverse datasets.  The table highlights VQ-Map's superior performance, especially on the Argoverse dataset.  Note that LiDAR unreachable areas are excluded in the evaluation.", "section": "4.2 State-of-the-Art Comparison"}, {"figure_path": "bKuxygBW2Y/tables/tables_7_2.jpg", "caption": "Table 3: Ablation experiments on some key parameters of the token decoder. We perform ablations on the token decoder layer number M using layer dimension of 512, and ablations on different layer dimension by setting M to 8.", "description": "This table presents the ablation study results on the token decoder's hyperparameters. It shows the impact of varying the number of layers (M) in the token decoder while keeping the layer dimension fixed at 512, and vice-versa. The performance is measured by the mean IoU across six different BEV map layout classes: Drivable, Pedestrian Crossing, Walkway, Stop Line, Carpark, and Divider.", "section": "4.3 Ablations and Analysis"}, {"figure_path": "bKuxygBW2Y/tables/tables_7_3.jpg", "caption": "Table 3: Ablation experiments on some key parameters of the token decoder. We perform ablations on the token decoder layer number M using layer dimension of 512, and ablations on different layer dimension by setting M to 8.", "description": "This table presents the ablation study results for the token decoder module within the VQ-Map model. It explores the impact of two key parameters: the number of layers (M) and the dimension of those layers on the model's performance.  The performance is measured by IoU for different BEV map layout classes (drivable area, pedestrian crossing, etc.) and the mean IoU across these classes.", "section": "4.3 Ablations and Analysis"}, {"figure_path": "bKuxygBW2Y/tables/tables_8_1.jpg", "caption": "Table 4: Ablation for various design choices. Comparing (a) (b) (c) (f) entails assessing different architecture designs, while (d) (e) (f) involves comparing different supervisions during the PV-BEV alignment training. The supervision signals shown in columns (d), (e) and (f) are the explored three kinds of intermediate results in Sec. 3.1. The differences are: (d) uses latent variables that have not been discretized by the codebook, (e) uses the latent variables that have been discretized by the codebook, and (f) uses the codebook indices. (g) sets Naug = 0 in Eq. (4).", "description": "This table presents ablation study results exploring different design choices within the VQ-Map architecture and the impact of varying supervision methods during PV-BEV alignment training. It compares different architecture setups (with and without codebook embedding and sparse features) and shows how different forms of supervision (using latent variables, discretized latent variables, or codebook indices) affect the final performance. The last column tests the impact of removing data augmentation during training.", "section": "4.3 Ablations and Analysis"}, {"figure_path": "bKuxygBW2Y/tables/tables_8_2.jpg", "caption": "Table 5: Computational overhead analysis. Training time is measured in GPU hours using NVIDIA A100 (40G). Our method, even in its tiny version, surpasses the previous SOTA DDP (3 steps). Additionally, the computational cost (MACs) of our tiny version is significantly lower than previous methods. For the standard version of the model, it achieves substantial performance improvements while maintaining a relatively low computational cost.", "description": "This table compares the computational cost and training time of VQ-Map with several state-of-the-art methods.  It shows that VQ-Map, even in its smaller versions (tiny and light), achieves comparable performance while having significantly lower computational cost and training time than previous methods.  The standard version of VQ-Map demonstrates substantial performance improvements with relatively low computational cost.", "section": "4 Experiments"}, {"figure_path": "bKuxygBW2Y/tables/tables_14_1.jpg", "caption": "Table A1: Ablation experiments on some key parameters of the codebook embedding. We perform ablations on the codebook size K using dimension D of 128, and ablations on different dimension D by setting K to 256.", "description": "This table presents the ablation study results on the codebook embedding parameters in the VQ-Map model.  It shows the impact of varying codebook size (K) and embedding dimension (D) on the model's performance across different BEV map layout classes.  The mean IoU (Intersection over Union) is calculated for each configuration to evaluate the overall performance. The results indicate the sensitivity of the model to these hyperparameters.", "section": "C More Experiments"}, {"figure_path": "bKuxygBW2Y/tables/tables_14_2.jpg", "caption": "Table A1: Ablation experiments on some key parameters of the codebook embedding. We perform ablations on the codebook size K using dimension D of 128, and ablations on different dimension D by setting K to 256.", "description": "This table presents the results of ablation studies conducted on the codebook embedding, a key component of the VQ-Map model.  The studies explore different values for the codebook size (K) and dimensionality (D) to determine their impact on model performance, measured by mean Intersection over Union (mIoU) across various classes of BEV map elements. The table shows how the choice of K and D affects the model's performance on different aspects of BEV map layout estimation.", "section": "C More Experiments"}, {"figure_path": "bKuxygBW2Y/tables/tables_14_3.jpg", "caption": "Table 2: State-of-the-art comparison for the monocular BEV map layout estimation on the nuScenes and Argoverse validation sets using the IoU (%) metric. Our VQ-Map uses the IoU threshold of 0.5 while other methods choose the best threshold following their original settings. During the evaluation process, grid cells that cannot be reached by LiDAR are ignored [39].", "description": "This table compares the performance of VQ-Map against other state-of-the-art methods on the nuScenes and Argoverse datasets for monocular BEV map layout estimation.  The metric used is the Intersection over Union (IoU), and the table shows the results for the drivable area, crossing, walkway, and carpark classes.  A consistent IoU threshold of 0.5 was used for VQ-Map to enable a fair comparison, while other methods used their own optimal thresholds.  LiDAR-unreachable areas were excluded from the evaluation.", "section": "4.2 State-of-the-Art Comparison"}]