[{"figure_path": "RXLO4Zv3wB/tables/tables_1_1.jpg", "caption": "Table 1: Comparison of SRCC for blur degradation on the LIVE [21] dataset. DDRblur refers to the deep feature response to blur obtained by manually synthesizing degradation in the pixel domain. DDRblur demonstrates highest correlation with human opinion.", "description": "This table compares the Spearman rank correlation coefficient (SRCC) of different blind image quality assessment (BIQA) metrics with human judgment scores for blurred images from the LIVE dataset.  It highlights the superior performance of the proposed DDRblur metric, which quantifies changes in deep features due to blur, showcasing its strong correlation with human perception of image quality.", "section": "1 Introduction"}, {"figure_path": "RXLO4Zv3wB/tables/tables_4_1.jpg", "caption": "Table 2: SRCC between DDR and image characteristics. With different types of degradation, DDR exhibits varying degrees of correlation with each image characteristic.", "description": "This table shows the Spearman's Rank Correlation Coefficient (SRCC) between the Deep Degradation Response (DDR) and four image characteristics (Complexity, Colorfulness, Sharpness, and Quality).  It demonstrates that the correlation between DDR and these characteristics varies depending on the type of degradation used to calculate DDR (color, noise, blur, exposure, content).  For example, DDR correlated strongly with colorfulness when using color degradation and with sharpness when using blur degradation.", "section": "3.2 DDR as a Flexible Image Descriptor"}, {"figure_path": "RXLO4Zv3wB/tables/tables_6_1.jpg", "caption": "Table 3: Quantitative result of OU-BIQA. Performance comparisons of different OU-BIQA models on eight public datasets using SRCC. The top performer on each dataset is marked in bold.", "description": "This table presents a quantitative comparison of the proposed DDR method against several state-of-the-art Opinion-Unaware Blind Image Quality Assessment (OU-BIQA) methods.  The comparison is done across eight publicly available datasets using the Spearman Rank Correlation Coefficient (SRCC) as the evaluation metric.  The table highlights the superior performance of DDR across diverse datasets, showcasing its robustness and efficacy as an image quality assessment tool.", "section": "4.2 Opinion-Unaware Blind Image Quality Assessment"}, {"figure_path": "RXLO4Zv3wB/tables/tables_7_1.jpg", "caption": "Table 4: Quantitative result of image motion deblurring. Experiment is conducted on datasets with synthetic [51] and real-world [52] blur respectively. The best results are marked in bold. Combining proposed DDR with reconstruction loss leads to result with less degradation and higher fidelity. Our proposed method demonstrates the robustness to model architecture and dataset.", "description": "This table presents the quantitative results of image motion deblurring experiments using two different datasets (GoPro [51] and RealBlur [52]).  It compares the performance of a standard PSNR loss function against variations including other feature domain losses (LPIPS, CTX, PDL, FDL) and the proposed DDR method. The results show that adding DDR to the PSNR loss consistently improves both PSNR and SSIM scores, demonstrating its effectiveness in enhancing image quality and robustness across various model architectures.", "section": "4.3 Image Motion Deblurring"}, {"figure_path": "RXLO4Zv3wB/tables/tables_8_1.jpg", "caption": "Table 5: Quantitative result on real-world SISR dataset [53, 54].", "description": "This table presents the quantitative results of single image super-resolution (SISR) experiments conducted on real-world datasets ([53, 54]).  It compares the performance of different loss functions, including PSNR (Peak Signal-to-Noise Ratio) and SSIM (Structural Similarity Index),  when used for training the NAFNet and Restormer models. The results show the PSNR and SSIM scores achieved by using PSNR alone, PSNR combined with LPIPS, CTX, PDL, FDL, and finally, PSNR combined with the proposed DDR method.", "section": "4.4 Single Image Super Resolution"}, {"figure_path": "RXLO4Zv3wB/tables/tables_9_1.jpg", "caption": "Table 6: Ablation results on GoPro [51] dataset and NAFNet [62].", "description": "This table presents ablation study results focusing on the impact of different factors on the performance of image deblurring using the NAFNet model trained on the GoPro dataset.  The factors varied include the set of degradation types considered (D), the weight of the DDR loss (λd), the backbone network used for feature extraction, and whether degradation adaptation was applied.  The table shows the PSNR and SSIM scores achieved under different configurations, demonstrating the contribution of each component to the overall performance.", "section": "4. Experiments"}, {"figure_path": "RXLO4Zv3wB/tables/tables_9_2.jpg", "caption": "Table 7: Ablation results on opinion unaware blind image quality assessment.", "description": "This table presents the ablation study results for the opinion-unaware blind image quality assessment task. It shows the impact of different factors on the performance of the proposed DDR method, including the selection of degradation types, the backbone architecture, and the usage of degradation adaptation strategy. The results are presented in terms of SRCC scores across four datasets (CSIQ, TID2013, LIVEitw, and KonIQ).", "section": "4.1 Experiment Setting"}, {"figure_path": "RXLO4Zv3wB/tables/tables_15_1.jpg", "caption": "Table 2: SRCC between DDR and image characteristics. With different types of degradation, DDR exhibits varying degrees of correlation with each image characteristic.", "description": "This table presents the Spearman's Rank Correlation Coefficient (SRCC) between the Deep Degradation Response (DDR) and four image characteristics (complexity, colorfulness, sharpness, and quality) for five different degradation types (color, noise, blur, exposure, and content).  It shows how the correlation between DDR and these image attributes changes depending on the type of image degradation considered.", "section": "3.2 DDR as a Flexible Image Descriptor"}]