[{"figure_path": "dRJJt0Ji48/figures/figures_1_1.jpg", "caption": "Figure 1: (a) The figure shows the differences in forecasting results between the CSDI [36] (left) and RATD (right). Due to the very small proportion of such cases in the training set, CSDI struggles to make accurate predictions, often predicting more common results. Our method, by retrieving meaningful references as guidance, makes much more accurate predictions. (b) A comparison between our method's framework(bottom) and the conventional time series diffusion model framework(top). (c) We randomly selected 25 forecasting tasks from the electricity dataset. Compared to our method, CSDI and MG-TSD [9] exhibited significantly higher instability. This indicates that the RATD is better at handling complex tasks that are challenging for the other two methods.", "description": "This figure compares the performance of the proposed RATD model with existing time series diffusion models (CSDI and MG-TSD) on time series forecasting tasks. Subfigure (a) shows that RATD makes much more accurate predictions than CSDI for cases with small proportion in the training set, by retrieving meaningful references. Subfigure (b) illustrates the framework of RATD, which consists of retrieval process and reference-guided diffusion model, comparing it with the conventional framework. Subfigure (c) demonstrates that RATD is more stable in handling complex prediction tasks than CSDI and MG-TSD by showing the mean squared error (MSE) of 25 forecasting tasks on the electricity dataset.", "section": "1 Introduction"}, {"figure_path": "dRJJt0Ji48/figures/figures_4_1.jpg", "caption": "Figure 3: The structure of μθ. (a) The main architecture of μθ is the time series transformer structure that proved effective. (b) The structure of the proposed RMA. We integrate three different features through matrix multiplication.", "description": "This figure shows the architecture of the proposed method's core component: μθ, and its sub-component: Reference Modulated Attention (RMA).  Part (a) illustrates the overall architecture of μθ, showing how time series features are processed through multiple layers (Conv1x1, ReLU, temporal and feature transformers, GAU) to generate the denoised time series. Part (b) details the RMA module, highlighting how it integrates three different kinds of features (time series feature, reference features, and side information) via matrix multiplication before feeding into the subsequent layers.  This integration allows the model to effectively leverage references during the denoising process.", "section": "4.1 Framework Overview"}, {"figure_path": "dRJJt0Ji48/figures/figures_7_1.jpg", "caption": "Figure 4: Visualizations on wind by CSDI, D3 VAE, iTransformer and the proposed RATD (with reference).", "description": "This figure compares the forecasting performance of four different models: CSDI, D3 VAE, iTransformer, and RATD on a wind dataset. Each model's prediction is plotted alongside the ground truth and historical data. The figure showcases that RATD offers more accurate predictions, especially for long-term forecasting, outperforming other models.", "section": "5 Experiments"}, {"figure_path": "dRJJt0Ji48/figures/figures_8_1.jpg", "caption": "Figure 5: The effect of hyper-parameter n and k. Figure 6: Inference time (ms) on the Electricity with different prediction horizon h", "description": "Figure 5 shows the impact of the hyperparameters *n* and *k* on the model's performance.  The left graph displays how the Mean Squared Error (MSE) changes as the number of samples (*n*) in each category of the database increases for different values of *k* (the number of retrieved references).  The right graph shows the inference time in milliseconds (ms) for the Electricity dataset as the prediction horizon (*h*) increases for several different time series forecasting models: RATD, MG-TSD, TimeGrad, SSSD.  The results demonstrate that carefully selecting these hyperparameters and using the proposed RATD model leads to more accurate and efficient predictions compared to baseline methods.", "section": "5.3 Model Analysis"}]