[{"figure_path": "jYypS5VIPj/tables/tables_6_1.jpg", "caption": "Table 1: Performance on Few-shot Semantic Segmentation datasets of Pascal-5¹, COCO-20, FSS-1000, and LVIS-92¹. Gray means the in-domain trained results. The best results are shown in bold.", "description": "This table presents a comparison of the proposed method's performance against several state-of-the-art specialist and generalist models on four few-shot semantic segmentation datasets: Pascal-5, COCO-20, FSS-1000, and LVIS-92.  The results are shown for both 1-shot and 5-shot settings. The best performance for each dataset and setting is highlighted in bold, and in-domain trained results are indicated in gray. This table highlights the superior performance of the proposed method compared to existing methods across various datasets and settings.", "section": "5 Experimental Results"}, {"figure_path": "jYypS5VIPj/tables/tables_6_2.jpg", "caption": "Table 2: Performance on One-shot Part Segmentation datasets and Cross Domain Few-shot Semantic Segmentation datasets. The best results are shown in bold.", "description": "This table presents the performance comparison of different methods on one-shot part segmentation tasks (PASCAL-Part and PACO-Part) and cross-domain few-shot semantic segmentation tasks (Deepglobe, ISIC, and iSAID-5\").  The results highlight the proposed method's superior performance across various datasets and its ability to generalize across different domains. Specialist models are compared against generalist models, and the best results (mIoU) are shown in bold.  The table showcases the effectiveness of the proposed approach in various challenging scenarios.", "section": "5 Experimental Results"}, {"figure_path": "jYypS5VIPj/tables/tables_7_1.jpg", "caption": "Table 3: Ablation study of Point Selection.", "description": "This table presents the ablation study of different point selection strategies. It shows the impact of using different similarity maps (Smean, Smax, Smean) and the parameter-free selection of top N points on the performance (mIoU). The results demonstrate that combining Smean and Smax, and selecting the top N points based on similarity improves the performance.", "section": "5.4 Ablation Study"}, {"figure_path": "jYypS5VIPj/tables/tables_7_2.jpg", "caption": "Table 4: Ablation study of PMC and Post-Gating.", "description": "This table presents the ablation study results for the Point-Mask Clustering (PMC) and Post-Gating modules.  It shows the performance (mIoU) on COCO-20 and LVIS-92 datasets with different configurations of the modules, specifically evaluating the impact of using strong or weak connectivity in the graph, and the inclusion of positive and overshooting gating.  The results highlight the contribution of each component to the overall performance.", "section": "5.4 Ablation Study"}, {"figure_path": "jYypS5VIPj/tables/tables_7_3.jpg", "caption": "Table 5: Ablation study of positive gating on each cluster. M.G. represents the Mask Growth algorithm.", "description": "This table presents the ablation study results of the positive gating strategy on each cluster, using the Mask Growth algorithm. It compares different strategies ('Sum' and 'Num') in terms of their impact on the model's performance, measured by mIoU on COCO-20 and PASCAL-Part datasets.  The 'M.G.' column indicates whether the Mask Growth algorithm was used. The results show that the 'Num' strategy generally outperforms the 'Sum' strategy, suggesting its effectiveness in enhancing the model's accuracy.", "section": "5 Experimental Results"}, {"figure_path": "jYypS5VIPj/tables/tables_7_4.jpg", "caption": "Table 6: Ablation on the strategies of Self-Consistency measurement.", "description": "This table presents an ablation study on different strategies for self-consistency measurement in the proposed method. It compares the mean Intersection over Union (mIoU) achieved using different strategies: None (baseline), Point Similarity, Mask Average Pooling (MAP) Similarity, Mean Similarity without distance consideration, and Mean Similarity (Ours, the proposed method). The results show that using Mean Similarity with the proposed distance consideration achieves the best performance, outperforming the baseline by 1.6% mIoU.", "section": "5.4 Ablation Study"}, {"figure_path": "jYypS5VIPj/tables/tables_17_1.jpg", "caption": "Table 8: Evaluation of our approach with different sizes of SAM and DINOv2.", "description": "This table presents the performance of the proposed approach and the Matcher baseline using different sizes of the SAM and DINOv2 models.  The results are reported in terms of mean Intersection over Union (mIoU) on three benchmark datasets: COCO-20, FSS-1000, and LVIS-92. The table shows that the performance improves with larger model sizes for both SAM and DINOv2, and that the proposed approach consistently outperforms the Matcher baseline across all model sizes and datasets.", "section": "5 Experimental Results"}, {"figure_path": "jYypS5VIPj/tables/tables_17_2.jpg", "caption": "Table 9: Detail results of Pascal-5i.", "description": "This table presents a detailed breakdown of the performance of different methods on the Pascal-5i dataset.  It shows the mean Intersection over Union (mIoU) for each of the four folds within the dataset for both 1-shot and 5-shot scenarios.  The methods compared include AMFormer, Matcher, and the proposed 'Ours' method. This granular level of detail allows for a deeper understanding of the model's performance consistency across different subsets of the dataset.", "section": "5 Experimental Results"}, {"figure_path": "jYypS5VIPj/tables/tables_17_3.jpg", "caption": "Table 10: Detail results of COCO-20.", "description": "This table shows the detailed performance of different methods on the COCO-20 dataset for both 1-shot and 5-shot settings.  The results are broken down by fold (fold0-fold3) to provide a more granular view of performance.  It compares the proposed method against AMFormer and Matcher, illustrating its superior performance across different folds and scenarios.", "section": "5 Experimental Results"}, {"figure_path": "jYypS5VIPj/tables/tables_17_4.jpg", "caption": "Table 1: Performance on Few-shot Semantic Segmentation datasets of Pascal-5¹, COCO-20, FSS-1000, and LVIS-92¹. Gray means the in-domain trained results. The best results are shown in bold.", "description": "This table presents a comparison of different methods on four few-shot semantic segmentation datasets: Pascal-5, COCO-20, FSS-1000, and LVIS-92.  For each dataset, it shows the performance (1-shot and 5-shot) of various methods, distinguishing between specialist and generalist models.  The best performance for each setting is highlighted in bold. Gray values indicate in-domain training.", "section": "5 Experimental Results"}, {"figure_path": "jYypS5VIPj/tables/tables_17_5.jpg", "caption": "Table 2: Performance on One-shot Part Segmentation datasets and Cross Domain Few-shot Semantic Segmentation datasets. The best results are shown in bold.", "description": "This table presents the performance comparison of different methods on One-shot Part Segmentation tasks (PASCAL-Part and PACO-Part) and Cross-Domain Few-shot Semantic Segmentation tasks (Deepglobe, ISIC, and iSAID-5).  It shows the mean Intersection over Union (mIoU) for each dataset and each method, highlighting the best performing methods in bold. The table demonstrates the generalization capabilities of the proposed approach across various datasets and segmentation tasks.", "section": "5 Experimental Results"}, {"figure_path": "jYypS5VIPj/tables/tables_17_6.jpg", "caption": "Table 13: Detail results of iSAID-5¹.", "description": "This table presents the detailed performance results of the proposed approach on the iSAID-5¹ dataset. It breaks down the mean Intersection over Union (mIoU) scores across three folds for both 1-shot and 5-shot semantic segmentation scenarios, allowing for a comprehensive evaluation of the model's performance in different settings.", "section": "5 Experimental Results"}, {"figure_path": "jYypS5VIPj/tables/tables_18_1.jpg", "caption": "Table 14: Ablation study of pivots and combination operations in Positive Gating.", "description": "This table presents an ablation study on the different strategies used in the Positive Gating module within the proposed approach.  It explores the impact of using either the median of the mean negative similarity map (S_mid) or the mean negative similarity map itself (S_mean) as pivots for determining the positive masks. It also investigates the effect of combining these two pivots using both addition (+) and multiplication (×) operations. The results are shown for the COCO-20 dataset, indicating which combination yields the best performance.", "section": "5.4 Ablation Study"}, {"figure_path": "jYypS5VIPj/tables/tables_18_2.jpg", "caption": "Table 15: Ablation study of different strategies for Positive Gating of the masks.", "description": "This table presents the ablation study of different strategies used for positive gating in the proposed method.  It compares the performance (mIoU) on four different datasets (COCO-20, LVIS-92, PASCAL-Part, and PACO-Part) using two strategies: 'Union' and 'Mask Growth'. The 'Union' strategy simply judges the union mask, while the 'Mask Growth' strategy utilizes a more sophisticated algorithm.", "section": "5.4 Ablation Study"}]