[{"figure_path": "cS63YtJ49A/figures/figures_1_1.jpg", "caption": "Figure 1: Different prompts may have different denoising paths to generate the high-quality image. For Prompt 1, we only need 20 steps out of 50 steps for noise predictions to generate an almost lossless image, while for Prompt 2, we need 26 steps out of 50 steps to achieve an almost lossless image.", "description": "This figure compares the denoising paths for two different prompts using the Stable Diffusion XL model.  It shows that the number of steps required to generate a high-quality image varies depending on the prompt. Prompt 1 requires fewer steps (20 out of 50) compared to Prompt 2 (26 out of 50), illustrating the need for a prompt-adaptive acceleration method.", "section": "1 Introduction"}, {"figure_path": "cS63YtJ49A/figures/figures_2_1.jpg", "caption": "Figure 2: Denoising process of the proposed AdaptiveDiffusion: We design a third-order estimator (Refer to Sec. 3.3 for details), which can find the redundancy between neighboring timesteps, and thus, the noise prediction model can be skipped or inferred according to the indicate from the estimator, achieving the adaptive diffusion process. Note that the timestep and text information embeddings are not shown for the sake of brevity.", "description": "This figure illustrates the process of the proposed AdaptiveDiffusion method.  It shows how a third-order estimator is used to determine if noise prediction steps can be skipped (reusing previous results) or if new calculations are needed.  This adaptive approach improves efficiency while maintaining the quality of the final denoised output. The figure highlights the key components: noise prediction model, scheduler, latent cache, third-order estimator, and noise cache.", "section": "3 The Proposed Approach"}, {"figure_path": "cS63YtJ49A/figures/figures_3_1.jpg", "caption": "Figure 3: Different update strategies. (a) The default SDXL [32] samples 50 steps of noise prediction followed by the latent update process. (b) Our AdaptiveDiffusion skips 25 steps of noise prediction according to the third-order estimator, while the latent is fully updated at all 50 steps. (c) SDXL samples 25 steps of the noise prediction and latent update process. (d) The default SDXL skips 25 steps of both noise prediction and latent update from its sampled 50 steps.", "description": "This figure compares four different denoising strategies in diffusion models.  (a) shows the standard full-step approach. (b), (c), and (d) demonstrate different acceleration methods: (b) AdaptiveDiffusion skips some noise prediction steps but maintains full latent updates; (c) shows a simple halving of both noise prediction and latent update steps in SDXL; and (d) shows a halving of noise prediction steps but full latent update steps in SDXL.  The figure visually compares the output image quality for each method.", "section": "3.2 Error Estimation of the Step Skipping Strategy"}, {"figure_path": "cS63YtJ49A/figures/figures_4_1.jpg", "caption": "Figure 4: The relation between order differential distributions and the searched optimal skipping path for one prompt. (a) The 1st-order noise differential distribution of the original full-step generation shows no relation with the optimal skipping path. (b) The 1st latent differential distribution indicates the distribution of the optimal skipping path but with no explicit mapping with skipping decisions, while the relative 2nd-order latent differential distribution shows a certain skipping signal in its fluctuation, but this signal is buried in the unstable magnitude. (c) The relative 3rd-order latent differential distribution shows a clearer signal for skipping decisions.", "description": "This figure examines the relationship between different order differential distributions (noise and latent) and the optimal skipping path determined through a greedy search algorithm for a single prompt during the denoising process.  It demonstrates that while lower-order differences show weak or no correlation with optimal skipping, the relative 3rd-order latent difference provides a much clearer signal indicating which steps can be skipped during denoising.", "section": "3.3 Third-order Estimation Criterion"}, {"figure_path": "cS63YtJ49A/figures/figures_5_1.jpg", "caption": "Figure 5: The effectiveness of the proposed third-order estimator. (a) The third-order estimated skipping path shares a similar distribution with the optimal skipping path. (b) The latent error between the full-step update path and the estimated skipping path. (c) The χ² stats and p-value between the greedy searched paths and the third-order estimated paths at different skipping targets.", "description": "This figure demonstrates the effectiveness of the proposed third-order estimator for predicting the optimal skipping path in AdaptiveDiffusion.  Subfigure (a) visually compares the third-order estimated path with the optimal path found through a greedy search, showing a close agreement in their distribution. Subfigure (b) shows the latent error between using the full-step method and using the estimated skipping path, demonstrating that the error remains relatively low throughout the denoising process. Finally, subfigure (c) presents a statistical analysis using χ² tests and p-values to show the high correlation between the estimated and optimal skipping paths for a moderate number of skipping steps, validating the estimator's ability to accurately predict skipping decisions.", "section": "3.3 Third-order Estimation Criterion"}, {"figure_path": "cS63YtJ49A/figures/figures_8_1.jpg", "caption": "Figure 1: Different prompts may have different denoising paths to generate the high-quality image. For Prompt 1, we only need 20 steps out of 50 steps for noise predictions to generate an almost lossless image, while for Prompt 2, we need 26 steps out of 50 steps to achieve an almost lossless image.", "description": "This figure compares the denoising paths for two different prompts using the Stable Diffusion XL model.  Each path represents the steps taken during the image generation process, with each step involving a noise prediction.  The figure demonstrates that different prompts may require a different number of steps to reach a similar final image quality. Prompt 1 required fewer steps than Prompt 2. The figure also shows the LPIPS and PSNR scores for each path to indicate the similarity between the generated images and the original image.", "section": "1 Introduction"}, {"figure_path": "cS63YtJ49A/figures/figures_8_2.jpg", "caption": "Figure 1: Different prompts may have different denoising paths to generate the high-quality image. For Prompt 1, we only need 20 steps out of 50 steps for noise predictions to generate an almost lossless image, while for Prompt 2, we need 26 steps out of 50 steps to achieve an almost lossless image.", "description": "This figure compares denoising paths for two different prompts using SDXL.  It shows that different prompts require a different number of denoising steps to produce high-quality images.  This illustrates the need for an adaptive approach, as some prompts may require fewer steps than others to achieve similar results.", "section": "1 Introduction"}, {"figure_path": "cS63YtJ49A/figures/figures_8_3.jpg", "caption": "Figure 8: (a) Skipping paths under different skipping targets obtained by the greedy search algorithm. (b) Skipping paths under different skipping thresholds by the third-order estimator. (c) The frequency distribution of the skipping number of noise update steps for SDXL generating images on MS-COCO 2017 benchmark.", "description": "This figure visualizes the skipping paths determined by two different methods (greedy search and the proposed third-order estimator) and shows the distribution of the number of skipped noise update steps.  The greedy search method aims to find the optimal skipping path, while the third-order estimator provides a more efficient way to predict skipping steps.  The distribution shows how frequently different numbers of steps were skipped during image generation.", "section": "Visualization Results"}, {"figure_path": "cS63YtJ49A/figures/figures_20_1.jpg", "caption": "Figure 1: Different prompts may have different denoising paths to generate the high-quality image. For Prompt 1, we only need 20 steps out of 50 steps for noise predictions to generate an almost lossless image, while for Prompt 2, we need 26 steps out of 50 steps to achieve an almost lossless image.", "description": "This figure demonstrates that different prompts may require different numbers of denoising steps to produce high-quality images.  It shows two examples with different prompts, illustrating how many steps were skipped while still maintaining high image quality.", "section": "1 Introduction"}, {"figure_path": "cS63YtJ49A/figures/figures_20_2.jpg", "caption": "Figure 7: Qualitative results of image-to-video generation task using I2VGen-XL on AIGCBench.", "description": "This figure shows a qualitative comparison of image-to-video generation results using three different methods: the original method, DeepCache, and the proposed AdaptiveDiffusion method.  Each method's output is shown for different frames (6, 11, and 16) of a generated video.  The goal is to demonstrate the quality and speed improvements achieved by AdaptiveDiffusion, showcasing comparable visual quality to the original method but with significantly faster generation speeds compared to DeepCache. The prompt used for video generation is: \"Amidst the narrow alleys of a medieval town, a valiant knight is secretly whispering to animals, captured in the style of an oil painting.\"", "section": "4.2.2 Results on Video Generation"}]