[{"type": "text", "text": "Toward Self-Improvement of LLMs via Imagination, Searching, and Criticizing ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Ye Tian1,2,∗ Baolin Peng1,∗ Linfeng Song1,∗ Lifeng $\\mathbf{Jin^{1}}$ , Dian $\\mathbf{Y_{u}}^{1}$ , Lei Han2 ", "page_idx": 0}, {"type": "text", "text": "Haitao Mi1†, Dong $\\mathbf{Y}\\mathbf{u}^{1}$ 1Tencent AI Lab, Bellevue, WA 2Tencent Robotics X {baolinpeng,lfsong,lifengjin,yudian,haitaomi,dyu}@global.tencent.com {yaptian,lxhan}@tencent.com ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Despite the impressive capabilities of Large Language Models (LLMs) on various tasks, they still struggle with scenarios that involves complex reasoning and planning. Self-correction and self-learning emerge as viable solutions, employing strategies that allow LLMs to refine their outputs and learn from self-assessed rewards. Yet, the efficacy of LLMs in self-refining its response, particularly in complex reasoning and planning task, remains dubious. In this paper, we introduce ALPHALLM for the self-improvements of LLMs, which integrates Monte Carlo Tree Search (MCTS) with LLMs to establish a self-improving loop, thereby enhancing the capabilities of LLMs without additional annotations. Drawing inspiration from the success of AlphaGo, ALPHALLM addresses the unique challenges of combining MCTS with LLM for self-improvement, including data scarcity, the vastness search spaces of language tasks, and the subjective nature of feedback in language tasks. ALPHALLM is comprised of prompt synthesis component, an efficient MCTS approach tailored for language tasks, and a trio of critic models for precise feedback. Our experimental results in mathematical reasoning tasks demonstrate that ALPHALLM significantly enhances the performance of LLMs without additional annotations, showing the potential for self-improvement in LLMs. The code is available at https://github.com/YeTianJHU/AlphaLLM. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "LLMs, trained on trillions of tokens with billions of parameters have shown unparalleled capabilities in a wide range of natural language processing tasks (Touvron et al., 2023b; Team et al., 2023; OpenAI, 2023). Nevertheless, they continue to face challenges in scenarios requiring complex reasoning and strategic planning (Valmeekam et al., 2022; Stechly et al., 2024). While advanced prompting approaches such as Chain, Tree, Graph-of-Thought (Wei et al., 2022; Yao et al., 2024; Besta et al., 2024; Ding et al., 2023), it remains essential to fine-tune LLMs using a substantial volume of high-quality, supervised data to fundamentally improve the model performance (Nye et al., 2021; Lewkowycz et al., 2022; Chung et al., 2022). This methodology is inherently limited by the scope and quality of data that humans can provide. ", "page_idx": 0}, {"type": "text", "text": "Considering these challenges, the concept of self-correction and self-learning have been proposed as promising solutions (Madaan et al., 2024; Saunders et al., 2022; Chen et al., 2024). Within these framework, LLMs typically operate by employing two main strategies: 1) they continuously refine their responses based on the feedback of their past responses, and 2) they extensively sample responses then learn from preferences judged by itself as reward models with PPO or DPO (Yuan et al., 2024a,b; Chen et al., 2024). However, it remains a matter of ongoing research whether LLMs can effectively critique their own outputs to either enhance response quality or apply a scalar reward to indicate the quality of responses, especially in contexts demanding intricate planning and reasoning (Valmeekam et al., 2022; Stechly et al., 2024; Huang et al., 2023; Hong et al., 2023). On the other hand, advanced search algorithms such as MCTS, combined with reinforcement learning, have enabled models to learn from self-play and achieve human parity or even surpass human performance in complex tasks such as the game of Go (Silver et al., 2016, 2017). This naturally raises a question: is it viable to leverage the strengths of MCTS alongside LLMs to inaugurate a novel paradigm of self-improving? More precisely, could the assimilation of MCTS empower LLMs to more effectively explore better responses, guided by strategic signals, and subsequently optimize these responses to enhance overall performance? ", "page_idx": 0}, {"type": "image", "img_path": "tPdJ2qHkOB/tmp/48cb7a64c352c19fe2a0ff735ba03a12d1b3d7985911774a609944290fb48fec.jpg", "img_caption": ["Figure 1: Imagination-Searching-Criticizing self-improvement loop: Imagination component synthesizes prompts as new learning examples, with MCTS searching better trajectories guided by signals from critics for policy improving. "], "img_footnote": [], "page_idx": 1}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "To answer this question, we begin with a systematic examination of AlphaGo, identifying three critical aspects for its success: (i) The large volume of data, including self-play data. $(i i)$ The use of tree search, which facilitates the exploration of potential moves through statistical sampling of the large search space. (iii) Accurate and unambiguous environment feedback; the direct and accurate feedback (win or loss) provided by the game of Go offers a clear and unequivocal learning signal (Silver et al., 2017). The integration of MCTS with LLMs for self-improvement has several challenges: (i) Limited Data: High-quality annotated data for LLMs is generally scarce. Furthermore, how to construct of synthetic data for LLMs training, similar to AlphaGo’s self-play data, remains unclear. (ii) Search Efficiency: The vast number of potential token combinations in natural language tasks results in an exponentially large search space, posing a significant challenge to the efficiency of MCTS (Ramamurthy et al., 2022). (iii) Imperfect Feedback: In contrast to the clear win/loss feedback in Go, feedback in natural language tasks is often subjective and nuanced, without a straightforward measure of success. ", "page_idx": 1}, {"type": "text", "text": "In this paper, we introduce ALPHALLM, an imagination-searching-criticizing framework designed for the self-improvement of LLMs . ALPHALLM consists of three key components, as illustrated in Figure 1. First, an imagination component is designed to synthesize prompts, alleviating the issues of data scarcity. Second, we propose $\\eta\\mathbf{M}\\mathbf{C}\\mathrm{T}\\mathbf{S}$ tailored for efficient searching in language tasks. Particularly, it has been show that planning at multiple levels of temporal abstraction is critical for RL problems with a long horizon and large action space (Sutton et al., 1999b; Peng et al., 2017; Luketina et al., 2019). As such, we propose formulating the text generation process as options over a Markov Decision Process (MDP) problem, where each option represents the generation of a collection of tokens for a specific subtask, similar to the concept of chains in chain-of-thought prompting. This formulation improves search efficiency by substantially reducing the search depth. Additionally, we propose the use of state merge and adaptive branching factors to further enhance search efficiency by balancing the trade-off between search width and depth. Lastly, since accurate feedback is crucial to the success of MCTS, we introduce a trio of critic models to guide $\\eta\\mathbf{M}\\mathbf{C}\\mathrm{T}\\mathbf{S}$ , including a value function for estimating expected rewards, a process reward model for assessing node correctness, and an outcome reward model for evaluating the overall trajectory. For complex tasks with which LLMs struggle assessing such as arithmetic computation and code execution, to ensure the accuracy of feedback, we augment the critics with the capacity to make dynamic decisions on which tools to use, when to use them, and how to use them effectively. After $\\eta_{\\mathrm{MCTS}}$ stage, we collect the trajectory with the largest reward from the critic models as the training examples to improve LLMs. ", "page_idx": 1}, {"type": "text", "text": "", "page_idx": 2}, {"type": "text", "text": "The experimental results on mathematical reasoning tasks demonstrate that ALPHALLM can efficiently search for better responses and use them to improve LLMs’ performance, forming an effective self-improving loop. Notably, based on Llama-2-70b and WizardMath-70B-V1.0, ALPHALLM can improve its performance from 57.8 to 92.0 on GSM8K and from 20.7 to 51.0 on MATH, performing comparably to GPT-4. ", "page_idx": 2}, {"type": "text", "text": "2 Related Work ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Search with LLM Effective search strategy has been shown crucial for tasks that involve complex reasoning and planning, such as go (Silver et al., 2016) and math reasoning (Cobbe et al., 2021; Hendrycks et al., 2021). For math reasoning tasks, various search methods have been studied. One direction of research (Zhu et al., 2024; Xie et al., 2024) designed beam search with dynamic pruning, where beam items of low quality are pruned. Another line of work (Yao et al., 2024; Long, 2023; Besta et al., 2024; Hao et al., 2023; Feng et al., 2023) maintains a tree or a graph that represents the current progress of solving the input question where potential branches are iteratively expanded. Both our approach and Feng et al. (2023) are based on the MCTS algorithm, while one main difference is how to define a search step: Feng et al. (2023) fix a search step to be either a token or a sentence, while our approach is more flexible on deciding steps. We have also carefully designed the MCTS process, incorporating multiple critique signals to guide the search more effectively and introducing adaptive search parameters for improved state exploration. As the result, our approach achieves much better performances. ", "page_idx": 2}, {"type": "text", "text": "LLM Self-improving Being a key to the success of scalable oversight (Bowman et al., 2022), self-improving for LLM aims to align the LLM to human preference and values mainly using the supervision from the knowledge inside the LLM (Zelikman et al., 2022, 2024). One crucial part of self-improving is how to obtain reliable signal of critique to distinguish between good responses from the LLM and bad ones. Initial work (Bai et al., 2022; Wang et al., 2022) first asks the LLM to generate input queries of diverse tasks and the corresponding outputs. They then rely on hand-crafted heuristic rules to filter out redundant or low-quality data pairs (e.g. the query is too long or too short). Since it is non-trivial to compose effective heuristic rule, later work (Sun et al., 2023; Li et al., 2023; Guo et al., 2024) proposes a few general principles or judging criteria and ask the LLM itself to evaluate the quality its responses based on these guidance, hoping that LLMs can automatically designate these principles into each data point to better guide data filtering. However, this requires LLMs to have strong abilities to apply these principles for each specific case and make correct judgements. Different from previous work, we propose to leverage the supervision from MCTS for LLM self-improvement: taking the outputs of MCTS to continue train the LLM. This is because the outputs from MCTS are usually in much better quality then standard nucleus sampling, and the large gap ensure that the LLM can self improve. ", "page_idx": 2}, {"type": "text", "text": "3 Preliminaries ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "3.1 Problem Formulation ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "In this paper, we consider a LLM characterized by probability $p_{\\theta}$ and denoted as policy $\\pi_{\\theta}$ . It takes a sequence $\\pmb{x}=[x_{1},\\cdot\\cdot\\cdot\\,,x_{n}]$ as input, which is typically referred as prompt, to generate the response $\\pmb{y}=[y_{1},\\cdot\\cdot\\cdot\\,,\\bar{y}_{m}]$ . In the context of LLMs, each $x_{i}$ and $y_{i}$ represents a token from a pre-defined vocabulary. The policy $\\pi_{\\theta}$ operates in an autoregressive manner, where each token is generated sequentially, relying solely on the context provided by the previously generated tokens. The policy therefore constitutes a Markov process in which the conditional probability distribution $p_{\\theta}(\\pmb{y}|\\bar{\\pmb{x}})$ can be decomposed and expressed with the chain rule as $\\begin{array}{r}{p_{\\theta}({\\pmb y}|{\\pmb x})=\\stackrel{-}{\\prod}_{i=1}^{m}p_{\\theta}\\bar{(}y_{i}|{\\pmb x},{\\pmb y}_{<i})}\\end{array}$ . ", "page_idx": 2}, {"type": "text", "text": "With this property, the text generation task can be formulated as an Markov Decision Process (MDP) problem consisting of $(S,{\\mathcal{A}},T,R,\\gamma)$ in which, $s_{t}\\in S$ represents the context information of current trajectory, i.e., current status of the generation process, e.g., a partial response to a prompt; $a_{t}\\in\\mathcal A$ denotes a single action or sampled token from the vocabulary, leading to a transition to a new state $s_{t+1}$ , by concatenating $s_{t}$ and $a_{t}$ ; $r_{t}=R(s_{t},a_{t})$ manifest the evaluation of the generation to the prompt, reflecting the desirability or preferences of each state-action pair. ", "page_idx": 2}, {"type": "text", "text": "", "page_idx": 3}, {"type": "text", "text": "This MDP framework sets the stage for applying Reinforcement Learning (RL) methods to optimize the policy $\\pi_{\\theta}$ aiming to maximize the expected cumulative reward $R$ . Base on these setups, we describe the self-improving problem. Given a LLM $\\pi_{\\theta}$ and an initial dataset $\\mathcal{D}^{0}$ , which consists of $N$ expert-generated prompt-response pairs $\\{(\\pmb{x}_{i}^{0},\\pmb{y}_{i}^{0})~|~i\\in[N]\\}$ , the goal of self-improving is to iteratively refine $\\pi_{\\theta}$ to maximize the reward. The refinement process includes learning from synthesized prompts and corresponding responses. These responses are obtained using an advanced search algorithm that navigates the space of possible responses to maximize the expected reward. The detailed process is described in Algorithm 1 in Appendix. The primary challenges in forming an effective self-improving loop lie in synthesizing suitable prompts, efficiently searching over a vast action space, and obtaining precise feedback, which will be discussed in $\\S4$ . ", "page_idx": 3}, {"type": "text", "text": "3.2 Monte Carlo Tree Search ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "MCTS is a sampling-based search algorithm for policy optimization in decision-making problems. It would iteratively build a search tree, by repeating four phases: selection, expansion, evaluation, and backpropagation. In the selection phase, it would recursively select the children from the root node by Upper Confidence Bound (UCB) (Auer et al., 2002), $\\begin{array}{r}{U C B(i)=w_{i}+C*\\sqrt{2*\\ln\\frac{N_{i}}{n_{i}}}}\\end{array}$ i, where ni and $N_{i}$ are the visit counts for the node $i$ and its parent respectively, $C$ represents a hyperparameter balancing exploration and exploitation, and the $w_{i}$ is the average value of all descendant nodes of $i$ . ", "page_idx": 3}, {"type": "text", "text": "4 ALPHALLM ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "4.1 Overview ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "The architecture of ALPHALLM is depicted in Figure 1, comprising three key components. Firstly, the imagination component is tasked with synthesizing prompts as learning examples. Secondly, an efficient search component, named $\\eta\\mathbf{M}\\mathbf{C}\\mathrm{T}\\mathbf{S}$ , is proposed to search high-quality trajectories for optimizing the policy. Lastly, the search process is guided by critics specifically designed to provide reliable signals. ", "page_idx": 3}, {"type": "text", "text": "4.2 Data Synthesizing ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Let $\\mathcal{D}^{0}=\\{(\\pmb{x}_{i},\\pmb{y}_{i})~|~i\\in[N]\\}$ denote the initial dataset consisting of $N$ expert-generated promptresponse pairs. The data synthesizing process aims to expand this dataset by generating a set of synthesized prompts $\\bar{\\mathcal{D}^{1}}=\\{(\\pmb{x}_{i}^{1},\\cdot\\cdot\\cdot)\\mid i\\in[N]\\}$ . The generation of each synthesized prompt $\\pmb{x}_{i}^{1}$ can be mathematically described as a transformation $g$ applied to one or more examples from $\\mathcal{D}^{0}$ , $\\pmb{x}_{i}^{1}=g(\\pmb{x}_{i_{1}}^{0},\\cdot\\cdot\\cdot\\mathrm{~,~}\\pmb{x}_{i_{m}}^{0},\\mpb{\\pi}^{0})$ m, π0) where xi01, · · · , xi0 are selected examples from $\\mathcal{D}^{0}$ . The transformation function $g$ controls the synthesis process, which can be a learnable function, manually defined heuristic rules, a strong LLM or the policy model itself $\\pi^{0}$ equipped with data synthesis instructions. The data synthesizing process aims to enrich the diversity and complexity presented for the training of the policy model. Among various strategies, such as Self-instruct (Wang et al., 2022), Evol-instruct ${\\mathrm{\\DeltaXu}}$ et al., 2023), we opt for a method akin to that described in Yu et al. (2023). ", "page_idx": 3}, {"type": "text", "text": "4.3 $\\eta\\mathbf{M}\\mathbf{C}\\mathbf{T}\\mathbf{S}$ ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "4.3.1 Option-level MCTS ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "When applying MCTS to LLMs, it is natural to perform token-level search, where each token is considered as an action (Liu et al., 2023). However, the substantial vocabulary size typical of LLMs presents a significant challenge i.e., conducting a deep search in such a vast space becomes increasingly complex as the search space expands exponentially. To mitigate this, some efforts proposed a sentence-level search, treating each sentence or step as a search node (Feng et al., 2023). While this method reduces the search space, it might compromise the flexibility and effectiveness of applying MCTS to LLMs, which is particularly true for tasks where subtle variations in token can dramatically impact the outcome, or where a more comprehensive search beyond a sentence is necessary. ", "page_idx": 3}, {"type": "table", "img_path": "tPdJ2qHkOB/tmp/99fee808b947eb7685d73b56d615ffb2278968bf393f244e5c18a071e4cb1cd3.jpg", "table_caption": ["Table 1: Comparative illustration of token-level, sentence-level, and option-level MCTS search nodes. $y$ denotes a token sampled from the policy model. The arrow $\\rightarrow$ represents the transition from one search node to the subsequent node within the search process. "], "table_footnote": [], "page_idx": 4}, {"type": "text", "text": "Inspired by Sutton et al. (1999a); De Waard et al. (2016), we use the term option as a search node and propose option-level MCTS where each option represents a sequence of tokens, which can range from multiple tokens to several sentences. A comparisons of different levels search is listed in Table 1. Mathematically, an option $o\\,=\\,\\langle\\mathcal{T},\\pi,\\beta\\rangle$ , where $\\mathcal{T}\\subseteq\\mathcal{S}$ is a set of initial states for the option; $\\pi:S\\times A\\to{\\mathit{\\dot{\\lbrack}0,1\\rbrack}}$ is a policy to generate actions, which in our case is a LLM; and $\\beta:S^{+}\\rightarrow[0,1]$ is the termination function. Starting from a state $s_{t}$ , we can choose all the options for which $s_{t}\\in\\mathcal{T}$ . Once an option is chosen, the policy $\\pi$ will generate actions for several steps until the option terminates according to the termination function $\\beta$ . The option-level MCTS consists of stages including selection, expansion, simulation, and backpropagation. The option-level formulation offers more flexibility compared to the sentence-level, as a new line can be treated as a special case of the termination function, as demonstrated in Table 1. Additional detailed steps of the option-level MCTS can be found in Appendix A.2. ", "page_idx": 4}, {"type": "text", "text": "4.3.2 Importance-Based Adaptive Branching ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "In previous works related to option/sentence level tree search (Feng et al., 2023; Yao et al., 2024), it was a common practice to assume that each node in the tree has the same predefined width, i.e., branching factor. This assumption was due to the fact that unlike token-level MCTS with a limited action space, the sample space at the option-level is exceedingly large, with an unlimited number of token combinations. As a result, it was necessary to set a predefined maximum width for each node. However, this predefined branching factor is hard to set, as an improper choice can lead to a search tree that is either too shallow or too thin, resulting in an inefficient exploration of the search space. ", "page_idx": 4}, {"type": "text", "text": "To quantify the error induced by the branching factor limit, we defined the branching error $E_{\\phi}(t)$ . For a node $t$ with a branching factor of $m_{t}$ , it aims to use the $m_{t}$ child options $\\pmb{o}_{t}^{i}\\sim\\mathcal{D}_{t}^{c h i l d r e n}$ (where $i\\,\\in\\,\\{1,\\dots,m_{t}\\})$ to represent all possible options. Consequently, for a legal option $o_{t}^{j}\\sim\\pi(s_{t})$ from the option space, we can calculate the minimal value difference between it and the $m_{t}$ existing options, which captures the error associated with representing other possible options using the $m_{t}$ available options. It can be formulated as $\\begin{array}{r}{{\\cal E}_{\\phi}(t)=\\mathbb{E}_{o_{t}^{j}\\sim\\pi(s_{t})}[\\operatorname*{min}_{o_{t}^{i}}|v_{\\phi}^{\\pi}([s_{t},o_{t}^{j}])-v_{\\phi}^{\\pi}([s_{t},o_{t}^{i}])|]}\\end{array}$ , where $v_{\\phi}^{\\pi}$ is the value function which will be detailed in $\\S4.4$ . Here we define the importance of node $s_{t}$ as $\\begin{array}{r}{I(s_{t})=\\operatorname*{max}_{{\\pmb o}_{t}^{i}}|v_{\\phi}^{\\pi}([{\\pmb s}_{t},{\\pmb o}_{t}^{i}])-v_{\\phi}^{\\pi}({\\pmb s}_{t})|}\\end{array}$ . For simplicity, we assume that the value of the children nodes are uniformly distributed (a detailed analysis of the Gaussian distribution can be found iisn  lAespsp tehnadni xs oAm.4e) , Uwned eari tmh itso  aussseu am sptmioalnl,e rw teo tsahlo nwu imn bAerp pofe nndoidx esA .f3o rt heaftf $\\begin{array}{r}{E_{\\phi}(t)\\leq\\frac{I(\\pmb{s}_{t})}{m_{t}-1}}\\end{array}$ . While $E_{\\phi}$ $\\epsilon$ ", "page_idx": 4}, {"type": "text", "text": "Theorem 4.1. The optimal branching factor $m_{t}$ in a tree search is set such that $m_{t}-1$ is proportional to the node importance $I(s_{t})$ , under the condition $\\begin{array}{r}{\\frac{I(s_{t})}{m_{t}-1}\\leq\\epsilon}\\end{array}$ . Refer to Appendix A.3 for the detailed proof. ", "page_idx": 4}, {"type": "text", "text": "A similar concept has also been proposed in Taylor et al. (2014); Clouse (1996). Intuitively, $I(s_{t})$ captures the maximum value deviation from the current state. When this value is small, there is no need to explore further on this node, as there will not be a significant difference by rolling out on this node. Conversely, if the value is large, it is worth trying different children. We set the number of children allowed for a node $n{\\left({\\pmb s}_{t}\\right)}$ (after extracting 1) to be linear with this importance, using a factor $\\alpha$ . In practice, to avoid extreme cases of large variance of $I(s_{t})$ in the early stage, we bound the number of children by depth-dependent constants $c_{\\mathtt{m i n}}(t)$ and $c_{\\mathtt{m a x}}(t)$ , $n(\\overbar{\\mathbf{s}_{t}})=\\operatorname*{max}\\left(c_{\\operatorname*{min}}(t),\\operatorname*{min}\\left(\\lfloor\\alpha I(\\pmb{s}_{t})\\rfloor+1,c_{\\operatorname*{max}}(t)\\right)\\right)$ . ", "page_idx": 4}, {"type": "text", "text": "4.3.3 State Merge ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "With $n\\!\\left(s_{t}\\right)$ determined, another issue is that options under the same node may be very similar, leading to many unnecessary sub-trees. Since we cannot directly control the $o_{t}\\sim\\pi(s_{t})$ , one strategy to mitigate this issue is to utilize the concept of move groups, as discussed in Van Eyck & Müller (2012). By merging similar nodes into the same group, we can increase the diversity among groups, thereby covering a larger problem space with limited search rollouts and making the search process more efficient. ", "page_idx": 5}, {"type": "text", "text": "Here, we adapt the definition of node predicate $p_{v M}$ from Abel et al. (2018) and Fu et al. (2024) to represent whether two nodes are extremely similar. In practice, each time we generate a new option from the policy, we use heuristic functions as $p_{v M}$ to check its similarity with all existing groups. The heuristic function can either be a faster rule-based measurement (e.g., edit distance) or a model-based method (e.g., prompting a language model). Based on this, we decide whether to merge this option with a previous one or create a new group. ", "page_idx": 5}, {"type": "text", "text": "4.3.4 Fast Rollout with Specialized LM ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "The simulation operation which employs a rollout policy to project future trajectories from a given state, is crucial for an effective MCTS. This process significantly improves the efficiency of exploration and exploitation, and enhances the accuracy of reward estimation2. Estimations made at the end of trajectories tend to have lower bias but higher variance; thus, simulating multiple possible trajectories yields low-bias, low-variance estimates, enabling a more informed and effective search process. Ideally, $\\pi_{\\theta}$ would serve as the rollout policy, yet its computational demands render it impractical for the rapid simulations required by MCTS. To address this challenge, we propose the use of a smaller, specialized LM as the fast rollout policy $\\pi^{\\tt f a s t}$ . Given a state $\\scriptstyle s_{t}$ , the fast rollout policy $\\pi^{\\tt f a s t}$ efficiently continues generation until it reaches a termination condition, denoted as $\\pi^{\\tt f a s t}(s_{t})$ . ", "page_idx": 5}, {"type": "text", "text": "4.4 Critic ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "In ALPHALLM, we design three types of critic models to guide the search process. ", "page_idx": 5}, {"type": "text", "text": "Value Function The value function, denoted as $v^{\\pi}(s)$ , represents the expected return starting from state $\\pmb{s}$ and following policy $\\pi$ thereafter, given by $\\overset{\\d}{v^{\\pi}}(\\bar{s})=\\mathbb{E}_{\\tau\\sim\\pi}[R(\\tau)|s_{0}=s]$ where $R(\\tau)$ represents the discounted return of trajectory $\\tau$ . To train a parameterized value function $v_{\\phi}^{\\pi}(s)$ , given the prompts $\\mathcal{D}=\\{(\\pmb{x}_{i},\\cdot\\cdot\\cdot)~|~i\\in[N]\\}$ , for each prompt $\\pmb{x}_{i}$ , we generate multiple trajectories $\\tau_{i}^{j}=\\{\\pmb{x}_{i},\\pmb{o}_{i1}^{j},\\pmb{o}_{i2}^{j},\\cdot\\cdot\\cdot\\dot{\\bf{\\Omega}},\\pmb{o}_{i T}^{j}\\}$ by following policy $\\pi$ for $J$ times. A final reward $r_{i}^{j}$ is assigned to indicate whether $\\tau_{i}^{j}$ aligns with $\\pmb{y}_{i}$ —for example, rewarding trajectories that contain correct answers in mathematical tasks or closely follow instructions as ground truth. We then construct a dataset $\\mathcal{D}_{\\mathtt{v a l u e}}=\\{(s_{i t}^{j},v_{i t}^{j})\\mid i\\in[N],t\\in[T],j\\in[J]\\}$ where $\\mathbf{\\bar{\\sigma}}_{s t}^{j}=[\\mathbf{x}_{i}\\cdot\\mathbf{o}_{<i t}^{j}]$ and $v_{i t}^{j}=r_{i}^{j}$ . The value function $v_{\\phi}^{\\pi}$ is optimized by minimizing the mean squared error: $\\mathcal{L}_{\\phi}=-\\mathbb{E}_{(s,v)\\sim\\mathcal{D}_{\\mathrm{value}}}(v_{\\phi}^{\\pi}(s)-v)^{2}$ . Similar to (Feng et al., 2023), $v_{\\phi}^{\\pi}$ is a LLM with an MLP layer on top to output a scalar on each token, using the scalar prediction at the last token of each state as the value. ", "page_idx": 5}, {"type": "text", "text": "PRM The value function often struggles with credit assignment problem (Sutton, 1984) and its learning could be inefficient due to delayed and sparse rewards (Sutton & Barto, 2018). Therefore, we propose to incorporate PRM that introduces process supervision (Lightman et al., 2023) for direct option assessment. PRM generates intrinsic rewards (Chentanez et al., 2004) to encourage explorations of advantageous options, effectively mitigating issues of reward sparsity by providing immediate, action-specific rewards. Given a state $\\scriptstyle s_{t}$ and an option $\\pmb{o}_{t}$ at time $t$ , the PRM aims to predict the immediate reward $r_{t}^{\\mathrm{PRM}}$ that results from taking option $\\pmb{o}_{t}$ in state $s_{t}$ . Formally, the PRM is a function $R(s_{t},\\mathbf o_{t})\\to r_{t}^{\\mathsf{P R M}}$ . While PRM ideally requires quality labels for each state (Uesato et al., 2022), due to the high cost and time involved in obtaining these, MC estimation with prefix sampling (Wang et al., 2023) is used as a proxy, which aligns with the objective of the value function. Instead of adding a MLP layer on top of the policy model for outputting a scalar reward (Ouyang et al., 2022), we formulate PRM as a text generation task to best leverage LLM’s intrinsic knowledge for assessing the quality of an option. We adapt the dataset constructed for the value function as $\\mathcal{D}_{\\sf P R M}=\\{(s_{i t}^{\\sf},o_{t},\\bar{r}_{t}^{\\sf P R M})|\\dot{\\iota}\\in[N],\\dot{t}\\in[T]\\}$ where $\\boldsymbol{r}_{t}^{\\mathrm{PRM}}$ is the textual description of the reward, e.g., an option can be regarded as good if $v_{i t}$ is larger than certain threshold. To train PRM, we initialize it from the policy model $\\pi$ and use the following prompt templates and typical language model loss. The prompt template is shown in Appendix A.5. ", "page_idx": 5}, {"type": "text", "text": "", "page_idx": 6}, {"type": "text", "text": "ORM In additional to the value function and PRM, ORM is also used to guide MCTS. ORM is designed to evaluate options sequences in their entirety, assessing the extent to which the complete trajectory aligns with the desired end goal (Uesato et al., 2022; Lightman et al., 2023; Wang et al., 2023; Feng et al., 2023). The outcome evaluation complements value function and PRM by offering a comprehensive assessment of trajectories. Crucially, ORM plays a vital role in the simulation stage of MCTS by providing more accurate signals on the terminal state, which in turn facilitates a more balance between exploration and exploitation strategies. ORM is formulated as a text generation task, similar to PRM. We leverage the same dataset for the value function training and construct ${\\cal D}_{0\\mathtt{R M}}\\,=\\,\\{(\\pmb{x}_{i},\\pmb{o}_{1:T}^{i},r_{i}^{0\\mathtt{R M}})|i\\,\\in\\,[\\bar{N}]\\}$ , where each instance includes a initial state or prompt $\\pmb{x}_{i}$ , a sequence of actions or options $o_{1:T}^{i}$ taken from that state, and a textual reward $r_{i}^{0\\mathrm{RM}}$ indicating the sequence’s success or quality. Similarly, ORM is initialized from the policy model $\\pi$ and the following prompt templates and language model loss are used for training. The prompt template is shown in Appendix A.5. ", "page_idx": 6}, {"type": "text", "text": "The final score evaluation of a state $\\pmb{s}$ is a weighted sum of the value function, PRM, and ORM: $s(s)=\\beta_{\\mathrm{value}}\\cdot v_{\\phi}^{\\pi}(s)+\\beta_{\\mathrm{PRM}}\\cdot\\mathrm{PRM}(s)+\\beta_{\\mathrm{ORM}}\\cdot\\mathbb{E}_{\\tau\\sim\\pi^{\\mathrm{fast}}(s)}^{-}[\\mathrm{ORM}(\\tau)]$ , where $\\tau\\sim\\pi^{\\mathrm{fast}}(s)$ represents trajectories starting from $\\pmb{s}$ under $\\pi^{\\tt f a s t}$ , and $\\beta_{\\mathrm{value}}$ , $\\beta_{\\mathrm{PRM}}$ , $\\beta_{\\mathrm{ORM}}$ are hyperparameters. In practice, we found that the value function model has better precision and calibration, while PRM has superior recall (Appendix A.10). Although ORM with fast rollouts provides low-bias, low-variance estimates, it still inherits some bias from $\\pi^{\\tt{\\bar{f}a s t}}$ . Thus, combining these critics yields a stronger evaluation signal. ", "page_idx": 6}, {"type": "text", "text": "4.5 Policy Self-Improvement ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "The policy improvement an iterative process with each iteration containing two main steps: data generation and policy finetuning. ", "page_idx": 6}, {"type": "text", "text": "Data generation In this step, we assume to have the current policy $\\pi_{\\theta_{k}}$ and synthetic prompts $\\boldsymbol{\\mathcal{D}}_{k}=\\{\\mathbf{x}_{1}^{k},\\dots\\}$ at the $k$ -th round, where each $\\pmb{x}_{1}^{k}$ represents a question. We obtain the corresponding training data $\\mathcal{D}_{k}$ for policy $\\pi_{\\theta_{k}}$ by firstly performing $\\eta\\mathbf{M}\\mathbf{C}\\mathrm{T}\\mathbf{S}$ on $\\mathcal{D}_{k}$ (§4.3) and then sampling a trajectory $\\pmb{y}_{i}^{k}$ from the corresponding tree for each question $\\pmb{x}_{i}^{k}$ . Here we choose the trajectory that yield the highest critic score on the leaf node for each input question. Next, we filter out instances where the corresponding trajectory is substandard forming $\\mathcal{D}_{k}\\stackrel{\\cdot}{=}\\{(\\pmb{x}_{i}^{k},\\pmb{y}_{i}^{k})\\mid f(\\pmb{x}_{i}^{k},\\pmb{y}_{i}^{k})>\\gamma\\}$ where $f$ represents a function for quality scoring, and $\\gamma$ indicates a threshold. There can be several ways to implement the function, and here we simply use the ORM (§4.4). ", "page_idx": 6}, {"type": "text", "text": "Policy finetuning With the obtained training data $\\mathcal{D}_{k}$ , we organize the data into the prompt templates shown in Appendix A.5. Then the policy $\\pi_{\\theta_{k}}$ is finetuned using target-loss: ${\\mathcal{L}}_{\\theta_{k}}\\ =$ $\\mathbb{E}_{(\\pmb{x}_{i}^{k},\\pmb{y}_{i}^{k})\\sim\\mathcal{D}_{k}}\\left[\\log\\pi_{\\theta_{k}}(\\pmb{y}_{i}^{k}|\\pmb{x}_{i}^{k})\\right]$ , resulting in an updated policy $\\pi_{\\theta_{k+1}}$ . We leave other training methods, such as DPO (Rafailov et al., 2023) or PPO (Schulman et al., 2017) in future work. ", "page_idx": 6}, {"type": "text", "text": "5 Experiments ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "5.1 Experiment Setups ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "ALPHALLM is generally applicable to a wide spectrum tasks. As an early exploration, in this paper, we conduct experiments on mathematical reasoning problems where the learning signals are clear to define i.e., , final answer is correct or wrong. We choose to evaluate on two widely used datasets GSM8K (Cobbe et al., 2021) and MATH (Hendrycks et al., 2021). For GSM8K, we utilize the whole test set while for MATH, due to computation constraints, we utilize a subset following the same procedure of Lightman et al. (2023). We evaluate the performance of predicting answers correctly for policy models. In addition, we calculate the average rollouts, represented by the number of nodes in the tree, as a measure of computational efficiency. We compare the performance of ALPHALLM with a suite of proprietary model, including OpenAI’s GPT-4 and GPT-3.5, Anthropic’s Claude-2, as well as Google’s PaLM-2 and the gemini model family. To ensure a fair and consistent evaluation, we employ CoT as our primary prompting method. Additionally, we conduct comparisons with strong open-source models, including Llama-2-70b (Touvron et al., 2023a) and WizardMath-70B-V1.0 (Luo et al., 2023). ", "page_idx": 6}, {"type": "text", "text": "", "page_idx": 7}, {"type": "text", "text": "We select Llama-2-70b as the policy model for the GSM8K dataset and WizardMath-70B-V1.0 for the MATH dataset. To construct the training dataset for the value function, PRM and ORM, we generate 50 trajectories for each prompt and construct the training target following Section 4.4. Both PRM and ORM are initialized using the weights from the policy model, while the value function uses a smaller Llama-2-13b model, as we observed no performance gains from increasing the value function model size. In the design of ORM, tool usage is not incorporated for GSM8K. However, for MATH, we enhance ORM by incorporating tools like python sympy to assess the quality of a trajectory, in a manner similar to that described by Gou et al. (2023). The training employ a learning rate of 1e-6 and are trained for one epoch. For the fast rollout policy model, we opt for the Abel-002-7B model (Chern et al., 2023) for both the GSM8K and MATH tasks for its high efficiency and superior performance. For the MCTS parameters, they are configured at different scales, as shown in Appendix A.6. We set $\\beta_{\\mathrm{value}}$ , $\\beta_{\\mathrm{PRM}}$ , and $\\beta_{\\mathrm{ORM}}$ all to 1.0. ", "page_idx": 7}, {"type": "text", "text": "For policy self-improving $(\\S4.5)$ , we train the policy model up to 3 epochs, setting batch size to 128, learning rate to $5\\times10^{-6}$ and minimal learning rate to $1\\times10^{-6}$ . Linear warm-up and decay is used with warm-up percent to be $10\\%$ . We perform early stopping based on a devset held out from the training instances. For GSM8K experiments, we perform two rounds of self-improving, synthesizing $6.4\\mathrm{k}$ and $7.9\\mathrm{k}$ prompts(Yu et al., 2023) respectively to obtain the corresponding MCTS outputs for training. For MATH experiments, we only perform one round of self-improving due to limited computation resources, and $5.9\\mathrm{k}$ prompts are synthesized. ", "page_idx": 7}, {"type": "text", "text": "The termination function for options can be either be learned or rule-based. In practice, for the GSM8K dataset, the termination condition occurs at the end of each line. This is based on the typical structure of this dataset, where each line represents a distinct step or point. For the MATH dataset, due to its complexity and the base model’s tendency to generate many $\\setminus\\neg\\setminus$ line breaks with some less meaningful content between them, termination occurs at the end of a line if a formula pattern is detected. During inference, if $\\setminus\\neg\\setminus$ is encountered, we perform a rule-based check for formula patterns. It terminates if a pattern is found or continues generating until the next $\\setminus\\neg\\setminus$ . ", "page_idx": 7}, {"type": "text", "text": "5.2 Results ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "Table 2 lists the performance comparisons of various methods on the GSM8K and MATH datasets. Our findings reveal that ALPHALLM, based on Llama-2-70B and WizardMath-70B-V1.0, utilizes only final answer annotations and continues to improve through training on responses from $\\eta\\mathbf{M}\\mathbf{C}\\mathrm{TS}$ . This comparison underscores the efficacy and broad applicability of our imagination-searchingcriticizing self-improving framework. Moreover, when our model is augmented with $\\eta_{\\mathrm{MCTS}}$ decoding strategy, its performance markedly improves, achieving scores of 88.9 and 48.7 on the GSM8K and MATH datasets, respectively. Following two iterations of self-improvement using synthetic prompts, ALPHALLM demonstrates performance comparable to that of GPT-4. This suggests a viable approach to improving LLMs’ capabilities in complex problem-solving tasks in a self-improving fashion, leveraging a minimal amount of labeled data. We also analyze the performance of various search methods in Appendix A.8. ", "page_idx": 7}, {"type": "text", "text": "5.3 Ablation Study ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "We assess the effectiveness of each component in ALPHALLM and report the results on GSM8K in Table 3(a). Vanilla MCTS, configured with only the value function and a fixed number of children per node, achieves an accuracy of $79.5\\%$ . This serves as a reference point for evaluating the incremental beneftis introduced by each additional component. The use of adaptive branching increae the accuracy to $84.9\\%$ . The addition of PRM improves the accuracy modestly to $85.9\\%$ , showing the effectivenss of process supervision for searching. A more significant improvement is observed with the introduction of ORM with fast rollout, which boosts the accuracy to $86.5\\%$ . Integrating state merging results in ", "page_idx": 7}, {"type": "table", "img_path": "tPdJ2qHkOB/tmp/dbaf2316f63bffced898e7d2aadaaae8fc0fff5e8719fd3d2251a68959e6f8ea.jpg", "table_caption": [], "table_footnote": [], "page_idx": 8}, {"type": "table", "img_path": "tPdJ2qHkOB/tmp/b19fc3c3ec4020b025f82511e5a93441e8c512ce3ce3a5c9fb566911ab7f958d.jpg", "table_caption": [""], "table_footnote": ["Table 2: Comparison results of ALPHALLM on the GSM8K and MATH datasets. #Annotation indicates the quantity of labeled data employed for fine-tuning policy or training critic models. The annotation used for training are noted as RN for rationales and FA for final answers. SYN means models trained on synthetic prompts, where trajectories were generated using $\\eta\\mathbf{M}\\mathbf{C}\\mathrm{T}\\mathbf{S}$ . ", "(a) Ablation study on GSM8K "], "page_idx": 8}, {"type": "text", "text": "Table 3: (a): Ablation studies on the GSM8K test set of various components of $\\eta\\mathbf{M}\\mathbf{C}\\mathrm{TS}$ , including adaptive branching, PRM, fast-rollout with ORM, state merge, and large number of rollouts. ${\\bf(b)}$ : Ablation studies of the impacts of tool-augmented ORM and option-level formulation on MATH. ", "page_idx": 8}, {"type": "text", "text": "a further increase in accuracy, reaching $87.0\\%$ . Finally the combined of increasing the number of rollouts with the other components yields the best performance on this task. ", "page_idx": 8}, {"type": "text", "text": "Table 3(b) presents the ablation study of option formulation and the tool-augmented critic on the MATH dataset. Our proposed $\\eta_{\\mathrm{MCTS}}$ achieves an accuracy of 45.4 with 148 rollouts. When options are excluded, reverting to essentially sentence-level MCTS, the performance decreases to 44.1 with a noticeable increase in the number of rollouts to 198. This demonstrates that option formulation introduces enhanced flexibility to MCTS, enabling better performance with fewer search efforts. Furthermore, the most significant decrease in performance is observed when only intrinsic knowledge is utilized for ORM, which drops to an accuracy of 38.8. This suggests that the absence of an external tool critically impedes the ORM’s capability to effectively assess challenging math problems. ", "page_idx": 8}, {"type": "text", "text": "Figure 2 depicts a comparative results on GSM8K of two rounds of self-improving trained on trajectories collected using reranking and $\\eta\\mathbf{M}\\mathbf{C}\\mathrm{T}\\mathbf{S}$ . We report the performance of greedy decoding, $\\eta_{\\sf{M C T S}}$ with a relatively small number of rollouts (50-60), and $\\eta_{\\sf{M C T S}}$ with a larger number of rollouts (200-300) for each model. We observe that 1) Models trained on the trajectories from reranking or $\\eta\\mathbf{M}\\mathbf{C}\\mathrm{T}\\mathbf{S}$ outperform the initial policy by a significant margin. In addition, the performance can be iteratively improved with training suggesting that self-improving has the potential to achieve continual performance gain. 2) While both reranking and $\\eta\\mathbf{M}\\mathbf{C}\\mathrm{T}\\mathbf{S}$ can generate high-quality trajectories for self-improving , $\\eta\\mathbf{M}\\mathbf{C}\\mathrm{TS}$ is performant with high efficiency and better accuracy. Models trained on trajectories generated by it not only exceed the performance of those trained on reranked trajectories but also, when decoded with $\\eta\\mathbf{M}\\mathbf{C}\\mathrm{T}\\mathbf{S}$ , demonstrate on par performance with GPT-4, revealing that ALPHALLM is an effective self-improving framework. ", "page_idx": 8}, {"type": "image", "img_path": "tPdJ2qHkOB/tmp/073e1d2f59152c78316055d2677c98b2eb04ef40599665418cc2c7752fa8d9c8.jpg", "img_caption": ["Figure 2: Empirical analysis on GSM8K of different self-improving data collection methods and number of iterations. Models are evaluated with greedy decoding, $\\eta\\mathbf{M}\\mathbf{C}\\mathrm{T}\\mathbf{S}$ with small #rollout and large #rollout. ", "(b) Ablation on the number of trajectories. "], "img_footnote": [], "page_idx": 9}, {"type": "text", "text": "", "page_idx": 9}, {"type": "table", "img_path": "tPdJ2qHkOB/tmp/61884fb1ce8b8a16382cc8f73abf6926dafe2092074a4c9868254b3397b44830.jpg", "table_caption": [], "table_footnote": [], "page_idx": 9}, {"type": "text", "text": "(a) Ablation on the choice of state merge functions. ", "page_idx": 9}, {"type": "table", "img_path": "tPdJ2qHkOB/tmp/7ef868906755fe78faba1e748de0c3c15b016e0276ddc63d9210679e9b04c543.jpg", "table_caption": [], "table_footnote": [], "page_idx": 9}, {"type": "text", "text": "Table 4: (a): Ablation studies on the choice of heuristic/model-based functions in state merge on GSM8K with base Llama2-70b. The model used in the model-based state merge is Llama-2-70b-chat. (b): Ablation studies of the number of rollout trajectories in fast-rollout estimation on GSM8K with base Llama2-70b. ", "page_idx": 9}, {"type": "text", "text": "We further analyze the impact of different hyperparameters and design choices for each component. Table 4(a) shows that varying heuristic functions (with hyperparameters) for state merge has limited impact on performance. Table 4(b) shows that, as the number of fast-rollouts increases, there is a corresponding improvement in performance. This is due to the reduction in the variance of the estimates. We used $n=4$ in our experiments for better trade-off between performance and efficiency. Additional ablations on the choice of fast-rollout models, are provided in Appendix A.7. ", "page_idx": 9}, {"type": "text", "text": "6 Conclusion ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "In this paper, we introduce ALPHALLM, an imagination-searching-criticizing framework designed for the self-improvement of LLMs without the necessity of additional annotations. At the heart of it is the integration of MCTS with LLMs. To tackle the inherent challenges associated with this integration, including data scarcity, the vastness of search spaces, and the subjective nature of feedback in language tasks, we introduce a data synthesizer for strategic prompt synthesis, an optimized MCTS tailored for efficient search in language tasks, and a trio of critic models to provide precise feedback. Our experimental findings on mathematical reasoning tasks reveal that ALPHALLM significantly boosts the performance of LLMs without requiring extra data annotations. Moreover, when decoded with $\\eta_{\\mathrm{MCTS}}$ , ALPHALLM performs comparably to GPT-4, highlighting the potential for self-improvement in LLMs. ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "David Abel, Dilip Arumugam, Lucas Lehnert, and Michael Littman. State abstractions for lifelong reinforcement learning. In International Conference on Machine Learning, pp. 10–19. PMLR, 2018.   \nPeter Auer, Nicolo Cesa-Bianchi, and Paul Fischer. Finite-time analysis of the multiarmed bandit problem. Machine learning, 47:235–256, 2002.   \nYuntao Bai, Saurav Kadavath, Sandipan Kundu, Amanda Askell, Jackson Kernion, Andy Jones, Anna Chen, Anna Goldie, Azalia Mirhoseini, Cameron McKinnon, et al. Constitutional ai: Harmlessness from ai feedback. arXiv preprint arXiv:2212.08073, 2022.   \nMaciej Besta, Nils Blach, Ales Kubicek, Robert Gerstenberger, Michal Podstawski, Lukas Gianinazzi, Joanna Gajda, Tomasz Lehmann, Hubert Niewiadomski, Piotr Nyczyk, et al. Graph of thoughts: Solving elaborate problems with large language models. In Proceedings of the AAAI Conference on Artificial Intelligence, pp. 17682–17690, 2024.   \nSamuel R Bowman, Jeeyoon Hyun, Ethan Perez, Edwin Chen, Craig Pettit, Scott Heiner, Kamil˙e Lukoši¯ut˙e, Amanda Askell, Andy Jones, Anna Chen, et al. Measuring progress on scalable oversight for large language models. arXiv preprint arXiv:2211.03540, 2022.   \nZixiang Chen, Yihe Deng, Huizhuo Yuan, Kaixuan Ji, and Quanquan Gu. Self-play fine-tuning converts weak language models to strong language models. arXiv preprint arXiv:2401.01335, 2024.   \nNuttapong Chentanez, Andrew Barto, and Satinder Singh. Intrinsically motivated reinforcement learning. Advances in neural information processing systems, 17, 2004.   \nEthan Chern, Haoyang Zou, Xuefeng Li, Jiewen Hu, Kehua Feng, Junlong Li, and Pengfei Liu. Generative ai for math: Abel. https://github.com/GAIR-NLP/abel, 2023.   \nHyung Won Chung, Le Hou, Shayne Longpre, Barret Zoph, Yi Tay, William Fedus, Yunxuan Li, Xuezhi Wang, Mostafa Dehghani, Siddhartha Brahma, et al. Scaling instruction-finetuned language models. arXiv preprint arXiv:2210.11416, 2022.   \nJeffery Allen Clouse. On integrating apprentice learning and reinforcement learning. University of Massachusetts Amherst, 1996.   \nKarl Cobbe, Vineet Kosaraju, Mohammad Bavarian, Mark Chen, Heewoo Jun, Lukasz Kaiser, Matthias Plappert, Jerry Tworek, Jacob Hilton, Reiichiro Nakano, et al. Training verifiers to solve math word problems. arXiv preprint arXiv:2110.14168, 2021.   \nMaarten De Waard, Diederik M Roijers, and Sander CJ Bakkes. Monte carlo tree search with options for general video game playing. In 2016 IEEE Conference on Computational Intelligence and Games (CIG), pp. 1–8. IEEE, 2016.   \nRuomeng Ding, Chaoyun Zhang, Lu Wang, Yong Xu, Minghua Ma, Wei Zhang, Si Qin, Saravan Rajmohan, Qingwei Lin, and Dongmei Zhang. Everything of thoughts: Defying the law of penrose triangle for thought generation. arXiv preprint arXiv:2311.04254, 2023.   \nXidong Feng, Ziyu Wan, Muning Wen, Ying Wen, Weinan Zhang, and Jun Wang. Alphazero-like treesearch can guide large language model decoding and training. arXiv preprint arXiv:2309.17179, 2023.   \nYangqing Fu, Ming Sun, Buqing Nie, and Yue Gao. Accelerating monte carlo tree search with probability tree state abstraction. Advances in Neural Information Processing Systems, 36, 2024.   \nZhibin Gou, Zhihong Shao, Yeyun Gong, Yujiu Yang, Minlie Huang, Nan Duan, Weizhu Chen, et al. Tora: A tool-integrated reasoning agent for mathematical problem solving. arXiv preprint arXiv:2309.17452, 2023.   \nHongyi Guo, Yuanshun Yao, Wei Shen, Jiaheng Wei, Xiaoying Zhang, Zhaoran Wang, and Yang Liu. Human-instruction-free llm self-alignment with limited samples. arXiv preprint arXiv:2401.06785, 2024.   \nShibo Hao, Yi Gu, Haodi Ma, Joshua Hong, Zhen Wang, Daisy Wang, and Zhiting Hu. Reasoning with language model is planning with world model. In Proceedings of the 2023 Conference on Empirical Methods in Natural Language Processing, pp. 8154–8173, 2023.   \nDan Hendrycks, Collin Burns, Saurav Kadavath, Akul Arora, Steven Basart, Eric Tang, Dawn Song, and Jacob Steinhardt. Measuring mathematical problem solving with the math dataset, 2021.   \nRuixin Hong, Hongming Zhang, Xinyu Pang, Dong Yu, and Changshui Zhang. A closer look at the self-verification abilities of large language models in logical reasoning. arXiv preprint arXiv:2311.07954, 2023.   \nJie Huang, Xinyun Chen, Swaroop Mishra, Huaixiu Steven Zheng, Adams Wei Yu, Xinying Song, and Denny Zhou. Large language models cannot self-correct reasoning yet. arXiv preprint arXiv:2310.01798, 2023.   \nAitor Lewkowycz, Anders Andreassen, David Dohan, Ethan Dyer, Henryk Michalewski, Vinay Ramasesh, Ambrose Slone, Cem Anil, Imanol Schlag, Theo Gutman-Solo, et al. Solving quantitative reasoning problems with language models. Advances in Neural Information Processing Systems, 35:3843–3857, 2022.   \nXian Li, Ping Yu, Chunting Zhou, Timo Schick, Luke Zettlemoyer, Omer Levy, Jason Weston, and Mike Lewis. Self-alignment with instruction backtranslation. arXiv preprint arXiv:2308.06259, 2023.   \nHunter Lightman, Vineet Kosaraju, Yura Burda, Harri Edwards, Bowen Baker, Teddy Lee, Jan Leike, John Schulman, Ilya Sutskever, and Karl Cobbe. Let’s verify step by step. arXiv preprint arXiv:2305.20050, 2023.   \nJiacheng Liu, Andrew Cohen, Ramakanth Pasunuru, Yejin Choi, Hannaneh Hajishirzi, and Asli Celikyilmaz. Making ppo even better: Value-guided monte-carlo tree search decoding. arXiv preprint arXiv:2309.15028, 2023.   \nJieyi Long. Large language model guided tree-of-thought. arXiv preprint arXiv:2305.08291, 2023.   \nJelena Luketina, Nantas Nardelli, Gregory Farquhar, Jakob N. Foerster, Jacob Andreas, Edward Grefenstette, Shimon Whiteson, and Tim Rocktäschel. A survey of reinforcement learning informed by natural language. ArXiv, abs/1906.03926, 2019. URL https://api.semanticscholar. org/CorpusID:182952502.   \nHaipeng Luo, Qingfeng Sun, Can Xu, Pu Zhao, Jianguang Lou, Chongyang Tao, Xiubo Geng, Qingwei Lin, Shifeng Chen, and Dongmei Zhang. Wizardmath: Empowering mathematical reasoning for large language models via reinforced evol-instruct. arXiv preprint arXiv:2308.09583, 2023.   \nAman Madaan, Niket Tandon, Prakhar Gupta, Skyler Hallinan, Luyu Gao, Sarah Wiegreffe, Uri Alon, Nouha Dziri, Shrimai Prabhumoye, Yiming Yang, et al. Self-refine: Iterative refinement with self-feedback. Advances in Neural Information Processing Systems, 36, 2024.   \nMaxwell Nye, Anders Johan Andreassen, Guy Gur-Ari, Henryk Michalewski, Jacob Austin, David Bieber, David Dohan, Aitor Lewkowycz, Maarten Bosma, David Luan, et al. Show your work: Scratchpads for intermediate computation with language models. arXiv preprint arXiv:2112.00114, 2021.   \nR OpenAI. Gpt-4 technical report. arXiv, pp. 2303–08774, 2023.   \nLong Ouyang, Jeffrey Wu, Xu Jiang, Diogo Almeida, Carroll Wainwright, Pamela Mishkin, Chong Zhang, Sandhini Agarwal, Katarina Slama, Alex Ray, et al. Training language models to follow instructions with human feedback. Advances in Neural Information Processing Systems, 35: 27730–27744, 2022.   \nBaolin Peng, Xiujun Li, Lihong Li, Jianfeng Gao, Asli Celikyilmaz, Sungjin Lee, and Kam-Fai Wong. Composite task-completion dialogue policy learning via hierarchical deep reinforcement learning. In Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing. Association for Computational Linguistics, 2017.   \nRafael Rafailov, Archit Sharma, Eric Mitchell, Stefano Ermon, Christopher D Manning, and Chelsea Finn. Direct preference optimization: Your language model is secretly a reward model. arXiv preprint arXiv:2305.18290, 2023.   \nRajkumar Ramamurthy, Prithviraj Ammanabrolu, Kianté Brantley, Jack Hessel, Rafet Sifa, Christian Bauckhage, Hannaneh Hajishirzi, and Yejin Choi. Is reinforcement learning (not) for natural language processing?: Benchmarks, baselines, and building blocks for natural language policy optimization. ArXiv, abs/2210.01241, 2022. URL https://api.semanticscholar.org/ CorpusID:252693405.   \nWilliam Saunders, Catherine Yeh, Jeff Wu, Steven Bills, Long Ouyang, Jonathan Ward, and Jan Leike. Self-critiquing models for assisting human evaluators. arXiv preprint arXiv:2206.05802, 2022.   \nJohn Schulman, Filip Wolski, Prafulla Dhariwal, Alec Radford, and Oleg Klimov. Proximal policy optimization algorithms. arXiv preprint arXiv:1707.06347, 2017.   \nDavid Silver, Aja Huang, Chris J Maddison, Arthur Guez, Laurent Sifre, George Van Den Driessche, Julian Schrittwieser, Ioannis Antonoglou, Veda Panneershelvam, Marc Lanctot, et al. Mastering the game of go with deep neural networks and tree search. nature, 529(7587):484–489, 2016.   \nDavid Silver, Thomas Hubert, Julian Schrittwieser, Ioannis Antonoglou, Matthew Lai, Arthur Guez, Marc Lanctot, Laurent Sifre, Dharshan Kumaran, Thore Graepel, et al. Mastering chess and shogi by self-play with a general reinforcement learning algorithm. arXiv preprint arXiv:1712.01815, 2017.   \nKaya Stechly, Karthik Valmeekam, and Subbarao Kambhampati. On the self-verification limitations of large language models on reasoning and planning tasks. arXiv preprint arXiv:2402.08115, 2024.   \nZhiqing Sun, Yikang Shen, Qinhong Zhou, Hongxin Zhang, Zhenfang Chen, David Cox, Yiming Yang, and Chuang Gan. Principle-driven self-alignment of language models from scratch with minimal human supervision. arXiv preprint arXiv:2305.03047, 2023.   \nRichard S Sutton and Andrew G Barto. Reinforcement learning: An introduction. MIT press, 2018.   \nRichard S. Sutton, Doina Precup, and Satinder Singh. Between mdps and semi-mdps: A framework for temporal abstraction in reinforcement learning. Artificial Intelligence, 112(1):181–211, 1999a. ISSN 0004-3702. doi: https://doi.org/10.1016/S0004-3702(99)00052-1. URL https://www. sciencedirect.com/science/article/pii/S0004370299000521.   \nRichard S Sutton, Doina Precup, and Satinder Singh. Between mdps and semi-mdps: A framework for temporal abstraction in reinforcement learning. Artificial intelligence, 112(1-2):181–211, 1999b.   \nRichard Stuart Sutton. Temporal credit assignment in reinforcement learning. University of Massachusetts Amherst, 1984.   \nMatthew E Taylor, Nicholas Carboni, Anestis Fachantidis, Ioannis Vlahavas, and Lisa Torrey. Reinforcement learning agents providing advice in complex video games. Connection Science, 26(1): 45–63, 2014.   \nGemini Team, Rohan Anil, Sebastian Borgeaud, Yonghui Wu, Jean-Baptiste Alayrac, Jiahui Yu, Radu Soricut, Johan Schalkwyk, Andrew M Dai, Anja Hauth, et al. Gemini: a family of highly capable multimodal models. arXiv preprint arXiv:2312.11805, 2023.   \nHugo Touvron, Louis Martin, Kevin Stone, Peter Albert, Amjad Almahairi, Yasmine Babaei, Nikolay Bashlykov, Soumya Batra, Prajjwal Bhargava, Shruti Bhosale, et al. Llama 2: Open foundation and fine-tuned chat models. arXiv preprint arXiv:2307.09288, 2023a.   \nHugo Touvron, Louis Martin, Kevin Stone, Peter Albert, Amjad Almahairi, Yasmine Babaei, Nikolay Bashlykov, Soumya Batra, Prajjwal Bhargava, Shruti Bhosale, et al. Llama 2: Open foundation and fine-tuned chat models. arXiv preprint arXiv:2307.09288, 2023b.   \nJonathan Uesato, Nate Kushman, Ramana Kumar, Francis Song, Noah Siegel, Lisa Wang, Antonia Creswell, Geoffrey Irving, and Irina Higgins. Solving math word problems with process-and outcome-based feedback. arXiv preprint arXiv:2211.14275, 2022.   \nKarthik Valmeekam, Alberto Olmo, Sarath Sreedharan, and Subbarao Kambhampati. Large language models still can’t plan (a benchmark for llms on planning and reasoning about change). arXiv preprint arXiv:2206.10498, 2022.   \nGabriel Van Eyck and Martin Müller. Revisiting move groups in monte-carlo tree search. In Advances in Computer Games: 13th International Conference, ACG 2011, Tilburg, The Netherlands, November 20-22, 2011, Revised Selected Papers 13, pp. 13–23. Springer, 2012.   \nPeiyi Wang, Lei Li, Zhihong Shao, RX Xu, Damai Dai, Yifei Li, Deli Chen, Y Wu, and Zhifang Sui. Math-shepherd: Verify and reinforce llms step-by-step without human annotations. CoRR, abs/2312.08935, 2023.   \nYizhong Wang, Yeganeh Kordi, Swaroop Mishra, Alisa Liu, Noah A Smith, Daniel Khashabi, and Hannaneh Hajishirzi. Self-instruct: Aligning language model with self generated instructions. arXiv preprint arXiv:2212.10560, 2022.   \nJason Wei, Xuezhi Wang, Dale Schuurmans, Maarten Bosma, Fei Xia, Ed Chi, Quoc V Le, Denny Zhou, et al. Chain-of-thought prompting elicits reasoning in large language models. Advances in neural information processing systems, 35:24824–24837, 2022.   \nYuxi Xie, Kenji Kawaguchi, Yiran Zhao, James Xu Zhao, Min-Yen Kan, Junxian He, and Michael Xie. Self-evaluation guided beam search for reasoning. Advances in Neural Information Processing Systems, 36, 2024.   \nCan Xu, Qingfeng Sun, Kai Zheng, Xiubo Geng, Pu Zhao, Jiazhan Feng, Chongyang Tao, and Daxin Jiang. Wizardlm: Empowering large language models to follow complex instructions. arXiv preprint arXiv:2304.12244, 2023.   \nShunyu Yao, Dian Yu, Jeffrey Zhao, Izhak Shafran, Tom Grifftihs, Yuan Cao, and Karthik Narasimhan. Tree of thoughts: Deliberate problem solving with large language models. Advances in Neural Information Processing Systems, 36, 2024.   \nLonghui Yu, Weisen Jiang, Han Shi, Jincheng Yu, Zhengying Liu, Yu Zhang, James T Kwok, Zhenguo Li, Adrian Weller, and Weiyang Liu. Metamath: Bootstrap your own mathematical questions for large language models. arXiv preprint arXiv:2309.12284, 2023.   \nLifan Yuan, Ganqu Cui, Hanbin Wang, Ning Ding, Xingyao Wang, Jia Deng, Boji Shan, Huimin Chen, Ruobing Xie, Yankai Lin, et al. Advancing llm reasoning generalists with preference trees. arXiv preprint arXiv:2404.02078, 2024a.   \nWeizhe Yuan, Richard Yuanzhe Pang, Kyunghyun Cho, Sainbayar Sukhbaatar, Jing Xu, and Jason Weston. Self-rewarding language models. arXiv preprint arXiv:2401.10020, 2024b.   \nEric Zelikman, Yuhuai Wu, Jesse Mu, and Noah Goodman. Star: Bootstrapping reasoning with reasoning. Advances in Neural Information Processing Systems, 35:15476–15488, 2022.   \nEric Zelikman, Georges Harik, Yijia Shao, Varuna Jayasiri, Nick Haber, and Noah D Goodman. Quiet-star: Language models can teach themselves to think before speaking. arXiv preprint arXiv:2403.09629, 2024.   \nTinghui Zhu, Kai Zhang, Jian Xie, and Yu Su. Deductive beam search: Decoding deducible rationale for chain-of-thought reasoning. arXiv preprint arXiv:2401.17686, 2024. ", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "", "page_idx": 13}, {"type": "image", "img_path": "tPdJ2qHkOB/tmp/37ed756faadcbb1e195895b8f6bdc146b4d61c19a3aa2e19197814f6881a27da.jpg", "img_caption": [], "img_footnote": [], "page_idx": 14}, {"type": "text", "text": "Figure 3: An overview of the four operations of $\\eta\\mathbf{M}\\mathbf{C}\\mathrm{T}\\mathbf{S}$ . A node is selected, expanded, simulated with fast rollout policy until a terminal node is reached, then the signals from value function, PRM and ORM are backpropagated. ", "page_idx": 14}, {"type": "text", "text": "A Appendix ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "A.1 Imagination, Searching, Criticizing and Learning Loop ", "page_idx": 14}, {"type": "text", "text": "Algorithm 1: LLM self-improving loop   \nInput Initial dataset $\\mathcal{D}^{0}=\\{(\\pmb{x}_{i}^{0},\\pmb{y}_{i}^{0})~|~i\\in[N]\\}$ , policy model $\\pi_{\\theta}^{0}$ , reward model $R$ , number of   \nself-improving training loop $K$   \nOutput $\\mathbf{\\dot{\\theta}}^{k}$   \nfor $k\\gets1,\\ldots,K$ do Generate synthetic prompts $[\\pmb{x}^{k}]=\\mathtt{S Y N}(\\pi_{\\theta}^{k-1},\\mathcal{D}^{k-1})$ Collect trajectories with search algorithm, e.g., MCTS guided by $R$ . $[\\hat{\\pmb{y}}^{k}]=\\tt M C T S(\\pi_{\\theta}^{k-1},[\\pmb{x}^{k}])$ Construct dataset $\\boldsymbol{\\mathcal{D}}^{k}=\\{(\\mathbf{x}^{k},\\hat{\\pmb{y}}^{k})\\}$ Update policy $\\theta^{k}=\\arg\\operatorname*{min}_{\\theta}L(\\pi_{\\theta}^{k-1},\\mathcal{D}^{k})$   \nend ", "page_idx": 14}, {"type": "text", "text": "The algorithm is shown in Algorithm 1. ", "page_idx": 14}, {"type": "text", "text": "A.2 Option-level MCTS ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "As illustrated in Figure 3, option-level MCTS consists of the following operations: ", "page_idx": 14}, {"type": "text", "text": "• Selection Starting from the root node, we iteratively select the child node based on Equation ??. • Expansion Once an expandable leaf node is selected, a new node is generated by starting with the previous state of the parent node as the initial option state. The option is then sampled using the policy $\\pi$ , and its completion is determined by the termination function $\\beta$ . • Simulation The scaled reward of the newly expanded node, as well as some simulated future trajectories are evaluated using the feedback functions, which is discussed in $\\S4.4$ . • Backpropagation The average value of the newly generated node and all its ancestors is updated using the scaled reward from the evaluation step. Meanwhile, the visit counts for these nodes are also increased by one. ", "page_idx": 14}, {"type": "text", "text": "A.3 Importance-Based Adaptive Branching Under Uniform Distribution ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Let $V\\;=\\;\\{v_{\\phi}^{\\pi}(s_{t},o_{t}^{1}),v_{\\phi}^{\\pi}(s_{t},o_{t}^{2}),...,v_{\\phi}^{\\pi}(s_{t},o_{t}^{m_{t}})\\}$ be a set of $m_{t}$ values that are uniformly distributed. If the maximum and minimum values from $V$ are $v_{\\mathrm{max}}$ and $v_{\\mathrm{{min}}}$ , the average gap between two consecutive values is given by $\\frac{v_{\\operatorname*{max}}-v_{\\operatorname*{min}}}{m_{t}-1}$ . The upper bound of expected minimum distances from a new value $v_{\\mathrm{new}}$ to any value from $V$ is achieved when $v_{\\mathrm{new}}$ is consistently positioned at the midpoint between two consecutive values, and it is given by $\\frac{v_{\\operatorname*{max}}-v_{\\operatorname*{min}}}{2(m_{t}-1)}$ ", "page_idx": 14}, {"type": "text", "text": "Since $v_{\\mathrm{max}}-v_{\\mathrm{min}}=2I(s_{t})$ for a uniform distribution, we can conclude that $\\begin{array}{r}{E_{\\phi}(t)\\leq\\frac{I(\\pmb{s}_{t})}{m_{t}-1}}\\end{array}$ . ", "page_idx": 15}, {"type": "text", "text": "Theorem 4.1. The optimal branching factor $m_{t}$ in a tree search is set such that $m_{t}\\!-\\!1$ is proportional to the node importance $I(s_{t})$ , under the condition $\\begin{array}{r}{\\frac{I(s_{t})}{m_{t}-1}\\leq\\epsilon.}\\end{array}$ . ", "page_idx": 15}, {"type": "text", "text": "Proof. We can have the optimization problem as: ", "page_idx": 15}, {"type": "equation", "text": "$$\n{\\begin{array}{l}{{\\mathrm{minimize:}}\\displaystyle\\sum_{m_{t}}m_{t}}\\\\ {{\\mathrm{subject}}\\,{\\mathrm{to:}}\\displaystyle{\\frac{I(s_{t})}{m_{t}-1}}\\leq\\epsilon}\\end{array}}\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "Introduce the Lagrange multiplier $\\lambda_{t}$ for each constraint: ", "page_idx": 15}, {"type": "equation", "text": "$$\nL(m_{t},\\lambda_{t})=\\sum m_{t}+\\sum\\lambda_{t}\\left(\\epsilon(m_{t}-1)-I(s_{t})\\right)\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "Now, let’s find the gradient of the Lagrangian with respect to $m_{t}$ and $\\lambda_{t}$ and set them to zero: ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\nabla_{m_{t}}L=1+\\epsilon\\lambda_{t}=0}\\\\ &{\\nabla_{\\lambda_{t}}L=\\epsilon(m_{t}-1)-I(\\pmb{s}_{t})=0}\\end{array}\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "From the first equation, we get: ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\lambda_{t}=-\\frac{1}{\\epsilon}\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "Substitute this value of $\\lambda_{t}$ into the second equation: ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\epsilon(m_{t}-1)-I(\\pmb{s}_{t})=0}\\end{array}\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "Solving for $m_{t}$ , we get: ", "page_idx": 15}, {"type": "equation", "text": "$$\nm_{t}=\\frac{I(\\pmb{s}_{t})}{\\epsilon}+1\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "Thus, $m_{t}-1$ is proportional to the node importance $I(s_{t})$ . ", "page_idx": 15}, {"type": "text", "text": "A.4 Importance-Based Adaptive Branching Under Gaussian Distribution ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "If we assume that $v_{\\phi}^{\\pi}\\big([s_{t},o_{t}^{j}]\\big)$ and $v_{\\phi}^{\\pi}\\big([s_{t},o_{t}^{i}]\\big)$ are independent and identically distributed Gaussian random variables: ", "page_idx": 15}, {"type": "equation", "text": "$$\nv_{\\phi}^{\\pi}([s_{t},o_{t}^{j}]),v_{\\phi}^{\\pi}([s_{t},o_{t}^{i}])\\sim\\mathcal{N}(\\mu,\\sigma^{2})\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "The difference $D_{i j}=v_{\\phi}^{\\pi}([s_{t},o_{t}^{j}])-v_{\\phi}^{\\pi}([s_{t},o_{t}^{i}])$ will follow a normal distribution with: ", "page_idx": 15}, {"type": "equation", "text": "$$\nD_{i j}\\sim\\mathcal{N}(0,2\\sigma^{2})\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "To find the expected minimum absolute difference between $v_{\\phi}^{\\pi}\\big([s_{t},o_{t}^{j}]\\big)$ and the closest $v_{\\phi}^{\\pi}\\big([\\pmb{s}_{t},\\pmb{o}_{t}^{i}]\\big)$ , we need to consider the distribution of the minimum of $m_{t}$ Gaussian differences. ", "page_idx": 15}, {"type": "text", "text": "The expected minimum value of $m_{t}$ absolute differences can be approximated using properties of order statistics for Gaussian distributions. ", "page_idx": 15}, {"type": "text", "text": "For a set of $m_{t}$ independent normal random variables with variance $2\\sigma^{2}$ , the expected minimum absolute difference, $\\bar{\\mathbb{E}}[\\operatorname*{min}_{i}|D_{i j}|]$ , can be approximated by: ", "page_idx": 15}, {"type": "equation", "text": "$$\nE_{\\phi}(t)\\approx{\\frac{\\sigma{\\sqrt{2}}}{\\sqrt{m_{t}}}}\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "This approximation arises from the fact that the expected minimum value of the absolute deviations of normally distributed random variables scales with the inverse of the square root of the number of samples. ", "page_idx": 16}, {"type": "text", "text": "Then, assume the range of the $m_{t}$ samples are $R_{m}\\,=\\,m a x(v_{\\phi}^{\\pi}([s_{t},o_{t}^{i}])\\,-\\,m i n(v_{\\phi}^{\\pi}([s_{t},o_{t}^{i}])$ , the the expected range $\\mathbb{E}[R_{m}]$ of $m_{t}$ samples from a normal distribution can be approximated using properties of extreme values of Gaussian distributions. The range $R_{m}$ can be approximated as: ", "page_idx": 16}, {"type": "equation", "text": "$$\nR_{m}\\approx\\sigma(z_{0.9995}-z_{0.0005})\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "where $z_{p}$ is the p-th percentile of the standard normal distribution. It can converge to ", "page_idx": 16}, {"type": "equation", "text": "$$\nR_{m}\\approx\\sigma\\sqrt{2\\ln(m_{t})}\\left(2-{\\frac{\\ln(\\ln(m_{t}))}{4\\ln(m_{t})}}\\right)\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "For simplicity, we can approximate the range using the primary term, which captures the dominant behavior: ", "page_idx": 16}, {"type": "equation", "text": "$$\nR_{m}\\approx\\sigma\\sqrt{2\\ln(m_{t})}\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "Then we have ", "page_idx": 16}, {"type": "equation", "text": "$$\nE_{\\phi}(t)\\approx\\frac{\\sqrt{2}}{\\sqrt{m_{t}}}\\frac{R_{m}}{\\sqrt{2\\ln(m_{t})}}\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "Knowing that for all distributions, ", "page_idx": 16}, {"type": "equation", "text": "$$\nI(\\pmb{s}_{t})\\geq\\frac{R_{m}}{2}\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "We have ", "page_idx": 16}, {"type": "equation", "text": "$$\nE_{\\phi}(t)\\leq\\frac{I(s_{t})}{\\sqrt{m_{t}\\ln(m_{t})}}\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "Then to find the optimal $m_{t}$ , the optimization problem is ", "page_idx": 16}, {"type": "equation", "text": "$$\n{\\begin{array}{l}{{\\mathrm{minimize}}{:}\\displaystyle\\sum m_{t}}\\\\ {{\\mathrm{subject}}\\,{\\mathrm{to}}{:}\\displaystyle{\\frac{I(s_{t})}{\\sqrt{m_{t}\\ln(m_{t})}}}\\leq\\epsilon}\\end{array}}\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "To solve this optimization problem, we can first rewrite the constraint in terms of $m_{t}$ . ", "page_idx": 16}, {"type": "equation", "text": "$$\nm_{t}\\ln(m_{t})\\geq\\frac{I^{2}(s_{t})}{\\epsilon^{2}}\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "Now, let’s define a new function $g(m_{t})=m_{t}\\ln(m_{t})$ . We want to find the minimum $m_{t}$ such that $\\begin{array}{r}{g(m_{t})\\geq\\frac{I^{2}(s_{t})}{\\epsilon^{2}}}\\end{array}$ . To do this, we can find the derivative of $g(m_{t})$ and set it to zero to find the critical points. ", "page_idx": 16}, {"type": "equation", "text": "$$\ng^{\\prime}(m_{t})=\\frac{d}{d m_{t}}(m_{t}\\ln(m_{t}))=\\ln(m_{t})+1\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "Setting the derivative to zero: ", "page_idx": 16}, {"type": "equation", "text": "$$\n\\ln(m_{t})=-1\n$$", "text_format": "latex", "page_idx": 16}, {"type": "equation", "text": "$$\nm_{t}=e^{-1}\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "However, this critical point corresponds to a minimum of the function $g(m_{t})$ , and we are interested in the minimum $m_{t}$ that satisfies the constraint $\\begin{array}{r}{g(m_{t})\\geq\\frac{I^{2}(s_{t})}{\\epsilon^{2}}}\\end{array}$ . Since the function $g(m_{t})$ is increasing for $m_{t}>e^{-1}$ , we can find the minimum $m_{t}$ by setting $\\begin{array}{r}{\\dot{g}(m_{t})=\\frac{I^{2}(s_{t})}{\\epsilon^{2}}}\\end{array}$ and solving for $m_{t}$ : ", "page_idx": 16}, {"type": "equation", "text": "$$\nm_{t}\\ln(m_{t})=\\frac{I^{2}(s_{t})}{\\epsilon^{2}}\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "This can not be solved directly, but we can still observe that there is a positive correlation between $m_{t}$ and $I(s_{t})$ . ", "page_idx": 16}, {"type": "table", "img_path": "tPdJ2qHkOB/tmp/6dc869e9fb28aa7d5825d5bc2e54ce74904339021b60eb4f4dcb4436a81c7bdc.jpg", "table_caption": [], "table_footnote": [], "page_idx": 17}, {"type": "text", "text": "Table 5: Parameters for MCTS. The Small/Large means small #rollout and small #rollout ", "page_idx": 17}, {"type": "text", "text": "A.5 Prompt Templates ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "A.5.1 PRM ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "###You are given a math problem, followed by a step-by-step reasoning process. Your task is to read the problem carefully, understand the solving steps, and check the correctness of the last reasoning step. Output ’True’ if the last step is correct, and ’False’ otherwise.\\n\\n### State\\n{state ${\\mathfrak{j}}{\\mathfrak{m}}{\\mathfrak{m}}$ ###Action\\n{option}\\n\\n###Assessment\\n{textual reward} ", "page_idx": 17}, {"type": "text", "text": "A.5.2 ORM ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "###Assess a solution including final answer to a given math problem by following below steps. $\\ln-$ Evaluate the method used for solving the problem. $\\backslash\\mathfrak{n}-$ Review each calculation step for accuracy. Check for computational errors, incorrect formula applications, or arithmetic mistakes. $\\backslash\\mathfrak{n}-$ The solution should use all the information provided in the question. $\\backslash\\mathfrak{n}-$ Examine the final answer for correctness, considering the calculations and method used. $\\backslash\\mathfrak{n.m u}$ ### Prompt\\n{prompt}\\n\\n###Trajectory\\n{trajectory}\\n\\n###Assessment\\n{textual reward} ", "page_idx": 17}, {"type": "text", "text": "A.5.3 Policy Finetuning ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "For MATH experiments that take a WizardMath V1.0 70B as the policy, we adopt their proposed system prompt for self-improving. For GSM8K experiments taking Llama2 70B pretrain as the policy, we use the following system prompt. ", "page_idx": 17}, {"type": "text", "text": "A chat between a curious user and an artificial intelligence assistant. $\\mathfrak{m}$ The assistant gives helpful, detailed, and polite answers to the user’s questions. $\\mathfrak{m}$ User: $\\mathbf{\\boldsymbol{x}}_{i}\\backslash\\mathfrak{n}$ Assistant: $\\pmb{y}_{i}$ ", "page_idx": 17}, {"type": "text", "text": "A.6 MCTS Details ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "We set the MCTS parameters in Table 5. ", "page_idx": 17}, {"type": "text", "text": "A.7 Additional Ablations ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Fast-rollout model Using Llama-2-70b instead of Abel-7B-002 improves performance by reducing bias from a smaller model, but Abel-002-7B is faster with similar computational resources due to higher concurrency and quicker processing. The details can be found in Table 6. ", "page_idx": 17}, {"type": "text", "text": "A.8 Search Comparison ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Table 7 presents the performance of various methods applied to different number of responses, from 10 to 50. Our analysis confirms several key findings: 1) Reranking utilizing ORM consistently outperforms self-consistency techniques, indicating that ORM is capable of generating meaningful signals for searching. 2) $\\eta\\mathbf{M}\\mathbf{C}\\mathrm{T}\\mathbf{S}$ demonstrates superior performance while requiring significantly fewer rollouts. For instance, on the MATH dataset, $\\eta_{\\mathrm{MCTS}}$ achieves better results with only half the number of rollouts compared to reranking. Additionally, we evaluated the performance of BFS on the GSM8K only, where it requires 87.9 rollouts to achieve a score of 80.6. These results suggest that our design of an efficient MCTS in ALPHALLM can serve as an effective policy improvement operation, enabling the search for high-quality trajectories with reduced computational cost. ", "page_idx": 17}, {"type": "table", "img_path": "tPdJ2qHkOB/tmp/1b967ccd78a96d209a7a50f11d806fb71738c9068606ba11ed8527c9bd494df5.jpg", "table_caption": [], "table_footnote": [], "page_idx": 18}, {"type": "table", "img_path": "tPdJ2qHkOB/tmp/048c119786804e62b93f38a9a06e8795ed6a89bd301c06d7ec4af2b64fcd783e.jpg", "table_caption": ["Table 6: Ablation study over different fast-rollout models on GSM8K. ", "Table 7: Comparative results of various searching method on GSM8K and MATH. "], "table_footnote": [], "page_idx": 18}, {"type": "text", "text": "", "page_idx": 18}, {"type": "text", "text": "A.9 Rollout Example ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Consider the following GSM-like question: ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Question: Sandy’s monthly phone bill expense is equal to ten times her age now. In two years, Sandy will be three times as old as Kim. If Kim is currently $\\mathbf{X}$ years old, calculate Sandy’s monthly phone bill expense.\\nIf we know the answer to the above question is 340, what is the value of the unknown variable $\\mathrm{{x}\\mathrm{{?}\\mathrm{{u}}}}$ ", "page_idx": 18}, {"type": "text", "text": "A node in the second layer could have the following content: ", "page_idx": 18}, {"type": "text", "text": "Answer: We know that Sandy’s monthly phone bill is 10 times her age. In two years, Sandy will be 3 times as old as Kim. The sum of Sandy’s age now and 2 years is 3 times the sum of Kim’s age now and two years. $\\mathrm{ln}S$ andy’s age now is $340/10=\\ll340/10{=}34\\gg34$ . In two years, Sandy’s age will be $34+2={\\ll}34{+}2{=}36{\\gg}36.\\mathrm{{ln}}$ ", "page_idx": 18}, {"type": "text", "text": "The parent of this node has the content: ", "page_idx": 18}, {"type": "table", "img_path": "tPdJ2qHkOB/tmp/72b5131582f64f13ccb67de15d96d6dfb20d5ed018d7396ac18ee5a224e3cb4c.jpg", "table_caption": [], "table_footnote": [], "page_idx": 18}, {"type": "text", "text": "A.10 Critic Performance ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "We evaluated the performance of the value function and PRM on the GSM8K test set. Table 8 presents a comparison of these models in terms of precision, recall, and Expected Calibration Error (ECE). Results indicate that the value function achieves higher precision and better calibration, while PRM demonstrates a superior recall. ", "page_idx": 19}, {"type": "table", "img_path": "tPdJ2qHkOB/tmp/96dc85ba979dbec4c38f509c26caf360b3284f145b93aa016c19cbb9ae94683c.jpg", "table_caption": ["Table 8: Performance comparison of the Value Function model and PRM on the GSM8K test set. "], "table_footnote": [], "page_idx": 19}, {"type": "text", "text": "A.11 Compute Resources ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Our experiments were conducted using NVIDIA A100 40GB GPUs. Serving models based on Llama-2-70B or WizardMath-70B required 4 GPUs, while serving Llama-2-7B and Abel-002-7B was possible on a single GPU. Training the 70B models required 64 GPUs. ", "page_idx": 19}, {"type": "text", "text": "A.12 Limitations and Future Work ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Despite the promising results demonstrated by ALPHALLM in this study, there are several limitations that requires further exploration. (i) Our current implementation employs relatively simple methods for generating synthetic prompts. Future iterations of ALPHALLM should explore advanced techniques, such as Self-Instruct, to create both diverse and model capability-awared prompts. $(i i)$ Although ALPHALLM demonstrates improvements over base models, its performance in greedy sampling is substantially inferior to that observed when decoded with $\\eta\\mathbf{M}\\mathbf{C}\\mathrm{T}\\mathbf{S}$ . This indicates that the full potential of MCTS for self-improvement in LLMs has not yet been fully realized. Two potential factors contributing to this issue have been identified: a) the self-improvement loop may not be leveraging sufficient data; and b) the base model may be limited in its capacity for rapid learning. Addressing these concerns could lead to more significant improvemens. $(i i i)$ In our existing framework, the critic models remain static. We will explore mechanisms to continually update critic models to adapt to new policy models. This will help ensure the discriminator-generator gap and improve the overall training dynamics. $(i\\nu)$ The evaluation of ALPHALLM has been limited to mathematical reasoning tasks. To verify the generalizability and broader applicability of the framework, future research will need to extend its application to other domains. ", "page_idx": 19}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 20}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 20}, {"type": "text", "text": "Justification: Yes the claims are accurately made. ", "page_idx": 20}, {"type": "text", "text": "Guidelines: ", "page_idx": 20}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 20}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 20}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Justification: Yes we discussed the limitations in Appendix. ", "page_idx": 20}, {"type": "text", "text": "Guidelines: ", "page_idx": 20}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 20}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 20}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 20}, {"type": "text", "text": "Justification: We provide the assumptions and proofs for the Theorem 4.1. and other theoretical results. ", "page_idx": 21}, {"type": "text", "text": "Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 21}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 21}, {"type": "text", "text": "Justification: We provided the hyoerparameters to reproduce the results. ", "page_idx": 21}, {"type": "text", "text": "Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 21}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 22}, {"type": "text", "text": "Justification: The code is available at https://github.com/YeTianJHU/AlphaLLM. Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 22}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 22}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 22}, {"type": "text", "text": "Justification: Yes training and test details are mentioned. Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 22}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 22}, {"type": "text", "text": "Answer: [No] ", "page_idx": 22}, {"type": "text", "text": "Justification: Error bars are not included in our experiment results due to the high computational cost. ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 22}, {"type": "text", "text": "", "page_idx": 23}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: We provide the information of the compute resources we used in the Appendix. Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 23}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: Yes the research conform NeurIPS Code of Ethics. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 23}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 23}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 23}, {"type": "text", "text": "Justification: This work primarily focuses on foundational research in algorithm improvement and, as such, does not have a direct societal impact. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed.   \n• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 23}, {"type": "text", "text": "", "page_idx": 24}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 24}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 24}, {"type": "text", "text": "Justification: The paper has no such risks. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 24}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 24}, {"type": "text", "text": "Justification: The datasets and models used in this paper are properly cited. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided. ", "page_idx": 24}, {"type": "text", "text": "• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 25}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 25}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 25}, {"type": "text", "text": "Justification: We didn’t release new assets. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 25}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 25}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 25}, {"type": "text", "text": "Justification: This paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 25}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 25}, {"type": "text", "text": "Answer: [NA] ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Justification: This paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 25}]