[{"figure_path": "ZJjuNF0olj/tables/tables_5_1.jpg", "caption": "Table 1: The Floating-Point Operations per Second(FLOPs), and speed of the model variants.", "description": "This table presents the specifications of two DeTrack model variants: DeTrack256 and DeTrack384.  It shows the template size, search region size, number of floating-point operations per second (FLOPs), speed in frames per second (FPS), and the device used for processing (RTX3090).  The different sizes reflect variations in input resolution and processing demands.", "section": "4.1 Implementation Details"}, {"figure_path": "ZJjuNF0olj/tables/tables_6_1.jpg", "caption": "Table 2: State-of-the-art comparison on AVisT [36], GOT-10k [30], LaSOT [14] and LaSOText [15]. Where * denotes our model only trained on GOT-10k. The best results are highlighted in bold.", "description": "This table presents a comparison of the proposed DeTrack model's performance against other state-of-the-art visual object tracking methods on four benchmark datasets: AVisT, GOT-10k, LaSOT, and LaSOText.  The results are shown in terms of AUC (Area Under the Curve), and other metrics like OP50, OP75, SR0.5, SR0.75, P, and PNorm, which are specific evaluation metrics for each dataset.  The table highlights DeTrack's competitive performance, particularly when compared to similar methods using similar resolutions (e.g., DeTrack256 vs. SeqTrack256).  The * indicates that DeTrack was also evaluated after training only on the GOT-10k dataset.", "section": "4.2 State-of-the-Art Comparisons"}, {"figure_path": "ZJjuNF0olj/tables/tables_7_1.jpg", "caption": "Table 3: Ablation study of denoising steps on GOT-10k. The best results are highlighted in bold.", "description": "This table presents the ablation study on the number of denoising steps in the DeTrack model, evaluated on the GOT-10k dataset.  It shows the impact of varying the number of denoising steps (from 1 to 12) on the model's performance, measured by Average Overlap (AO), Success Rate at 0.5 overlap threshold (SR0.5), and Success Rate at 0.75 overlap threshold (SR0.75). The best performance for each metric is highlighted in bold, indicating the optimal number of denoising steps for the model.", "section": "4.3 Ablation study on Denoising Learning"}, {"figure_path": "ZJjuNF0olj/tables/tables_7_2.jpg", "caption": "Table 8: Ablation study of denoising paradigm on GOT-10k (Vit-Small). The best results are highlighted in bold.", "description": "This table presents the results of an ablation study comparing different denoising paradigms (multiple forward passes vs. single forward pass) and varying numbers of steps within the denoising process.  The study was performed using the GOT-10k dataset and a ViT-Small backbone.  The table shows the Average Overlap (AO), Success Rates at 0.5 overlap threshold (SR<sub>0.5</sub>), Success Rates at 0.75 overlap threshold (SR<sub>0.75</sub>), Floating Point Operations (FLOPS), and speed (in FPS) for each configuration.  The best performing configuration for each metric is highlighted in bold, providing insights into the optimal balance between denoising effectiveness and computational efficiency.", "section": "4.3 Ablation study on Denoising Learning"}, {"figure_path": "ZJjuNF0olj/tables/tables_12_1.jpg", "caption": "Table 6: The differences between DDPM[26], DAE[40], and DeTrack[40].", "description": "This table highlights the key differences between three denoising methods: Denoising Diffusion Probabilistic Models (DDPM), Denoising Autoencoders (DAE), and the proposed DeTrack method.  It compares the noise type used, the input type, encoding and decoding processes, optimization objectives, and inference procedures. The table shows that DeTrack differs significantly in how it handles noisy input (bounding boxes instead of images), incorporates denoising in a multi-layer fashion within a single model pass, and focuses on precise bounding box localization. ", "section": "A Appendix"}, {"figure_path": "ZJjuNF0olj/tables/tables_13_1.jpg", "caption": "Table 7: Comparison of noise prediction pattern on GOT-10k. The best results are highlighted in bold.", "description": "This table compares the performance of two different noise prediction methods in the DeTrack model on the GOT-10k dataset.  The methods are 'Predicting the total noise' and 'Predicting noise layer by layer'. The table shows the Average Overlap (AO), Success Rate at 0.5 overlap (SR0.5), and Success Rate at 0.75 overlap (SR0.75) for each method.  The results indicate that predicting noise layer-by-layer yields better performance compared to predicting total noise at once.", "section": "A.2 Comparison of noise prediction pattern"}, {"figure_path": "ZJjuNF0olj/tables/tables_13_2.jpg", "caption": "Table 8: Ablation study of denoising paradigm on GOT-10k (Vit-Small). The best results are highlighted in bold.", "description": "This table presents the ablation study of different denoising paradigms and step settings evaluated on the GOT-10k dataset using a ViT-Small backbone.  The results show the Average Overlap (AO) and Success Rates at two different overlap thresholds (SR0.5 and SR0.75) for various numbers of steps.  It compares the performance of multiple forward passes versus a single forward pass of the denoising process.  The highlighted bold numbers indicate the best performing configuration across the metrics.", "section": "4.3 Ablation study on Denoising Learning"}, {"figure_path": "ZJjuNF0olj/tables/tables_14_1.jpg", "caption": "Table 9: Comparison of Configurations between DiffusionTrack and DeTrack.", "description": "This table compares the encoder and decoder configurations used in two different visual object tracking models: DiffusionTrack and DeTrack.  Both models utilize a DeTrack encoder, but they differ in their decoder. DiffusionTrack uses the DiffusionDet decoder, while DeTrack employs its own custom decoder. This highlights a key architectural difference between the two models.", "section": "A.4 Applying DiffusionDet to Tracking"}, {"figure_path": "ZJjuNF0olj/tables/tables_14_2.jpg", "caption": "Table 10: Performance Comparison on GOT-10k between DiffusionTrack and DeTrack. The best results are highlighted in bold.", "description": "This table compares the performance of DiffusionTrack and DeTrack on the GOT-10k dataset.  It shows the Average Overlap (AO), Success Rate at 0.5 overlap (SR<sub>0.5</sub>), Success Rate at 0.75 overlap (SR<sub>0.75</sub>), and the number of floating point operations (FLOPs) for different numbers of denoising steps for both methods.  DeTrack consistently outperforms DiffusionTrack in terms of AO, SR<sub>0.5</sub>, and SR<sub>0.75</sub>, while maintaining comparable or lower FLOPs.", "section": "A.5 Comparison on GOT-10k between DiffusionTrack and DeTrack"}]