[{"figure_path": "GNhrGRCerd/tables/tables_6_1.jpg", "caption": "Table 1: Defense comparison against various MI attacks, using VGG-16 models.", "description": "This table presents a comparison of different defense mechanisms against three different model inversion (MI) attacks: Generative Model Inversion (GMI), Knowledge-Enhanced Distributional Model Inversion (KED-MI), and Pseudo Label-guided Model Inversion (PLG-MI).  The defenses compared include MID, BiDO, NegLS, and Trap-MID. The table shows the attack accuracy (AA), K-Nearest Neighbor Distance (KNN Dist), and Fréchet Inception Distance (FID) for each defense method against each attack.  Higher values for KNN Dist and FID indicate better defense performance. Lower values for AA indicate better defense performance.", "section": "4.2 Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_7_1.jpg", "caption": "Table 1: Defense comparison against various MI attacks, using VGG-16 models.", "description": "This table presents a comparison of different defense mechanisms against three different model inversion attacks (GMI, KED-MI, and PLG-MI) using the VGG-16 model.  The table shows the attack accuracy (AA-1 and AA-5), KNN distance, and FID for each defense method, allowing for a quantitative comparison of their effectiveness in mitigating these attacks.  Lower values for AA-1 and AA-5, and higher values for KNN distance and FID generally indicate better defense performance. The defense methods compared include MID, BiDO, NegLS, and Trap-MID.", "section": "4.2 Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_8_1.jpg", "caption": "Table 3: Synthetic distribution analysis.", "description": "This table presents the results of an analysis conducted to determine whether the generator used in the PLG-MI attack primarily reconstructs images from the public or private data distribution after training with Trap-MID.  It shows the attack accuracy, along with the percentage of nearest neighbors found in the public and private datasets for each generated image, across multiple attack methods. The goal is to understand how effective Trap-MID is at causing the attack to leverage public data instead of private data.", "section": "4.2 Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_9_1.jpg", "caption": "Table 4: Adaptive attacks against Trap-MID, using VGG-16 models.", "description": "This table presents the results of adaptive attacks against Trap-MID using VGG-16 models.  The adaptive attacks leverage knowledge of the trapdoor signatures.  The table shows the attack accuracy (AA-1, AA-5), KNN distance, and FID for CelebA and FFHQ datasets under both PLG-MI and the modified PLG-MI++ adaptive attack.", "section": "4 Experiments"}, {"figure_path": "GNhrGRCerd/tables/tables_19_1.jpg", "caption": "Table 5: Defense comparison with TeD's trapdoors, using VGG-16 models.", "description": "This table compares the defense performance of Trap-MID against various model inversion attacks (GMI, KED-MI, LOMMA, and PLG-MI) with different trigger injection methods, including TeD's method and Trap-MID's method.  It shows the attack accuracy (AA-1 and AA-5), KNN distance, and FID for each attack method and defense strategy.  The results demonstrate the superiority of Trap-MID in mitigating these attacks.", "section": "4.2 Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_20_1.jpg", "caption": "Table 1: Defense comparison against various MI attacks, using VGG-16 models.", "description": "This table presents a comparison of different defense mechanisms against various model inversion (MI) attacks using the VGG-16 model.  The table shows the performance of different defense methods (MID, BiDO, NegLS, and Trap-MID) in terms of accuracy, attack accuracy (AA-1, AA-5), KNN distance, and FID.  The results demonstrate the relative effectiveness of each defense against different MI attack variations (GMI, KED-MI, and PLG-MI).", "section": "4.2 Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_21_1.jpg", "caption": "Table 7: Defense comparison with different blend ratios, using VGG-16 models.", "description": "This table presents a comparison of the defense performance of Trap-MID against various model inversion attacks (GMI, KED-MI, LOMMA, and PLG-MI) using different blend ratios (α). The blend ratio controls the strength of the trapdoor injection. The results show how different blend ratios affect the accuracy of the model and its ability to defend against MI attacks.  Lower blend ratios generally result in better defense performance but might slightly reduce the overall accuracy.", "section": "4.2 Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_22_1.jpg", "caption": "Table 1: Defense comparison against various MI attacks, using VGG-16 models.", "description": "This table presents a comparison of different defense mechanisms against various model inversion (MI) attacks using the VGG-16 model.  The table shows the attack accuracy (AA-1 and AA-5), K-Nearest Neighbor Distance (KNN Dist), and Fréchet Inception Distance (FID) for each defense method.  Lower attack accuracy, higher KNN distance, and higher FID indicate better defense performance. The defenses compared include MID, BiDO, NegLS, and Trap-MID, with Trap-MID showing superior performance across all attacks.", "section": "4.2 Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_24_1.jpg", "caption": "Table 9: Training time comparison, using VGG-16 models.", "description": "This table presents a comparison of the training times required for different defense methods, namely, no defense, MID, BiDO, NegLS, and Trap-MID, all using VGG-16 models.  It shows that Trap-MID has a significantly longer training time than the other methods.", "section": "E Additional Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_24_2.jpg", "caption": "Table 10: The worst-case performance of Trap-MID compared to the best-case performance of existing defenses, using VGG-16 models.", "description": "This table compares the worst-case performance of the Trap-MID defense against various model inversion attacks with the best-case performance of existing defenses (MID, BiDO, NegLS).  It shows that even in its worst-case scenarios, Trap-MID outperforms other defenses in terms of attack accuracy (AA-1, AA-5), KNN distance, and FID, demonstrating its robustness.", "section": "4.2 Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_25_1.jpg", "caption": "Table 11: Defense comparison against PLG-MI, using VGG-16 models and measuring with additional evaluation metrics.", "description": "This table compares the performance of different defense methods against the PLG-MI attack, using a VGG-16 model.  It provides a detailed comparison using several metrics beyond simple attack accuracy. These include: Accuracy, FaceNet feature distance (face), Improved Precision and Recall, Density, and Coverage. These metrics offer a more comprehensive assessment of the effectiveness of the defenses by examining various aspects of the reconstructed images' similarity to the original private data.", "section": "4.2 Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_26_1.jpg", "caption": "Table 1: Defense comparison against various MI attacks, using VGG-16 models.", "description": "This table presents a comparison of different defense mechanisms against various model inversion (MI) attacks using VGG-16 models.  The table shows the performance of different defenses in terms of accuracy, attack accuracy (top-1 and top-5), KNN distance, and FID.  The results demonstrate the effectiveness of the proposed Trap-MID defense compared to existing methods.", "section": "4.2 Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_27_1.jpg", "caption": "Table 1: Defense comparison against various MI attacks, using VGG-16 models.", "description": "This table compares the performance of Trap-MID against several state-of-the-art model inversion (MI) attacks, using a VGG-16 model.  It shows the attack accuracy (AA-1 and AA-5), KNN distance, and FID for various defenses (MID, BiDO, NegLS, and Trap-MID) against three different MI attacks (GMI, KED-MI, and PLG-MI).  The metrics provide a quantitative measure of how well each defense protects against MI attacks.", "section": "4.2 Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_28_1.jpg", "caption": "Table 14: Defense comparison against PLG-MI with FFHQ dataset, using VGG-16 models.", "description": "This table compares the performance of different defense methods against the PLG-MI attack when using the FFHQ dataset as the auxiliary dataset for the attack.  It shows the attack accuracy (AA-1 and AA-5), KNN distance, and FID for each defense method, providing a comprehensive evaluation of their effectiveness in mitigating privacy leakage.", "section": "4.2 Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_29_1.jpg", "caption": "Table 1: Defense comparison against various MI attacks, using VGG-16 models.", "description": "This table presents a comparison of different defense mechanisms against three model inversion attacks (GMI, KED-MI, and PLG-MI) using the VGG-16 model.  It shows the attack accuracy (AA-1 and AA-5), KNN distance, and FID for each defense method. The results demonstrate the effectiveness of Trap-MID in mitigating MI attacks compared to other baselines (MID, BiDO, and NegLS).", "section": "4.2 Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_29_2.jpg", "caption": "Table 1: Defense comparison against various MI attacks, using VGG-16 models.", "description": "This table presents a comparison of different defense methods against various model inversion (MI) attacks using VGG-16 models.  It shows the attack accuracy (AA-1 and AA-5, representing top-1 and top-5 accuracy, respectively), KNN distance (a measure of similarity between reconstructed and private data), and FID (Fréchet Inception Distance, a measure of image quality and diversity). Lower AA-1, AA-5, and higher KNN Dist, FID values indicate better defense performance.", "section": "4.2 Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_30_1.jpg", "caption": "Table 1: Defense comparison against various MI attacks, using VGG-16 models.", "description": "This table presents a comparison of different defense methods against various model inversion (MI) attacks using VGG-16 models.  It shows the attack accuracy (AA-1 and AA-5), K-Nearest Neighbor distance (KNN Dist), and Fréchet Inception Distance (FID) for each defense method.  The table helps to illustrate the effectiveness of each defense against different MI attacks and highlights the performance of Trap-MID in comparison to existing methods.", "section": "4.2 Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_30_2.jpg", "caption": "Table 18: Defense comparison against BREP-MI, using untargeted attacks to recover 300 identities.", "description": "This table compares the performance of different defense methods against BREP-MI attacks, which is a label-only attack.  The table shows the accuracy (Acc) of each defense method when the attacker tries to recover 300 identities, the number of initial iterations required for successful recovery and the top-1 attack accuracy (AA-1) which measures how well the attack reconstructs images.", "section": "4.2 Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_31_1.jpg", "caption": "Table 1: Defense comparison against various MI attacks, using VGG-16 models.", "description": "This table compares the performance of Trap-MID against other defense methods (MID, BiDO, and NegLS) when facing various model inversion (MI) attacks (GMI, KED-MI, and PLG-MI).  It shows the attack accuracy (AA-1, AA-5), KNN distance, and FID values for each defense method and attack. Higher values for KNN distance and FID indicate that the recovered images are less similar to the private images.", "section": "4.2 Experimental Results"}, {"figure_path": "GNhrGRCerd/tables/tables_31_2.jpg", "caption": "Table 20: Additional evaluation results of the defense performance against PPA.", "description": "This table presents additional evaluation metrics for the defense performance against PPA attacks.  The metrics include Precision, Recall, Density, and Coverage, all calculated in the InceptionV3 feature space. Lower values generally indicate better defense performance. The table shows the results for three different model architectures (ResNeSt-101, ResNet-152, and DenseNet-169) with and without Trap-MID and fine-tuning.", "section": "E Additional Experimental Results"}]