[{"figure_path": "rIOTceoNc8/figures/figures_4_1.jpg", "caption": "Figure 1: Example of uniform coarsening. (a): original graph G; (b): coarsened adjacency matrix Ac; (c) representation of the proposed SMP when S = A; (d): corresponding matrices Q, Q+, I.", "description": "This figure shows an example of a uniform graph coarsening. (a) shows the original graph G. (b) shows the coarsened adjacency matrix Ac which represents the connections between the supernodes in the coarsened graph. (c) illustrates the proposed SMP (Specific Message-Passing matrix) for the case when S = A (adjacency matrix), highlighting the orientation of message passing even when the original graph is undirected. (d) displays the coarsening matrix Q, its pseudo-inverse Q+, and the projection matrix I = Q+Q, demonstrating the mathematical relationships involved in the coarsening process.", "section": "2 Background on Graph Coarsening"}, {"figure_path": "rIOTceoNc8/figures/figures_7_1.jpg", "caption": "Figure 2: Message-Passing error for different propagation matrices.", "description": "This figure shows the message-passing error for different propagation matrices (SMP, Sc, Sdiag, Sdiff, Ssym) against the coarsening ratio (r). The error is calculated as the L2 norm of the difference between the message-passing on the original graph and the lifted message-passing on the coarsened graph.  The plot demonstrates that the proposed SMP matrix consistently outperforms other methods in minimizing this error, especially at higher coarsening ratios. The upper bound  (CEL,Q,R) derived from Theorem 1 is also plotted, showing a positive correlation with the error of SMP.", "section": "Experiments"}, {"figure_path": "rIOTceoNc8/figures/figures_17_1.jpg", "caption": "Figure 1: Example of uniform coarsening. (a): original graph G; (b): coarsened adjacency matrix Ac; (c) representation of the proposed SMP when S = A; (d): corresponding matrices Q, Q+, I.", "description": "This figure illustrates an example of uniform graph coarsening.  Panel (a) shows the original graph G. Panel (b) displays the coarsened adjacency matrix Ac, representing the connections in the coarsened graph. Panel (c) depicts the proposed SMP (Specific Message Passing matrix) when the propagation matrix S is equal to the adjacency matrix A. Finally, Panel (d) shows the coarsening matrix Q, its pseudo-inverse Q+, and the projection operator I = Q+Q. This figure is essential to understanding the mathematical concepts behind graph coarsening and the construction of the new proposed propagation matrix.", "section": "2 Background on Graph Coarsening"}, {"figure_path": "rIOTceoNc8/figures/figures_18_1.jpg", "caption": "Figure 4: Uniform coarsening with nₑ = 5N/100 and Normalized Laplacian", "description": "This figure compares the message-passing error for different propagation matrices on uniformly coarsened graphs with a normalized Laplacian. The x-axis represents the coarsening ratio (r), and the y-axis represents the message-passing error. The plot shows that the proposed propagation matrix (SMP) has significantly lower error compared to other choices, especially for higher coarsening ratios. The figure includes two subplots: (a) Log-Log scale and (b) Linear-Linear scale, to better visualize the behavior at different coarsening ratios.", "section": "Experiments"}, {"figure_path": "rIOTceoNc8/figures/figures_18_2.jpg", "caption": "Figure 2: Message-Passing error for different propagation matrices.", "description": "This figure shows the Message-Passing error for different propagation matrices (SMP, Sc, Sdiag, Sdiff, Sym) as a function of the coarsening ratio (r).  The error is measured as ||Skx - Q+(SMP)kxc||L for various signals x, with Np = 6 message-passing steps. The figure illustrates the effectiveness of the proposed propagation matrix SMP in preserving message-passing guarantees compared to other methods, demonstrating that the error is correlated with the RSA constant.", "section": "Experiments"}, {"figure_path": "rIOTceoNc8/figures/figures_19_1.jpg", "caption": "Figure 4: Uniform coarsening with ne = 5N/100 and Normalized Laplacian", "description": "This figure shows the Message-Passing error for different propagation matrices with uniform coarsening (ne = 5N/100) and Normalized Laplacian.  The x-axis represents the coarsening ratio (r), and the y-axis represents the Message-Passing error. The plot compares the proposed SMP matrix with other propagation matrices (Sc, Sdiag, Sdiff, Ssym) for different coarsening ratios. The figure helps to evaluate the effectiveness of the proposed propagation matrix for preserving message-passing guarantees during graph coarsening.", "section": "Experiments"}]