{"references": [{"fullname_first_author": "Z. Allen-Zhu", "paper_title": "Spectral sparsification and regret minimization beyond matrix multiplicative updates", "publication_date": "2015", "reason": "This paper provides the theoretical foundation for spectral sparsification, a key concept in graph coarsening, establishing fundamental limits and algorithms for efficiently reducing graph size while preserving spectral properties."}, {"fullname_first_author": "M. M. Bronstein", "paper_title": "Geometric Deep Learning: Grids, Groups, Graphs, Geodesics, and Gauges", "publication_date": "2021", "reason": "This highly influential work provides a comprehensive overview of geometric deep learning, establishing the theoretical framework and various applications of graph neural networks, which are central to the paper's focus on message passing."}, {"fullname_first_author": "J. Chen", "paper_title": "Graph coarsening: from scientific computing to machine learning", "publication_date": "2022", "reason": "This review paper gives a thorough overview of graph coarsening techniques, which are essential to the paper's methodology, covering their history, various methods, and applications, offering valuable context to the paper's work."}, {"fullname_first_author": "M. Defferrard", "paper_title": "Convolutional neural networks on graphs with fast localized spectral filtering", "publication_date": "2016", "reason": "This paper introduced a fundamental approach to applying convolutional neural networks to graph data using spectral filtering, paving the way for many modern graph neural network architectures that are essential to the paper's context and evaluation."}, {"fullname_first_author": "T. N. Kipf", "paper_title": "Semi-supervised classification with graph convolutional networks", "publication_date": "2016", "reason": "This seminal paper introduced a widely adopted and highly influential graph convolutional network architecture (GCN) that forms the basis for many modern graph neural networks, directly impacting the experimental validation and comparison in this paper"}]}