[{"figure_path": "X64IJvdftR/tables/tables_6_1.jpg", "caption": "Table 1: Certified accuracy and running time of one image for the MDEQ-LARGE on CIFAR-10. The best certified accuracy for each radius is in bold and the time is compared with MDEQ-30A.", "description": "This table presents the certified accuracy and running time for a single image using the MDEQ-LARGE model on the CIFAR-10 dataset.  It compares the standard MDEQ model with varying numbers of layers (1, 5, and 30) against the proposed Serialized Random Smoothing (SRS) method also with varying numbers of layers (1 and 3) using different solvers (Naive and Anderson). The best certified accuracy for each radius is highlighted in bold, and the running time for each model is shown relative to the MDEQ-30A model to illustrate the speedup achieved by SRS.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_6_2.jpg", "caption": "Table 2: Certified accuracy and running time of one image for the MDEQ-SMALL on CIFAR-10. The best certified accuracy for each radius is in bold and the time is compared with MDEQ-30A.", "description": "This table presents the certified accuracy and running time for different MDEQ models (MDEQ-1A, MDEQ-5A, MDEQ-30A) and the proposed SRS-MDEQ models (SRS-MDEQ-1N, SRS-MDEQ-1A, SRS-MDEQ-3A) on the CIFAR-10 dataset.  The results are shown for various certified radii (0.0, 0.25, 0.5, 0.75, 1.0, 1.25, 1.5).  The best certified accuracy for each radius is highlighted in bold.  The running time for each model is presented, and its speedup compared to the MDEQ-30A model is shown in parentheses.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_6_3.jpg", "caption": "Table 3: Certified accuracy and running time of one image for the MDEQ-SMALL on ImageNet. The best certified accuracy for each radius is in bold and the time is compared with MDEQ-14B.", "description": "This table presents the certified accuracy and running time for the MDEQ-SMALL model on the ImageNet dataset.  The results are shown for various certified radii (0.0 to 3.0). The best certified accuracy for each radius is highlighted in bold.  The table also compares the running times of the standard MDEQ-14B model with the proposed SRS-MDEQ-1B and SRS-MDEQ-3B models, showing the speedup achieved by the SRS approach.  The speedup factors are indicated in parentheses.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_8_1.jpg", "caption": "Table 1: Certified accuracy and running time of one image for the MDEQ-LARGE on CIFAR-10. The best certified accuracy for each radius is in bold and the time is compared with MDEQ-30A.", "description": "This table presents the certified accuracy and running time for classifying a single image using the MDEQ-LARGE model on the CIFAR-10 dataset.  Different certified radii are tested, and the best accuracy achieved for each radius is highlighted in bold.  The table also compares the runtime of the proposed Serialized Random Smoothing (SRS) approach to the standard MDEQ-30A approach, demonstrating the speedup achieved by SRS.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_8_2.jpg", "caption": "Table 5: Certified accuracy for the MDEQ-SMALL architecture with σ = 0.5 on CIFAR-10 using SmoothAdv. The maximum norm e of PGD is set as 0.5 and the number of steps T is set as 2.", "description": "This table presents the certified accuracy results for the MDEQ-SMALL architecture on the CIFAR-10 dataset using SmoothAdv, a more advanced randomized smoothing method.  The experiment uses Projected Gradient Descent (PGD) with a maximum norm of 0.5 and 2 steps. The results are compared with standard randomized smoothing results for various numbers of layers in the MDEQ model.  It highlights the impact of SmoothAdv on the certified accuracy of DEQs for different levels of perturbation.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_13_1.jpg", "caption": "Table 6: Model hyperparameters in our experiments.", "description": "This table lists the hyperparameters used in the experiments for different model architectures (MDEQ-SMALL, MDEQ-LARGE) on the CIFAR-10 and ImageNet datasets.  It specifies the input image size, the type of residual block used (BASIC or BOTTLENECK), the number of branches in the multi-resolution architecture, the number of channels at each resolution level, the number of head channels, and the final channel size.", "section": "4.1 Experiment Settings"}, {"figure_path": "X64IJvdftR/tables/tables_14_1.jpg", "caption": "Table 7: Ablation study of Jacobian regularization for the MDEQ-SMALL architecture with σ = 0.5 on CIFAR-10.", "description": "This table presents an ablation study to investigate the impact of Jacobian regularization on the performance of MDEQ and SRS-MDEQ models on the CIFAR-10 dataset. It compares the certified accuracy for different radius values (0.0 to 1.5) using the MDEQ-30A model with and without Jacobian regularization, and also with its SRS-MDEQ-3A counterpart.  This helps to understand whether Jacobian regularization is a necessary component of the proposed approach or if it can be removed without significantly affecting performance.", "section": "4.3 Ablation Study"}, {"figure_path": "X64IJvdftR/tables/tables_15_1.jpg", "caption": "Table 8: Training hyperparameters in our experiments.", "description": "This table details the training hyperparameters used in the experiments described in the paper.  It includes settings for batch size, epochs, optimizer, learning rate, learning rate schedule, momentum, weight decay, Jacobian regularization strength, and Jacobian regularization frequency. These parameters were used to train the MDEQ (Multi-resolution Deep Equilibrium Model) models on CIFAR-10 and ImageNet datasets.  Different parameter settings are shown for the different model sizes (SMALL and LARGE) and datasets used.", "section": "4.1 Experiment Settings"}, {"figure_path": "X64IJvdftR/tables/tables_15_2.jpg", "caption": "Table 9: Comparison with existing certification methods and SRS-MDEQ-LARGE. The best certified accuracy is in bold.", "description": "This table compares the certified accuracy of the proposed Serialized Randomized Smoothing (SRS)-based Deep Equilibrium Model (DEQ) with existing methods such as Lipschitz Bound and existing randomized smoothing methods on the CIFAR-10 dataset. Different certified radii (r) are used for comparison. The results show that SRS-MDEQ achieves better certified accuracy compared to other methods.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_16_1.jpg", "caption": "Table 10: Certified accuracy for MDEQ-LARGE with σ = 0.12 on CIFAR-10.", "description": "This table shows the certified accuracy for the MDEQ-LARGE model on the CIFAR-10 dataset using different certified radii and a noise level (σ) of 0.12.  It compares the certified accuracy of the standard MDEQ model against the proposed SRS-MDEQ model with varying numbers of layers (1, 3, and 5) and solvers (Naive and Anderson).  The best certified accuracy is highlighted in bold for each radius.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_16_2.jpg", "caption": "Table 1: Certified accuracy and running time of one image for the MDEQ-LARGE on CIFAR-10. The best certified accuracy for each radius is in bold and the time is compared with MDEQ-30A.", "description": "This table shows the certified accuracy and running time for different models on the CIFAR-10 dataset using the MDEQ-LARGE architecture with varying radii.  The certified accuracy represents the percentage of test images correctly classified and certified within a specified radius, while the running time indicates the computational cost for certifying a single image. The best certified accuracies for each radius are highlighted in bold. The time taken by the MDEQ-30A model is used as a baseline to compare the computational efficiency of other models.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_17_1.jpg", "caption": "Table 1: Certified accuracy and running time of one image for the MDEQ-LARGE on CIFAR-10. The best certified accuracy for each radius is in bold and the time is compared with MDEQ-30A.", "description": "This table presents a comparison of the certified accuracy and running time for different model architectures on the CIFAR-10 dataset using the MDEQ-LARGE model.  The certified accuracy is shown for various radii (distances from the original data point), and the running time is presented relative to a baseline model (MDEQ-30A).  The table showcases the performance of both the standard MDEQ and the proposed SRS-MDEQ approaches, highlighting the trade-off between accuracy and computational efficiency.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_17_2.jpg", "caption": "Table 1: Certified accuracy and running time of one image for the MDEQ-LARGE on CIFAR-10. The best certified accuracy for each radius is in bold and the time is compared with MDEQ-30A.", "description": "This table presents a comparison of the certified accuracy and computation time for various models on the CIFAR-10 dataset.  It contrasts the performance of standard MDEQ models (with varying numbers of layers) against the proposed SRS-MDEQ models. The comparison highlights the significant speedup achieved by the SRS-MDEQ method without sacrificing much certified accuracy.  The time improvement is shown relative to the MDEQ-30A model.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_17_3.jpg", "caption": "Table 1: Certified accuracy and running time of one image for the MDEQ-LARGE on CIFAR-10. The best certified accuracy for each radius is in bold and the time is compared with MDEQ-30A.", "description": "This table presents the certified accuracy and running time for different models on the CIFAR-10 dataset using the MDEQ-LARGE architecture.  It compares the standard MDEQ with different numbers of layers (1, 5, and 30) against the proposed SRS-MDEQ method with various numbers of layers and solvers (N and A).  The best certified accuracy for each radius is highlighted in bold, and the running time for each model is shown relative to the MDEQ-30A model. This comparison demonstrates the significant speedup achieved by the SRS-MDEQ method with minimal impact on accuracy.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_17_4.jpg", "caption": "Table 2: Certified accuracy and running time of one image for the MDEQ-SMALL on CIFAR-10. The best certified accuracy for each radius is in bold and the time is compared with MDEQ-30A.", "description": "This table presents a comparison of the certified accuracy and computational time for different model configurations on the CIFAR-10 dataset, focusing on the MDEQ-SMALL architecture. The results are broken down by the certified radius (0.0 to 1.5). The best certified accuracy for each radius is highlighted in bold.  The computational time is also presented, providing a relative speedup factor compared to a baseline MDEQ-30A model.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_18_1.jpg", "caption": "Table 3: Certified accuracy and running time of one image for the MDEQ-SMALL on ImageNet. The best certified accuracy for each radius is in bold and the time is compared with MDEQ-14B.", "description": "This table shows the certified accuracy and running time for different radius values for MDEQ-SMALL model on ImageNet dataset.  The results are compared against a baseline (MDEQ-14B). The best accuracy for each radius is highlighted in bold, providing a direct comparison of the proposed method (SRS-MDEQ) with the baseline model across various layers (depth) and solvers, showcasing improvements in speed without significant accuracy loss.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_18_2.jpg", "caption": "Table 3: Certified accuracy and running time of one image for the MDEQ-SMALL on ImageNet. The best certified accuracy for each radius is in bold and the time is compared with MDEQ-14B.", "description": "This table presents the certified accuracy and running time for different models on ImageNet dataset. The best certified accuracy for each radius is highlighted in bold.  The time taken for each model is also given and compared to MDEQ-14B as a baseline.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_18_3.jpg", "caption": "Table 1: Certified accuracy and running time of one image for the MDEQ-LARGE on CIFAR-10. The best certified accuracy for each radius is in bold and the time is compared with MDEQ-30A.", "description": "This table presents a comparison of certified accuracy and running time for different models on the CIFAR-10 dataset using the MDEQ-LARGE architecture.  It shows the certified accuracy (ACR) at different certified radii (0.0 to 1.5) for several models: MDEQ-1A, MDEQ-5A, MDEQ-30A, SRS-MDEQ-1N, SRS-MDEQ-1A, and SRS-MDEQ-3A.  The best certified accuracy for each radius is highlighted in bold.  Additionally, the table compares the running time of each model to that of MDEQ-30A, showing the speedup achieved by the Serialized Randomized Smoothing (SRS) method.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_18_4.jpg", "caption": "Table 2: Certified accuracy and running time of one image for the MDEQ-SMALL on CIFAR-10. The best certified accuracy for each radius is in bold and the time is compared with MDEQ-30A.", "description": "This table presents the certified accuracy and running time for different model configurations (MDEQ-1A, MDEQ-5A, MDEQ-30A, SRS-MDEQ-1N, SRS-MDEQ-1A, SRS-MDEQ-3A) on the CIFAR-10 dataset.  The results are shown for various certified radii (0.0, 0.25, 0.5, 0.75, 1.0, 1.25, 1.5). The best certified accuracy for each radius is highlighted in bold.  Running times are given relative to MDEQ-30A to demonstrate the speedup achieved by the Serialized Randomized Smoothing (SRS) approach.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_18_5.jpg", "caption": "Table 3: Certified accuracy and running time of one image for the MDEQ-SMALL on ImageNet. The best certified accuracy for each radius is in bold and the time is compared with MDEQ-14B.", "description": "This table presents the certified accuracy and running time for different models on the ImageNet dataset. The models are compared based on their certified accuracy with varying radii and the running time for each model. The best certified accuracy for each radius is highlighted in bold. The running times are presented relative to the baseline model MDEQ-14B, allowing for a direct comparison of the efficiency of different models.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_19_1.jpg", "caption": "Table 21: Certified accuracy of MDEQ-SMALL with different solvers on CIFAR-10.", "description": "This table presents the certified accuracy results for the MDEQ-SMALL architecture on CIFAR-10, comparing the performance of different fixed-point solvers (Naive and Anderson) with varying numbers of layers (30).  The results highlight the impact of the solver choice on the model's certified robustness.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_19_2.jpg", "caption": "Table 22: The mean RRD measurements over all images.", "description": "This table presents the mean Relative Radius Difference (RRD) values calculated for various solver configurations (Anderson and Naive solvers, with 1 and 3 steps).  The RRD metric quantifies the difference between the certified radius produced by the proposed Serialized Randomized Smoothing (SRS) method and the accurate radius obtained from a standard DEQ for each image. Lower RRD values indicate better agreement between the SRS and DEQ certified radii, thereby suggesting the efficacy of the proposed SRS approach. The results are separately shown for MDEQ-SMALL and MDEQ-LARGE models to illustrate the effect of model size on the RRD.", "section": "H Instance-Level Consistency"}, {"figure_path": "X64IJvdftR/tables/tables_21_1.jpg", "caption": "Table 9: Comparison with existing certification methods and SRS-MDEQ-LARGE. The best certified accuracy is in bold.", "description": "This table compares the certified accuracy of the proposed Serialized Randomized Smoothing (SRS)-MDEQ method with existing methods such as SLL (Lipschitz Bound) and LBEN (Lipschitz Bound) across various certified radii (r).  The best certified accuracy for each radius is highlighted in bold.  The table shows that SRS-MDEQ outperforms the existing methods in terms of certified accuracy.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_24_1.jpg", "caption": "Table 24: Certified accuracy for the MDEQ-LARGE architecture with σ = 0.5 on CIFAR-10. The first two rows represent the results starting from clean data, while the latter two rows represent the results starting from the previous fixed-point solutions.", "description": "This table presents the certified accuracy results for the MDEQ-LARGE architecture on the CIFAR-10 dataset using a noise level (σ) of 0.5.  The results are broken down by certified radius and whether the model's initialization started from clean data or the previous fixed-point solution from a previous noisy sample. Comparing the results reveals the impact of using the previous solution as initialization in the Serialized Randomized Smoothing method.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_24_2.jpg", "caption": "Table 25: The empirical performance of the randomized smoothing on LARGE-SRS-MDEQ-3A.", "description": "This table presents the empirical robustness of the LARGE-SRS-MDEQ-3A model against the Projected Gradient Descent (PGD) attack and its smoothed variant, Smooth-PGD.  It shows the accuracy of the model under different attack strengths (m) and certified radii.  The certified accuracy represents the theoretically guaranteed robustness, while the other rows demonstrate the empirical robustness against different attack strategies.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_24_3.jpg", "caption": "Table 26: The empirical performance of the randomized smoothing on SMALL-SRS-MDEQ-3A.", "description": "This table presents the empirical robustness results of the SMALL-SRS-MDEQ-3A model against the Projected Gradient Descent (PGD) attack and its smoothed variant, Smooth-PGD, with different perturbation magnitudes (r).  The \"Certified\" row indicates the theoretically guaranteed robustness from the randomized smoothing method, while the other rows show the empirical accuracy under different PGD attacks with varying numbers of iterations (m). The results demonstrate the model's robustness against these attacks, with the empirical accuracy consistently above the certified level for most radii.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_25_1.jpg", "caption": "Table 27: The point-wise successful attack rate of on LARGE-SRS-MDEQ-3A. The first number is the rate of successfully attacking the uncertified points. The second number is the rate of successfully attacking the certified points.", "description": "This table presents the results of point-wise successful attack rates on the LARGE-SRS-MDEQ-3A model under different attack methods and radii. For each radius and attack method, the table shows two numbers: the first is the percentage of uncertified points successfully attacked, while the second represents the percentage of certified points successfully attacked. The results indicate that even with stronger attacks, none of the certified points were successfully attacked.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}, {"figure_path": "X64IJvdftR/tables/tables_25_2.jpg", "caption": "Table 26: The empirical performance of the randomized smoothing on SMALL-SRS-MDEQ-3A.", "description": "This table presents the empirical robustness results of the SMALL-SRS-MDEQ-3A model against PGD and Smooth-PGD attacks.  The certified accuracy represents the theoretical guarantee of robustness, while the attack success rates (under various PGD parameters 'm') show the model's resilience against different attack strengths.  The results indicate that even stronger attacks (higher 'm') fail to breach the certified robustness.", "section": "4.2 Certification on CIFAR-10 and ImageNet"}]