[{"figure_path": "SKY1ScUTwA/tables/tables_9_1.jpg", "caption": "Table 1: Evaluation of GNAN on node (top) and graph (bottom) tasks. The best and second-best models are marked in cyan and violet colors, respectively. We report accuracy and std for all tasks, except for the Tolokers dataset where we report ROC-AUC and std, and the μ, α, AHOMO datasets where we report MAE and std.", "description": "This table presents the results of experiments comparing the performance of Graph Neural Additive Networks (GNAN) with several other Graph Neural Network (GNN) models on various node and graph classification and regression tasks.  The performance is measured by accuracy (with standard deviation) for most datasets and ROC-AUC (with standard deviation) for the Tolokers dataset and MAE (with standard deviation) for the μ, α, and ΔHOMO datasets. The best and second-best performing models for each task are highlighted.", "section": "5 Empirical evaluation"}, {"figure_path": "SKY1ScUTwA/tables/tables_18_1.jpg", "caption": "Table 1: Evaluation of GNAN on node (top) and graph (bottom) tasks. The best and second-best models are marked in cyan and violet colors, respectively. We report accuracy and std for all tasks, except for the Tolokers dataset where we report ROC-AUC and std, and the μ, α, AHOMO datasets where we report MAE and std.", "description": "This table presents the results of an empirical evaluation comparing the performance of Graph Neural Additive Networks (GNAN) against other state-of-the-art Graph Neural Networks (GNNs) on various node and graph classification/regression tasks.  The tasks include node classification tasks on citation networks (Cora, Citeseer, PubMed, ogb-arxiv, Cornell, Tolokers) and graph classification tasks on chemical compounds (NCI1, PTC, Proteins, Mutagen).  For each task, the table shows the accuracy (or ROC-AUC, MAE as appropriate) and standard deviation of GNAN and the other GNN models.  The best and second-best performing models for each task are highlighted.", "section": "Empirical evaluation"}]