[{"figure_path": "Y1fPxGevQj/tables/tables_7_1.jpg", "caption": "Table 1: Results of the toy experiments. We report AUPRC-2 scores of MIL explanation methods on three toy datasets measuring how well a method identified instances with positive and negative evidence scores (mean ± std. over 30 repetitions). The highest mean scores are bold and the second highest are underlined. We also display the model performances (\"Test AUROC\", mean ± std.).", "description": "This table presents the results of three toy experiments designed to evaluate the performance of different MIL explanation methods in identifying instances with positive, negative, and neutral evidence.  The experiments use MNIST images and evaluate three different MIL tasks (4-Bags, Pos-Neg, and Adjacent Pairs) measuring context sensitivity and positive/negative evidence handling. The table shows the Area Under the Precision-Recall Curve (AUPRC) scores for each method, highlighting the best-performing methods for each task. Additionally, model performance (Test AUROC) is included to provide context.", "section": "4.1 Toy experiments"}, {"figure_path": "Y1fPxGevQj/tables/tables_8_1.jpg", "caption": "Table 2: Results of the faithfulness experiments. AUPC values per dataset, MIL model, and explanation method (mean ± std. over all slides). Lower scores indicate higher faithfulness. The best performance per setting (significant minimum based on the paired t-tests) is highlighted in bold. We also display the model performances (“Test AUROC”, mean ± std. over 5 repetitions).", "description": "This table presents the results of faithfulness experiments comparing different MIL explanation methods.  Faithfulness is measured using AUPC (Area Under Perturbation Curve), where lower scores indicate higher faithfulness (better alignment between explanation scores and model predictions).  The table shows AUPC values for each method on four different datasets, broken down by MIL model (AttnMIL and TransMIL). Test AUROC scores (model performance) are also included for context.", "section": "4.2 Histopathology experiments"}]