[{"figure_path": "oQ1Zj9iH88/figures/figures_8_1.jpg", "caption": "Figure 1: Performances of methods in LRP.", "description": "This figure presents a comparison of different optimization methods' performance on a Logistic Regression Problem (LRP).  It shows the convergence of the residuals of the lower-level objective (G(x) - G*) and the upper-level objective (F(x) - F*) over time (in seconds).  The plot helps to visualize the speed and efficiency of various algorithms in solving this bilevel optimization problem. Different line styles and colors represent different algorithms.", "section": "4 Numerical experiments"}, {"figure_path": "oQ1Zj9iH88/figures/figures_26_1.jpg", "caption": "Figure 1: Performances of methods in LRP.", "description": "This figure shows the performance comparison of different optimization methods (PB-APG, aPB-APG, PB-APG-sc, aPB-APG-sc, MNG, BIG-SAM, DBGD, a-IRG, CG-BiO, Bi-SG, and R-APM) on the Logistic Regression Problem (LRP).  The plots illustrate the convergence of the lower-level objective (G(x)-G*) and the upper-level objective (F(x)) over time.  It demonstrates the faster convergence of the proposed penalty-based methods (PB-APG, etc.) compared to the existing methods.", "section": "4 Numerical experiments"}, {"figure_path": "oQ1Zj9iH88/figures/figures_26_2.jpg", "caption": "Figure 1: Performances of methods in LRP.", "description": "This figure compares the performance of several bilevel optimization methods on the Logistic Regression Problem (LRP). The x-axis represents time (in seconds), and the y-axis shows the values of the residuals for both the lower-level objective (G(xk) - G*) and the upper-level objective (F(xk) - F*). The figure demonstrates that the proposed PB-APG, aPB-APG, PB-APG-sc, and aPB-APG-sc algorithms exhibit significantly faster convergence than other methods for both lower- and upper-level objectives, although R-APM attains similar outcomes for the lower level objective.", "section": "4 Numerical experiments"}, {"figure_path": "oQ1Zj9iH88/figures/figures_27_1.jpg", "caption": "Figure 1: Performances of methods in LRP.", "description": "The figure shows the performance comparison of different optimization methods on the Logistic Regression Problem (LRP). The x-axis represents the time in seconds, and the y-axis shows the residuals of the lower-level objective (G(x<sub>k</sub>) - G*) and the upper-level objective (F(x<sub>k</sub>) - F*). The plot demonstrates that PB-APG, aPB-APG, PB-APG-sc, and aPB-APG-sc algorithms converge significantly faster than other methods for both lower- and upper-level objectives.", "section": "4 Numerical experiments"}, {"figure_path": "oQ1Zj9iH88/figures/figures_27_2.jpg", "caption": "Figure 1: Performances of methods in LRP.", "description": "This figure compares the performance of various optimization methods on the Logistic Regression Problem (LRP).  The x-axis represents time, and the y-axis shows the residuals (difference between the current value and optimal value) for both the lower-level objective (G(x)-G*) and the upper-level objective (F(x)-F*). The plot showcases the convergence speed and accuracy of each method in reaching the optimal solution, allowing for a visual comparison of their efficiency and effectiveness.", "section": "4 Numerical experiments"}]