[{"figure_path": "oRZN9a53ag/figures/figures_8_1.jpg", "caption": "Figure 1: Empirical results on dense graphs with different numbers of nodes, on fully observable (no hidden variables) and latent variable models. We report the SHD accuracy (the lower, the better). We note that DirectLiNGAM is surprisingly robust to different structural assumptions, and AdaScore is generally comparable or better (as in nonlinear observable data) than the other benchmarks.", "description": "This figure displays boxplots of the structural Hamming distance (SHD) for different causal discovery algorithms (AdaScore, CAM-UV, NoGAM, RCD, and DirectLiNGAM).  The algorithms are tested on both fully observable and latent variable models, with linear and non-linear causal mechanisms. The x-axis represents the number of nodes in the graph, and separate plots are shown for each causal mechanism type (linear and non-linear) and data type (fully observable and latent variables). Lower SHD values indicate better performance.", "section": "Experiments"}, {"figure_path": "oRZN9a53ag/figures/figures_20_1.jpg", "caption": "Figure 1: Empirical results on dense graphs with different numbers of nodes, on fully observable (no hidden variables) and latent variable models. We report the SHD accuracy (the lower, the better). We note that DirectLiNGAM is surprisingly robust to different structural assumptions, and AdaScore is generally comparable or better (as in nonlinear observable data) than the other benchmarks.", "description": "This figure shows the results of experiments comparing AdaScore with other causal discovery algorithms.  The experiments were conducted on both fully observable and latent variable models with varying numbers of nodes.  The results are presented using boxplots showing the Structural Hamming Distance (SHD) which is a measure of the accuracy of the learned causal graph. Lower SHD values indicate better performance. The figure indicates that AdaScore performs comparably to or better than other methods, especially in nonlinear models, highlighting its robustness and effectiveness.", "section": "5 Experiments"}, {"figure_path": "oRZN9a53ag/figures/figures_24_1.jpg", "caption": "Figure 2: Empirical results for non-additive causal mechanisms on sparse graphs with different numbers of nodes, on fully observable (no hidden variables) and latent variable models. We report the F₁ score w.r.t. the existence of edges (the higher, the better).", "description": "This figure presents the F1-scores for different causal discovery algorithms on datasets with non-additive causal mechanisms. The results are shown separately for sparse and dense graphs, with and without latent variables.  The F1-score measures the accuracy of edge prediction, regardless of edge direction.", "section": "E.1 Non-additive mechanisms"}, {"figure_path": "oRZN9a53ag/figures/figures_24_2.jpg", "caption": "Figure 2: Empirical results for non-additive causal mechanisms on sparse graphs with different numbers of nodes, on fully observable (no hidden variables) and latent variable models. We report the F₁ score w.r.t. the existence of edges (the higher, the better).", "description": "This figure presents the results of experiments evaluating the performance of AdaScore and several other causal discovery algorithms on synthetic datasets with non-additive causal mechanisms.  The experiments consider both sparse and dense graphs with varying numbers of nodes, and include scenarios with and without latent variables. The F1 score (harmonic mean of precision and recall) is used to assess the accuracy of skeleton recovery (i.e., identifying the presence or absence of edges between nodes in the causal graph), regardless of the directionality of the edges.  Higher F1 scores indicate better performance.", "section": "E.1 Non-additive mechanisms"}, {"figure_path": "oRZN9a53ag/figures/figures_24_3.jpg", "caption": "Figure 1: Empirical results on dense graphs with different numbers of nodes, on fully observable (no hidden variables) and latent variable models. We report the SHD accuracy (the lower, the better). We note that DirectLiNGAM is surprisingly robust to different structural assumptions, and AdaScore is generally comparable or better (as in nonlinear observable data) than the other benchmarks.", "description": "This figure displays box plots comparing the performance of AdaScore against other causal discovery algorithms (CAM-UV, RCD, NoGAM, DirectLiNGAM) on both fully observable and latent variable models with varying numbers of nodes. The y-axis represents the structural Hamming distance (SHD), a metric evaluating the accuracy of causal graph recovery.  Lower SHD values signify better performance.  The plots reveal AdaScore's competitive performance compared to the other algorithms, particularly in nonlinear observable datasets.", "section": "5 Experiments"}, {"figure_path": "oRZN9a53ag/figures/figures_24_4.jpg", "caption": "Figure 1: Empirical results on dense graphs with different numbers of nodes, on fully observable (no hidden variables) and latent variable models. We report the SHD accuracy (the lower, the better). We note that DirectLiNGAM is surprisingly robust to different structural assumptions, and AdaScore is generally comparable or better (as in nonlinear observable data) than the other benchmarks.", "description": "This figure shows the results of experiments comparing AdaScore's performance to other causal discovery algorithms on both fully observable and latent variable models with varying numbers of nodes.  The results are shown in terms of Structural Hamming Distance (SHD), a metric measuring the number of incorrect edges in the inferred causal graph. Lower SHD indicates better performance.  The figure illustrates AdaScore's competitive performance, particularly on nonlinear models with latent variables, suggesting its robustness to different structural assumptions.", "section": "5 Experiments"}, {"figure_path": "oRZN9a53ag/figures/figures_25_1.jpg", "caption": "Figure 4: Empirical results on sparse graphs with different numbers of samples and seven nodes, on fully observable (no hidden variables) and latent variable models. We report the SHD accuracy (the lower, the better).", "description": "This figure shows the results of experiments comparing the performance of AdaScore and other causal discovery algorithms on sparse graphs with 7 nodes, varying the number of samples used.  It displays SHD (Structural Hamming Distance), a measure of the accuracy of the recovered causal graph, with lower values indicating higher accuracy.  Both fully observable (no latent variables) and latent variable model scenarios are included.  The plots visualize the SHD for linear and nonlinear causal mechanisms.", "section": "Experiments"}, {"figure_path": "oRZN9a53ag/figures/figures_25_2.jpg", "caption": "Figure 4: Empirical results on sparse graphs with different numbers of samples and seven nodes, on fully observable (no hidden variables) and latent variable models. We report the SHD accuracy (the lower, the better).", "description": "The figure shows boxplots of the structural Hamming distance (SHD) for different numbers of samples (500, 1000, 1500, 2000) in both fully observable and latent variable models.  The SHD represents the number of incorrect edges in the recovered causal graph, with lower values indicating better accuracy.  The plots are separated by the type of causal mechanism (linear vs. nonlinear) and model type.  The results indicate the performance of the AdaScore algorithm compared to several baseline methods across different sample sizes.", "section": "Experiments"}, {"figure_path": "oRZN9a53ag/figures/figures_25_3.jpg", "caption": "Figure 4: Empirical results on sparse graphs with different numbers of samples and seven nodes, on fully observable (no hidden variables) and latent variable models. We report the SHD accuracy (the lower, the better).", "description": "The figure displays boxplots for Structural Hamming Distance (SHD) across different methods (AdaScore, CAM-UV, NoGAM, RCD, and LiNGAM) and sample sizes (500, 1000, 1500, 2000).  Results are shown separately for linear and nonlinear causal mechanisms and for models with and without latent variables. Lower SHD values indicate better performance in recovering the true causal graph.", "section": "Experiments"}, {"figure_path": "oRZN9a53ag/figures/figures_25_4.jpg", "caption": "Figure 4: Empirical results on sparse graphs with different numbers of samples and seven nodes, on fully observable (no hidden variables) and latent variable models. We report the SHD accuracy (the lower, the better).", "description": "This figure displays the structural Hamming distance (SHD) for different causal discovery algorithms on both fully observable and latent variable models. The algorithms are compared across varying sample sizes, with the SHD representing the number of incorrect edges in the estimated causal graph (lower values indicate better performance). The results are presented separately for linear and nonlinear causal mechanisms, highlighting the effect of sample size and model type on the algorithms' accuracy.", "section": "Experiments"}]