[{"figure_path": "wQiJNyPENt/tables/tables_5_1.jpg", "caption": "Table 2: Highest observed value after 10 rounds of BO with Q = 100. The best value at each κ is indicated in blue. BEEBO is configured with T' = 1/2√κ. Full BO curves are provided in D.6, confidence intervals and statistical tests in Tables A2, A3 and A4", "description": "This table shows the highest observed value achieved after 10 rounds of Bayesian Optimization with a batch size of 100.  The results are shown for different values of the exploration-exploitation parameter, κ, for both BEEBO and q-UCB. The best performance for each κ value is highlighted in blue.  BEEBO's hyperparameter, T', is linked to κ (T' = 1/(2√κ)). More detailed information, including full BO curves and statistical analysis, can be found in the appendix.", "section": "5 Results"}, {"figure_path": "wQiJNyPENt/tables/tables_6_1.jpg", "caption": "Table 2: Highest observed value after 10 rounds of BO with Q = 100. The best value at each κ is indicated in blue. BEEBO is configured with T' = 1/2√κ. Full BO curves are provided in D.6, confidence intervals and statistical tests in Tables A2, A3 and A4", "description": "This table presents the highest observed objective function values after 10 rounds of Bayesian Optimization with a batch size of 100.  It compares the performance of meanBEEBO and maxBEEBO against q-UCB across three different exploration-exploitation trade-off settings (controlled by the hyperparameter κ).  The best result for each κ value is highlighted. The table also notes where to find more detailed results (full BO curves, confidence intervals, and statistical tests).", "section": "5 Results"}, {"figure_path": "wQiJNyPENt/tables/tables_7_1.jpg", "caption": "Table 2: Highest observed value after 10 rounds of BO with Q = 100. The best value at each κ is indicated in blue. BEEBO is configured with T' = 1/2√κ. Full BO curves are provided in D.6, confidence intervals and statistical tests in Tables A2, A3 and A4", "description": "This table presents the highest observed objective function values after 10 rounds of Bayesian Optimization (BO) using different methods.  The batch size (Q) is fixed at 100.  The table compares the performance of the proposed BEEBO algorithm against the q-UCB algorithm for three different exploration-exploitation trade-off settings represented by the parameter κ (kappa). BEEBO's hyperparameter T' is adjusted to maintain a consistent trade-off with q-UCB across different values of κ. The best observed values for each setting are highlighted in blue.  Additional details, including full BO curves, confidence intervals, and statistical tests, can be found in the appendix.", "section": "5 Results"}, {"figure_path": "wQiJNyPENt/tables/tables_24_1.jpg", "caption": "Table 2: Highest observed value after 10 rounds of BO with Q = 100. The best value at each κ is indicated in blue. BEEBO is configured with T' = 1/2√κ. Full BO curves are provided in D.6, confidence intervals and statistical tests in Tables A2, A3 and A4", "description": "This table presents the results of Bayesian Optimization (BO) experiments comparing the performance of BEEBO and q-UCB on various test problems.  It shows the highest observed objective function value achieved after 10 rounds of BO for different values of the exploration-exploitation hyperparameter (κ for q-UCB, T' for BEEBO). The best performance for each κ value is highlighted in blue.  Additional details, including complete BO curves, confidence intervals and statistical test results, are referenced.", "section": "5.1 BO on test problems"}, {"figure_path": "wQiJNyPENt/tables/tables_28_1.jpg", "caption": "Table 2: Highest observed value after 10 rounds of BO with Q = 100. The best value at each κ is indicated in blue. BEEBO is configured with T' = 1/2√κ. Full BO curves are provided in D.6, confidence intervals and statistical tests in Tables A2, A3 and A4", "description": "This table presents the highest observed objective function values after 10 rounds of Bayesian Optimization (BO) for different algorithms and configurations.  The results are shown for various test functions with different dimensions, and different exploration-exploitation parameters (κ for q-UCB, T' for BEEBO). The best-performing method for each parameter setting is highlighted in blue.  The table also references additional details provided in the appendix (full BO curves, confidence intervals, and statistical tests).", "section": "5 Results"}]