[{"figure_path": "d2lPM1Aczs/figures/figures_1_1.jpg", "caption": "Figure 1: Illustration of using FixMatch on the Auxiliary Ranking Classifier (ARC). This diagram uses the age estimation task as an example, where the goal is to predict the age of a person in an image. The auxiliary ranking classifier transforms this task into a ranking problem by comparing two images to determine which person is older. (Image sourced from the UTKFace dataset [37]).", "description": "This figure illustrates how the FixMatch algorithm is applied to the Auxiliary Ranking Classifier (ARC) for semi-supervised regression.  The ARC transforms the regression task (age prediction) into a ranking task by comparing pairs of images. Unlabeled image pairs undergo both weak and strong augmentations.  Each augmented pair is fed into the neural network, which outputs a ranking score.  FixMatch uses a confidence threshold on this ranking prediction to generate pseudo-labels for the unlabeled data, which are then used to train the model. This process iteratively refines the model's ability to perform accurate age prediction. The example uses the UTKFace dataset.", "section": "3 Method"}, {"figure_path": "d2lPM1Aczs/figures/figures_5_1.jpg", "caption": "Figure 2: Illustration of RDA: This example includes three labeled data pairs {(xi, yi)}i=0 and five unlabeled data points with corresponding pseudo-labels {(ui, ŷi)}i=0. Each data pair is represented by a single bar in the graph. The x-axis indicates the sample indices, while the y-axis represents their corresponding regression label values. The orange bars demonstrate the process of obtaining the labeled data distribution, the blue bars illustrate how the pseudo-label distribution is formed, and the yellow bars show the aligned pseudo-labels after applying RDA.", "description": "This figure illustrates the process of Regression Distribution Alignment (RDA). It shows how the distribution of pseudo-labels generated by a model is aligned with the distribution of the labeled data. The alignment process involves three steps: (1) extracting the labeled data distribution, (2) generating the pseudo-label distribution, and (3) aligning the pseudo-label distribution with the labeled data distribution. The figure uses a histogram to represent the data distributions, where the x-axis represents the sample indices and the y-axis represents the label values. The figure effectively shows how the RDA process refines the pseudo-labels by aligning their distribution with the labeled data distribution.", "section": "3.3 Regression Distribution Alignment (RDA)"}, {"figure_path": "d2lPM1Aczs/figures/figures_9_1.jpg", "caption": "Figure 3: Comparison of t-SNE visualizations of feature representations for different semi-supervised regression methods on evaluation data. The supervised model is displayed on the left, MixMatch is in the center, and RankUp (without RDA) is shown on the right.", "description": "This figure compares the t-SNE visualizations of feature representations from three different semi-supervised regression methods: a supervised model, MixMatch, and RankUp (without RDA). Each visualization shows a scatter plot where each point represents a data point in the feature space, colored by its corresponding regression label (age in this case). The visualizations demonstrate the effectiveness of RankUp in creating a better separation between data points of different ages compared to the other methods. This separation is better aligned with the low-density assumption in semi-supervised learning, highlighting one of the underlying reasons for RankUp's strong performance.", "section": "4.4 Analysis of Different Semi-Supervised Classification Methods on ARC"}]