[{"figure_path": "OOiRS6fiM7/tables/tables_8_1.jpg", "caption": "Table 1: In the upper part part we report median test accuracies over 10 runs for the MNIST addition and the visual sudoku benchmarks for varying problem sizes and different neurosymbolic frameworks. Sub- and superscript indicate the 25 and 75 percent quantiles, respectively. In the lower part we report the training times in minutes, again using medians with 25 and 75 percent quantiles. We set the time-out to 24 hours (1440 minutes).", "description": "This table compares the performance of PLIA₁ against other neurosymbolic methods on two benchmark tasks: MNIST addition and visual Sudoku.  It shows median test accuracies and training times for various problem sizes.  Accuracy is reported with 25th and 75th percentiles, and training times are given in minutes, also with 25th and 75th percentiles, with a 24-hour time limit.", "section": "5.2 Neurosymbolic Learning"}, {"figure_path": "OOiRS6fiM7/tables/tables_9_1.jpg", "caption": "Table 1: In the upper part part we report median test accuracies over 10 runs for the MNIST addition and the visual sudoku benchmarks for varying problem sizes and different neurosymbolic frameworks. Sub- and superscript indicate the 25 and 75 percent quantiles, respectively. In the lower part we report the training times in minutes, again using medians with 25 and 75 percent quantiles. We set the time-out to 24 hours (1440 minutes).", "description": "This table compares the performance of PLIA<sub>t</sub> against other neurosymbolic methods on two benchmark tasks: MNIST addition and visual Sudoku.  It shows median accuracies and training times (in minutes) for different problem sizes (number of digits for addition and grid size for Sudoku).  The table highlights PLIA<sub>t</sub>'s superior efficiency, particularly for larger problem instances, while maintaining competitive accuracy.", "section": "5.2 Neurosymbolic Learning"}, {"figure_path": "OOiRS6fiM7/tables/tables_13_1.jpg", "caption": "Table 1: In the upper part part we report median test accuracies over 10 runs for the MNIST addition and the visual sudoku benchmarks for varying problem sizes and different neurosymbolic frameworks. Sub- and superscript indicate the 25 and 75 percent quantiles, respectively. In the lower part we report the training times in minutes, again using medians with 25 and 75 percent quantiles. We set the time-out to 24 hours (1440 minutes).", "description": "The table presents a comparison of different neurosymbolic methods (PLIA, DPL, Scallop, A-NeSI) on two benchmark tasks: MNIST addition and visual Sudoku.  It shows median accuracy and training times for various problem sizes.  The results highlight PLIA's superior performance in terms of both speed and accuracy, especially as problem complexity increases.", "section": "5.2 Neurosymbolic Learning"}]