[{"figure_path": "7CUUtpDeqN/tables/tables_71_1.jpg", "caption": "Table 1: Table 1 lists the 20 different function pairs used in the simulation study described in Sec. 6 for comparing the analytical estimate of the minimizing distribution of (2) proposed in Sec. 6 with the corresponding ground-truth numerical estimate. The index in Table 1 maps the corresponding function pair to the results shown in Fig. 1. To illustrate, the number 1 on the x-axis of all the plots shown in Fig. 1 corresponds to the function pair with index 1 in Table 1.", "description": "This table lists 20 pairs of functions f1(M) and f2(M) used in a simulation study to compare analytical and numerical estimations of mutual information.  The simulation uses Poisson distributions, and the table indexes the function pairs used in the study, shown graphically in Figure 1.", "section": "6 Upper bound for convolution-closed distributions"}, {"figure_path": "7CUUtpDeqN/tables/tables_72_1.jpg", "caption": "Table 1: Table 1 lists the 20 different function pairs used in the simulation study described in Sec. 6 for comparing the analytical estimate of the minimizing distribution of (2) proposed in Sec. 6 with the corresponding ground-truth numerical estimate. The index in Table 1 maps the corresponding function pair to the results shown in Fig. 1. To illustrate, the number 1 on the x-axis of all the plots shown in Fig. 1 corresponds to the function pair with index 1 in Table 1.", "description": "This table lists 20 different pairs of functions used in a simulation study to compare analytical and numerical estimates of a specific quantity (minimizing distribution of equation (2) from the paper).  Each function pair is assigned an index which corresponds to data points in Figure 1 of the paper, allowing for a visual comparison of the results.  The table facilitates understanding of the simulation setup and how the results are presented visually.", "section": "6 Upper bound for convolution-closed distributions"}]