[{"figure_path": "qdV1vp1AtL/figures/figures_5_1.jpg", "caption": "Figure 1: The optimal universal sample coding factor infc Vk(c), optimized over the choice of c > 0 for k-dimensional distributions, along with the lower bound factor 1.", "description": "This figure shows the optimal universal sample coding factor, denoted as infc Vk(c), plotted against the dimensionality (k) of the distributions.  The factor represents the multiplicative gap between the upper bound on communication cost (from the proposed algorithm) and the theoretical lower bound. The plot also includes a line representing the lower bound factor of 1, which provides a reference point for comparison.  It demonstrates how the optimal factor changes as the dimensionality of the data increases.", "section": "Universal sample coding"}, {"figure_path": "qdV1vp1AtL/figures/figures_5_2.jpg", "caption": "Figure 1: The optimal universal sample coding factor infc Vk(c), optimized over the choice of c > 0 for k-dimensional distributions, along with the lower bound factor 1.", "description": "This figure illustrates the optimal universal sample coding factor (infc Vk(c)) as a function of the dimensionality (k) of the probability distributions.  The factor represents the multiplicative gap between the upper bound on the communication cost of the proposed algorithm and the theoretical lower bound.  The figure shows that the optimal factor decreases as the dimensionality increases, approaching the lower bound of 1.  This indicates that the efficiency of the proposed algorithm improves for higher-dimensional distributions.", "section": "Universal sample coding"}, {"figure_path": "qdV1vp1AtL/figures/figures_6_1.jpg", "caption": "Figure 3: KL-divergence between the true and estimated probabilities for dimension k = 8, for a range of number of communicated samples n. Solid line indicates the mean, while the shaded area shows the 20th to 80th percentiles.", "description": "This figure shows the KL-divergence between the true probability distribution (P) and its estimate (Q) obtained using the proposed universal sample coding algorithm for different numbers of communicated samples (n). The experiment was conducted for an 8-dimensional distribution (k=8). The solid line represents the mean KL-divergence, and the shaded area represents the 20th to 80th percentiles, illustrating the variability of the estimates across multiple runs of the experiment.", "section": "6 Empirical evaluation"}, {"figure_path": "qdV1vp1AtL/figures/figures_6_2.jpg", "caption": "Figure 5: Communication cost of communicating n samples from an 8-dimensional distribution (k = 8). Solid line indicates the mean, while shaded area shows the 20th to 80th percentiles.", "description": "This figure displays the communication cost for transmitting varying numbers of samples from an 8-dimensional distribution.  It compares the empirical results with the theoretical upper and lower bounds derived in the paper. The shaded region represents the 20th to 80th percentiles of the communication cost across multiple experimental runs, illustrating the variability in performance. The plot demonstrates how the observed communication cost lies between the predicted upper and lower bounds, providing experimental validation of the theoretical analysis.", "section": "5 Universal sample coding"}, {"figure_path": "qdV1vp1AtL/figures/figures_16_1.jpg", "caption": "Figure 6: Communication cost per token as a function of the group size. The solid lines depict the mean, while the shaded areas correspond to the 25th to 75th percentiles. The ‘code 13B’ indicates the source coding approach, whereas ‘sample Z’ pertains to sample communication with the auxiliary model Z.", "description": "This figure shows the communication cost per token for different group sizes when using either source coding or sample communication. Source coding is the traditional method of compressing and transmitting data, while sample communication is the novel technique proposed in the paper. The figure compares the performance of sample communication using auxiliary models of varying sizes (125M, 350M, 1.3B, 2.7B, 6.7B parameters) against the source coding method. The results demonstrate that the sample communication method outperforms source coding for larger group sizes, highlighting the efficiency gains of the proposed approach.", "section": "Generative models"}]