[{"figure_path": "KYHma7hzjr/tables/tables_8_1.jpg", "caption": "Table 1: Test-set concept and target prediction performance without interventions. For black boxes, concepts were predicted via a linear probe. Results are reported as averages and standard deviations across ten seeds. For concepts, performance metrics were averaged. Best results are reported in bold, second best are in italics.", "description": "This table presents the performance of different models on various datasets in terms of AUROC, AUPR, and Brier score for both concept and target prediction tasks, without performing any interventions.  It compares the performance of a standard black-box model against a concept bottleneck model (CBM), a post-hoc CBM, and several fine-tuned variants of the black-box model. The best and second-best results for each metric are highlighted.", "section": "Results"}, {"figure_path": "KYHma7hzjr/tables/tables_19_1.jpg", "caption": "Table D.1: Dataset summary. After any filtering or preprocessing, N is the total number of data points; p is the input dimensionality; and K is the number of concept variables.", "description": "This table summarizes the characteristics of the seven datasets used in the paper's experiments.  For each dataset, it provides the data type (tabular or image), the total number of data points (N), the input dimensionality (p), and the number of concept variables (K).  The datasets include synthetic data, image data from various sources (AwA2, CUB, CIFAR-10, ImageNet), and medical image data (CheXpert, MIMIC-CXR). The table is crucial for understanding the scope and diversity of data used to evaluate the proposed method.", "section": "D Datasets"}, {"figure_path": "KYHma7hzjr/tables/tables_22_1.jpg", "caption": "Table 1: Test-set concept and target prediction performance without interventions. For black boxes, concepts were predicted via a linear probe. Results are reported as averages and standard deviations across ten seeds. For concepts, performance metrics were averaged. Best results are reported in bold, second best are in italics.", "description": "This table shows the performance of different models on several datasets without any interventions.  It compares a standard black box model, concept bottleneck models (CBM), post-hoc CBMs, and various fine-tuned versions of the black box model. The metrics reported include AUROC, AUPR, and Brier score for both concept and target prediction. Best results are highlighted in bold, and the second best are in italics.", "section": "Results"}]