[{"figure_path": "V42zfM2GXw/figures/figures_3_1.jpg", "caption": "Figure 1: The framework of DECRL.", "description": "The figure illustrates the framework of the proposed DECRL approach. At each timestamp, entity and relation representations are updated by the cluster graph message passing module and merged with input representations from the previous timestamp using a time residual gate.  These updated representations are then input to a relation-aware GCN to model multi-relational interactions among entities. A deep evolutionary clustering module captures the temporal evolution of high-order correlations among entities, maintaining temporal smoothness through an unsupervised alignment mechanism.  An implicit correlation encoder captures latent correlations between clusters, and an attentive temporal encoder captures temporal dependencies among entity and relation representations across timestamps, integrating them for future event prediction. The figure visually depicts the flow of information and the interactions between the various modules of the DECRL model.", "section": "4 Methodology"}, {"figure_path": "V42zfM2GXw/figures/figures_9_1.jpg", "caption": "Figure 1: The framework of DECRL.", "description": "The figure illustrates the framework of the Deep Evolutionary Clustering jointed temporal knowledge graph Representation Learning approach (DECRL).  At each timestamp, entity and relation representations are updated by a cluster graph message passing module and merged with input representations from the previous timestamp using a time residual gate. This serves as input for the current timestamp's relation-aware GCN, which models multi-relational interactions. The deep evolutionary clustering module captures the temporal evolution of high-order correlations. An implicit correlation encoder captures latent correlations between clusters, enabling message passing within the cluster graph to update entity representations. Finally, an attentive temporal encoder captures temporal dependencies between timestamps, integrating temporal information for future event prediction.", "section": "4 Methodology"}, {"figure_path": "V42zfM2GXw/figures/figures_15_1.jpg", "caption": "Figure 3: Results of hyper-parameters changes of DECRL on ICEWS18C.", "description": "This figure shows the impact of four hyperparameters (N_historical_window, N_c, N_DECRL_layer, λ) on the performance of DECRL using the ICEWS18C dataset.  Each subplot displays the MRR, Hits@1, Hits@3, and Hits@10 metrics across a range of values for each hyperparameter. The plots reveal how changes in each hyperparameter affect model performance, demonstrating the sensitivity of DECRL to the tuning of these parameters. The results show an optimal range of values for each hyperparameter that maximizes model performance. ", "section": "5.3 Ablation study"}, {"figure_path": "V42zfM2GXw/figures/figures_15_2.jpg", "caption": "Figure 3: Results of hyper-parameters changes of DECRL on ICEWS18C.", "description": "This figure shows the impact of four hyperparameters (Nhistorical window, Nc, NDECRL layer, and λ) on the performance of DECRL using the ICEWS18C dataset.  Each subplot displays the MRR, Hits@1, Hits@3, and Hits@10 scores across a range of values for each hyperparameter. The plots visualize how changes in these hyperparameters affect the model's ability to accurately predict events. This allows for identifying optimal hyperparameter settings for the DECRL model.", "section": "5.2 Comparison with baselines"}, {"figure_path": "V42zfM2GXw/figures/figures_15_3.jpg", "caption": "Figure 3: Results of hyper-parameters changes of DECRL on ICEWS18C.", "description": "This figure shows the results of hyperparameter sensitivity analysis performed on the ICEWS18C dataset.  It displays the impact of varying four hyperparameters (N_historical_window, N_c, N_DECRL_layer, λ) on the performance metrics (MRR, Hits@1, Hits@3, Hits@10) of the DECRL model. Each subplot illustrates the performance trend as the value of one specific hyperparameter is adjusted, providing insights into the optimal ranges of each hyperparameter for the model.", "section": "5.2 Comparison with baselines"}, {"figure_path": "V42zfM2GXw/figures/figures_15_4.jpg", "caption": "Figure 3: Results of hyper-parameters changes of DECRL on ICEWS18C.", "description": "This figure shows the impact of four hyperparameters on the performance of the DECRL model, specifically on the ICEWS18C dataset.  The x-axis represents different values for each hyperparameter (Nhistorical window, Nc, NDECRL layer, λ). The y-axis displays the performance metrics (MRR, Hits@1, Hits@3, Hits@10). Each line represents one metric. The figure illustrates how changing the hyperparameters affects the model's performance, indicating the optimal range or value for each hyperparameter to achieve the best results. ", "section": "5.3 Ablation study"}]