[{"figure_path": "wTIzpqX121/figures/figures_3_1.jpg", "caption": "Figure 1: Overview of our Graph-EFM model, with example data and graphs for a Limited Area Model. The corresponding overview for the global setting is given in fig. 6 in appendix C.", "description": "This figure shows a schematic overview of the Graph-EFM model.  It illustrates how the model processes data at different levels of a hierarchical graph to produce probabilistic forecasts. The input data includes past weather states, forcing data, and boundary conditions (in the limited-area case). This data is fed into a series of graph neural network layers, and the latent variable Zt is sampled at the top of the hierarchy. The prediction for the next time step is made by processing data from lower levels in a way similar to Graph-FM, using residual connections to incorporate the latent variable. The process is repeated to make a prediction for each time step in the forecasting horizon.", "section": "Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_4_1.jpg", "caption": "Figure 2: Graphical model for eq. (3).", "description": "This figure shows the graphical model representation of the single-step probabilistic weather forecasting model proposed by the authors.  The model introduces a latent variable Zt, representing the uncertainty at time step t, which influences the prediction Xt of the weather state at time t. The model assumes a second-order Markov property, indicating that Xt depends on Xt-1, Xt-2, and Zt.  The figure visually depicts these dependencies and the conditional probability distribution that the model aims to capture.", "section": "4 Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_7_1.jpg", "caption": "Figure 3: Results for global forecasting of mean sea level pressure (msl) at all lead times.", "description": "The figure shows the RMSE, CRPS and SpSkR for mean sea level pressure forecasts using GraphCast*, Graph-FM, GraphCast*+SWAG, Graph-EFM (ms) and Graph-EFM.  The results are shown for lead times of up to 10 days.  The plot shows that Graph-EFM achieves lower CRPS values than the other methods, indicating better probabilistic forecasting performance.  Graph-EFM also shows good calibration (SpSkR close to 1), indicating that the ensemble spread accurately reflects the forecast uncertainty. GraphCast*+SWAG does not produce useful ensemble forecasts as they are poorly calibrated and do not lead to improved forecast errors.", "section": "5.1 Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_7_2.jpg", "caption": "Figure 20: Comparison of global model forecasts at 10 days lead time for u-component of 10 m wind (10u), specific humidity at 700 hPa (q700) and geopotential at 500 hPa (z500). For probabilistic models we show sampled ensemble members.", "description": "The figure compares the forecasts of three global weather models (GraphCast*, Graph-FM, and Graph-EFM) with ground truth data at a 10-day lead time.  The models are evaluated on three key variables: the u-component of wind at 10 meters (10u), specific humidity at 700 hPa (q700), and geopotential at 500 hPa (z500).  The probabilistic models (Graph-EFM) show sampled ensemble members, illustrating the uncertainty inherent in the forecasts, while the deterministic models provide a single forecast value.", "section": "J Additional Results: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_9_1.jpg", "caption": "Figure 5: Example forecasts for net solar longwave radiation (nlwrs) at lead time 57 h.", "description": "This figure compares example forecasts for net solar longwave radiation (nlwrs) at a lead time of 57 hours.  It showcases the ground truth, ensemble mean and standard deviation from Graph-EFM, and an ensemble member forecast from Graph-EFM (ms) and Graph-EFM. The visualization highlights the differences in spatial coherency between the models.  Graph-EFM using the hierarchical graph shows improved spatial coherence compared to the Graph-EFM (ms) model using the multi-scale graph, demonstrating a key benefit of the hierarchical approach in representing spatially continuous atmospheric fields.", "section": "Limited Area Modeling with MEPS Data"}, {"figure_path": "wTIzpqX121/figures/figures_17_1.jpg", "caption": "Figure 1: Overview of our Graph-EFM model, with example data and graphs for a Limited Area Model. The corresponding overview for the global setting is given in fig. 6 in appendix C.", "description": "This figure shows a schematic overview of the Graph-EFM model, illustrating the flow of information and the hierarchical graph structure used.  It depicts the process of generating an ensemble forecast using a latent variable model combined with a hierarchical Graph Neural Network. The model starts with initial states and forcing data, which are mapped to a lower-dimensional latent space. Samples are drawn from this latent space and then used to generate predictions for the next timestep using a deterministic Graph-FM model.  This process is repeated for a sequence of time steps, producing a spatially coherent ensemble forecast. The figure highlights both the latent variable modeling aspect and the hierarchical structure of the Graph Neural Network. A separate illustration for global forecasting is available in Appendix C.", "section": "Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_17_2.jpg", "caption": "Figure 1: Overview of our Graph-EFM model, with example data and graphs for a Limited Area Model. The corresponding overview for the global setting is given in fig. 6 in appendix C.", "description": "This figure shows a schematic overview of the Graph-EFM model, illustrating how the model processes data and generates forecasts.  It highlights the use of a hierarchical graph neural network (GNN) and latent variables to capture forecast uncertainty. The example shows the Limited Area Model (LAM) setup, but a similar schematic is provided in the appendix for the global model. The model takes as input the previous weather states, forcing inputs, and potentially boundary conditions (for the LAM case).  It uses a hierarchical GNN to process this information, then uses a latent variable to introduce stochasticity to capture uncertainty. Finally, it samples from the latent variable's distribution and generates the forecast.  The residual connection between outputs and previous time steps is shown.", "section": "4 Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_24_1.jpg", "caption": "Figure 7: Example forecasts of 10 m wind speeds during Hurricane Laura, all for 2020-08-27T12 UTC. The first column shows the wind speeds in ERA5, with the red arrow indicating the location of the hurricane. Remaining columns show model forecasts for the specific time, initialized at different lead times ahead. For Graph-EFM we plot both 4 randomly sampled ensemble members and one cherry-picked member that was deemed to best match ERA5.", "description": "This figure compares forecasts of 10 m wind speeds during Hurricane Laura from different models at various lead times (7 days, 5 days, 3 days, and 1 day before the event). The first column displays ERA5 reanalysis data, while subsequent columns show forecasts from Graph-EFM (including 4 random ensemble members and a best-matching member), GraphCast*, and Graph-FM.  The figure highlights the differences in the models' ability to capture the hurricane's intensity and location at different timescales and the uncertainty represented by the Graph-EFM ensemble.", "section": "F Extreme Weather Case Study: Hurricane Laura"}, {"figure_path": "wTIzpqX121/figures/figures_25_1.jpg", "caption": "Figure 8: Example forecasts from Graph-EFM and Graph-EFM (ms) trained on the MEPS data. All forecasts are from single ensemble members, plotted for lead time 57 h.", "description": "This figure compares example forecasts generated by Graph-EFM and Graph-EFM (ms) models trained on the MEPS dataset. The forecasts are for a lead time of 57 hours and highlight the differences in spatial coherence between the two models. Graph-EFM, using a hierarchical graph, produces forecasts that are more spatially coherent, whereas Graph-EFM (ms), using a multi-scale graph, shows patchier and less realistic-looking results.", "section": "G Spatial Coherency of Forecasts"}, {"figure_path": "wTIzpqX121/figures/figures_26_1.jpg", "caption": "Figure 8: Example forecasts from Graph-EFM and Graph-EFM (ms) trained on the MEPS data. All forecasts are from single ensemble members, plotted for lead time 57 h.", "description": "This figure shows example forecasts from Graph-EFM and Graph-EFM (ms) models trained on MEPS data, showcasing ensemble members' forecasts for different variables at a lead time of 57 hours.  It visually demonstrates the difference in spatial coherence between the hierarchical (Graph-EFM) and multi-scale (Graph-EFM (ms)) graph approaches.", "section": "G.1 Limited Area Modeling with MEPS Data"}, {"figure_path": "wTIzpqX121/figures/figures_26_2.jpg", "caption": "Figure 25: Comparison of LAM forecasts for u-component of wind at 850 hPa (u850) and 2 m relative humidity (2r) at 57 h lead time. For probabilistic models we show sampled ensemble members.", "description": "This figure compares the forecasts from four different models for u-component of wind at 850 hPa and 2 m relative humidity at 57 h lead time.  It includes the ground truth, GraphCast*, Graph-FM and two versions of Graph-EFM.  The Graph-EFM model outputs show sampled ensemble members, highlighting the range of possible forecasts.", "section": "K.2 Example Forecasts"}, {"figure_path": "wTIzpqX121/figures/figures_27_1.jpg", "caption": "Figure 12: Mesh graphs used in the global experiment. Note that the vertical positioning (away from earth's surface) is purely for visualization purposes.", "description": "This figure shows different mesh graphs used in the global forecasting experiments described in the paper.  Specifically, it visualizes the multi-scale mesh graph (GMS) created by recursively splitting the faces of an icosahedron, and the hierarchical mesh graph used in the Graph-EFM model.  The hierarchical graph is composed of several graphs (G1, ..., G5), each with varying edge lengths and node connections representing different spatial scales. The inter-level graph (G3,4) illustrates the connections between the different levels of the hierarchy. The visualization is intended to highlight the structural differences between the multi-scale and hierarchical graph approaches. Note that the vertical placement of the nodes is for visualization and doesn't reflect the actual spatial arrangement.", "section": "H Experiment Details: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_28_1.jpg", "caption": "Figure 12: Mesh graphs used in the global experiment. Note that the vertical positioning (away from earth's surface) is purely for visualization purposes.", "description": "This figure shows different mesh graphs used in the global forecasting experiments described in the paper.  Panel (a) through (d) show the multi-scale mesh graphs G1 to G4 created by recursively splitting the faces of an icosahedron. Panel (e) shows the final multi-scale mesh graph GMS, which includes all nodes from G1, but connects them using edges from all levels (G1 to G4). Panel (f) shows the hierarchical mesh graph used by the Graph-EFM model, which is based on G4 to G1 but adds explicit connections between the levels. Panel (g) shows an example of the inter-level graphs used to connect the different levels in the hierarchy, in this case between G3 and G4.", "section": "H Experiment Details: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_28_2.jpg", "caption": "Figure 12: Mesh graphs used in the global experiment. Note that the vertical positioning (away from earth's surface) is purely for visualization purposes.", "description": "This figure shows different mesh graphs used in the global weather forecasting experiment.  It illustrates the construction of multi-scale and hierarchical mesh graphs. The multi-scale graph (e) is created by recursively splitting the faces of an icosahedron and merging the resulting graphs. The hierarchical graph (f) uses a sequence of graphs at different levels, connecting them through edges between levels.  (g) shows a zoom on an inter-level graph illustrating the connections between different levels in the hierarchy. The vertical positioning of the nodes in the figure is solely for illustrative purposes; the actual graph structure is represented on a 2D sphere.", "section": "H Experiment Details: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_28_3.jpg", "caption": "Figure 12: Mesh graphs used in the global experiment. Note that the vertical positioning (away from earth's surface) is purely for visualization purposes.", "description": "This figure shows different mesh graphs used in the global weather forecasting experiment.  Panel (a) through (d) show the different levels of the hierarchical mesh graph, from coarser (a) to finer (d) resolutions.  (e) shows the multi-scale mesh graph, which combines all levels to capture multiple spatial scales. Panel (f) shows the hierarchical mesh graph used in the Graph-EFM model. (g) illustrates the connections between levels l and l+1 in the hierarchical graph. The vertical positioning is for visualization and does not reflect the true structure.", "section": "H Experiment Details: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_28_4.jpg", "caption": "Figure 12: Mesh graphs used in the global experiment. Note that the vertical positioning (away from earth's surface) is purely for visualization purposes.", "description": "This figure shows different mesh graphs used in the global forecasting experiments.  It includes (a) to (d) individual mesh graphs at different levels of resolution (G1 to G4) from the finest to the coarsest.  Then (e) shows the multi-scale mesh graph (GMS) combining all levels, while (f) illustrates the hierarchical mesh graph used in the Graph-EFM model. Finally (g) shows an example of an inter-level graph (G3,4) connecting nodes at adjacent levels in the hierarchy.", "section": "H Experiment Details: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_28_5.jpg", "caption": "Figure 12: Mesh graphs used in the global experiment. Note that the vertical positioning (away from earth's surface) is purely for visualization purposes.", "description": "This figure shows different mesh graphs used in the global weather forecasting experiment.  It illustrates the multi-scale mesh graph (GMS), constructed by recursively subdividing the faces of an icosahedron, and the hierarchical mesh graph used in the Graph-EFM model.  The hierarchical graph comprises multiple levels of graphs (G1 to G4 in this example), with connections between adjacent levels, creating a multi-resolution representation of the globe. The image also shows a single level of the inter-level graph, demonstrating the connections between different levels.  Note that the vertical positioning of nodes is merely for visual clarity and does not reflect the actual 3D representation.", "section": "H Experiment Details: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_32_1.jpg", "caption": "Figure 1: Overview of our Graph-EFM model, with example data and graphs for a Limited Area Model. The corresponding overview for the global setting is given in fig. 6 in appendix C.", "description": "This figure shows a schematic overview of the Graph-EFM model, illustrating the flow of data and information through the model's components.  It highlights the use of hierarchical graphs, latent variables, and a combination of deterministic and probabilistic components. The left side depicts the input data, including the previous weather states and forcing inputs. The middle shows the Graph-FM model used for prediction, employing a graph neural network processing on a hierarchical graph. The right illustrates how latent variables are sampled, and a residual connection is used to generate the ensemble forecasts. The figure also provides a specific example using a limited area model, with a reference to a similar figure in the appendix showing the model for global forecasting.", "section": "Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_32_2.jpg", "caption": "Figure 12: Mesh graphs used in the global experiment. Note that the vertical positioning (away from earth's surface) is purely for visualization purposes.", "description": "This figure shows different mesh graphs used in the global forecasting experiment.  It includes subfigures (a) to (d) showing the multi-scale mesh graphs G1 to G4 which are successively created by splitting the faces of an icosahedron. Subfigure (e) shows the multi-scale mesh graph GMS constructed by merging all the nodes from G1-G4 but using edges from all levels. Subfigure (f) shows the hierarchical mesh graph created by using G4-G1 as different layers in the hierarchy with additional inter-level edges and (g) shows one of the inter-level graphs G3,4. The graphs are visualized in 3D for better understanding but the vertical positioning is only for visualization purposes.", "section": "H Experiment Details: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_32_3.jpg", "caption": "Figure 12: Mesh graphs used in the global experiment. Note that the vertical positioning (away from earth's surface) is purely for visualization purposes.", "description": "This figure shows different mesh graphs used in the global forecasting experiment.  Panel (a) through (d) illustrate the multi-scale mesh graphs created by recursively splitting faces of an icosahedron, resulting in graphs G1 through G4. Panel (e) shows the multi-scale mesh graph GMS created by merging the nodes from G1 while connecting them with edges from all four graphs. This approach allows the model to capture both local and long-range dependencies. Panel (f) displays the hierarchical mesh graph used in the proposed Graph-EFM model, showing the four levels G1 through G4.  The hierarchical structure facilitates efficient information propagation at multiple spatial scales. Finally, panel (g) illustrates an example inter-level graph connecting levels G3 and G4, highlighting the connections between different levels of the hierarchy.", "section": "H Experiment Details: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_33_1.jpg", "caption": "Figure 1: Overview of our Graph-EFM model, with example data and graphs for a Limited Area Model. The corresponding overview for the global setting is given in fig. 6 in appendix C.", "description": "This figure shows a schematic overview of the Graph-EFM model, illustrating the flow of data and the hierarchical graph structure used for a limited area model.  The initial weather states (X<sub>t−2:t−1</sub>) and forcing data (F<sub>t</sub>) are input to the model.  The model uses a latent variable (Z<sub>t</sub>) to represent the uncertainty in the forecast.  Samples of Z<sub>t</sub> are drawn from a latent map p(Z<sub>t</sub>|X<sub>t−2:t−1</sub>, F<sub>t</sub>), which is a neural network that operates on a hierarchical graph (G<sub>1</sub>, ...,G<sub>L</sub>). The sampled Z<sub>t</sub> is then passed through a deterministic forecasting model (Graph-FM) to generate the forecast (X<sub>t</sub>). A residual connection is also utilized. The figure also includes examples of the types of graphs used for the limited area model.", "section": "Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_35_1.jpg", "caption": "Figure 1: Overview of our Graph-EFM model, with example data and graphs for a Limited Area Model. The corresponding overview for the global setting is given in fig. 6 in appendix C.", "description": "This figure shows a schematic overview of the Graph-EFM model for limited area weather forecasting.  It illustrates the model's workflow, beginning with input data (previous weather states Xt-2:t-1, boundary conditions Bt, and forcing Ft), proceeding through a hierarchical graph neural network (GNN), and culminating in an output of the predicted weather state Xt.  The hierarchical graph structure is highlighted, showing how different levels of the graph capture different spatial scales of the weather system. A key element is the sampling of the latent variable Zt, which introduces uncertainty into the forecast. The figure also provides examples of the data and graph structures used in the model.", "section": "4 Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_37_1.jpg", "caption": "Figure 1: Overview of our Graph-EFM model, with example data and graphs for a Limited Area Model. The corresponding overview for the global setting is given in fig. 6 in appendix C.", "description": "This figure shows a schematic overview of the Graph-EFM model. It illustrates how the model processes data from a limited area using hierarchical graphs. The initial states (Xt-2:t-1) and forcing inputs (Ft) are passed through a sequence of graph neural network (GNN) layers, which are organized hierarchically. Each level of the hierarchy captures a different spatial scale, with finer details added as the information is propagated down through the levels. A latent variable (Zt) is introduced to capture forecast uncertainty, which is then sampled to generate multiple ensemble members. Each ensemble member is a possible forecast scenario.  The figure also includes a comparison with the global setting, which is detailed in Appendix C.", "section": "4 Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_38_1.jpg", "caption": "Figure 1: Overview of our Graph-EFM model, with example data and graphs for a Limited Area Model. The corresponding overview for the global setting is given in fig. 6 in appendix C.", "description": "This figure shows a schematic overview of the Graph-EFM model, illustrating the flow of data through the model.  It shows the input data (Xt-2:t-1, Ft, Bt), the hierarchical graph structure used (G1, G2, G3), the latent variable (Zt) and its sampling process, the deterministic predictor (Graph-FM), and the final output (Xt).  The example is specifically for a limited area model, while a global model equivalent is presented in Appendix C.", "section": "4 Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_39_1.jpg", "caption": "Figure 1: Overview of our Graph-EFM model, with example data and graphs for a Limited Area Model. The corresponding overview for the global setting is given in fig. 6 in appendix C.", "description": "This figure shows a schematic overview of the Graph-EFM model.  The model takes as input past weather states (Xt-2:t-1), forcing data (Ft), and for the limited area model, boundary conditions (Bt). These inputs are fed into a latent map that uses a Graph Neural Network (GNN) to generate a latent variable (Zt) representing the uncertainty in the forecast.  The latent variable Zt, along with the input data, is then passed through a Graph-FM (Graph-based Forecasting Model) component, which uses a hierarchical GNN to generate a prediction for the current weather state (Xt). Residual connections are shown, indicating that the model uses past weather state information to create the next step. A limited area model and its specific graphs are displayed.", "section": "4 Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_40_1.jpg", "caption": "Figure 7: Example forecasts of 10 m wind speeds during Hurricane Laura, all for 2020-08-27T12 UTC. The first column shows the wind speeds in ERA5, with the red arrow indicating the location of the hurricane. Remaining columns show model forecasts for the specific time, initialized at different lead times ahead. For Graph-EFM we plot both 4 randomly sampled ensemble members and one cherry-picked member that was deemed to best match ERA5.", "description": "This figure shows example forecasts of 10m wind speeds during Hurricane Laura using ERA5 and different models for the period of 2020-08-27T12 UTC. The first column shows the ground truth of the wind speed from ERA5. The remaining columns show the forecasts from different models initialized at different times before the event. This demonstrates that Graph-EFM provides a good estimate of wind speeds at different lead times and also demonstrates the added value of ensemble forecasts.", "section": "F Extreme Weather Case Study: Hurricane Laura"}, {"figure_path": "wTIzpqX121/figures/figures_41_1.jpg", "caption": "Figure 1: Overview of our Graph-EFM model, with example data and graphs for a Limited Area Model. The corresponding overview for the global setting is given in fig. 6 in appendix C.", "description": "This figure shows a schematic overview of the Graph-EFM model. It illustrates the flow of data through the model's different components, including the input data, latent variable Zt, and the hierarchical graph structure. It highlights the use of Graph-FM as a deterministic sub-model within Graph-EFM, the residual connections, and the sampling process for ensemble generation. The figure also shows an example using a Limited Area Model, with the corresponding overview for the global setting available in Appendix C, Figure 6.", "section": "4 Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_42_1.jpg", "caption": "Figure 1: Overview of our Graph-EFM model, with example data and graphs for a Limited Area Model. The corresponding overview for the global setting is given in fig. 6 in appendix C.", "description": "This figure shows a schematic overview of the Graph-EFM model. It illustrates the data flow and the structure of the model for a limited area, showing how the initial states, forcing, and latent variables are used to generate ensemble forecasts. The hierarchical structure of the graphs used in the model is also illustrated. The figure also includes a reference to a similar overview for the global setting, which is given in Figure 6 of Appendix C.", "section": "4 Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_43_1.jpg", "caption": "Figure 20: Comparison of global model forecasts at 10 days lead time for u-component of 10 m wind (10u), specific humidity at 700 hPa (q700) and geopotential at 500 hPa (z500). For probabilistic models we show sampled ensemble members.", "description": "This figure compares the ground truth weather data against the forecasts generated by GraphCast*, Graph-FM, Graph-EFM (ms), and Graph-EFM for three different weather variables (10u, q700, and z500) at a lead time of 10 days.  The forecasts from the probabilistic Graph-EFM models are represented by a single randomly selected ensemble member, showcasing the model's ability to generate a range of possible future weather states. The comparison helps to visualize the performance of the different models in terms of both accuracy and the representation of uncertainty.", "section": "J Additional Results: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_44_1.jpg", "caption": "Figure 4: Example Graph-EFM ensemble forecast for specific humidity at 700 hPa (q700), for lead time 10 days. The bottom row shows 3 ensemble members, randomly chosen out of the 80.", "description": "This figure shows an example of an ensemble forecast produced by the Graph-EFM model for specific humidity at 700 hPa (q700). The forecast is for a lead time of 10 days.  The top row displays the ground truth, ensemble mean, and ensemble standard deviation. The bottom row shows three individual ensemble members randomly selected from the 80-member ensemble. This visualization helps to illustrate the model's ability to capture forecast uncertainty by providing a range of possible future weather scenarios.", "section": "Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_45_1.jpg", "caption": "Figure 20: Comparison of global model forecasts at 10 days lead time for u-component of 10 m wind (10u), specific humidity at 700 hPa (q700) and geopotential at 500 hPa (z500). For probabilistic models we show sampled ensemble members.", "description": "This figure compares the forecast results of four different models (GraphCast*, Graph-FM, Graph-EFM (ms), and Graph-EFM) against the ground truth for three different variables (u-component of 10 m wind, specific humidity at 700 hPa, and geopotential at 500 hPa) at a lead time of 10 days.  For the probabilistic models (Graph-EFM and Graph-EFM (ms)), a single sample from the ensemble is shown, highlighting the variability within the model's predictions.", "section": "J Additional Results: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_46_1.jpg", "caption": "Figure 20: Comparison of global model forecasts at 10 days lead time for u-component of 10 m wind (10u), specific humidity at 700 hPa (q700) and geopotential at 500 hPa (z500). For probabilistic models we show sampled ensemble members.", "description": "This figure compares forecasts from GraphCast*, Graph-FM, Graph-EFM (ms) and Graph-EFM for three different variables at a 10-day lead time.  The ground truth is also shown for comparison. For the probabilistic models, sampled ensemble members are displayed to illustrate the forecast uncertainty.", "section": "J Additional Results: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_47_1.jpg", "caption": "Figure 20: Comparison of global model forecasts at 10 days lead time for u-component of 10 m wind (10u), specific humidity at 700 hPa (q700) and geopotential at 500 hPa (z500). For probabilistic models we show sampled ensemble members.", "description": "This figure compares the ground truth with forecasts from GraphCast*, Graph-FM, Graph-EFM(ms), and Graph-EFM models for three different variables at a 10-day lead time.  It visualizes the forecasts for u-component of 10m wind, specific humidity at 700 hPa, and geopotential at 500 hPa. The probabilistic models (Graph-EFM and Graph-EFM(ms)) are represented by showing multiple sampled ensemble members, while the deterministic models (GraphCast* and Graph-FM) only display a single forecast.", "section": "J Additional Results: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_48_1.jpg", "caption": "Figure 21: Example Graph-EFM global ensemble forecasts at lead time 10 days.", "description": "This figure displays example global ensemble forecasts generated by the Graph-EFM model at a lead time of 10 days.  It shows the ground truth, the ensemble mean, the ensemble standard deviation, and three randomly selected ensemble members for several variables. The visualization allows for a comparison of the model's predictions with the actual weather patterns.", "section": "J Additional Results: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_49_1.jpg", "caption": "Figure 8: Example forecasts from Graph-EFM and Graph-EFM (ms) trained on the MEPS data. All forecasts are from single ensemble members, plotted for lead time 57 h.", "description": "This figure compares example forecasts from Graph-EFM and Graph-EFM (ms) models trained on MEPS data, focusing on lead time 57h. It showcases various weather variables (nlwrs, 2r, u65, v65) and illustrates the spatial coherence differences between the hierarchical Graph-EFM and the multi-scale Graph-EFM (ms).  Graph-EFM demonstrates smoother, more realistic spatial patterns compared to Graph-EFM (ms), which exhibits patchier and less physically intuitive results.", "section": "G Spatial Coherency of Forecasts"}, {"figure_path": "wTIzpqX121/figures/figures_50_1.jpg", "caption": "Figure 1: Overview of our Graph-EFM model, with example data and graphs for a Limited Area Model. The corresponding overview for the global setting is given in fig. 6 in appendix C.", "description": "This figure shows a schematic overview of the Graph-EFM model.  It illustrates the flow of data through the hierarchical graph neural network.  The figure specifically highlights the components for a limited area model, showing how the initial states and forcing inputs are processed through the different levels of the graph. The latent variables are sampled, and these affect the prediction made at each timestep.  The global model overview is available in Appendix C, Figure 6.", "section": "4 Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_51_1.jpg", "caption": "Figure 1: Overview of our Graph-EFM model, with example data and graphs for a Limited Area Model. The corresponding overview for the global setting is given in fig. 6 in appendix C.", "description": "This figure shows a schematic overview of the Graph-EFM model, illustrating the flow of data through the hierarchical graph neural network.  It shows how the initial states and forcing data are processed through multiple GNN layers at different levels of the hierarchy to generate ensemble forecasts. The limited area model example is highlighted, showing the use of both boundary and grid data.  A similar diagram for the global model is provided in Appendix C.", "section": "4 Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_52_1.jpg", "caption": "Figure 27: RMSE of Graph-FM models with Propagation and Interaction Networks, evaluated on the ERA5 test set", "description": "This figure compares the root mean square error (RMSE) results of Graph-FM models trained with Propagation and Interaction Networks on the ERA5 test dataset.  The results are shown for different variables and lead times, providing a visual comparison of the performance of the two GNN approaches in the deterministic forecasting model.", "section": "L.1 Comparing Interaction and Propagation Networks in Graph-FM"}, {"figure_path": "wTIzpqX121/figures/figures_52_2.jpg", "caption": "Figure 8: Example forecasts from Graph-EFM and Graph-EFM (ms) trained on the MEPS data. All forecasts are from single ensemble members, plotted for lead time 57 h.", "description": "This figure compares example forecasts from Graph-EFM and Graph-EFM (ms) for several variables at a lead time of 57 hours.  It highlights the difference in spatial coherence between the models. Graph-EFM, using a hierarchical graph, produces smoother, more physically realistic forecasts compared to Graph-EFM (ms), which uses a multi-scale graph and shows patchier, less coherent results.  The visual differences illustrate the impact of the graph structure on the model's ability to capture spatial dependencies in weather forecasting.", "section": "G Spatial Coherency of Forecasts"}, {"figure_path": "wTIzpqX121/figures/figures_53_1.jpg", "caption": "Figure 1: Overview of our Graph-EFM model, with example data and graphs for a Limited Area Model. The corresponding overview for the global setting is given in fig. 6 in appendix C.", "description": "This figure shows a schematic overview of the Graph-EFM model, illustrating how data flows through the model's components in a Limited Area Model setting. It shows the hierarchical structure of the mesh graphs (G1, G2, G3), the latent variable (Zt), the predictor (Graph-FM), and the residual connections used to incorporate the previous state into the prediction. The figure also includes example data inputs and outputs, as well as an explanation of the sampling process used to generate an ensemble of forecasts.  The caption also mentions that a similar figure for the global setting is available in Appendix C, Figure 6.", "section": "4 Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_54_1.jpg", "caption": "Figure 25: Comparison of LAM forecasts for u-component of wind at 850 hPa (u850) and 2 m relative humidity (2r) at 57 h lead time. For probabilistic models we show sampled ensemble members.", "description": "This figure compares the forecasts of u-component of wind at 850 hPa and 2 m relative humidity at 57h lead time from different models in the LAM experiment. The models compared include GraphCast*, Graph-FM, Graph-EFM (ms), and Graph-EFM. For the probabilistic models (Graph-EFM and Graph-EFM (ms)), sampled ensemble members are shown to illustrate the range of possible forecasts.", "section": "K.2 Example Forecasts"}, {"figure_path": "wTIzpqX121/figures/figures_55_1.jpg", "caption": "Figure 26: Example Graph-EFM LAM ensemble forecasts at lead time 57 h.", "description": "This figure shows example forecasts from Graph-EFM for the limited area model (LAM) at a lead time of 57 hours. It presents ground truth data alongside the ensemble mean, ensemble standard deviation, and multiple ensemble members for various weather variables. The purpose is to visually demonstrate the model's ability to generate spatially coherent forecasts and capture uncertainty.", "section": "K Additional Results: Limited Area Modeling with MEPS Data"}, {"figure_path": "wTIzpqX121/figures/figures_56_1.jpg", "caption": "Figure 26: Example Graph-EFM LAM ensemble forecasts at lead time 57 h.", "description": "The figure shows example forecasts from Graph-EFM for the LAM setting at a lead time of 57h. It includes ground truth, ensemble mean, ensemble standard deviation, and three example ensemble members for the following variables: surface pressure (pres0g), surface pressure (pres0e), net longwave radiation (nlwrs), net shortwave radiation (nswrs), 2m relative humidity (2r), relative humidity at level 65 (r65), u-component of wind at 65 level (u65), v-component of wind at 65 level (v65), integrated column of water vapor (wvint), geopotential at 500 hPa (z500), geopotential at 1000 hPa (z1000), temperature at 65 level (t65), temperature at 500 hPa (t500), temperature at 850 hPa (t850), u-component of wind at 850 hPa (u850), v-component of wind at 850 hPa (v850), and vertical velocity at 700 hPa (w700).  The forecasts highlight the model's ability to capture both the mean state and the uncertainty in the forecasts.", "section": "K Additional Results: Limited Area Modeling with MEPS Data"}, {"figure_path": "wTIzpqX121/figures/figures_57_1.jpg", "caption": "Figure 26: Example Graph-EFM LAM ensemble forecasts at lead time 57 h.", "description": "The figure shows example forecasts from the Graph-EFM model for the limited area modeling task. It shows the ground truth, ensemble mean, ensemble standard deviation, and three randomly chosen ensemble members for several variables, including pressure at ground level and sea level, net solar radiation flux (longwave and shortwave), relative humidity at 2 meters and 65 vertical levels, wind speed components (u and v) at 65 and 850 hPa, geopotential height at 500 and 1000 hPa, and integrated column of water vapor.  These forecasts illustrate the model's ability to capture both the mean and uncertainty in weather prediction at a high spatial resolution. The ensemble members demonstrate spatial coherence and realistic features of the forecasts.", "section": "K Additional Results: Limited Area Modeling with MEPS Data"}, {"figure_path": "wTIzpqX121/figures/figures_58_1.jpg", "caption": "Figure 21: Example Graph-EFM global ensemble forecasts at lead time 10 days.", "description": "The figure shows example forecasts from Graph-EFM for various weather variables at a lead time of 10 days. It includes the ground truth, ensemble mean, ensemble standard deviation, and three randomly selected ensemble members for each variable.  The visualization helps to understand the model's ability to capture forecast uncertainty and spatial coherence.", "section": "Additional Results: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_59_1.jpg", "caption": "Figure 26: Example Graph-EFM LAM ensemble forecasts at lead time 57h.", "description": "This figure displays example ensemble forecasts from the Graph-EFM model for the limited area modeling task using MEPS data.  The forecasts are for a lead time of 57 hours. Each row shows a different variable: ground truth, ensemble mean, ensemble standard deviation, and three randomly selected ensemble members. The boundary area, which is not being forecast, is shown as a faded border around the plots. The figure visually demonstrates the spatial coherence of the ensemble forecasts produced by Graph-EFM, highlighting the model's ability to capture the uncertainty and variability in weather prediction for a limited area.", "section": "K Additional Results: Limited Area Modeling with MEPS Data"}, {"figure_path": "wTIzpqX121/figures/figures_60_1.jpg", "caption": "Figure 12: Mesh graphs used in the global experiment. Note that the vertical positioning (away from earth's surface) is purely for visualization purposes.", "description": "This figure shows different mesh graphs used in the global forecasting experiments.  Panel (a) through (d) show the mesh graphs G1 through G4, which are created by recursively splitting the faces of an icosahedron. Panel (e) shows the multi-scale mesh graph GMS, which combines all of these by connecting the nodes from G1 with edges from all the levels. Panel (f) shows the hierarchical mesh graph, which is structured differently than the multi-scale mesh graph; the nodes are not merged, but are structured hierarchically with edges connecting adjacent levels, as shown in panel (g). The earth's surface is included for visualization but is not part of the model.", "section": "H Experiment Details: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_61_1.jpg", "caption": "Figure 12: Mesh graphs used in the global experiment. Note that the vertical positioning (away from earth's surface) is purely for visualization purposes.", "description": "This figure shows the mesh graphs used in the global forecasting experiment of the paper. It includes four subfigures showing the different levels (G1, G2, G3, and G4) of the hierarchical mesh graph, along with a visualization of the multi-scale mesh graph (GMS) and a visualization of the hierarchical mesh graph. The caption notes that the vertical positioning of the nodes is for visualization purposes only and does not reflect their actual positions on the earth's surface.", "section": "H Experiment Details: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_62_1.jpg", "caption": "Figure 26: Example Graph-EFM LAM ensemble forecasts at lead time 57 h.", "description": "This figure shows example forecasts from Graph-EFM for the limited area modeling task using MEPS data.  It displays ground truth values along with the ensemble mean, standard deviation, and several randomly selected ensemble members for various weather variables at a lead time of 57 hours. The purpose is to visually illustrate the model's ability to generate spatially coherent and realistic ensemble forecasts for a limited geographical area.", "section": "K Additional Results: Limited Area Modeling with MEPS Data"}, {"figure_path": "wTIzpqX121/figures/figures_63_1.jpg", "caption": "Figure 26: Example Graph-EFM LAM ensemble forecasts at lead time 57 h.", "description": "This figure shows example forecasts from Graph-EFM for the LAM setting at a 57h lead time.  It displays the ground truth, the ensemble mean, the ensemble standard deviation, and three randomly selected ensemble members for several meteorological variables. The purpose is to visually demonstrate the spatial coherence and variability captured by the Graph-EFM model in a limited area setting. Note that the forecasts include the boundary area, which is not included in the forecasting, presented as a faded border in each plot.", "section": "K Additional Results: Limited Area Modeling with MEPS Data"}, {"figure_path": "wTIzpqX121/figures/figures_65_1.jpg", "caption": "Figure 12: Mesh graphs used in the global experiment. Note that the vertical positioning (away from earth's surface) is purely for visualization purposes.", "description": "This figure shows different mesh graphs used in the global weather forecasting experiment described in the paper.  It illustrates the multi-scale mesh graph (GMS) created by recursively splitting the faces of an icosahedron, as well as the hierarchical mesh graph used in the Graph-EFM model. The hierarchical graph is composed of multiple levels (G1, G2, G3, G4), with each level having a different spatial resolution, and it adds connections between the nodes of adjacent levels. The figure also shows an example of inter-level graph (G3,4), which demonstrates how information is propagated between the different levels in the hierarchical structure.", "section": "H Experiment Details: Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_65_2.jpg", "caption": "Figure 1: Overview of our Graph-EFM model, with example data and graphs for a Limited Area Model. The corresponding overview for the global setting is given in fig. 6 in appendix C.", "description": "This figure provides a schematic overview of the Graph-EFM model, illustrating its components and data flow for a limited-area weather forecasting scenario.  It shows how gridded weather data (Xt−2:t−1, Ft) and boundary forcing data (Bt) are fed into the model.  The process involves mapping the data onto a hierarchical graph structure (G1, G2, G3), processing information through Graph Neural Networks (GNN) layers, and finally outputting a sample forecast (Xt) by sampling from the latent variable (Zt). A residual connection is used to incorporate the previous state. The figure highlights the key components of Graph-EFM, showcasing its hierarchical graph structure and efficient sampling method for generating ensemble forecasts. The global version of this model is discussed and illustrated in Figure 6 of Appendix C.", "section": "4 Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_66_1.jpg", "caption": "Figure 1: Overview of our Graph-EFM model, with example data and graphs for a Limited Area Model. The corresponding overview for the global setting is given in fig. 6 in appendix C.", "description": "This figure shows a schematic overview of the Graph-EFM model, which is a probabilistic weather forecasting model. It uses a hierarchical graph neural network to efficiently sample spatially coherent forecasts. The figure shows the flow of data through the model, highlighting the different components, such as the latent variable model, the deterministic predictor, and the hierarchical graph structure. The left side shows an example for a limited area model, while the right side shows the same structure for a global model. The hierarchical structure is used to efficiently capture processes unfolding over different spatial scales. By sampling from a distribution over latent variables at the top of the hierarchy, the model is able to generate a large number of diverse forecasts.", "section": "4 Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_66_2.jpg", "caption": "Figure 7: Example forecasts of 10 m wind speeds during Hurricane Laura, all for 2020-08-27T12 UTC. The first column shows the wind speeds in ERA5, with the red arrow indicating the location of the hurricane. Remaining columns show model forecasts for the specific time, initialized at different lead times ahead. For Graph-EFM we plot both 4 randomly sampled ensemble members and one cherry-picked member that was deemed to best match ERA5.", "description": "This figure displays a case study of Hurricane Laura forecasting using Graph-EFM and deterministic models.  It showcases 10m wind speed forecasts from ERA5 (ground truth), Graph-EFM (ensemble members and best-matching member), Graph-FM, and GraphCast*, at various lead times (7, 5, 3, and 1 days before landfall).  The figure demonstrates the ability of the Graph-EFM ensemble to capture the hurricane's development and landfall location, even with significant uncertainty at longer lead times, while deterministic models struggle to accurately predict the hurricane until much closer to landfall.", "section": "Extreme Weather Case Study: Hurricane Laura"}, {"figure_path": "wTIzpqX121/figures/figures_66_3.jpg", "caption": "Figure 1: Overview of our Graph-EFM model, with example data and graphs for a Limited Area Model. The corresponding overview for the global setting is given in fig. 6 in appendix C.", "description": "This figure shows the architecture of the Graph-EFM model for limited area forecasting.  It illustrates the flow of data through the model's hierarchical graph neural network structure, highlighting the use of latent variables and the process of sampling ensemble forecasts.  The input consists of past weather states and forcing data, which are processed at multiple spatial scales by different graph layers. The model produces ensemble forecasts by sampling from the probability distribution of latent variables. A corresponding overview for the global setting is given in Figure 6 of Appendix C.", "section": "4 Weather Forecasting with Hierarchical Graph Neural Networks"}, {"figure_path": "wTIzpqX121/figures/figures_67_1.jpg", "caption": "Figure 4: Example Graph-EFM ensemble forecast for specific humidity at 700 hPa (q700), for lead time 10 days. The bottom row shows 3 ensemble members, randomly chosen out of the 80.", "description": "This figure shows an example of the Graph-EFM model's forecast for specific humidity at 700 hPa (q700) with a lead time of 10 days. It visually compares the ground truth, ensemble mean, ensemble standard deviation, and three randomly selected ensemble members. The purpose is to illustrate the model's ability to produce spatially coherent forecasts with uncertainty quantification.", "section": "Global Forecasting with ERA5"}, {"figure_path": "wTIzpqX121/figures/figures_68_1.jpg", "caption": "Figure 20: Comparison of global model forecasts at 10 days lead time for u-component of 10 m wind (10u), specific humidity at 700 hPa (q700) and geopotential at 500 hPa (z500). For probabilistic models we show sampled ensemble members.", "description": "This figure compares the forecasts of three different models (GraphCast*, Graph-FM, and Graph-EFM) with the ground truth for three different variables (10m wind, specific humidity at 700hPa, and geopotential at 500hPa) at a lead time of 10 days.  For the probabilistic models (Graph-EFM and Graph-EFM(ms)), example members from the ensemble are shown to highlight the forecast uncertainty.", "section": "J Additional Results: Global Forecasting with ERA5"}]