[{"figure_path": "iNvXYQrkpi/tables/tables_7_1.jpg", "caption": "Table 1: Comparison of our Streamlined Inference with baseline methods in video visual quality (on UCF101), PM (Peak Memory), and latency (measured with 50 runs with the average value).", "description": "This table compares the performance of the proposed Streamlined Inference method against baseline methods (Original, Naïve Slicing) for three different video diffusion models (SVD, SVD-XT, AnimateDiff) at two resolutions (512x512 and 576x1024).  The metrics used for comparison include Fréchet Video Distance (FVD), CLIP Score, Peak Memory (PM), and Latency. Lower FVD and higher CLIP Score indicate better video quality.  Lower PM and Latency values signify better memory efficiency and faster inference speed. The #F column indicates the number of frames generated for each video.", "section": "5.2 Quantitative Evaluation"}, {"figure_path": "iNvXYQrkpi/tables/tables_8_1.jpg", "caption": "Table 2: Ablation study of our proposed method compared with DeepCache in video visual quality. Both our Step Rehash and DeepCache involve 13 full computation steps.", "description": "This table presents the ablation study comparing the proposed method with DeepCache on video visual quality using UCF101 and MSR-VTT datasets. Both methods use 13 full computation steps.  The results show the FVD (Fréchet Video Distance) and CLIP-Score for each method and dataset, demonstrating the performance of Step Rehash compared to DeepCache and the baseline model.", "section": "5.3 Ablation Study"}, {"figure_path": "iNvXYQrkpi/tables/tables_12_1.jpg", "caption": "Table 1: Comparison of our Streamlined Inference with baseline methods in video visual quality (on UCF101), PM (Peak Memory), and latency (measured with 50 runs with the average value).", "description": "This table compares the performance of the proposed Streamlined Inference method against baseline methods (original, naïve slicing) for three different video generation models (SVD, SVD-XT, AnimateDiff) at two different resolutions (512x512, 576x1024).  The comparison includes Fréchet Video Distance (FVD), CLIP score, peak memory (PM) usage, and inference latency. Lower FVD and higher CLIP scores indicate better visual quality. Lower PM and latency values represent better memory efficiency and speed.", "section": "5.2 Quantitative Evaluation"}]