[{"figure_path": "T6LOGZBC2m/figures/figures_5_1.jpg", "caption": "Figure 1: Interpreting weights for different estimators. X-axis shows the value of V₁\" and Y-axis shows the value of V₂\".", "description": "This figure shows how the weights assigned by OPERA to different estimators are influenced by the bias and variance of those estimators.  Four scenarios are presented:\n\n* **Low bias, differing variance:** When both estimators have low bias but one has higher variance, OPERA assigns a higher weight to the estimator with lower variance. \n* **Similar variance, opposite bias:** When both estimators have similar variance but opposite biases, OPERA assigns roughly equal weights to both estimators.\n* **High bias, opposite bias:** When one estimator is unbiased and the other has high bias, OPERA assigns a weight of 0 to the biased estimator.\n* **Differing bias and variance:**  When one estimator has low bias and variance and the other has high bias, OPERA assigns a high weight to the low bias/variance estimator and a negative weight to the high bias estimator.", "section": "4 OPERA"}, {"figure_path": "T6LOGZBC2m/figures/figures_5_2.jpg", "caption": "Figure 1: Interpreting weights for different estimators. X-axis shows the value of V₁\" and Y-axis shows the value of V₂\".", "description": "This figure shows how OPERA assigns weights to different estimators based on their bias and variance.  Each subplot represents a different scenario with two estimators (V₁ and V₂). The x-axis shows the value of V₁, and the y-axis shows the value of V₂.  The assigned weights (α₁ and α₂) are indicated in each subplot.  The plots demonstrate how OPERA adjusts weights to leverage the strengths of low-variance, low-bias estimators, handle opposing biases, and account for variations in estimator properties.", "section": "4 OPERA"}, {"figure_path": "T6LOGZBC2m/figures/figures_6_1.jpg", "caption": "Figure 2: Left: Results for contextual bandits. (a) MSE of estimators when the dataset size grows. (b) CDF of normalized MSE across 180 conditions by the worst MSE of that condition. Better methods lie in the top-left quadrant. Right: (c) For an MDP domain (Sepsis), we show that as dataset sizes increase, our bootstrap estimation of MSE approaches true MSE for each OPE estimator.", "description": "This figure shows the results of contextual bandit and sepsis experiments.  The left side shows the mean squared error (MSE) of different estimators as the dataset size grows for contextual bandits.  It also presents a cumulative distribution function (CDF) of normalized MSE, allowing for comparison across various conditions.  The right side focuses on the Sepsis domain, demonstrating how the bootstrap estimation of MSE converges to the true MSE for each Offline Policy Evaluation (OPE) estimator as the dataset size increases.", "section": "5 Experiment"}, {"figure_path": "T6LOGZBC2m/figures/figures_13_1.jpg", "caption": "Figure 3: OPERA framework as a two-stage process.", "description": "The figure illustrates the OPERA framework as a two-stage process. Stage 1 involves using bootstrap to estimate the quality of each OPE estimator, and then using this information to estimate a weight vector \\( \\hat{\\alpha} \\) through convex optimization. Stage 2 uses the learned weight vector to combine each estimator's score, resulting in the OPERA score.  The diagram visually represents the flow of data and computations in the OPERA algorithm.", "section": "A.1 OPERA Diagram"}, {"figure_path": "T6LOGZBC2m/figures/figures_18_1.jpg", "caption": "Figure 1: Interpreting weights for different estimators. X-axis shows the value of V₁\" and Y-axis shows the value of V₂\".", "description": "This figure shows how OPERA assigns weights to different estimators based on their bias and variance.  The plots illustrate different scenarios: when estimators have low bias but different variances, OPERA favors the estimator with lower variance; when estimators have similar variance but opposite biases, OPERA assigns weights that approximately cancel out the biases; and when one estimator is unbiased and the other has low variance, OPERA assigns weights inversely proportional to their MSE contributions.", "section": "4 OPERA"}]