[{"figure_path": "2cczgOfMP4/tables/tables_6_1.jpg", "caption": "Table 1: Experimental results for ToT, CoT, TS-SFT, and our proposed CPO across complex tasks including question answering, fact verification, and arithmetic reasoning are presented. * means significantly better than the best baseline (TS-SFT) with p < 0.01. Bold denotes the best method, and the second best if the top method is ToT.", "description": "This table presents a comparison of the performance of four different methods (ToT, CoT, TS-SFT, and CPO) on three types of reasoning tasks: Question Answering, Fact Verification, and Arithmetic Reasoning.  The results are shown for three different large language models (LLaMA2-7B, LLaMA2-13B, and Mistral-7B). For each method and model, the accuracy and latency (in seconds per instance) are reported.  A significant improvement (p<0.01) by CPO over the best baseline is indicated by an asterisk (*).  The best result for each task is shown in bold.", "section": "5 Experiments"}, {"figure_path": "2cczgOfMP4/tables/tables_8_1.jpg", "caption": "Table 1: Experimental results for ToT, CoT, TS-SFT, and our proposed CPO across complex tasks including question answering, fact verification, and arithmetic reasoning are presented. * means significantly better than the best baseline (TS-SFT) with p < 0.01. Bold denotes the best method, and the second best if the top method is ToT.", "description": "This table presents the experimental results comparing four different methods (ToT, CoT, TS-SFT, and CPO) across three complex reasoning tasks: Question Answering, Fact Verification, and Arithmetic Reasoning.  The results are shown for three different LLMs (LLaMA2-7B, LLaMA2-13B, and Mistral-7B). For each task and LLM, the accuracy and latency (in seconds per instance) are provided.  The '*' indicates statistically significant improvements (p<0.01) compared to the best baseline (TS-SFT), while bold highlights the best-performing method in each case.  If ToT is the best-performing method, the second-best method is shown in bold.", "section": "5 Experiments"}, {"figure_path": "2cczgOfMP4/tables/tables_16_1.jpg", "caption": "Table 3: Effects of iterative learning on the Bamboogle dataset using the LLaMA2-7B as the base model.", "description": "This table shows the results of experiments on the Bamboogle dataset using the LLaMA2-7B model, exploring the impact of iterative learning using two different strategies: SFT+CPO and CPO only. Each strategy involves multiple iterations, with the performance measured using both CoT and ToT inference methods. The table showcases how the model's performance improves or changes across different iterations and inference methods.", "section": "5.2 Overall Results on Reasoning"}, {"figure_path": "2cczgOfMP4/tables/tables_16_2.jpg", "caption": "Table 1: Experimental results for ToT, CoT, TS-SFT, and our proposed CPO across complex tasks including question answering, fact verification, and arithmetic reasoning are presented. * means significantly better than the best baseline (TS-SFT) with p < 0.01. Bold denotes the best method, and the second best if the top method is ToT.", "description": "This table presents a comparison of the performance of four different methods (ToT, CoT, TS-SFT, and CPO) across three types of reasoning tasks: Question Answering, Fact Verification, and Arithmetic Reasoning.  The results are shown for three different large language models (LLaMA2-7B, LLaMA2-13B, and Mistral-7B).  For each method and model, the accuracy and latency (in seconds per instance) are reported.  A * indicates that a method's accuracy is statistically significantly better than the best baseline (TS-SFT) at a significance level of p < 0.01.  Bold values indicate either the best or second-best performance for each task and model, with the latter occurring only when ToT achieves the best performance.", "section": "5 Experiments"}, {"figure_path": "2cczgOfMP4/tables/tables_17_1.jpg", "caption": "Table 1: Experimental results for ToT, CoT, TS-SFT, and our proposed CPO across complex tasks including question answering, fact verification, and arithmetic reasoning are presented. * means significantly better than the best baseline (TS-SFT) with p < 0.01. Bold denotes the best method, and the second best if the top method is ToT.", "description": "This table presents a comparison of the performance of four different methods (ToT, CoT, TS-SFT, and CPO) across three types of reasoning tasks (Question Answering, Fact Verification, and Arithmetic Reasoning).  The accuracy and latency (in seconds per instance) are reported for each method on several datasets.  The * indicates statistically significant improvements compared to the best baseline method (TS-SFT).  Bold values indicate the best performance for each task, while values in bold italics represent the second-best when ToT achieves the top performance.", "section": "5 Experiments"}]