[{"figure_path": "FsdB3I9Y24/tables/tables_4_1.jpg", "caption": "Table 1: PDM performance compared to (best) PhysDiff results on HumanML3D.", "description": "This table compares the performance of the proposed Projected Diffusion Model (PDM) against the state-of-the-art PhysDiff model on the HumanML3D dataset for 3D human motion generation.  It shows that PDM achieves zero penetration and floatation violations, unlike PhysDiff, which shows some errors.  The FID (Fréchet Inception Distance) scores are also included as a measure of image quality.", "section": "6.2 3D human motion (dynamic motion and physical principles)"}, {"figure_path": "FsdB3I9Y24/tables/tables_8_1.jpg", "caption": "Table 7: Sequential stages of the physics-informed models for in-distribution (Earth) and out-of-distribution (Moon) constraint imposition.", "description": "This table visually presents the generated samples from four different methods (Ground truth, PDM, Post+, and Cond+) for both in-distribution (Earth) and out-of-distribution (Moon) scenarios.  It showcases the ability of PDM to accurately generate samples that adhere to the physical constraints, even when the constraints are out of the training data distribution. The other methods struggle with accurate constraint satisfaction. FID scores are included to show how constraint satisfaction impacts image quality.  The images represent sequential stages (t=1,3,5) of an object falling under the influence of gravity.", "section": "6.4 Physics-informed motion (ODEs and out-of-distribution constraints)"}, {"figure_path": "FsdB3I9Y24/tables/tables_17_1.jpg", "caption": "Table 1: PDM performance compared to (best) PhysDiff results on HumanML3D.", "description": "This table compares the performance of the proposed Projected Diffusion Model (PDM) against the state-of-the-art method PhysDiff on the HumanML3D dataset.  The comparison is based on three metrics: FID (Fréchet Inception Distance), which measures the quality of generated samples; Penetrate, representing the average distance the generated figure penetrates the ground; and Float, showing the average distance the figure floats above the ground. Lower values are better for Penetrate and Float, indicating fewer physical violations.  The results demonstrate that PDM achieves superior results, showing no physical constraint violations while maintaining a competitive FID score.", "section": "6.2 3D human motion (dynamic motion and physical principles)"}, {"figure_path": "FsdB3I9Y24/tables/tables_18_1.jpg", "caption": "Table 2: Average sampling run-time in seconds.", "description": "This table presents the average time it takes to generate a single sample using different methods across four distinct experimental settings. The settings include: Constrained Materials, 3D Human Motion, Constrained Trajectories, and Physics-informed Motion.  For each setting, the table shows the time taken by four approaches: PDM, Post+, Cond, and Cond+. The PDM approach is the proposed method; Post+ applies a projection step after the generation process; Cond employs a conditional diffusion model; and Cond+ adds post-processing projection to a conditional diffusion model.  Times are in seconds.  The asterisk indicates that the computation for these particular methods were done using CPU instead of the GPU, leading to considerably longer processing time.", "section": "6 Experiments"}]