[{"figure_path": "5HQhYiGnYb/figures/figures_1_1.jpg", "caption": "Figure 1: Comparing the distributions of all values and block maxima values for real and generated samples using DDPM [12] when applied to the synthetic AR(1) dataset.", "description": "This figure compares the distributions of all values and block maxima values obtained from real and generated time series data using the Denoising Diffusion Probabilistic Model (DDPM). The left panel shows that DDPM effectively captures the distribution of all values in the synthetic AR(1) dataset. However, the right panel reveals that DDPM struggles to preserve the distribution of block maxima values when the generated time series is partitioned into disjoint time windows. This illustrates the difficulty of modeling the distribution of block maxima using existing diffusion models.", "section": "1 Introduction"}, {"figure_path": "5HQhYiGnYb/figures/figures_2_1.jpg", "caption": "Figure 2: Removal of high-frequency components from daily temperature time series significantly alters the magnitude of its block maxima value (at time step 20), as evidenced by its high residual.", "description": "This figure demonstrates the impact of removing high-frequency components on the block maxima of a daily temperature time series.  Subfigure (a) shows the original time series.  (b) displays the Fast Fourier Transform (FFT) of the time series, showing the frequency components. The high-frequency components are then zeroed out, and an Inverse Fast Fourier Transform (IFFT) is applied to reconstruct the time series, shown in (d). The residual or difference between the original and reconstructed time series is shown in (e), clearly indicating that the removal of high-frequency components significantly alters the block maxima value at time step 20. This highlights the strong association between high-frequency components and abrupt changes in block maxima values.", "section": "3 On the Rapid Dissipation of Block Maxima in Diffusion Models"}, {"figure_path": "5HQhYiGnYb/figures/figures_3_1.jpg", "caption": "Figure 3: A comparison of the effects of noise addition by existing DDPM versus high-frequency inflation on the block maxima of generated samples.", "description": "This figure compares the impact of noise addition (as done in standard DDPM) versus the proposed high-frequency inflation on the block maxima of generated time series samples. The left panel shows the attenuation of block maxima by DDPM, while the right shows the effect of high-frequency inflation strategy.  The top row displays the original and perturbed time series. The bottom row shows how the residuals (difference between original and perturbed series) evolve over iterations.  High-frequency inflation is designed to prevent the premature decay of high-frequency components (which are linked to block maxima) during the diffusion process. The figure illustrates that high-frequency inflation better preserves the block maxima values.", "section": "3 On the Rapid Dissipation of Block Maxima in Diffusion Models"}, {"figure_path": "5HQhYiGnYb/figures/figures_4_1.jpg", "caption": "Figure 4: Proposed FIDE framework for generating time series with extreme events", "description": "This figure presents a detailed illustration of the FIDE (Frequency-Inflated Conditional Diffusion Model) framework.  The framework consists of several key stages, beginning with high-frequency component inflation in the frequency domain, followed by a denoising diffusion probabilistic model (DDPM) for the forward process,  and a conditional reverse process network for generating samples conditioned on block maxima.  The GEV (Generalized Extreme Value) distribution enforcement module ensures fidelity to both block maxima and overall data distribution.  Finally, sampling is performed using the conditional reverse process network.  The figure visually summarizes the entire process, from data preprocessing and transformation to the final generation of time series data with accurately represented extreme events.", "section": "4 Proposed Framework: FIDE"}, {"figure_path": "5HQhYiGnYb/figures/figures_8_1.jpg", "caption": "Figure 1: Comparing the distributions of all values and block maxima values for real and generated samples using DDPM [12] when applied to the synthetic AR(1) dataset.", "description": "This figure compares the distribution of all data points and the distribution of block maxima in a synthetic AR(1) dataset.  The left panel shows the distribution of all values in the dataset, comparing the real data distribution to that generated by the Denoising Diffusion Probabilistic Model (DDPM).  The right panel shows the same comparison, but focuses only on the block maxima values. The visualization clearly illustrates that DDPM struggles to accurately model the distribution of the block maxima, highlighting the challenge that FIDE aims to address.", "section": "1 Introduction"}, {"figure_path": "5HQhYiGnYb/figures/figures_12_1.jpg", "caption": "Figure 6: Percentile distribution of first order derivatives for the block maxima values in different time series datasets. Observe that the derivatives tend to exhibit elevated percentile values.", "description": "This box plot visualizes the distribution of first-order derivatives for block maxima across various datasets (Temperature, Stock, Energy, ECG, AR1).  Each box represents a dataset, showing the median, interquartile range (IQR), and outliers. The figure illustrates that the derivatives associated with block maxima frequently show elevated percentile values, suggesting a correlation between abrupt changes and the occurrence of block maxima.", "section": "B Relationship between Abrupt Block Maxima and High Frequency Components"}, {"figure_path": "5HQhYiGnYb/figures/figures_13_1.jpg", "caption": "Figure 7: The summation of high frequency terms for abrupt (A) changes is consistently higher than for smooth (S) changes. (A) denotes abrupt changes, (S) denotes smooth changes.", "description": "This figure is a box plot showing the percentile distribution of the summation of high-frequency terms in the Fourier transform of time series data. It compares the distribution for time points with abrupt changes in value (labeled 'A') against those with smooth changes ('S'). The data is shown for several datasets, highlighting the higher frequency components and larger magnitude of change associated with abrupt shifts.", "section": "B Relationship between Abrupt Block Maxima and High Frequency Components"}]