[{"figure_path": "qu5NTwZtxA/tables/tables_7_1.jpg", "caption": "Table 1: Averaged performance over all finetuning sets for Synthetic (left), Air (middle), and Motor (right). \"Edited\" and \"Preserved\" are the average results of all edited and preserved attributes.", "description": "This table presents the average performance metrics across all finetuning sets for three datasets: Synthetic, Air, and Motor.  For each dataset, it shows the overall performance (MSE and MAE), and the performance on both edited and preserved attributes (RaTS, CTAP, |RaTS|, CTAP).  The metrics measure the model's ability to edit specified attributes and maintain consistency in other characteristics.  Higher RaTS and CTAP scores indicate better editing, while lower |RaTS| and higher CTAP scores indicate better preservation.", "section": "4.2 Main Results"}, {"figure_path": "qu5NTwZtxA/tables/tables_7_2.jpg", "caption": "Table 2: Ablation studies on the Synthetic, Air and Motor datasets. GT, BS and MR refer to Ground Truth source and target pairs, BootStrap and Multi-Resolution. Results are averaged over all finetuning sets. “Edited” and “Preserved” are the average results of all edited and preserved attributes.", "description": "This table presents the results of ablation studies conducted on three datasets (Synthetic, Air, and Motor) to analyze the impact of different components of the proposed Time Series Editor (TEdit) model.  Specifically, it examines the effects of using ground truth data (GT), the bootstrap learning algorithm (BS), and the multi-resolution approach (MR) on the model's performance in editing and preserving time series attributes.  The table shows average metrics across all finetuning sets for each dataset, broken down by whether the attributes were edited or preserved.  This allows for a clear comparison of the impact of each component on the model's overall performance and attribute-specific performance.", "section": "4.3 Ablation Study"}, {"figure_path": "qu5NTwZtxA/tables/tables_8_1.jpg", "caption": "Table 1: Averaged performance over all finetuning sets for Synthetic (left), Air (middle), and Motor (right). \"Edited\" and \"Preserved\" are the average results of all edited and preserved attributes.", "description": "This table presents the average performance of different methods (CSDI, Time Weaver, TEdit-CSDI, TEdit-TW) across three datasets (Synthetic, Air, Motor) for both edited and preserved attributes.  The metrics used are RaTS (Log Ratio of Target-to-Source probability) and CTAP (Contrastive Time series Attribute Pretraing) score, reflecting the ability to edit and preserve attributes respectively.  Lower MSE and MAE values on the Synthetic dataset indicate better performance in terms of numerical accuracy.  The table summarizes results from multiple finetuning sets, providing a comprehensive evaluation of the methods' performance.", "section": "4.2 Main Results"}, {"figure_path": "qu5NTwZtxA/tables/tables_8_2.jpg", "caption": "Table 1: Averaged performance over all finetuning sets for Synthetic (left), Air (middle), and Motor (right). \"Edited\" and \"Preserved\" are the average results of all edited and preserved attributes.", "description": "This table presents the average performance of different methods (CSDI, Time Weaver, TEdit-CSDI, and TEdit-TW) across three datasets (Synthetic, Air, and Motor).  The performance is measured by metrics such as RaTS, CTAP, MSE, and MAE, separately for edited and preserved attributes.  The results demonstrate the superiority of the TEdit models in both editing and preserving attributes in the time series.", "section": "4.2 Main Results"}, {"figure_path": "qu5NTwZtxA/tables/tables_17_1.jpg", "caption": "Table 1: Averaged performance over all finetuning sets for Synthetic (left), Air (middle), and Motor (right). \"Edited\" and \"Preserved\" are the average results of all edited and preserved attributes.", "description": "This table presents the averaged performance of different methods (CSDI, Time Weaver, TEdit-CSDI, TEdit-TW) on three datasets (Synthetic, Air, Motor) across all finetuning sets.  The performance is measured using RaTS, CTAP, MSE, and MAE scores, separated for \"edited\" and \"preserved\" attributes, indicating the model's ability to modify specified attributes while maintaining other characteristics.  Higher RaTS and CTAP values generally indicate better performance.", "section": "4.2 Main Results"}, {"figure_path": "qu5NTwZtxA/tables/tables_19_1.jpg", "caption": "Table 1: Averaged performance over all finetuning sets for Synthetic (left), Air (middle), and Motor (right). \"Edited\" and \"Preserved\" are the average results of all edited and preserved attributes.", "description": "This table presents the average performance of different methods across three datasets (Synthetic, Air, and Motor) for both edited and preserved attributes.  The metrics used include RaTS (Log Ratio of Target-to-Source probability), CTAP score (Contrastive Time series Attribute Pretraining), MSE (Mean Squared Error), and MAE (Mean Absolute Error).  The results show the performance of the proposed TEdit method in comparison to baseline methods (CSDI and Time Weaver).", "section": "4.2 Main Results"}, {"figure_path": "qu5NTwZtxA/tables/tables_20_1.jpg", "caption": "Table 7: The performance of CTAP models on different datasets. We report the top-1 and top-2 classification accuracy for each attribute on the test sets of the pertaining dataset.", "description": "This table shows the top 1 and top 2 classification accuracy of the CTAP model on different datasets.  The CTAP model is used to measure the alignment between the generated time series and real-world time series associated with given attribute values.  Higher accuracy indicates better alignment. The table includes results for synthetic data (trend types, trend directions, season cycles) and real-world datasets (Air Quality: city and season; Motor Imagery: channel ID and imagined movement).", "section": "4.1 Experimental Setup"}, {"figure_path": "qu5NTwZtxA/tables/tables_22_1.jpg", "caption": "Table 1: Averaged performance over all finetuning sets for Synthetic (left), Air (middle), and Motor (right). \"Edited\" and \"Preserved\" are the average results of all edited and preserved attributes.", "description": "This table presents the average performance of different methods (CSDI, Time Weaver, TEdit-CSDI, and TEdit-TW) across three datasets (Synthetic, Air, and Motor) for both edited and preserved attributes.  The performance is measured using RaTS (Ratio of Target-to-Source), CTAP (Contrastive Time series Attribute Pretraining) score, MSE (Mean Squared Error), and MAE (Mean Absolute Error). The results show that TEdit outperforms the baselines in most metrics, demonstrating its effectiveness in editing time series while preserving other properties.", "section": "4.2 Main Results"}, {"figure_path": "qu5NTwZtxA/tables/tables_22_2.jpg", "caption": "Table 1: Averaged performance over all finetuning sets for Synthetic (left), Air (middle), and Motor (right). \"Edited\" and \"Preserved\" are the average results of all edited and preserved attributes.", "description": "This table presents the average performance results across all finetuning sets for three datasets: Synthetic, Air, and Motor.  For each dataset, it shows the performance metrics for both the edited and preserved attributes.  The metrics used include RaTS (Log Ratio of Target-to-Source probability), CTAP (Contrastive Time series Attribute Pretraing) score, MSE (Mean Squared Error), and MAE (Mean Absolute Error). Higher RaTS and CTAP scores indicate better performance for edited attributes, while lower |RaTS| and higher CTAP scores indicate better performance for preserved attributes. MSE and MAE are only reported for the Synthetic dataset.", "section": "4.2 Main Results"}]