[{"type": "text", "text": "Vision-Language Models are Strong Noisy Label Detectors ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Tong Wei1,2,3 Hao-Tian ${\\bf L i}^{1,2}$ Chun-Shu Li1,2 Jiang-Xin Shi3,4 Yu-Feng $\\mathbf{Li^{3,4}}$ Min-Ling Zhang1,2 ", "page_idx": 0}, {"type": "text", "text": "1School of Computer Science and Engineering, Southeast University, Nanjing, China 2Key Laboratory of Computer Network and Information Integration (Southeast University), Ministry of Education, China 3National Key Laboratory for Novel Software Technology, Nanjing University, China 4School of Artificial Intelligence, Nanjing University, China {weit,liht}@seu.edu.cn ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Recent research on fine-tuning vision-language models has demonstrated impressive performance in various downstream tasks. However, the challenge of obtaining accurately labeled data in real-world applications poses a significant obstacle during the fine-tuning process. To address this challenge, this paper presents a Denoising Fine-Tuning framework, called DEFT, for adapting vision-language models. DEFT utilizes the robust alignment of textual and visual features pretrained on millions of auxiliary image-text pairs to sieve out noisy labels. The proposed framework establishes a noisy label detector by learning positive and negative textual prompts for each class. The positive prompt seeks to reveal distinctive features of the class, while the negative prompt serves as a learnable threshold for separating clean and noisy samples. We employ parameter-efficient fine-tuning for the adaptation of a pre-trained visual encoder to promote its alignment with the learned textual prompts. As a general framework, DEFT can seamlessly fine-tune many pre-trained models to downstream tasks by utilizing carefully selected clean samples. Experimental results on seven synthetic and real-world noisy datasets validate the effectiveness of DEFT in both noisy label detection and image classification tasks. Our source code is available at https://github.com/HotanLee/DeFT. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Vision-language models pre-trained on large-scale image-text pairs, such as Contrastive LanguageImage Pretraining (CLIP) [29], have gained widespread adoption in various machine learning tasks including few-shot learning [53, 52], multi-label learning [33, 14], and long-tail recognition [7, 30]. Recently, CLIP has shown impressive generalization performance to many downstream tasks without the need for adaptation [36, 31]. Zero-shot CLIP leverages the strong alignment of learned visual and textual features and classifies unseen images by comparing the similarity of image embedding with textual class prompts. Despite the good zero-shot performance, fine-tuning becomes necessary when the data distribution of downstream tasks significantly deviates from the CLIP training source. Two popular fine-tuning paradigms are commonly employed for adaptation, i.e., full fine-tuning (FFT), which modifies all model parameters, and parameter-efficient fine-tuning (PEFT), which fixes the pre-trained parameters while adding a few learnable parameters for adaptation. While promising, fine-tuning CLIP necessitates perfectly labeled datasets which may not be readily available in many real-world tasks, thereby hindering their broader applicability. ", "page_idx": 0}, {"type": "text", "text": "To tackle this issue, this paper investigates the fine-tuning of CLIP utilizing imperfectly labeled datasets, i.e., datasets with noisy labels. Intuitively, direct adaptation using noisy labels can significantly degrade the performance. To mitigate the negative impact of noisy labels, researchers have proposed various approaches for learning with noisy labels, including sample selection techniques [10, 44, 43] and noise-robust learning methods [37, 27]. However, the exploration of this problem in the context of CLIP adaptation remains limited. This paper aims to fill this research gap by demonstrating that CLIP can be leveraged as effective noisy label detectors, capitalizing on their strong alignment between visual and textual features. To ensure the generality, we follow the basic idea in mainstream studies of learning with noisy labels. Firstly, we identify potentially mislabeled samples, and subsequently, we adapt the model parameters using carefully selected clean samples. ", "page_idx": 0}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "In the first phase, we propose to construct a noisy label detector by learning positive and negative textual prompts for each class. The positive prompt aims to uncover distinguishable features specific to the class, while the negative prompt functions as a learnable “threshold” for identifying noisy labels. Our noisy label detector can be derived from the similarity between embeddings of a training image and positive/negative prompts associated with its assigned class. If the image exhibits a higher similarity score with the positive prompt than the negative prompt, it is considered a correctly labeled sample, i.e., a clean sample. This design draws inspiration from previous studies that have shown the robustness of prompt tuning to noisy labels, particularly in the presence of high noise ratios [41]. To optimize the positive prompt, we align its representation with image features from the corresponding class during training. For the negative prompts, we introduce a novel negative learning objective. It is important to note that calculating similarities between images and textual prompts requires a strong alignment between these two modalities in the downstream task. To achieve this, we utilize PEFT, such as Visual Prompt Tuning (VPT) [18], for the adaptation of the visual encoder. This decision is based on a key finding that FFT can distort pre-trained feature representations when noisy labels are present, which is discussed in Section 3.2. ", "page_idx": 1}, {"type": "text", "text": "In the second phase, we can adapt the pre-trained model after acquiring carefully selected clean samples. It is worth noting that not only can we employ pre-trained CLIP for adaptation, but we can also utilize other pre-trained visual backbones such as ResNet [12] and MAE [11]. While the model adaptation phase may seem unnecessary since we can leverage the learned textual prompts for zero-shot classification without further fine-tuning, we emphasize its necessity by the improved performance on curated downstream datasets, particularly in fine-grained classification tasks. In this step, we learn a linear classifier and fully fine-tune the visual encoders using only selected clean samples. The rationale behind this approach is twofold: 1) the linear classifier tends to generalize better than textual class prompts, and 2) full fine-tuning can effectively adapt model parameters to address significant domain shifts, surpassing the capabilities of PEFT. In our implementation, the training is conducted for only 10 epochs, resulting in a minimal increase in computation cost. ", "page_idx": 1}, {"type": "text", "text": "Our main contributions can be summarized as follows: ", "page_idx": 1}, {"type": "text", "text": "• We propose DEFT, a simple yet effective framework for learning with noisy labels. DEFT offers several compelling advantages over existing methods: instance-dependent (no information required from entire training data), robust to various types of noisy labels, and generalizable to many pre-trained models.   \n• We conduct extensive experiments and show that DEFT achieves superior performance in both noisy label detection and image classification tasks on a wide range of synthetic and real-world datasets.   \n• We provide in-depth empirical analysis, providing insights to understand the effectiveness of DEFT. We hope that this work will serve as a springboard for future works on noisy label detection with multi-modal features. ", "page_idx": 1}, {"type": "text", "text": "2 Related Work ", "text_level": 1, "page_idx": 1}, {"type": "text", "text": "Learning with Noisy Labels A diverse variety of approaches have been proposed for addressing learning with noisy labels and can be broadly divided into twofold: robust learning and clean sample selection [9, 32]. Due to the susceptibility of traditional cross-entropy loss to noisy labels, several methods adopt noise-robust loss functions [8, 51, 37, 6] and regularization techniques [27, 38, 16] to enhance model robustness. For example, symmetric cross-entropy loss [37] introduces a noise-robust objective function for fast convergence and better performance. Early-learning regularization [27] counteracts the influence of the noisy labels by introducing a regularization term that integrates estimated target probabilities. However, empirical findings suggest that robust model learning faces the problem of maintaining a balance between robustness and accuracy [51, 35]. Conversely, sample selection approaches strive to select clean samples from noisy datasets using specific criteria. Based on the memorization effect identified in deep neural networks [2], Numerous methods adopt the small-loss strategy that treats samples with small loss as clean ones [10, 15, 25, 19]. Co-teaching [10] selects a fraction of training data in each mini-batch based on the noise ratio, whereas DivideMix [25] fits a Gaussian mixture model to dynamically divide the training samples. Although these methods demonstrate strong performance, they inevitably overlook the significance of clean hard samples with a large loss. Besides, all the aforementioned approaches concentrate exclusively on learning from scratch with label noise. Our proposed approach leverages the pre-trained multi-modal information from visual-language models to construct a noisy label detector, resulting in improved sample selection performance. ", "page_idx": 1}, {"type": "text", "text": "", "page_idx": 2}, {"type": "text", "text": "Fine-Tuning Vision-Language Models Recent years have witnessed incredible progress in pretrained visual-language models [29, 17, 49]. As a representative method, CLIP [29] employs contrastive pre-training to acquire informative representations from extensive image-text pairs. Despite the remarkable zero-shot performance of CLIP, its sensitivity to hand-crafted textual prompts is significant. Prompt-tuning aims to learn the optimal prompts from target data by replacing the textual templates with adaptable soft prompts, which demonstrates superior performance in the context of few-show learning [53, 52, 20] and multi-label learning [33, 14]. However, further enhancements can be achieved by adapting the visual encoder to accommodate larger datasets in downstream tasks. A standard approach to obtain task-specific representations is fine-tuning all model parameters. While FFT yields significant performance on curated datasets, recent work [1] empirically finds that FFT can result in feature distortion in the presence of massive noisy labels. In contrast, PEFT [48] has been verified to improve generalization capabilities for mitigation of overfitting issues [30], which fix the pre-trained model and introduce a few number of learnable parameters for adaptation, such as VPT [18], LoRA [13], and AdaptFormer [3]. Considering the distinct property of fine-tuning methods, this paper aims to delineate the most effective paradigm for model adaptation on noisy downstream datasets, which remains under-explored yet holds significant promise. ", "page_idx": 2}, {"type": "text", "text": "3 Preliminary and Initial Findings ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "3.1 Zero-Shot CLIP ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "This paper focuses on a $K$ -class image classification task, where the objective is to categorize an image $\\textbf{\\em x}\\in\\mathbb{R}^{d}$ and assign it a label $y\\;\\in\\;[K]\\;=\\;\\{1,2,...\\,,K\\}$ . Benefiting from large-scale datasets and high-capacity models, CLIP [29] has demonstrated remarkable performance in zero-shot classification by computing the similarity between visual and textual representations. Specifically, with hand-crafted textual prompts such as $\\mathbf{\\sigma}^{\\leftarrow}\\mathbf{a}$ photo of a [CLS]”, where the class token is replaced by a specific class name, the prediction probability is computed as: ", "page_idx": 2}, {"type": "equation", "text": "$$\np(\\boldsymbol{y}=\\boldsymbol{k}\\mid\\boldsymbol{x})=\\frac{\\exp(\\sin(\\boldsymbol{I},T_{k})/\\tau)}{\\sum_{k=1}^{K}\\exp(\\sin(\\boldsymbol{I},T_{k})/\\tau)},\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "where $\\mathbf{sim}(\\cdot,\\cdot)$ denotes the cosine similarity between the extracted image features $\\boldsymbol{\\mathit{I}}$ and text features $\\textbf{\\emph{T}}$ , and $\\tau$ is the softmax temperature. ", "page_idx": 2}, {"type": "text", "text": "While zero-shot classification with CLIP is promising, its performance can be further enhanced by adapting CLIP on downstream labeled datasets $\\pmb{\\mathcal{D}}=\\{(\\pmb{x}_{i},\\pmb{\\dot{y}}_{i})_{i=1}^{N}\\}$ to incorporate more task-specific representations. In this paper, we investigate the presence of noisy labels in the training dataset $\\mathcal{D}$ , which is prevalent in real-world applications. We use $r\\in[0,1]$ to denote the noise ratio of a training set, meaning that $N\\times r$ training samples are incorrectly labeled, i.e., the assigned label $y$ differs from the ground-truth label $y^{\\ast}$ . Since $y^{\\ast}$ is not accessible, our goal is to fine-tune the CLIP model using training labels $y$ by eliminating the negative influence of noisy labels. Considering the feature distortion induced by noisy labels [2], the key challenge lies in obtaining distinguishable yet robust representations when adapting CLIP on noisy datasets. ", "page_idx": 2}, {"type": "text", "text": "3.2 Fine-tuning CLIP on Downstream Datasets ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "To discern the most effective method for CLIP adaptation, we conduct empirical studies on various datasets as shown in Figure 1. Specifically, we utilize three fine-tuning approaches to adapt the pre-trained CLIP model and compare their performance on both noisy and clean datasets, including 1) FFT which updates the entire model parameters, 2) VPT which fixes pre-trained model parameters and prepends a small subset of extra learnable parameters to the visual encoder during fine-tuning, and 3) VLPT (Vision-Language Prompt Tuning) which integrates both visual and textual learnable prompts into the fixed pre-trained model for fine-tuning. For FFT and VPT, we learn an additional linear classifier, while VLPT directly utilizes the learned textual prompts for classification. We present our three primary findings in the following. ", "page_idx": 2}, {"type": "text", "text": "", "page_idx": 3}, {"type": "text", "text": "VPT benefits representation learning in the presence of massive noisy labels. Intuitively, utilizing FFT for CLIP adaptation yields improved performance by leveraging its substantial capacity to incorporate task-specific representations. However, the efficacy of FFT diminishes notably when applied to datasets containing noisy labels, as shown in Figure 1a. This decline is attributed to the pronounced distortion of representations with an escalating noise ratio [1]. In contrast, VPT beneftis representation learning when adapting CLIP on noisy data, particularly under high levels of noise. As only a small set of parameters is introduced, VPT effi", "page_idx": 3}, {"type": "image", "img_path": "haUnEiXgQ7/tmp/09102e2237616c902120fb6006cd204e011224c07209a792970967b5ceb29070.jpg", "img_caption": ["", "Figure 1: Comparison of different fine-tuning methods under (a) various ratios of noisy labels and (b) clean datasets. "], "img_footnote": [], "page_idx": 3}, {"type": "text", "text": "ciently retains the generalization ability from image-text pre-training while enhancing classification performance on downstream tasks, making it a robust and effective fine-tuning approach for handling noisy downstream datasets. ", "page_idx": 3}, {"type": "text", "text": "Textual classifier is robust to noisy labels. Classification with learnable textual prompts (e.g., CoOp [53]) leverages the multi-modal information in pre-trained vision-language models and enhances the alignment of visual and textual representations on downstream tasks. Recent literature has substantiated its robustness with a frozen visual encoder in the context of few-shot learning [41]. From Figure 1a, we observe that VLPT with a textual classifier (green line) consistently surpasses VPT with a traditional linear classifier for classification (orange line), especially under severe noise. The improvement in performance across diverse noise ratios further affirms the robustness of learnable textual prompts in mitigating the impact of label noise for model adaptation. ", "page_idx": 3}, {"type": "text", "text": "FFT enhances visual recognition on clean datasets. Although previous findings show that FFT is more susceptible to noisy labels compared to VPT and VLPT, Figure 1b demonstrates its enhanced discriminative ability when training data is clean. This superiority is particularly significant on fine-grained datasets such as Stanford-Cars and CUB-200-2011, with an average improvement of $2.81\\%$ against VPT. It is important to note that VLPT exhibits the worst performance on clean datasets. This is primarily due to the implicit regularization of pre-trained textual information when tuning the context of textual prompts, as explained in the recent study [41]. ", "page_idx": 3}, {"type": "text", "text": "4 The Denoising Fine-tuning Framework ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Based on the findings in Section 3.2, we now present a novel denoising fine-tuning framework, DEFT, which comprises two pivotal phases. In the first phase, DEFT learns dual textual prompts to separate clean and noisy samples while adapting the visual encoder utilizing PEFT methods. In the second phase, DEFT re-adapts the pre-trained model using FFT, leveraging the curated clean samples to further boost visual recognition performance. Figure 2 illustrates our proposed framework. ", "page_idx": 3}, {"type": "text", "text": "4.1 Identifying Noisy Labels with Dual Prompts ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Given the empirically demonstrated robustness of textual prompts to label noise, we intend to harness this property to identify corrupted samples in noisy downstream datasets. The initial strategy is to select a subset of samples with pronounced similarity between their visual and textual representations and designate them as clean. However, this method relies on either prior knowledge of the noise ratio or the manual setting of thresholds, which restricts its practical applicability. Inspired by recent works [33, 14, 36], we utilize dual textual prompts instead of a single prompt to overcome these limitations. Concretely, we design a class-specific pair of positive and negative prompts for the textual encoder, ", "page_idx": 3}, {"type": "image", "img_path": "haUnEiXgQ7/tmp/5357a40582a214471dbb14ff1d8f93e3a6f9156f58d8d147c75335ac9d378679.jpg", "img_caption": [], "img_footnote": [], "page_idx": 4}, {"type": "text", "text": "Figure 2: Illustration of the proposed DEFT framework. Left: We identify noisy labels with learnable dual textual prompts and improve image-text alignment by optimizing PEFT modules. Right: Adapt pre-trained models using FFT on selected clean samples. ", "page_idx": 4}, {"type": "text", "text": "denoted as promptk+ and $\\mathfrak{p r o m p t}_{k}^{-}$ , respectively: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\mathrm{prompt}_{k}^{+}=[V]_{1}^{+}[V]_{2}^{+}[V]_{3}^{+}...[V]_{M}^{+}[\\mathrm{CLS}]_{k}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "equation", "text": "$$\n\\mathrm{\\prompt_{k}^{-}}=[V]_{1}^{-}[V]_{2}^{-}[V]_{3}^{-}...[V]_{M}^{-}[\\mathrm{CLS}]_{k}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Here, $[V]_{m}$ is the word vector of context (with dimension 512 in CLIP), $M$ is the length of context, and $[\\mathrm{CLS}]_{k}$ is the $k$ -th provided category name. The positive prompt aims to uncover distinguishable features by maximizing the similarity between the image features and their corresponding text features, while the negative prompt serves as a learnable sample-dependent similarity threshold to select clean data. Specifically, the learnable threshold $\\phi_{i}$ for the $i$ -th training sample with label $y_{i}=k$ is formulated as: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\phi_{i}=\\mathsf{s i m}(I_{i},T_{k}^{-})\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "which represents the cosine similarity between the extracted image features and negative text features. Based on this threshold, the clean subset of dataset $\\mathcal{D}$ can be constructed as follows: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\mathcal{D}^{\\mathrm{clean}}=\\{(\\pmb{x}_{i},y_{i})~|~\\mathrm{sim}(\\pmb{I}_{i},\\pmb{T}_{k}^{+})>\\phi_{i}~\\mathrm{and}~y_{i}=k\\}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "The proposed selection strategy surpasses the conventional loss-based approaches in two aspects: 1) It is more practical by utilizing data-driven thresholds thus eliminating the requirement for prior knowledge like noise ratio, and 2) the integration of text modality enhances its robustness to label noise, making it capable of identifying challenging hard noise. Nevertheless, the primary dilemma lies in the optimization of positive and negative prompts using noisy downstream datasets. ", "page_idx": 4}, {"type": "text", "text": "4.2 Optimization for Noisy Label Detector ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "It can be an intricate task to optimize the threshold $\\phi_{i}$ in an end-to-end manner since it is indirectly involved in the forward propagation. However, we can still optimize the associated parameters by formulating the clean probability of the $i$ -th image with $y_{i}=k$ as: ", "page_idx": 4}, {"type": "equation", "text": "$$\np_{i k}^{\\mathrm{clean}}=\\frac{\\exp(\\sin(I_{i},\\mathbf{T}_{k}^{+})/\\tau)}{\\exp(\\sin(I_{i},\\mathbf{T}_{k}^{+})/\\tau)+\\exp(\\mathbf{sim}(I_{i},\\mathbf{T}_{k}^{-})/\\tau)}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Obviously, selecting samples with the clean probability $p_{i k}^{\\mathrm{clean}}>0.5$ is equivalent to the specified criteria in Eq. (5). In this way, the original threshold-based selection approach can be transformed into $K$ binary classification tasks to determine whether a sample is clean or not. Concretely, given a sample $({\\pmb x}_{i},y_{i})$ from noisy datasets $\\mathcal{D}$ , we can employ the dual prompts of class $y_{i}$ as a binary classifier to identify label noise. If the classifier outputs a positive prediction of $\\pmb{x}_{i}$ , it is categorized as a clean sample. ", "page_idx": 4}, {"type": "text", "text": "To optimize the noisy label detector, we need to construct positive and negative training samples for binary classification, i.e., images with correctly and wrongly assigned labels. Inspired by the prior work on negative learning [21], we designate each image with a randomly picked complementary label $\\bar{y}$ to form negative samples. For positive samples, we initiate with the original supervision in $\\mathcal{D}$ and refine it with pseudo labels $\\hat{y}$ generated by Eq. (1). The training loss is then formulated as follows: ", "page_idx": 4}, {"type": "text", "text": "", "page_idx": 5}, {"type": "equation", "text": "$$\n\\mathcal{L}_{d p}=\\frac{1}{N}\\sum_{i=1}^{N}\\ell_{n l l}(\\pmb{p}_{i}^{\\mathrm{clean}},\\hat{y})+\\ell_{n l l}(1-\\pmb{p}_{i}^{\\mathrm{clean}},\\bar{y})\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where piclean= {piclkean}kK= is the clean probability and $\\ell_{n l l}(\\cdot,\\cdot)$ is the negative log-likelihood loss where ℓnll(pi, y) = −log piy. ", "page_idx": 5}, {"type": "text", "text": "Additionally, to enhance task-specific representations of the noisy label detector, we harness PEFT for the adaptation of the visual encoder, considering its robustness under massive noisy labels compared with FFT, as per our previous finding (see Figure 1a). This is achieved by maximizing the alignment between image embeddings and their corresponding positive textual features: ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\mathcal{L}_{s i m}=-\\frac{1}{N}\\sum_{i=1}^{N}\\log\\frac{\\exp(\\sin(I_{i},T_{i}^{+})/\\tau)}{\\sum_{k=1}^{K}\\exp(\\sin(I_{i},T_{k}^{+})/\\tau)}\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "Note that $\\mathcal{L}_{s i m}$ is exclusively computed on $\\mathcal{D}^{\\mathrm{clean}}$ after the warm-up stage to further eliminate the impact of label noise on representations. With the objective $\\mathcal{L}=\\mathcal{L}_{d p}\\!+\\!\\mathcal{L}_{s i m}$ , DEFT effectively sieves out noisy samples with learned thresholds while uncovering distinguishable visual representations on downstream tasks. ", "page_idx": 5}, {"type": "text", "text": "4.3 Model Adaptation using Clean Data ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "Although the learned positive textual prompt can be readily employed for classification, its performance may be suboptimal on curated clean datasets, as demonstrated in our previous finding (see Figure 1b). To mitigate this problem, we introduce the model adaptation phase which learns a linear classifier using selected clean samples, i.e., $\\mathcal{D}^{\\mathrm{clean}}$ . Moreover, our findings also indicate that FFT outperforms PEFT on clean datasets, so we remove the PEFT modules and fully fine-tune the pre-trained model parameters for model adaptation. We minimize the classic cross-entropy loss $\\begin{array}{r}{\\ell_{c e}(\\pmb{x},y)\\,=\\,-\\log\\frac{\\bar{\\exp}(z_{y})}{\\sum_{k=1}^{K}\\exp(z_{k})}}\\end{array}$ , where $\\pmb{z}=\\{\\boldsymbol{z}_{k}\\}_{k=1}^{K}$ represents the logits predicted by the linear classifier. It is noteworthy that with the clean subset of training data constructed by Eq. (5), the second phase can be applied universally to a wide range of pre-trained models, regardless of their backbones. The versatility of our approach is demonstrated in the experiments. ", "page_idx": 5}, {"type": "text", "text": "5 Experiment ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "We now proceed to the experiments, demonstrating the advantages of our approach in noisy label detection and image classification on both synthetic and real-world datasets. ", "page_idx": 5}, {"type": "text", "text": "5.1 Experimental Settings ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "Synthetic Datasets We first evaluate the performance of DEFT on four image classification benchmarks by synthesizing noisy labels with varying noise types and ratios. Specifically, we conduct experimental analyses on widely-used CIFAR-100 [23] and Tiny-ImageNet [42], as well as two fine-grained datasets Stanford-Cars [22] and CUB-200-2011 [34]. Given the noise transition matrix $T\\in\\overline{{[0,1]^{K\\times K}}}$ with $T_{i j}$ denoting the probability of the ground-truth $y^{*}=i$ being flipped into a corrupted label $y=j$ , we introduce two types of label noise: 1) $T_{i j}=p(y=j\\mid y^{*}=i)$ , where the corruption probability is assumed to be only dependent on the true label, e.g., the symmetric noise generated by replacing $y^{\\ast}$ with a random label for a given proportion of training samples [10, 25], and 2) $T_{i j}=p(y=j\\mid y^{*}=i,x)$ , which is a more realistic assumption considering the impact of instance $x$ in the label corruption process, e.g., the instance-dependent noise proposed in [45]. We conduct extensive experiments on each dataset with noise ratio $r\\in\\{0.2,0.4,0.6\\}$ for symmetric noise and $r\\in\\{0.2,0.3,0.4\\}$ for instance-dependent noise. ", "page_idx": 5}, {"type": "text", "text": "Real-World Datasets We further examine the performance of DEFT on three real-world noisy label datasets: 1) CIFAR-100N [39] $(r\\approx0.4)$ is a variant of CIFAR-100 with real-world human annotations from Amazon’s Mechanical Turk, 2) Clothing1M [47] $(r\\approx0.4)$ is a large-scale dataset consisting of 1 million clothing images of 14 classes collected from online shopping websites, and ", "page_idx": 5}, {"type": "table", "img_path": "haUnEiXgQ7/tmp/91312289fc3c04e894139606438827a4886e7bf4230b5bf9cf2846e44374afcb.jpg", "table_caption": [], "table_footnote": ["Table 1: On each dataset, we compare the Precision $(\\%)$ and Recall $(\\%)$ of DEFT with CLIP labelmatch and small-loss to evaluate the clean sample selection performance. $\\Delta$ is the difference between the performance of DEFT and small-loss. "], "page_idx": 6}, {"type": "text", "text": "3) WebVision [26] $(r\\approx0.2)$ contains 2.4 million images crawled from Flickr and Google using the 1,000 concepts in ImageNet ILSVRC12. Following previous works [25, 19, 24], we experiment on the first 50 classes of the Google image subset. ", "page_idx": 6}, {"type": "text", "text": "Evaluation Metrics We use precision and recall metrics to evaluate the selection of clean samples. A higher precision indicates a greater proportion of actual clean samples in $\\mathcal{D}^{\\mathrm{clean}}$ , while a higher recall means that more clean samples are identified from the noisy dataset. For image classification, We report the “best” test accuracy across all training iterations and the “last” test accuracy at the end of training. ", "page_idx": 6}, {"type": "text", "text": "Implementation Details We adopt the pre-trained CLIP [29] with the Transformer as the text encoder and the ViT-B/16 as the image encoder. We use the SGD optimizer with a momentum of 0.9, a weight decay of $5\\!\\times\\!10^{-4}$ , and a batch size of 64. We run 10 epochs for both the noisy label detection phase and the model adaptation phase with learning rates $3{\\times}\\Bar{1}0^{-2}$ and $5\\!\\times\\!10^{-4}$ , respectively. In the noisy label detection phase, we employ VPT [18] and CoOp [53] to adapt visual encoder and textual encoder respectively, and perform model warm-up for 1 epoch on all datasets. When identifying noisy labels on real-world datasets, we augment the condition in Eq. (5) with a constraint that the training label should be consistent with its predicted label. This is due to the existence of more complex noise patterns in real-world tasks. All experiments are conducted on a single NVIDIA GeForce RTX 3090. ", "page_idx": 6}, {"type": "text", "text": "5.2 Performance for Noisy Label Detection ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "We conduct a thorough evaluation of DEFT to justify its effectiveness in detecting noisy labels. For this purpose, we simulate various types and ratios of label noise on four benchmark datasets. We compare our approach with two other sample selection strategies: 1) Label-match strategy, where a training sample is deemed clean if its given label matches that assigned by the CLIP zero-shot classifier, and 2) Small-loss strategy, which selects a proportion (noise ratio) of confident samples in each mini-batch, as commonly used in previous studies [10, 25, 19]. The precision and recall of sample selection are reported in Table 1. The results show that our proposed noisy label detector outperforms the compared strategies, with significant improvements observed in all dataset settings. The trivial label-match strategy tends to be conservative, leading to low selection recall of clean samples. In contrast, the small-loss strategy and DEFT achieve a better trade-off between precision and recall, making better use of training samples. Moreover, leveraging the informative multimodel information in the pre-trained vision-language model, DEFT surpasses the small-loss strategy in detecting noisy labels, particularly under severe noise settings and fine-grained classification tasks. For instance, in Tiny-ImageNet with $60\\%$ symmetric noise, DEFT demonstrates significant enhancements of $4.58\\%$ and $4.55\\%$ in precision and recall, respectively, as well as an improvement of $9.78\\%$ and $14.42\\%$ in CUB-200-2011. Additionally, DEFT reduces the need for prior knowledge of noise ratios, making it a practical and effective approach to detect label noise in real-world tasks. ", "page_idx": 6}, {"type": "table", "img_path": "haUnEiXgQ7/tmp/2b02b4170d11a00ea9c4b2f07bbba4e184874c4b754bbbdea45b167bd6f2e1a4.jpg", "table_caption": [], "table_footnote": [], "page_idx": 7}, {"type": "table", "img_path": "haUnEiXgQ7/tmp/f19b8d9a5c4c93f7395f20253cd883ecf2267dfde70e7bdde2ece7bb6436c709.jpg", "table_caption": ["Table 2: Test accuracy $(\\%$ ) on synthetic datasets with symmetric and instance-dependent label noise. ", "Table 3: Test accuracy $(\\%)$ on datasets with real-world label noise. "], "table_footnote": [], "page_idx": 7}, {"type": "text", "text": "", "page_idx": 7}, {"type": "text", "text": "5.3 Performance for Image Classification ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "We evaluate the performance of DEFT in image classification tasks against four baselines, including CE (Cross-Entropy loss), SCE [37], ELR [27], and GMM [25]. To further verify the effectiveness of our method on real-world datasets, we also make comparisons with some recent sample selectionbased works including RoLT[40], UNICON[19], LongReMix[4], and ProMix[46]. We utilize FFT for adapting the pre-trained CLIP model for all approaches. More details can be found in the Appendix. Results on Synthetic Datasets Table 2 presents the results on four synthetic noisy datasets. Compared with CE, the adoption of noise-robust loss functions such as ELR and SCE improves the classification performance on CIFAR-100 and Tiny-ImageNet under certain noisy label settings, e.g., ELR achieves the best performance on CIFAR-100 with $40\\%$ instance-dependent noise. However, these methods are not always effective and may even worsen the performance under varying types and ratios of noise, compared to the sample selection paradigm like GMM and DEFT. While GMM outperforms ELR and SCE in most cases, its performance degrades dreadfully on fine-grained datasets. Nevertheless, DEFT retains the most robust performance and generally advances all compared methods, especially on Stanford-Cars and CUB-200-2011. For example, DEFT boosts the test accuracy ", "page_idx": 7}, {"type": "image", "img_path": "haUnEiXgQ7/tmp/dc608e8044040e80403eb1d3014e515d72b282e3098fbb6adc286b6c7ebef326.jpg", "img_caption": ["Figure 3: Ablation studies. We report the test accuracy across varying noise ratios for the following variants: 1) w/o adap.: DEFT without the model adaptation phase, 2) PEFT: use PEFT for model adaptation phase, and 3) FFT: use FFT for model adaptation phase. "], "img_footnote": [], "page_idx": 8}, {"type": "table", "img_path": "haUnEiXgQ7/tmp/7982564bf674f48d52c264f97ffb9a927bafa4a118d5fa74dd507d2b3695c1ff.jpg", "table_caption": [], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "Table 4: Test accuracy $(\\%)$ using various pre-trained models on Clothing1M. Partial results are sourced from [1]. The best results across all methods are highlighted in bold, with the second-best results indicated by underscores. ", "page_idx": 8}, {"type": "text", "text": "by an average of $4.34\\%$ on Stanford-Cars compared to the best results of comparison methods. The results demonstrate the effectiveness of our proposed approach in tackling both symmetric and instance-dependent label noise. ", "page_idx": 8}, {"type": "text", "text": "Results on Real-world Datasets The results reported in Table 3 demonstrate the superiority of our method on real-world datasets, as DEFT surpasses other methods by a significant margin on all datasets. Notably, while most compared methods show little improvement on Clothing1M due to its fine-grained nature, both ELR and DEFT demonstrate substantial improvement. However, ELR exhibits a performance decrease on WebVision. Moreover, directly fine-tuning pre-trained CLIP models with cross-entropy (CE) achieves competitive results on WebVision, yet DEFT elevates this performance further, showcasing its ability to combat label noise in practical situations. ", "page_idx": 8}, {"type": "text", "text": "5.4 Further Analyses ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "Necessity of Model Adaptation In this experiment, we emphasize the necessity of the model adaptation phase in DEFT. Figure 3 demonstrates the test accuracy of DEFT without the model adaptation phase (w/o adap.), adaptation utilizing PEFT and FFT. Results show that fully fine-tuning the model on selected clean samples yields the best classification performance, especially on finegrained datasets, such as Stanford-Cars and CUB-200-2011. The results unveil two primary insights: 1) the noisy label detector in DEFT exhibits strong capabilities in detecting label noise, yielding a nearly clean subset from noisy downstream datasets, and 2) employing FFT for model adaptation is more effective in mitigating significant domain shifts between downstream data and pre-training data, particularly evident in fine-grained datasets. ", "page_idx": 8}, {"type": "text", "text": "DEFT for Various Pre-trained Models It is noteworthy that DEFT can seamlessly integrate with various pre-trained visual backbones during the model adaptation phase. To demonstrate the versatility of our proposed denoising fine-tuning framework, we conduct experiments on Clothing1M and apply FFT to a range of pre-trained models, including ViT-B/16 [5], ResNet-50 [12], ConvNeXt-T [28], and MAE-VIT-B [11]. The results are presented in Table 4, where GCE [51] employs a noise-robust loss function akin to SCE. As a recent work, TURN [1] is an improved version of GMM, which applies linear probing to initialize the classifier and then uses FFT for adaptation. Compared with previous methods, DEFT exhibits the best performance on average. In particular, DEFT outperforms TURN by $4.51\\%$ and $3.27\\%$ when adopting ResNet-50 and MAE-ViT-B as the target pre-trained models, respectively. ", "page_idx": 8}, {"type": "text", "text": "6 Conclusion ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "In this work, we delve into a new landscape for learning with noisy labels, departing from the classic single-modal toward a multi-modal regime. By learning dual textual prompts, we construct a new noisy label detection approach, which offers several compelling advantages: robust to various types of label noise, generalizable to many pre-trained models, and does not require the dynamics of training samples. We investigate the effectiveness of DEFT on a wide range of synthetic and real-world datasets, showing its superior performance in both noisy label detection and image classification tasks. Lastly, we demonstrate the advantage of parameter-efficient fine-tuning over full fine-tuning over noisy label detection. We hope our work will inspire future research toward multi-modal noisy label detection. ", "page_idx": 9}, {"type": "text", "text": "Acknowledgments and Disclosure of Funding ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "This work was supported by the National Science Foundation of China (62206049, 62225602), the Key Program of Jiangsu Science Foundation (BK20243012), and the Big Data Computing Center of Southeast University. We would like to thank anonymous reviewers for their constructive suggestions. ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "[1] Sumyeong Ahn, Sihyeon Kim, Jongwoo Ko, and Se-Young Yun. Fine tuning pre trained models for robustness under noisy labels. arXiv preprint arXiv:2310.17668, 2023.   \n[2] Devansh Arpit, Stanisaw Jastrzbski, Nicolas Ballas, David Krueger, Emmanuel Bengio, Maxinder S Kanwal, Tegan Maharaj, Asja Fischer, Aaron Courville, Yoshua Bengio, et al. A closer look at memorization in deep networks. In International conference on machine learning, pages 233–242. PMLR, 2017.   \n[3] Shoufa Chen, Chongjian Ge, Zhan Tong, Jiangliu Wang, Yibing Song, Jue Wang, and Ping Luo. Adaptformer: Adapting vision transformers for scalable visual recognition. Advances in Neural Information Processing Systems, 35:16664–16678, 2022.   \n[4] F. R. Cordeiro, Vasileios Belagiannis, Ian Reid, and Gustavo Carneiro. Longremix: Robust learning with high confidence samples in a noisy label environment. Pattern Recognition, 133:109013, 2023.   \n[5] Alexey Dosovitskiy, Lucas Beyer, Alexander Kolesnikov, Dirk Weissenborn, Xiaohua Zhai, Thomas Unterthiner, Mostafa Dehghani, Matthias Minderer, Georg Heigold, Sylvain Gelly, et al. An image is worth 16x16 words: Transformers for image recognition at scale. arXiv preprint arXiv:2010.11929, 2020.   \n[6] Lei Feng, Senlin Shu, Zhuoyi Lin, Fengmao Lv, Li Li, and Bo An. Can cross entropy loss be robust to label noise? In Proceedings of the Twenty-Ninth International Conference on International Joint Conferences on Artificial Intelligence, pages 2206–2212, 2021.   \n[7] Kai Gan and Tong Wei. Erasing the bias: Fine-tuning foundation models for semi-supervised learning. In Proceedings of the 41st International Conference on Machine Learning, pages 14453–14470, 2024.   \n[8] Aritra Ghosh, Himanshu Kumar, and P Shanti Sastry. Robust loss functions under label noise for deep neural networks. In Proceedings of the AAAI conference on artificial intelligence, volume 31, 2017.   \n[9] Bo Han, Quanming Yao, Tongliang Liu, Gang Niu, Ivor W Tsang, James T Kwok, and Masashi Sugiyama. A survey of label-noise representation learning: Past, present and future. arXiv preprint arXiv:2011.04406, 2020.   \n[10] Bo Han, Quanming Yao, Xingrui Yu, Gang Niu, Miao Xu, Weihua Hu, Ivor Tsang, and Masashi Sugiyama. Co-teaching: Robust training of deep neural networks with extremely noisy labels. Advances in neural information processing systems, 31, 2018.   \n[11] Kaiming He, Xinlei Chen, Saining Xie, Yanghao Li, Piotr Dollár, and Ross Girshick. Masked autoencoders are scalable vision learners. In Proceedings of the IEEE/CVF conference on computer vision and pattern recognition, pages 16000–16009, 2022.   \n[12] Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. Deep residual learning for image recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 770–778, 2016.   \n[13] Edward J Hu, Yelong Shen, Phillip Wallis, Zeyuan Allen-Zhu, Yuanzhi Li, Shean Wang, Lu Wang, and Weizhu Chen. Lora: Low-rank adaptation of large language models. arXiv preprint arXiv:2106.09685, 2021.   \n[14] Ping Hu, Ximeng Sun, Stan Sclaroff, and Kate Saenko. Dualcoop $^{++}$ : Fast and effective adaptation to multi-label recognition with limited annotations. arXiv preprint arXiv:2308.01890, 2023.   \n[15] Jinchi Huang, Lie Qu, Rongfei Jia, and Binqiang Zhao. O2u-net: A simple noisy label detection approach for deep neural networks. In Proceedings of the IEEE/CVF international conference on computer vision, pages 3326–3334, 2019.   \n[16] Ahmet Iscen, Jack Valmadre, Anurag Arnab, and Cordelia Schmid. Learning with neighbor consistency for noisy labels. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 4672–4681, 2022.   \n[17] Chao Jia, Yinfei Yang, Ye Xia, Yi-Ting Chen, Zarana Parekh, Hieu Pham, Quoc Le, Yun-Hsuan Sung, Zhen Li, and Tom Duerig. Scaling up visual and vision-language representation learning with noisy text supervision. In International conference on machine learning, pages 4904–4916. PMLR, 2021.   \n[18] Menglin Jia, Luming Tang, Bor-Chun Chen, Claire Cardie, Serge Belongie, Bharath Hariharan, and Ser-Nam Lim. Visual prompt tuning. In European Conference on Computer Vision, pages 709–727, 2022.   \n[19] Nazmul Karim, Mamshad Nayeem Rizve, Nazanin Rahnavard, Ajmal Mian, and Mubarak Shah. Unicon: Combating label noise through uniform selection and contrastive learning. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 9676–9686, 2022.   \n[20] Muhammad Uzair Khattak, Hanoona Rasheed, Muhammad Maaz, Salman Khan, and Fahad Shahbaz Khan. Maple: Multi-modal prompt learning. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 19113–19122, 2023.   \n[21] Youngdong Kim, Junho Yim, Juseung Yun, and Junmo Kim. Nlnl: Negative learning for noisy labels. In Proceedings of the IEEE/CVF international conference on computer vision, pages 101–110, 2019.   \n[22] Jonathan Krause, Jia Deng, Michael Stark, and Li Fei-Fei. Collecting a large-scale dataset of fine-grained cars. Second Workshop on Fine-Grained Visual Categorization, 2013.   \n[23] Alex Krizhevsky, Geoffrey Hinton, et al. Learning multiple layers of feature from tiny images. Master’s Thesis, 2009.   \n[24] Hao-Tian Li, Tong Wei, Hao Yang, Kun Hu, Chong Peng, Li-Bo Sun, Xun-Liang Cai, and Min-Ling Zhang. Stochastic feature averaging for learning with long-tailed noisy labels. In Proceedings of the International Joint Conference on Artificial Intelligence, pages 3902–3910, 2023.   \n[25] Junnan Li, Richard Socher, and Steven C.H. Hoi. Dividemix: Learning with noisy labels as semi-supervised learning. In International Conference on Learning Representations, 2020.   \n[26] Wen Li, Limin Wang, Wei Li, Eirikur Agustsson, and Luc Van Gool. Webvision database: Visual learning and understanding from web data. arXiv preprint arXiv:1708.02862, 2017.   \n[27] Sheng Liu, Jonathan Niles-Weed, Narges Razavian, and Carlos Fernandez-Granda. Early-learning regularization prevents memorization of noisy labels. Advances in Neural Information Processing Systems, 2020.   \n[28] Zhuang Liu, Hanzi Mao, Chao-Yuan Wu, Christoph Feichtenhofer, Trevor Darrell, and Saining Xie. A convnet for the 2020s. In Proceedings of the IEEE/CVF conference on computer vision and pattern recognition, pages 11976–11986, 2022.   \n[29] Alec Radford, Jong Wook Kim, Chris Hallacy, Aditya Ramesh, Gabriel Goh, Sandhini Agarwal, Girish Sastry, Amanda Askell, Pamela Mishkin, Jack Clark, et al. Learning transferable visual models from natural language supervision. In International conference on machine learning, pages 8748–8763, 2021.   \n[30] Jiang-Xin Shi, Tong Wei, Zhi Zhou, Jie-Jing Shao, Xin-Yan Han, and Yu-Feng Li. Long-tail learning with foundation model: Heavy fine-tuning hurts. In Proceedings of the 41st International Conference on Machine Learning, pages 45014–45039, 2024.   \n[31] Yang Shu, Xingzhuo Guo, Jialong Wu, Ximei Wang, Jianmin Wang, and Mingsheng Long. Clipood: Generalizing clip to out-of-distributions. In International Conference on Machine Learning, 2023.   \n[32] Hwanjun Song, Minseok Kim, Dongmin Park, Yooju Shin, and Jae-Gil Lee. Learning from noisy labels with deep neural networks: A survey. IEEE Transactions on Neural Networks and Learning Systems, 2022.   \n[33] Ximeng Sun, Ping Hu, and Kate Saenko. Dualcoop: Fast adaptation to multi-label recognition with limited annotations. Advances in Neural Information Processing Systems, 35:30569–30582, 2022.   \n[34] Catherine Wah, Steve Branson, Peter Welinder, Pietro Perona, and Serge Belongie. The caltech-ucsd birds-200-2011 dataset. Technical report, 2011.   \n[35] Deng-Bao Wang, Yong Wen, Lujia Pan, and Min-Ling Zhang. Learning from noisy labels with complementary loss functions. In Proceedings of the AAAI Conference on Artificial Intelligence, volume 35, pages 10111–10119, 2021.   \n[36] Hualiang Wang, Yi Li, Huifeng Yao, and Xiaomeng Li. Clipn for zero-shot ood detection: Teaching clip to say no. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 1802–1812, 2023.   \n[37] Yisen Wang, Xingjun Ma, Zaiyi Chen, Yuan Luo, Jinfeng Yi, and James Bailey. Symmetric cross entropy for robust learning with noisy labels. In Proceedings of the IEEE/CVF international conference on computer vision, pages 322–330, 2019.   \n[38] Hongxin Wei, Lei Feng, Xiangyu Chen, and Bo An. Combating noisy labels by agreement: A joint training method with co-regularization. In Proceedings of the IEEE/CVF conference on computer vision and pattern recognition, pages 13726–13735, 2020.   \n[39] Jiaheng Wei, Zhaowei Zhu, Hao Cheng, Tongliang Liu, Gang Niu, and Yang Liu. Learning with noisy labels revisited: A study using real-world human annotations. In International Conference on Learning Representations, 2022.   \n[40] Tong Wei, Jiang-Xin Shi, Wei-Wei Tu, and Yu-Feng Li. Robust long-tailed learning under label noise. arXiv preprint arXiv:2108.11569, 2021.   \n[41] Cheng-En Wu, Yu Tian, Haichao Yu, Heng Wang, Pedro Morgado, Yu Hen Hu, and Linjie Yang. Why is prompt tuning for vision-language models robust to noisy labels? In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 15488–15497, 2023.   \n[42] Jiayu Wu, Qixiang Zhang, and Guoxi Xu. Tiny imagenet challenge. Technical report, 2017.   \n[43] Zhi-Fan Wu, Tong Wei, Jianwen Jiang, Chaojie Mao, Mingqian Tang, and Yu-Feng Li. Ngc: A unified framework for learning with open-world noisy data. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 62–71, 2021.   \n[44] Xiaobo Xia, Tongliang Liu, Bo Han, Mingming Gong, Jun Yu, Gang Niu, and Masashi Sugiyama. Sample selection with uncertainty of losses for learning with noisy labels. In International Conference on Learning Representations, 2021.   \n[45] Xiaobo Xia, Tongliang Liu, Bo Han, Nannan Wang, Mingming Gong, Haifeng Liu, Gang Niu, Dacheng Tao, and Masashi Sugiyama. Part-dependent label noise: Towards instance-dependent label noise. Advances in Neural Information Processing Systems, 33:7597–7610, 2020.   \n[46] Ruixuan Xiao, Yiwen Dong, Haobo Wang, Lei Feng, Runze Wu, Gang Chen, and Junbo Zhao. Promix: Combating label noise via maximizing clean sample utility. In Proceedings of the Thirty-Second International Joint Conference on Artificial Intelligence, pages 4442–4450, 2023.   \n[47] Tong Xiao, Tian Xia, Yi Yang, Chang Huang, and Xiaogang Wang. Learning from massive noisy labeled data for image classification. In CVPR, 2015.   \n[48] Bruce XB Yu, Jianlong Chang, Haixin Wang, Lingbo Liu, Shijie Wang, Zhiyu Wang, Junfan Lin, Lingxi Xie, Haojie Li, Zhouchen Lin, et al. Visual tuning. arXiv preprint arXiv:2305.06061, 2023.   \n[49] Jiahui Yu, Zirui Wang, Vijay Vasudevan, Legg Yeung, Mojtaba Seyedhosseini, and Yonghui Wu. Coca: Contrastive captioners are image-text foundation models. arXiv preprint arXiv:2205.01917, 2022.   \n[50] Elad Ben Zaken, Yoav Goldberg, and Shauli Ravfogel. Bitfit: Simple parameter-efficient fine-tuning for transformer-based masked language-models. In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers), pages 1–9, 2022.   \n[51] Zhilu Zhang and Mert Sabuncu. Generalized cross entropy loss for training deep neural networks with noisy labels. Advances in neural information processing systems, 31, 2018.   \n[52] Kaiyang Zhou, Jingkang Yang, Chen Change Loy, and Ziwei Liu. Conditional prompt learning for vision-language models. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 16816–16825, 2022.   \n[53] Kaiyang Zhou, Jingkang Yang, Chen Change Loy, and Ziwei Liu. Learning to prompt for vision-language models. International Journal of Computer Vision, 130(9):2337–2348, 2022. ", "page_idx": 9}, {"type": "text", "text": "", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "A Appendix ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "A.1 Additional Results on Noisy Label Detection ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "Impact of CLIP Backbones Table 1 has demonstrated the superiority of DEFT in detecting noisy labels based on CLIP ViT-B/16. To evaluate the impact of different visual backbones on noise detection, we re-implement all methods using CLIP ViT-B/32 as the backbone and report the results in Table 5. Notably, while the small-loss strategy demonstrates comparable performance on noisy CIFAR-100 and Tiny-ImageNet, its efficacy significantly diminishes on fine-grained datasets such as Stanford-Cars and CUB-200-2011, which exhibits its sensitivity to visual backbones. In contrast, DEFT maintains consistently superior performance on both ViT-B/16 and ViT-B/32, underscoring its resilience across different pre-trained visual backbones. ", "page_idx": 13}, {"type": "text", "text": "Results under Severe Noise We conduct experiments on synthetic noisy datasets with significant label noise to further validate the robustness of the proposed noisy label detector. It is noteworthy that two adjustments are implemented in order to train a more effective model: 1) the learning rate is adjusted from $3{\\times}10^{-2}$ to $1{\\stackrel{\\cdot}{\\times}}10^{-2}$ , and 2) For DEFT, a small weight (specifically, 0.25) is introduced to the positive loss component in Eq. (7) to mitigate the impact of noisy pseudo labels in high levels of noise. Table 6 reports the precision, recall, and their harmonic mean (F1-score) for noise detection, where DEFT exhibits a robust capability in identifying severe noise. For example, a remarkable improvement in the F1-score is achieved on CUB-200-2011. These results strongly reaffirm the superior performance of DEFT across various noise ratios. ", "page_idx": 13}, {"type": "text", "text": "GMM for Noisy Label Detection DivideMix [25] introduces the use of a Gaussian Mixture Model (GMM) for the dynamic separation of clean and noisy samples with an adjustable threshold. Table 7 summarizes the performance of GMM and DEFT in detecting label noise across diverse datasets and noise settings. To fine-tune the pre-trained model for GMM, we independently apply PEFT and FFT. The results reveal that DEFT consistently exhibits superior noise detection capability, particularly evident in fine-grained datasets with high noise ratios, such as Stanford-Cars with $60\\%$ symmetric noise and CUB-200-2011 with $40\\%$ instance-dependent noise. Intriguingly, implementing GMM with PEFT yields better noise detection when compared to utilizing FFT. This difference can be attributed to the potentially unstable training process of FFT, where the loss value may undergo significant fluctuations due to an abundance of tunable parameters. ", "page_idx": 13}, {"type": "table", "img_path": "haUnEiXgQ7/tmp/6c0621acdc4a966d00b57d0508855e64b48215e30f07bb316ed23c5ba7868127.jpg", "table_caption": ["Noisy Label Detection on CIFAR-100N The CIFAR-100N dataset [39], which serves as a realworld benchmark by providing CIFAR-100 with human-annotated noisy labels, allows us to evaluate "], "table_footnote": ["Table 5: Precision and recall of noisy label detection with CLIP ViT-B/32 as the visual backbone. "], "page_idx": 13}, {"type": "table", "img_path": "haUnEiXgQ7/tmp/24b827469e3eaa46b40839b1cac077d46b67fb277abab1785fb6c70954871de7.jpg", "table_caption": [], "table_footnote": ["Table 6: Precision, recall, and F1-score of noisy label detection under $80\\%$ symmetric noise and $50\\%$ instance-dependent noise. "], "page_idx": 14}, {"type": "table", "img_path": "haUnEiXgQ7/tmp/ff21c407ee5eb88d9bac2d7a36472aecd53e3c056f0400b4c6859eba9a33574f.jpg", "table_caption": [], "table_footnote": ["Table 7: F1-score $(\\%)$ of noisy label detection. For GMM, we utilize both PEFT and FFT to adapt the pre-trained model. "], "page_idx": 14}, {"type": "table", "img_path": "haUnEiXgQ7/tmp/afaededadf71381643efc58466ced8f50ea7c01965427e1c5bcdedd15c0de7fc.jpg", "table_caption": [], "table_footnote": [], "page_idx": 14}, {"type": "table", "img_path": "haUnEiXgQ7/tmp/872e9c6c0cc7931d53aa812bb1433d2215569cf8a9b4c81e06b93b119816f5f6.jpg", "table_caption": ["Table 8: Noise detection results on CIFAR-100N. ", "Table 9: Sensitivity analysis of promt length and training epoch. "], "table_footnote": [], "page_idx": 14}, {"type": "text", "text": "the efficacy of DEFT for noise detection in practical scenarios. The results presented in Table 8 reveal the distinctive performance characteristics of various sample selection strategies. For example, the label-match strategy demonstrates a propensity for being greedy and yields the highest precision, whereas the GMM and recent sample selection-based works tends to be conservative and thus achieve a higher recall. Nevertheless, DEFT stands out with the highest F1-score across all strategies, striking a judicious balance between precision and recall in the identification of real-world noisy labels. ", "page_idx": 14}, {"type": "text", "text": "Sensitivity of Hyperparameters We explore the sensitivity of our noise label detector to various hyperparameter settings, specifically the length of the visual/textual prompt and the number of training epochs. Table 9 presents the F1-score on CIFAR-100 with $40\\%$ symmetric noise. The results indicate that the length of the visual prompt has a marginal impact on the noisy label detection. For the textual prompt length, once the context length exceeds 8, the performance is enhanced slightly as the length increases. Additionally, variations in the number of training epochs have minimal impact on performance. In order to strike a balance between effectiveness and efficiency, we set the visual prompt length to 20, the textual prompt length to 16, and the training epoch to 10 in all experiments. ", "page_idx": 14}, {"type": "text", "text": "A.2 Additional Results on Image Classification ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Robustness of Various PEFT techniques To further substantiate the advantages of PEFT over FFT for adapting visual backbones in the presence of massive noisy labels, we conduct a comprehensive evaluation of various PEFT techniques for image classification, including 1) Visual Prompt Tuning (VPT) [18] which prepends learnable prompts to the input at each layer, 2) Low-Rank Adapter (LoRA) [13] which injects trainable rank decomposition matrices into each layer, 3) AdaptFormer [3] which replaces the original Multi-Layer Perceptron (MLP) block with AdaptMLP that incorporates a trainable bottleneck module, and 4) Bias-terms Fine-tuning (BitFit) [50] which is a sparse fine", "page_idx": 14}, {"type": "table", "img_path": "haUnEiXgQ7/tmp/7788d623f2f7674267be1599b4b891b55caec6509a97081328571645f6eb4d63.jpg", "table_caption": [], "table_footnote": [], "page_idx": 15}, {"type": "text", "text": "Table 10: Test accuracy $(\\%)$ on synthetic datasets with symmetric and instance-dependent label noise. For all approaches, we utilize PEFT to adapt the pre-trained CLIP model. The results of DEFT when applying FFT for adaptation are also reported. ", "page_idx": 15}, {"type": "image", "img_path": "haUnEiXgQ7/tmp/35ca11ceb034cf64168cb396fe4f10005a883ed43e7569c2c239fc6dc1fdf9e0.jpg", "img_caption": ["Figure 4: Comparison of different parameter-efficient fine-tuning techniques on Tiny-ImageNet with various ratios of noisy labels "], "img_footnote": [], "page_idx": 15}, {"type": "text", "text": "tuning method where only the bias-terms of the model are being modified. The results are shown in Figure 4. Notably, nearly all PEFT methods outperform FFT when the noise ratio exceeds 0.4, and the performance gap becomes more pronounced with the increase in the noise ratio. These results comprehensively underscore the efficacy of PEFT over FFT in mitigating the distortion of representations when adapting visual backbones under severe noise. ", "page_idx": 15}, {"type": "text", "text": "Applying PEFT for Model Adaptation Table 10 presents the test accuracy obtained by applying PEFT to adapt the pre-trained CLIP model. There are three noteworthy observations in comparison to the results in Table 2. Firstly, previous label-noise learning methods consistently demonstrate their efficacy in handling noisy datasets compared to the vanilla methods (CE), showcasing a clear improvement in performance across various datasets and noise settings. Secondly, despite the bad performance of GMM on fine-grained datasets in Table 2, it achieves the best performance among ", "page_idx": 15}, {"type": "text", "text": "1 Input: training dataset $\\pmb{\\mathcal{D}}=\\{(\\pmb{x}_{i},y_{i})_{i=1}^{N}\\}$ , PEFT parameters $\\omega$ , pre-trained parameters $\\theta$ ,   \nwarm-up epoch $T_{0}$ , PEFT epoch $T_{1}$ and FFT epoch $T_{2}$ .   \n// Phase1: Learning Noisy Label Detector with PEFT   \n2 for $t=1,2,...,T_{0}$ do   \n3 Warm-up the pre-trained model on noisy dataset $\\pmb{\\mathcal{D}}=\\{(\\pmb{x}_{i},y_{i})_{i=1}^{N}\\}$   \n4 end   \n5 for $t=T_{0}+1,...,T_{1}$ do   \n6 Construct the clean subset $\\mathcal{D}^{\\mathrm{clean}}$ by Eq. (4) and Eq. (5)   \n7 Compute the total loss $\\mathcal{L}=\\mathcal{L}_{d p}+\\mathcal{L}_{s i m}$ by Eq. (7) and Eq. (8)   \n8 Update current model parameters $\\omega_{t}=\\mathrm{SGD}(\\mathcal{D}^{\\mathrm{clean}},\\mathcal{L},\\omega_{t-1})$   \n9 end   \n// Phase2: Adapting Model on Clean Data with FFT   \n10 for $t=1,2,...,T_{2}$ do   \n11 Compute the CE loss $\\ell_{c e}$ for samples in the clean subset $\\mathcal{D}^{\\mathrm{clean}}$   \n12 Update current model parameters $\\theta_{t}=\\mathrm{SGD}(\\mathcal{D}^{\\mathrm{clean}},\\ell_{c e},\\theta_{t-1})$   \n13 end ", "page_idx": 16}, {"type": "table", "img_path": "haUnEiXgQ7/tmp/3c05ba7fbc71d929a5f1091acf41381e07cd41190952f7cec9f11c14fc4cc181.jpg", "table_caption": [], "table_footnote": ["Table 11: Configurations of different pre-trained models. "], "page_idx": 16}, {"type": "text", "text": "baselines when utilizing PEFT to adapt the pre-trained model, possibly due to the more stable training process with fewer learnable parameters. Lastly, DEFT continues to outperform all compared methods in almost all cases when applying PEFT during the model adaptation phase (DEFT w/ PEFT), and its performance can be further enhanced by replacing PEFT with FFT (DEFT w/ FFT), confirming the validity of the proposed framework. ", "page_idx": 16}, {"type": "text", "text": "A.3 Additional Implementation Details ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Pseudo-code for the Proposed Framework DEFT is a two-phase framework consisting of a noisy label detection phase and a model adaptation phase. The pseudo-code is presented in Algorithm 1. ", "page_idx": 16}, {"type": "text", "text": "Implementation of the State-of-the-arts Approaches To verify the effectiveness of DEFT on real-world datasets, we compare our methods with several sample selection-based state-of-the-art approaches including RoLT[40], UNICON[19], LongReMix[4], and ProMix[46]. Notably, these methods utilize CNN-like network backbones in their original implementations. To ensure a fair comparison, we implement a two-phase evaluation approach: we first run the source code to obtain the clean subset, then fully fine-tune the pre-trained CLIP model using these selected clean samples. We opt not to directly replace the model backbone because these methods incorporate various training techniques such as co-training, mixup, and contrastive learning. Removing the influence of these techniques is crucial to ensure a valid comparison. ", "page_idx": 16}, {"type": "text", "text": "Hyperparameter Settings for PEFT Modules In the noisy label detection phase, we employ VPT [18] to adapt the visual encoder by default. In all experiments, we consistently set the length of the visual prompt to 20. For LoRA and AdaptFormer, we establish the bottleneck dimension as 8. ", "page_idx": 16}, {"type": "text", "text": "Configurations of Pre-trained Models In the model adaptation phase, we apply FFT to a range of models that are pre-trained on ImageNet-1K. For a fair comparison, we follow the optimizer settings outlined in [1] and initialize each model with the corresponding pre-trained weights obtained from HuggingFace 1. The specific configurations are described in Table 11. ", "page_idx": 16}, {"type": "text", "text": "A.4 Limitations and Broader Impacts ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Limitations Despite DEFT’s superior performance compared to the existing methods, it exhibits certain limitations and there are several unexplored research avenues. For example, the current algorithm only deals with noisy image-label pairs in single-label multi-class classification tasks. A promising avenue for future research would be to generalize DEFT to handle noisy image-text pairs or multi-label classification settings. ", "page_idx": 17}, {"type": "text", "text": "Broader Impacts This study falls within the domain of weakly supervised learning, a learning paradigm that aims to achieve superior performance while reducing labeling costs. Consequently, as this technique gains efficacy and wider adoption, the necessity for extensive data annotation may get diminished, potentially contributing to a rise in unemployment among data annotation professionals. ", "page_idx": 17}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 18}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 18}, {"type": "text", "text": "Justification: We provide a clear overview of the research problem and outline the main contributions in the introduction. ", "page_idx": 18}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? Answer: [Yes] ", "page_idx": 18}, {"type": "text", "text": "Justification: See Section A.4. ", "page_idx": 18}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 18}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 18}, {"type": "text", "text": "Justification: The paper does not include theoretical results. ", "page_idx": 18}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 18}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 18}, {"type": "text", "text": "Justification: The complete details of the implementation can be found in Section 5.1 and Section A.3. ", "page_idx": 18}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 18}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 18}, {"type": "text", "text": "Justification: Our source code can be found via the link in the abstract. ", "page_idx": 18}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 18}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 18}, {"type": "text", "text": "Justification: We specify all the necessary details in Section 5.1. ", "page_idx": 18}, {"type": "text", "text": "7. Experiment Statistical Significance ", "page_idx": 18}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 18}, {"type": "text", "text": "Answer: [No] ", "page_idx": 18}, {"type": "text", "text": "Justification: The paper does not report error bars following previous studies. ", "page_idx": 18}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 18}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 18}, {"type": "text", "text": "Justification: The paper provides the type of compute workers (GPU) in Section 5.1. ", "page_idx": 18}, {"type": "text", "text": "9. Code Of Ethics ", "page_idx": 18}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 19}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 19}, {"type": "text", "text": "Justification: The authors have reviewed the NeurIPS Code of Ethics and the research conforms with them in every respect. ", "page_idx": 19}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 19}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 19}, {"type": "text", "text": "Justification: We analyse the potential societal impacts in Section A.4. ", "page_idx": 19}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 19}, {"type": "text", "text": "Answer: [NA] Justification: The paper poses no such risks. ", "page_idx": 19}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 19}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 19}, {"type": "text", "text": "Justification: The licenses for existing assets are properly respected. ", "page_idx": 19}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 19}, {"type": "text", "text": "Answer: [Yes] Justification: The code introduced in the paper is well documented. ", "page_idx": 19}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 19}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 19}, {"type": "text", "text": "Justification: The paper does not involve crowdsourcing nor research with human subjects. ", "page_idx": 19}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "page_idx": 19}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 19}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 19}, {"type": "text", "text": "Justification: the paper does not involve crowdsourcing nor research with human subjects. ", "page_idx": 19}]