[{"figure_path": "GCmmy4At6i/tables/tables_2_1.jpg", "caption": "Table 1: Mutual information between feature channels for the best and the worst cases in Fig. 1. We find that mutual information (MI) consistently decreases when the performance is improved.", "description": "This table presents the mutual information (MI) between feature channels for the best-performing and worst-performing frequency combinations shown in Figure 1 of the paper.  The MI values are given for both the support and query images in a one-shot few-shot segmentation task.  The table demonstrates that lower MI (reduced inter-channel correlation) is associated with improved segmentation performance, suggesting that feature disentanglement benefits cross-domain few-shot segmentation.", "section": "2 Interpreting Enhanced Performance from Frequency Filtering"}, {"figure_path": "GCmmy4At6i/tables/tables_6_1.jpg", "caption": "Table 2: Mean-IoU of 1-shot and 5-shot results on the CD-FSS benchmark. The best and second-best results are in bold and underlined, respectively. * denotes the model implemented by ourselves. APM-S is an 1 × h × w matrix, while APM-M (more parameters) expands to c × h × w.", "description": "This table presents the mean Intersection over Union (mIoU) scores achieved by various methods on four different cross-domain few-shot segmentation (CD-FSS) benchmark datasets.  The results are shown for both 1-shot and 5-shot scenarios.  The best and second-best performing methods for each dataset and setting are highlighted.  The table also notes that APM-S uses a smaller parameter size than APM-M.", "section": "4.3 Comparison with State-of-the-Art Works"}, {"figure_path": "GCmmy4At6i/tables/tables_7_1.jpg", "caption": "Table 3: Ablation study on various designs", "description": "This table presents the ablation study results on different model variations.  It shows the impact of including the Amplitude-Phase Masker (APM) and the Adaptive Channel Phase Attention (ACPA) modules on the 1-shot and 5-shot segmentation performance.  APM-S and APM-M represent different configurations of the APM module, with APM-M having more parameters. The table demonstrates the incremental performance gains achieved by adding each module.", "section": "4.4 Ablation Study"}, {"figure_path": "GCmmy4At6i/tables/tables_7_2.jpg", "caption": "Table 4: APM-S implemented in the transformer architecture.", "description": "This table compares the performance of the proposed method (APM-S) integrated into a transformer-based architecture (FPTrans) against other methods. It shows that integrating APM-S into FPTrans improves performance on the Deepglobe, ISIC, and Chest X-ray datasets and gives a better average performance compared to FPTrans alone.", "section": "4.4 Ablation Study"}, {"figure_path": "GCmmy4At6i/tables/tables_7_3.jpg", "caption": "Table 5: Compare our method with fine-tuning and spatial domain feature disentangle method.", "description": "This table compares the performance of the proposed method (ours(APM-M)) against three other methods: a baseline method, a fine-tuned baseline, and a baseline with a mutual information loss added. The performance is measured on four datasets (FSS, Deepglobe, ISIC, Chest) and an average across the datasets.  The results show that the proposed method significantly outperforms the other methods, highlighting its effectiveness in improving segmentation accuracy.", "section": "4. Experiments"}, {"figure_path": "GCmmy4At6i/tables/tables_7_4.jpg", "caption": "Table 10: Detailed ablation study results of various designs (Backbone: ResNet-50).", "description": "This table presents a detailed breakdown of the ablation study results for various designs of the proposed model, using ResNet-50 as the backbone. It shows the impact of different components (APM-S, APM-M, ACPA) on the 1-shot and 5-shot mIoU performance across four different datasets (FSS-1000, Deepglobe, ISIC, Chest X-ray).  The table provides a quantitative assessment of each module's contribution to the overall performance improvement.", "section": "A.4 Detailed Ablation Study Results"}, {"figure_path": "GCmmy4At6i/tables/tables_9_1.jpg", "caption": "Table 2: Mean-IoU of 1-shot and 5-shot results on the CD-FSS benchmark. The best and second-best results are in bold and underlined, respectively. * denotes the model implemented by ourselves. APM-S is an 1 × h × w matrix, while APM-M (more parameters) expands to c × h × w.", "description": "This table presents the mean Intersection over Union (mIoU) scores achieved by various methods on four different datasets for both 1-shot and 5-shot semantic segmentation tasks.  The methods are compared on their performance in a cross-domain few-shot semantic segmentation (CD-FSS) setting.  The best and second-best results are highlighted for each dataset and shot setting.  The table also notes which models were implemented by the authors of the paper and details the size of the Amplitude-Phase Masker (APM) used by their method.", "section": "4.3 Comparison with State-of-the-Art Works"}, {"figure_path": "GCmmy4At6i/tables/tables_9_2.jpg", "caption": "Table 2: Mean-IoU of 1-shot and 5-shot results on the CD-FSS benchmark. The best and second-best results are in bold and underlined, respectively. * denotes the model implemented by ourselves. APM-S is an 1 × h × w matrix, while APM-M (more parameters) expands to c × h × w.", "description": "This table presents the mean Intersection over Union (mIoU) scores achieved by various methods on four different datasets for both 1-shot and 5-shot cross-domain few-shot semantic segmentation tasks.  The methods compared include existing state-of-the-art approaches and the proposed method (with two variants: APM-S and APM-M).  The table highlights the superior performance of the proposed method, especially APM-M, which shows significant improvement across all datasets.", "section": "4.3 Comparison with State-of-the-Art Works"}, {"figure_path": "GCmmy4At6i/tables/tables_15_1.jpg", "caption": "Table 2: Mean-IoU of 1-shot and 5-shot results on the CD-FSS benchmark. The best and second-best results are in bold and underlined, respectively. * denotes the model implemented by ourselves. APM-S is an 1 × h × w matrix, while APM-M (more parameters) expands to c × h × w.", "description": "This table presents the mean Intersection over Union (mIoU) scores achieved by various models on four different datasets for both 1-shot and 5-shot semantic segmentation tasks.  It compares the proposed method (with APM-S and APM-M configurations) against several state-of-the-art (SOTA) cross-domain few-shot segmentation (CD-FSS) methods. The results highlight the performance improvement of the proposed method, especially when considering the minimal increase in the number of parameters.", "section": "4.3 Comparison with State-of-the-Art Works"}]