[{"figure_path": "GxvDsFArxY/tables/tables_6_1.jpg", "caption": "Table 1: Comparison of the MLL (↑) with different approaches in eight benchmark datasets. VBPI and VBPI-GNN use pre-generated tree topologies in training and thus are not directly comparable. Boldface for the highest result, underline for the second highest from traditional methods, and underline for the second highest from tree structure generation methods.", "description": "This table compares the performance of various phylogenetic inference methods on eight benchmark datasets, measured by Marginal Log-Likelihood (MLL). It shows the MLL scores for different methods, categorized as MCMC-based, Structure Representation, and Structure Generation.  The best performing method for each dataset is highlighted in bold.  The table also highlights that VBPI and VBPI-GNN are not directly comparable to other methods because they use pre-generated topologies.", "section": "4.2 Performance evaluation across eight benchmark datasets (RQ1)"}, {"figure_path": "GxvDsFArxY/tables/tables_7_1.jpg", "caption": "Table 3: Diversity of tree topologies.", "description": "This table presents three metrics used to evaluate the diversity of tree topologies generated by PhyloGen and two other methods (MrBayes and GeoPhy) on the DS1 dataset.  The metrics are: Simpson's Diversity Index (higher values indicate greater diversity), Top Frequency (lower values indicate better balance among topologies), and Top 95% Frequency (higher values indicate greater diversity in the most frequent topologies). PhyloGen shows the highest diversity index and top 95% frequency and the lowest top frequency, indicating a more balanced and diverse generation of tree topologies.", "section": "4.3 Tree Topological Diversity Analysis (RQ2)"}, {"figure_path": "GxvDsFArxY/tables/tables_7_2.jpg", "caption": "Table 2: Comparison of ELBO (↑) on eight datasets. GeoPhy is not provided in the original paper and is tested by us. Boldface for the highest result, underline for the second highest result.", "description": "This table presents the ELBO scores achieved by different methods across eight datasets.  The ELBO (Evidence Lower Bound) is a metric used in variational inference to evaluate the quality of the approximation to the true posterior distribution. Higher ELBO scores indicate a better approximation and thus better performance of the method.  The table highlights the best-performing method for each dataset, along with the second best score from traditional methods and from tree structure generation methods.", "section": "4.2 Performance evaluation across eight benchmark datasets (RQ1)"}, {"figure_path": "GxvDsFArxY/tables/tables_8_1.jpg", "caption": "Table 5: Ablation Study of PhyloGen.", "description": "This table presents the results of an ablation study conducted on the PhyloGen model. The study evaluates the impact of removing key components of the model on its overall performance.  Specifically, it compares the performance metrics (ELBO and MLL) of the original PhyloGen model against two variants: one without the KL loss and another without the scoring function (S).  The results illustrate the relative contribution of each component to the model's effectiveness.", "section": "4.6 Ablation Study (RQ5)"}, {"figure_path": "GxvDsFArxY/tables/tables_14_1.jpg", "caption": "Table 6: Statistics of the benchmark datasets from DS1 to DS8.", "description": "This table presents the characteristics of eight benchmark datasets (DS1-DS8) used in the PhyloGen experiments. For each dataset, it lists the number of species and the number of sites (presumably representing the length of the biological sequences).  It also provides references to the sources from where these datasets were obtained.  The datasets vary in size, reflecting the diversity of phylogenetic studies.", "section": "C Datasets"}, {"figure_path": "GxvDsFArxY/tables/tables_17_1.jpg", "caption": "Table 1: Comparison of the MLL (↑) with different approaches in eight benchmark datasets. VBPI and VBPI-GNN use pre-generated tree topologies in training and thus are not directly comparable. Boldface for the highest result, underline for the second highest from traditional methods, and underline for the second highest from tree structure generation methods.", "description": "This table compares the Marginal Log-Likelihood (MLL) scores achieved by different phylogenetic inference methods across eight benchmark datasets.  It highlights the performance of PhyloGen (the proposed method) against MCMC-based methods (MrBayes, SBN), structure representation methods (VBPI, VBPI-GNN), and other structure generation methods (ARTree, GeoPhy, PhyloGFN).  The table shows that PhyloGen achieves the highest MLL scores on most datasets, indicating superior accuracy in phylogenetic inference.", "section": "4.2 Performance evaluation across eight benchmark datasets (RQ1)"}, {"figure_path": "GxvDsFArxY/tables/tables_18_1.jpg", "caption": "Table 7: Training Settings of PhyloGen.", "description": "This table presents the hyperparameters and training settings used for the PhyloGen model.  It includes details such as the optimizer used (Adam), the initial learning rate (1e-4), the learning rate scheduling method (Step Learning Rate), weight decay, momentum, minimum learning rate, base learning rate, maximum learning rate, gamma for the scheduler, annealing initialization value, and the total number of annealing steps.", "section": "E.1 Training Details"}, {"figure_path": "GxvDsFArxY/tables/tables_18_2.jpg", "caption": "Table 1: Comparison of the MLL (↑) with different approaches in eight benchmark datasets. VBPI and VBPI-GNN use pre-generated tree topologies in training and thus are not directly comparable. Boldface for the highest result, underline for the second highest from traditional methods, and underline for the second highest from tree structure generation methods.", "description": "This table compares the Marginal Log-Likelihood (MLL) scores achieved by different phylogenetic inference methods across eight benchmark datasets.  It highlights the performance of PhyloGen (the authors' method) against other methods categorized as MCMC-based, structure representation learning, and structure generation methods.  The table emphasizes that PhyloGen's performance is superior.  The use of pre-generated topologies in some methods is also noted, impacting direct comparability.", "section": "4.2 Performance evaluation across eight benchmark datasets (RQ1)"}, {"figure_path": "GxvDsFArxY/tables/tables_19_1.jpg", "caption": "Table 9: Hyperparameter Analysis of PhyloGen Performance in Various Parameter Configurations.", "description": "This table presents the results of a hyperparameter analysis conducted on the PhyloGen model. It shows the impact of different output dimensions, hidden dimensions (with and without layer normalization), on the model's performance as measured by the ELBO and MLL metrics.  The analysis aims to identify the optimal hyperparameter settings for the best performance of the PhyloGen model.", "section": "E.5 Hyper-Parameter Analysis (RQ7)"}]