[{"figure_path": "1Du3mMP5YN/tables/tables_6_1.jpg", "caption": "Table 1: OOD detection results on the CIFAR-10 benchmark with ResNet-18. ↑ indicates larger values are better and vice versa. The best results in the last two columns are shown in bold.", "description": "This table presents the out-of-distribution (OOD) detection performance of various methods on the CIFAR-10 dataset using a ResNet-18 model.  The results are evaluated using two metrics: False Positive Rate at 95% True Positive Rate (FPR95) and Area Under the Receiver Operating Characteristic curve (AUROC). Lower FPR95 values and higher AUROC values indicate better performance.  The table compares the proposed DRL method with several existing state-of-the-art OOD detection methods.", "section": "5.1 Main results on CIFAR benchmarks"}, {"figure_path": "1Du3mMP5YN/tables/tables_7_1.jpg", "caption": "Table 1: OOD detection results on the CIFAR-10 benchmark with ResNet-18. ↑ indicates larger values are better and vice versa. The best results in the last two columns are shown in bold.", "description": "This table presents the results of out-of-distribution (OOD) detection experiments using the CIFAR-10 dataset and a ResNet-18 model.  It compares the performance of the proposed DRL method against various existing OOD detection methods. The metrics used are the False Positive Rate at 95% True Positive Rate (FPR95) and the Area Under the Receiver Operating Characteristic curve (AUROC).  Lower FPR95 values and higher AUROC values indicate better performance. The table highlights the superior performance of DRL compared to other methods across different OOD datasets.", "section": "5.1 Main results on CIFAR benchmarks"}, {"figure_path": "1Du3mMP5YN/tables/tables_7_2.jpg", "caption": "Table 3: Evaluation on hard OOD detection tasks. ↑ indicates larger values are better and vice versa. The best result in each column is shown in bold.", "description": "This table presents the results of hard out-of-distribution (OOD) detection experiments.  Four challenging datasets (LSUN-Fix, ImageNet-Fix, ImageNet-Resize, and CIFAR-10) were used to evaluate the performance of several methods, including the proposed DRL approach. The performance is measured using two metrics: False Positive Rate at 95% true positive rate (FPR95) and Area Under the ROC curve (AUROC).  Lower FPR95 and higher AUROC values are preferred. The table shows that DRL outperforms other methods on average.", "section": "5.2 Extensions"}, {"figure_path": "1Du3mMP5YN/tables/tables_7_3.jpg", "caption": "Table 1: OOD detection results on the CIFAR-10 benchmark with ResNet-18. ↑ indicates larger values are better and vice versa. The best results in the last two columns are shown in bold.", "description": "This table presents the results of out-of-distribution (OOD) detection experiments using the CIFAR-10 dataset and a ResNet-18 model.  It compares various OOD detection methods across multiple metrics (False Positive Rate at 95% true positive rate (FPR95) and Area Under the ROC Curve (AUROC)).  Higher AUROC and lower FPR95 values indicate better performance. The table shows that the proposed DRL method significantly outperforms existing methods.", "section": "5.1 Main results on CIFAR benchmarks"}, {"figure_path": "1Du3mMP5YN/tables/tables_12_1.jpg", "caption": "Table 5: Ablation on stability. OOD detection performance of our method on CIFAR-100. Results are averaged over 5 independent runs.", "description": "This table presents the results of an ablation study on the stability of the proposed method (DRL) for out-of-distribution (OOD) detection on the CIFAR-100 dataset.  Five independent runs were conducted, and the mean and standard deviation of the FPR95 (False Positive Rate at 95% true positive rate) and AUROC (Area Under the Receiver Operating Characteristic curve) are reported for several OOD datasets (SVHN, Places365, LSUN, iSUN, Texture).  This demonstrates the consistent performance of DRL across multiple runs.", "section": "5.3 Ablation study"}]