[{"figure_path": "7rrJQ9iWoX/tables/tables_6_1.jpg", "caption": "Table 1: 3D geometry reconstruction results on ScanNet.", "description": "This table presents a quantitative comparison of different methods for 3D geometry reconstruction on the ScanNet dataset.  The metrics used are: Completeness (Comp), Accuracy (Acc), Recall, Precision (Prec), and F-Score. Lower values for Comp and Acc indicate better performance, while higher values for Recall, Precision, and F-Score are preferred.  The table shows that the proposed 'Ours' method outperforms existing state-of-the-art techniques.", "section": "4 Experiments"}, {"figure_path": "7rrJQ9iWoX/tables/tables_8_1.jpg", "caption": "Table 3: Ablation studies. AlphaInv denotes the alpha inverse loss.", "description": "This table presents the ablation study results, comparing the full model with variations where components like tablet distortion loss, normal loss, depth loss, tablet anti-aliasing, and tablet merge are excluded.  The F-score, VOI, RI, and SC metrics are used to evaluate the performance of each variation, demonstrating the importance of each component in achieving high accuracy in 3D plane reconstruction.", "section": "4 Experiments"}, {"figure_path": "7rrJQ9iWoX/tables/tables_12_1.jpg", "caption": "Table 4: Ablation studies on initial merge.", "description": "This table presents the ablation study results on the impact of different initial merging strategies on the overall performance of the 3D planar reconstruction.  It compares four variations: no in-training merge and no initial merge, no in-training merge only, no initial merge only, and the full method with all merging schemes. The results are evaluated using F-score, Variation of Information (VOI), Rand Index (RI), and Segmentation Covering (SC) metrics. The full method consistently shows superior performance compared to the other variations.", "section": "4.2 Ablation Studies"}, {"figure_path": "7rrJQ9iWoX/tables/tables_13_1.jpg", "caption": "Table 5: Ablation studies on different initialization of SuGaR.", "description": "This table presents the ablation study results comparing different initialization methods for the SuGaR baseline.  It shows a comparison of F-score, Variation of Information (VOI), Rand Index (RI), and Segmentation Covering (SC) metrics. The three methods compared are: SuGaR with COLMAP initialization, SuGaR with Metric3D initialization, and the proposed AlphaTablets method.  The results demonstrate the superior performance of the AlphaTablets method.", "section": "4.2 Ablation Studies"}, {"figure_path": "7rrJQ9iWoX/tables/tables_14_1.jpg", "caption": "Table 1: 3D geometry reconstruction results on ScanNet.", "description": "This table presents a quantitative comparison of the proposed AlphaTablets method against several state-of-the-art approaches for 3D geometry reconstruction on the ScanNet dataset.  Metrics include completeness accuracy, recall, precision, and F-score, providing a comprehensive evaluation of the different methods' performance in reconstructing 3D planar structures from monocular video data.", "section": "4 Experiments"}]