[{"figure_path": "c4ElkpA0kh/tables/tables_6_1.jpg", "caption": "Table 1: Time complexity for computing e-correlated equilibria in n-player normal-form games with A actions per player. The second column suppresses absolute constants and polylogarithmic factors. For simplicity, issues related to bit complexity have been ignored (that is, we work in the RealRAM model of computation).", "description": "This table compares the time complexity of different algorithms for computing e-correlated equilibria in n-player normal-form games.  The algorithms are compared based on their time complexity, considering the number of actions (A), players (n), and the precision parameter (e). The table highlights the improvement achieved by the authors' proposed algorithm (Theorem C.7) compared to previous state-of-the-art methods.  Note that the time complexity is expressed using Big O notation, and some factors like absolute constants and polylogarithmic factors are suppressed for brevity. The computations are also assumed to happen in the RealRAM model.", "section": "4.1 Circumventing fixed points"}, {"figure_path": "c4ElkpA0kh/tables/tables_30_1.jpg", "caption": "Table 1: Time complexity for computing e-correlated equilibria in n-player normal-form games with A actions per player. The second column suppresses absolute constants and polylogarithmic factors. For simplicity, issues related to bit complexity have been ignored (that is, we work in the RealRAM model of computation).", "description": "This table compares the time complexity of different algorithms for computing e-correlated equilibria in n-player normal-form games.  It contrasts the time complexity of the proposed algorithm (Theorem C.7) with existing algorithms from the literature, highlighting the improvements in runtime achieved, particularly in the moderate-precision regime.  The complexities are expressed in terms of the number of players (n), the number of actions (A), and the precision parameter (e).  The table also notes that polylogarithmic factors and absolute constants are omitted for simplicity in the time complexity representation.", "section": "4.1 Circumventing fixed points"}]