[{"figure_path": "ZX6CEo1Wtv/figures/figures_1_1.jpg", "caption": "Figure 1: Latent Diffusion for Neural Spiking data. LDNS allows for (un)conditional generation of neural spiking data through combining a regularized autoencoder with diffusion models that act on the low-dimensional latent time series underlying neural population activity.", "description": "This figure illustrates the architecture of Latent Diffusion for Neural Spiking data (LDNS).  LDNS uses a two-stage process. First, a regularized autoencoder processes neural spiking data to generate low-dimensional continuous latent representations. These latents capture the essential structure of the neural activity. Second, a diffusion model operates on these latent representations to generate new, realistic samples of neural activity.  The process is flexible and allows for both unconditional and conditional generation, based on external behavioral covariates (represented by y). The figure includes blocks for the encoder, decoder, diffusion model, and noise. The output is then stochastically converted into spike trains, which can be further evaluated.", "section": "2 Methods"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_4_1.jpg", "caption": "Figure 2: Realistic generation of spiking data with underlying chaotic dynamics. a) Synthetic spiking data from an underlying Lorenz system with a Poisson observation model. b) Accurate, smooth rate predictions of the autoencoder for held-out spiking data. c) Plotted trace of sampled latents (256 bins training length, left) and 16× the original training length (middle). The sampled latent distribution matches the PSD of the autoencoder latents (right; median, 10%, and 90% percentiles). d) LDNS population spike count histogram (kde: kernel density estimate) and pairwise cross-correlations match the training distribution. e) LDNS single neuron statistics, i.e., mean inter-spike interval (isi) and std isi, match the training distribution.", "description": "This figure demonstrates the performance of LDNS on synthetic data generated from a chaotic Lorenz system. It shows that LDNS accurately recovers latent structure, firing rates, and spiking statistics at both the population and single-neuron levels, even when generating data of significantly longer duration than seen during training.", "section": "3 Experiments and Results"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_5_1.jpg", "caption": "Figure 3: Unconditional generation of variable-length trials of human spiking data during attempted speech. a) Multi-unit activity is recorded from speech production-related regions of the brain (top) during attempted vocalization of variable-length sentences (bottom). b) Neural activity during sentences of different lengths. c) LDNS unconditionally sampled trials with different lengths, using the Poisson observation model. d) LDNS population spike count histogram, and mean and std of the isi match those of the data. e) Correlation matrices of the data (left) and LDNS samples (middle), and scatterplot of the pairwise correlations of data vs. LDNS samples (right).", "description": "This figure demonstrates the unconditional generation of variable-length neural spiking data using LDNS.  Panel (a) shows the experimental setup where neural activity was recorded during attempted speech, highlighting the variable length of sentences. Panel (b) displays example neural recordings of varying lengths. Panel (c) presents the variable-length samples generated by LDNS, using the Poisson observation model. Panels (d) and (e) provide quantitative comparisons between the generated data and the real data, focusing on population-level statistics (spike counts, inter-spike intervals), and pairwise correlations between neurons. The results indicate that LDNS successfully captures the statistical properties of the original dataset, demonstrating its ability to generate realistic and variable-length neural activity.", "section": "3.3 Modeling variable-length trials of neural activity recorded in human cortex"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_6_1.jpg", "caption": "Figure 4: Realistic generation of spiking data in a monkey performing reach tasks. a) A monkey performs diverse reach movements in different mazes. b) Neural activity during a reach trial and a sampled trial from LDNS with a Poisson observation model. c) The LDNS population spike count histogram, and pairwise correlations match those of the data. d) LDNS mean- and std isi match the monkey data distribution. e) Auto-correlation of data, LDNS samples with Poisson observations (left), and LDNS samples with spike history, grouped according to correlation strength.", "description": "This figure demonstrates the ability of the LDNS model to generate realistic spiking data for a monkey performing reach tasks in different mazes.  Panel (a) shows a schematic of the experimental setup. Panel (b) compares real neural activity with data generated by LDNS, demonstrating high similarity. Panel (c) shows that LDNS accurately captures population-level statistics such as spike count distributions and pairwise correlations. Panel (d) shows that LDNS also reproduces single-neuron statistics such as the mean and standard deviation of inter-spike intervals.  Finally, panel (e) compares the temporal autocorrelation structure of real and generated data, highlighting that incorporating spike history into the model improves the accuracy of the generated data.", "section": "3.4 Realistic generation of spiking data from a monkey performing reach tasks"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_7_1.jpg", "caption": "Figure 5: Generation conditioned on monkey reach directions and velocity traces. a) Closed loop assessment: do conditionally generated latents translate to neural activity consistent with the desired direction or reach movement? b) Unseen reach movements (data) and corresponding movements decoded from the rates predicted by the autoencoder (ae). c) Decoded reach directions of LDNS samples conditioned on initial reach angles 0. d) Decoded reach directions of LDNS samples conditioned on 3 unseen reach movements (velocities vx, vy). e) Straight reaches from the test set used for velocity conditioning. f) LDNS sampled latents conditioned on trajectories shown in e) vary smoothly over time and reflect information about reach angles. g) PCs of sampled LDNS latents shown in f) reveal meaningful and separable information about behavior.", "description": "This figure demonstrates the conditional generation capabilities of LDNS.  Panel (a) outlines the closed-loop experimental design.  Panels (b-d) show that LDNS can generate realistic neural activity when conditioned on either reach direction (b,c) or full reach trajectories (d).  Panels (e-g) show how LDNS captures the underlying behavioral information within its latent representation; latent trajectories vary smoothly over time and reflect reach direction and velocity.", "section": "3.5 Conditional generation of neural activity given reach directions or velocity profiles"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_15_1.jpg", "caption": "Figure 1: Latent Diffusion for Neural Spiking data. LDNS allows for (un)conditional generation of neural spiking data through combining a regularized autoencoder with diffusion models that act on the low-dimensional latent time series underlying neural population activity.", "description": "The figure illustrates the architecture of Latent Diffusion for Neural Spiking data (LDNS).  LDNS is a two-stage model. The first stage uses a regularized autoencoder with structured state-space (S4) layers to encode high-dimensional, discrete neural spiking data into a low-dimensional, continuous latent space representation.  The second stage utilizes a diffusion model, trained on these latent representations, to generate new neural spiking data.  This generation process can be conditioned on behavioral covariates to produce behaviorally relevant neural activity. The figure shows the flow of data through the encoder, latent space, diffusion model, and decoder, highlighting the key components and their interactions.", "section": "2 Methods"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_20_1.jpg", "caption": "Figure 2: Realistic generation of spiking data with underlying chaotic dynamics. a) Synthetic spiking data from an underlying Lorenz system with a Poisson observation model. b) Accurate, smooth rate predictions of the autoencoder for held-out spiking data. c) Plotted trace of sampled latents (256 bins training length, left) and 16× the original training length (middle). The sampled latent distribution matches the PSD of the autoencoder latents (right; median, 10%, and 90% percentiles). d) LDNS population spike count histogram (kde: kernel density estimate) and pairwise cross-correlations match the training distribution. e) LDNS single neuron statistics, i.e., mean inter-spike interval (isi) and std isi, match the training distribution.", "description": "This figure demonstrates the performance of LDNS on a synthetic dataset generated from a chaotic Lorenz system. It showcases the model's ability to accurately generate spiking data that matches the statistical properties of the original data at both population and single-neuron levels.  The autoencoder accurately predicts firing rates, and the diffusion model generates samples with realistic firing statistics and latent dynamics.", "section": "3 Experiments and Results"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_20_2.jpg", "caption": "Figure A3: The S4 autoencoder infers smooth latents from discrete spikes and samples from the diffusion model capture the latent distribution. a) Inferred autoencoder latents for a test sample. b) Power spectral density for all eight latent dimensions for the inferred autoencoder training set and samples from the diffusion model", "description": "This figure demonstrates the ability of the S4 autoencoder to extract smooth, low-dimensional latent representations from high-dimensional discrete neural spiking data.  Panel (a) shows inferred latents for a single test sample, highlighting the smoothness achieved by the autoencoder. Panel (b) compares the power spectral density (PSD) of the autoencoder's inferred latents (during training) with the PSD of latents sampled from the trained diffusion model.  The close match indicates that the diffusion model successfully captures the distribution of the inferred latent space.", "section": "A6 Supplementary Figures Lorenz"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_21_1.jpg", "caption": "Figure A4: LDNS captures the correlation structure of the Lorenz dataset a) Both the autoencoder and LDNS-sampled rates capture the ground truth instantaneous correlation structure of the synthetic rates. b) The auto-correlation structure of ground truth and sampled spiking activity matches perfectly in 4 neuron groups, sorted according to correlation strength. Synthetic Lorenz data group x is denoted by gt x, LDNS samples as ldns x. c) The time-lagged cross-correlational structure is also perfectly captured by LDNS in all groups.", "description": "This figure demonstrates that LDNS accurately recovers the correlation structure of the synthetic data generated from the Lorenz system.  Panel (a) shows that both the autoencoder and LDNS-generated samples accurately reflect the instantaneous correlations between neurons. Panel (b) compares the autocorrelations (correlations of a neuron with itself over time) of the ground truth data and LDNS samples, demonstrating a near-perfect match. Similarly, panel (c) shows that the cross-correlations (correlations between different neurons) are also accurately reproduced by LDNS.", "section": "A6 Supplementary Figures Lorenz"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_22_1.jpg", "caption": "Figure 2: Realistic generation of spiking data with underlying chaotic dynamics. a) Synthetic spiking data from an underlying Lorenz system with a Poisson observation model. b) Accurate, smooth rate predictions of the autoencoder for held-out spiking data. c) Plotted trace of sampled latents (256 bins training length, left) and 16× the original training length (middle). The sampled latent distribution matches the PSD of the autoencoder latents (right; median, 10%, and 90% percentiles). d) LDNS population spike count histogram (kde: kernel density estimate) and pairwise cross-correlations match the training distribution. e) LDNS single neuron statistics, i.e., mean inter-spike interval (isi) and std isi, match the training distribution.", "description": "This figure demonstrates the ability of Latent Diffusion for Neural Spiking data (LDNS) to generate realistic spiking data from an underlying chaotic Lorenz system. It shows that LDNS accurately recovers the latent structure, firing rates, and spiking statistics of the synthetic data, even when generating variable-length data.  The autoencoder accurately predicts firing rates, and the diffusion model samples latents that match the power spectral density of the autoencoder latents. Population-level and single-neuron spiking statistics from LDNS also closely match the training data. This showcases the model's ability to generate realistic spiking data with complex dynamics.", "section": "3.2 LDNS captures the true spiking data distribution with an underlying Lorenz system"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_22_2.jpg", "caption": "Figure A6: Population-level and single neuron-level statistics of a) LDNS, b) LDNSsh (with spike history), c) LFADS, d) LFADSsh (with spike history), e) TNDM, and f) pi-VAE.", "description": "The figure compares population-level and single-neuron-level statistics of different models: LDNS (with and without spike history), LFADS (with and without spike history), TNDM, and pi-VAE.  For each model, it shows kernel density estimations of population spike counts, mean inter-spike intervals (ISIs), and standard deviations of ISIs, along with scatter plots comparing the model's predictions to the ground truth data. This visualizes how well each model captures the distribution and characteristics of the neural spiking data.", "section": "A5 Supplementary baseline comparisons"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_23_1.jpg", "caption": "Figure A7: Visual comparison of different sampled spiking data from LDNS, with five samples from the true dataset.", "description": "This figure compares five example trials of real neural spiking data with five corresponding samples generated by the LDNS model.  The figure visually demonstrates the model's ability to generate realistic-looking spiking activity that resembles the characteristics of the real data. Each row shows a single trial, both the original and the LDNS-generated version, allowing for a direct visual comparison of the spike patterns.", "section": "A7 Supplementary Figures Human BCI"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_23_2.jpg", "caption": "Figure A17: Comparison of LDNS latent space trajectories of inferred and conditionally sampled latents a) Straight reaches from the Monkey reach test set. b) LDNS sampled latents (velocity-conditioned on reaches shown in a). c) PCs of LDNS sampled latents. d) Autoencoder-inferred latents of corresponding neural activity for the reaches shown in a). e) PCs of autoencoder-inferred latents.", "description": "This figure compares the latent space trajectories obtained from LDNS model with those obtained from the autoencoder. It shows both unconditionally inferred latents and those sampled conditionally on velocity. The figure also includes principal components analysis (PCA) of the latents to visualize the latent space structure.", "section": "A7 Supplementary Figures Human BCI"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_24_1.jpg", "caption": "Figure A9: Correlation matrices for real spiking data from human and LDNS, comparing the autoencoder-inferred (ae) correlation (sampled from reconstructed rates) and correlation of sampled spikes (diff). The deviations from the data (gt) already arise at the autoencoder stage.", "description": "This figure compares correlation matrices from real human neural spiking data and those generated by the LDNS model.  It shows three correlation matrices: one from the ground truth data (gt), one from the autoencoder's reconstruction of the data (ae), and one from the LDNS model's samples (diff).  A scatter plot visualizes the pairwise correlations between the ground truth and LDNS model correlation matrices, highlighting that discrepancies between the model and the actual data primarily originate in the autoencoder's latent space representation.", "section": "A9 Supplementary Figures Human BCI"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_25_1.jpg", "caption": "Figure A9: Correlation matrices for real spiking data from human and LDNS, comparing the autoencoder-inferred (ae) correlation (sampled from reconstructed rates) and correlation of sampled spikes (diff). The deviations from the data (gt) already arise at the autoencoder stage.", "description": "This figure compares correlation matrices from real human neural spiking data and those generated by the LDNS model.  It shows the correlation matrices for the ground truth data, the autoencoder's predictions (before the diffusion model), and the final LDNS samples.  The comparison highlights that deviations between the real data and the model's output start at the autoencoder stage, meaning that the reconstruction of the spiking data into a low-dimensional latent space already introduces some discrepancy.", "section": "A9 Supplementary Figures Human BCI"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_25_2.jpg", "caption": "Figure A7: Visual comparison of different sampled spiking data from LDNS, with five samples from the true dataset.", "description": "This figure visually compares spiking data generated by the LDNS model with real spiking data from the dataset. It shows five example trials, each with the real data on the left and the corresponding LDNS-generated samples on the right. This comparison helps to assess the quality and realism of the model's output, showing how well the generated data matches the patterns and characteristics found in the real data.", "section": "A7 Supplementary Figures Human BCI"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_25_3.jpg", "caption": "Figure 4: Realistic generation of spiking data in a monkey performing reach tasks. a) A monkey performs diverse reach movements in different mazes. b) Neural activity during a reach trial and a sampled trial from LDNS with a Poisson observation model. c) The LDNS population spike count histogram, and pairwise correlations match those of the data. d) LDNS mean- and std isi match the monkey data distribution. e) Auto-correlation of data, LDNS samples with Poisson observations (left), and LDNS samples with spike history, grouped according to correlation strength.", "description": "This figure demonstrates the ability of LDNS to generate realistic neural spiking data for a monkey performing reach tasks in different mazes. It shows that LDNS accurately captures various aspects of the data, including population spike counts, pairwise correlations, and single-neuron inter-spike interval statistics, both with and without incorporating single-neuron dynamics using spike history.", "section": "3.4 Realistic generation of spiking data from a monkey performing reach tasks"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_26_1.jpg", "caption": "Figure 2: Realistic generation of spiking data with underlying chaotic dynamics. a) Synthetic spiking data from an underlying Lorenz system with a Poisson observation model. b) Accurate, smooth rate predictions of the autoencoder for held-out spiking data. c) Plotted trace of sampled latents (256 bins training length, left) and 16× the original training length (middle). The sampled latent distribution matches the PSD of the autoencoder latents (right; median, 10%, and 90% percentiles). d) LDNS population spike count histogram (kde: kernel density estimate) and pairwise cross-correlations match the training distribution. e) LDNS single neuron statistics, i.e., mean inter-spike interval (isi) and std isi, match the training distribution.", "description": "This figure demonstrates the ability of LDNS to generate realistic synthetic spiking data with underlying chaotic dynamics. It shows that LDNS accurately recovers latent structure, firing rates, and spiking statistics from synthetic data generated by a Lorenz system.  The figure compares the generated data to the original data across several metrics, showing a good match for both population-level and single-neuron properties.", "section": "3 Experiments and Results"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_26_2.jpg", "caption": "Figure A14: Visual comparison of sampled spiking data from LDNS and all baselines with real data.", "description": "This figure provides a visual comparison of spiking data generated by LDNS and several baseline methods (LFADS, LFADS with spike history, TNDM, and pi-VAE) against real neural spiking data.  It shows raster plots for each method and the real data, allowing for a direct visual comparison of the spike patterns generated. This allows for a qualitative assessment of the various methods' ability to replicate the temporal structure and characteristics of real neural data.", "section": "A5 Supplementary baseline comparisons"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_26_3.jpg", "caption": "Figure A15: Comparing principal components of smoothed sampled spikes a) First two principal components (PCs) of smoothed spikes from model samples. Each line represents one sampled trial. Spikes were smoothed using a Gaussian filter with a window of 40ms prior to extracting the PCs. The PCs were fit using real data. Since pi-VAE does not account for temporal dynamics, it does not show any temporal structure in the PCs. b) Power spectral density (PSD) of PC1, plotted for model vs. data (in grey). c) Mean squared error of median PSD between model samples and data for PC1 (left) and PC2 (right). LDNS and LDNSsh perform the best here, with pi-VAE showing large errors.", "description": "This figure compares the performance of LDNS and other models in capturing the temporal dynamics of neural data. Panel (a) shows the first two principal components of smoothed spike data from different models and real data. Panel (b) displays the power spectral density for the first principal component, highlighting differences in frequency representation among models. Panel (c) quantifies these differences using the mean squared error of the median power spectral density.  The results show that LDNS and LDNSsh (with spike history) accurately capture the temporal dynamics of the data better than alternative models.", "section": "A6 Supplementary Figures Monkey Reach task"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_27_1.jpg", "caption": "Figure 2: Realistic generation of spiking data with underlying chaotic dynamics. a) Synthetic spiking data from an underlying Lorenz system with a Poisson observation model. b) Accurate, smooth rate predictions of the autoencoder for held-out spiking data. c) Plotted trace of sampled latents (256 bins training length, left) and 16× the original training length (middle). The sampled latent distribution matches the PSD of the autoencoder latents (right; median, 10%, and 90% percentiles). d) LDNS population spike count histogram (kde: kernel density estimate) and pairwise cross-correlations match the training distribution. e) LDNS single neuron statistics, i.e., mean inter-spike interval (isi) and std isi, match the training distribution.", "description": "This figure demonstrates the ability of LDNS to generate realistic spiking data from a synthetic dataset based on the Lorenz attractor. It shows that LDNS accurately recovers latent structure, firing rates, and spiking statistics at both the population and single-neuron levels, even when generating data that is much longer than the training data.", "section": "3 Experiments and Results"}, {"figure_path": "ZX6CEo1Wtv/figures/figures_28_1.jpg", "caption": "Figure 5: Generation conditioned on monkey reach directions and velocity traces. a) Closed loop assessment: do conditionally generated latents translate to neural activity consistent with the desired direction or reach movement? b) Unseen reach movements (data) and corresponding movements decoded from the rates predicted by the autoencoder (ae). c) Decoded reach directions of LDNS samples conditioned on initial reach angles 0. d) Decoded reach directions of LDNS samples conditioned on 3 unseen reach movements (velocities vx, vy). e) Straight reaches from the test set used for velocity conditioning. f) LDNS sampled latents conditioned on trajectories shown in e) vary smoothly over time and reflect information about reach angles. g) PCs of sampled LDNS latents shown in f) reveal meaningful and separable information about behavior.", "description": "This figure demonstrates the conditional generation capabilities of LDNS.  Panel (a) shows the experimental setup for closed-loop assessment.  Panels (b-d) show that LDNS can generate realistic neural activity when conditioned on reach direction or velocity. Panels (e-g) illustrate that the latent space learned by LDNS captures relevant information about reach kinematics. The smooth temporal variation of latents conditional on various trajectories and their clear clustering according to reach directions show the capability of LDNS in inferring meaningful representations of behavior.", "section": "3.5 Conditional generation of neural activity given reach directions or velocity profiles"}]