[{"figure_path": "zeNwOAcb4q/tables/tables_4_1.jpg", "caption": "Table 1: Test accuracy with instance-dependent noise on CIFAR-10/100.", "description": "This table presents the test accuracy results of different methods on CIFAR-10 and CIFAR-100 datasets with varying instance-dependent noise levels (IDN).  The methods are compared across five different noise rates (10%, 20%, 30%, 40%, 50%), showcasing their robustness to label noise.  The table allows for a comparison of the proposed DTM method against various existing baseline and state-of-the-art techniques for handling noisy labels.", "section": "4 Experiments"}, {"figure_path": "zeNwOAcb4q/tables/tables_4_2.jpg", "caption": "Table 1: Test accuracy with instance-dependent noise on CIFAR-10/100.", "description": "This table presents the test accuracy results of different methods on CIFAR-10 and CIFAR-100 datasets with varying levels of instance-dependent noise (IDN).  The noise levels range from 10% to 50%.  The table compares the performance of the proposed DTM method with several baseline and state-of-the-art methods, including CE (Cross-Entropy loss), VolMinNet, PeerLoss, BLTM, PartT, MEIDTM, SOP, CC, and LRA. The results show the effectiveness of the proposed method in handling instance-dependent label noise.", "section": "4 Experiments"}, {"figure_path": "zeNwOAcb4q/tables/tables_6_1.jpg", "caption": "Table 1: Test accuracy with instance-dependent noise on CIFAR-10/100.", "description": "This table presents the test accuracy results for different methods on CIFAR-10 and CIFAR-100 datasets with varying levels of instance-dependent noise (IDN).  The results are shown for IDN rates of 10%, 20%, 30%, 40%, and 50%.  The methods compared include several baseline methods (CE, VolMinNet, PeerLoss, BLTM, PartT, MEIDTM, SOP) and state-of-the-art methods (CC, LRA). The table showcases the performance of the proposed DTM method against these existing methods under different noise conditions.", "section": "4 Experiments"}, {"figure_path": "zeNwOAcb4q/tables/tables_7_1.jpg", "caption": "Table 2: Test accuracy on CIFAR-10N and CIFAR-100N.", "description": "This table presents the test accuracy results of different methods on CIFAR-10N and CIFAR-100N datasets with instance-dependent label noise.  CIFAR-10N includes several noise types (Random 1, Random 2, Random 3, Worst, Aggregate), while CIFAR-100N has a single 'Noisy' set.  The table shows how each method performs on each noise type, allowing for comparison of different approaches' robustness to varying degrees and types of label noise.  The results indicate the performance of various noise-robust training methods, and the proposed DTM method shows superior results, demonstrating its effectiveness in handling instance-dependent noise.", "section": "4.4 Experimental Results on Synthetic Datasets"}, {"figure_path": "zeNwOAcb4q/tables/tables_7_2.jpg", "caption": "Table 3: Test accuracy on Clothing1M, Webvision and ILSVRC12.", "description": "This table presents the test accuracy results of different methods on three real-world datasets: Clothing1M, Webvision, and ILSVRC12.  The methods compared include several state-of-the-art approaches for handling noisy labels in image classification.  The table allows for a comparison of the performance of these methods across diverse and challenging real-world datasets.", "section": "4.5 Experimental Results on Real-World Datasets"}, {"figure_path": "zeNwOAcb4q/tables/tables_8_1.jpg", "caption": "Table 4: Ablation study of DTR. The data in the table represents the test accuracy.", "description": "This ablation study analyzes the impact of removing key components (pre-trained encoder, clustering, and diffusion model) from the proposed DTR method. The test accuracy on CIFAR-10 and CIFAR-100 datasets under 20% and 40% instance-dependent noise are presented for each configuration.", "section": "4.6 Ablation Study"}]