[{"figure_path": "3f8i9GlBzu/figures/figures_1_1.jpg", "caption": "Figure 1: Evaluating representational alignment between human and pre-trained transformers.", "description": "Human participants evaluate the perceptual similarity between two odorant substances.  The same pair of odorants is encoded using MoLFormer, and the similarity between their representations is calculated. Finally, the alignment between human perceptual similarity and the MoLFormer-based similarity is measured.", "section": "1 Introduction"}, {"figure_path": "3f8i9GlBzu/figures/figures_4_1.jpg", "caption": "Figure 2: ROC curve for linear classifiers trained on GS-LF representations extracted from three different models. Each curve corresponds to a separate test split, with the thicker curve representing the average performance across all splits. We highlight that MoLFormer outperforms DAM, despite not being trained to predict perceptual labels but does not achieve the performance level of Open-POM, which demonstrates the highest performance. The chance level is shown with red dashed line.", "description": "This figure shows the ROC curves for three different models (MoLFormer, Open-POM, and DAM) trained on the GS-LF dataset to predict expert-assigned odor labels.  Each thin line represents a single train-test split, while the thicker line represents the average performance across all splits.  The results demonstrate that MoLFormer outperforms DAM, even though it wasn't explicitly trained for this task. However, Open-POM achieves the best performance, which is expected because it was trained for this specific task.", "section": "4.1 Expert-assigned labels classification"}, {"figure_path": "3f8i9GlBzu/figures/figures_5_1.jpg", "caption": "Figure 3: Visualization of odorant representations encoded by different models on the GS-LF dataset using the figure layout suggested by [16]. We plot the first and second principal components (PCs) of the representation spaces. Areas dense with molecules that have broad category labels (floral, meaty, or ethereal) are shaded, while areas dense with narrow category labels are outlined. MoLFormer captures the perceptual relationship between different odorants in its representation space, despite not being explicitly trained for this purpose.", "description": "This figure visualizes the odorant representations generated by MoLFormer and Open-POM models on the GS-LF dataset. It uses the first two principal components to represent the data, showing clusters of molecules with similar broad or narrow perceptual labels. The visualization highlights MoLFormer's ability to capture the perceptual relationships between odorants, even without explicit training for this task.", "section": "4.1 Expert-assigned labels classification"}, {"figure_path": "3f8i9GlBzu/figures/figures_6_1.jpg", "caption": "Figure 3: Visualization of odorant representations encoded by different models on the GS-LF dataset using the figure layout suggested by [16]. We plot the first and second principal components (PCs) of the representation spaces. Areas dense with molecules that have broad category labels (floral, meaty, or ethereal) are shaded, while areas dense with narrow category labels are outlined. MoLFormer captures the perceptual relationship between different odorants in its representation space, despite not being explicitly trained for this purpose.", "description": "This figure visualizes how different models represent odorants in a two-dimensional space.  The layout is inspired by a previous study.  The plot shows the first two principal components of the odorant representations generated by MoLFormer, Open-POM, and DAM.  The visualization highlights how MoLFormer, even without explicit training on perceptual data, manages to capture the relationships between different odorant categories.", "section": "4.1 Expert-assigned labels classification"}, {"figure_path": "3f8i9GlBzu/figures/figures_7_1.jpg", "caption": "Figure 5: Representational similarity analysis for Snitz and Ravia datasets: a) Correlation coefficients between similarity scores provided by human participants and computed using representations encoded by the different models ; b) Correlation coefficients considering odorant representations extracted from different layers of the MoLFormer model.", "description": "This figure presents a representational similarity analysis (RSA) to evaluate the alignment between human perception and the model's representations.  Panel (a) compares the correlation coefficients between human perceptual similarity ratings and similarity scores computed from the odorant representations extracted from three models: MoLFormer, Open-POM, and DAM, using two different datasets (Snitz 2013 and Ravia 2020). Panel (b) shows how the correlation between human perceptual similarity and MoLFormer's representation changes across different layers of the MoLFormer model, for each of the two datasets.", "section": "4.3 Representational similarity analysis"}, {"figure_path": "3f8i9GlBzu/figures/figures_8_1.jpg", "caption": "Figure 3: Visualization of odorant representations encoded by different models on the GS-LF dataset using the figure layout suggested by [16]. We plot the first and second principal components (PCs) of the representation spaces. Areas dense with molecules that have broad category labels (floral, meaty, or ethereal) are shaded, while areas dense with narrow category labels are outlined. MoLFormer captures the perceptual relationship between different odorants in its representation space, despite not being explicitly trained for this purpose.", "description": "This figure visualizes how different models represent odorants using the first two principal components. It shows that MoLFormer, despite not being trained on perceptual data, can capture the perceptual relationships between odorants, similar to Open-POM, which was trained with supervision.", "section": "4.2 Continues perceptual rating prediction"}, {"figure_path": "3f8i9GlBzu/figures/figures_8_2.jpg", "caption": "Figure 3: Visualization of odorant representations encoded by different models on the GS-LF dataset using the figure layout suggested by [16]. We plot the first and second principal components (PCs) of the representation spaces. Areas dense with molecules that have broad category labels (floral, meaty, or ethereal) are shaded, while areas dense with narrow category labels are outlined. MoLFormer captures the perceptual relationship between different odorants in its representation space, despite not being explicitly trained for this purpose.", "description": "This figure visualizes how different models represent odorants in a 2D space using principal component analysis (PCA).  It compares the representations from MoLFormer, Open-POM, and DAM, highlighting that MoLFormer captures the perceptual relationships between odorants, despite lacking explicit training for this.", "section": "4.2 Continues perceptual rating prediction"}, {"figure_path": "3f8i9GlBzu/figures/figures_14_1.jpg", "caption": "Figure 5: Representational similarity analysis for Snitz and Ravia datasets: a) Correlation coefficients between similarity scores provided by human participants and computed using representations encoded by the different models ; b) Correlation coefficients considering odorant representations extracted from different layers of the MoLFormer model.", "description": "This figure displays the results of a representational similarity analysis (RSA) comparing human olfactory perception with the odorant representations generated by various models, including MoLFormer, Open-POM, and DAM.  Panel (a) shows the correlation between human-rated odor similarity scores and model-generated similarity scores for the Snitz and Ravia datasets.  Panel (b) specifically examines the correlation for MoLFormer, assessing the effect of different layers within the model on the results.", "section": "4.3 Representational similarity analysis"}, {"figure_path": "3f8i9GlBzu/figures/figures_14_2.jpg", "caption": "Figure 3: Visualization of odorant representations encoded by different models on the GS-LF dataset using the figure layout suggested by [16]. We plot the first and second principal components (PCs) of the representation spaces. Areas dense with molecules that have broad category labels (floral, meaty, or ethereal) are shaded, while areas dense with narrow category labels are outlined. MoLFormer captures the perceptual relationship between different odorants in its representation space, despite not being explicitly trained for this purpose.", "description": "This figure visualizes how different models represent odorants in a 2D space using principal component analysis.  It compares MoLFormer and Open-POM, highlighting MoLFormer's ability to capture perceptual relationships between odorants even without explicit training for this.", "section": "4.1 Expert-assigned labels classification"}, {"figure_path": "3f8i9GlBzu/figures/figures_16_1.jpg", "caption": "Figure 2: ROC curve for linear classifiers trained on GS-LF representations extracted from three different models. Each curve corresponds to a separate test split, with the thicker curve representing the average performance across all splits. We highlight that MoLFormer outperforms DAM, despite not being trained to predict perceptual labels but does not achieve the performance level of Open-POM, which demonstrates the highest performance. The chance level is shown with red dashed line.", "description": "This ROC curve compares the performance of three different models (MoLFormer, Open-POM, and DAM) in predicting expert-assigned odorant labels from the GS-LF dataset.  Each thin line represents a single train-test split, showing the variability in performance. The thicker line shows the average ROC curve across all splits.  MoLFormer outperforms DAM, despite not being trained for this task, but Open-POM achieves the best performance, highlighting the benefit of supervised training.", "section": "4.1 Expert-assigned labels classification"}, {"figure_path": "3f8i9GlBzu/figures/figures_16_2.jpg", "caption": "Figure 3: Visualization of odorant representations encoded by different models on the GS-LF dataset using the figure layout suggested by [16]. We plot the first and second principal components (PCs) of the representation spaces. Areas dense with molecules that have broad category labels (floral, meaty, or ethereal) are shaded, while areas dense with narrow category labels are outlined. MoLFormer captures the perceptual relationship between different odorants in its representation space, despite not being explicitly trained for this purpose.", "description": "This figure visualizes how different models represent odorants.  It shows the first two principal components of the odorant representations from MoLFormer and Open-POM models, highlighting how each model captures the perceptual relationships between odorants, even though MoLFormer wasn't explicitly trained for this purpose.", "section": "4.1 Expert-assigned labels classification"}, {"figure_path": "3f8i9GlBzu/figures/figures_16_3.jpg", "caption": "Figure 5: Representational similarity analysis for Snitz and Ravia datasets: a) Correlation coefficients between similarity scores provided by human participants and computed using representations encoded by the different models ; b) Correlation coefficients considering odorant representations extracted from different layers of the MoLFormer model.", "description": "This figure shows the results of a representational similarity analysis (RSA) comparing human perceptual similarity judgments with those predicted by different models (MoLFormer, Open-POM, and DAM) for two datasets: Snitz 2013 and Ravia 2020.  Panel (a) presents the correlation coefficients between human ratings and model predictions, demonstrating that MoLFormer and Open-POM achieve high alignment with human perceptions. Panel (b) shows how this alignment varies across different layers of the MoLFormer model, indicating that deeper layers show a stronger alignment with human judgments.", "section": "4.3 Representational similarity analysis"}, {"figure_path": "3f8i9GlBzu/figures/figures_17_1.jpg", "caption": "Figure 6: Performance of the models to predict relevant physicochemical descriptors for Keller dataset. MoLFormer performs slightly better than Open-POM in predicting descriptors.", "description": "This figure shows the performance comparison between MoLFormer and Open-POM models in predicting 15 physicochemical descriptors relevant to odor perception using the Keller dataset.  For each descriptor, it displays both the Pearson correlation coefficient (a measure of the linear relationship between predicted and actual values) and the Normalized Root Mean Squared Error (NRMSE, which quantifies prediction accuracy).  The results show that MoLFormer generally performs slightly better than Open-POM across most descriptors, indicating a stronger ability to capture the physicochemical features relevant to odor perception.", "section": "4.4 Decoding relevant physicochemical features from pre-trained representations"}, {"figure_path": "3f8i9GlBzu/figures/figures_17_2.jpg", "caption": "Figure 6: Performance of the models to predict relevant physicochemical descriptors for Keller dataset. MolFormer performs slightly better than Open-POM in predicting descriptors.", "description": "The figure displays the performance comparison between MoLFormer and Open-POM models in predicting 15 physicochemical descriptors for the Keller dataset.  For each descriptor, two bars represent the performance metrics (correlation coefficient and NRMSE) of each model.  The results suggest that MoLFormer generally outperforms Open-POM in predicting most of the physicochemical descriptors, although the difference isn't always substantial.", "section": "4.4 Decoding relevant physicochemical features from pre-trained representations"}, {"figure_path": "3f8i9GlBzu/figures/figures_18_1.jpg", "caption": "Figure 2: ROC curve for linear classifiers trained on GS-LF representations extracted from three different models. Each curve corresponds to a separate test split, with the thicker curve representing the average performance across all splits. We highlight that MoLFormer outperforms DAM, despite not being trained to predict perceptual labels but does not achieve the performance level of Open-POM, which demonstrates the highest performance. The chance level is shown with red dashed line.", "description": "This figure displays ROC curves for three different models (MoLFormer, Open-POM, and DAM) trained on the GS-LF dataset to predict expert-assigned odor labels.  Each curve represents a different test split, with the thicker line representing the average performance across all splits. The results show MoLFormer outperforming DAM but falling short of Open-POM's performance, indicating the potential of pre-trained models for olfactory perception prediction.", "section": "4.1 Expert-assigned labels classification"}, {"figure_path": "3f8i9GlBzu/figures/figures_18_2.jpg", "caption": "Figure 6: Performance of the models to predict relevant physicochemical descriptors for Keller dataset. MolFormer performs slightly better than Open-POM in predicting descriptors.", "description": "This figure shows the performance comparison between MoLFormer and Open-POM models in predicting 15 physicochemical descriptors related to odor perception for the Keller dataset. The performance is evaluated using Pearson correlation coefficient and NRMSE.  The bar chart visually represents the correlation and NRMSE for each descriptor for both models, facilitating a direct comparison of their predictive capabilities.  The results indicate that MoLFormer generally performs slightly better than Open-POM in predicting these physicochemical descriptors, demonstrating its ability to capture relevant chemical features.", "section": "4.4 Decoding relevant physicochemical features from pre-trained representations"}, {"figure_path": "3f8i9GlBzu/figures/figures_19_1.jpg", "caption": "Figure 6: Performance of the models to predict relevant physicochemical descriptors for Keller dataset. MoLFormer performs slightly better than Open-POM in predicting descriptors.", "description": "This figure displays the performance of MoLFormer and Open-POM models in predicting 15 physicochemical descriptors relevant to olfaction for the Keller dataset.  It shows the Pearson correlation coefficient and the Normalized Root Mean Squared Error (NRMSE) for each descriptor, indicating how well each model predicts the descriptor's value.  The results suggest MoLFormer performs slightly better overall than Open-POM.", "section": "4.4 Decoding relevant physicochemical features from pre-trained representations"}, {"figure_path": "3f8i9GlBzu/figures/figures_19_2.jpg", "caption": "Figure 3: Visualization of odorant representations encoded by different models on the GS-LF dataset using the figure layout suggested by [16]. We plot the first and second principal components (PCs) of the representation spaces. Areas dense with molecules that have broad category labels (floral, meaty, or ethereal) are shaded, while areas dense with narrow category labels are outlined. MoLFormer captures the perceptual relationship between different odorants in its representation space, despite not being explicitly trained for this purpose.", "description": "This figure visualizes how different models represent odorants in a 2D space using the first two principal components. It shows that MoLFormer, despite not being trained for this, captures the perceptual relationship between odorants, similar to the supervised Open-POM model, but better than the DAM model.  The visualization highlights the clustering of odorants based on their broad and narrow perceptual categories.", "section": "4.2 Continues perceptual rating prediction"}, {"figure_path": "3f8i9GlBzu/figures/figures_20_1.jpg", "caption": "Figure 3: Visualization of odorant representations encoded by different models on the GS-LF dataset using the figure layout suggested by [16]. We plot the first and second principal components (PCs) of the representation spaces. Areas dense with molecules that have broad category labels (floral, meaty, or ethereal) are shaded, while areas dense with narrow category labels are outlined. MoLFormer captures the perceptual relationship between different odorants in its representation space, despite not being explicitly trained for this purpose.", "description": "This figure visualizes how different models represent odorants in a two-dimensional space using principal component analysis (PCA).  The models compared are MoLFormer and Open-POM.  The visualization shows how odorants cluster according to their perceptual properties (e.g., floral, meaty, ethereal).  Importantly, MoLFormer, despite not being trained on perceptual labels, still captures perceptual relationships, demonstrating its ability to learn meaningful representations of odorants.", "section": "4.1 Expert-assigned labels classification"}, {"figure_path": "3f8i9GlBzu/figures/figures_20_2.jpg", "caption": "Figure 3: Visualization of odorant representations encoded by different models on the GS-LF dataset using the figure layout suggested by [16]. We plot the first and second principal components (PCs) of the representation spaces. Areas dense with molecules that have broad category labels (floral, meaty, or ethereal) are shaded, while areas dense with narrow category labels are outlined. MoLFormer captures the perceptual relationship between different odorants in its representation space, despite not being explicitly trained for this purpose.", "description": "This figure visualizes the odorant representations from three different models (MoLFormer, Open-POM, and DAM) using the first two principal components of the representation spaces.  It highlights how MoLFormer, despite lacking explicit training for this, manages to capture the perceptual relationships between different odorants, as evidenced by the clustering of molecules with similar perceptual labels (floral, meaty, ethereal). The figure provides visual evidence supporting the claim that MoLFormer encodes representations aligned with human olfactory perception.", "section": "4.1 Expert-assigned labels classification"}, {"figure_path": "3f8i9GlBzu/figures/figures_21_1.jpg", "caption": "Figure 3: Visualization of odorant representations encoded by different models on the GS-LF dataset using the figure layout suggested by [16]. We plot the first and second principal components (PCs) of the representation spaces. Areas dense with molecules that have broad category labels (floral, meaty, or ethereal) are shaded, while areas dense with narrow category labels are outlined. MoLFormer captures the perceptual relationship between different odorants in its representation space, despite not being explicitly trained for this purpose.", "description": "This figure visualizes the odorant representations generated by MoLFormer and Open-POM models trained on the GS-LF dataset.  It uses principal component analysis (PCA) to reduce the dimensionality of the data to two dimensions, allowing for visualization in a 2D scatter plot.  The plot shows how similar odorants cluster together based on their representation. The figure highlights MoLFormer's ability to capture perceptual relationships between odorants, even without explicit training on such relationships.", "section": "4.1 Expert-assigned labels classification"}, {"figure_path": "3f8i9GlBzu/figures/figures_21_2.jpg", "caption": "Figure 3: Visualization of odorant representations encoded by different models on the GS-LF dataset using the figure layout suggested by [16]. We plot the first and second principal components (PCs) of the representation spaces. Areas dense with molecules that have broad category labels (floral, meaty, or ethereal) are shaded, while areas dense with narrow category labels are outlined. MoLFormer captures the perceptual relationship between different odorants in its representation space, despite not being explicitly trained for this purpose.", "description": "This figure visualizes odorant representations from three different models (MoLFormer, Open-POM, and DAM) on the GS-LF dataset using principal component analysis (PCA).  It shows how the models represent odorants in a 2D space, highlighting clusters of odorants with similar perceptual properties. The visualization demonstrates that MoLFormer, despite not being trained with perceptual labels, still captures the relationship between odorants, suggesting an inherent alignment with human olfactory perception.", "section": "4.1 Expert-assigned labels classification"}]