[{"figure_path": "WILLwyVmP8/tables/tables_7_1.jpg", "caption": "Table 1: Task accuracy on all datasets. The best and second best for CBMs are shown in bold (black and purple, respectively).", "description": "This table presents the task accuracy results achieved by different models on various datasets.  The models include several Concept-Based Models (CBMs) with varying task predictors (linear, MLP, decision tree, XGBoost), along with two state-of-the-art CBMs (CEM and DCR). A \"black box\" model (a non-interpretable model) is included as a baseline for comparison. The table shows the mean accuracy and standard deviation across three runs for each model and dataset. The best and second-best performing CBMs for each dataset are highlighted in bold.", "section": "6 Experiments"}, {"figure_path": "WILLwyVmP8/tables/tables_8_1.jpg", "caption": "Table 1: Task accuracy on all datasets. The best and second best for CBMs are shown in bold (black and purple, respectively).", "description": "This table presents the task accuracy results achieved by various models on six different datasets.  The models are compared to assess their performance on tasks ranging in complexity and concept set completeness.  CBMs (Concept-Based Models) are compared against standard black-box models, and the best-performing CBMs are highlighted.", "section": "6 Experiments"}, {"figure_path": "WILLwyVmP8/tables/tables_8_2.jpg", "caption": "Table 1: Task accuracy on all datasets. The best and second best for CBMs are shown in bold (black and purple, respectively).", "description": "This table presents the task accuracy results for various models on several datasets.  The models include different Concept-Based Models (CBMs) using various task predictors (linear, MLP, decision tree, XGBoost), two state-of-the-art CBMs (CEM and DCR), and a black-box model as a baseline.  Datasets encompass various complexities and concept set qualities (complete or incomplete). The best and second-best performing CBMs are highlighted for each dataset.", "section": "6.2 Key findings & results"}, {"figure_path": "WILLwyVmP8/tables/tables_19_1.jpg", "caption": "Table 1: Task accuracy on all datasets. The best and second best for CBMs are shown in bold (black and purple, respectively).", "description": "This table presents the task accuracy results for different models on several datasets.  The models include various Concept-Based Models (CBMs) using different task predictors (linear, MLP, decision tree, XGBoost), state-of-the-art CBMs (CEM and DCR), and a standard black-box model for comparison. The datasets used are MNIST+, MNIST+*, C-MNIST, CelebA, CUB, and CEBaB, each representing different levels of complexity and concept set completeness.  The best and second-best performing CBMs for each dataset are highlighted in bold.", "section": "6 Experiments"}, {"figure_path": "WILLwyVmP8/tables/tables_20_1.jpg", "caption": "Table 1: Task accuracy on all datasets. The best and second best for CBMs are shown in bold (black and purple, respectively).", "description": "This table presents the task accuracy results achieved by various models on several datasets.  The models include different Concept-Based Models (CBMs) using various task predictors (linear, MLP, decision tree, XGBoost), along with state-of-the-art CBMs (CEM and DCR), and a black-box model for comparison.  The datasets vary in complexity and concept set completeness (complete vs. incomplete).  The best and second-best performances among the CBMs are highlighted in bold.", "section": "6 Experiments"}, {"figure_path": "WILLwyVmP8/tables/tables_22_1.jpg", "caption": "Table 1: Task accuracy on all datasets. The best and second best for CBMs are shown in bold (black and purple, respectively).", "description": "This table presents the task accuracy results on six different datasets for various models, including different Concept-Based Models (CBMs) and a black-box model.  The table compares the performance of CMR (the proposed model) against state-of-the-art CBMs (CBM+linear, CBM+MLP, CBM+DT, CBM+XG, CEM, DCR) and a standard black-box neural network.  The datasets vary in complexity and concept set completeness. The best and second-best performing CBMs are highlighted in bold for comparison.", "section": "6 Experiments"}, {"figure_path": "WILLwyVmP8/tables/tables_23_1.jpg", "caption": "Table 1: Task accuracy on all datasets. The best and second best for CBMs are shown in bold (black and purple, respectively).", "description": "This table presents the task accuracy results for various models on multiple datasets.  The models include different Concept-Based Models (CBMs) using various task predictors (linear, MLP, decision tree, XGBoost), state-of-the-art CBMs (CEM and DCR), and a black-box model as a baseline. The datasets represent varying levels of complexity and concept set completeness.  The best and second-best performing CBMs are highlighted for each dataset.", "section": "6 Experiments"}, {"figure_path": "WILLwyVmP8/tables/tables_23_2.jpg", "caption": "Table 1: Task accuracy on all datasets. The best and second best for CBMs are shown in bold (black and purple, respectively).", "description": "This table presents the task accuracy results achieved by different models on six datasets.  The models include various Concept-Based Models (CBMs) using different task predictors (linear, MLP, decision tree, XGBoost), two state-of-the-art CBMs (CEM and DCR), and a black-box model for comparison.  The datasets represent different tasks and complexities, including complete and incomplete concept sets. The best and second-best performances among the CBMs are highlighted in bold to show the relative performance of the proposed model (CMR) against existing methods.", "section": "6 Experiments"}, {"figure_path": "WILLwyVmP8/tables/tables_24_1.jpg", "caption": "Table 1: Task accuracy on all datasets. The best and second best for CBMs are shown in bold (black and purple, respectively).", "description": "This table presents the task accuracy results achieved by various models on several datasets.  The models include different Concept-Based Models (CBMs) using various task predictors (linear, MLP, decision tree, XGBoost), along with state-of-the-art CBMs like CEM and DCR.  A black-box model is included for comparison.  The datasets are diverse, representing different task complexities and concept set completeness. The best and second-best performing CBMs are highlighted for each dataset.", "section": "6 Experiments"}, {"figure_path": "WILLwyVmP8/tables/tables_25_1.jpg", "caption": "Table 1: Task accuracy on all datasets. The best and second best for CBMs are shown in bold (black and purple, respectively).", "description": "This table presents the task accuracy results achieved by different models on various datasets.  The models include Concept-Based Models (CBMs) with different task predictors (linear, MLP, decision tree, XGBoost), state-of-the-art CBMs (CEM and DCR), and a black-box model for comparison.  The datasets represent diverse tasks and complexities.  The best and second-best performing CBMs are highlighted for each dataset, showcasing the relative performance of CMR (the proposed model) compared to existing methods.", "section": "6 Experiments"}, {"figure_path": "WILLwyVmP8/tables/tables_26_1.jpg", "caption": "Table 1: Task accuracy on all datasets. The best and second best for CBMs are shown in bold (black and purple, respectively).", "description": "This table presents the task accuracy achieved by various models on several datasets.  The models include different Concept-Based Models (CBMs) using various types of task predictors (linear, MLP, decision tree, XGBoost), as well as a state-of-the-art CBM (CEM), a Deep Concept Reasoner (DCR), and a black-box model for comparison.  The datasets encompass different complexity levels and concept set completeness. The best and second-best performances among CBMs are highlighted for each dataset. The table serves to compare the accuracy of CMR against existing approaches on various tasks.", "section": "6 Experiments"}]