[{"figure_path": "dxyNVEBQMp/tables/tables_6_1.jpg", "caption": "Table 1: Forecasting results averaged across prediction lengths S∈ {96,192,336, 720} and three seeds. Illness and Exchange datasets use different prediction lengths due to short data lengths. Higher performance between the base model and BSA is bolded. The Avg. column shows the mean across all datasets. Red indicates p-value < 0.05 in paired t-test. Abbreviations are as follows, We.; Weather, Tr.: Traffic, Eh1: ETTh1, Eh2: ETTh2, Em1: ETTm1, Em2: ETTm2, Ex.:Exchange, PE.: PEMS03, En.: EnergyData, Il.: Illness. Full results are provided in Appendix B.1.", "description": "This table presents the average forecasting performance (MSE and MAE) of seven different time series forecasting models with and without the proposed BSA module across eleven real-world datasets.  Different prediction lengths are used for some datasets due to their length.  Statistical significance (p-value < 0.05) is indicated by red values, and bold values show where BSA improves upon baseline performance. The table averages results over three random seeds.", "section": "4.1 Real world datasets"}, {"figure_path": "dxyNVEBQMp/tables/tables_9_1.jpg", "caption": "Table 3: BSA's performance improvement (%, denoted with *) compared to base model across three input lengths {48, 96, 192} (iTransformer, average over 4 prediction lengths and 3 seeds). The full result, including other models, is in Appendix D.2.", "description": "This table presents the performance improvement achieved by using the Batched Spectral Attention (BSA) module compared to the baseline model. The improvements are calculated as the percentage change in MSE and MAE metrics across different input lengths (48, 96, 192) for the iTransformer model, considering the average across four prediction lengths and three random seeds. The table specifically focuses on the iTransformer model, but Appendix D.2. provides the full results for other models as well.", "section": "4.3 Analysis and ablation studies"}, {"figure_path": "dxyNVEBQMp/tables/tables_9_2.jpg", "caption": "Table 4: Computational cost increase with the BSA (%), averaged over 3 seeds and 4 prediction lengths on the PEMS03 dataset. TN: TimesNet, iTF: iTransformer, CF: Crossformer, PTST: PatchTST. The full result, including other datasets, is in Appendix D.3.", "description": "This table shows the percentage increase in computational cost (time, memory, and number of parameters) when using the Batched Spectral Attention (BSA) module compared to the baseline models (TimesNet, iTransformer, Crossformer, and PatchTST) on the PEMS03 dataset.  The results are averaged over three random seeds and four prediction lengths.  Appendix D.3 provides more detailed results for other datasets.", "section": "4.3 Analysis and ablation studies"}, {"figure_path": "dxyNVEBQMp/tables/tables_9_3.jpg", "caption": "Table 5: Ablation study with 3 components in BSA (Weather data, 720-step prediction, iTransformer).", "description": "This table presents the ablation study results for the Batched Spectral Attention (BSA) module, showing the impact of its three key components: Backpropagation Through Time (BPTT), multiple smoothing factors (SFs), and learnable smoothing factors (Learn SF).  Each row represents a different combination of these components, indicating whether they were enabled (✓) or disabled. The baseline represents the performance without BSA. The MSE and MAE (Mean Absolute Error) values show the model performance for each configuration, demonstrating the contribution of each component to the overall performance improvement.", "section": "4.3 Analysis and ablation studies"}, {"figure_path": "dxyNVEBQMp/tables/tables_14_1.jpg", "caption": "Table 1: Forecasting results averaged across prediction lengths S∈ {96,192,336, 720} and three seeds. Illness and Exchange datasets use different prediction lengths due to short data lengths. Higher performance between the base model and BSA is bolded. The Avg. column shows the mean across all datasets. Red indicates p-value < 0.05 in paired t-test. Abbreviations are as follows, We.; Weather, Tr.: Traffic, Eh1: ETTh1, Eh2: ETTh2, Em1: ETTm1, Em2: ETTm2, Ex.:Exchange, PE.: PEMS03, En.: EnergyData, Il.: Illness. Full results are provided in Appendix B.1.", "description": "This table presents the average forecasting performance results across multiple datasets and models.  It compares the performance of the baseline models against those using the proposed BSA (Batched Spectral Attention) method, evaluating Mean Squared Error (MSE) and Mean Absolute Error (MAE).  Statistical significance (p-value < 0.05) is indicated with red highlighting.  The table also provides averages across all datasets for a broad performance comparison.", "section": "4.1 Real world datasets"}, {"figure_path": "dxyNVEBQMp/tables/tables_18_1.jpg", "caption": "Table 1: Forecasting results averaged across prediction lengths S∈ {96,192,336, 720} and three seeds. Illness and Exchange datasets use different prediction lengths due to short data lengths. Higher performance between the base model and BSA is bolded. The Avg. column shows the mean across all datasets. Red indicates p-value < 0.05 in paired t-test. Abbreviations are as follows, We.; Weather, Tr.: Traffic, Eh1: ETTh1, Eh2: ETTh2, Em1: ETTm1, Em2: ETTm2, Ex.:Exchange, PE.: PEMS03, En.: EnergyData, Il.: Illness.", "description": "This table presents the average forecasting performance results across 11 real-world datasets and 7 forecasting models (DLinear, RLinear, FreTS, TimesNet, iTransformer, Crossformer, PatchTST) for four different prediction lengths (S = 96, 192, 336, 720).  The table compares the performance of the base models with the BSA module added. It highlights the average Mean Squared Error (MSE) and Mean Absolute Error (MAE) for each model and dataset.  Statistical significance (p<0.05) is indicated using red font. The average performance across all datasets is shown in the \"Avg\" column.", "section": "4.1 Real world datasets"}, {"figure_path": "dxyNVEBQMp/tables/tables_19_1.jpg", "caption": "Table 1: Forecasting results averaged across prediction lengths S∈ {96,192,336, 720} and three seeds. Illness and Exchange datasets use different prediction lengths due to short data lengths. Higher performance between the base model and BSA is bolded. The Avg. column shows the mean across all datasets. Red indicates p-value < 0.05 in paired t-test. Abbreviations are as follows, We.; Weather, Tr.: Traffic, Eh1: ETTh1, Eh2: ETTh2, Em1: ETTm1, Em2: ETTm2, Ex.:Exchange, PE.: PEMS03, En.: EnergyData, Il.: Illness.", "description": "This table presents the average forecasting performance results across four different prediction lengths (96, 192, 336, and 720 time steps) and three random seeds.  The results are shown for eleven real-world datasets and seven forecasting models.  Higher performance with BSA (Bolded) compared to the base model is highlighted, along with statistical significance (p-value < 0.05) indicated in red. Abbreviations for the datasets are provided.", "section": "4.1 Real world datasets"}, {"figure_path": "dxyNVEBQMp/tables/tables_20_1.jpg", "caption": "Table 1: Forecasting results averaged across prediction lengths S∈ {96,192,336, 720} and three seeds. Illness and Exchange datasets use different prediction lengths due to short data lengths. Higher performance between the base model and BSA is bolded. The Avg. column shows the mean across all datasets. Red indicates p-value < 0.05 in paired t-test. Abbreviations are as follows, We.; Weather, Tr.: Traffic, Eh1: ETTh1, Eh2: ETTh2, Em1: ETTm1, Em2: ETTm2, Ex.:Exchange, PE.: PEMS03, En.: EnergyData, Il.: Illness. Full results are provided in Appendix B.1.", "description": "This table presents the average forecasting performance results across different prediction lengths (96, 192, 336, and 720 time steps) and three random seeds, comparing the base model and the model with the proposed BSA module.  It includes results for 11 real-world datasets and seven different forecasting models, showing Mean Squared Error (MSE) and Mean Absolute Error (MAE).  Statistical significance (p-value < 0.05) is indicated with red coloring. The table averages results for multiple datasets and models, with full results detailed in the appendix.", "section": "4.1 Real world datasets"}, {"figure_path": "dxyNVEBQMp/tables/tables_21_1.jpg", "caption": "Table 1: Forecasting results averaged across prediction lengths S∈ {96,192,336, 720} and three seeds. Illness and Exchange datasets use different prediction lengths due to short data lengths. Higher performance between the base model and BSA is bolded. The Avg. column shows the mean across all datasets. Red indicates p-value < 0.05 in paired t-test. Abbreviations are as follows, We.; Weather, Tr.: Traffic, Eh1: ETTh1, Eh2: ETTh2, Em1: ETTm1, Em2: ETTm2, Ex.:Exchange, PE.: PEMS03, En.: EnergyData, Il.: Illness. Full results are provided in Appendix B.1.", "description": "This table presents the average forecasting performance results across 11 real-world datasets and 7 forecasting models.  The results are presented for four different prediction lengths (96, 192, 336, and 720 time steps) and averaged across three separate training runs to show the model's robustness.  The table highlights the Mean Squared Error (MSE) and Mean Absolute Error (MAE) for each model (base model vs. model with BSA).  Bold values indicate statistically significant improvements of BSA over the base model (p<0.05).  The table also provides an average performance across all datasets.", "section": "4.1 Real world datasets"}, {"figure_path": "dxyNVEBQMp/tables/tables_21_2.jpg", "caption": "Table 1: Forecasting results averaged across prediction lengths S∈ {96,192,336, 720} and three seeds. Illness and Exchange datasets use different prediction lengths due to short data lengths. Higher performance between the base model and BSA is bolded. The Avg. column shows the mean across all datasets. Red indicates p-value < 0.05 in paired t-test. Abbreviations are as follows, We.; Weather, Tr.: Traffic, Eh1: ETTh1, Eh2: ETTh2, Em1: ETTm1, Em2: ETTm2, Ex.:Exchange, PE.: PEMS03, En.: EnergyData, Il.: Illness. Full results are provided in Appendix B.1.", "description": "This table presents the average forecasting results across four different prediction lengths (96, 192, 336, and 720 time steps) and three random seeds for seven different forecasting models (DLinear, RLinear, FreTS, TimesNet, iTransformer, Crossformer, and PatchTST) applied to eleven real-world datasets (Weather, Traffic, ECL, ETTh1, ETTh2, ETTm1, ETTm2, Exchange, PEMS03, EnergyData, and Illness).  The table shows the Mean Squared Error (MSE) and Mean Absolute Error (MAE) for each model and dataset, highlighting the improvements achieved by using the Batched Spectral Attention (BSA) mechanism.  Bolded values indicate statistically significant performance gains of BSA over the baseline models (p<0.05, using a paired t-test).", "section": "4.1 Real world datasets"}, {"figure_path": "dxyNVEBQMp/tables/tables_22_1.jpg", "caption": "Table 1: Forecasting results averaged across prediction lengths S∈ {96,192,336, 720} and three seeds. Illness and Exchange datasets use different prediction lengths due to short data lengths. Higher performance between the base model and BSA is bolded. The Avg. column shows the mean across all datasets. Red indicates p-value < 0.05 in paired t-test. Abbreviations are as follows, We.; Weather, Tr.: Traffic, Eh1: ETTh1, Eh2: ETTh2, Em1: ETTm1, Em2: ETTm2, Ex.:Exchange, PE.: PEMS03, En.: EnergyData, Il.: Illness. Full results are provided in Appendix B.1.", "description": "This table presents the average forecasting performance results across four different prediction lengths (96, 192, 336, and 720 time steps) and three random seeds for eleven real-world datasets and seven forecasting models.  The table compares the performance of the baseline models against the models enhanced with the Batched Spectral Attention (BSA) mechanism.  Higher performance of BSA-enhanced models is highlighted in bold.  The 'Avg.' column shows the average performance across all datasets, and red highlights statistically significant improvements (p<0.05) based on paired t-tests.", "section": "4.1 Real world datasets"}]