[{"figure_path": "IgU8gMKy4D/figures/figures_5_1.jpg", "caption": "Figure 3: Left, PCPCA for BMMC Data. Right, cPCA for mHealth Data.", "description": "This figure shows the results of applying two contrastive dimension reduction methods, PCPCA and cPCA, to two real-world datasets: BMMC and mHealth. The left panel displays the PCPCA results for the BMMC (bone marrow mononuclear cells) dataset, illustrating the separation of pre- and post-transplant groups using the third and fourth principal components.  The right panel presents the cPCA results for the mHealth dataset, showcasing how a single direction effectively distinguishes subgroups (squatting or cycling vs. lying down). This visualization demonstrates the ability of contrastive methods to uncover low-dimensional structures unique to foreground groups.", "section": "6 Real data experiments"}, {"figure_path": "IgU8gMKy4D/figures/figures_7_1.jpg", "caption": "Figure 1: Hypothesis test Type I error plots. Left: nx = ny = 100. Right: nx = ny = 200.", "description": "This figure displays two plots showing the Type I error rate of the hypothesis test proposed in the paper.  The Type I error rate is the probability of rejecting the null hypothesis when it is actually true.  Each plot shows the observed Type I error rate against the significance level (alpha) for a different sample size. The left plot shows the results for samples of size 100 (nx = ny = 100), and the right plot shows the results for samples of size 200 (nx = ny = 200). The plots demonstrate the conservative nature of the test, meaning that the observed Type I error rate is consistently below the significance level.", "section": "5 Simulations"}, {"figure_path": "IgU8gMKy4D/figures/figures_7_2.jpg", "caption": "Figure 4: Corrupted MNIST Sample Images. Top row, foreground. Bottom row, background.", "description": "This figure displays sample images from the Corrupted MNIST dataset used in the paper's experiments.  The top row shows examples of images in the foreground group (handwritten digits with added noise), and the bottom row shows examples of images from the background group (noise only, no digits). This visualization helps illustrate the type of data used in the contrastive dimension reduction methods, where the goal is to identify patterns in the foreground group that are distinct from the background.", "section": "Simulations"}, {"figure_path": "IgU8gMKy4D/figures/figures_16_1.jpg", "caption": "Figure 3: Left, PCPCA for BMMC Data. Right, cPCA for mHealth Data.", "description": "This figure shows the results of applying PCPCA (Probabilistic Contrastive Principal Component Analysis) to the BMMC (Bone Marrow Mononuclear Cells) dataset and cPCA (Contrastive Principal Component Analysis) to the mHealth dataset.  The left panel displays the PCPCA results for the BMMC data, showing the pre- and post-transplant groups separated along the PCPC3 and PCPC4 axes. The right panel shows the cPCA results for the mHealth data, with the squatting and cycling activities clearly separated along the first two cPCA components.  This visualization demonstrates the effectiveness of these contrastive dimension reduction techniques in separating groups of interest from control groups within high-dimensional datasets.", "section": "6 Real data experiments"}, {"figure_path": "IgU8gMKy4D/figures/figures_16_2.jpg", "caption": "Figure 4: Corrupted MNIST Sample Images. Top row, foreground. Bottom row, background.", "description": "This figure shows sample images from the corrupted MNIST dataset used in the paper's experiments. The top row displays images from the foreground group, while the bottom row shows images from the background group.  The foreground images are handwritten digits (0 and 1) superimposed on grassy noise. The background images contain only the grassy noise.", "section": "5 Simulations"}, {"figure_path": "IgU8gMKy4D/figures/figures_17_1.jpg", "caption": "Figure 5: CelebA Sample Images. Top-left, foreground (glasses). Top-right, foreground (hat).", "description": "This figure shows sample images from the CelebA dataset used in the paper's real data experiments.  The top row displays images from the foreground group (celebrities wearing glasses and hats), while the bottom row shows images from the background group (celebrities without glasses or hats). The images are used to illustrate the application of the proposed methods to real-world image data.", "section": "Real data experiments"}]