[{"figure_path": "yURca4wi2L/tables/tables_1_1.jpg", "caption": "Table 1: Comparison of recent supervised (S), self-supervised (SS), and hybrid (S+SS) learning approaches for image and video ATM.", "description": "This table compares various state-of-the-art methods for Atmospheric Turbulence Mitigation (ATM) in images and videos.  It categorizes methods by their supervision type (supervised, self-supervised, or hybrid) and highlights their capabilities (static scene sequences, image, or video).  For each method, it also lists the critical factors influencing their performance, such as the use of adversarial learning, advanced simulators, physically-grounded models, or specific techniques like lucky imaging and denoisers.  This provides a comprehensive overview of existing ATM techniques and their strengths and weaknesses.", "section": "1.1 Current State-of-the-Art in Atmospheric Turbulence Mitigation"}, {"figure_path": "yURca4wi2L/tables/tables_7_1.jpg", "caption": "Table 2: Performance improvements achieved by applying our proposed ConVRT across various model architectures and datasets. The No Base Method columns show the results when the methodology was applied directly to the original frames, labeled as Ori. Gains are highlighted for each metric, showing the effectiveness of ConVRT in enhancing the temporal consistency in video ATM.", "description": "This table presents a quantitative comparison of the proposed ConVRT method with various state-of-the-art video and image atmospheric turbulence mitigation (ATM) methods. It shows the improvements achieved in terms of different metrics (Ewarp, PSNR, SSIM, Flowtv, Slicetv) by applying ConVRT to the results of other methods.  The table also provides results when ConVRT is used independently, without pre-processing by other ATM methods, showing the standalone effectiveness of ConVRT.", "section": "4 Experiments"}, {"figure_path": "yURca4wi2L/tables/tables_7_2.jpg", "caption": "Table 3: Ablation Study of Ltemp and Tres. Comparison of PSNRimg, SSIM, and PSNRx-t scores, showing the impact of Ltemp and Tres. The experiment is conducted on a synthetic dataset created using turbulence simulator(15). The base model is TurbNet.", "description": "This table presents the results of an ablation study to analyze the impact of two hyperparameters: Tres (temporal resolution) and Ltemp (temporal consistency regularization loss) on the performance of the ConVRT method.  The experiment uses synthetic turbulence data and TurbNet as the baseline model.  The table shows that lower Tres and the inclusion of Ltemp lead to better PSNRimg, SSIM, and PSNRx-t scores, indicating improved image quality and temporal consistency.", "section": "4 Experiments"}]