[{"figure_path": "FTpOwIaWUz/figures/figures_7_1.jpg", "caption": "Figure 1: Asymmetry between ELECTRA (E), RoBERTa (R), and MULTIBERT encoders (M1-M25) across layers. For each pair of the encoders M(i) and M(j), we generate training set embeddings H(i), H(j) ∈ RN×D for SST-2, COLA, and MNLI. We then fit H(i) to H(j) with an affine map and report the goodness of fit through the max error L2 norm, i.e., an approximation of d(H(i), H(j)) on row i and column j of the grid. Full results across GLUE tasks are shown in Figure 4.", "description": "This figure visualizes the asymmetry in affine mappability between different language encoders (ELECTRA, RoBERTa, and MULTIBERT).  It shows the maximum L2 norm error when fitting one encoder's representations to another using an affine transformation.  The results are shown as heatmaps for three different downstream tasks (SST-2, COLA, MNLI) and across different layers of the encoders. Darker colors indicate better fits.", "section": "7 Experiments"}, {"figure_path": "FTpOwIaWUz/figures/figures_8_1.jpg", "caption": "Figure 2: For ELECTRA (E), RoBERTa (R), and MULTIBERTs (M1-M25), we plot extrinsic (d\") against intrinsic similarity (dAff(V)) across GLUE tasks. We group the points by how well we can map to each encoder (M), and display the median, as well as the first and third quartiles as vertical and horizontal lines. We additionally show the linear regression from dAff(V) to d\".", "description": "This figure shows the relationship between intrinsic and extrinsic similarity measures for different language encoders. The intrinsic similarity is measured using the affine alignment method (dAff(V)), while the extrinsic similarity (d\") is calculated based on the performance on downstream tasks.  The plot shows a positive correlation between intrinsic and extrinsic similarity, suggesting that encoders that are intrinsically similar also tend to perform similarly on downstream tasks. The data points are grouped by the \"mappability\" of the encoders, illustrating how easily an encoder can be transformed into another using affine transformations. ", "section": "5 Extrinsic Homotopy"}, {"figure_path": "FTpOwIaWUz/figures/figures_21_1.jpg", "caption": "Figure 3: The effect of artificial rank deficiency averaged across MULTIBERTS. For each pair of embeddings H(i) and H(j) from MULTIBERTS M(i) and M(j), we generate additional rank-deficient encoders H(i)X% and H(j)Y% with X, Y ∈ {20%, ..., 90%} of the full rank through SVD truncation. We compute d(H(i)X%, H(j)Y%) for each pair of possible rank-deficiency and finally report the median across all MULTIBERTS on row X and column Y on the grid. We additionally show row-, and column medians.", "description": "This figure shows the effect of artificial rank deficiency on the distance between MULTIBERT encoders.  By using Singular Value Decomposition (SVD) truncation, the authors create rank-deficient versions of the encoders and measure the distance between them. The heatmap shows that the distance is generally symmetric, and the distance between encoders of the same rank becomes easier as the rank decreases. ", "section": "Additional Experimental Results"}, {"figure_path": "FTpOwIaWUz/figures/figures_22_1.jpg", "caption": "Figure 4: Asymmetry between ELECTRA (E), RoBERTa (R), and MULTIBERT encoders (M1-M25) across layers. For each pair of the encoders M(i) and M(j), we generate training set embeddings H(i), H(j) ∈ RN×D for the GLUE tasks SST-2, CoLA, MNLI, QQP, RTE, and MRPC. We then fit H(i) to H(j) with an affine map and report the goodness of fit through the max error L2 norm, i.e., an approximation of d(H(i), H(j)) on row i and column j of the grid.", "description": "This figure visualizes the asymmetry in affine mappability between different language encoders (ELECTRA, RoBERTa, and MULTIBERT) across various layers and GLUE tasks.  Each cell in the heatmap represents the error of fitting one encoder's representation to another using an affine transformation, highlighting the directionality of the similarity measure.", "section": "Experiments"}]