[{"figure_path": "4kVHI2uXRE/figures/figures_1_1.jpg", "caption": "Figure 1: In this work, we propose an RL-based photo finishing tuning algorithm that efficiently tunes the parameters of a black-box image processing pipeline to match any tuning target. The RL-based solution (top row) takes only about 10 iterations to achieve a similar PSNR as the 500-iteration output of a zeroth-order algorithm (bottom row). Our method demonstrates fast convergence, high quality, and no need for a proxy.", "description": "This figure compares the performance of three different photo finishing tuning methods: the proposed RL-based method, a cascaded proxy-based method, and a CMAES (Covariance Matrix Adaptation Evolution Strategy) method.  The RL-based method is shown to achieve comparable PSNR (Peak Signal-to-Noise Ratio) with significantly fewer iterations (10) compared to the other two methods (200 and 500 iterations, respectively). The figure highlights the advantages of the RL-based approach in terms of speed, quality, and the avoidance of needing a differentiable proxy of the photo finishing pipeline. The image shows a visual comparison of the output of each method at different iterations.", "section": "1 Introduction"}, {"figure_path": "4kVHI2uXRE/figures/figures_3_1.jpg", "caption": "Figure 2: The overall framework. Top row: at each step, our policy maps the current image and the goal image to action (new parameters), with the help of our state representation consisting of dual-path features, photo statistics, and historical actions. Bottom row: visualization of iterative tuning trajectory of our RL-based photo finishing framework.", "description": "This figure illustrates the proposed RL-based photo finishing tuning framework. The top row shows the architecture of the goal-conditioned policy, which takes the current image and goal image as input to generate the next set of parameters for the image processing pipeline.  The state representation comprises dual-path features (encoding global and local image characteristics), photo statistics (matching traditional image statistics), and historical actions. The bottom row visualizes the iterative tuning process, showcasing how the pipeline parameters are adjusted step-by-step to match the goal image. Each step involves the policy mapping the current image and the goal image to a new set of parameters, which are then used by the image processing pipeline to generate the next step's processed image.", "section": "3 Method"}, {"figure_path": "4kVHI2uXRE/figures/figures_6_1.jpg", "caption": "Figure 3: Photo finishing tuning results on FiveK dataset with expert C target. The visual results of our method are closest to the target image, especially in terms of color and brightness.", "description": "This figure shows a visual comparison of photo finishing results on the FiveK dataset using different methods: Monolithic Proxy, Cascaded Proxy, CMAES, and the proposed RL-based method.  Each row represents a different input image with its corresponding outputs from each method and the expert-generated target image. The RL-based method consistently produces results that closely resemble the expert-generated targets in terms of color and brightness, demonstrating its effectiveness.", "section": "4.2 Results"}, {"figure_path": "4kVHI2uXRE/figures/figures_7_1.jpg", "caption": "Figure 3: Photo finishing tuning results on FiveK dataset with expert C target. The visual results of our method are closest to the target image, especially in terms of color and brightness.", "description": "This figure showcases a visual comparison of photo finishing tuning results on the FiveK dataset using expert C targets.  It compares the results of five different methods: input image, monolithic proxy, cascaded proxy, CMAES, and the proposed RL-based method. Each row represents a different image, illustrating the results of each method side-by-side. The visual comparison highlights that the proposed method produces image results that are closer to the expert C target images in terms of color and brightness, demonstrating its superiority in photo finishing tuning.", "section": "4.2 Results"}, {"figure_path": "4kVHI2uXRE/figures/figures_8_1.jpg", "caption": "Figure 3: Photo finishing tuning results on FiveK dataset with expert C target. The visual results of our method are closest to the target image, especially in terms of color and brightness.", "description": "This figure compares the visual results of different photo finishing tuning methods on the FiveK dataset using expert C target images.  The methods compared include Monolithic Proxy, Cascaded Proxy, CMAES, and the authors' proposed RL-based method. The figure shows that the RL-based method produces results that are visually closer to the target images than the other methods, particularly in terms of color and brightness. Each row displays the input image, the results of each method, and the target image for a specific example.", "section": "4.2 Results"}, {"figure_path": "4kVHI2uXRE/figures/figures_9_1.jpg", "caption": "Figure 6: Results of the user study on the photo stylization tuning task. Each bar represents the number of votes each method received, where participants select the images they believed most closely resembled target images.", "description": "This figure displays the results of a user study comparing four different photo stylization methods: Ours, CMAES, Cascaded Proxy, and Monolithic Proxy.  Participants were shown a target image and four images generated by each method and asked to select the images most similar to the target. The bar chart shows the number of times each method was chosen as the most similar, illustrating the relative success of each approach in the user's opinion.  The results indicate a strong preference for the 'Ours' method, showcasing its superior ability to produce stylistically accurate results.", "section": "4.2 Results"}, {"figure_path": "4kVHI2uXRE/figures/figures_12_1.jpg", "caption": "Figure 3: Photo finishing tuning results on FiveK dataset with expert C target. The visual results of our method are closest to the target image, especially in terms of color and brightness.", "description": "This figure compares the visual results of photo finishing tuning on the FiveK dataset using expert C target images.  It shows the input image, the results obtained using the monolithic proxy method, the cascaded proxy method, the CMAES algorithm, the proposed RL-based method, and finally, the target image. The comparison highlights the superior performance of the RL-based approach in terms of color accuracy and brightness, demonstrating its ability to produce results that closely match the target.", "section": "4.2 Results"}, {"figure_path": "4kVHI2uXRE/figures/figures_12_2.jpg", "caption": "Figure 4: Photo stylization tuning results. Compared with CMAES [9, 20], monolithic proxy [28], and cascaded proxy [29], our output matches the best with the style goal.", "description": "This figure shows a qualitative comparison of photo stylization results obtained using four different methods: the proposed RL-based method, CMAES, monolithic proxy, and cascaded proxy.  For each of several input images, it presents the input image and the outputs generated by each method, alongside the style target image.  The results demonstrate that the RL-based method produces outputs that visually align best with the style of the target image, outperforming the other three methods in terms of achieving the desired stylistic effect.", "section": "4 Experiments"}, {"figure_path": "4kVHI2uXRE/figures/figures_16_1.jpg", "caption": "Figure 15: Options in question 7 of our user study.", "description": "This figure shows the options provided to participants in question 7 of a user study.  The user study was designed to assess the quality of photo stylization tuning results produced by various methods.  Participants were shown a target image and four alternative images (labeled A, B, C, and D), and asked to select the image(s) that most closely resembled the target image. Each option represents a different method's photo stylization result for a given input image. The figure helps to visually illustrate the diversity of results produced by different algorithms and the challenges involved in this task.", "section": "Appendix D"}, {"figure_path": "4kVHI2uXRE/figures/figures_16_2.jpg", "caption": "Figure 1: In this work, we propose an RL-based photo finishing tuning algorithm that efficiently tunes the parameters of a black-box image processing pipeline to match any tuning target. The RL-based solution (top row) takes only about 10 iterations to achieve a similar PSNR as the 500-iteration output of a zeroth-order algorithm (bottom row). Our method demonstrates fast convergence, high quality, and no need for a proxy.", "description": "This figure compares the performance of the proposed RL-based photo finishing tuning algorithm against three other methods: a cascaded proxy-based method, a monolithic proxy-based method, and a zeroth-order optimization method (CMAES).  It shows that the RL-based approach achieves comparable Peak Signal-to-Noise Ratio (PSNR) values using only 10 iterations compared to 500 iterations for the zeroth-order method. The RL-based method also exhibits better image quality and doesn't require a proxy model.", "section": "1 Introduction"}, {"figure_path": "4kVHI2uXRE/figures/figures_16_3.jpg", "caption": "Figure 15: Options in question 7 of our user study.", "description": "This figure shows the options given to participants in question 7 of the user study on photo stylization tuning.  The \"Target\" image is presented to the left, showing the desired style, followed by four different image processing outputs (A, B, C, D) that participants could choose from, indicating which result best matched the target style. The purpose is to compare the perceptual similarity of the stylization results from different algorithms.", "section": "Appendix D"}, {"figure_path": "4kVHI2uXRE/figures/figures_16_4.jpg", "caption": "Figure 6: Results of the user study on the photo stylization tuning task. Each bar represents the number of votes each method received, where participants select the images they believed most closely resembled target images.", "description": "This figure shows the results of a user study comparing different methods for photo stylization.  Participants were shown a target image and four stylized versions generated by different techniques (Ours, CMAES, Cascaded Proxy, Monolithic Proxy). They chose up to two images that best matched the target. The bar chart displays the number of times each method was selected for each of 20 questions, demonstrating user preference for different stylization approaches.", "section": "4.2 Results"}, {"figure_path": "4kVHI2uXRE/figures/figures_16_5.jpg", "caption": "Figure 3: Photo finishing tuning results on FiveK dataset with expert C target. The visual results of our method are closest to the target image, especially in terms of color and brightness.", "description": "This figure shows a visual comparison of photo finishing results using different methods on the FiveK dataset, with a specific expert's edited image as the target.  The input image is shown alongside results from three baseline methods (Monolithic Proxy, Cascaded Proxy, and CMAES) and the proposed RL-based method. The visual comparison highlights the superiority of the RL approach in closely matching the target image in terms of color and brightness.", "section": "4.2 Results"}, {"figure_path": "4kVHI2uXRE/figures/figures_16_6.jpg", "caption": "Figure 10: Options in question 2 of our user study.", "description": "This figure shows the options presented to participants in question 2 of a user study.  The goal image (Target) is displayed alongside four images (A, B, C, D) generated by different methods. Participants were asked to choose which image(s) most closely resembled the goal image. The purpose was to evaluate the performance of each method for photo stylization tuning by subjective user assessment.", "section": "D Detailed Content of the User Study"}, {"figure_path": "4kVHI2uXRE/figures/figures_16_7.jpg", "caption": "Figure 10: Options in question 2 of our user study.", "description": "This figure shows the options provided to participants in question 2 of the user study. The target image and four options (A, B, C, and D) are shown, and participants were asked to select the image that most closely resembles the target image. This was part of a user study designed to evaluate the effectiveness of different photo stylization methods.", "section": "Appendix D"}, {"figure_path": "4kVHI2uXRE/figures/figures_17_1.jpg", "caption": "Figure 3: Photo finishing tuning results on FiveK dataset with expert C target. The visual results of our method are closest to the target image, especially in terms of color and brightness.", "description": "This figure presents a visual comparison of photo finishing results on the FiveK dataset using the expert C target.  The top row shows the input image and the target image. The bottom four rows show the results produced by four different methods: Monolithic Proxy, Cascaded Proxy, CMAES, and the proposed method (Ours).  The visual comparison highlights that the proposed method most accurately reproduces the color and brightness of the target image, outperforming the other three methods.", "section": "4.2 Results"}, {"figure_path": "4kVHI2uXRE/figures/figures_17_2.jpg", "caption": "Figure 15: Options in question 7 of our user study.", "description": "This figure shows the options given to participants in question 7 of the user study. The target image is shown on the left and four different processed images (A, B, C, D), presumably generated by different methods (ours, CMAES, Monolithic proxy, Cascaded proxy), are displayed on the right. The participants were asked to select up to two images that most closely resemble the target image.", "section": "Appendix D"}, {"figure_path": "4kVHI2uXRE/figures/figures_17_3.jpg", "caption": "Figure 1: In this work, we propose an RL-based photo finishing tuning algorithm that efficiently tunes the parameters of a black-box image processing pipeline to match any tuning target. The RL-based solution (top row) takes only about 10 iterations to achieve a similar PSNR as the 500-iteration output of a zeroth-order algorithm (bottom row). Our method demonstrates fast convergence, high quality, and no need for a proxy.", "description": "This figure compares the proposed RL-based method with other methods for photo finishing tuning. It shows that the RL-based method achieves comparable PSNR (Peak Signal-to-Noise Ratio) in significantly fewer iterations (10) than a zeroth-order optimization method (500).  The comparison highlights the advantages of RL in terms of speed, quality, and avoidance of proxy models.", "section": "1 Introduction"}, {"figure_path": "4kVHI2uXRE/figures/figures_17_4.jpg", "caption": "Figure 15: Options in question 7 of our user study.", "description": "This figure displays the options presented to participants in question 7 of a user study on photo stylization. It shows a target image alongside four stylized versions (A, B, C, and D), generated using different methods.  Participants were asked to select the options that most closely resembled the target image.", "section": "Appendix D"}, {"figure_path": "4kVHI2uXRE/figures/figures_17_5.jpg", "caption": "Figure 2: The overall framework. Top row: at each step, our policy maps the current image and the goal image to action (new parameters), with the help of our state representation consisting of dual-path features, photo statistics, and historical actions. Bottom row: visualization of iterative tuning trajectory of our RL-based photo finishing framework.", "description": "This figure illustrates the proposed reinforcement learning framework for photo finishing tuning. The top row shows the architecture, where a goal-conditioned policy uses the current image and goal image to generate new parameters for an image processing pipeline.  The state representation incorporates dual-path features, photo statistics, and historical actions. The bottom row visually demonstrates the iterative tuning process, showing how the generated parameters progressively refine the image towards the goal image.", "section": "3 Method"}, {"figure_path": "4kVHI2uXRE/figures/figures_17_6.jpg", "caption": "Figure 15: Options in question 7 of our user study.", "description": "This figure shows the options provided to participants in question 7 of the user study. The user study aimed to evaluate the effectiveness of different photo stylization methods. In this specific question, participants were presented with a target image and four different stylized versions (labeled A, B, C, and D) generated by different methods. The task was to select the option(s) most closely resembling the target image.", "section": "D. Detailed Content of the User Study"}, {"figure_path": "4kVHI2uXRE/figures/figures_17_7.jpg", "caption": "Figure 15: Options in question 7 of our user study.", "description": "This figure shows the options provided to participants in question 7 of a user study evaluating photo stylization tuning. The figure presents a target image alongside four different results (A, B, C, and D), generated by various methods. Participants were asked to select up to two images that most closely resembled the target style.", "section": "Appendix D"}, {"figure_path": "4kVHI2uXRE/figures/figures_18_1.jpg", "caption": "Figure 9: Options in question 1 of our user study.", "description": "This figure shows the options given to participants in question 1 of the user study.  The target image is displayed on the left, and four different image processing results (A, B, C, D) are shown on the right. Each result represents the output of a different photo stylization method, and participants were asked to select the option(s) that most closely resemble the target style.", "section": "D. Detailed Content of the User Study"}, {"figure_path": "4kVHI2uXRE/figures/figures_18_2.jpg", "caption": "Figure 13: Options in question 5 of our user study.", "description": "This figure shows the options given to participants in question 5 of the user study.  The target image is displayed on the left, followed by four processed versions (labeled A, B, C, and D) generated by different methods. Participants were asked to select the image(s) that most closely resembled the target image.", "section": "Appendix D"}, {"figure_path": "4kVHI2uXRE/figures/figures_18_3.jpg", "caption": "Figure 25: Options in question 17 of our user study.", "description": "This figure shows the options provided to participants in question 17 of a user study.  The user study evaluated the results of a photo stylization tuning task. Each option presents four different stylized versions (A, B, C, and D) of a single image, with the goal being to identify which options (or option) most closely matched the style of a target image shown above. This helps assess the effectiveness of different photo stylization methods.", "section": "Appendix D"}, {"figure_path": "4kVHI2uXRE/figures/figures_18_4.jpg", "caption": "Figure 15: Options in question 7 of our user study.", "description": "This figure shows the options provided to participants in question 7 of the user study. The options consist of four images (labeled A, B, C, and D) resulting from different photo stylization methods. Participants were asked to select the image(s) that most closely resembled the target image shown at the top of the figure.", "section": "D Detailed Content of the User Study"}, {"figure_path": "4kVHI2uXRE/figures/figures_18_5.jpg", "caption": "Figure 10: Options in question 2 of our user study.", "description": "This figure shows the options presented to participants in question 2 of the user study.  The target image depicts a cityscape at sunset, and the four options (A, B, C, and D) represent different stylization results from four different methods in the photo stylization tuning task.  Participants were asked to choose the option(s) most closely resembling the target image.", "section": "Appendix D"}, {"figure_path": "4kVHI2uXRE/figures/figures_18_6.jpg", "caption": "Figure 10: Options in question 2 of our user study.", "description": "This figure shows the options given to participants in question 2 of the user study. The target image is displayed on the left, followed by four processed images (A, B, C, D) generated using different methods. Participants were asked to choose the image(s) that most closely resembles the target image.", "section": "Appendix D"}]