[{"figure_path": "UtbjD5LGnC/figures/figures_9_1.jpg", "caption": "Figure 1: Risk and unfairness of our estimator on Communities and Crime and Law School datasets.", "description": "This figure displays the convergence of the risk and unfairness of the proposed demographic parity constrained regression algorithm over iterations for the Communities and Crime dataset and the Law School dataset.  The plots show how the risk (mean squared error) and the unfairness (measured by the maximum difference in conditional outcome distributions across sensitive groups) change as the algorithm progresses.  The shaded area represents the standard deviation across multiple runs.", "section": "6 Numerical illustration"}, {"figure_path": "UtbjD5LGnC/figures/figures_9_2.jpg", "caption": "Figure 2: Comparison with ADW model on Communitites and Crime and Law School datasets.", "description": "This figure compares the performance of the proposed DP-postproc algorithm with the ADW algorithm (Agarwal et al., 2019) and a simple base regression model on two datasets: Communities and Crime, and Law School.  The comparison is done in terms of risk and unfairness, across a range of unfairness thresholds. Both ADW versions (ADW-1 using both labelled and unlabelled data, ADW-2 using only labelled data) are included.  The plot shows that DP-postproc is competitive or outperforms ADW across various settings.", "section": "Numerical illustration"}, {"figure_path": "UtbjD5LGnC/figures/figures_27_1.jpg", "caption": "Figure 3: Comparison of SDG, ACSA, ACSA2, SDG3+ACSA and SDG3+ACSA2 algorithms on Communities and Crime and Law School datasets.", "description": "This figure compares the performance of several stochastic gradient descent algorithms (SDG, ACSA, ACSA2, SDG3+ACSA, SDG3+ACSA2) on two benchmark datasets: Communities and Crime, and Law School.  The algorithms are evaluated across a range of unfairness levels, with the x-axis representing unfairness and the y-axis showing the risk.  The plot illustrates how different algorithms behave under varying levels of fairness constraints, highlighting their strengths and weaknesses in achieving a balance between fairness and accuracy.", "section": "Numerical illustration"}, {"figure_path": "UtbjD5LGnC/figures/figures_28_1.jpg", "caption": "Figure 4: Experiment on Adult dataset: risk convergence, unfairness convergence and comparison with ADW.", "description": "This figure displays the results of the experiment conducted on the Adult dataset. It shows the convergence of risk and unfairness for the proposed DP-postprocessing method and compares its performance to the ADW method (with and without unlabeled data) and the base model. The convergence is shown for an unfairness threshold of ε = (2⁻⁸, 2⁻⁸).", "section": "Numerical illustration"}, {"figure_path": "UtbjD5LGnC/figures/figures_29_1.jpg", "caption": "Figure 5: The distributions of the (scaled) predictions of the fair and base models.", "description": "This figure displays the distributions of predictions from both the fair model (left panel) and the base model (right panel), categorized by the values of sensitive attribute *S*.  The x-axis represents the scaled predictions, and the y-axis represents the density.  The purpose is to visually demonstrate the impact of the proposed fair post-processing method.  The comparison highlights how the fair model's predictions are more evenly distributed across different groups (defined by *S*), reducing bias compared to the base model.", "section": "Additional experiments on a synthetic dataset"}]