[{"figure_path": "Twqa0GFMGX/figures/figures_2_1.jpg", "caption": "Figure 1: Proposed IPGP model for inferring latent factors and factor loadings from dynamic ordinal data. Input ordinal observations across indicators are modeled as ordinal transformations of latent dynamic Gaussian processes with individualized RBF kernels and loading matrices.", "description": "This figure illustrates the architecture of the Idiographic Personality Gaussian Process (IPGP) model.  The model takes dynamic ordinal data as input, representing responses to multiple survey items across multiple time points for each individual.  It uses a multi-task Gaussian process framework to model the latent factors underlying these responses.  The model includes both shared (nomothetic) and individual (idiographic) components. The shared component is represented by a population factor loading matrix (Wpop) and covariance matrix (Kpop). The individual component is represented by an individualized loading matrix (Z(i)) and RBF kernel for temporal dynamics (K(i)time). These components are combined to produce a unit-specific covariance matrix, which is then used to infer latent factors (x(t)) that are transformed into the observed ordinal data (y(i)).", "section": "3 Methodology"}, {"figure_path": "Twqa0GFMGX/figures/figures_6_1.jpg", "caption": "Figure 2: Illustration of raw correlation matrix (left) and our estimated Big Five loading matrix (right). Both correlation matrices display a block pattern, where estimated interpersonal variation show strong correlation between questions within the same factor of the Big Five personalities and weak correlation across different factors. Besides, questions corresponding negative emotionality show minor negative correlation with those corresponding to extraversion and conscientiousness, suggesting trait-by-trait interaction effects.", "description": "This figure shows a comparison of two correlation matrices: the raw correlation matrix from the data (left) and the estimated Big Five loading matrix from the IPGP model (right). Both matrices share a block pattern, indicating strong correlations within Big Five personality factors and weak correlations between them.  A notable detail is the slight negative correlation observed between questions related to negative emotionality and those related to extraversion and conscientiousness, suggesting the presence of interactions between traits.", "section": "4.2 Cross-sectional factor analysis"}, {"figure_path": "Twqa0GFMGX/figures/figures_7_1.jpg", "caption": "Figure 1: Proposed IPGP model for inferring latent factors and factor loadings from dynamic ordinal data. Input ordinal observations across indicators are modeled as ordinal transformations of latent dynamic Gaussian processes with individualized RBF kernels and loading matrices.", "description": "This figure illustrates the architecture of the Idiographic Personality Gaussian Process (IPGP) model.  The model takes dynamic ordinal data (e.g., from repeated Likert-scale surveys) as input.  It infers latent factors representing underlying personality traits. These latent factors are modeled as dynamic Gaussian processes with individual-specific Radial Basis Function (RBF) kernels, allowing for personalized modeling of trait dynamics.  Individualized factor loadings (weights) connect the latent factors to the observed ordinal responses. The model incorporates both population-level shared structure (through population-level factor loadings) and individual-specific deviations (through individualized loadings and kernels).", "section": "3 Methodology"}, {"figure_path": "Twqa0GFMGX/figures/figures_8_1.jpg", "caption": "Figure 4: Predictive accuracy and log lik of IPGP and IPGP-NOM for the forecasting task and leave-one-trait-out cross-validation task.", "description": "This figure compares the performance of IPGP (idiographic personality Gaussian process) and IPGP-NOM (a version without idiographic components) on two prediction tasks: forecasting and leave-one-trait-out cross-validation using longitudinal data.  The top panels show predictive accuracy for both methods across 5 forecast days and for each of the Big Five personality traits in the leave-one-out task. The bottom panels display the corresponding predictive log-likelihoods for the same tasks. The results highlight IPGP's superior performance across both prediction tasks and for almost all traits, emphasizing the importance of idiographic components in accurate predictions.", "section": "4.3 Longnitudinal Pilot Study"}, {"figure_path": "Twqa0GFMGX/figures/figures_15_1.jpg", "caption": "Figure 1: Proposed IPGP model for inferring latent factors and factor loadings from dynamic ordinal data. Input ordinal observations across indicators are modeled as ordinal transformations of latent dynamic Gaussian processes with individualized RBF kernels and loading matrices.", "description": "This figure illustrates the architecture of the Idiographic Personality Gaussian Process (IPGP) model.  It shows how the model takes ordinal (categorical) data as input, representing responses from a psychological survey given repeatedly over time. The IPGP model uses a multi-task Gaussian process to learn both a common latent structure (shared across individuals) and individual-specific deviations. The model infers latent factors (x(t)) representing underlying personality traits,  individualized factor loadings (W(i)), and maps them to the observed ordinal responses (y(i)). The use of RBF (Radial Basis Function) kernels allows for modeling temporal dynamics in personality traits. The model is designed to capture both nomothetic (population-level) and idiographic (individual-level) aspects of personality.", "section": "3 Methodology"}]