[{"figure_path": "YIOvR40hSo/figures/figures_0_1.jpg", "caption": "Figure 1: DiffPano allows scalable and consistent panorama generation (i.e., room switching) with given unseen text descriptions and camera poses. Each column represents the generated multi-view panoramas, switching from one room to another.", "description": "This figure showcases the DiffPano model's ability to generate consistent and scalable 360° panoramas from text descriptions and camera poses. Each column displays a sequence of generated multi-view panoramas, demonstrating the model's capacity to seamlessly transition between different rooms (scenes) while maintaining visual coherence.  The text descriptions used to generate each set of panoramas are displayed above their corresponding image sets.", "section": "Abstract"}, {"figure_path": "YIOvR40hSo/figures/figures_3_1.jpg", "caption": "Figure 1: DiffPano allows scalable and consistent panorama generation (i.e., room switching) with given unseen text descriptions and camera poses. Each column represents the generated multi-view panoramas, switching from one room to another.", "description": "This figure showcases DiffPano's ability to generate consistent and scalable panoramic images from textual descriptions and camera poses. Each column demonstrates the generation of a multi-view panorama of a different room, highlighting the model's ability to seamlessly transition between rooms based on textual prompts and camera positions.", "section": "Abstract"}, {"figure_path": "YIOvR40hSo/figures/figures_4_1.jpg", "caption": "Figure 3: DiffPano Framework. The DiffPano framework consists of a single-view text-to-panorama diffusion model and a spherical epipolar-aware multi-view diffusion model. It can support text to single-view panorama or multi-view panorama generation.", "description": "This figure illustrates the DiffPano framework, which is composed of two main models: a single-view text-to-panorama diffusion model and a spherical epipolar-aware multi-view diffusion model.  The single-view model takes text prompts as input and generates a single panoramic image. The multi-view model builds upon the single-view model, incorporating spherical epipolar constraints to ensure consistency across multiple viewpoints generated from the same text prompt.  The framework is designed for both single-view and multi-view panorama generation.  Input text prompts and camera poses are processed through the models to output generated panoramic images, which can then be used in various applications.", "section": "4 Proposed Method: DiffPano"}, {"figure_path": "YIOvR40hSo/figures/figures_7_1.jpg", "caption": "Figure 1: DiffPano allows scalable and consistent panorama generation (i.e., room switching) with given unseen text descriptions and camera poses. Each column represents the generated multi-view panoramas, switching from one room to another.", "description": "This figure showcases the capabilities of DiffPano to generate consistent and scalable panoramic images from text descriptions. Each column shows a series of generated 360° panoramas, demonstrating the model's ability to seamlessly transition between different rooms (scene switching). The text descriptions guiding the generation are also provided. The figure highlights the model's ability to create realistic and coherent multi-view panoramas from text prompts alone.", "section": "Abstract"}, {"figure_path": "YIOvR40hSo/figures/figures_8_1.jpg", "caption": "Figure 5: Comparisons with MVDream. DiffPano can generate more consistent multi-view panoramas. \"MVDream×2\" denotes MVDream is trained with twice iteration number relative to our method.", "description": "This figure compares the results of DiffPano with those of MVDream, a baseline method for multi-view image generation.  The top row shows the results from MVDream trained for a standard amount of time. The middle row shows the results from MVDream trained for twice the amount of time as DiffPano. The bottom row shows the results from DiffPano. Each row displays a sequence of generated multi-view panoramas from different viewpoints of the same scene, demonstrating the visual consistency of each model's output.  The figure highlights DiffPano's superior ability to maintain consistency across multiple viewpoints, even when compared to MVDream trained for a longer duration. The text prompt used for generation is also provided, further contextualizing the generated image sequences.", "section": "5.2 Multi-View Panorama Generation"}, {"figure_path": "YIOvR40hSo/figures/figures_17_1.jpg", "caption": "Figure 1: DiffPano allows scalable and consistent panorama generation (i.e. room switching) with given unseen text descriptions and camera poses. Each column represents the generated multi-view panoramas, switching from one room to another.", "description": "This figure demonstrates the DiffPano model's ability to generate consistent panoramic images of different rooms based on textual descriptions and camera poses. Each column shows a sequence of generated panoramas, simulating the experience of moving from one room to another within a virtual environment. The model successfully captures the details specified in the text prompts and ensures smooth transitions between different views.", "section": "Abstract"}, {"figure_path": "YIOvR40hSo/figures/figures_17_2.jpg", "caption": "Figure 1: DiffPano allows scalable and consistent panorama generation (i.e., room switching) with given unseen text descriptions and camera poses. Each column represents the generated multi-view panoramas, switching from one room to another.", "description": "This figure showcases the capabilities of the DiffPano model.  Given a text description (examples provided in the image), DiffPano generates a series of panoramic images from multiple viewpoints (a multi-view panorama) representing different rooms. Each column shows the same room's multi-view panoramas, while switching between columns demonstrates DiffPano's ability to consistently generate panoramas for different rooms based on the descriptions provided. This highlights the model's scalability and consistency in handling unseen text descriptions and camera poses.", "section": "1 Introduction"}, {"figure_path": "YIOvR40hSo/figures/figures_19_1.jpg", "caption": "Figure 1: DiffPano allows scalable and consistent panorama generation (i.e. room switching) with given unseen text descriptions and camera poses. Each column represents the generated multi-view panoramas, switching from one room to another.", "description": "This figure showcases the capability of DiffPano to generate consistent and scalable panoramic images from text descriptions and camera poses. Each column displays a sequence of generated multi-view panoramas, demonstrating the ability of the model to smoothly transition between different rooms based on the provided text input. This highlights DiffPano's unique ability to manage room switching seamlessly within a consistent panoramic environment.", "section": "Introduction"}, {"figure_path": "YIOvR40hSo/figures/figures_19_2.jpg", "caption": "Figure 5: Comparisons with MVDream. DiffPano can generate more consistent multi-view panoramas. \"MVDream × 2\" denotes MVDream is trained with twice iteration number relative to our method.", "description": "This figure compares the multi-view panorama generation results of DiffPano with those of MVDream, a baseline model.  It shows that DiffPano produces more consistent multi-view panoramas, even when compared to MVDream trained with twice the number of iterations. The consistency is visually apparent in the generated images, demonstrating DiffPano's superior performance in this aspect.", "section": "5 Experiment"}, {"figure_path": "YIOvR40hSo/figures/figures_20_1.jpg", "caption": "Figure 1: DiffPano allows scalable and consistent panorama generation (i.e., room switching) with given unseen text descriptions and camera poses. Each column represents the generated multi-view panoramas, switching from one room to another.", "description": "This figure demonstrates DiffPano's ability to generate consistent and scalable panoramic images from textual descriptions and camera poses.  Each column shows a sequence of generated panoramas, representing a change of scene (room switching).  This showcases the model's ability to maintain consistency across multiple viewpoints while generating diverse and realistic environments.", "section": "Introduction"}, {"figure_path": "YIOvR40hSo/figures/figures_20_2.jpg", "caption": "Figure 1: DiffPano allows scalable and consistent panorama generation (i.e., room switching) with given unseen text descriptions and camera poses. Each column represents the generated multi-view panoramas, switching from one room to another.", "description": "This figure showcases the capabilities of DiffPano, a novel text-driven panoramic generation framework.  Given unseen text descriptions (examples provided above each set of images), DiffPano generates a series of consistent and scalable 360° panoramas.  Each column displays multiple viewpoints of the same scene, demonstrating the ability of the model to generate coherent panoramas from varied perspectives within the same space, as well as transition smoothly between different scenes (rooms) described by different text prompts.", "section": "Abstract"}, {"figure_path": "YIOvR40hSo/figures/figures_21_1.jpg", "caption": "Figure 1: DiffPano allows scalable and consistent panorama generation (i.e., room switching) with given unseen text descriptions and camera poses. Each column represents the generated multi-view panoramas, switching from one room to another.", "description": "This figure showcases the ability of the DiffPano model to generate consistent and scalable 360° panoramas based on textual descriptions and camera poses. Each column displays a sequence of generated multi-view panoramas, demonstrating the model's capacity to seamlessly transition between different rooms, showcasing the consistency and scalability of the panorama generation process.", "section": "Introduction"}, {"figure_path": "YIOvR40hSo/figures/figures_21_2.jpg", "caption": "Figure 1: DiffPano allows scalable and consistent panorama generation (i.e., room switching) with given unseen text descriptions and camera poses. Each column represents the generated multi-view panoramas, switching from one room to another.", "description": "This figure showcases the DiffPano model's ability to generate consistent and scalable 360° panoramas from text descriptions. Each column displays a sequence of generated panoramas, demonstrating the model's capacity to seamlessly transition between different rooms while maintaining visual consistency. This highlights DiffPano's key advantage of generating multi-view panoramas for room switching, showcasing its scalability and consistency in handling unseen text descriptions and camera poses.", "section": "Introduction"}]