[{"figure_path": "G2dYZJO4BE/figures/figures_3_1.jpg", "caption": "Figure 1: (Left) Causal graph corresponding to the SCM in Equation (3). Observed variables (Xe, Ye) are indicated by solid circles while unobserved variables, namely the additive shift Ae and confounders H, are shown in dashed circles. Note that here, bidirectional edges indicate that the relationship between two nodes can be in either direction.", "description": "This figure shows the causal graph and the corresponding structural causal model (SCM) equations for the data generating process.  The SCM describes how observed variables (covariates Xe and target variable Ye) are generated from unobserved variables: additive environmental shifts Ae and confounders H.  The solid circles represent observed variables, while dashed circles represent unobserved variables. Bidirectional arrows indicate that the relationship between two nodes can be in either direction.  This model is used to represent the data and the additive environment shifts that are the basis of the research.", "section": "2.1 Data distribution and a model of additive environmental shifts"}, {"figure_path": "G2dYZJO4BE/figures/figures_5_1.jpg", "caption": "Figure 2: Relationship between identifiability of the model parameters and identifiability of the robust risk. (a) The classical scenario where the test shift directions Mseen are contained in the span of training shifts so that the robust risk and thus its minimizer are point-identified. (b) The more general scenario of this paper, where the shift directions during test time Mgen can contain new shift directions and the robust risk can only be set-identified.", "description": "This figure illustrates the difference between identifiable and partially identifiable robustness settings. In the identifiable setting (a), the test shift directions are fully contained within the span of the training shift directions, resulting in the robust risk being point-identified.  However, in the partially identifiable setting (b), test-time shifts introduce new directions, making the robust risk only set-identifiable.  The figure shows how the identifiable robust risk is a subset of all possible true robust risks, highlighting the uncertainty introduced by partially identifiable shifts.", "section": "Partially identifiable robustness framework"}, {"figure_path": "G2dYZJO4BE/figures/figures_8_1.jpg", "caption": "Figure 3: Test error under a partially unidentified distribution shift Atest of the baseline estimators BOLS, Banchor (using the \\\"correct\\\" γ) for finite robustness and the identifiable robust predictor in (mean-shifted) multi-environment finite-sample experiments in the classical identified setting (left) and the partially identified robustness setting (right). The details of the experimental setting can be found in Appendix E.", "description": "The figure shows the test error (MSE) of different methods under partially identified distribution shift. In the classical identified setting (left panel), the test shift is only in the directions already seen during training; while in partially identified setting (right panel), the test shift includes new directions not seen during training.  The plot compares the identifiable robust predictor with existing methods like OLS and anchor regression, demonstrating the impact of unseen directions on the test error.", "section": "3.3 Experimental results"}, {"figure_path": "G2dYZJO4BE/figures/figures_9_1.jpg", "caption": "Figure 3: Test error under a partially unidentified distribution shift Atest of the baseline estimators BOLS, Banchor (using the \\\"correct\\\" γ) for finite robustness and the identifiable robust predictor in (mean-shifted) multi-environment finite-sample experiments in the classical identified setting (left) and the partially identified robustness setting (right). The details of the experimental setting can be found in Appendix E.", "description": "This figure compares the performance of several methods (identifiable robust predictor, anchor regression, OLS) on synthetic data under two different settings: one with only previously seen shifts during testing and the other with both previously seen and unseen shifts. The results show that in the presence of unseen test-time shifts, the identifiable robust predictor consistently outperforms the other methods.", "section": "3.3 Experimental results"}, {"figure_path": "G2dYZJO4BE/figures/figures_24_1.jpg", "caption": "Figure 3: Test error under a partially unidentified distribution shift Atest of the baseline estimators BOLS, Banchor (using the \\\"correct\\\" γ) for finite robustness and the identifiable robust predictor in (mean-shifted) multi-environment finite-sample experiments in the classical identified setting (left) and the partially identified robustness setting (right). The details of the experimental setting can be found in Appendix E.", "description": "This figure compares the performance of three methods (OLS, Anchor regression, and identifiable robust predictor) under two different settings: one where test data shifts are within the span of training shifts, and another where the test data contains unseen shifts. The left panel shows results for the case with only seen shifts, while the right panel shows results for the case with both seen and unseen shifts.  The figure demonstrates that the identifiable robust predictor outperforms the other methods when there are unseen shifts, confirming the theoretical results of the paper.", "section": "3.3 Experimental results"}]