[{"figure_path": "7aFEqIb1dp/tables/tables_8_1.jpg", "caption": "Table 1: Reconstruction results on Noise-free measurements. PSNR (dB) (left entry) and SSIM (right entry) of different algorithms. Best results are in bold, second-best results are underlined.", "description": "This table presents a comparison of different algorithms for snapshot compressive imaging (SCI) reconstruction on noise-free measurements.  It shows the Peak Signal-to-Noise Ratio (PSNR) and Structural Similarity Index (SSIM) for each algorithm across various datasets (Kobe, Traffic, Runner, Drop, Crash, Aerial). The best and second-best results are highlighted for easy comparison.", "section": "5.1 Reconstruction results for video SCI"}, {"figure_path": "7aFEqIb1dp/tables/tables_8_2.jpg", "caption": "Table 2: Reconstruction Results on Noisy Measurements. PSNR (dB) (left entry) and SSIM (right entry) of different algorithms. Best results are highlighted in bold, second-best results are underlined.", "description": "This table presents the reconstruction results on noisy measurements for several algorithms, including GAP-TV, FFDNet, FastDVDNet, PnP-DIP, SCI-BDVP (E2E), and SCI-BDVP (GD).  The results are shown for different noise levels (σ = 10, 25, 50) and for several video datasets (Kobe, Traffic, Runner, Drop, Crash, Aerial).  PSNR (Peak Signal-to-Noise Ratio) and SSIM (Structural Similarity Index) are used as evaluation metrics. The best and second-best results for each dataset and noise level are highlighted in bold and underlined, respectively.", "section": "5.1 Reconstruction results for video SCI"}, {"figure_path": "7aFEqIb1dp/tables/tables_9_1.jpg", "caption": "Table 3: Time complexity of our proposed SCI-BDVP was evaluated on various patch sizes (64, 128, 256) of video blocks, using a standard 1000 DVP iterations for training.", "description": "This table shows the time it takes to train the SCI-BDVP model for different patch sizes.  The time increases as the patch size decreases because more networks need to be trained.", "section": "5.2 Mask optimization"}, {"figure_path": "7aFEqIb1dp/tables/tables_21_1.jpg", "caption": "Table 4: Number of inner and outer iterations for training SCI-BDVP for different datasets and different estimates.", "description": "This table shows the number of inner and outer iterations used for training the SCI-BDVP model for different datasets (Kobe, Traffic, Runner, Drop, Crash, Aerial) and for different patch sizes (64, 128, 256 pixels).  It also differentiates between the training for noise-free and noisy measurements. The inner iterations represent iterations within each patch size for DIP training, while the outer iterations represent the number of times the overall PGD optimization is performed.", "section": "5 Experiments"}, {"figure_path": "7aFEqIb1dp/tables/tables_21_2.jpg", "caption": "Table 5: Time complexity over different methods on one 8-frame benchmark video block.", "description": "This table compares the computational time complexity of different methods (PnP-DIP, Factorized-DVP, Simple-DVP(E2E), and SCI-BDVP) for processing a single 8-frame video block.  The results are categorized by whether noise is present in the measurement.", "section": "5 Experiments"}, {"figure_path": "7aFEqIb1dp/tables/tables_23_1.jpg", "caption": "Table 6: Detailed mask optimization effect on reconstruction with SCI-BDVP. PSNR (dB) (left entry) and SSIM (right entry) of the reconstruction results on different videos. (Reg.) represent reconstruction on using fixed regular binary mask, Dij ~ Bern(0.5). (OPT.) represents model tested on fixed optimized mask.", "description": "This table shows the impact of mask optimization on the reconstruction performance of SCI-BDVP for different videos and noise levels.  It compares the PSNR and SSIM values obtained using a fixed regular binary mask (Bern(0.5)) against those obtained using an optimized mask.  The results are broken down by noise level (σ = 0, 10, 25, 50) and whether the regular or optimized mask was used.", "section": "5.1 Reconstruction results for video SCI"}]