[{"figure_path": "S4YRCLbUK1/tables/tables_2_1.jpg", "caption": "Table 1: Comparison of benchmark datasets that can be used to evaluate T2I faithfulness. Per equiv pref means the average number of images for each prompt that are assigned the same preference or correctness score. Bold numbers are best overall, italic are best of the T2I metric benchmarks.", "description": "This table compares different benchmark datasets used for evaluating text-to-image (T2I) faithfulness metrics.  It shows the total number of images, the average number of images per prompt, the average number of images per prompt with equivalent preference scores, the total number of image comparisons possible, and whether or not the dataset includes ad-hoc T2I errors. The table categorizes the datasets into benchmarks for captioning models, image retrieval/matching models, and T2I faithfulness metrics, highlighting the characteristics of each dataset type and indicating which ones are particularly suitable for evaluating T2I metrics.", "section": "1 Introduction"}, {"figure_path": "S4YRCLbUK1/tables/tables_6_1.jpg", "caption": "Table 1: Comparison of benchmark datasets that can be used to evaluate T2I faithfulness. Per equiv pref means the average number of images for each prompt that are assigned the same preference or correctness score. Bold numbers are best overall, italic are best of the T2I metric benchmarks.", "description": "This table compares different benchmark datasets used for evaluating text-to-image (T2I) faithfulness metrics.  It lists each dataset, the total number of images, the average number of images per prompt, the number of images per equivalent preference score (indicating the average number of images judged similarly), the total number of image comparisons possible, and whether the dataset uses ad-hoc T2I errors. The table helps to illustrate the relative sizes and characteristics of different datasets, highlighting the unique properties of the proposed T2IScoreScore dataset.", "section": "1 Introduction"}]