[{"figure_path": "3gZBGBglBf/figures/figures_2_1.jpg", "caption": "Figure 1: Overestimated decoding performance in BCI works. (a) Continuous EEG data in a certain experimental condition (with the same class label) are split into training and test sets for decoder training and evaluation. (b) With the test EEG sample input, the decoder gives output in the forms of classification, retrieval, and generation. (c) Decoders may use both domain features or class-related features for decoding.", "description": "This figure illustrates the pitfalls of overestimated decoding performance in Brain-Computer Interfaces (BCIs).  Panel (a) shows how continuous EEG data with the same class label are typically split into training and testing sets, a practice that can lead to inflated accuracy. Panel (b) depicts the three main tasks in BCIs: classification, retrieval, and generation. Panel (c) explains that models may mistakenly learn to rely on domain-specific features (temporal autocorrelations) rather than genuine class-related features, leading to inaccurate estimations of decoding performance. The figure highlights that a decoder can achieve high accuracy by exploiting the temporal autocorrelation in the data, even in the absence of meaningful class distinctions.", "section": "2 Method"}, {"figure_path": "3gZBGBglBf/figures/figures_6_1.jpg", "caption": "Figure 1: Overestimated decoding performance in BCI works. (a) Continuous EEG data in a certain experimental condition (with the same class label) are split into training and test sets for decoder training and evaluation. (b) With the test EEG sample input, the decoder gives output in the forms of classification, retrieval, and generation. (c) Decoders may use both domain features or class-related features for decoding.", "description": "This figure illustrates the pitfalls of overestimated decoding performance in brain-computer interface (BCI) works.  Panel (a) shows how continuous EEG data with the same class label are incorrectly split into training and testing sets. Panel (b) depicts the typical BCI decoding process, where a decoder receives an EEG sample as input and produces an output (e.g., classification, generation, or retrieval). Panel (c) highlights the problem, explaining that instead of learning class-related features, the decoders may learn both class-related and domain features. This reliance on domain features causes overestimation of decoding accuracy.", "section": "2.1 Problem Formulation"}, {"figure_path": "3gZBGBglBf/figures/figures_7_1.jpg", "caption": "Figure 3: EEG-generated image from a typical watermelon subject, where the first column of each panel represents the real images \"watched\" by the watermelon subject, and the following five columns show the images generated by the model.", "description": "This figure shows the results of image generation from EEG data.  The leftmost column of each row displays the actual images shown to the watermelon. The following five columns show the images generated by the model based on the EEG data.  The figure demonstrates that the model could successfully generate images that are semantically similar to the real images.", "section": "3.2 Joint training and image generation"}, {"figure_path": "3gZBGBglBf/figures/figures_13_1.jpg", "caption": "Figure 4: Photos of watermelons used in the experiment. Each watermelon's ID is marked on the watermelon, with IDs ranging from 1 to 10.", "description": "This figure shows ten watermelons, each labeled with an ID number from 1 to 10. Each watermelon has an EEG cap placed on it, suggesting the experiment involved collecting EEG data from watermelons to control for neural activity. The setup was used to study the potential of high decoding accuracy being caused by temporal autocorrelations in EEG data, rather than stimulus-driven neural responses.", "section": "A.1 Photography of the watermelon subject"}, {"figure_path": "3gZBGBglBf/figures/figures_17_1.jpg", "caption": "Figure 1: Overestimated decoding performance in BCI works. (a) Continuous EEG data in a certain experimental condition (with the same class label) are split into training and test sets for decoder training and evaluation. (b) With the test EEG sample input, the decoder gives output in the forms of classification, retrieval, and generation. (c) Decoders may use both domain features or class-related features for decoding.", "description": "This figure illustrates the pitfall of overestimated decoding performance in brain-computer interface (BCI) works.  Panel (a) shows how continuous EEG data with the same class label are improperly split into training and testing sets. This leads to the model learning spurious correlations between temporal autocorrelation in the EEG and the label, rather than true class-related features. Panel (b) displays the different decoding tasks (classification, retrieval, and generation) performed using the model trained on this data. Panel (c) highlights the difference between ideal (learning class-related features) and actual (learning both class-related and domain features) learning scenarios, with the worst-case scenario relying solely on domain features.", "section": "2.1 Problem Formulation"}]