[{"figure_path": "5HQhYiGnYb/tables/tables_6_1.jpg", "caption": "Table 1 Comparison of generated samples’ block maxima distribution metrics and predictive score using the various methods. Bold and Underlined entries denote the best and second-best result", "description": "This table compares the performance of the proposed FIDE model against several baseline methods across five different datasets (AR1, Stock, Energy, Temperature, ECG).  The comparison uses several metrics to evaluate the models' ability to capture both the overall data distribution and the distribution of block maxima values.  These metrics include the Jensen-Shannon (JS) divergence, Kullback-Leibler (KL) divergence, Continuous Ranked Probability Score (CRPS), and Predictive Score.  The best and second-best performing models for each metric and dataset are highlighted.", "section": "5 Experimental Evaluation"}, {"figure_path": "5HQhYiGnYb/tables/tables_7_1.jpg", "caption": "Table 1 Comparison of generated samples’ block maxima distribution metrics and predictive score using the various methods. Bold and Underlined entries denote the best and second-best result", "description": "This table compares the performance of the proposed FIDE model against several other generative models for time series data.  It evaluates how well each model captures the distribution of block maxima values (extreme values) and also measures the predictive accuracy of each model using a separate time series forecasting model.  The metrics used include the Jensen-Shannon (JS) divergence, Kullback-Leibler (KL) divergence, Continuous Ranked Probability Score (CRPS), and Predictive Score.  The best and second-best results for each metric are highlighted.", "section": "5 Experimental Evaluation"}, {"figure_path": "5HQhYiGnYb/tables/tables_8_1.jpg", "caption": "Table 1 Comparison of generated samples' block maxima distribution metrics and predictive score using the various methods. Bold and Underlined entries denote the best and second-best result", "description": "This table presents a comparison of different time series generation methods based on several metrics.  These metrics evaluate how well each method captures the distribution of block maxima (extreme values) and how accurately it predicts future values in the time series.  The methods compared include various GAN, VAE, Flow, and Diffusion-based models. The table shows the performance of each method on five different datasets: AR1 (synthetic), Stock (financial), Energy (appliance energy), Temperature (daily minimum), and ECG (medical).  The best and second-best performing methods for each dataset and metric are highlighted.", "section": "5 Experimental Evaluation"}, {"figure_path": "5HQhYiGnYb/tables/tables_9_1.jpg", "caption": "Table 1 Comparison of generated samples' block maxima distribution metrics and predictive score using the various methods. Bold and Underlined entries denote the best and second-best result", "description": "This table presents the quantitative comparison of the proposed FIDE model against various baseline methods across multiple datasets (AR1, Stock, Energy, Temperature, ECG) and evaluation metrics. The metrics include Jensen-Shannon Divergence, KL Divergence, CRPS (Continuous Ranked Probability Score), and Predictive Score. The best and second-best results for each metric and dataset are highlighted in bold and underlined, respectively.  The table offers a comprehensive overview of the FIDE model's performance relative to other generative models in capturing block maxima distribution and predicting future time series values.", "section": "5 Experimental Evaluation"}, {"figure_path": "5HQhYiGnYb/tables/tables_17_1.jpg", "caption": "Table 1 Comparison of generated samples' block maxima distribution metrics and predictive score using the various methods. Bold and Underlined entries denote the best and second-best result", "description": "This table presents the quantitative comparison of the proposed FIDE model against several state-of-the-art baselines across five different datasets.  The evaluation is performed using four metrics: Jensen-Shannon Divergence, KL Divergence, CRPS (Continuous Rank Probability Score), and Predictive Score. The metrics assess how well each model captures the block maxima distribution and its predictive performance.  Bold and underlined values highlight the best and second-best performing models for each metric and dataset.", "section": "5 Experimental Evaluation"}]