[{"figure_path": "0KvYLaTBTE/figures/figures_2_1.jpg", "caption": "Figure 1: Left: Overview of Latent Plan Transformer (LPT). z ∈ Rd is the latent vector. The prior distribution of z is a neural transformation of zo, i.e., z = Ua(zo), zo ~ N(0, Ia). Given z, τ and y are independent. ps(T|z) is the trajectory generator. py(y|z) is the return predictor. Right: Illustration of trajectory generator ps(T|z).", "description": "The figure illustrates the Latent Plan Transformer (LPT) model. The left panel shows the overall architecture, highlighting the latent variable z connecting the trajectory generator and return predictor. The latent variable is generated from a prior distribution (z = Ua(zo)). Given z, the trajectory and return are conditionally independent. The right panel focuses on the trajectory generator, illustrating how it uses a causal transformer and cross-attention with z to generate the trajectory sequence.", "section": "3 Latent Plan Transformer (LPT)"}, {"figure_path": "0KvYLaTBTE/figures/figures_8_1.jpg", "caption": "Figure 2: (a) Maze2D-medium environment (b) Maze2D-large environment. Left panels show example trajectories from the training set and right panels show LPT generations. Yellow stars represent the goal states.", "description": "This figure shows the comparison of trajectories generated by LPT and those from the training set in two different maze environments, Maze2D-medium and Maze2D-large.  The left panels display example trajectories from the original training data, illustrating their suboptimal nature and frequent failures to reach the goal. In contrast, the right panels showcase trajectories generated by the Latent Plan Transformer (LPT) model, demonstrating its ability to generate more efficient and successful paths to the goal state.  The yellow stars in each maze mark the location of the goal.", "section": "6.3 Trajectory stitching"}, {"figure_path": "0KvYLaTBTE/figures/figures_8_2.jpg", "caption": "Figure 3: t-SNE plot of latent variables in the Maze2D-medium. Left: Training z0 from aggregated posterior Ep(T,y)[pθ(z0|T,Y)]. Testing z0 from pθ(z0|y), disjoint from training population. Right: Distribution of z = Ua(z0).", "description": "This figure visualizes the latent variable z in the Maze2D-medium environment. The left panel shows the training z0 samples from the aggregated posterior, while the right panel shows the distribution of z, which is transformed from z0. The colors differentiate between training and testing data.  It illustrates the model's ability to generate new trajectories that are similar to those in the training data, yet also capable of exploring unseen regions of the latent space, indicating the model's generalization capability.", "section": "6.3 Trajectory stitching"}, {"figure_path": "0KvYLaTBTE/figures/figures_14_1.jpg", "caption": "Figure 4: Trajectory length and return distribution in dataset Antmaze-large-diverse", "description": "This figure shows the distribution of trajectory lengths and returns in the Antmaze-large-diverse dataset.  The x-axis represents the length of the trajectory, and the y-axis represents the density. Two distributions are shown, one for trajectories with a return of 0 and another for trajectories with a return of 1. The distribution for trajectories with a return of 0 is heavily concentrated near a length of 1, while the distribution for trajectories with a return of 1 is concentrated around a length of 1000. This indicates a strong correlation between trajectory length and return in this dataset, with longer trajectories more likely to result in a successful return.", "section": "A.3 Discussion on data quality of Antmaze medium and large"}, {"figure_path": "0KvYLaTBTE/figures/figures_14_2.jpg", "caption": "Figure 5: Trajectory length and return distribution in dataset Maze2D-Large", "description": "This figure shows the distribution of trajectory lengths and returns for the Maze2D-Large dataset.  The top panel is a histogram of the returns, showing that most trajectories have a relatively low return, but there are some trajectories with much higher returns. The bottom panel is a histogram of the trajectory lengths, showing that the trajectory lengths are approximately normally distributed, with a mean around 250 steps.  The combination of the two panels shows the relationship between trajectory length and return, with longer trajectories often yielding higher returns.", "section": "6.3 Trajectory stitching"}]