{"references": [{"fullname_first_author": "Sara Ahmadian", "paper_title": "Better guarantees for k-means and Euclidean k-median by primal-dual algorithms", "publication_date": "2020-01-01", "reason": "This paper provides improved approximation guarantees for k-means and Euclidean k-median, which are fundamental clustering problems related to the fair-range clustering problems discussed in the main paper."}, {"fullname_first_author": "Nir Ailon", "paper_title": "The fast Johnson-Lindenstrauss transform and approximate nearest neighbors", "publication_date": "2009-01-01", "reason": "The fast Johnson-Lindenstrauss transform is a dimensionality reduction technique used in the main paper's data reduction method, making this a crucial reference for understanding the algorithm's efficiency."}, {"fullname_first_author": "Sayan Bandyapadhyay", "paper_title": "On coresets for fair clustering in metric and Euclidean spaces and their applications", "publication_date": "2021-01-01", "reason": "This paper discusses coresets for fair clustering, a concept directly relevant to the main paper's focus on fair-range clustering, offering insights into approximation techniques and applications."}, {"fullname_first_author": "Vincent Cohen-Addad", "paper_title": "Tight FPT approximations for k-median and k-means", "publication_date": "2019-01-01", "reason": "This paper presents tight fixed-parameter tractable (FPT) approximation algorithms for k-median and k-means, which are foundational to the main paper's approach of developing FPT approximation schemes for fair-range clustering."}, {"fullname_first_author": "Suhas Thejaswi", "paper_title": "Clustering with fair-center representation: Parameterized approximation algorithms and heuristics", "publication_date": "2022-01-01", "reason": "This paper directly addresses fair-range clustering problems, providing the state-of-the-art approximation ratios that the current paper aims to improve upon, making it a key reference for understanding the problem context and existing solutions."}]}