[{"figure_path": "vIP8IWmZlN/tables/tables_7_1.jpg", "caption": "Table 1: Average emergence and vocabulary coverage of all message types.", "description": "This table summarizes the frequency of different message types (non-compositional positional, non-compositional positional reserved, non-compositional integer, compositional integer, and compositional positional) that emerged across multiple runs of the agent communication experiments.  It shows both the percentage of experimental runs where each message type emerged and the percentage of all messages in those runs that belonged to that type. This gives insights into the prevalence and relative importance of different communication strategies used by the agents.", "section": "5.3 Evaluating interpretation validity and accuracy"}, {"figure_path": "vIP8IWmZlN/tables/tables_8_1.jpg", "caption": "Table 2: Accuracy improvements using the NPMI-based dictionary, ± denotes the 1-sigma standard deviation. Non-Compositional Positional refers to messages such as begin or end, Non-Compositional Integer refers to the non-compositional monolithic messages describing both the position and the integer, Compositional-NP refers to messages only containing the identified integer components, and the Compositional-P which refers to messages containing both the identified integer and positional components.", "description": "This table shows the accuracy improvements achieved by using a dictionary created with the NPMI method. The dictionary maps messages to their meanings (e.g., spatial relationships, specific integers). The accuracy is measured for different types of messages: non-compositional positional (referring to positions like \"begin\" or \"end\"), non-compositional integer (referring to a specific integer in a specific position), compositional-NP (only containing identified integer components), and compositional-P (containing both integer and positional components).  The table indicates that using the NPMI-based dictionary significantly improves accuracy, particularly for non-compositional positional messages, suggesting that these messages are interpreted with high accuracy.", "section": "5.3 Evaluating interpretation validity and accuracy"}, {"figure_path": "vIP8IWmZlN/tables/tables_9_1.jpg", "caption": "Table 3: Example dictionary of the agents' messages and their meanings", "description": "This table presents a sample dictionary that maps emergent communication messages to their corresponding meanings in human-interpretable terms.  The messages, represented as integer triplets, were produced by the agents during the experiment.  The dictionary provides a translation, illustrating the correspondence between the symbolic messages generated by the agents and their spatial interpretations based on the context of the observation and position of the target.", "section": "5.3 Evaluating interpretation validity and accuracy"}, {"figure_path": "vIP8IWmZlN/tables/tables_12_1.jpg", "caption": "Table 1: Average emergence and vocabulary coverage of all message types.", "description": "This table presents a summary of the emergence rates and vocabulary coverage for different types of messages used by the agents.  It shows the average percentage of runs where each message type emerged, along with the percentage of the overall vocabulary that each type represents.  The data helps illustrate the prevalence of different communication strategies used by the agents in the experiment.", "section": "5.3 Evaluating interpretation validity and accuracy"}, {"figure_path": "vIP8IWmZlN/tables/tables_12_2.jpg", "caption": "Table 1: Average emergence and vocabulary coverage of all message types.", "description": "This table summarizes the emergence and vocabulary coverage of different message types in the experiments.  It shows the percentage of runs where each message type emerged, along with the percentage of the overall vocabulary that each type represents. Message types are categorized as non-compositional positional (referring to the position of the target integer, e.g., beginning or end of the sequence), non-compositional integer (directly referring to a specific integer), compositional integer (referring to a specific integer using a combination of tokens), and compositional positional (referring to a combination of position and integer information). The table provides insights into how frequently the agents used each type of message and the relative importance of each type in their communication strategy.", "section": "5.3 Evaluating interpretation validity and accuracy"}, {"figure_path": "vIP8IWmZlN/tables/tables_12_3.jpg", "caption": "Table 2: Accuracy improvements using the NPMI-based dictionary, ± denotes the 1-sigma standard deviation. Non-Compositional Positional refers to messages such as begin or end, Non-Compositional Integer refers to the non-compositional monolithic messages describing both the position and the integer, Compositional-NP refers to messages only containing the identified integer components, and the Compositional-P which refers to messages containing both the identified integer and positional components.", "description": "This table shows the accuracy improvements achieved when using a dictionary generated from the NPMI analysis to query the receiver agent.  It breaks down accuracy by message type, including non-compositional positional (e.g., begin, end), non-compositional integer (monolithic messages indicating both position and integer), compositional-NP (only identified integer components), and compositional-P (both integer and positional components).  The results demonstrate the impact of including positional information in the message interpretation process.", "section": "5.3 Evaluating interpretation validity and accuracy"}, {"figure_path": "vIP8IWmZlN/tables/tables_13_1.jpg", "caption": "Table 7: Evaluation of different sequence lengths", "description": "This table presents the results of evaluating the agents' performance on sequences of different lengths.  The \"Training sequence length\" column indicates the length of sequences used during training.  The remaining columns show the average accuracy of the agents when tested on sequences shortened by the specified amounts.  A negative value indicates a shorter testing sequence than the training sequence, demonstrating the model's generalization ability across various sequence lengths.", "section": "5.3 Evaluating interpretation validity and accuracy"}]