[{"figure_path": "kWMVzIdCEn/figures/figures_3_1.jpg", "caption": "Figure 1: Multi-scale Pre-training and Inference Frameworks for Protein Fitness Prediction.", "description": "This figure illustrates the multi-scale pre-training and inference frameworks used for protein fitness prediction.  During pre-training, protein sequences and structures are sampled from a database, with 15% of residue types randomly masked. These sequences are fed into a protein language model (ESM-2-650M). The resulting residue representations are then used to initialize node features in structure and surface encoders. Through message passing on structure and surface graphs, the methods S2F (Sequence-Structure Fitness Model) and S3F (Sequence-Structure-Surface Fitness Model) accurately predict the residue type distribution at each masked position. This distribution is subsequently used for mutation preferences in downstream fitness prediction tasks.", "section": "3 Method"}, {"figure_path": "kWMVzIdCEn/figures/figures_7_1.jpg", "caption": "Figure 2: Results of ESM-2-650M, S2F, S3F, and S3F-MSA for Analyzing Contributions of Sequences, Structures, Surfaces, and Alignments. (a-d) Breakdown performance (Spearman's rank correlation) on assays grouped by function type (a), MSA depth (b), taxon (c), and mutation depth (d). (e-f) Impact of protein structure quality on performance. (e) Breakdown performance on assays with low, medium, and high-quality structures. (f) Results using five groups of AlphaFold2-predicted structures ranked by pLDDT (0 for the highest pLDDT, 4 for the lowest pLDDT). (g) Results on all assays and out-of-distribution assays with low sequence similarity to the pre-training dataset.", "description": "This figure presents a breakdown analysis of the performance of four different methods (ESM-2-650M, S2F, S3F, and S3F-MSA) on protein fitness prediction, categorized by various factors such as function type, MSA depth, taxon, mutation depth, and structure quality.  It demonstrates how incorporating structural and surface information progressively improves prediction accuracy, particularly for assays with high-quality structures and those with complex epistatic interactions.", "section": "4.3 Breakdown Analysis for Multi-Scale Learning"}, {"figure_path": "kWMVzIdCEn/figures/figures_8_1.jpg", "caption": "Figure 3: Case Study on GB1. (a-c) For each pair of mutation sites, we plot the Spearman's rank correlation between the experimental values and model-predicted scores for all 361 mutations: ESM (a), S2F (b), and S3F (c). The epistasis between residues 234-252 and residues 266-282 (in the black rectangle) are better captured by S2F and S3F. (d) Visualization of the predicted structure for GB1. Mutation regions 234-252 and 266-282 are highlighted in red and blue, respectively.", "description": "This figure presents a case study on the IgG-binding domain of protein G (GB1).  It shows heatmaps comparing experimental and predicted mutation effects (Spearman's rank correlation) for different models: ESM, S2F, and S3F.  The heatmaps highlight epistatic interactions, particularly between residues 234-252 and 266-282, which are better captured by S2F and S3F.  A 3D structure visualization of GB1 is also included, highlighting the spatial relationship between these residue regions.", "section": "4.6 Case Study: Epistatic effects in the IgG-binding domain of protein G"}, {"figure_path": "kWMVzIdCEn/figures/figures_14_1.jpg", "caption": "Figure 2: Results of ESM-2-650M, S2F, S3F, and S3F-MSA for Analyzing Contributions of Sequences, Structures, Surfaces, and Alignments. (a-d) Breakdown performance (Spearman's rank correlation) on assays grouped by function type (a), MSA depth (b), taxon (c), and mutation depth (d). (e-f) Impact of protein structure quality on performance. (e) Breakdown performance on assays with low, medium, and high-quality structures. (f) Results using five groups of AlphaFold2-predicted structures ranked by pLDDT (0 for the highest pLDDT, 4 for the lowest pLDDT). (g) Results on all assays and out-of-distribution assays with low sequence similarity to the pre-training dataset.", "description": "This figure presents a breakdown analysis of the performance of four different methods (ESM-2-650M, S2F, S3F, and S3F-MSA) on various protein fitness prediction assays.  Subplots (a-d) show performance categorized by function type, MSA depth, taxon, and mutation depth, respectively.  Subplots (e-f) analyze the impact of protein structure quality on prediction accuracy. Subplot (g) compares performance on in-distribution and out-of-distribution assays.  The results illustrate the incremental improvements achieved by incorporating structural and surface features into the model, as well as its robustness across diverse protein families and data characteristics.", "section": "4.3 Breakdown Analysis for Multi-Scale Learning"}]