[{"figure_path": "Eu0nYM4BPo/figures/figures_5_1.jpg", "caption": "Figure 1: Left: heartbeat generation along backward diffusion steps. Right: EMD between generated ECG distribution and real ECG distribution. EMD vs. test (resp. train) in plain (resp. dotted) line. EMD for DDM with different number of diffusion steps, in blue. DDM for WGAN model in gray. EMD between test and train distributions in red. Error bars correspond to different training batches of size 2864.", "description": "This figure displays two graphs that illustrates the performance of BeatDiff and WGAN in generating ECGs. The left panel shows the ECG generation process along backward diffusion steps. The right panel shows the Earth Mover's Distance (EMD) between the generated and real ECG distributions for different numbers of diffusion steps.  The EMD is used to measure the dissimilarity between probability distributions, lower values indicating greater similarity between the two distributions. This shows that BeatDiff achieves better performance than WGAN across different metrics.", "section": "Experimental validation"}, {"figure_path": "Eu0nYM4BPo/figures/figures_6_1.jpg", "caption": "Figure 2: Left: Example of T-wave prediction (blue) conditioned on Q-wave (red) for different value of RR. Right: QT as a function of RR for 4 patients. QT measured in 100 generated samples (resp. regressed with Fridericia formula) displayed in dots with 95%-CLT bars (resp. curve).", "description": "The figure shows the results of using EM-BeatDiff to predict the T-wave based on the QRS complex and heart rate (RR). The left panel shows example predictions for different RR values, while the right panel shows the relationship between the corrected QT interval (QTc) and RR for four patients.  The QTc was calculated using both EM-BeatDiff generated data and the Fridericia formula. The results demonstrate the ability of EM-BeatDiff to accurately predict the QTc over a range of RR values, which is essential for diagnosing and managing various cardiac conditions.", "section": "3 EM-BeatDiff - conditional heartbeat generation from indirect measurements"}, {"figure_path": "Eu0nYM4BPo/figures/figures_8_1.jpg", "caption": "Figure 3: Illustration of EM-BeatDiff on the denoising, inpaiting and anomaly detection tasks. The red background indicate the parts of the ECG that are observed through y. The red ECGs corresponds to the real ECG and the blue ECGs corresponds to each algorithm reconstructed ECG.", "description": "This figure shows the results of applying EM-BeatDiff and other methods to three tasks: denoising, inpainting, and anomaly detection.  The leftmost panel displays an example of a noisy ECG signal.  The subsequent panels show the results of denoising with EM-BeatDiff and DeScoD, as well as results obtained with the EM algorithm. The central panels show inpainting results with EM-BeatDiff and EkGAN. The final panel shows anomaly detection results for myocardial infarction (MI) and long QT syndrome (LQT). In all cases, the red ECGs are the actual recordings and the blue ECGs are the results from the corresponding method. The red background highlights the parts of the ECG that were available as input for reconstruction.", "section": "Experimental validation"}, {"figure_path": "Eu0nYM4BPo/figures/figures_19_1.jpg", "caption": "Figure 1: Left: heartbeat generation along backward diffusion steps. Right: EMD between generated ECG distribution and real ECG distribution. EMD vs. test (resp. train) in plain (resp. dotted) line. EMD for DDM with different number of diffusion steps, in blue. DDM for WGAN model in gray. EMD between test and train distributions in red. Error bars correspond to different training batches of size 2864.", "description": "This figure shows the results of two experiments. The left panel shows the generation of heartbeats along backward diffusion steps. The right panel shows the Earth Mover's Distance (EMD) between the generated ECG distribution and the real ECG distribution.  The EMD is shown for different numbers of diffusion steps and training sets.  The figure helps evaluate the quality of generated ECGs by measuring the dissimilarity from real ECG data.", "section": "BeatDiff - a generative model for heartbeat morphology"}, {"figure_path": "Eu0nYM4BPo/figures/figures_21_1.jpg", "caption": "Figure 5: Illustration of Fe architecture for a UNet of depth 2.", "description": "This figure shows the architecture of the feature extractor network (Fθ) used in BeatDiff.  It illustrates a U-Net architecture of depth 2, showing how the input (x, representing the noisy ECG beat) is processed through a series of encoder blocks, average pooling layers, a middle block, and decoder blocks to produce the final output, Fθ(x, econd).  The econd vector, combining patient features, time information, and noise level, also feeds into the network.  The figure highlights the skip connections and the use of average pooling to reduce the dimensionality of the data.", "section": "B.1.4 Network Architecture Details"}, {"figure_path": "Eu0nYM4BPo/figures/figures_22_1.jpg", "caption": "Figure 6: Illustration of a UNet block. Inputs: (Up, Down, dout, Attention, Nheads).", "description": "This figure shows the architecture of a UNet block used in the BeatDiff model.  It details the layers and connections within a single block, specifying the use of convolutional layers (Conv), transposed convolutional layers (ConvT), Group Normalization, SiLu activation, dropout, and optional self-attention layers.  The parameters Up and Down control whether the block is in the encoder or decoder path of the UNet, dout defines the number of output channels, and Nheads indicates the number of attention heads used if self-attention is enabled.  The block uses skip connections to improve information flow through the network.", "section": "B.1.4 Network Architecture Details"}, {"figure_path": "Eu0nYM4BPo/figures/figures_24_1.jpg", "caption": "Figure 7: EMD distance between 1000 samples from algorithm 1 with M particles and 1000 samples of algorithm 1 with 105 particles, that is considered the standard samples.", "description": "This figure shows the Earth Mover's Distance (EMD) between 1000 samples generated using the Sequential Monte Carlo (SMC) algorithm with varying numbers of particles (M) and 1000 samples generated with a large number of particles (M=105). The EMD serves as a measure of the dissimilarity between the generated sample distribution and a reference distribution. The plot shows that as the number of particles increases, the EMD decreases, indicating that the generated sample distribution converges towards the reference distribution.  The optimal number of particles M that balances computational cost and accuracy is discussed in the text.", "section": "B.2.2 Artifacts removal parameters"}, {"figure_path": "Eu0nYM4BPo/figures/figures_25_1.jpg", "caption": "Figure 9: Real and generated ECG heart beat with DDM and WGAN.", "description": "This figure compares the performance of the proposed DDM (BeatDiff) model against a WGAN model in generating ECG heartbeats.  It displays six examples of real ECGs alongside their corresponding reconstructions generated by each model. The visual comparison allows for a qualitative assessment of how well each model captures the characteristics of real ECG data, such as the shape and amplitude of various waves and segments.", "section": "Experimental validation"}, {"figure_path": "Eu0nYM4BPo/figures/figures_27_1.jpg", "caption": "Figure 8: Out-of-distribution evaluation. Left. Box-plot of OOD-score for train, test, generated (Gen) and MI heart beats. Right. ROC curves for classification between train/test/gen and MI based on OOD-score.", "description": "The figure presents a comparison of the out-of-distribution (OOD) scores for four different groups: training data, testing data, generated ECG beats from BeatDiff, and real ECG beats from patients diagnosed with myocardial infarction (MI). The left panel shows box plots visualizing the distribution of OOD scores for each group. The right panel displays receiver operating characteristic (ROC) curves, illustrating the performance of a classifier in distinguishing MI ECGs from the other three groups using the OOD score as a feature.", "section": "Additional Results"}, {"figure_path": "Eu0nYM4BPo/figures/figures_28_1.jpg", "caption": "Figure 9: Real and generated ECG heart beat with DDM and WGAN.", "description": "This figure compares the quality of ECG heartbeats generated by different models. The top panel shows six real ECG heartbeats, while the middle and bottom panels display six synthetic ECGs generated using a diffusion model and a Generative Adversarial Network (GAN), respectively. The visualization allows for a visual comparison of the models' performance in generating realistic heartbeats.", "section": "Experimental validation"}, {"figure_path": "Eu0nYM4BPo/figures/figures_29_1.jpg", "caption": "Figure 3: Illustration of EM-BeatDiff on the denoising, inpaiting and anomaly detection tasks. The red background indicate the parts of the ECG that are observed through y. The red ECGs corresponds to the real ECG and the blue ECGs corresponds to each algorithm reconstructed ECG.", "description": "This figure shows a comparison of EM-BeatDiff with other methods (DeScoD and EkGAN) for three different tasks: denoising, inpainting, and anomaly detection. For each task, the leftmost panel shows the noisy or incomplete input ECG, while the subsequent panels illustrate the results obtained by each method. The red lines represent the ground truth ECG, whereas the blue lines depict the ECGs reconstructed by the respective algorithms. Red backgrounds in the ECG segments indicate the portions observed through y during reconstruction.", "section": "Cardiac Anomaly Detection (AD)"}, {"figure_path": "Eu0nYM4BPo/figures/figures_29_2.jpg", "caption": "Figure 9: Real and generated ECG heart beat with DDM and WGAN.", "description": "This figure compares the performance of a diffusion model (DDM) and a Wasserstein Generative Adversarial Network (WGAN) in generating ECG heartbeats. The top panel shows six real ECG beats from the dataset. The middle panel shows six ECG beats generated using the DDM, and the bottom panel shows six ECG beats generated using the WGAN. The figure visually demonstrates the ability of the DDM to generate more realistic ECG signals compared to the WGAN.", "section": "Experimental validation"}, {"figure_path": "Eu0nYM4BPo/figures/figures_30_1.jpg", "caption": "Figure 9: Real and generated ECG heart beat with DDM and WGAN.", "description": "This figure compares the performance of the proposed Denoising Diffusion Model (DDM) with a Wasserstein Generative Adversarial Network (WGAN) for generating ECG heartbeats.  It displays six samples each of real ECG data, ECGs generated using the DDM, and ECGs generated using the WGAN, all shown across the standard 12 leads. The goal is to visually assess the quality and realism of the generated ECGs compared to real ECG recordings.", "section": "Additional Results"}]