{"importance": "This paper is crucial for researchers in reinforcement learning and control systems.  It **directly addresses the limitations of discrete-time RL in continuous systems**, offering a novel framework (TACOS) for more efficient and cost-effective control.  The theoretical analysis and empirical results provide significant insights, **opening up new avenues for research** in continuous-time RL and impacting real-world applications involving costly interactions.", "summary": "TACOS: A novel time-adaptive RL framework drastically reduces interactions in continuous-time systems while improving performance, offering both model-free and model-based algorithms.", "takeaways": ["Time-adaptive RL (TACOS) significantly reduces the number of costly interactions in continuous-time systems compared to discrete-time methods.", "TACOS's model-free and model-based algorithms show improved performance and robustness across various continuous-time control tasks.", "The theoretical analysis of OTACOS proves sublinear regret for smooth systems, enhancing its sample efficiency."], "tldr": "Many real-world systems are continuous in time, but most reinforcement learning (RL) algorithms are designed for discrete-time systems. Applying discrete-time RL to continuous systems often necessitates costly discretization and frequent interactions with the system. This can be especially problematic in applications where each interaction is expensive (e.g., medical treatments, greenhouse control). This paper introduces a novel framework, TACOS, that tackles this challenge. \nTACOS optimizes policies that predict both the control action and its duration, resulting in an extended MDP that standard RL algorithms can solve.  The authors demonstrate that state-of-the-art RL algorithms trained on TACOS drastically reduce interactions while maintaining performance.  Furthermore, they introduce OTACOS, an efficient model-based algorithm with proven sublinear regret for sufficiently smooth systems.  Experiments on various robotic tasks showcase TACOS's superior performance and robustness against discretization frequency.", "affiliation": "ETH Zurich", "categories": {"main_category": "Machine Learning", "sub_category": "Reinforcement Learning"}, "podcast_path": "0JSKjdePGq/podcast.wav"}