[{"figure_path": "PXGY9Fz8vC/tables/tables_4_1.jpg", "caption": "Table 1: Top 5 features most positively and negatively correlated with state gaming rankings predicted by S+IPW, as measured by Spearman correlation. We report p-values given a null hypothesis of zero correlation between predicted rankings and the statistic of interest. OP PT/SP: Outpatient physical therapy and speech pathology. SNF: skilled nursing facility.", "description": "This table shows the top five state-level healthcare system statistics that are most positively and negatively correlated with the state gaming rankings as predicted by the S+IPW model.  The correlations are measured by Spearman rank correlation and p-values indicate the significance of those correlations against a null hypothesis of zero correlation.  Abbreviations include OP PT/SP (Outpatient physical therapy and speech pathology) and SNF (skilled nursing facility).", "section": "5.3 Case study: Detecting upcoding in U.S. Medicare"}, {"figure_path": "PXGY9Fz8vC/tables/tables_5_1.jpg", "caption": "Table 1: Top 5 features most positively and negatively correlated with state gaming rankings predicted by S+IPW, as measured by Spearman correlation. We report p-values given a null hypothesis of zero correlation between predicted rankings and the statistic of interest. OP PT/SP: Outpatient physical therapy and speech pathology. SNF: skilled nursing facility.", "description": "This table shows the top five state-level healthcare system statistics that are most positively and negatively correlated with the state-level gaming rankings that were predicted using the S+IPW causal effect estimator.  The table indicates the Spearman correlation and p-value for each of these top five statistics. Abbreviations are provided for the statistics, such as OP PT/SP for outpatient physical therapy and speech pathology, and SNF for skilled nursing facilities.", "section": "5.3 Case study: Detecting upcoding in U.S. Medicare"}, {"figure_path": "PXGY9Fz8vC/tables/tables_8_1.jpg", "caption": "Table 1: Top 5 features most positively and negatively correlated with state gaming rankings predicted by S+IPW, as measured by Spearman correlation. We report p-values given a null hypothesis of zero correlation between predicted rankings and the statistic of interest. OP PT/SP: Outpatient physical therapy and speech pathology. SNF: skilled nursing facility.", "description": "This table shows the top five state-level healthcare system statistics that are most positively and negatively correlated with the state gaming rankings as predicted by the causal effect estimator S+IPW.  Spearman rank correlation and p-values (given a null hypothesis of zero correlation) are reported to assess the strength and significance of the relationships.", "section": "5.3 Case study: Detecting upcoding in U.S. Medicare"}, {"figure_path": "PXGY9Fz8vC/tables/tables_8_2.jpg", "caption": "Table 1: Top 5 features most positively and negatively correlated with state gaming rankings predicted by S+IPW, as measured by Spearman correlation. We report p-values given a null hypothesis of zero correlation between predicted rankings and the statistic of interest. OP PT/SP: Outpatient physical therapy and speech pathology. SNF: skilled nursing facility.", "description": "This table shows the top five state-level healthcare system statistics that are most positively and negatively correlated with the state gaming rankings generated by the S+IPW model.  The correlations are measured using Spearman rank correlation, and p-values are provided to indicate the statistical significance of these correlations. Abbreviations are provided for clarity.", "section": "5.3 Case study: Detecting upcoding in U.S. Medicare"}, {"figure_path": "PXGY9Fz8vC/tables/tables_20_1.jpg", "caption": "Table 2: Features chosen for analysis derived from the provider of service file, with mean and standard deviation across states. S.d.: standard deviation. OP PT/SP: outpatient physical therapy and speech pathology. ICF/ID: intermediate care facility for individuals with intellectual disability. *: invalid (1/0 or 0/0) ratios dropped.", "description": "This table presents the descriptive statistics of features extracted from the CMS Provider of Services file at the state level.  It includes the mean and standard deviation for various provider types (hospitals, skilled nursing facilities, home health agencies, etc.), categorized by ownership (for-profit, non-profit, public).  The features also encompass ratios between the various provider types, offering insights into the relative prevalence of different ownership models within each state.", "section": "5.1 Setup"}, {"figure_path": "PXGY9Fz8vC/tables/tables_21_1.jpg", "caption": "Table 3: Features chosen for analysis derived from NANDA, with mean and standard deviation across states. All chosen summary statistics are for providers with > $0 U.S. dollars in sales. S.d.: standard deviation. Sq. mi.: square mile. P/O/ST: physical, occupational, and speech therapists. IDD: intellectual and developmental disabilities. MHSA: mental health and substance abuse.", "description": "This table presents the mean and standard deviation for various healthcare features extracted from the National Neighborhood Data Archive (NANDA) dataset.  The features describe the prevalence of different types of healthcare providers per 1000 people and per square mile within each U.S. state. This data is used in a case study to explore correlations between healthcare provider characteristics and gaming behavior in Medicare.", "section": "5.3 Case study: Detecting upcoding in U.S. Medicare"}, {"figure_path": "PXGY9Fz8vC/tables/tables_24_1.jpg", "caption": "Table 1: Top 5 features most positively and negatively correlated with state gaming rankings predicted by S+IPW, as measured by Spearman correlation. We report p-values given a null hypothesis of zero correlation between predicted rankings and the statistic of interest. OP PT/SP: Outpatient physical therapy and speech pathology. SNF: skilled nursing facility.", "description": "This table shows the top five state-level healthcare system statistics that are most positively and negatively correlated with the state gaming rankings as predicted by the S+IPW method.  Spearman correlation coefficients and p-values assessing the significance of these correlations are provided.  The table also provides abbreviations for some of the statistics, such as OP PT/SP for outpatient physical therapy and speech pathology and SNF for skilled nursing facility.", "section": "5.3 Case study: Detecting upcoding in U.S. Medicare"}]