[{"figure_path": "476zUsqFZB/figures/figures_1_1.jpg", "caption": "Figure 1: Example of an overall transformation vs an elementary step approach. This is a the final reaction step in the synthesis of enzalutamide, a drug used to treat prostate cancer that generates over $6 billion a year in revenue [21].", "description": "This figure compares two different ways to represent a chemical reaction: overall transformation and elementary steps. The overall transformation shows only the initial reactants and final products, while the elementary steps break down the reaction into smaller steps, each showing the movement of electrons.  This example illustrates the final step in the synthesis of enzalutamide, a prostate cancer drug with over $6 billion in annual revenue.", "section": "1 Introduction"}, {"figure_path": "476zUsqFZB/figures/figures_3_1.jpg", "caption": "Figure 2: An example of a simple polar elementary step. The electron pushing arrows can be seen in blue, while the source and sink sites are seen in red. The bromine atom labeled 10 is the source atom. The carbon atom labeled 20 is the sink atom. The corresponding SMILES string and arrow codes can be seen below.", "description": "The figure shows a simple polar elementary step reaction. The reactants are an alkyl carbocation and a bromide anion. The bromide anion acts as a nucleophile and attacks the electrophilic carbon atom of the alkyl carbocation. The product is an alkyl bromide. The curved arrow notation is used to illustrate the movement of electrons during the reaction. The source atom is the bromine atom (labeled as 10), and the sink atom is the carbon atom (labeled as 20). The SMILES strings and arrow codes are provided as well.", "section": "3.1.1 Siamese Architecture"}, {"figure_path": "476zUsqFZB/figures/figures_6_1.jpg", "caption": "Figure 3: A simple 2-step mechanism correctly predicted by ensemble transformer model.", "description": "This figure shows a simple two-step mechanism of a chemical reaction. The ensemble transformer model in the paper successfully predicted this reaction mechanism. The mechanism involves two elementary steps. In the first step, a nucleophile attacks an electrophile, forming a new bond. In the second step, another nucleophile attacks a different electrophile, resulting in the final product.", "section": "4.2 Pathway Search"}, {"figure_path": "476zUsqFZB/figures/figures_6_2.jpg", "caption": "Figure 4: Step A represents the elementary step with the spectator molecule benzene included. Step B represents the elementary step with the benzene ring excluded.", "description": "This figure shows two reaction mechanisms.  Mechanism A includes a spectator benzene molecule, while mechanism B removes it. The purpose is to demonstrate that the two-step transformer model can correctly predict the reaction even in the presence of spectator molecules, unlike the chemformer model which struggles in such cases.", "section": "3.3 Seq-to-seq Prediction"}, {"figure_path": "476zUsqFZB/figures/figures_7_1.jpg", "caption": "Figure 5: Comparing the top-5 accuracies of both the transformer and two-step models as number of reactant molecules is varied.", "description": "This figure compares the performance of three different reaction prediction models: Two-Step Chemformer, Two-Step Siamese, and Chemformer. The models were evaluated on their ability to correctly predict the top 5 reaction products. The x-axis represents the number of molecules in the reactants, categorized into four groups: 1, 2, 3, and 4+. The y-axis shows the top-5 accuracy of each model for each group. The figure shows that the Two-Step Chemformer model consistently outperforms the other two models across all groups, achieving the highest accuracy of 93.8% when there are 2 reactant molecules.", "section": "4.1 Performance on PMechDB Dataset"}, {"figure_path": "476zUsqFZB/figures/figures_7_2.jpg", "caption": "Figure 6: Comparing the top-5 accuracies of both the transformer and two-step models as number of reactant atoms is varied.", "description": "This figure compares the performance of two different reaction prediction models (transformer and two-step) across varying numbers of reactant atoms.  The x-axis represents the number of atoms in the reactants, categorized into ranges (0-15, 15-30, 30-45, and 45+), and the y-axis represents the top-5 accuracy of each model.  The different colored lines represent different models.  The graph likely demonstrates how the accuracy of each model changes as the complexity of the reaction (as indicated by the number of reactant atoms) increases.", "section": "4.1 Performance on PMechDB Dataset"}, {"figure_path": "476zUsqFZB/figures/figures_10_1.jpg", "caption": "Figure 7: The distribution of the total number of atoms contained in each reaction for the manually curated training dataset.", "description": "This histogram displays the frequency distribution of the total number of atoms present in each chemical reaction within the manually curated training dataset used to develop the PMechRP model.  The x-axis represents the number of atoms in a reaction, and the y-axis shows the frequency or count of reactions with that specific number of atoms. The distribution appears to be right-skewed, indicating that a majority of the reactions in the dataset involve a relatively small number of atoms, with fewer reactions containing a larger number of atoms.", "section": "A.2 PMechDB Dataset"}, {"figure_path": "476zUsqFZB/figures/figures_10_2.jpg", "caption": "Figure 8: The distribution of atoms for the reactions in the manually curated training dataset.", "description": "This bar chart displays the frequency distribution of the top 15 most common atom types present in the reactions within the manually curated training dataset used for developing the PMechRP model. The atoms are sorted in descending order of frequency, clearly showing Carbon (C) as the most frequent atom type, followed by Oxygen (O), Nitrogen (N), and others.  The y-axis represents the counts (on a logarithmic scale), while the x-axis displays the different atom types.", "section": "A.2 PMechDB Dataset"}]