{"importance": "This paper is highly important for researchers in time series forecasting due to its significant performance improvement and its novel approach of handling non-stationarity. The introduction of Frequency Adaptive Normalization (FAN) offers a model-agnostic solution applicable to various forecasting backbones, opening new avenues for researchers to enhance the accuracy of their models, especially when dealing with complex, real-world data exhibiting dynamic trends and seasonal patterns. The method's effectiveness across multiple datasets also underscores its generalizability and practical value.  Furthermore, the theoretical analysis enhances our understanding of the method's impact on stationarity and distribution, potentially leading to further development in the area.", "summary": "Frequency Adaptive Normalization (FAN) significantly boosts non-stationary time series forecasting accuracy by using Fourier transforms to identify and model dynamic trends and seasonal patterns, achieving 7.76%~37.90% average improvements in MSE across eight benchmark datasets.", "takeaways": ["FAN significantly improves time series forecasting accuracy by addressing non-stationarity in dynamic trends and seasonal patterns.", "FAN is a model-agnostic method, applicable to various forecasting backbones.", "FAN achieves significant performance advancements across multiple benchmark datasets."], "tldr": "Non-stationary time series forecasting remains challenging due to evolving trends and seasonal patterns, limiting the effectiveness of traditional methods.  Existing instance normalization techniques, while improving accuracy, struggle with complex seasonal patterns. \nThe proposed Frequency Adaptive Normalization (FAN) method innovatively addresses this limitation by employing Fourier transforms to identify instance-wise predominant frequencies, effectively handling both dynamic trends and seasonality.  FAN then uses these identified frequencies to normalize the data,  modeling the discrepancy between input and output frequencies via a simple MLP. Experiments across eight benchmark datasets show substantial improvements (7.76%~37.90% average improvements in MSE), highlighting FAN's potential for broader applicability and improved forecasting accuracy. ", "affiliation": "Central South University", "categories": {"main_category": "Machine Learning", "sub_category": "Deep Learning"}, "podcast_path": "T0axIflVDD/podcast.wav"}