[{"figure_path": "co8KZws1YK/figures/figures_7_1.jpg", "caption": "Figure 1: Conditional plans γθ,ω(y|x) learned by our solver in Gaussians Mixture experiment with unbalancedness parameter τ ∈ [10º, 101, 102]. Here pɛ denotes the normalized first marginal uw, i.e., pω = κω/||uw||1.", "description": "This figure visualizes the conditional plans learned by the U-LightOT solver for a Gaussian Mixture experiment with different levels of unbalancedness (τ). The unbalancedness parameter, τ, controls the level of mass imbalance allowed between the source and target distributions.  The plots show how the learned transport plan (γθ,ω(y|x)) changes as τ varies from 10^0 to 10^2. The normalized marginal (pɛ) of the transport plan is also shown for comparison.", "section": "5.1 Example with the Mixture of Gaussians"}, {"figure_path": "co8KZws1YK/figures/figures_8_1.jpg", "caption": "Figure 1: Conditional plans γθ,ω(y|x) learned by our solver in Gaussians Mixture experiment with unbalancedness parameter τ ∈ [10⁰, 10¹, 10²]. Here pɛ denotes the normalized first marginal uw, i.e., pω = κω/||uw||₁.", "description": "This figure visualizes the conditional plans learned by the U-LightOT solver in a Gaussian Mixture experiment, showing how the unbalancedness parameter τ affects the transport plan.  Three different values of τ (1, 10, and 100) are shown, demonstrating how the learned plan changes as the unbalancedness increases.  The normalized first marginal, pω, is also displayed.", "section": "5.1 Example with the Mixture of Gaussians"}, {"figure_path": "co8KZws1YK/figures/figures_9_1.jpg", "caption": "Figure 1: Conditional plans γθ,ω(y|x) learned by our solver in Gaussians Mixture experiment with unbalancedness parameter τ ∈ [10º, 101, 102]. Here pɛ denotes the normalized first marginal uw, i.e., ρω = κω/||Uw ||1.", "description": "This figure shows the conditional plans learned by the U-LightOT solver in a Gaussian Mixture experiment for different values of the unbalancedness parameter τ.  It illustrates how the parameter τ affects the mass transport from source to target distributions, showing the effect of the unbalancedness on the generated transport plan.  The normalized first marginal uw is denoted as pɛ.", "section": "5.1 Example with the Mixture of Gaussians"}, {"figure_path": "co8KZws1YK/figures/figures_24_1.jpg", "caption": "Figure 4. Conditional plans γθω(y|x) learned by our solver with scaled Dχ2 divergences in Gaussians Mixture experiment (τ ∈ [1, 2, 5, 10]).", "description": "This figure shows the conditional plans learned by the U-LightOT solver using scaled χ2-divergences in a Gaussian Mixture experiment.  Different subfigures represent different values of the unbalancedness parameter τ (τ ∈ [1, 2, 5, 10]). Each subfigure visualizes the learned conditional probability distribution γθω(y|x), illustrating how the model's learned transport plan varies as the unbalancedness parameter changes.", "section": "5.1 Example with the Mixture of Gaussians"}, {"figure_path": "co8KZws1YK/figures/figures_26_1.jpg", "caption": "Figure 2: Visualization of pairs of accuracies (keep-target) for our U-LightOT solver and other OT/EOT methods in the image translation experiment. The values of unbalancedness parameters for our U-LightOT solver (τ) and [16, UOT-FM] (λ = reg_m) are specified directly on the plots.", "description": "This figure compares the performance of the U-LightOT solver against other OT/EOT methods on image translation tasks.  It visualizes the trade-off between 'keeping' the original characteristics of the source images and accurately 'mapping' them to the target domain. Different unbalancedness parameters (τ for U-LightOT, λ for UOT-FM) are shown, illustrating how this parameter affects the accuracy of both aspects.  The plots demonstrate that U-LightOT achieves a better balance compared to several baselines, excelling in preserving source image attributes.", "section": "5.2 Unpaired Image-to-Image Translation"}, {"figure_path": "co8KZws1YK/figures/figures_28_1.jpg", "caption": "Figure 1: Conditional plans Ye,w(y|x) learned by our solver in Gaussians Mixture experiment with unbalancedness parameter τ ∈ [10º, 101, 102]. Here pɛ denotes the normalized first marginal uw, i.e., ρω = κω/||Uw ||1.", "description": "This figure shows the conditional plans (probability distributions over y given x) learned by the U-LightOT solver for different values of the unbalancedness parameter (τ).  The experiment uses Gaussian Mixture data.  The parameter τ controls the balance between the marginal distributions of source and target measures; a smaller τ indicates a more balanced situation, while larger τ values show an increased imbalance.  Note that pε is a normalized version of the learned marginal distribution.", "section": "5.1 Example with the Mixture of Gaussians"}]