[{"type": "text", "text": "Bridging The Gap between Low-rank and Orthogonal Adaptation via Householder Reflection Adaptation ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Shen Yuan1 Haotian Liu1∗ Hongteng $\\mathbf{X}\\mathbf{u}^{1,2\\dagger}$ ", "page_idx": 0}, {"type": "text", "text": "1Gaoling School of Artificial Intelligence, Renmin University of China 2Beijing Key Laboratory of Big Data Management and Analysis Methods {shenyuan721, haotianliu, hongtengxu}@ruc.edu.cn ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "While following different technical routes, both low-rank and orthogonal adaptation techniques can efficiently adapt large-scale pre-training models in specific tasks or domains based on a small piece of trainable parameters. In this study, we bridge the gap between these two techniques, proposing a simple but effective adaptation method based on Householder reflections. Given a pre-trained model, our method fine-tunes its layers by multiplying each frozen weight matrix with an orthogonal matrix constructed by a chain of learnable Householder reflections (HRs). This HR-based orthogonal fine-tuning is equivalent to an adaptive low-rank adaptation. Moreover, we show that the orthogonality of the reflection planes corresponding to the HRs impacts the model capacity and regularity. The analysis motivates us to regularize the orthogonality of the HRs, leading to different implementations of the proposed Householder reflection adaptation (HRA) method. Compared with state-of-the-art methods, HRA achieves superior performance with fewer learnable parameters when adapting large language models and conditional image generators. The code of the experiments is available at https://github.com/ DaShenZi721/HRA, and the method has been merged into the PEFT package. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "In recent large foundation model competitions, “Scaling Laws” [22, 18, 39] motivate researchers to increase model size continuously, which brings significantly improved model capabilities in understanding, generation, reasoning, and generalization but with more and more unbearable model adaptation costs. For instance, the GPU memory for fine-tuning a LLaMA-65B model with 16bit precision exceeds 780GB [9]. The adaptation of image generative models (like the ControlNet in [60] did) may suffer the same issue when applying large vision foundation models as backbones. Consequently, fine-tuning large foundation models efficiently for adapting various downstream tasks has become a challenge in practice. ", "page_idx": 0}, {"type": "text", "text": "To overcome the above challenge, Parameter-Efficient Fine-Tuning (PEFT) methods [53] provide promising solutions, which aim to reduce the trainable parameters and memory consumption of fine-tuning while maintaining even improving model adaptation performance. Among various PEFT methods, the adapter-based fine-tuning [20, 37] attracts a lot because it only inserts limited trainable parameters into existing models during fine-tuning but without adding extra complexity or overhead in the inference phase. Currently, given a parameter matrix of a pre-trained model, i.e., $\\dot{\\boldsymbol W}\\in\\mathbb R^{d_{\\mathrm{out}}\\times d}$ , there are roughly two strategies implementing the adapter-based fine-tuning. The mainstream strategy is applying Low-Rank Adaptation (LoRA) [20] and its variants [9, 21, 25, 31, 33, 35, 48, 54, 60, ", "page_idx": 0}, {"type": "image", "img_path": "LzLeAscHnj/tmp/18ecde5fdd5df43a3f84d93bf8a53a479e94b615b129604cf5576fce5bd8cd89.jpg", "img_caption": ["(a) The scheme of our Householder reflection adaptation method "], "img_footnote": [], "page_idx": 1}, {"type": "image", "img_path": "LzLeAscHnj/tmp/ff4d833b1503d5bce9d5994b0ebdf3777425c1265b23e801fe36f70972a61586.jpg", "img_caption": ["(b) Performance on GLUE Benchmark "], "img_footnote": [], "page_idx": 1}, {"type": "image", "img_path": "LzLeAscHnj/tmp/d4bda867aafe3c77a17e1f5478f868e3211bec09a100029d802b29a0d11f7f96.jpg", "img_caption": ["Figure 1: (a) An illustration of our HRA method. (b) Comparisons for various methods on GLUE benchmark [50]. The $\\mathbf{X}$ -axis corresponds to the number of trainable parameters (M), and the y-axis corresponds to the average score $(\\%)$ . (c) Comparisons for various methods on the ratio of trainable parameters and accuracy $(\\%)$ when adapting LLaMA2-7B [46] in mathematical reasoning tasks. ", "(c) LLM adaptation for mathematical reasoning "], "img_footnote": [], "page_idx": 1}, {"type": "text", "text": "62, 4, 11], modifying the weight matrix by adding a trainable low-rank decomposition matrix, i.e., $W+A B$ , where $\\bar{A}\\in\\mathbb{R}^{d_{\\mathrm{out}}\\,\\overline{{\\times}}\\,r}$ and $\\boldsymbol{B}\\in\\mathbb{R}^{r\\times d}$ , and $r\\ll\\operatorname*{min}(d,d_{\\mathrm{out}})$ is the intrinsic rank of the modification $_{A B}$ . Another strategy is Orthogonal Fine-Tuning (OFT) [37, 34], which multiplies the weight matrix with a structured orthogonal matrix $R\\in\\mathbb{R}^{d\\times d}$ determined by limited trainable parameters, i.e., $_{W R}$ . Both strategies can reduce VRAM usage because they merely leverage limited trainable parameters and do not store the optimizer state of the original weight matrices. At the same time, they achieve encouraging model adaptation performance in various vision and NLP tasks. ", "page_idx": 1}, {"type": "text", "text": "Essentially, LoRA hypothesizes that the additive modifications of weight matrices are intrinsically low-rank, while OFT preserves the pairwise angles between neuron vectors and theoretically penalizes the discrepancy between pre-trained and fine-tuned models. The difference between their principles prevents us from building a unified adapter-based fine-tuning framework. To bridge the gap between these two strategies, we propose a simple but effective adapter-based fine-tuning method called Householder Reflection Adaptation (HRA). This method provides a new perspective connecting LoRA to OFT and achieves encouraging performance in various downstream tasks. As illustrated in Figure 1a, our method adapts a pre-trained model by multiplying each frozen weight matrix with a chain of $r$ learnable Householder reflections (HRs) [19]. HRA can be interpreted as either an OFT adapter or an adaptive LoRA. Consequently, it harnesses the advantages of both strategies, reducing parameters and computation costs while penalizing the loss of pre-training knowledge. ", "page_idx": 1}, {"type": "text", "text": "Moreover, we show that the orthogonality of HR planes impacts the capacity and regularity of HRA. Accordingly, we leverage an orthogonality regularizer of the HR planes when applying HRA, achieving a trade-off between the model capacity and regularity by controlling the strength of the regularizer. When the weight of the regularizer (i.e., the $\\lambda$ in Figure 1a) goes to infinity, we constrain the orthogonality strictly by Gram-Schmidt orthogonalization [2], resulting in a strictly-orthogonal HRA implementation. We apply HRA to adapt different models, including large language models (LLMs) and conditional image generators. Experiments show that HRA consistently outperforms state-of-the-art adapters in various tasks, achieving better performance with fewer trainable parameters. Figures 1b-1c highlight the superiority of our method in natural language understanding and mathematical reasoning tasks, and more results can be found in the following content. ", "page_idx": 1}, {"type": "text", "text": "2 Related Work and Preliminaries ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "The early PEFT methods [57, 44, 10] apply model fine-tuning, which keep model architectures unchanged and only update a small portion of model parameters. To achieve better performance, soft prompt fine-tuning [13, 28, 30, 49] is proposed, introducing additional trainable parameters into inputs and/or hidden layers when adapting models. Recently, adapter-based fine-tuning [20, 62] is proposed to improve model adaptation performance without changing model architecture. As we mentioned before, it is often implemented based on the following strategies. ", "page_idx": 2}, {"type": "text", "text": "2.1 Low-rank Adaptation (LoRA) ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "LoRA [20] formulates trainable parameters as decomposed low-rank matrices and aggregates them to frozen weight matrices linearly during fine-tuning, which achieves a trade-off between efficiency and effectiveness. Following LoRA, many improved low-rank adaptation methods [9, 21, 25, 31, 33, 35, 48, 54, 60, 62, 4, 11] have been proposed, which can be coarsely categorized into three classes. ", "page_idx": 2}, {"type": "text", "text": "• Structure Adjustment. The work in [48, 25, 62, 60] further reduces trainable parameters by adjusting the structure of inserted low-rank matrices. VeRA [25] incorporates frozen low-rank matrices shared across all layers with few trainable scaling vectors. DyLoRA [48] learns low-rank matrices with different ranks and determines optimal ranks automatically. AdaLoRA [62] prunes trainable parameters based on the importance scores of the original weight matrices. ", "page_idx": 2}, {"type": "text", "text": "• Initialization Improvement. Some methods [33, 35] utilize matrix decomposition methods on the original weight matrices to initialize parameters. DoRA [33] decomposes each original weight matrix into magnitudes and directions for fine-tuning. PiSSA [35] performs singular value decomposition (SVD) on each original weight matrix, where the low-rank principal matrix serves as trainable parameters, while the residual matrix is frozen. ", "page_idx": 2}, {"type": "text", "text": "• Parameter Quantization. Some methods [54, 9, 31] quantize the pre-trained model to further reduce computational costs in both training and inference. For example, QA-LoRA [54] achieves a trade-off between quantization strength and adaptation performance with the help of a group-wise quantization operator. ", "page_idx": 2}, {"type": "text", "text": "These methods have empirically demonstrated decent performance in various downstream tasks, however, they lack theoretical guarantees regarding the retention of pre-training knowledge. ", "page_idx": 2}, {"type": "text", "text": "2.2 Orthogonal Fine-tuning (OFT) ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "LoRA and its variants have empirically demonstrated decent performance in various downstream tasks. However, they lack theoretical guarantees regarding the retention of pre-training knowledge. In order to address this issue, orthogonal fine-tuning (OFT) [37, 34] is proposed, which transforms neuron vectors within the same layer using the same set of orthogonal matrices. It preserves the pairwise angles between neuron vectors and thus guarantees a bounded discrepancy between pretrained and fine-tuned models. For instance, the OFT method in [37] adopts Cayley parameterization to generate the block-diagonal orthogonal matrix. The BOFT [34] introduces butterfly factorization to generate a denser orthogonal matrix from a chain of structured sparse matrices, which improves OFT’s performance with fewer trainable parameters. ", "page_idx": 2}, {"type": "text", "text": "Note that, besides fine-tuning, the principle of imposing orthogonality constraints on trainable parameters has been applied in designing robust and training-efficient neural network architectures, e.g., convolution neural networks (CNNs) [14, 27], recurrent neural networks (RNNs) [51, 26], and Transformers [59]. In particular, by constraining the orthogonality of these models’ weight matrices, we can ensure the models are 1-Lipschtize in theory and thus make them achieve provable robustness against adversarial perturbations [47, 29] and generalization bounds [43, 24]. ", "page_idx": 2}, {"type": "text", "text": "3 Proposed Method ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "3.1 Model Adaptation via Learning A Chain of Householder Reflections ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Denote $\\mathbb{S}^{d-1}=\\{\\pmb{u}\\in\\mathbb{R}^{d}\\mid\\|\\pmb{u}\\|_{2}=1\\}$ as a $d$ -dimensional hypersphere. For each $\\pmb{u}\\in\\mathbb{S}^{d-1}$ , we can construct a Householder reflection matrix, denoted as $\\pmb{H}$ , by $\\boldsymbol{I}-2\\boldsymbol{u}\\boldsymbol{u}^{\\intercal}$ , which corresponds to a specular reflection hyperplane, denoted as $\\mathcal{H}$ . For any $\\pmb{x}\\in\\mathbb{R}^{d}$ , $_{H x}$ corresponds to reflecting $\\textbf{\\em x}$ across the hyperplane $\\mathcal{H}$ , which reverses the component of $\\textbf{\\em x}$ that is orthogonal to the hyperplane. ", "page_idx": 2}, {"type": "table", "img_path": "LzLeAscHnj/tmp/3886971bb08e10401cae93a26a1e8959560d7d2f0540daefd6d61f5d4300fa44.jpg", "table_caption": ["Table 1: Comparisons for various OFT-based adapters "], "table_footnote": [], "page_idx": 3}, {"type": "text", "text": "", "page_idx": 3}, {"type": "text", "text": "Because $\\pmb{H}$ is an orthogonal matrix, it is natural for us to implement orthogonal adaptation based on it — we can treat $\\pmb{H}$ as an adapter and multiply it with the weight matrix of the pre-trained model. Moreover, since the set of all $d\\times d$ orthogonal matrices, denoted as $\\mathbb{O}_{d\\times d}$ , satisfies all the axioms of a group which is a compact Lie group of dimension $d(d-1)/2$ , the product of orthogonal matrices is also an orthogonal matrix [1]. Therefore, we can enhance the capacity of the adapter by constructing a chain of $r$ trainable Householder reflections, leading to our HRA method. As shown in Figure 1a, given a weight matrix $W\\in\\mathbb{R}^{d_{\\mathrm{out}}\\times d}$ and an input $\\mathbf{\\pmb{x}}\\in\\mathbb{R}^{d}$ , the forward step of HRA is ", "page_idx": 3}, {"type": "equation", "text": "$$\nz=W H^{(r)}x=W\\Big(\\prod_{i=1}^{r}H_{i}\\Big)x=W\\Big(\\prod_{i=1}^{r}(I-2u_{i}u_{i}^{\\top})\\Big)x,\\ \\mathrm{with}\\ \\{u_{i}\\in\\mathbb{S}^{d-1}\\}_{i=1}^{r}.\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "Although equation 1 involves the chained product of $r+1$ dense matrices, we can leverage the structure of Householder reflection to simplify the computation. Let ${\\pmb x}^{(0)}~=~{\\pmb x}$ and ${\\pmb x}^{(j+1)}\\,=$ $(I-2{\\pmb u}_{r-j}{\\pmb u}_{r-j}^{\\top}){\\pmb x}^{(j)}$ for $j=0,...,r-1$ . We implement equation 1 by the following two steps: ", "page_idx": 3}, {"type": "equation", "text": "$$\n1)~\\pmb{x}^{(j+1)}=\\pmb{x}^{(j)}-2\\langle\\pmb{u}_{r-j},\\pmb{x}^{(j)}\\rangle\\pmb{u}_{r-j},~\\mathrm{for}~j=0,...,r-1.~~~2\\rangle=W\\pmb{x}^{(r)}.\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "The first step involves $r$ vector inner products and $r$ scalar-vector multiplications, whose complexity is $\\mathcal{O}(r d)$ . The second step involves a matrix-vector multiplication, whose complexity is $\\bar{O(d_{\\mathrm{out}}d)}$ . Therefore, the complexity of HRA can be as low as $\\mathcal{O}(d(\\bar{r_{\\mathrm{\\ell}}}+d_{\\mathrm{out}}))$ . ", "page_idx": 3}, {"type": "text", "text": "3.2 Comparisons with Existing OFT Methods ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Table 1 compares HRA with existing OFT [37] and BOFT [34] methods on their implementations, numbers of parameters, computational complexity, and model capacity. ", "page_idx": 3}, {"type": "text", "text": "• The number of parameters. Both OFT and BOFT construct several orthogonal sub-matrices in $\\mathbb{O}_{b\\times b}$ based on Cayley transformation [12], each of which require s b(b−1) b2 trainable parameters3 and $\\mathcal{O}(b^{3})$ computational complexity. OFT constructs a block diagonal matrix based on $\\frac{d}{b}$ sub-matrices, i.e., $\\pmb{R}^{(b)}=\\mathrm{diag}(\\{\\pmb{R}_{i}\\in\\mathbb{O}_{b\\times b}\\}_{i=1}^{d/b})$ . BOFT constructs $m$ sparse orthogonal smuacthri cthesa $\\{B_{i}^{d}\\}_{i=1}^{m}$ i,n tgh teh ep reoldeumcet notsf  othf $\\frac{d m}{b}$ osrptahrosgeo nmaal tsriucbe-sm laetaridcse ts oi na  ad beuntstee rofrlyt hmoagnonnearl, $\\begin{array}{r}{m=\\log{\\frac{2d}{b}}}\\end{array}$ $m$ matrix. Therefore, according to the number of orthogonal sub-matrices, the numbers of parameters of OFT and BOFT are $\\frac{d(b-1)}{2}$ and $\\textstyle{\\frac{d m(b-1)}{2}}$ in theory while $\\mathit{d b}$ and dmb in practice. To make the number of parameters comparable to OFT, BOFT often applies a smaller block size (e.g., $b=2$ or 4). It is easy to find that when $r=b\\,(=m b)$ , HRA has the same number of parameters as OFT (BOFT). Therefore, HRA is generally comparable to OFT and BOFT regarding model size. ", "page_idx": 3}, {"type": "text", "text": "", "page_idx": 4}, {"type": "text", "text": "• Computational complexity. For the forward step of OFT, i.e., $\\pmb{z}=\\pmb{W}\\pmb{R}^{(b)}\\pmb{x}$ , the computational complexity is $\\mathcal{O}(d(b^{2}+b+d_{\\mathrm{out}}))$ . Here, $\\mathcal{O}(d b^{2})$ corresponds to applying Cayley transformation to construct $\\frac{d}{b}$ orthogonal sub-matrices, and $O(d b)$ and $\\mathcal{O}(d d_{\\mathrm{out}})$ correspond to the matrix block multiplication used for $\\pmb{y}=\\pmb{R}^{(b)}\\pmb{x}$ and the matrix-vector multiplication for $z=W y$ , respectively. For the forward step of BOFT, i.e., $\\pmb{z}\\,=\\,\\pmb{W}\\pmb{B}^{(m,b)}\\pmb{x}$ , where $\\begin{array}{r}{B^{(m,b)}=\\prod_{i=1}^{m}B_{i}^{(b)}}\\end{array}$ , the computational complexity is $\\mathcal{O}(d(m b^{2}+m b+d_{\\mathrm{out}}))\\sim\\mathcal{O}(d(m b^{2}+m d+d_{\\mathrm{out}}))$ ). Similar to OFT, $\\mathcal{O}(d m b^{2})$ means applying Cayley transformation to construct $\\frac{d m}{b}$ orthogonal sub-matrices, $\\mathcal{O}(d m b)\\sim\\mathcal{O}(d^{2}m)$ corresponds to the matrix-vector multiplications of $m$ butterfly matrices4 to compute $\\begin{array}{r}{\\pmb{y}=\\prod_{i=1}^{m}\\pmb{B}_{i}^{(b)}\\pmb{x}}\\end{array}$ , and $\\mathcal{O}(d d_{\\mathrm{out}})$ corresponds to $z=W y$ . When setting $r\\ll b^{2}+b$ $(\\ll m(b^{2}+b))$ , HRA can be more efficient than OFT (BOFT). ", "page_idx": 4}, {"type": "text", "text": "• The trade-off between model capacity and regularity. The ranges of OFT, BOFT, and HRA correspond to different subsets of $\\mathbb{O}_{d\\times d}$ , achieving a trade-off between model capacity and regularity. To cover the whole $\\mathbb{O}_{d\\times d}$ , OFT needs to set $b=d$ and compute a dense orthogonal matrix with high complexity. With the help of the butterfly structure, BOFT can derive a dense orthogonal ,  swuitchh  ftehwate re apcahr cwaen  nreeepdr etsoe ncto na stHruocuts $\\{B_{i}^{(m,b)}\\}_{i=1}^{d-1}$ tiwoitnh $m=\\log d$ aanndd $b=2$ $B_{i}^{(m,b)}(B_{i}^{(m,b)})^{\\top}$ accordingly, the chained product of the $d-1$ Householder reflections can represent an arbitrary orthogonal matrix in $\\mathbb{O}_{d\\times d}$ . Similarly, for HRA, we need to construct $d-1$ Householder reflections based on $\\{u_{i}\\}_{i=1}^{d-1}$ to represent an arbitrary orthogonal matrix in $\\mathbb{O}_{d\\times d}$ . According to the above analysis, BOFT and HRA are relatively easy to achieve a trade-off between model capacity and regularity with mild computation costs — by setting small $m,b,$ , and $r$ , they can achieve dense orthogonal matrices that have intrinsic low-dimensional manifold structures. ", "page_idx": 4}, {"type": "text", "text": "3.3 Connections with Low-rank Adaptation ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "Different from OFT and BOFT, HRA can also be viewed as an adaptive low-rank adapter. Specifically, we can rewrite the chain of HRs in equation 1 in the following equivalent format: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\pmb{H}^{(r)}=\\prod_{i=1}^{r}(\\pmb{I}-2\\pmb{u}_{i}\\pmb{u}_{i}^{\\top})=\\pmb{I}+\\pmb{U}_{r}\\pmb{\\Gamma}_{r}\\pmb{U}_{r}^{\\top},\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $U_{r}\\,=\\,[\\pmb{u}_{1},...,\\pmb{u}_{r}]\\,\\in\\,\\mathbb{R}^{d\\times r}$ , $\\mathbf{r}_{r}\\,=\\,[\\gamma_{i j}]\\,\\in\\,\\mathbb{R}^{r\\times r}$ is a upper-triangular matrix, and its upper-riangular element is ", "page_idx": 4}, {"type": "image", "img_path": "LzLeAscHnj/tmp/7b4f946b0faf1014e04d4425e6c8709a2829573beba92107cec770f1e951d76f.jpg", "img_caption": [], "img_footnote": [], "page_idx": 4}, {"type": "equation", "text": "$$\n\\gamma_{i j}=\\left\\{\\!\\!\\!\\begin{array}{l l}{-2}&{i=j}\\\\ {(-2)^{j-i+1}\\prod_{i=1}^{j-1}\\langle{\\pmb u}_{i},{\\pmb u}_{i+1}\\rangle}&{i<j.}\\end{array}\\!\\!\\right.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Accordingly, we have ", "page_idx": 4}, {"type": "equation", "text": "$$\nW H^{(r)}=W+W U_{r}\\Gamma_{r}U_{r}^{\\top}=W+A(W,B)B.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Figure 2: A 2D illustration indicating that when the reflection planes $\\mathcal{H}_{1}$ and $\\mathcal{H}_{2}$ are orthogonal, the distance $\\lVert H_{2}H_{1}\\pmb{w}-\\pmb{w}\\rVert_{2}$ is maximized. ", "page_idx": 4}, {"type": "text", "text": "The above formulation can be viewed as an adaptive LoRA that inherits the theoretical guarantee of OFT on the retention of pre-training knowledge. The low-rank matrix $B=U_{r}$ , is constructed by normalized vectors, while the low-rank matrix $\\pmb{A}=[\\pmb{a}_{1},...,\\pmb{a}_{r}]$ is parameterized as $W U_{r}\\mathbf{T}_{r}$ , which can be treated as a function of $W$ and $_B$ . Therefore, similar to OFT and BOFT, HRA ensures that the columns of $W H^{(r)}$ are always in the column space of $W$ . ", "page_idx": 4}, {"type": "text", "text": "3.4 Enhancing The Orthogonality of Householder Reflections for Stronger Regularity ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "Besides the number of Householder reflections, the orthogonality of them also impacts the regularity of HRA. Specifically, the supreme change of the weight matrix $W$ , i.e., $\\operatorname*{sup}_{H^{(r)}}\\|W-W H^{(r)}\\|_{F}$ (or, equivalently, $\\mathrm{sup}_{U_{r}}$ $\\|\\boldsymbol{W}\\boldsymbol{U}_{r}\\mathbf{I}_{r}\\boldsymbol{U}_{r}^{\\top}\\|_{F})$ , is achieved when $U_{r}$ consists of the top- $^r$ right singular vectors of $W$ . In such a situation, $U_{r}$ is an orthogonal matrix, i.e., $U_{r}^{\\top}U_{r}\\;=\\;I_{r}$ . When the orthogonality is not held, $\\|\\boldsymbol{W}\\boldsymbol{U}_{r}\\mathbf{T}_{r}\\boldsymbol{U}_{r}^{\\top}\\|_{F}$ is reduced, as illustrated in Figure 2. In other words, when adapting the pre-trained model, enhancing the orthogonality of $U_{r}$ imposes stronger regularity on the adapter — it encourages the discrepancy between the target model and the original pre-trained model while restricting the feasible domain of the adapter’s parameter matrix. ", "page_idx": 4}, {"type": "table", "img_path": "LzLeAscHnj/tmp/d5aeec63964a16abfd3b954095898519e690c785822bcd338b9004b50e5c175e.jpg", "table_caption": ["Table 2: Results $(\\%)$ of various methods on GLUE development set. The best results on each dataset are shown in bold, and the second best results are shown in underline. We report the matched accuracy for MNLI, Matthew’s correlation for CoLA and average correlation for STS-B. "], "table_footnote": [], "page_idx": 5}, {"type": "text", "text": "", "page_idx": 5}, {"type": "text", "text": "Motivated by the above analysis, we can implement HRA with an orthogonality regularizer. Typically, given a pre-trained model $\\mathcal{M}$ , we can adapt $L$ weight matrices of the model based on a dataset $\\mathcal{D}$ by solving the following optimization problem: ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\operatorname*{min}_{\\{\\boldsymbol{U}_{r}^{(l)}\\}_{l=1}^{L}}\\mathrm{Loss}(\\mathcal{D};\\{\\boldsymbol{U}_{r}^{(l)}\\}_{l=1}^{L})+\\lambda\\sum_{l=1}^{L}\\|\\boldsymbol{I}_{r}-(\\boldsymbol{U}_{r}^{(l)})^{\\top}\\boldsymbol{U}_{r}^{(l)}\\|_{F}^{2},}\\end{array}\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $U_{r}^{(l)}$ denotes the parameters of HRA for the $l$ -th weight matrix. In equation 6, the first term denotes the loss function, while the second term is the proposed regularizer that encourages the orthogonality of all $U_{r}^{(l)}$ ’s, whose significance is controlled by $\\lambda>0$ . Because it does not change the forward step of HRA, this regularizer only increases the adaptation cost slightly. ", "page_idx": 5}, {"type": "text", "text": "As shown in Figure 1a, by controlling the strength of the orthogonality regularizer, we can achieve a trade-off between the model capacity and regularity. When $\\lambda=0$ , the feasible domain of $U_{r}$ is the set of column-normalized matrices, and accordingly, the model capacity is maximized. In contrast, when $\\lambda\\rightarrow\\infty$ , the feasible domain of $U_{r}$ is the set of orthogonal matrices (i.e., $\\mathbb{O}_{d\\times r.}$ ), leading to the strongest regularity. When $\\lambda=\\infty$ , we implement a strictly-orthogonal HRA based on GramSchmidt (GS) orthogonalization. For each layer’s HRA adapter, we initialize its parameter matrix as $V_{r}\\in\\mathbb{R}^{d\\times r}$ and applying Gram-Schmidt orthogonalization [2] to it, i.e., $U_{r}={\\sf G\\bar{S}}(V_{r})$ . As shown in Figure 1a, in such a situation, the forward step of each adapter becomes $z=W(I-2U_{r}{\\pmb U}_{r}^{\\top}){\\pmb x}$ , and the computational complexity becomes $\\mathcal{O}(\\dot{d}(r^{2}+r+\\dot{d_{\\mathrm{out}}}))$ , where additional $\\mathcal{O}(d r^{2})$ operations are used for Gram-Schmidt orthogonalization. According to Table 1, the complexity of this strictlyorthogonal HRA is comparable to OFT [37] when $r=b$ . ", "page_idx": 5}, {"type": "text", "text": "4 Experiments ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "To demonstrate the effectiveness of HRA, we conduct comparative experiments for HRA and stateof-the-art adaptation methods on three models oriented to different tasks, including DeBERTaV3- base [15] for natural language understanding, LLaMA2-7B [46] for mathematical reasoning, and Stable Diffusion [40] for conditional text-to-image generation. Typical results are shown below. More results and implementation details are provided in Appendix. ", "page_idx": 5}, {"type": "text", "text": "In each experiment, we set the number of HRs (i.e., $r$ ) to ensure that HRA has comparable or fewer trainable parameters than existing adaptation methods (including LoRA, OFT, and their variants). Setting $\\lambda\\in(0,\\infty)$ leads to the proposed HRA method, and we demonstrate the robustness of HRA to the $\\lambda$ in a wide range. By default, we set $\\lambda\\in[10^{-5},10^{-3}]$ in the experiments. Furthermore, to analyze the trade-off between model capacity and regularity, we consider two variants of HRA: $i$ ) the HRA without the orthogonality regularization $\\left.\\lambda=0\\right]$ ) and $i i$ ) the strictly-orthogonal HRA using GS orthogonalization (i.e., $\\lambda=\\infty$ ). For convenience, we denote $\\mathbf{H}\\mathbf{R}\\mathbf{A}_{r,\\lambda}$ as the HRA learning $r$ Householder reflections per layer with an orthogonality regularizer weighted by $\\lambda$ . ", "page_idx": 5}, {"type": "text", "text": "", "page_idx": 6}, {"type": "text", "text": "4.1 Natural Language Understanding ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "We adapt DeBERTaV3-base [15] by different methods and test the performance of the adapted models on the General Language Understanding Evaluation (GLUE) benchmark [50]. Following AdaLoRA [62] and BOFT [34], we consider eight tasks of GLUE in this experiment, including two single-sentence tasks, three similarity and paraphrase tasks, and three inference tasks. The experimental results in Figure 1b and Table 2 show that using fewer trainable parameters, HRA achieves the best or comparable results across all datasets and thus leads to the best average performance. These results demonstrate the efficiency and effectiveness of HRA. ", "page_idx": 6}, {"type": "text", "text": "In this experiment, the HRA without the regularization (i.e., $\\lambda=0$ ) and that using weak regularization (i.e., $\\lambda\\:=\\:10^{-5}$ ) achieve comparable adaptation results, while imposing strong regularity by strict orthogonal$\\lambda=\\infty$ ", "page_idx": 6}, {"type": "image", "img_path": "LzLeAscHnj/tmp/52324fb8ab6f42798a0dd8dd190089fd88b1473b636f66cf740d264c6fecc529.jpg", "img_caption": ["Figure 3: The robustness of HRA $(r=8)$ ) to $\\lambda$ on MRPC. "], "img_footnote": [], "page_idx": 6}, {"type": "text", "text": "ity (i.e., ) harms the model performance. This interesting phenomenon implies that the adaptation tasks in GLUE are challenging enough to apply the adapter with sufficient capacity. Figure 3 shows the performance of HRA on MRPC when $\\dot{\\lambda}\\in[10^{-7},\\dot{1}0^{-3}]$ . We can find that HRA achieves relatively stable performance when $\\lambda$ changes in a wide range. ", "page_idx": 6}, {"type": "text", "text": "4.2 Mathematical Reasoning of LLM ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "We adapt LLaMA2-7B [46] on the MetaMathQA dataset [56] by different adaptation methods and test the adaptation performance on the GSM8K [7] and MATH [56] validation sets. Following LoRA [20], each method only adapts the query and value projection matrices of LLaMA2-7B. The results in Figure 1c show that HRA outperforms its competitors on both GSM8K and MATH when we set $r=32$ and make it have the same number of trainable parameters as BOFT [34]. Furthermore, the HRA with $r=16$ utilizes only half the trainable parameters of BOFT yet still surpasses its performance, which demonstrates the efficiency of HRA. In addition, the HRA with the orthogonality regularization achieves a trade-off between model capacity and regularity. In Figure 4, we test the robustness of HRA to $\\lambda$ , demonstrating that $r=8$ ", "page_idx": 6}, {"type": "image", "img_path": "LzLeAscHnj/tmp/c50e8b97174a66e233a1ee431a7343ffa296b29802872f81456c524719641b51.jpg", "img_caption": ["Figure 4: The robustness of HRA $\\boldsymbol{r}=8,$ ) to $\\lambda$ in mathematical reasoning tasks. "], "img_footnote": [], "page_idx": 6}, {"type": "text", "text": "the performance of the HRA with is stable when $\\lambda\\in[10^{-5},10^{-3}]$ . For the HRA using more HRs (e.g., $r\\,=\\,16$ and 32), we set $\\lambda=10^{-4}$ based on this robustness test result, balancing the performance on GSM8K and MATH. As shown in Table 1c, the best performance is achieved when $r=32$ and $\\lambda=10^{-4}$ . ", "page_idx": 6}, {"type": "text", "text": "Besides, to verify whether HRA can better retain pre-training knowledge, we fine-tune LLaMA-2 7B on the MATHQA dataset by LoRA and HRA, respectively, and check the degradation of model performance on classic NLP tasks, including typical language tasks in ARC [55], HellaSwag [58], MMLU [17], Winogrande [42], and a coding task in HumanEval [6]. Ideally, after adaptation, we hope that the model can still maintain its high performance in the NLP tasks. The results in Table 3 shows that compared to LoRA, HRA retains more of the original model’s knowledge, whose performance degradation is less severe than LoRA’s. In the HumanEval task, its performance is even better than that of the original model (which we think is because the MATHQA dataset contains many samples relevant to logic and reasoning tasks and thus is useful in the HumanEval task). ", "page_idx": 6}, {"type": "table", "img_path": "LzLeAscHnj/tmp/e502b6c79fff499e1d6117507f8bebd2da0b73b91b0280be856ea9a7b5f6944c.jpg", "table_caption": ["Table 3: The results $(\\%)$ of LLaMA2-7B on classic natural language processing tasks after fine-tuned on MATHQA by LoRA and HRA, respectively. "], "table_footnote": [], "page_idx": 7}, {"type": "table", "img_path": "LzLeAscHnj/tmp/939f68e9b72de55e613ee210b356070a9c0c8f99b773a49c3239d6fe51fcbfb3.jpg", "table_caption": ["Table 4: Results of various methods on subject-driven generation and controllable generation. For each evaluation metric, the best result is shown in bold, and the second best result is shown in underline. For HRA and its variants, we set $r=7$ and 8 for subjective-driven generation and controllable generation, respectively. "], "table_footnote": [], "page_idx": 7}, {"type": "text", "text": "", "page_idx": 7}, {"type": "text", "text": "4.3 Controllable Text-to-Image Diffusion Models ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "Following OFT [37] and BOFT [34], we evaluate HRA on adapting pre-trained Stable Diffusion (SD) [40] for subject-driven generation and controllable generation, respectively. For a fair comparison, we employ experimental procedures and evaluation metrics as the same as OFT [37]: ", "page_idx": 7}, {"type": "text", "text": "• Subject-driven generation. Given several images of a specific subject and a textual prompt, subject-driven generation aims to generate images of the same subject in a context aligning with the prompt. Taking SD as the backbone model, we evaluate the generation performance of different model adaptation methods, including DreamBooth [41], LoRA [20], OFT and its variant COFT [37], and our HRA. Following DreamBooth [41], we train and evaluate on generating 25 subjects, each of which corresponds to 30 prompts. ", "page_idx": 7}, {"type": "text", "text": "• Controllable generation. Controllable generation aims to generate images aligning with a textual prompt and additional control signals (such as facial landmark annotations, canny edges, and segmentation maps). We conduct experiments on three challenging controllable generation tasks: Canny edge to image (C2I) on the COCO dataset [32], landmark to face (L2F) on the CelebA-HQ dataset [23, 52], and segmentation map to image (S2I) on the ADE20K dataset [64]. In this experiment, we use DreamBooth [41], ControlNet [61], T2I-Adapter [36], LoRA [20], OFT and its variant COFT [37], and BOFT [34] as baselines. ", "page_idx": 7}, {"type": "text", "text": "Table 4 shows the quantitative experimental results. In the subject-driven generation task, we evaluate three crucial aspects of generated images: subject fidelity (DINO [3], CLIP-I [38]), textual prompt fidelity (CLIP-T [38]), and sample diversity (LPIPS [63]). It can be observed that HRA achieves remarkable improvement across almost all metrics. In addition, we find that without the orthogonality $\\left.\\lambda=0\\right.$ ), HRA achieves the highest subject fidelity while sacrificing textual prompt fidelity and sample diversity to some extent, while the strictly-orthogonal HRA $\\left.\\lambda\\rightleftharpoons\\infty$ ) shows opposite tendencies. Applying the orthogonality regularization with $\\lambda=10^{-3}$ makes HRA balance the performance in all the metrics. Similarly, in the three controllable generation tasks, HRA demonstrates stronger and more precise control compared to the baselines. However, in these tasks, the strictly-orthogonal HRA leads to suboptimal performance. It means that these tasks require our adapter to have sufficient capacity, but the strict orthogonality constrains its capacity too much. In both tasks, HRA demonstrates the smallest number of trainable parameters among the compared methods. Figures 5 and 6 provide typical qualitative results, demonstrating that the images generated based on HRA have good visual effects and well-aligned semantics. ", "page_idx": 7}, {"type": "image", "img_path": "LzLeAscHnj/tmp/1ddc0558d03b82e73c370b82d1a4caeda85ef71678ff642809e8f61cef9ca366.jpg", "img_caption": ["Figure 5: Qualitative results on subject-driven generation. "], "img_footnote": [], "page_idx": 8}, {"type": "text", "text": "", "page_idx": 8}, {"type": "text", "text": "5 Conclusion ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "In this study, we have proposed a simple but effective Householder reflection adaptation method and have demonstrated its usefulness in various adaptation tasks. The proposed HRA method bridges the gap between low-rank and orthogonal adaptation strategies. It simplifies the implementation of OFT while inheriting its theoretical guarantees on the retention of pre-training knowledge. In addition, we show that controlling the orthogonality of the Householder reflections can achieve the trade-off between HRA’s model capacity and its regularity. In the future, we would like to improve HRA for practical applications, including accelerating its computation, reducing its memory cost, exploring other regularizers for parameter matrices, and adjusting the weights of the regularizers automatically. We also plan to test HRA on adapting more advanced LLMs, e.g., LLaMA3 and Grok-1. ", "page_idx": 8}, {"type": "image", "img_path": "LzLeAscHnj/tmp/592b9be5505637b994fb65b233831abb7f93eb8a25f83373c908ff39cd540a7f.jpg", "img_caption": ["Figure 6: Comparisons for various adaptation methods on controllable generation, in which the control signals include Canny edges, face landmarks, and semantic segmentation results of reference images. "], "img_footnote": [], "page_idx": 9}, {"type": "text", "text": "Acknowledgments and Disclosure of Funding ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "This work was supported by National Natural Science Foundation (92270110, 62106271), Beijing Natural Science Foundation (L233008), the Fundamental Research Funds for the Central Universities, and the Research Funds of Renmin University of China. We also acknowledge the support provided by the fund for building world-class universities (disciplines) of Renmin University of China and by the funds from Engineering Research Center of Next-Generation Intelligent Search and Recommendation, Ministry of Education, and from Intelligent Social Governance Interdisciplinary Platform, Major Innovation & Planning Interdisciplinary Platform for the “Double-First Class” Initiative, Renmin University of China. ", "page_idx": 10}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "[1] Teodor Banica and Roland Speicher. Liberation of orthogonal lie groups. Advances in Mathematics, 222(4):1461–1501, 2009.   \n[2] Åke Björck. Numerics of gram-schmidt orthogonalization. Linear Algebra and Its Applications, 197:297–316, 1994.   \n[3] Mathilde Caron, Hugo Touvron, Ishan Misra, Hervé Jégou, Julien Mairal, Piotr Bojanowski, and Armand Joulin. Emerging properties in self-supervised vision transformers. In Proceedings of the IEEE/CVF international conference on computer vision, pages 9650–9660, 2021.   \n[4] Aochuan Chen, Ziqi Gao, Zijing Liu, Yu Li, and Jia Li. Parameter-efficient fine-tuning via circular convolution. arXiv preprint arXiv:2407.19342, 2024.   \n[5] Beidi Chen, Tri Dao, Kaizhao Liang, Jiaming Yang, Zhao Song, Atri Rudra, and Christopher Re. Pixelated butterfly: Simple and efficient sparse training for neural network models. In International Conference on Learning Representations, 2021.   \n[6] Mark Chen, Jerry Tworek, Heewoo Jun, Qiming Yuan, Henrique Ponde de Oliveira Pinto, Jared Kaplan, Harri Edwards, Yuri Burda, Nicholas Joseph, Greg Brockman, Alex Ray, Raul Puri, Gretchen Krueger, Michael Petrov, Heidy Khlaaf, Girish Sastry, Pamela Mishkin, Brooke Chan, Scott Gray, Nick Ryder, Mikhail Pavlov, Alethea Power, Lukasz Kaiser, Mohammad Bavarian, Clemens Winter, Philippe Tillet, Felipe Petroski Such, Dave Cummings, Matthias Plappert, Fotios Chantzis, Elizabeth Barnes, Ariel Herbert-Voss, William Hebgen Guss, Alex Nichol, Alex Paino, Nikolas Tezak, Jie Tang, Igor Babuschkin, Suchir Balaji, Shantanu Jain, William Saunders, Christopher Hesse, Andrew N. Carr, Jan Leike, Josh Achiam, Vedant Misra, Evan Morikawa, Alec Radford, Matthew Knight, Miles Brundage, Mira Murati, Katie Mayer, Peter Welinder, Bob McGrew, Dario Amodei, Sam McCandlish, Ilya Sutskever, and Wojciech Zaremba. Evaluating large language models trained on code, 2021.   \n[7] Karl Cobbe, Vineet Kosaraju, Mohammad Bavarian, Mark Chen, Heewoo Jun, Lukasz Kaiser, Matthias Plappert, Jerry Tworek, Jacob Hilton, Reiichiro Nakano, et al. Training verifiers to solve math word problems. arXiv preprint arXiv:2110.14168, 2021.   \n[8] Tri Dao, Nimit Sohoni, Albert Gu, Matthew Eichhorn, Amit Blonder, Megan Leszczynski, Atri Rudra, and Christopher Ré. Kaleidoscope: An efficient, learnable representation for all structured linear maps. In International Conference on Learning Representations, 2019.   \n[9] Tim Dettmers, Artidoro Pagnoni, Ari Holtzman, and Luke Zettlemoyer. Qlora: Efficient finetuning of quantized llms. Advances in Neural Information Processing Systems, 36, 2024.   \n[10] Zihao Fu, Haoran Yang, Anthony Man-Cho So, Wai Lam, Lidong Bing, and Nigel Collier. On the effectiveness of parameter-efficient fine-tuning. In Proceedings of the AAAI Conference on Artificial Intelligence, volume 37, pages 12799–12807, 2023.   \n[11] Ziqi Gao, Qichao Wang, Aochuan Chen, Zijing Liu, Bingzhe Wu, Liang Chen, and Jia Li. Parameter-efficient fine-tuning with discrete fourier transform. arXiv preprint arXiv:2405.03003, 2024.   \n[12] Gene H Golub and Charles F Van Loan. Matrix computations. JHU press, 2013.   \n[13] Karen Hambardzumyan, Hrant Khachatrian, and Jonathan May. Warp: Word-level adversarial reprogramming. In Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers), pages 4921–4933, 2021.   \n[14] Chuchu Han, Ruochen Zheng, Changxin Gao, and Nong Sang. Complementation-reinforced attention network for person re-identification. IEEE Transactions on Circuits and Systems for Video Technology, 30(10):3433–3445, 2019.   \n[15] Pengcheng He, Jianfeng Gao, and Weizhu Chen. Debertav3: Improving deberta using electra-style pre-training with gradient-disentangled embedding sharing. arXiv preprint arXiv:2111.09543, 2021.   \n[16] Wu Hecong. ControlLoRA: A Lightweight Neural Network To Control Stable Diffusion Spatial Information, 2 2023.   \n[17] Dan Hendrycks, Collin Burns, Steven Basart, Andy Zou, Mantas Mazeika, Dawn Song, and Jacob Steinhardt. Measuring massive multitask language understanding, 2021.   \n[18] Tom Henighan, Jared Kaplan, Mor Katz, Mark Chen, Christopher Hesse, Jacob Jackson, Heewoo Jun, Tom B Brown, Prafulla Dhariwal, Scott Gray, et al. Scaling laws for autoregressive generative modeling. arXiv preprint arXiv:2010.14701, 2020.   \n[19] Alston S Householder. Unitary triangularization of a nonsymmetric matrix. Journal of the ACM (JACM), 5(4):339–342, 1958.   \n[20] Edward J Hu, Phillip Wallis, Zeyuan Allen-Zhu, Yuanzhi Li, Shean Wang, Lu Wang, Weizhu Chen, et al. Lora: Low-rank adaptation of large language models. In International Conference on Learning Representations, 2021.   \n[21] Nam Hyeon-Woo, Moon Ye-Bin, and Tae-Hyun Oh. Fedpara: Low-rank hadamard product for communication-efficient federated learning. In International Conference on Learning Representations, 2021.   \n[22] Jared Kaplan, Sam McCandlish, Tom Henighan, Tom B Brown, Benjamin Chess, Rewon Child, Scott Gray, Alec Radford, Jeffrey Wu, and Dario Amodei. Scaling laws for neural language models. arXiv preprint arXiv:2001.08361, 2020.   \n[23] Tero Karras, Timo Aila, Samuli Laine, and Jaakko Lehtinen. Progressive growing of gans for improved quality, stability, and variation. arXiv preprint arXiv:1710.10196, 2017.   \n[24] Hyunjik Kim, George Papamakarios, and Andriy Mnih. The lipschitz constant of self-attention. In International Conference on Machine Learning, pages 5562–5571. PMLR, 2021.   \n[25] Dawid Jan Kopiczko, Tijmen Blankevoort, and Yuki Markus Asano. Vera: Vector-based random matrix adaptation. arXiv preprint arXiv:2310.11454, 2023.   \n[26] Jitin Krishnan, Hemant Purohit, and Huzefa Rangwala. Diversity-based generalization for neural unsupervised text classification under domain shift. In ECML-PKDD, 2020.   \n[27] Mingu Lee, Jinkyu Lee, Hye Jin Jang, Byeonggeun Kim, Wonil Chang, and Kyuwoong Hwang. Orthogonality constrained multi-head attention for keyword spotting. In 2019 IEEE Automatic Speech Recognition and Understanding Workshop (ASRU), pages 86–92. IEEE, 2019.   \n[28] Brian Lester, Rami Al-Rfou, and Noah Constant. The power of scale for parameter-efficient prompt tuning. In Proceedings of the 2021 Conference on Empirical Methods in Natural Language Processing, pages 3045–3059, 2021.   \n[29] Qiyang Li, Saminul Haque, Cem Anil, James Lucas, Roger Grosse, and Jörn-Henrik Jacobsen. Preventing gradient attenuation in lipschitz constrained convolutional networks. In Proceedings of the 33rd International Conference on Neural Information Processing Systems, pages 15390– 15402, 2019.   \n[30] Xiang Lisa Li and Percy Liang. Prefix-tuning: Optimizing continuous prompts for generation. In Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers), pages 4582–4597, 2021.   \n[31] Yixiao Li, Yifan Yu, Chen Liang, Nikos Karampatziakis, Pengcheng He, Weizhu Chen, and Tuo Zhao. Loftq: Lora-fine-tuning-aware quantization for large language models. In The Twelfth International Conference on Learning Representations, 2023.   \n[32] Tsung-Yi Lin, Michael Maire, Serge Belongie, James Hays, Pietro Perona, Deva Ramanan, Piotr Dollár, and C Lawrence Zitnick. Microsoft coco: Common objects in context. In Computer Vision–ECCV 2014: 13th European Conference, Zurich, Switzerland, September 6-12, 2014, Proceedings, Part V 13, pages 740–755. Springer, 2014.   \n[33] Shih-Yang Liu, Chien-Yi Wang, Hongxu Yin, Pavlo Molchanov, Yu-Chiang Frank Wang, Kwang-Ting Cheng, and Min-Hung Chen. Dora: Weight-decomposed low-rank adaptation. arXiv preprint arXiv:2402.09353, 2024.   \n[34] Weiyang Liu, Zeju Qiu, Yao Feng, Yuliang Xiu, Yuxuan Xue, Longhui Yu, Haiwen Feng, Zhen Liu, Juyeon Heo, Songyou Peng, et al. Parameter-efficient orthogonal finetuning via butterfly factorization. In International Conference on Learning Representations, 2024.   \n[35] Fanxu Meng, Zhaohui Wang, and Muhan Zhang. Pissa: Principal singular values and singular vectors adaptation of large language models. arXiv preprint arXiv:2404.02948, 2024.   \n[36] Chong Mou, Xintao Wang, Liangbin Xie, Yanze Wu, Jian Zhang, Zhongang Qi, and Ying Shan. T2i-adapter: Learning adapters to dig out more controllable ability for text-to-image diffusion models. In Proceedings of the AAAI Conference on Artificial Intelligence, volume 38, pages 4296–4304, 2024.   \n[37] Zeju Qiu, Weiyang Liu, Haiwen Feng, Yuxuan Xue, Yao Feng, Zhen Liu, Dan Zhang, Adrian Weller, and Bernhard Schölkopf. Controlling text-to-image diffusion by orthogonal finetuning. Advances in Neural Information Processing Systems, 36:79320–79362, 2023.   \n[38] Alec Radford, Jong Wook Kim, Chris Hallacy, Aditya Ramesh, Gabriel Goh, Sandhini Agarwal, Girish Sastry, Amanda Askell, Pamela Mishkin, Jack Clark, et al. Learning transferable visual models from natural language supervision. In International conference on machine learning, pages 8748–8763. PMLR, 2021.   \n[39] Samyam Rajbhandari, Conglong Li, Zhewei Yao, Minjia Zhang, Reza Yazdani Aminabadi, Ammar Ahmad Awan, Jeff Rasley, and Yuxiong He. Deepspeed-moe: Advancing mixture-ofexperts inference and training to power next-generation ai scale. In International conference on machine learning, pages 18332–18346. PMLR, 2022.   \n[40] Robin Rombach, Andreas Blattmann, Dominik Lorenz, Patrick Esser, and Björn Ommer. Highresolution image synthesis with latent diffusion models. In Proceedings of the IEEE/CVF conference on computer vision and pattern recognition, pages 10684–10695, 2022.   \n[41] Nataniel Ruiz, Yuanzhen Li, Varun Jampani, Yael Pritch, Michael Rubinstein, and Kfir Aberman. Dreambooth: Fine tuning text-to-image diffusion models for subject-driven generation. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 22500–22510, 2023.   \n[42] Keisuke Sakaguchi, Ronan Le Bras, Chandra Bhagavatula, and Yejin Choi. Winogrande: An adversarial winograd schema challenge at scale, 2019.   \n[43] Jure Sokolic´, Raja Giryes, Guillermo Sapiro, and Miguel RD Rodrigues. Robust large margin deep neural networks. IEEE Transactions on Signal Processing, 65(16):4265–4280, 2017.   \n[44] Yi-Lin Sung, Varun Nair, and Colin A Raffel. Training neural networks with fixed sparse masks. Advances in Neural Information Processing Systems, 34:24193–24205, 2021.   \n[45] Rohan Taori, Ishaan Gulrajani, Tianyi Zhang, Yann Dubois, Xuechen Li, Carlos Guestrin, Percy Liang, and Tatsunori B Hashimoto. Stanford alpaca: an instruction-following llama model (2023). URL https://github. com/tatsu-lab/stanford_alpaca, 2023.   \n[46] Hugo Touvron, Louis Martin, Kevin Stone, Peter Albert, Amjad Almahairi, Yasmine Babaei, Nikolay Bashlykov, Soumya Batra, Prajjwal Bhargava, Shruti Bhosale, et al. Llama 2: Open foundation and fine-tuned chat models. arXiv preprint arXiv:2307.09288, 2023.   \n[47] Yusuke Tsuzuku, Issei Sato, and Masashi Sugiyama. Lipschitz-margin training: Scalable certification of perturbation invariance for deep neural networks. Advances in neural information processing systems, 31, 2018.   \n[48] Mojtaba Valipour, Mehdi Rezagholizadeh, Ivan Kobyzev, and Ali Ghodsi. Dylora: Parameterefficient tuning of pre-trained models using dynamic search-free low-rank adaptation. In Proceedings of the 17th Conference of the European Chapter of the Association for Computational Linguistics, pages 3274–3287, 2023.   \n[49] Tu Vu, Brian Lester, Noah Constant, Rami Al-Rfou, and Daniel Cer. Spot: Better frozen model adaptation through soft prompt transfer. In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), pages 5039–5059, 2022.   \n[50] Alex Wang, Amanpreet Singh, Julian Michael, Felix Hill, Omer Levy, and Samuel R Bowman. Glue: A multi-task benchmark and analysis platform for natural language understanding. In 7th International Conference on Learning Representations, ICLR 2019, 2019.   \n[51] Jiyao Wei, Jian Liao, Zhenfei Yang, Suge Wang, and Qiang Zhao. Bilstm with multi-polarity orthogonal attention for implicit sentiment analysis. Neurocomputing, 383:165–173, 2020.   \n[52] Weihao Xia, Yujiu Yang, Jing-Hao Xue, and Baoyuan Wu. Tedigan: Text-guided diverse face image generation and manipulation. In Proceedings of the IEEE/CVF conference on computer vision and pattern recognition, pages 2256–2265, 2021.   \n[53] Lingling Xu, Haoran Xie, Si-Zhao Joe Qin, Xiaohui Tao, and Fu Lee Wang. Parameter-efficient fine-tuning methods for pretrained language models: A critical review and assessment. arXiv preprint arXiv:2312.12148, 2023.   \n[54] Yuhui Xu, Lingxi Xie, Xiaotao Gu, Xin Chen, Heng Chang, Hengheng Zhang, Zhengsu Chen, XIAOPENG ZHANG, and Qi Tian. Qa-lora: Quantization-aware low-rank adaptation of large language models. In The Twelfth International Conference on Learning Representations, 2023.   \n[55] Vikas Yadav, Steven Bethard, and Mihai Surdeanu. Quick and (not so) dirty: Unsupervised selection of justification sentences for multi-hop question answering. In Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP). Association for Computational Linguistics, 2019.   \n[56] Longhui Yu, Weisen Jiang, Han Shi, Jincheng Yu, Zhengying Liu, Yu Zhang, James T Kwok, Zhenguo Li, Adrian Weller, and Weiyang Liu. Metamath: Bootstrap your own mathematical questions for large language models. arXiv preprint arXiv:2309.12284, 2023.   \n[57] Elad Ben Zaken, Yoav Goldberg, and Shauli Ravfogel. Bitfit: Simple parameter-efficient fine-tuning for transformer-based masked language-models. In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers), pages 1–9, 2022.   \n[58] Rowan Zellers, Ari Holtzman, Yonatan Bisk, Ali Farhadi, and Yejin Choi. Hellaswag: Can a machine really finish your sentence?, 2019.   \n[59] Aston Zhang, Alvin Chan, Yi Tay, Jie Fu, Shuohang Wang, Shuai Zhang, Huajie Shao, Shuochao Yao, and Roy Ka-Wei Lee. On orthogonality constraints for transformers. In Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing, volume 2, pages 375–382. Association for Computational Linguistics, 2021.   \n[60] Feiyu Zhang, Liangzhi Li, Junhao Chen, Zhouqiang Jiang, Bowen Wang, and Yiming Qian. Increlora: Incremental parameter allocation method for parameter-efficient fine-tuning. arXiv preprint arXiv:2308.12043, 2023.   \n[61] Lvmin Zhang, Anyi Rao, and Maneesh Agrawala. Adding conditional control to text-to-image diffusion models. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 3836–3847, 2023.   \n[62] Qingru Zhang, Minshuo Chen, Alexander Bukharin, Pengcheng He, Yu Cheng, Weizhu Chen, and Tuo Zhao. Adaptive budget allocation for parameter-efficient fine-tuning. In The Eleventh International Conference on Learning Representations, 2023.   \n[63] Richard Zhang, Phillip Isola, Alexei A Efros, Eli Shechtman, and Oliver Wang. The unreasonable effectiveness of deep features as a perceptual metric. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 586–595, 2018.   \n[64] Bolei Zhou, Hang Zhao, Xavier Puig, Sanja Fidler, Adela Barriuso, and Antonio Torralba. Scene parsing through ade20k dataset. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 633–641, 2017. ", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "", "page_idx": 13}, {"type": "text", "text": "", "page_idx": 14}, {"type": "text", "text": "A The Impacts of Orthogonality ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "Given a weight matrix $W\\in\\mathbb{R}^{d_{\\mathrm{{out}}}\\times d}$ , we assume that $d_{\\mathrm{out}}\\geq d$ . Denote the SVD of $W$ as $Q\\Sigma V^{\\top}$ , where $\\Sigma=\\mathrm{diag}(\\sigma_{1},...,\\sigma_{d})$ , $\\sigma_{1}\\geq\\sigma_{2}\\geq...\\geq\\sigma_{d}$ , and $\\pmb{V}=[\\pmb{v}_{1},...,\\pmb{v}_{d}]$ is the right singular matrix. When $r=1$ , we have ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\|\\boldsymbol{W}-\\boldsymbol{W}\\boldsymbol{H}^{(1)}\\|_{F}^{2}=4\\|\\boldsymbol{W}u_{1}\\boldsymbol{u}_{1}^{\\top}\\|_{F}^{2}=4\\mathrm{tr}(\\boldsymbol{u}_{1}^{\\top}\\boldsymbol{V}\\boldsymbol{\\Sigma}^{2}\\boldsymbol{V}u_{1}),\\;\\mathrm{for}\\;u_{1}\\in\\mathbb{S}^{d-1}.\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "Obviously, when ${\\pmb u}_{1}={\\pmb v}_{1}$ , the distance between $W$ and $W H^{(1)}$ is maximized. ", "page_idx": 15}, {"type": "text", "text": "Applying mathematical induction, we assume that $\\|\\boldsymbol{W}-\\boldsymbol{W}\\boldsymbol{H}^{(r)}\\|_{F}$ is maximized when $U_{r}=$ $V_{r}=[\\pmb{v}_{1},...,\\pmb{v}_{r}]$ for $r<d$ . ", "page_idx": 15}, {"type": "text", "text": "Then, in the case of $r+1$ , for $\\pmb{u}\\in\\mathbb{S}^{d-1}$ , we have ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\|\\boldsymbol{W}-\\boldsymbol{W}\\boldsymbol{H}^{(r+1)}\\|_{F}^{2}=\\|\\boldsymbol{W}-\\boldsymbol{W}\\boldsymbol{H}^{(r)}(I-2\\boldsymbol{u}\\boldsymbol{u}^{\\top})\\|_{F}^{2}=4\\|\\boldsymbol{W}V_{r}V_{r}^{\\top}-\\boldsymbol{W}\\boldsymbol{u}\\boldsymbol{u}^{\\top}\\|_{F}^{2},\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "where the equations are based on the facts that $i$ ) HR and the chain of HRs are unitary matrices and $i i)$ the Frobenius norm is unitary-invariant. ", "page_idx": 15}, {"type": "text", "text": "Note that, $V\\,=\\,[v_{1},...,v_{d}]\\,=\\,[V_{r},V_{d-r}]$ works as an orthonormal basis of $\\mathbb{R}^{d}$ , so we have $\\textbf{\\em u}=$ $V\\beta=V_{r}\\beta_{r}+V_{d-r}\\beta_{d-r}$ , where $\\beta=[\\beta_{r};\\beta_{d-r}]\\in\\mathbb{S}^{d-1}$ . Accordingly, we rewrite equation 8 as ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\quad\\|W-W H^{(r+1)}\\|_{F}^{2}}\\\\ &{=4\\|W V_{r}V_{r}^{\\top}-W u u^{\\top}\\|_{F}^{2}}\\\\ &{=4\\|\\Sigma V^{\\top}V_{r}V_{r}^{\\top}-\\Sigma V^{\\top}u u^{\\top}\\|_{F}^{2}}\\\\ &{=4\\mathrm{tr}([V_{r},\\mathbf{0}_{d\\times(d-r)}]\\Sigma^{2}[V_{r},\\mathbf{0}_{d\\times(d-r)}]^{\\top})-8\\mathrm{tr}([V_{r},\\mathbf{0}_{d\\times(d-r)}]\\Sigma^{2}V^{\\top}u u^{\\top})+4\\mathrm{tr}(u^{\\top}V\\Sigma^{2}V^{\\top}u)}\\\\ &{=4\\sum_{i=1}^{r}\\sigma_{i}^{2}+4\\mathrm{tr}(\\beta^{\\top}\\Sigma^{2}\\beta)-8\\mathrm{tr}(\\beta_{r}^{\\top}\\Sigma_{r}^{2}\\beta_{r})}\\\\ &{=4\\sum_{i=1}^{r}\\sigma_{i}^{2}+4\\mathrm{tr}(\\beta_{d-r}^{\\top}\\Sigma_{d-r}^{2}\\beta_{d-r})-4\\mathrm{tr}(\\beta_{r}^{\\top}\\Sigma_{r}^{2}\\beta_{r}),}\\end{array}\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "where $\\Sigma=\\mathrm{diag}(\\Sigma_{r},\\Sigma_{d-r})$ . Obviously, when $\\beta_{r}={\\bf0}_{r}$ and $\\beta_{d-r}=[1,0,..,0]^{\\top}\\in\\mathbb{R}^{d-r}$ , the distance between $W$ and $W H^{(r+1)}$ is maximized. In such a situation, $\\pmb{u}=\\pmb{V}\\beta=\\pmb{v}_{r+1}$ , corresponds to the $(r+1)$ -th right singular vector, and $U_{t+1}=V_{t+1}$ accordingly. ", "page_idx": 15}, {"type": "text", "text": "B Implementation Details ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "B.1 Natural Language Understanding ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "Following BOFT [34], we use the same batch size (i.e., 32 for each task), maximum sequence length, and tune the learning rate, number of training epochs, warm-up steps, as well as $\\lambda$ in the R-HRA method. Additionally, the dropout rate is consistently set to 1E-01. We adapt every linear layer in DeBERTaV3 and froze the pre-trained weights for all tasks. Both training and testing are conducted on 7 NVIDIA GeForce RTX 3090 GPUs. Detailed hyperparameter setups are presented in Table 5. ", "page_idx": 15}, {"type": "table", "img_path": "LzLeAscHnj/tmp/b59c7e906a91ed5b4f0fcbe8f2d477ef85980f2bd559b6425ba36b33fe8b8e62.jpg", "table_caption": ["Table 5: The hyperparameters for DeBERTaV3-base on tasks included in the GLUE benchmark. "], "table_footnote": [], "page_idx": 15}, {"type": "text", "text": "B.2 Mathematical Reasoning ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Following BOFT [34], we fine-tune the LLaMA2-7B model on the first generated 512 tokens, which is sufficient for these two tasks. In all experiments, we fix the training epoch as 2 and use the cosine learning scheduler and the warm-up ratio is set as 0.005. We follow the evaluation tools in MetaMathQA [56], where they use the Alpaca [45] prompt and evaluate the model in zero-shot. The generation temperature is set as 0 for both tasks. In our proposed method, the learning rate of $\\mathrm{HRA}_{\\lambda=0}$ is set to 1E-05, $\\mathrm{HRA}_{\\lambda=10^{-4}}$ is set to 3E-05, and $\\mathrm{HRA}_{\\lambda=\\infty}$ is set to 1E-03. Both training and testing are conducted on 8 NVIDIA L20 GPUs. ", "page_idx": 16}, {"type": "text", "text": "B.3 Subject-driven Generation ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Following OFT [37], we use the same AdamW optimizer with a weight decay of 1E-02 and fine-tune the linear layers including $W_{q}$ , $W_{k}$ , $W_{v}$ , and $W_{o}$ in the UNet model. The learning rate is set to 7E-06, with a batch size of 1, and the number of training steps is approximately 2000 steps. Both training and testing are conducted on 7 NVIDIA GeForce RTX 3090 GPUs. ", "page_idx": 16}, {"type": "text", "text": "B.4 Controllable Generation ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Our data processing procedure and architecture design are consistent with OFT [37]. In addition to injecting trainable HRA weights into the stable diffusion model, we employ a lightweight neural network [16] to encode the control signals. We fine-tune the model for 11 epochs for C2I and 20 epochs for L2F and S2I. The learning rate is set to 3E-05 with a batch size of 8 for all three tasks. Both training and testing are conducted on 8 NVIDIA RTX A6000 GPUs. ", "page_idx": 16}, {"type": "text", "text": "B.5 Analysis of Computational Cost and Robustness ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "To compare the computational efficiency, we adapt LLaMA2-7B on the MetaMathQA dataset by HRA and other baselines and test their training time and GPU memory costs. For a fair comparison, we conduct all the experiments on 8 NVIDIA RTX A6000 GPUs, and apply the same batch size and almost the same number of trainable parameters across all the models. The results in Table 6 show that HRA’s peak memory usage is comparable to that of baselines, while its training time is less. These results demonstrate HRA’s superiority in computational efficiency and adaptation performance. ", "page_idx": 16}, {"type": "table", "img_path": "LzLeAscHnj/tmp/541316eac0df5c861cdb0b0e720b684f6f9590030fc9e8e8175ecde54f70b7fb.jpg", "table_caption": ["Table 6: The comparison for various models on their computational efficiency. "], "table_footnote": [], "page_idx": 16}, {"type": "text", "text": "To analyze the impact of orthogonality, we conduct mathematical reasoning experiments with different values of $\\lambda$ . The results in Table 7 shows that a) the performance of HRA is relatively stable concerning the change of $\\lambda$ , b) in the wide range of $\\lambda$ , HRA is superior to the baselines, c) even if ignoring the regularizer ( $\\mathit{\\dot{\\Delta}}\\lambda\\,=\\,0_{\\mathit{\\Delta}}$ ), our method still outperforms the baselines. These results demonstrate the effectiveness and robustness of implementing orthogonal adaptation based on Householder reflections. In the future, we will consider further analyzing the impacts of $\\lambda$ in theory. ", "page_idx": 16}, {"type": "table", "img_path": "LzLeAscHnj/tmp/7e1f7580d461562cb3b10f9bf460f96ece73a73cd520671f92d3ae568b169097.jpg", "table_caption": ["Table 7: Results $(\\%)$ of HRA with other values of $\\lambda$ for mathematical reasoning. "], "table_footnote": [], "page_idx": 16}, {"type": "text", "text": "C More Experimental Results ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "C.1 Subject-driven Generation ", "page_idx": 17}, {"type": "image", "img_path": "LzLeAscHnj/tmp/8a2021f52e8b37a0df1baab5a890b149402652b81dfc3123c30912d3551633e3.jpg", "img_caption": ["Figure 7: More qualitative results on subject-driven generation. "], "img_footnote": [], "page_idx": 17}, {"type": "image", "img_path": "LzLeAscHnj/tmp/2d5f85d4bca041bafba9463d417760828caaaa03c4aa7e50cad27acfd549c08e.jpg", "img_caption": ["Figure 8: More qualitative results on subject-driven generation. "], "img_footnote": [], "page_idx": 18}, {"type": "text", "text": "C.2 Controllable Generation ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "C.2.1 Canny Edge to Image ", "page_idx": 19}, {"type": "image", "img_path": "LzLeAscHnj/tmp/cf214d5b83f57de568f9c61c08c3e88e0caeccdeca41a73f06c77e293f587e86.jpg", "img_caption": ["Figure 9: More qualitative results on canny edge to image. "], "img_footnote": [], "page_idx": 19}, {"type": "text", "text": "C.2.2 Landmark to Face ", "text_level": 1, "page_idx": 20}, {"type": "image", "img_path": "LzLeAscHnj/tmp/186bfbd75dc6c18cf37f580e329565c44844a963a13ed68ddb83bc3a357bffe0.jpg", "img_caption": ["Figure 10: More qualitative results on landmark to face. "], "img_footnote": [], "page_idx": 20}, {"type": "image", "img_path": "LzLeAscHnj/tmp/5741b4435a502c326204c1e885693108cc9638abf5b008501d7a20beb357f492.jpg", "img_caption": ["Figure 11: More qualitative results on segmentation to image. "], "img_footnote": [], "page_idx": 21}, {"type": "text", "text": "Case Study ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: There were 50 cats on a rock. Four boats came and carried away 5 cats each, and later, 3/5 of the remaining cats ran after a mouse they’d seen. How many cats were left on the rock? (Ground-truth answer is 12) ", "page_idx": 22}, {"type": "text", "text": "Llama-2 Answer: Initially, there were 50 cats on the rock. Then, 4 boats came and carried away 5 cats each, so the total number of cats carried away is: 4 boats $\\textrm{x5}$ cats/boat $=20$ cats So, the number of cats left on the rock is: 50 cats - 20 cats $=30$ cats Next, 3/5 of the remaining cats (which is the same as $60\\%$ of the cats) ran after a mouse they’d seen. This means that: 30 cats $\\mathrm{~x~}60\\%=18$ cats left the rock to chase the mouse. Therefore, there are 30 cats left on the rock. The answer is 30 ", "page_idx": 22}, {"type": "text", "text": "$\\mathbf{HRA}_{32,0}$ Answer: There were 50 cats on the rock. Four boats came and carried away 5 cats each, so a total of $4*5=20$ cats were carried away. The remaining number of cats on the rock is $50\\textrm{-}20=30$ cats. Then, $3/5$ of the remaining cats ran after a mouse, so 3/5 $*30=24$ cats ran away. The number of cats left on the rock is $30-24=6$ cats. The answer is: 6 $\\mathbf{H}\\mathbf{R}\\mathbf{A}_{32,10^{-4}}$ Answer: There were 50 cats on the rock. Four boats came and carried away 5 cats each, so $4*5=20$ cats were carried away. After the cats were carried away, there were $50-20=30$ cats left on the rock. Then, $3/5$ of the remaining cats ran after a mouse, so $3/5*$ $30=18$ cats ran away. Therefore, there were $30-18=12$ cats left on the rock. The answer is: 12 ", "page_idx": 22}, {"type": "text", "text": "", "page_idx": 22}, {"type": "text", "text": "$\\mathbf{HRA}_{32,\\infty}$ Answer: There were 50 cats on the rock. Four boats came and carried away 5 cats each, so $4\\mathrm{~x~}5=20$ cats were carried away. The remaining cats on the rock are $50-20=30$ cats. 3/5 of the remaining cats ran after a mouse, so $3/5\\mathrm{~x~}30=18$ cats ran away. The number of cats left on the rock is $30-18=12$ cats. The answer is: 12 ", "page_idx": 22}, {"type": "text", "text": "Case Study 2 ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: James likes to check the coin return of the vending machine for change. One day he finds a quarter, two nickels, and 7 dimes. How much money in cents does James have? (Ground-truth answer is 105) ", "page_idx": 22}, {"type": "text", "text": "Llama-2 Answer: Based on the information provided in the instruction, James has a total of: $^*1$ quarter $=25$ cents $^*2$ nickels $=50$ cents $^*7$ dimes $=70$ cents Therefore, James has a total of 145 cents. The answer is 145 ", "page_idx": 22}, {"type": "text", "text": "$\\mathbf{HRA}_{32,0}$ Answer: First, we need to convert the coins to cents. One quarter is worth 25 cents. Two nickels are worth $2*5=10$ cents each. So, two nickels are worth 10 cents each. Seven dimes are worth $10*0.10=1$ cents each. So, seven dimes are worth 7 cents each. Now, we can add up the value of the coins. 25 cents $+\\,10$ cents $+\\,7$ cents $=42$ cents. Therefore, James has 42 cents. The answer is: 42 ", "page_idx": 22}, {"type": "text", "text": "$\\mathbf{H}\\mathbf{R}\\mathbf{A}_{32,10^{-4}}$ Answer: 1 quarter $=25$ cents 2 nickels $=2*5=10$ cents $7{\\mathrm{~dimes}}=7*10=70$ cents So, James has $25+10+70=105$ cents. The answer is: 105 ", "page_idx": 22}, {"type": "text", "text": "$\\mathbf{HRA}_{32,\\infty}$ Answer: First, we need to convert the coins to cents. 1 quarter is equal to 25 cents. 2 nickels is equal to $2*5=10$ cents. 7 dimes is equal to $7*10=70$ cents. Now, we can add up the total amount of money. $25+10+70=105$ cents. Therefore, James has 105 cents. The answer is: 105 ", "page_idx": 22}, {"type": "text", "text": "Case Study 3 ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Julia’s boat sprang a leak while she was out on the lake. The boat was taking on two liters of water for every ten feet she rowed back towards shore. It took her sixteen seconds to row twenty feet. The shore was 64 seconds away. How much water had the boat taken on by the time Julia reached shore? (Ground-truth answer is 16) ", "page_idx": 23}, {"type": "text", "text": "Llama-2 Answer: To find out how much water the boat took on by the time Julia reached shore, we need to use the information provided in the problem. We know that the boat takes on 2 liters of water for every 10 feet it rows back towards shore. So, if Julia rowed 20 feet (which takes her 16 seconds), the boat took on 2 liters of water. We also know that Julia rowed a total of 64 seconds to reach the shore. So, if she rowed 20 feet in 16 seconds, she rowed a total of 40 feet (20 feet x 2) in the remaining 44 seconds. This means the boat took on 8 liters of water (2 liters per 10 feet ${\\scriptsize\\mathbf{X}}\\,40$ feet). Therefore, by the time Julia reached the shore, the boat had taken on 8 liters of water. The answer is 8 ", "page_idx": 23}, {"type": "text", "text": "$\\mathbf{HRA}_{32,0}$ Answer: Julia rowed 20 feet in 16 seconds, so she rowed $20/16=1.25$ feet per second. The boat takes on 2 liters of water for every 10 feet rowed, so it takes on $2/10=0.2$ liters of water per second. Since Julia rowed 1.25 feet per second, the boat takes on $0.2~^{*}$ $1.25=0.25$ liters of water per second. The shore is 64 seconds away, so the boat takes on $0.25*64=16$ liters of water by the time Julia reaches shore. The answer is: 16 ", "page_idx": 23}, {"type": "text", "text": "$\\mathbf{H}\\mathbf{R}\\mathbf{A}_{32,10^{-4}}$ Answer: Julia rowed 20 feet in 16 seconds, so she rowed at a rate of $20/16=$ 1.25 feet per second. Since she was taking on 2 liters of water for every 10 feet she rowed, she was taking on $2/10*1.25=0.25$ liters of water per second. Since she was taking on 0.25 liters of water per second, and it took her 64 seconds to reach shore, the boat had taken on $0.25*64=16$ liters of water by the time she reached shore. The answer is: 16 ", "page_idx": 23}, {"type": "text", "text": "$\\mathbf{HRA}_{32,\\infty}$ Answer: Julia rowed 20 feet in 16 seconds. To find the rate at which the boat was taking on water, we divide the amount of water by the time it took to row 20 feet. So, the rate at which the boat was taking on water is 2 liters/10 feet $^{*}16$ seconds $=32$ liters/10 feet. Since Julia rowed 20 feet, the boat took on 32 liters/10 feet $^{*}\\,20$ feet $=640$ liters of water. Since the shore was 64 seconds away, the boat took on 640 liters of water in 64 seconds. Therefore, the boat took on 640 liters of water by the time Julia reached shore. The answer is: 640 ", "page_idx": 23}, {"type": "text", "text": "Case Study 4 ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Jillian’s handbag cost $\\mathbb{S}20$ less than 3 times as much as her shoes cost. If her shoes cost $\\mathbb{S}80$ , how much did her bag cost? (Ground-truth answer is 220) ", "page_idx": 23}, {"type": "text", "text": "Llama-2 Answer: f Jillian’s shoes cost $\\mathbb{S}80$ and her handbag cost $\\mathbb{S}20$ less than 3 times as much as her shoes cost, then we can set up the following equation: $3\\mathrm{x}=880-\\mathbb{S}20$ Solving for $\\mathbf{X}$ , we get: $\\mathrm{x}=\\mathbb{S}80-\\mathbb{S}20\\;\\mathrm{x}=\\mathbb{S}60\\;\\mathrm{Sc}$ o, Jillian’s handbag cost $\\mathbb{S}60$ . The answer is 60 ", "page_idx": 23}, {"type": "text", "text": "$\\mathbf{H}\\mathbf{R}\\mathbf{A}_{32,0}$ Answer: We know that Jillian’s shoes cost $\\mathbb{S}80$ . Her bag cost $\\mathbb{S}20$ less than 3 times as much as her shoes cost. So, her bag cost $\\mathbb{S}80*3-\\mathbb{S}20=\\mathbb{S}240-\\mathbb{S}20=\\mathbb{S}220$ . Therefore, Jillian’s bag cost $\\mathbb{S}220$ . The answer is: 220 ", "page_idx": 23}, {"type": "text", "text": "$\\mathbf{H}\\mathbf{R}\\mathbf{A}_{32,10^{-4}}$ Answer: Jillian’s shoes cost $\\mathbb{S}80$ . Her bag cost $\\mathbb{S}20$ less than 3 times as much as her shoes cost. So, her bag cost $3*\\mathbb{S}80-\\mathbb{S}20=\\mathbb{S}240-\\mathbb{S}20=\\mathbb{S}220$ . Therefore, her bag cost $\\mathbb{S}220$ . The answer is: 220 ", "page_idx": 23}, {"type": "text", "text": "$\\mathbf{HRA}_{32,\\infty}$ Answer: Jillian’s shoes cost $\\mathbb{S}80$ . Her handbag cost $\\mathbb{S}20$ less than 3 times as much as her shoes cost. So, her handbag cost $3*\\mathbb{S}80-\\mathbb{S}20=\\mathbb{S}210-\\mathbb{S}20=\\mathbb{S}190$ . Therefore, her handbag cost $\\mathbb{S}190$ . The answer is: 190 ", "page_idx": 23}, {"type": "text", "text": "Case Study 5 ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: In a dance class of 20 students, $20\\%$ enrolled in contemporary dance, $25\\%$ of the remaining enrolled in jazz dance, and the rest enrolled in hip-hop dance. What percentage of the entire students enrolled in hip-hop dance? (Ground-truth answer is 60) ", "page_idx": 24}, {"type": "text", "text": "Llama-2 Answer: Total number of students in the dance class $=20$ Percentage of students enrolled in contemporary dance $=20\\%$ of $20=4$ Percentage of students enrolled in jazz dance $=25\\%$ of 16 (since $20\\%$ are enrolled in contemporary dance) $=4$ Percentage of students enrolled in hip-hop dance $=$ Remaining students - $4=12$ Therefore, $12\\%$ of the entire students in the dance class are enrolled in hip-hop dance. The answer is 12 ", "page_idx": 24}, {"type": "text", "text": "$\\mathbf{H}\\mathbf{R}\\mathbf{A}_{32,0}$ Answer: First, we need to find out how many students enrolled in contemporary dance. $20\\%$ of 20 students is $0.20\\ ^{*}\\ 20=4$ students. So, there are $20\\mathrm{~-~}4=16$ students remaining. Next, we need to find out how many students enrolled in jazz dance. $25\\%$ of 16 students is $0.25\\ ^{*}\\ 16=4$ students. So, there are $16-4=12$ students remaining. Finally, we need to find out how many students enrolled in hip-hop dance. The remaining 12 students are the ones who enrolled in hip-hop dance. Therefore, the percentage of students enrolled in hip-hop dance is $12\\,/\\,20*100=60\\%$ The answer is: 60 ", "page_idx": 24}, {"type": "text", "text": "$\\mathbf{H}\\mathbf{R}\\mathbf{A}_{32,10^{-4}}$ Answer: $20\\%$ of the 20 students enrolled in contemporary dance, so 20/100 $*\\ 20=4$ students enrolled in contemporary dance. The remaining students are $20\\textrm{-}4=$ 16 students. $25\\%$ of the remaining 16 students enrolled in jazz dance, so $25/100\\ast16=4$ students enrolled in jazz dance. The remaining students are $16-4=12$ students. The rest of the students enrolled in hip-hop dance, so 12 students enrolled in hip-hop dance. To find the percentage of the entire students enrolled in hip-hop dance, we divide the number of students enrolled in hip-hop dance by the total number of students and multiply by 100. So, (12/20) \\* $100=60\\%$ The answer is: 60 ", "page_idx": 24}, {"type": "text", "text": "$\\mathbf{HRA}_{32,\\infty}$ Answer: First, $20\\%$ of the 20 students enrolled in contemporary dance, which is $20/100\\ast20=4$ students. So, there are $20-4=16$ students remaining. Then, $25\\%$ of the remaining 16 students enrolled in jazz dance, which is $25/100*16=4$ students. So, there are $16\\cdot4=12$ students remaining. Finally, the rest of the students enrolled in hip-hop dance, which is 12 students. Therefore, $12/20*100=60\\%$ of the entire students enrolled in hip-hop dance. The answer is: 60 ", "page_idx": 24}, {"type": "text", "text": "Case Study 6 ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: A candle melts by 2 centimeters every hour that it burns. How many centimeters shorter will a candle be after burning from 1:00 PM to 5:00 PM? (Ground-truth answer is 8) ", "page_idx": 25}, {"type": "text", "text": "Llama-2 Answer: To determine how many centimeters shorter a candle will be after burning from $1{:}00\\ \\mathrm{PM}$ to $5{\\mathrm{;o0~PM}}$ , we need to first calculate the total time the candle will be burning during that period. $1{\\mathrm{:00~PM}}\\,+\\,5{\\mathrm{:00~PM}}\\,=\\,8$ hours Since the candle melts by 2 centimeters every hour, we can calculate the total distance it will melt during the 8 hours as follows: 2 centimeters/hour $\\textbf{X8}$ hours $=16$ centimeters So, after burning from 1:00 PM to 5:00 PM, the candle will be 16 centimeters shorter. The answer is 16 $\\mathbf{H}\\mathbf{R}\\mathbf{A}_{32,0}$ Answer: The candle burns for a total of 4 hours. In the first hour, the candle melts by 2 centimeters. In the second hour, the candle melts by 2 centimeters. In the third hour, the candle melts by 2 centimeters. In the fourth hour, the candle melts by 2 centimeters. So, in total, the candle melts by 2 centimeters $\\mathtt{X4}$ hours $=8$ centimeters. Therefore, the candle will be 8 centimeters shorter after burning from 1:00 PM to 5:00 PM. The answer is: 8 ", "page_idx": 25}, {"type": "text", "text": "", "page_idx": 25}, {"type": "text", "text": "$\\mathbf{H}\\mathbf{R}\\mathbf{A}_{32,10^{-4}}$ Answer: From 1:00 PM to $2{:}00\\,\\,\\mathrm{PM}$ , the candle burns for 1 hour. So, the candle will melt by 2 centimeters x 1 hour $=2$ centimeters. From 2:00 PM to $3{\\mathrm{:}}00\\,{\\mathrm{PM}}$ , the candle burns for 1 hour. So, the candle will melt by 2 centimeters x 1 hour $=2$ centimeters. From $3{\\mathrm{:00}}\\,\\,{\\mathrm{PM}}$ to $4{\\bf:}00\\;\\mathrm{PM}$ , the candle burns for 1 hour. So, the candle will melt by 2 centimeters $\\mathrm{~x~l~hour}=2$ centimeters. From $4{\\bf:}00\\;\\mathrm{PM}$ to 5:00 PM, the candle burns for 1 hour. So, the candle will melt by 2 centimeters x 1 hour $=2$ centimeters. In total, the candle will melt by 2 centimeters $+\\,2$ centimeters $+\\,2$ centimeters $+\\,2$ centimeters $=8$ centimeters. Therefore, the candle will be 8 centimeters shorter after burning from 1:00 PM to 5:00 PM. The answer is: 8 $\\mathbf{HRA}_{32,\\infty}$ Answer: First, we need to find out how many hours the candle will burn from $1{\\,:\\,}00\\,\\,\\mathrm{PM}$ to $5{\\mathrm{;}}00\\,\\,{\\mathrm{PM}}$ . There are 5 hours in total, so the candle will burn for $5\\cdot1=4$ hours. Next, we need to find out how many centimeters the candle will melt in 4 hours. Since the candle melts by 2 centimeters every hour, it will melt $2\\mathrm{~x~}4=8$ centimeters in total. Finally, we need to subtract the initial length of the candle from the total length it will melt to find out how many centimeters shorter the candle will be. The initial length of the candle is 0 centimeters, so the candle will be 8 centimeters shorter. The answer is: 8 ", "page_idx": 25}, {"type": "text", "text": "", "page_idx": 25}, {"type": "text", "text": "Case Study 7 ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Marie ordered one chicken meal that costs $\\mathbb{S}12$ , 5 packs of milk that costs $\\mathbb{S}3$ each, 4 apples that cost $\\mathbb{S}1.50$ each, and some boxes of pizza. Marie paid a total of $\\mathbb{S}50$ . How many boxes of pizza did Marie order if each box costs $\\mathbb{S}8.50?$ (Ground-truth answer is 2) ", "page_idx": 26}, {"type": "text", "text": "Llama-2 Answer: Based on the information provided, we can calculate the number of boxes of pizza that Marie ordered as follows: Total cost of Marie’s order $=\\,\\Phi12$ (chicken meal) $+\\mathbb{5}3\\,\\mathrm{~x~}5$ (packs of milk) $+\\ \\mathbb{S}4\\textbf{x}4$ (apples) $={\\mathbb S}50$ If each box of pizza costs $\\mathbb{S}8.50$ , then the number of boxes of pizza that Marie ordered can be calculated as follows: Total cost of pi $\\mathbf{zza}\\,=\\,\\mathbb{S}8.50\\,\\mathrm{~x~}$ number of boxes Since Marie paid a total of $\\mathbb{S}50$ , we can set up the following equation: $\\mathbb{S}8.50\\textbf{x}$ number of boxes $=\\mathbb{S}50$ Now, we can solve for the number of boxes of pizza that Marie ordered: number of boxes $=850\\,/\\,\\mathbb{S}8.50$ number of boxes $=6$ Therefore, Marie ordered 6 boxes of pizza. The answer is 6 $\\mathbf{H}\\mathbf{R}\\mathbf{A}_{32,0}$ Answer: The cost of the chicken meal is $\\mathbb{S}12$ . The cost of 5 packs of milk is $5*\\mathbb{S}3$ $=\\mathbb{S}15$ . The cost of 4 apples is $4*\\mathbb{S}1.50=\\mathbb{S}6.$ . The total cost of the chicken meal, milk, and apples is $\\mathbb{S}12+\\mathbb{S}15+\\bar{\\mathbb{S}}\\bar{6}=\\mathbb{S}33$ . If Marie paid a total of $\\mathbb{S}50$ , then the cost of the pizza boxes is $\\mathbb{S}50-\\mathbb{S}33=\\mathbb{S}17$ . If each box of pizza costs $\\mathbb{S}8.50$ , then the number of boxes of pizza is $\\mathbb{S}17$ $/\\:\\mathbb{S}8.50=2$ . Therefore, Marie ordered 2 boxes of pizza. The answer is: 2 ", "page_idx": 26}, {"type": "text", "text": "", "page_idx": 26}, {"type": "text", "text": "$\\mathbf{H}\\mathbf{R}\\mathbf{A}_{32,10^{-4}}$ Answer: The chicken meal costs $\\mathbb{S}12$ . The 5 packs of milk cost $\\mathbb{S}3$ each, so $5*$ $\\mathbb{S}3=\\mathbb{S}15$ . The 4 apples cost $\\mathbb{S}1.50$ each, so $4*\\mathbb{S}1.50=86\\$ . The total cost of the chicken meal, milk, and apples is $\\mathbb{S}12+\\mathbb{S}15+\\mathbb{S}6=\\mathbb{S}33$ . Marie paid a total of $\\mathbb{S}50$ , so the cost of the pizza boxes is $\\mathbb{S}50-\\mathbb{S}33=\\mathbb{S}17$ . Each box of pizza costs $\\mathbb{S}8.50$ , so the number of boxes of pizza is $917\\,/\\,\\mathbb{S}8.50=2$ . Therefore, Marie ordered 2 boxes of pizza. The answer is: 2 ", "page_idx": 26}, {"type": "text", "text": "$\\mathbf{HRA}_{32,\\infty}$ Answer: First, Marie ordered 1 chicken meal that costs $\\mathbb{S}12$ . Next, she ordered 5 packs of milk that cost $\\mathbb{S}3$ each, so $5*\\mathbb{S}3=\\mathbb{S}15$ for the milk. Then, she ordered 4 apples that cost $\\mathbb{S}1.50$ each, so $4*\\mathbb{5}1.50=\\mathbb{5}6$ for the apples. Finally, she ordered some boxes of pizza that cost $\\mathbb{S}8.50$ each, so let’s say she ordered $\\mathbf{X}$ boxes of pizza. So, the total cost of the chicken meal, milk, apples, and pizza is $\\mathbb{S}12+\\mathbb{S}15+\\mathbb{S}6+\\mathbb{S}8.50\\mathrm{x}=\\mathbb{S}50$ . Simplifying the equation, we get $\\mathbb{5}33.50+\\mathbb{5}8.50\\mathrm{x}=\\mathbb{5}50.$ . Subtracting $\\mathbb{S}33.50\\$ from both sides, we get ${\\mathbb{S}}{\\8}.50{\\mathrm{x}}$ $=\\mathbb{S}16.50\\$ . Dividing both sides by $\\mathbb{S}8.50$ , we get $\\mathbf{X}=2$ . Therefore, Marie ordered 2 boxes of pizza. The answer is: 2 ", "page_idx": 26}, {"type": "text", "text": "Case Study 7 ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Claire makes a 3 egg omelet every morning for breakfast. How many dozens of eggs will she eat in 4 weeks? (Ground-truth answer is 7) ", "page_idx": 27}, {"type": "text", "text": "Llama-2 Answer: To calculate how many dozens of eggs Claire will eat in 4 weeks, we need to first convert the number of eggs she makes in an omelet. An omelet contains 3 eggs, so Claire will eat 3 eggs per omelet. Since Claire makes an omelet every morning, she will eat 3 eggs per omelet per day. To find out how many dozens of eggs she will eat in 4 weeks, we can multiply the number of eggs she eats per day by the number of days in 4 weeks: 3 eggs/day $\\textsl{x21}$ days/week $\\mathtt{X4}$ weeks $=243$ eggs Therefore, Claire will eat 243 dozens of eggs in 4 weeks. The answer is 243 ", "page_idx": 27}, {"type": "text", "text": "$\\mathbf{HRA}_{32,0}$ Answer: Claire makes a 3 egg omelet every morning for breakfast. In 4 weeks, there are 4 weeks $\\textbf{x7}$ days $=28$ days. So, in 28 days, Claire will eat $28\\mathrm{~x~}3=84$ eggs. Since there are 12 eggs in a dozen, Claire will eat $84\\,/\\,12=7$ dozen eggs. Therefore, Claire will eat 7 dozens of eggs in 4 weeks. The answer is: 7 ", "page_idx": 27}, {"type": "text", "text": "$\\mathbf{H}\\mathbf{R}\\mathbf{A}_{32,10^{-4}}$ Answer: Claire makes a 3 egg omelet every morning for breakfast. In 4 weeks, there are $4\\mathrm{~x~}7=28$ days. So, in 28 days, Claire will eat $28\\mathrm{~x~}3=84$ eggs. Since there are 12 eggs in a dozen, Claire will eat $84\\,/\\,12=7$ dozen of eggs. The answer is: 7 ", "page_idx": 27}, {"type": "text", "text": "$\\mathbf{HRA}_{32,\\infty}$ Answer: Claire makes a 3 egg omelet every morning for breakfast. In 4 weeks, there are 4 weeks $\\mathrm{~x~}7\\mathrm{~days}=28$ days. So, in 28 days, Claire will eat $28\\mathrm{~x~}3=84$ eggs. To find out how many dozens of eggs she will eat, we divide 84 by $12.\\ 84\\ /\\ 12=7\\$ Therefore, Claire will eat 7 dozens of eggs in 4 weeks. The answer is: 7 ", "page_idx": 27}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 28}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 28}, {"type": "text", "text": "Justification: The main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope. ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 28}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? Answer: [Yes] ", "page_idx": 28}, {"type": "text", "text": "Justification: Regarding the limitations of HRA, we believe the main concern is the setting of hyperparameters (i.e., the rank $r$ and the weight of orthogonal regularizer $\\lambda$ ). Similar to LoRA, the rank $r$ of our HRA determines the trade-off between the number of trainable parameters and the training efficiency. In this study, we set $r$ to ensure that the number of our trainable parameters is smaller than those of baselines. Of course, inspired by the recent variants of LoRA, e.g., AdaLoRA, we can adjust the rank $r$ adaptively, which is not the main contribution of this work and thus is left to be our future work. ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 28}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 29}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 29}, {"type": "text", "text": "Justification: For each theoretical result, we provide the full set of assumptions and a complete and correct proof. ", "page_idx": 29}, {"type": "text", "text": "Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 29}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 29}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 29}, {"type": "text", "text": "Justification: We provide the information of the backbone and the necessary hyperparameters for each experiment. ", "page_idx": 29}, {"type": "text", "text": "Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the ", "page_idx": 29}, {"type": "text", "text": "case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 30}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 30}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 30}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 30}, {"type": "text", "text": "Justification: We provide the code with comments and the available access to the data at https://github.com/DaShenZi721/HRA. ", "page_idx": 30}, {"type": "text", "text": "Guidelines: ", "page_idx": 30}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 30}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 30}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 30}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 30}, {"type": "text", "text": "Justification: The experimental details including hyperparameters, optimizer, and so on, are provided in appendix. ", "page_idx": 30}, {"type": "text", "text": "Guidelines: ", "page_idx": 30}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 30}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 30}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 30}, {"type": "text", "text": "Answer: [No] ", "page_idx": 30}, {"type": "text", "text": "Justification: The error bars are not reported because it would be too time-consuming. Guidelines: ", "page_idx": 30}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. ", "page_idx": 30}, {"type": "text", "text": "• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 31}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 31}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 31}, {"type": "text", "text": "Justification: For each experiment, we provide the information of the GPU. ", "page_idx": 31}, {"type": "text", "text": "Guidelines: ", "page_idx": 31}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 31}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 31}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 31}, {"type": "text", "text": "Justification: This paper conform, in every respect, with the NeurIPS Code of Ethics. ", "page_idx": 31}, {"type": "text", "text": "Guidelines: ", "page_idx": 31}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 31}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 31}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 31}, {"type": "text", "text": "Justification: Regarding the societal impact of our work, we believe HRA can further simplify the adaptation of LLMs and promote more LLM-based downstream applications. Similar to LoRA and OFT, HRA may suffer from some potential issues like inappropriate (even illegal) abuse, amplifying the social prejudice intrinsically in LLM when the finetuning data are biased, and so on. It should be noted that these potential issues are neither purely attributed to the technique itself nor specific to HRA—LoRA and OFT also suffer from them. Solving these issues depends on developing new techniques, social policies, and data quality improvement. How to mitigate (even eliminate) these issues is left to our future work. ", "page_idx": 32}, {"type": "text", "text": "Guidelines: ", "page_idx": 32}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed.   \n• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake proflies, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 32}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 32}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 32}, {"type": "text", "text": "Answer: [NA] ", "text_level": 1, "page_idx": 32}, {"type": "text", "text": "Justification: This paper poses no such risks. ", "page_idx": 32}, {"type": "text", "text": "Guidelines: ", "page_idx": 32}, {"type": "text", "text": "NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 32}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 32}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 32}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 32}, {"type": "text", "text": "Justification: All the creators or original owners of assets including code, data, and models used in the paper are properly credited. ", "page_idx": 33}, {"type": "text", "text": "Guidelines: ", "page_idx": 33}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 33}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 33}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 33}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 33}, {"type": "text", "text": "Justification: We provide the comments in the released code. ", "page_idx": 33}, {"type": "text", "text": "Guidelines: ", "page_idx": 33}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 33}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 33}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 33}, {"type": "text", "text": "Answer: [NA] ", "text_level": 1, "page_idx": 33}, {"type": "text", "text": "Justification: This paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 33}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 33}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 33}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 33}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 34}, {"type": "text", "text": "Justification: This paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 34}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 34}]