[{"figure_path": "wK0Z49myyi/tables/tables_7_1.jpg", "caption": "Table 1: Poses registration errors evaluated on the LEGO scene in the NeRF-Synthetic dataset [26].", "description": "This table presents the results of pose registration error evaluation on the LEGO scene from the NeRF-Synthetic dataset.  It compares four different methods (BARF, SPARF, L2G-NeRF, and CRAYM) in terms of rotation error (in degrees) and translation error.  Lower values indicate better pose estimation accuracy.", "section": "4.2 Evaluation on Synthetic Objects"}, {"figure_path": "wK0Z49myyi/tables/tables_7_2.jpg", "caption": "Table 2: Results on the NeRF-Synthetic dataset.", "description": "This table presents a quantitative comparison of the proposed CRAYM method against several state-of-the-art techniques on the NeRF-Synthetic dataset.  Metrics include PSNR, SSIM, LPIPS, and Chamfer Distance (CD), evaluated across eight different synthetic scenes.  The results highlight CRAYM's superior performance in terms of image quality and 3D reconstruction accuracy.", "section": "4.2 Evaluation on Synthetic Objects"}, {"figure_path": "wK0Z49myyi/tables/tables_8_1.jpg", "caption": "Table 4: Results on the real scenes PolyTech and ArtSci in the UrbanScene3D [22] dataset.", "description": "This table presents the quantitative results of the proposed method (CRAYM) compared to NeuS and PET-NeuS on two real-world scenes: PolyTech and ArtSci.  The metrics used are PSNR, SSIM, LPIPS, and Chamfer Distance (CD).  These metrics evaluate the quality of novel view synthesis and 3D reconstruction, respectively. Lower CD values indicate better 3D reconstruction accuracy. The results show that CRAYM significantly outperforms the baselines on both scenes.", "section": "4 Results"}, {"figure_path": "wK0Z49myyi/tables/tables_9_1.jpg", "caption": "Table 5: Comparing different methods at varying noise levels.", "description": "This table presents a comparison of different neural radiance field methods (NeRF, NeuS, BARF, SPARF, PET-NeuS, L2G-NeRF, and CRAYM) under three noise levels: without noise, low noise level, and high noise level.  The comparison is based on PSNR, SSIM, LPIPS, and CD metrics, providing a quantitative assessment of each method's performance in handling noisy camera poses.  The results highlight the robustness of the proposed CRAYM method, especially in high-noise scenarios.", "section": "4.4 Ablation Study"}, {"figure_path": "wK0Z49myyi/tables/tables_9_2.jpg", "caption": "Table 6: Ablation of major modules and losses.", "description": "This table presents the ablation study results, comparing the performance of different model configurations on the LEGO dataset.  It shows the impact of adding the Key Rays Enrichment (KRE) module, the Matched Rays Coherency (MRC) module, and the geometric losses (Le and La) to the baseline model. The results demonstrate the effectiveness of each component in improving the overall performance, measured by PSNR, SSIM, LPIPS, and Chamfer distance (CD).", "section": "4.4 Ablation Study"}, {"figure_path": "wK0Z49myyi/tables/tables_15_1.jpg", "caption": "Table 7: Comparison of reconstruction quality on the NeRF-Synthetic [26] dataset.", "description": "This table presents a quantitative comparison of the reconstruction quality achieved by different methods on the NeRF-Synthetic dataset [26].  The metrics used for comparison include Hausdorff distance (HD), precision, recall, and F-score.  The results are broken down by object category (Chair, Drums, Ficus, Hotdog, LEGO, Materials, Mic, Ship) and aggregated into a mean value.  Lower HD values indicate better reconstruction quality, while higher values for precision, recall, and F-score are desirable.", "section": "4.2 Evaluation on Synthetic Objects"}, {"figure_path": "wK0Z49myyi/tables/tables_15_2.jpg", "caption": "Table 8: Comparison of reconstruction quality on the real scenes PolyTech and ArtSci of the UrbanScene3D [22] dataset.", "description": "This table presents a quantitative comparison of the 3D reconstruction quality achieved by three different methods (NeuS, PET-NeuS, and CRAYM) on two real-world scenes: PolyTech and ArtSci.  The metrics used for evaluation are Hausdorff Distance (HD), Precision, Recall, and F-score.  Lower HD indicates better reconstruction accuracy, while higher Precision, Recall, and F-score represent improved model performance.", "section": "4.3 Evaluation on Real Scenes"}, {"figure_path": "wK0Z49myyi/tables/tables_15_3.jpg", "caption": "Table 9: Comparison of novel view synthesis on the real scene Bank from TwinTex [40].", "description": "This table presents a quantitative comparison of novel view synthesis results on the real scene Bank from the TwinTex dataset [40]. Three methods, NeuS [34], PET-NeuS [37], and CRAYM (the authors' method), are compared using three metrics: PSNR, SSIM, and LPIPS.  The results show that CRAYM significantly outperforms the other two methods in terms of all three metrics, indicating its superior performance in novel view synthesis for real-world scenes.", "section": "4.3 Evaluation on Real Scenes"}, {"figure_path": "wK0Z49myyi/tables/tables_16_1.jpg", "caption": "Table 10: Comparison of novel view synthesis on the DTU [15] dataset.", "description": "This table presents a quantitative comparison of novel view synthesis results on the DTU dataset [15], comparing the proposed CRAYM method against NeuS [34], PET-NeuS [37], and SPARF [32].  The metrics used for comparison are PSNR (Peak Signal-to-Noise Ratio), SSIM (Structural Similarity Index), and LPIPS (Learned Perceptual Image Patch Similarity).  The results are shown for five different scan scenes (Scan24, Scan37, Scan40, Scan55, Scan63) from the DTU dataset.  The table highlights the superior performance of CRAYM in terms of PSNR, SSIM, and LPIPS, indicating significantly improved visual quality compared to the other methods.", "section": "4.3 Evaluation on Real Scenes"}, {"figure_path": "wK0Z49myyi/tables/tables_17_1.jpg", "caption": "Table 11: Results of sparse input (3 views) on the LEGO scene from the NeRF-Synthetic dataset [26].", "description": "This table shows the quantitative results of novel view synthesis on the LEGO scene from the NeRF-Synthetic dataset using only 3 input views.  It compares the performance of the proposed CRAYM method against the SPARF method, highlighting the PSNR, SSIM, LPIPS, and Chamfer Distance (CD) metrics.  The results demonstrate CRAYM's ability to produce comparable results even with significantly limited input views.", "section": "4.4 Ablation Study"}]