[{"type": "text", "text": "Federated Fine-tuning of Large Language Models under Heterogeneous Tasks and Client Resources ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Jiamu Bai∗ Daoyuan Chen∗ Pennsylvania State University Alibaba Group jvb6867@psu.edu daoyuanchen.cdy@alibaba-inc.com ", "page_idx": 0}, {"type": "text", "text": "Bingchen Qian Alibaba Group qianbingchen.qbc@alibaba-inc.com ", "page_idx": 0}, {"type": "text", "text": "Liuyi Yao Alibaba Group yly287738@alibaba-inc.com ", "page_idx": 0}, {"type": "text", "text": "Yaliang Li Alibaba Group yaliang.li@alibaba-inc.com ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Federated Learning (FL) has recently been applied to the parameter-efficient finetuning of Large Language Models (LLMs). While promising, it raises significant challenges due to the heterogeneous resources and data distributions of clients. This study introduces FlexLoRA, a simple yet effective aggregation scheme for LLM fine-tuning, which mitigates the “bucket effect” in traditional FL that restricts the potential of clients with ample resources by tying them to the capabilities of the least-resourced participants. FlexLoRA allows for dynamic adjustment of local LoRA ranks, fostering the development of a global model imbued with broader, less task-specific knowledge. By synthesizing a full-size LoRA weight from individual client contributions and employing Singular Value Decomposition (SVD) for weight redistribution, FlexLoRA fully leverages heterogeneous client resources. Involving thousands of clients performing heterogeneous NLP tasks and client resources, our experiments validate the efficacy of FlexLoRA, with the federated global model achieving consistently better improvement over SOTA FL methods in downstream NLP task performance across various heterogeneous distributions. FlexLoRA’s practicality is further underscored by our theoretical analysis and its seamless integration with existing LoRA-based FL methods, offering a path toward cross-device, privacy-preserving federated tuning for LLMs. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Large Language Models (LLMs) have propelled advancements in natural language processing (NLP), offering breakthroughs in various tasks [45]. Finetuning LLMs on specific datasets enhances their applicability [12, 33], yet collecting such datasets raises concerns regarding cost and privacy [29, 6]. ", "page_idx": 0}, {"type": "text", "text": "Researchers have turned to Federated Learning (FL) as a means to fine-tune LLMs using more data across distributed clients without compromising data privacy [28, 2, 43, 32]. In these settings, parameter-efficient fine-tuning techniques [34], particularly Low-Rank Adaptation (LoRA) [16], become attractive for reducing computational and communicational burdens [44, 41, 8]. ", "page_idx": 0}, {"type": "image", "img_path": "gkOzoHBXUw/tmp/f942fc7947a83dbf047c418a476f176934b0232a787d9c60fe88a8ef300959cc.jpg", "img_caption": ["Figure 1: Test loss of FlexLoRA and FedIT [43] across communication rounds under LoRA ranks of 1, 8, and 200. FlexLoRA demonstrates adaptability in an “extreme heavy tail” scenario and increasingly aligns with the performance of FedIT at the highest LoRA rank as rounds progress. Implementation details are in Appendix A. "], "img_footnote": [], "page_idx": 1}, {"type": "image", "img_path": "gkOzoHBXUw/tmp/5363ada1a5901ad4bc56964f970bea4bb3e1d28e95b0b72d6dd8d93c9c2c71ba.jpg", "img_caption": [], "img_footnote": [], "page_idx": 1}, {"type": "text", "text": "Figure 2: Illustration of FlexLoRA.The server initially constructs a full-size LoRA weight, which is then averaged across client-contributed weights with different ranks. The aggregated global weights are decoupled via SVD and sent back to clients. ", "page_idx": 1}, {"type": "text", "text": "Despite its efficiency, LoRA’s use in FL is challenged by the heterogeneity of downstream tasks and available resources among clients, especially in cross-device scenarios [39, 5]. Traditional FL methods often suffer from “bucket effect”, converging to the use of the smallest viable LoRA rank for all clients, even though many clients typically have more resources that remain underutilized. A small LoRA rank, optimizing weights in a task-specific manner [16], can be sensitive to heterogeneous data distributions and compromised generalization when applied to all clients, as evidenced in Figure 1. Ideally, we hope all clients can fully leverage their advantages by sizing their local LoRA ranks with their resources to contribute models with less task-specific but more generalized knowledge. ", "page_idx": 1}, {"type": "text", "text": "To address these challenges, we propose FlexLoRA, a simple yet effective FL aggregation scheme that enables the mixture of diverse LoRA weights across individual clients. It accounts for local resource and task differences and aims for a well-generalized global model. With the heterogeneous aggregation and redistribution of weights through Singular Value Decomposition (SVD), FlexLoRA ensures all clients contribute effectively, regardless of resource capacity. Thanks to the simplicity, FlexLoRA can be pluggable into a series of LoRA-based FL methods, unlocking their potential to leverage available yet under-utilized resources to contribute more generalized knowledge via larger LoRA ranks, which is also supported by our theoretical analysis. ", "page_idx": 1}, {"type": "text", "text": "Our empirical study, simulating a cross-device federate fine-tuning scenario with thousands of clients on various of NLP tasks [39] and resource distributions, underscores the real-world applicability of FlexLoRA. Notably, FlexLoRA can be readily applied to several SOTA FL baselines in a plug-and-play manner and achieves significant performance enhancements, including $3.1\\%$ and $4\\%$ improvements in zero-shot Rouge-L scores and language understanding tasks such as overlap extraction and textual entailment, demonstrating robust generalization capability. We further conduct an extensive study on the aggregation scheme and scalability of FlexLoRA, furnishing a more nuanced understanding of the underlying mechanisms that facilitate its effectiveness ", "page_idx": 1}, {"type": "text", "text": "Our contributions can be summarized as follows: ", "page_idx": 1}, {"type": "text", "text": "• We propose a simple-yet-effective scalable method to fully leverage local client resources for enhancing the global model’s generalization ability, supported by both theoretical analysis and extensive empirical evidence.   \n• To our knowledge, this is the first work to demonstrate the feasibility of federated tuning of billionsized LLMs across thousands of NLP tasks in large-scale, resource-heterogeneous scenarios.   \n• We explore the interplay between LoRA ranks, client numbers, specific heterogeneous language tasks, and resource distributions, offering practical insights. Our code is made available at https://github.com/alibaba/FederatedScope/tree/FlexLoRA, inviting further research and application in real-world cross-device FL for LLMs. ", "page_idx": 1}, {"type": "text", "text": "2 Related Work ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Parameter-Efficient Fine-tuning of LLMs. The computation and storage demands of traditional finetuning processes have spurred the development of parameter-efficient fine-tuning (PEFT) techniques such as adapter and prefix tuning [15, 23]. Among existing PEFT techniques, we choose to employ LoRA due to its simplicity and outstanding performance [24, 18]. Despite this, our aggregation scheme can be easily extended into other PEFT methods by replacing the LoRA weights with their alternative weights to be tuned. ", "page_idx": 2}, {"type": "text", "text": "PEFT in Federated Learning. PEFT techniques have been integrated into FL to minimize communication costs and maximize efficiency. Several works employ LoRA for local model updates within an FL framework [2, 43, 44, 41, 19, 8, 26, 30, 38, 42]. For instance, [43] combines LoRA-based local updates with FedAvg for model aggregation, while [2] intersperses sparse finetuning with LoRA finetuning for improved initialization for LoRA in FedAvg. [36] proposes a technique to improve LoRA performance in FL scheme, [42] exploits performing SVD on pretrained model weights to resolve data heterogeneity, and [32] reduces communication cost through zeroth-order optimization. Distinct from these methods, our work, by introducing a simple yet effective aggregation scheme, leverages heterogeneous client resources to enhance the generalization and natural language understanding of the global FL model, addressing limitations seen in current FL paradigms. ", "page_idx": 2}, {"type": "text", "text": "Data and Resource Heterogeneity in FL. Data and resource heterogeneity remain significant challenges in FL, impacting both training and performance [28, 20]. Fruitful solutions have been explored to tackle the data heterogeneity [10, 25, 4, 42] or resource heterogeneity [21, 11, 7], while not in LLM context. A concurrent work, HETLORA [8], proposes allowing heterogeneous LoRA ranks by zero-padding local LoRA weights for aggregation and truncating global weights to match the local rank for distribution, all while employing sparsity regularization. However, our approach distinguishes itself through a focus on zero-shot task generalization and large-scale experiments inclusive of thousands of NLP tasks and clients, aiming to synthesize a well-generalized global LLM. Moreover, our method is simple and easy to use without any hyper-parameters for the aggregation, thereby circumventing the need for case-by-case tuning of newly introduced variables such as the decay and regularization factors of HETLORA. ", "page_idx": 2}, {"type": "text", "text": "3 Methodology of FlexLoRA ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "3.1 Intrinsic Dimension and Generalization ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Fine-tuning LLMs to enhance task-specific performance inevitably encounters cost of reduced generalization ability: a trade-off supported by the “no-free-lunch” theorem and empirical evidence usually called “alignment tax” of LLM [40, 31]. The generalization capability of LLMs is influenced by complexity of applied tasks and their solution spaces, which can be characterized by the concept of an intrinsic dimension – typically far smaller than the total number of model parameters [1]. ", "page_idx": 2}, {"type": "text", "text": "The insight of intrinsic dimension informs the design of LoRA to fine-tune LLMs’ pre-trained weights in a parameter-efficient manner, utilizing compact and low-rank matrices. Specifically, matrices $\\boldsymbol{A}\\in\\mathbf{\\bar{R}}^{r\\times p}$ , $B\\in\\mathbb{R}^{d\\times r}$ are introduced, where $r$ denotes the rank that encapsulates intrinsic dimension. These matrices form a low-rank approximation for tuning original weights $W_{0}$ as $h=W_{0}x+s B A x$ , where $x$ is the input of the parameter to be tuned, $h$ is the output, and $s$ is a scaling constant. Previous studies show that different ranks produce weights with attributes particularly tailored to specific downstream tasks [16, 18]. Consequently, the rank value plays a critical role in not only task-specific solution subspaces but also in determining a model’s ability to generalize to various tasks. ", "page_idx": 2}, {"type": "text", "text": "In scenarios where clients have highly heterogeneous task and resource distributions, a uniform LoRA rank usually does not suffice for model performance, especially in its zero-shot generalization ability for unseen clients and tasks. Employing a small LoRA rank potentially leads to under-ftiting in a global context by capturing only a subset of task-specific features, while a large rank is usually infeasible due to the “bucket effect” of existing FL solutions constrained by least-resourced clients. ", "page_idx": 2}, {"type": "text", "text": "FlexLoRA emerges as a solution to this dilemma by dynamically adjusting the rank in response to the variability in local client resources. By increasing the LoRA rank for clients with greater resources to contribute more global knowledge, FlexLoRA enhances the model’s ability to generalize across diverse data distributions without sacrificing local performance accuracy. This strategy allows for federated fine-tuning of LLMs to navigate between the extremes of task-specific optimization and generalization to unseen clients and tasks. ", "page_idx": 2}, {"type": "text", "text": "", "page_idx": 3}, {"type": "text", "text": "3.2 Aggregation with Heterogeneous Ranks ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Traditional $\\mathrm{FL}$ methods like FedAvg aggregate local LoRA weights by computing a weighted average of the decomposed matrices $A$ and $B$ as $\\begin{array}{r}{B_{g}\\ =\\ (\\sum_{i=1}^{\\tilde{m}}n^{i}\\dot{B}_{l}^{i})/(\\dot{\\sum}_{i=1}^{m}\\,\\stackrel{\\triangledown}{n}^{i})}\\end{array}$ , ${\\cal A}_{g}~=~$ $\\textstyle(\\sum_{i=1}^{m}n^{i}A_{l}^{i})/(\\sum_{i=1}^{m}n^{i})$ , where $B_{g},A_{g}$ are the global LoRA decomposed matrices, and $B_{l}^{i},A_{l}^{i}$ are the local LoRA decomposed matrices of $i$ -th client, $n^{i}$ is the size of the $i$ -th client’s local training dataset, $m$ is the number of FL clients. However, this scheme is restricted by the lowest LoRA rank among participating clients for aggregation compatibility, which makes it hard to capture the full diversity of client contributions and fully utilize ample client resources. ", "page_idx": 3}, {"type": "text", "text": "FlexLoRA takes a different yet simple approach to enable decomposed matrix with different LoRA ranks to be mixed together. Specifically, it first forms a low-rank approximation of the LoRA matrix for each client, $W_{l}^{i}$ , before computing the weighted average: $\\begin{array}{r}{\\dot{W}_{g}\\,=\\,(\\sum n^{i}W_{l}^{i})/(\\sum_{i=1}^{m}n^{i})\\,=\\,}\\end{array}$ $(\\sum n^{i}s B_{l}^{i}A_{l}^{i})/(\\sum_{i=1}^{\\dot{m}}n^{i})$ . ", "page_idx": 3}, {"type": "text", "text": "After the weighted average with heterogeneous LoRA ranks, the resulting global LoRA weight $W_{g}$ is decomposed using SVD. Then the SVD components $U,\\Sigma,V$ are redistributed to clients in a low-rank approximation that preserves as much information of $W_{g}$ as possible meanwhile based on clients’ local resources characterized by $r^{i}$ : ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\mathrm{SVD}(W_{g})=U\\Sigma V^{T},\\ \\ \\ \\ \\ W_{g}^{i}=U[:,:r^{i}]\\Sigma[:r^{i},:r^{i}]V[:r^{i},:]^{T}\\approx W_{g},\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "where $U,\\Sigma$ , and $V^{T}$ are the SVD components of $W_{g}$ , the $r^{i}$ within $[]$ indicates the indexing operator of each client to select their singular vectors corresponding to top $r^{i}$ singular values. As a result, client $i$ receives the aggregated knowledge $W_{g}^{i}$ from server and incorporates $W_{g}^{i}$ into its local LoRA weight $W_{g}^{i}=s B_{g}^{i}A_{g}^{i}$ with $B_{g}^{i}=U[:,:r^{i}]\\Sigma[:r^{i},:r^{i}]/s$ , and $A_{g}^{i}=V[:r^{i},:]^{T}$ . ", "page_idx": 3}, {"type": "text", "text": "The local training then proceeds as similar to those in standard $\\mathrm{FL}$ approaches, using $W_{l}^{i}$ as the local weights to be tuned. This aforementioned process is repeated until convergence is achieved or a predetermined number of rounds is completed. ", "page_idx": 3}, {"type": "text", "text": "3.3 Maximizing Local Rank with Local Resources ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "To fully utilize the local resource of a local client, we adhere to the principle of allocating the highest feasible rank given a client’s resource budget, which is motivated by our empirical finding that larger ranks generally yield better generalization. Figure 1 demonstrates that models trained with uniformly higher ranks outperform those with lower ranks under conventional parameter-average aggregation schemes. For single-client performances, the zero-shot performance is also boosted in the majority of the cases. The Table 13 and Figure 9 from Appendix J show that performance improves with higher LoRA ranks uniformly regardless of the tasks assigned to each client. While there might be an ideal LoRA rank that maximizes a single client’s performance—potentially as high as 200—practical resource limitations may necessitate settling for a lower rank, such as 8. Therefore, we adopt the principle of setting the rank to be as large as possible to completely utilize the resources in FlexLoRA, which is easy to implement and under low risk of overfitting as Occam’s razor suggests. ", "page_idx": 3}, {"type": "text", "text": "In Appendix B, the overall procedure of FlexLoRA and its core function of server update are summarized in Algorithm 1 and Algorithm 2 respectively. FlexLoRA optimally leverages the inherent characteristics of LoRA, boosting model generalization effectively by increasing local ranks, while without sacrificing overall training efficiency. Compared to FedAvg and homogeneous rank-based FL methods, FlexLoRA incorporates a lightweight SVD procedure, but the overhead from SVD is negligible compared to the local LLM training procedure. Moreover, the SVD is performed only once per round and is independent of client numbers. Notably, FlexLoRA enables heterogeneous ranks without the need for any additional hyperparameter tuning. As we empirically demonstrate in Table 4, the improved convergence rate, thanks to larger ranks, more than compensates for the extra overhead introduced by training on more parameters per round, resulting in a net gain in overall efficiency and a reduced overall time to completion. These features enhance its efficiency and scalability in cross-device FL settings where thousands or millions of devices are involved. ", "page_idx": 3}, {"type": "text", "text": "3.4 Generalization Analysis ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "We analyze the generalization ability of FlexLoRA by extending Baxter’s model of learning [3]. Here, $h_{W}(\\cdot)$ represents the hypothesis generated by the model with LoRA weights $W$ , and $f\\left(W;(x,y)\\right)$ denotes the loss function for a single data point $(x,y)$ . The expected loss is denoted as $\\begin{array}{r}{\\mathcal{L}(W_{g})\\triangleq}\\end{array}$ $\\mathbb{E}_{(x,y)\\sim\\mathcal{D}_{i}}f\\left(W;(x,y)\\right)$ . The two key assumptions underpinning our analysis are as follows: ", "page_idx": 4}, {"type": "text", "text": "Assumption 1. The following Lipschitz conditions hold: $|f(W;x,y)\\!-\\!f(W^{\\prime};x,y)|\\leq L_{f}||W\\!-\\!W^{'}||$ and $||h(W;x)-h(W^{'};x)||\\leq L_{h}||W-W^{'}||$ . ", "page_idx": 4}, {"type": "text", "text": "Following current analysis in SOTA methodologies in LLM research, we assume Lipschitz conditions in our analysis for $f$ and $h$ [27, 17, 13]. This assumption indicates that $f$ and $h$ are Lipschitz continuous with respect to the LoRA weights $W$ , ensuring the stability of the loss landscape. For simplicity, we denote $\\operatorname{SVD}(W_{g},r^{i})$ as using the top $r^{i}$ singular values and the corresponding singular vectors to approximate $W_{g}$ . We denote the parameter solution space of $W_{g}$ to be $k$ . Next, due to the federated average and indexing operation based on the largest singular values, we assume that the dissimilarity between the global model and its rank-constrained approximation can be bounded: ", "page_idx": 4}, {"type": "text", "text": "Assumption 2. The LoRA weights can be bounded in a ball with radius $R$ , and the error induced by the SVD approximation for each client is bounded by a constant $\\phi^{i}$ as $||\\mathrm{SVD}(W_{g},r^{i})-W_{g}||\\leq\\phi^{i}$ . Theorem 1. Under Assumptions 1 and 2, with probability at least $1-\\delta$ , there exists a sample size $\\begin{array}{r}{\\tilde{N}=\\mathcal{O}(\\frac{k}{|\\mathcal{C}|\\epsilon^{2}}\\log(\\frac{R L_{f}L_{h}^{-}}{\\epsilon-2\\phi^{i}L_{f}L_{h}})-\\frac{\\log\\delta}{|\\mathcal{C}|\\epsilon^{2}})}\\end{array}$ such that for all $W_{g}$ , the bound $||\\mathcal{L}(W_{g})-\\mathcal{L}(W_{g}^{'})||\\,\\leq\\,\\epsilon$ holds when the number of local data samples for each client $i$ exceeds $\\tilde{N}$ . ", "page_idx": 4}, {"type": "text", "text": "Detailed proof is in Appendix C. This theorem suggests that the generalization ability of the global model is influenced by the LoRA rank $r^{i}$ chosen by each local client. Specifically, as $\\phi^{i}$ is the error bound of SVD approximation, increasing rank $r^{i}$ makes the approximation more accurate, thus reducing $\\phi^{i}$ . Consequently, this reduction in error bound decreases the requisite number of samples, denoted as $\\tilde{N}$ , required for effective generalization. Moreover, an increase in the number of clients $|{\\mathcal{C}}|$ also contributes positively to the generalization of the federated model in the order of $\\mathcal{O}(\\frac{1}{|c|})$ , a stronger impact than $\\phi^{i}$ whose impact is in a logarithmic fashion $\\begin{array}{r}{\\mathcal{O}\\big(l o g\\big(\\frac{1}{\\phi^{i}}\\big)\\big)}\\end{array}$ . Collectively, FlexLoRA is effective in cross-device FL settings, where the generalization capability of the global model can be significantly enhanced by the participation of massive clients (larger $|\\mathcal{C}|)$ with heterogeneous resources (larger $r^{i}$ ). Note that Assumption 1 is standard in FL literature [22], and our proof do not rely on simplified assumptions that often do not hold in cross-device cases, such as identically distributed data. We provide empirical support for distribution-related generalization ability, the effect of SVD (Assumption 2), and the effect of client numbers in Sections 4.3, 4.5 and 4.6 respectively. ", "page_idx": 4}, {"type": "text", "text": "4 Experiments ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "4.1 Setup for Cross-Device FL Environments ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "Resource Heterogeneity. We make FL clients resource-heterogeneous by crafting four distinct LoRA configurations as listed in Table 1. Type 1, 2, and 4 assign the same LoRA on all tunable layers, while Type 3 assigns small ranks on attention layers and large ranks on FFN layers, following the design of the MAM adapter [14]. Clients are randomly assigned a configuration type, simulating four types of heterogeneous resource environments similar to [5]. As shown in Figure 3, we consider uniform resource distribution where each LoRA configuration type is equally likely to be assigned to each client, heavy tail resource distribution where either Type 1 or Type 4 is dominant, and normal distribution where the LoRA configuration types are normal distribution and Type 2 and Type 3 are dominant. A comparison of the active memory cost with different LoRA configurations is shown in Appendix D. Besides, we add LoRA on top of all the linear layers of LLMs based on the empirical results in Appendix E.3. ", "page_idx": 4}, {"type": "text", "text": "Task Heterogeneity. We further make FL clients task-heterogeneous by utilizing the natural instruction dataset [39]. The dataset consists of over 1600 distinct natural language tasks that come from 76 NLP task types and is split based on its meta-info of the belonging NLP tasks, such that each client holds a unique task to mirror a task heterogeneous environment. Notably, while the FL setup includes over 1600 clients, the distribution of 76 task types across these clients means that some will inherently share similar local data distributions, thereby mirroring the natural variability and overlapping task characteristics often encountered in real-world settings. Unless stated otherwise, we conduct all our FL experiments on this dataset and adopt DataJucier (1.3B) as our foundation models [6], chosen for its suitability for edge devices with constrained resources. More details about data preparation are included in Appendix E.2. ", "page_idx": 4}, {"type": "text", "text": "", "page_idx": 5}, {"type": "table", "img_path": "gkOzoHBXUw/tmp/c5e70294d95e7c0605b447d803bdeed2e8d53c4cc1cef7d7effa16ac05046683.jpg", "table_caption": ["Table 1: The LoRA configurations that compose heterogeneous resource distributions, detailed in Figure 3. "], "table_footnote": [], "page_idx": 5}, {"type": "image", "img_path": "gkOzoHBXUw/tmp/c288e2e8af99c03857ec588ecd6dda58b1f98799f32cc3815e856bd869507cfb.jpg", "img_caption": ["Figure 3: Heterogeneous resource distributions containing different ratios of various LoRA configuration types. "], "img_footnote": [], "page_idx": 5}, {"type": "text", "text": "4.2 Setup for FL Baselines ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "Baselines with Homogeneous Rank. We adopt FedAvg [28], FedIT [43], and SLoRA [2] as baselines utilizing unvarying LoRA ranks. FedIT aggregates the LoRA module weight of each client by averaging which limits the local LoRA rank to meet the lowest resource constraint. Comparing with FedAvg, FedIT adopts Adam optimizer for local training instead of SGD optimizer. SLoRA first trains local client models with sparse fine-tuning for several epochs then switches to LoRA for PEFT and uses the updates from sparse fine-tuning as initialization. ", "page_idx": 5}, {"type": "text", "text": "Baselines with Heterogeneous Ranks. Besides, we compare with HETLORA [8], a concurrent work exploring the effective utilization of diverse LoRA ranks in FL. It first employs zero-padding on all the LoRA matrices based on the largest rank, then conducts element-wise averages like FedAvg, and finally truncates the aggregated model to fit the local client LoRA rank. ", "page_idx": 5}, {"type": "text", "text": "We note that both FlexLoRA and HETLORA are able to be plugged into the above-mentioned FL methods with homogeneous LoRA ranks. In our experiment, for each baseline with homogeneous rank, we also examine their performance after integration by either FlexLoRA or HETLORA. ", "page_idx": 5}, {"type": "text", "text": "4.3 Unseen Client Generalization ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "Evaluation Setup. Our initial examination focuses on the generalization capabilities of global models to unseen clients by deploying the models to clients with unseen data distributions. The unseen clients are newly sampled clients from the next communication round. This assessment allows us to measure zero-shot performance, a key indicator of a model’s ability to generalize beyond the data available during the training phase. This approach is to simulate the real FL setting, where well-trained global weights will be deployed to new clients rather than clients participating in the previous round. Specifically, we investigate the performance of global models trained with baseline methods both with and without the integration of FlexLoRA and HETLORA under four distinct resource heterogeneity scenarios. ", "page_idx": 5}, {"type": "text", "text": "Overview Performance Comparison. Table 2 displays the zero-shot performance under Rouge-L scores on the test set from unseen clients, facilitating a comparison of the generalization capabilities across different federated global models. It is observed from the table that in most of the cases, methods with heterogeneous LoRA ranks have better performance than that of homogeneous ranks, indicating that heterogeneous LoRA ranks enhance the clients with larger ranks to fully exploit their capability. Furthermore, among the heterogeneous LoRA rank methods, our proposed FlexLoRA consistently outperforms HETLORA across all resource distribution settings. This shows that FlexLoRA is able to take advantage of heterogeneous resource distribution, and is more capable of leveraging the general information from heterogeneous LoRA configurations. ", "page_idx": 5}, {"type": "table", "img_path": "gkOzoHBXUw/tmp/0f192a6c7706326d24de07bd1c8d0780517b47e309574f7bb5c20d799aa6fd24.jpg", "table_caption": ["Table 2: The weighted average Rouge-L scores of unseen clients provide insights into the global model’s generalization ability. Results from baseline methods with homogeneous ranks (Line 3, denoted as Homo Rank) are compared with those incorporating FlexLoRA and HETLORA across various resource distributions (Line $4{\\sim}7$ ). The significant test are presented in Appendix F. "], "table_footnote": [], "page_idx": 6}, {"type": "image", "img_path": "gkOzoHBXUw/tmp/c953f3341a24f571d5c9f5f975f54731986615e2da88dee0e359d68c4cf12a4f.jpg", "img_caption": ["Figure 4: Task-specific improvements achieved by FlexLoRA in comparison with the homogeneous rank implementation of FedAvg, across different resource distribution settings. "], "img_footnote": [], "page_idx": 6}, {"type": "text", "text": "Effect of Specific Resource Distributions. To gain further insight into the effect of FlexLoRA and the effect of heterogeneity of LoRA ranks, in Table 10 in Appendix F, we list the percentage improvement for each FL methods when incorporating FlexLoRA in comparison with the respective standard homogeneous rank implementations. Notably, after integrating FlexLoRA, the average performance gains are $2.14\\%$ for FedAvg, $0.86\\%$ for FedIT, and $1.94\\%$ for SLoRA. These enhancements lend empirical support to our theoretical generalization analysis that clients utilizing higher LoRA ranks tend to exhibit improved generalization abilities. The most substantial performance improvements are observed in the heavy-tail-strong resource distribution, followed by the normal distribution. This is consistent with our expectations since the heavy-tail-strong distribution predominantly comprises clients with Type 4 LoRA configurations (rank 200). The limited presence of Type 1 clients (rank 8) in the normal distribution minimizes the risk of the global model being excessively influenced by task-specific LoRA weights. Therefore, FlexLoRA is able to leverage the heterogeneous resource distributions to boost the zero-shot generalization, and the gain from integrating FlexLoRA is directly related to the ratio of clients with heavy resources. ", "page_idx": 6}, {"type": "text", "text": "4.4 Cross-Task Generalization ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "Evaluation Setup. To assess the natural language understanding capabilities of the FlexLoRAenhanced global model, we evaluate its performance on a range of downstream NLP tasks. Specifically, the model is tested on the English Track of the evaluation tasks from [39], featuring 12 categories and 119 tasks. For each task, a random sample of 100 data points is chosen for testing. We summarize the average percentage improvement achieved by integrating FlexLoRA across different resource distributions in Table 3. ", "page_idx": 6}, {"type": "table", "img_path": "gkOzoHBXUw/tmp/acc3fedc27a742ebbf241afe28b7163a803c4033870b12bc18eacd43ac064e6b.jpg", "table_caption": ["Table 3: Average percentage improvement of FlexLoRA over baseline methods (FedAvg, FedIT, SLoRA) across different resource distributions, calculated over 12 NLP task categories. More detailed comparison is presented in Figure 4. "], "table_footnote": [], "page_idx": 7}, {"type": "image", "img_path": "gkOzoHBXUw/tmp/d8bef92930556c017d1cfafee20969535b3de5073f94b0613d7b86b439fb1166.jpg", "img_caption": ["Figure 5: Client number $(|\\mathcal{C}|)$ v.s. generalization on heterogeneous distributions. Increasing $|{\\mathcal{C}}|$ improves both convergence loss and rouge-L (scores marked as (R-L)). "], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "", "page_idx": 7}, {"type": "text", "text": "Effect of Specific Resource Distributions. In the majority of cases, the global models augmented with FlexLoRA demonstrate marked improvements over the vanilla implementations of FedAvg, FedIT, and SLoRA by up to $1.99\\%$ , suggesting that the FlexLoRA also improves the natural language analysis capabilities. An exception is noted in the SLoRA on the heavy-tail-light distribution, potentially due to the predominance of the Type 1 LoRA configuration (rank 8), which may limit the overall language processing capabilities when such clients are disproportionately represented. This configuration’s minimal rank assignment across all linear layers suggests that the local weight aggregation on the server side might not fully leverage the capabilities of clients with larger resources, potentially detracting from the model’s performance on certain tasks. ", "page_idx": 7}, {"type": "text", "text": "Effect of Specific Language Tasks. We further illustrate the task-specific improvements of integrating FlexLoRA in comparison with the standard FedAvg configuration for various resource distributions in Figure 4. The task-wise improvement figures for other FL methods are included in Appendix G. We observe that the global models trained using the FlexLoRA aggregation scheme generally outperform others on tasks requiring the parsing of logical relationships between sentences. Particularly, it gains improvements at most $4\\%$ in the overlap extraction task, and around $2.5\\%$ in the textual entailment, cause-effect classification, and dialogue act recognition task, verifying again the effectiveness of FlexLoRA. ", "page_idx": 7}, {"type": "text", "text": "4.5 Aggregation Scheme Study ", "text_level": 1, "page_idx": 7}, {"type": "image", "img_path": "gkOzoHBXUw/tmp/f1652f488cba1f77a5168fd40e855829576e921cefaac19c2a9a0085dae821c7.jpg", "img_caption": ["(a) Losses of FedIT and FlexLoRA-integrated FedIT. "], "img_footnote": [], "page_idx": 7}, {"type": "image", "img_path": "gkOzoHBXUw/tmp/b68b9ac6f66c5b7d1ac7209da264c283b0120f1395b1a49513a1d3f0e758d3c6.jpg", "img_caption": ["(b) The $q_{p r o j}$ ’s singular values and estimate error. "], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "Figure 6: The sub-figure 6(a) shows that FedIT with LoRA rank 8 has comparable test loss curves for standard and FlexLoRA integration. At rank 200, though, standard FedIT differs from other versions. 6(b) depicts singular value distributions and approximation errors, where the red cross indicates the average error for rank $30\\;q_{p r o j}$ weights in specific blocks. Further details are in Appendix H. ", "page_idx": 7}, {"type": "text", "text": "SVD on Convergence. FlexLoRA’s aggregation scheme constructs full-size LoRA weights before averaging, unlike the conventional FedAvg method’s parameter-wise averaging. To understand the effect of this difference on model performance, we assess the performance of FlexLoRA in a controlled environment using homogeneous LoRA ranks and compare it to the standard FL aggregation scheme. Figure 6(a) presents the test loss trajectories for FedIT with and without the FlexLoRA enhancement, both utilizing a homogeneous rank of 8. The loss curves for the standard FedIT and FedIT with FlexLoRA closely align, suggesting comparable performance. In a nutshell, we empirically demonstrate that under homogeneous conditions, FlexLoRA’s aggregation does not negatively impact model performance compared to traditional methods. Besides, it’s worth noting that the test loss for FedIT with a homogeneous rank of 200 is significantly lower, underscoring the benefits of higher rank configurations and evidencing our Theorem 1. ", "page_idx": 8}, {"type": "text", "text": "SVD v.s. LoRA Rank. To gain further insight into the effect of SVD, we calculate and sort the singular values of the global LoRA weights from largest to smallest. We focus on specific layers where LoRA is applied within the transformer blocks 1, 8, and 14 (each block includes one attention layer and one FFN layer). Figure 6(b) displays the scale of singular values and the error ratio between the global LoRA weights approximated by the top $i$ singular values and the full-rank global LoRA weights in the FedIT setting with a heavy-tail-strong resource distribution. The approximation error is quantified as the norm of the difference between the approximated and full-rank weights. The error curves for $q_{p r o j}$ layers across all transformer blocks nearly overlap. With the weight approximated from the top 30 ranks, the error ratio is as low as 0.16, suggesting the approximated weights are in close proximity to the actual full-rank weights, lending empirical support to our Assumption 2. ", "page_idx": 8}, {"type": "text", "text": "4.6 Scalability Study ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "Larger Model Size and Lower Degree of Task Heterogeneity. While the aforementioned experiments with 1.3B LLM and meta-task dataset split effectively showcases FlexLoRA’s capabilities against baselines in a highly heterogeneous cross-device environment, real-world settings may be relaxed involving fewer clients with a mixture of tasks and larger LLM. To better evaluate FlexLoRA’s performance in such scenarios, we expanded our study to include settings where each client manages not just one specific “meta” task but a variety of different tasks. We use Dolly-15K dataset [9], which supports instruction tuning and includes 8 tasks in total. We distributed this dataset among 200 clients using a Dirichlet distribution with $\\alpha=0.5$ to simulate the non-IID data distributions. Moreover, we also incorporate the most cutting-edge LLaMA-3 [37] with 8B parameter size as our foundation model to assess FlexLoRA’s effectiveness with advanced, larger-scale models. ", "page_idx": 8}, {"type": "text", "text": "Table 12 in Appendix I illustrates FlexLoRA’s efficacy under both smaller and larger foundation models within the mixture of task settings. Compared with LLaMA-3 (8B), finetuning on DataJucier(1.3B) demonstrates more generalization improvement for unseen clients. This enhanced performance when using the smaller DataJuicer model suggests that FlexLoRA is particularly effective for foundation models that are scalable to edge devices. Such ability is instrumental in maximizing the utility and efficiency of smaller models in resource-constrained environments. ", "page_idx": 8}, {"type": "text", "text": "System Costs. We empirically demonstrate that increasing the rank improves overall efficiency. The experiment is conducted on the Dolly 15K dataset and the DataJuicer 1.3B model, with the same FL setting as Table 12. We summarize the results in Table 4, where the “ $R^{\\bullet}$ indicates the number of rounds to reach a loss of 2, approximately $75\\%$ progress to convergence. The $^{\\bullet\\bullet}C o s t_{R}{}^{\\bullet}{}^{\\bullet}$ stands for per-round FL cost in terms of the average model parameters compared with the foundation model parameters, as both the local training and communication cost positively correlated to the rank value in FlexLoRA (as analyzed in Sec. 3.3). The $^{\\ast}C o s t_{a l l}{}^{,\\bullet}$ indicates total cost calculated as multiply of $R$ and $C o s t_{R}$ , and by setting the result of “Homo Rank” as the baseline. From the results, we can see that FlexLoRA achieves faster convergence with slightly increased parameter percentages under heterogeneous resource distributions. For the overall efficiency, “Heavy-Tail-Light” has a total reduction of $49.4\\%$ , and “Uniform” has $66.9\\%$ , indicating good scalability of FlexLoRA. ", "page_idx": 8}, {"type": "table", "img_path": "gkOzoHBXUw/tmp/55c2bb4fd0bc0c8c2d1f58433043bc3c898319a85889ed8af8e122f9fe8733ed.jpg", "table_caption": ["Table 4: Convergence round and FL cost per round for different LoRA ranks. "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "", "page_idx": 8}, {"type": "text", "text": "Effect of Larger Client Number. We designed an experiment to empirically validate Theorem 1 and demonstrate how FlexLoRA performs with varied client numbers. We use subsets of 10, 50, and 100 clients from a pool of 200 clients on Dolly-15K dataset and DataJuicer (1.3B), with FedAvg as baseline FL method and each FL round always sampling 10 participants. From Figure 5, there is a marked improvement in generalization as the number of participating clients increases. Moreover, from Theorem 1, we can derive the functional relationship between client number $|C|$ and the generalization loss $\\epsilon$ as $|C|=A_{1}/\\epsilon^{2}(A_{2}-l o g(\\epsilon-A_{3}))$ , where $A_{1,2,3}$ are constants absorbing the other factors impacted by specific resource distribution in this experiment. We thus fit these coefficients using the derived form and empirical observations, and find that the dotted curves gain good fitness for all the tested distributions. There results affirm the preciseness of our Theorem 1 again, indicating the suitableness of FlexLoRA for cross-device FL scenarios where leveraging a broad client pool can boost the generalization across diverse data distributions. ", "page_idx": 9}, {"type": "text", "text": "5 Conclusion ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "In this work, we propose a simple yet effective method named FlexLoRA to address the challenges posed by resource and data heterogeneity among clients during the federated fine-tuning of LLMs. By leveraging larger local LoRA ranks, FlexLoRA not only improves the generalization ability of the global model but also ensures that all clients, irrespective of their resource capabilities, can contribute meaningfully. Theoretical analysis and extensive experiments verify the effectiveness and scalability of FlexLoRA. Due to resource limitations, we have not tested the LLaMA-3 model on thousands-client scenarios, which we leave as future work. We hope this study can enlighten more future research and development in data-efficient and privacy-preserving enhancement of LLMs. ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "[1] Armen Aghajanyan, Sonal Gupta, and Luke Zettlemoyer. Intrinsic dimensionality explains the effectiveness of language model fine-tuning. In Chengqing Zong, Fei Xia, Wenjie Li, and Roberto Navigli, editors, Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers), pages 7319–7328, August 2021.   \n[2] Sara Babakniya, Ahmed Roushdy Elkordy, Yahya H Ezzeldin, Qingfeng Liu, Kee-Bong Song, Mostafa El-Khamy, and Salman Avestimehr. Slora: Federated parameter efficient fine-tuning of language models. arXiv preprint arXiv:2308.06522, 2023.   \n[3] Jonathan Baxter. A model of inductive bias learning. Journal of Artificial Intelligence Research, 2000.   \n[4] Daoyuan Chen, Dawei Gao, Weirui Kuang, Yaliang Li, and Bolin Ding. pFL-bench: A comprehensive benchmark for personalized federated learning. In Advances in neural information processing systems (NeurIPS), 2022.   \n[5] Daoyuan Chen, Dawei Gao, Yuexiang Xie, Xuchen Pan, Zitao Li, Yaliang Li, Bolin Ding, and Jingren Zhou. Fs-real: Towards real-world cross-device federated learning. Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining, 2023.   \n[6] Daoyuan Chen, Yilun Huang, Zhijian Ma, Hesen Chen, Xuchen Pan, Ce Ge, Dawei Gao, Yuexiang Xie, Zhaoyang Liu, Jinyang Gao, Yaliang Li, Bolin Ding, and Jingren Zhou. Data-juicer: A one-stop data processing system for large language models. In International Conference on Management of Data, 2024.   \n[7] Daoyuan Chen, Liuyi Yao, Dawei Gao, Bolin Ding, and Yaliang Li. Efficient personalized federated learning via sparse model-adaptation. In International Conference on Machine Learning (ICML), 2023.   \n[8] Yae Jee Cho, Luyang Liu, Zheng Xu, Aldi Fahrezi, and Gauri Joshi. Heterogeneous lowrank approximation for federated fine-tuning of on-device foundation models. arXiv preprint arXiv:2401.06432, 2024.   \n[9] Mike Conover, Matt Hayes, Ankit Mathur, Jianwei Xie, Jun Wan, Sam Shah, Ali Ghodsi, Patrick Wendell, Matei Zaharia, and Reynold Xin. Free dolly: Introducing the world’s first truly open instruction-tuned llm, 2023.   \n[10] Luca Corinzia, Ami Beuret, and Joachim M Buhmann. Variational federated multi-task learning. arXiv preprint arXiv:1906.06268, 2019.   \n[11] Enmao Diao, Jie Ding, and Vahid Tarokh. Heterofl: Computation and communication efficient federated learning for heterogeneous clients. In International Conference on Learning Representations (ICLR), 2020.   \n[12] Ning Ding, Yujia Qin, Guang Yang, Fuchao Wei, Zonghan Yang, Yusheng Su, Shengding Hu, Yulin Chen, Chi-Min Chan, Weize Chen, et al. Parameter-efficient fine-tuning of large-scale pre-trained language models. Nature Machine Intelligence, 2023.   \n[13] Zihao Fu, Anthony Man-Cho So, and Nigel Collier. A stability analysis of fine-tuning a pre-trained model. arXiv preprint arXiv:2301.09820, 2023.   \n[14] Junxian He, Chunting Zhou, Xuezhe Ma, Taylor Berg-Kirkpatrick, and Graham Neubig. Towards a unified view of parameter-efficient transfer learning. In The International Conference on Learning Representations (ICLR), 2022.   \n[15] Neil Houlsby, Andrei Giurgiu, Stanislaw Jastrzebski, Bruna Morrone, Quentin De Laroussilhe, Andrea Gesmundo, Mona Attariyan, and Sylvain Gelly. Parameter-efficient transfer learning for nlp. In International Conference on Machine Learning (ICML), 2019.   \n[16] Edward J Hu, yelong shen, Phillip Wallis, Zeyuan Allen-Zhu, Yuanzhi Li, Shean Wang, Lu Wang, and Weizhu Chen. LoRA: Low-rank adaptation of large language models. In International Conference on Learning Representations (ICLR), 2022.   \n[17] Hang Hua, Xingjian Li, Dejing Dou, Cheng-Zhong Xu, and Jiebo Luo. Improving pretrained language model fine-tuning with noise stability regularization. IEEE Transactions on Neural Networks and Learning Systems, 2023.   \n[18] Chengsong Huang, Qian Liu, Bill Yuchen Lin, Tianyu Pang, Chao Du, and Min Lin. Lorahub: Efficient cross-task generalization via dynamic lora composition. arXiv preprint arXiv:2307.13269, 2023.   \n[19] Weirui Kuang, Bingchen Qian, Zitao Li, Daoyuan Chen, Dawei Gao, Xuchen Pan, Yuexiang Xie, Yaliang Li, Bolin Ding, and Jingren Zhou. Federatedscope-LLM: A comprehensive package for fine-tuning large language models in federated learning. arXiv preprint arXiv:2309.00363, 2023.   \n[20] Tian Li, Anit Kumar Sahu, Ameet Talwalkar, and Virginia Smith. Federated learning: Challenges, methods, and future directions. IEEE signal processing magazine, 2020.   \n[21] Tian Li, Anit Kumar Sahu, Manzil Zaheer, Maziar Sanjabi, Ameet Talwalkar, and Virginia Smith. Federated optimization in heterogeneous networks. Proceedings of Machine learning and systems, 2020.   \n[22] Xiang Li, Kaixuan Huang, Wenhao Yang, Shusen Wang, and Zhihua Zhang. On the convergence of fedavg on non-iid data. In The International Conference on Learning Representations (ICLR), 2019.   \n[23] Xiang Lisa Li and Percy Liang. Prefix-tuning: Optimizing continuous prompts for generation. arXiv preprint arXiv:2101.00190, 2021.   \n[24] Vladislav Lialin, Sherin Muckatira, Namrata Shivagunde, and Anna Rumshisky. ReloRA: High-rank training through low-rank updates. In Workshop on Advancing Neural Network Training: Computational Efficiency, Scalability, and Resource Optimization (WANT@NeurIPS 2023), 2023.   \n[25] Tao Lin, Lingjing Kong, Sebastian U Stich, and Martin Jaggi. Ensemble distillation for robust model fusion in federated learning. Advances in neural information processing systems (NeurIPS), 2020.   \n[26] Zhenqing Ling, Daoyuan Chen, Liuyi Yao, Yaliang Li, and Ying Shen. On the convergence of zeroth-order federated tuning in large language models. arXiv preprint arXiv:2402.05926, 2024.   \n[27] Sadhika Malladi, Tianyu Gao, Eshaan Nichani, Alex Damian, Jason D Lee, Danqi Chen, and Sanjeev Arora. Fine-tuning language models with just forward passes. Advances in Neural Information Processing Systems, 36, 2024.   \n[28] Brendan McMahan, Eider Moore, Daniel Ramage, Seth Hampson, and Blaise Aguera y Arcas. Communication-efficient learning of deep networks from decentralized data. In Artificial intelligence and statistics, 2017.   \n[29] Milad Nasr, Nicholas Carlini, Jonathan Hayase, Matthew Jagielski, A Feder Cooper, Daphne Ippolito, Christopher A Choquette-Choo, Eric Wallace, Florian Tramèr, and Katherine Lee. Scalable extraction of training data from (production) language models. arXiv preprint arXiv:2311.17035, 2023.   \n[30] Duy Phuong Nguyen, J Pablo Munoz, and Ali Jannesari. Flora: Enhancing vision-language models with parameter-efficient federated learning. arXiv preprint arXiv:2404.15182, 2024.   \n[31] Long Ouyang, Jeffrey Wu, Xu Jiang, Diogo Almeida, Carroll Wainwright, Pamela Mishkin, Chong Zhang, Sandhini Agarwal, Katarina Slama, Alex Ray, John Schulman, Jacob Hilton, Fraser Kelton, Luke Miller, Maddie Simens, Amanda Askell, Peter Welinder, Paul F Christiano, Jan Leike, and Ryan Lowe. Training language models to follow instructions with human feedback. In Advances in neural information processing systems (NeurIPS), 2022.   \n[32] Zhen Qin, Daoyuan Chen, Bingchen Qian, Bolin Ding, Yaliang Li, and Shuiguang Deng. Federated full-parameter tuning of billion-sized language models with communication cost under 18 kilobytes. In International Conference on Machine Learning (ICML), 2024.   \n[33] Colin Raffel, Noam Shazeer, Adam Roberts, Katherine Lee, Sharan Narang, Michael Matena, Yanqi Zhou, Wei Li, and Peter J Liu. Exploring the limits of transfer learning with a unified text-to-text transformer. The Journal of Machine Learning Research, 2020.   \n[34] Sylvestre-Alvise Rebuff,i Hakan Bilen, and Andrea Vedaldi. Learning multiple visual domains with residual adapters. Advances in neural information processing systems (NeurIPS), 2017.   \n[35] Aviv Shamsian, Aviv Navon, Ethan Fetaya, and Gal Chechik. Personalized federated learning using hypernetworks. In International Conference on Machine Learning (ICML), 2021.   \n[36] Youbang Sun, Zitao Li, Yaliang Li, and Bolin Ding. Improving loRA in privacy-preserving federated learning. In The Twelfth International Conference on Learning Representations, 2024.   \n[37] Hugo Touvron, Thibaut Lavril, Gautier Izacard, Xavier Martinet, Marie-Anne Lachaux, Timothée Lacroix, Baptiste Rozière, Naman Goyal, Eric Hambro, Faisal Azhar, et al. Llama: Open and efficient foundation language models. arXiv preprint arXiv:2302.13971, 2023.   \n[38] Boxin Wang, Yibo Jacky Zhang, Yuan Cao, Bo Li, H Brendan McMahan, Sewoong Oh, Zheng Xu, and Manzil Zaheer. Can public large language models help private cross-device federated learning? arXiv preprint arXiv:2305.12132, 2023.   \n[39] Yizhong Wang, Swaroop Mishra, Pegah Alipoormolabashi, Yeganeh Kordi, Amirreza Mirzaei, Atharva Naik, Arjun Ashok, Arut Selvan Dhanasekaran, Anjana Arunkumar, David Stap, et al. Super-naturalinstructions: Generalization via declarative instructions on $1600+$ nlp tasks. In Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing, 2022.   \n[40] David H. Wolpert and William G. Macready. No free lunch theorems for optimization. IEEE Transactions on Evolutionary Computation, 1997.   \n[41] Mingbin Xu, Congzheng Song, Ye Tian, Neha Agrawal, Filip Granqvist, Rogier van Dalen, Xiao Zhang, Arturo Argueta, Shiyi Han, Yaqiao Deng, et al. Training large-vocabulary neural language models by private federated learning for resource-constrained devices. In ICASSP 2023- 2023 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), 2023.   \n[42] Yuxuan Yan, Shunpu Tang, Zhiguo Shi, and Qianqian Yang. Federa: Efficient fine-tuning of language models in federated learning leveraging weight decomposition. arXiv preprint arXiv:2404.18848, 2024.   \n[43] Jianyi Zhang, Saeed Vahidian, Martin Kuo, Chunyuan Li, Ruiyi Zhang, Guoyin Wang, and Yiran Chen. Towards building the federated gpt: Federated instruction tuning. arXiv preprint arXiv:2305.05644, 2023.   \n[44] Zhuo Zhang, Yuanhang Yang, Yong Dai, Qifan Wang, Yue Yu, Lizhen Qu, and Zenglin Xu. Fedpetuning: When federated learning meets the parameter-efficient tuning methods of pretrained language models. In Annual Meeting of the Association of Computational Linguistics 2023, 2023.   \n[45] Wayne Xin Zhao, Kun Zhou, Junyi Li, Tianyi Tang, Xiaolei Wang, Yupeng Hou, Yingqian Min, Beichen Zhang, Junjie Zhang, Zican Dong, et al. A survey of large language models. arXiv preprint arXiv:2303.18223, 2023. ", "page_idx": 9}, {"type": "text", "text": "", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "Appendix ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "We provide an outline of how we organize the appendix in below: ", "page_idx": 13}, {"type": "text", "text": "Implementation details of our experiments: ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "• Appendix A: Implementation details for the experiments shown in Figure 1 related to the zero-shot test loss of naive FedIT with LoRA rank of 1, 8, and 200, including an \"extreme heavy tail\" scenario.   \n• Appendix E: General experimental details, including hyperparameter settings, cross-task splitter details, and the choice of layers for applying LoRA.   \n• Appendix L:Provides details about the computational infrastructure and cost associated with the experiments mentioned in the document. ", "page_idx": 13}, {"type": "text", "text": "Algorithm, proof and analysis of FlexLoRA: ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "• Appendix B: The pseudocode for FlexLoRA’s algorithm in a federated learning context, detailing the process from initialization, client sampling, local updates, to server updates.   \n• Appendix C: Proof of Theorem 1, providing a mathematical derivation of the bounds on generalization error under specific assumptions.   \n• Appendix D: Analysis of efficiency improvements from LoRA under different ranks, detailing the trainable parameters, memory costs, and efficiency gains compared with full finetuning. ", "page_idx": 13}, {"type": "text", "text": "More experimental results including: ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "• Appendix F: Statistics of the Table 2, including 1. Percentage of improvement w/ FlexLoRA vs w/o FlexLoRA 2. significant test results comparing FlexLoRA with its baselines across different resource distribution types.   \n• Appendix G: More results on task-specific performance improvements of global models trained with FlexLoRA, particularly in natural language tasks.   \n• Appendix H: Additional results on the effect of SVD, including the distribution of singular values and the approximation error ratio.   \n• Appendix I: Results on the efficacy of FlexLoRA result under a mixture of task setting.   \n• Appendix J: Discusses the single client’s performance impact of different LoRA ranks, showcasing how performance improves with higher LoRA ranks across various NLP tasks. ", "page_idx": 13}, {"type": "text", "text": "A Implementation of Figure 1 ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "For the experiments in Figure 1, we plotted the zero-shot test loss of naive FedIT with LoRA rank equal to 1, 8, and 200. For the experiment of FedIT with FlexLoRA, we adopt an “extreme heavy tail” scenario where all the clients have a LoRA rank of 200 except one with a LoRA rank of 8. All the hyperparameters and FL experiment settings are the same as the experiments in Table 2. ", "page_idx": 13}, {"type": "text", "text": "B The Algorithm of FlexLoRA ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "We summarize the Pseudocode of FlexLoRA in Algorithms 1 and 2. ", "page_idx": 13}, {"type": "text", "text": "C Proof of Theorem 1 ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "Let $\\mathbb{H}^{n}$ denote the function space with its elements parameterized by $W_{g}$ and the distance metric $\\Delta$ is defined as: ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\quad\\Delta(W_{g}^{i}-W_{g}^{i^{\\prime}})}\\\\ &{=\\!\\frac{1}{n}{\\mathbb E}_{x,y\\sim{\\mathcal D}_{i}}\\left[\\left|\\sum(f(W_{g}^{i};x,y)-\\sum f(W_{g}^{i^{\\prime}};x,y)\\right|\\right],}\\end{array}\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "Input: $T$ , $B_{g}^{0}$ , $A_{g}^{0}$ , $\\{D_{i}^{0}\\}_{i\\in{\\mathcal{C}}},s,r_{g},\\{r^{i}\\}_{i\\in{\\mathcal{C}}}$ , where $T$ is the total communication rounds and $\\mathcal{C}$ is the set of all $\\scriptstyle{\\tilde{\\mathrm{FL}}}$ clients 1 for $t=1,\\cdot\\cdot\\cdot,T$ do 2 Server samples clients $\\mathcal{C^{t}}$ sampled from $\\mathcal{C}$ , sends $B_{g}^{i}$ and $A_{g}^{i}$ to $i\\in\\mathcal{C}^{t}$ for client $i\\in\\mathcal{C}^{t}$ in parallel do Update local LoRA module weight: $\\{B_{l}^{i},A_{l}^{i}\\}_{i\\in\\mathcal{C}}=$ LOCALUPDATE $\\left(\\{B_{g}^{i}A_{g}^{i}\\}_{i\\in C}\\right)$ 4 Server updates global model: $/{\\star}$ Implement FlexLoRA Here $\\star/$ $\\{B_{g}^{i},A_{g}^{i}\\}_{i\\in{\\cal C}}=$ SERVERUPDATE $\\left(\\{B_{l}^{i},A_{l}^{i},r^{i}\\}_{i\\in\\mathcal{C}}\\right)$ 5 return $\\theta$ , $\\{B_{g}^{i},A_{g}^{i}\\}_{i\\in{\\cal C}}$ ", "page_idx": 14}, {"type": "text", "text": "Algorithm 2 FlexLoRA Server Update ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Input: $\\{B_{l}^{i},A_{l}^{i},r^{i},\\gamma^{i}\\}_{i\\in\\mathcal{C}}$ , s, $r_{g}$ , $\\{r^{i}\\}_{i\\in\\mathcal{C}}$ , where $\\gamma^{i}$ is average constant for client $i$ depending on size of its local dataset   \n6 Aggregation with Heterogeneous LoRA Ranks: Initialize global weight $W_{g}=0$ for $i\\in\\bar{C^{t}}\\bar{l}$ do   \n7 Compose local client LoRA weight: $W_{l}^{i}=s B_{l}^{i}A_{l}^{i}$ Weighted Average client weight: $\\bar{W_{g}}\\,\\bar{=W_{g}}+\\gamma^{i}\\bar{W}_{l}^{i}$   \n8 Decompose global LoRA weight: $/{\\star}$ Only do once $\\star/$ $U,\\Sigma,V=\\operatorname{SVD}\\left(W_{g}\\right)$ Distribute Global Weight: for $i\\in\\mathcal{C}^{t}l$ do Compute each client LoRA weight based on their resource limitation: Big = U[:, : ri]Σ[: ri, : ri]/s Aig = V [: ri, :]T ", "page_idx": 14}, {"type": "text", "text": "10 return $\\{B_{g}^{i},A_{g}^{i}\\}_{i\\in\\mathcal{C}}$ ", "page_idx": 14}, {"type": "text", "text": "With the inequalities introduced by Assumptions 1 and 2, we have: ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\quad\\Delta(W_{g}^{i}-W_{g}^{i^{\\prime}})}\\\\ &{=\\frac{1}{n}\\mathbb{E}_{g,y\\sim\\mathcal{P}_{n}}\\left[\\left|\\sum_{\\ell}(f(W_{g}^{i},x,y)-\\sum_{\\ell}f(W_{g}^{i^{\\prime}};x,y)\\right|\\right]\\right.}\\\\ &{\\left.\\le L_{f}\\|h_{W_{s}^{\\prime}}-h_{W_{s}^{\\prime},\\ell}\\|\\right.}\\\\ &{\\left.\\le L_{f}L_{h}\\|\\nabla\\nabla(W_{g},r^{i})-\\nabla\\nabla(W_{g}^{i^{\\prime}},r^{i})\\|\\right.}\\\\ &{\\left.=L_{f}L_{h}\\|\\nabla\\nabla(W_{g},r^{i})-W_{g}-\\nabla\\nabla(W_{g}^{i^{\\prime}},r^{i})\\|\\right.}\\\\ &{\\quad\\left.\\quad+W_{g}^{i^{\\prime}}+W_{g}-W_{g}^{i^{\\prime}}\\right|\\right.}\\\\ &{\\left.\\le L_{f}L_{h}\\|\\nabla\\nabla(W_{g},r^{i})-W_{g}\\|\\right.}\\\\ &{\\quad\\left.\\quad+L_{f}L_{h}\\|\\nabla\\nabla(W_{g}^{i^{\\prime}},r^{i})-W_{g}^{i^{\\prime}}\\|\\right.}\\\\ &{\\quad\\left.\\quad+L_{f}L_{h}\\|W_{g}-W_{g}^{i^{\\prime}}\\|\\right.}\\\\ &{\\le L_{f}L_{h}\\|W_{g}-W_{g}^{i^{\\prime}}\\|}\\\\ &{\\le L_{f}L_{h}\\left[\\mathcal{G}^{i}+\\|W_{g}-W_{g}^{i^{\\prime}}\\|\\right].}\\end{array}\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "Let the parameter solution space of $W_{g}$ denote as $k$ . We can get an $\\epsilon$ -covering in metric $\\Delta(W_{g,i}-$ $W_{g,i}^{'})$ if we select a covering in the parameter space with $||W_{g}-W_{g}^{'}||$ equal to $\\frac{\\epsilon}{L_{f}L_{h}}-2\\phi^{i}$ . Therefore, the covering number of $\\mathbb{H}^{|\\mathcal{C}|}$ , denoted as $B(\\epsilon,\\mathbb{H}^{|\\mathcal{C}|})$ is: $\\begin{array}{r}{\\log\\left(\\mathcal{B}(\\epsilon,\\mathbb{H}^{|\\mathcal{C}|})\\right)=\\mathcal{O}\\left(k\\log(\\frac{R L_{f}L_{h}}{\\epsilon-2\\phi^{i}L_{f}L_{h}})\\right)}\\end{array}$ . ", "page_idx": 14}, {"type": "text", "text": "According to previous studies [3, 35, 7], there exists $\\tilde{N}$ and $\\begin{array}{r l r}{\\tilde{N}}&{{}=}&{\\mathcal{O}\\left(\\frac{1}{n\\epsilon^{2}}\\log\\frac{\\mathcal{B}(\\epsilon,\\mathbb{H}^{|C|})}{\\delta}\\right)\\,=\\,}\\end{array}$ $\\begin{array}{r}{\\mathcal{O}\\big(\\frac{k}{|\\mathcal{C}|\\epsilon^{2}}\\log\\bigl(\\frac{R L_{f}L_{h}}{\\epsilon-2\\phi^{i}L_{f}L_{h}}\\bigr)-\\frac{\\log\\delta}{|\\mathcal{C}|\\epsilon^{2}}\\big).}\\end{array}$ 口 ", "page_idx": 15}, {"type": "text", "text": "D Efficiency Improvement from LoRA under Different Ranks ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "We calculate the $\\%$ trainable parameters and active memory cost for LoRA under different ranks compared with full finetuning in our experiment setting, summarized in Table 5. Although the size of LoRA weights is small compared with the pretrained model because LoRA only tunes a small proportion of the trainable parameters, LoRA tuning is still much more efficient than full parameter finetuning, which highlights the necessity to scale LoRA rank size on clients with diverse computation resources. Table 6 illustrates the empirical time consumption for tuning client with LoRA and full finetuning. ", "page_idx": 15}, {"type": "table", "img_path": "gkOzoHBXUw/tmp/61cf4a900d05e136e466f07ba6bb46b688a534fa8fb3b868e7fbd6c9fe4df1e9.jpg", "table_caption": ["Table 5: Trainable parameters and memory cost for different LoRA configurations, and the corresponding efficiency improvement compared with full finetuning. "], "table_footnote": [], "page_idx": 15}, {"type": "table", "img_path": "gkOzoHBXUw/tmp/b79d552c0f8c5cced78ac19539ee4f6541002a00fe66ee2d48d25957a5ecaf21.jpg", "table_caption": ["Table 6: Speedup of LoRA tuning for each communication round. "], "table_footnote": [], "page_idx": 15}, {"type": "table", "img_path": "gkOzoHBXUw/tmp/f650a8afa3ec956bee3666d48969213a8e2fbb0b473dd23091b8409d5adb39dc.jpg", "table_caption": ["Table 7: Illustration of the original data structure for tasks in natural instruction dataset [39]. "], "table_footnote": [], "page_idx": 15}, {"type": "text", "text": "E Implementation Details ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "E.1 Hyperparameter Setting ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "All FL experiments are conducted with a client participation rate of 0.05 in each round, and with an early stopping mechanism that terminates training if the validation loss does not improve over 3 consecutive $\\mathrm{FL}$ rounds. These values are adopted to better reflect the operational challenges inherent in real-world cross-device scenarios, which often involve limited device responsiveness and restricted training duration. Besides, the batch size is set as 4 via searching from a range of {2,4,16}. The maximum token length is 512. All the experiments are repeated with 2 random seeds and we report the standard deviations. More details about the computational infrastructure and cost for our experiments are in Appendix L. ", "page_idx": 15}, {"type": "table", "img_path": "gkOzoHBXUw/tmp/c951ae12ff6777d749c95c77106a6f52ed0e2ac9b9b670854651b33848e40e18.jpg", "table_caption": ["Table 8: The example of prompt template for training, adapting from Table 7. "], "table_footnote": [], "page_idx": 16}, {"type": "text", "text": "", "page_idx": 16}, {"type": "text", "text": "For the sparse fine-tuning stage of SLoRA, we set its sparsity corresponding with the resource cost of the client’s LoRA configuration shown in Table1. For example, if the client is assigned with Type 1 LoRA configuration, we will generate a mask with a sparsity of $0.12\\%$ . For HETLORA, following the original paper, we adopt 0.99 as the decay factor for rank pruning and search the regularization factor from a range of {5e-2, 5e-3, 5e-4}. For both the experiments integrated with and without FlexLoRA, we grid search their learning rates from a range of {5e-2, 5e-3, 5e-4} for FedAvg, and {5e-4, 1e-4, 5e-5, 1e-5} for FedIT and SLoRA, both accompanied with a linear scheduler which decays from the initial learning rate to 0. ", "page_idx": 16}, {"type": "text", "text": "E.2 Cross-Task Splitter Details ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Echoing findings from [39] on model performance saturation with few data instances, we randomly sample $10\\%$ of each task’s data to scale experiments. For all the datasets we used, data for each client is partitioned into training, validation, and testing sets in a ratio of 8:1:1. In the initial setup of the natural instruction dataset, each task is accompanied by its definition, along with a positive example and a negative example. To adapt this dataset for model fine-tuning through instruction tuning, we transform the structure so that the task definition serves as the direct instruction for each data instance. This restructuring is illustrated by comparing the original and modified data formats in the natural instruction dataset, as shown in Table 7 and Table 8. This adjustment ensures that each instance is now explicitly aligned with its instructional context, facilitating a more straightforward and effective fine-tuning process. ", "page_idx": 16}, {"type": "text", "text": "E.3 Choice of Layers for applying LoRA ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "We explore the influence of insertion layers of LoRA on the performance of the fine-tuning. While [16] and [8] add LoRA on all the attention layers, [43] adds LoRA on all the linear layers, i.e., the attention layers and Feed-Forward Network layers. We experimented with both approaches to adding LoRA. From Table 9, we demonstrate that adding LoRA to both the attention layers and Feed-Forward Network layers boosts generalization performance and adopt this setting in our experiments. ", "page_idx": 16}, {"type": "text", "text": "Table 9: Impact of choosing different layers to apply LoRA module. The results are zero-shot Rouge-L score of the global model. For the experiment that uses FlexLoRA for aggregation, the client resource distribution is uniform. ", "page_idx": 16}, {"type": "table", "img_path": "gkOzoHBXUw/tmp/b2b8a99345c7b8ac0bbfe038794ed6a11032bbba05dde543e47266f46744b201.jpg", "table_caption": [], "table_footnote": [], "page_idx": 16}, {"type": "text", "text": "F Relative Improvement for Table 2 and Significant Test ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Table 10 presents the percentage of improvement for Table 2, providing a more straightforward overview of the enhancement of FlexLoRA. ", "page_idx": 16}, {"type": "table", "img_path": "gkOzoHBXUw/tmp/7f706d5b28447a52e43e32b149009361820fef56d90f937f9982ba12a2a06029.jpg", "table_caption": ["Table 10: Percentage of improvement of FedAvg, FedIT, and SLoRA incorporating with FlexLoRA compared with their respective configurations without FlexLoRA, as shown in Table 2. "], "table_footnote": [], "page_idx": 17}, {"type": "text", "text": "The statistical test results presented in Table 11 provide a quantitative comparison between the performance of FlexLoRA across different FL baselines to be integrated, namely FedAvg, FedIT, and SLoRA. The p-values obtained from the statistical tests are used to determine whether the observed differences in performance are statistically significant. ", "page_idx": 17}, {"type": "table", "img_path": "gkOzoHBXUw/tmp/95f58f4f7c962f0a4b68d48f5aabcd9545145bc1d63d7c0e9b83075460f43ef7.jpg", "table_caption": ["Table 11: Significant test results (in p-values) between FlexLoRA and its FL baselines to be integrated. "], "table_footnote": [], "page_idx": 17}, {"type": "text", "text": "As shown in the table, FlexLoRA consistently outperforms its homogeneous baselines under various distribution types, indicated by p-values smaller than the conventional significance level of 0.05 in several cases. Notably, under the ’Heavy Tail Light’ distribution, FlexLoRA achieves statistically significant improvements in FedIT $\\scriptstyle{\\mathrm{p}}=0.018)$ ) scenarios. Highly significant improvements are also observed in the “Heavy Tail Strong” and “normal” distributions, especially in the FedIT setting, where the p-values are smaller than 0.001 and 0.006 respectively, strongly suggesting that FlexLoRA’s performance enhancement is not due to random chance. ", "page_idx": 17}, {"type": "text", "text": "Overall, the results indicate that FlexLoRA is a robust approach that can yield performance improvements in federated tuning environments for LLMs, especially in scenarios characterized by a resource-heterogeneous distribution of client resources. ", "page_idx": 17}, {"type": "text", "text": "G Natural Language Task Performance ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Figure 7 illustrates the performance of global models on natural language tasks when trained with FlexLoRA in the FedIT setting. In line with results from the FedAvg setting, global models that leverage heterogeneous ranks in the FedIT setting also perform better on tasks involving logical relationships between sentences, such as overlap extraction, textual entailment, cause-effect classification, and dialogue act recognition. However, the global models underperform in word-level analysis tasks, such as word analogy and keyword tagging. We hypothesize that this underperformance in the FedIT setting is due to the local clients being trained with the Adam optimizer rather than the conventional SGD optimizer. The top decoding block of the LLaMA transformer, which processes word-level information, likely overftis specific information because of the momentum component inherent to the Adam optimizer. ", "page_idx": 17}, {"type": "text", "text": "H More Results for Effect of SVD ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Similar to Figure 6(b), Figure 8 also verifies the empirical information loss from SVD by illustrating the singular value distribution and error ratio of $k_{p r o j}$ weights. $k_{p r o j}$ weights shares similar trends with $q_{p r o j}$ weights regarding the singular value distribution and error ratio. ", "page_idx": 17}, {"type": "image", "img_path": "gkOzoHBXUw/tmp/119fc5a3c58ea683f09cf26f5b72af6b4fe978c8f7859906cc32a12d857bd9b3.jpg", "img_caption": ["Figure 7: Task-specific improvements achieved by FlexLoRA in comparison to the homogeneous rank implementation of FedIT, across different resource distribution settings. "], "img_footnote": [], "page_idx": 18}, {"type": "image", "img_path": "gkOzoHBXUw/tmp/d058774960abf2350d6661924db272655db618d7ab75e7b6cac7d3acd10900ef.jpg", "img_caption": ["Figure 8: Distribution of singular values and the approximation error ratio between the top $i$ -th singular value approximated $k_{p r o j}$ weights and the actual full-rank $k_{p r o j}$ weights. The red cross denotes the average error for weights with rank 30 of $k_{p r o j}$ across blocks 1, 8, and 14. "], "img_footnote": [], "page_idx": 18}, {"type": "text", "text": "I Experiment Result for Mixed Task Heterogeneity Scenario ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Table 12 provides the result of standard FedAvg vs FlexLoRA-integrated FedAvg under uniform and heavy-tail-light resource distributions. The foundation model includes DataJucier(1.3B) and LLaMA 3 (8B). ", "page_idx": 18}, {"type": "table", "img_path": "gkOzoHBXUw/tmp/05c3befde77b50748fa1507f9d0e6b38d9acf3ad7ec26407cea5b1f847be53eb.jpg", "table_caption": ["Table 12: Results of homogeneous LoRA configurations versus FlexLoRA under FedAvg methods. The experiments are conducted on both DataJucier (1.3B) and LLaMA-3(8B) models on Dolly-15K. "], "table_footnote": [], "page_idx": 18}, {"type": "text", "text": "J Single Client’s Performance under Different Rank ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Table 13 below shows the single client performance under a small rank of 8 and a large rank of 200. This data shows that performance improves with higher LoRA ranks uniformly regardless of the tasks assigned to each client, motivating us to allocate the highest feasible rank given a client’s resource budget. Figure 9 illustrates all the clients’ performance under rank 8 and rank 200. ", "page_idx": 19}, {"type": "table", "img_path": "gkOzoHBXUw/tmp/df992ef6b63d6c1e684530cfe88d2af99bbd474f070594cd41d00103072c7121.jpg", "table_caption": ["Table 13: 8 examples of single-client performance under FedIT with homo rank 8 and homo rank 200 distribution in a single round. "], "table_footnote": [], "page_idx": 19}, {"type": "image", "img_path": "gkOzoHBXUw/tmp/50af938bc56dc777237731db410e033afcee6ed79e0a4347eb2695d2bbd08850.jpg", "img_caption": ["Figure 9: Performance on FedIT with homo rank 8 vs homo rank 200 across all the clients. "], "img_footnote": [], "page_idx": 19}, {"type": "text", "text": "K FlexLoRA with Centralized LoRA Adaptive Methodologies ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Besides directly applying LoRA to each clients, we also investigate the efficacy of existing dynamic LoRA methods in central learning. We adapts concept of ReLoRA[24] into our setting and explore its utility when combining with FlexLoRA. ReLoRA trains LoRA for several epochs, uploads the LoRA weight to the pretrained weights, then initializes a new LoRA module and trains based on the new frozen weights, repeating this process for several LoRA modules. We create a baseline by incorporating the concept of ReLoRA, uploading aggregated LoRA weights to the pretrained models after several communication rounds. ", "page_idx": 19}, {"type": "text", "text": "However, we observed a slower convergence speed than the regular FlexLoRA. We show in Table 14 below that incorporating the step of \"uploading LoRA weights\" does not lead to better performance. This suggests that observations and improvements seen in centralized dynamic LoRA methods may not translate directly to federated learning due to the unique challenges posed by heterogeneity in FL, which underlines the importance of tailored solutions like FlexLoRA for effectively managing heterogeneity in FL environments. ", "page_idx": 19}, {"type": "table", "img_path": "gkOzoHBXUw/tmp/b6d261ffecf6820459c1fc4b8ede872458f021147bacc0077239145bff53620f.jpg", "table_caption": ["Table 14: Results with/without incorporating ReLoRA into either regular FedAvg or FlexLoRA. "], "table_footnote": [], "page_idx": 19}, {"type": "text", "text": "L Computational Resources and Infrastructure Report ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "In our study, we employ the LLaMA-1.3B from Data-Juicer 2 as the foundational architecture for our FlexLoRA framework, which consists of approximately 1.35 billion parameters. During our experiments, the DataJuicer-1.3B model itself is kept frozen, and the tunable parameter size for each client within our federated learning framework are determined by the size of the LoRA module, with specific configurations detailed in Table 1. Our experiments are conducted on a cluster equipped with 16 NVIDIA A100 GPUs, each with 40GB or 80GB of memory. The total GPU hours for running all the experiments is approximately 1200 GPU hours. All the experiments are implemented using PyTorch package with version 2.1.0 and Huggingface’s Transformers package with version 4.31.0. ", "page_idx": 20}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 21}, {"type": "text", "text": "Justification: The claims in the abstract and introduction are supported by both theoretical and empirical results in the paper. ", "page_idx": 21}, {"type": "text", "text": "Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 21}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Justification: In the Conclusion section, the paper mentions limitation and future work. Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 21}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 21}, {"type": "text", "text": "Justification: The paper provides full set of assumptions and complete proof. Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 22}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 22}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Justification: The paper has disclosed all information needed to reproduce the main experimental results. ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 22}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 22}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: We have released the code and data used in our paper. Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/pu blic/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 23}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: Implementation details can be founded in both Section 4 and Appendix E.1. Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 23}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: The error bars are shown in the tables of main results, and significance analysis is in Appendix F. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 23}, {"type": "text", "text": "", "page_idx": 24}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 24}, {"type": "text", "text": "Justification: The information is in Appendix L. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 24}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 24}, {"type": "text", "text": "Justification: The research conducted in the paper conforms with the NeurIPS Code of Ethics. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 24}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 24}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 24}, {"type": "text", "text": "Justification: This paper focuses more on proposing a new techniques in Federated Learning setting and does not bring societal impacts or concerns. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed.   \n• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 24}, {"type": "text", "text": "", "page_idx": 25}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 25}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 25}, {"type": "text", "text": "Justification: We have not found such risks in this paper. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 25}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "Justification: The authors properly credit the assets used in the paper. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided. ", "page_idx": 25}, {"type": "text", "text": "• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 26}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 26}, {"type": "text", "text": "Justification: We create an anonymous code repository where pertinent details of code are stored. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 26}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 26}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 26}, {"type": "text", "text": "Justification: N/A ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 26}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 26}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 26}, {"type": "text", "text": "Justification: N/A ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 26}]