{"importance": "This paper is crucial because it addresses the critical issue of **efficiency and responsibility** in using large language models (LLMs) for planning.  It challenges the current trend of computationally expensive and incomplete LLM-based planning methods, offering a novel approach that prioritizes **soundness, completeness, and efficiency**. This work is important for researchers seeking to develop more responsible and effective LLM-based applications.", "summary": "This paper introduces \"Thought of Search,\" a novel, efficient planning approach using LLMs that prioritizes soundness and completeness. It leverages LLMs to generate Python code for search components, enabling accurate and efficient problem-solving while significantly reducing LLM calls.", "takeaways": ["The current trend of using LLMs for planning often sacrifices soundness and completeness for efficiency.", "The proposed \"Thought of Search\" method uses LLMs to generate efficient Python code for search components, significantly improving accuracy and reducing compute cost.", "The new method achieves 100% accuracy on various datasets using significantly fewer LLM calls than existing methods."], "tldr": "Many recent methods use LLMs for planning, but they often ignore crucial properties like soundness and completeness, leading to inefficient and inaccurate results. These methods often rely on numerous LLM calls, which is expensive and environmentally unfriendly. \nThis paper proposes a more efficient and responsible approach called \"Thought of Search.\" Instead of directly using LLMs for every search step, it leverages LLMs to generate Python code for core search components (successor generation and goal test).  This approach dramatically reduces the number of LLM calls while maintaining both soundness and completeness, resulting in significantly higher accuracy and efficiency across several search problems.", "affiliation": "IBM Research", "categories": {"main_category": "Natural Language Processing", "sub_category": "Large Language Models"}, "podcast_path": "lNCsyA5uS1/podcast.wav"}