[{"figure_path": "5k9XeHIK3L/tables/tables_7_1.jpg", "caption": "Table 1: Quantitative evaluation between DeepCAD [56] and our method (AL is Adaptive Layer). The scores are evaluated only for Expert Level (L3) prompts. The results include F1 scores for primitives and extrusions as well as mean and median CD and IR. CD is multiplied by 10<sup>3</sup>.", "description": "This table presents a quantitative comparison of the performance of the proposed Text2CAD model against the DeepCAD baseline.  The evaluation metrics used are F1 scores for primitives (lines, arcs, circles) and extrusions, median and mean Chamfer Distance (CD), and Invalidity Ratio (IR).  Importantly, the results shown are only for the expert-level prompts (L3), reflecting the most detailed and parametrically rich descriptions.", "section": "5 Experiment"}, {"figure_path": "5k9XeHIK3L/tables/tables_8_1.jpg", "caption": "Table 1: Quantitative evaluation between DeepCAD [56] and our method (AL is Adaptive Layer). The scores are evaluated only for Expert Level (L3) prompts. The results include F1 scores for primitives and extrusions as well as mean and median CD and IR. CD is multiplied by 10<sup>3</sup>.", "description": "This table presents a quantitative comparison of the performance of the proposed Text2CAD model and the baseline DeepCAD model.  The evaluation focuses on expert-level prompts (L3) and uses several metrics: F1 scores for primitives (line, arc, circle) and extrusions, mean and median Chamfer Distance (CD), and Invalidity Ratio (IR).  Lower CD and IR values indicate better performance.  The table highlights the superior performance of Text2CAD compared to DeepCAD across all metrics.", "section": "5 Experiment"}, {"figure_path": "5k9XeHIK3L/tables/tables_14_1.jpg", "caption": "Table 1: Quantitative evaluation between DeepCAD [56] and our method (AL is Adaptive Layer). The scores are evaluated only for Expert Level (L3) prompts. The results include F1 scores for primitives and extrusions as well as mean and median CD and IR. CD is multiplied by 103.", "description": "This table presents a quantitative comparison of the performance of the proposed Text2CAD model against the DeepCAD baseline model.  The evaluation metrics used are F1 scores (for primitives and extrusions), Chamfer Distance (CD), and Invalidity Ratio (IR), focusing solely on Expert Level (L3) prompts, which are the most detailed and complex prompts in the dataset. Lower CD and IR values indicate better performance.", "section": "5 Experiment"}]