[{"figure_path": "xW6ga9i4eA/figures/figures_1_1.jpg", "caption": "Figure 1: Lack of controllability demonstration using pFedHR [23] on the SVHN dataset with seven different client models by comparing the original model size (blue bars) to the generated personalized client model size (entire bars).", "description": "This figure demonstrates the lack of control over personalized model generation in the existing pFedHR approach.  It shows a comparison of the original model size (blue bars) versus the size of the personalized models generated by pFedHR (entire bars) across seven different client models on the SVHN dataset. The red portion of each bar represents the increase in model size from the original to the personalized model.  This illustrates that the personalized models generated are substantially larger than the original models, highlighting a key limitation of the existing approach.", "section": "1 Introduction"}, {"figure_path": "xW6ga9i4eA/figures/figures_2_1.jpg", "caption": "Figure 2: Overview of the proposed pFedClub. We take four clients with heterogeneous models as an example. The numbers denote the blocks' indexes. The number of functional groups is 4. We take Client 1 as an example to demonstrate how pFedClub works to generate personalized candidate models. Note that the arbitrary substitution for Block 1 of Client 1 is the second block from Client 4.", "description": "This figure illustrates the workflow of the pFedClub algorithm. It starts with four clients uploading their heterogeneous models to the server. The server decomposes these models into blocks, groups similar blocks based on functionality, and then uses the CMSR algorithm to generate personalized candidate models for each client by substituting blocks from the same functional group.  The process involves three steps: anchor block selection, order-constrained block search, and block completion. Finally, similarity-based model matching selects the optimal personalized model for each client, which is then used as a teacher model to guide the client's training process.", "section": "3.2 Server Update"}, {"figure_path": "xW6ga9i4eA/figures/figures_4_1.jpg", "caption": "Figure 2: Overview of the proposed pFedClub. We take four clients with heterogeneous models as an example. The numbers denote the blocks' indexes. The number of functional groups is 4. We take Client 1 as an example to demonstrate how pFedClub works to generate personalized candidate models. Note that the arbitrary substitution for Block 1 of Client 1 is the second block from Client 4.", "description": "This figure illustrates the workflow of the pFedClub algorithm.  It begins by receiving heterogeneous models from multiple clients. These models are decomposed into functional blocks, which are then grouped based on their functionality.  The CMSR algorithm then selects blocks from these groups to create personalized candidate models for each client.  A model matching technique chooses the optimal personalized model to guide the training process of each client model through knowledge distillation. The example in the figure shows how a personalized model is generated for Client 1 using blocks from other clients.", "section": "3.2 Server Update"}, {"figure_path": "xW6ga9i4eA/figures/figures_8_1.jpg", "caption": "Figure 3: Controllability analysis.", "description": "This figure demonstrates the controllability analysis of pFedHR, pFedClub, and pFedClub+ on the SVHN dataset under non-IID conditions.  (a) shows the accuracy achieved by each method. (b) displays the average model size change percentage over communication rounds for each client, showcasing the effectiveness of pFedClub and pFedClub+ in controlling the generated personalized model sizes.  pFedClub+ adds a model size constraint. ", "section": "4.4 Controllability Analysis"}, {"figure_path": "xW6ga9i4eA/figures/figures_9_1.jpg", "caption": "Figure 4: Server running time v.s. communication round.", "description": "This figure shows a comparison of server-side computational time between pFedClub and pFedHR across 100 communication rounds during the training process on the SVHN dataset under the non-IID setting with Model Zoo III and 50 clients.  It demonstrates that pFedClub generally exhibits lower and more stable computational times compared to pFedHR.", "section": "4.5 Computational Cost Comparison"}, {"figure_path": "xW6ga9i4eA/figures/figures_9_2.jpg", "caption": "Figure 5: The consumed running time (in seconds) of models to achieve the target accuracy.", "description": "This figure compares the time taken by pFedHR and pFedClub to reach different target accuracies (40%, 50%, 60%) on the SVHN and CIFAR-10 datasets under a non-IID setting.  It visually demonstrates that pFedClub achieves the target accuracy faster than pFedHR across all accuracy levels.  The percentage values on the bars represent the relative improvement of pFedClub's time compared to pFedHR for reaching the specified accuracy.", "section": "4.6 System Running Time v.s. Accuracy"}, {"figure_path": "xW6ga9i4eA/figures/figures_14_1.jpg", "caption": "Figure 6: Model size controllability compared with pFedHR with respect to the communication round.", "description": "This figure compares the model size controllability of pFedClub and pFedHR across different communication rounds for various client models (CNN1-CNN4, MobileNetV1-MobileNetV3).  Each subplot shows the relative change in model size for a specific client model, plotted against communication round number.  The blue line represents pFedHR, while the red line represents pFedClub.  The y-axis represents the percentage change in model size. This visualization helps to demonstrate the effectiveness of pFedClub in controlling the size of the generated personalized models, keeping them closer to the original model size compared to pFedHR.", "section": "4.4 Controllability Analysis"}]