[{"figure_path": "jzngdJQ2lY/tables/tables_20_1.jpg", "caption": "Table 1: Hyperparameter Settings for On-policy Algorithms", "description": "This table lists the hyperparameter settings used for the on-policy reinforcement learning algorithms in the paper.  It includes parameters for the network architecture, optimization, and algorithm-specific settings such as the GAE lambda parameter and clip ratio for PPO, and the Lagrangian multiplier learning rate for RESPO.", "section": "F Implementation Details of Algorithms"}, {"figure_path": "jzngdJQ2lY/tables/tables_20_2.jpg", "caption": "Table 2: Hyperparameter Settings for Off-policy Algorithms", "description": "This table lists the hyperparameters used for the off-policy reinforcement learning algorithms in the paper's experiments.  It includes settings for network architecture, hidden layers, activation functions, optimizer, discount factor, learning rates, entropy target, replay buffer and batch size, training interval, and target smoothing term.", "section": "F Implementation Details of Algorithms"}, {"figure_path": "jzngdJQ2lY/tables/tables_24_1.jpg", "caption": "Table 3: Reach rate of final converged policies with different levels of noise to the output control", "description": "This table presents the reach rate of different reinforcement learning algorithms under varying levels of noise added to the output control.  The algorithms compared include RC-PPO, RESPO, PPO with different hyperparameters (βL and βH), SAC with different hyperparameters (βL and βH), CPPO with different thresholds (XL, XM, and XH), and CRL. The noise levels are categorized as \"Small Noise\" and \"Large Noise.\"  The table shows the robustness of each algorithm to noise in achieving the goal.", "section": "5 Experiments"}, {"figure_path": "jzngdJQ2lY/tables/tables_24_2.jpg", "caption": "Table 4: Additional cumulative cost of final converged policies with different levels of noise to the output control", "description": "This table shows the additional cumulative cost of different reinforcement learning algorithms when different levels of noise are added to the output control.  The algorithms are compared across three noise levels: No noise, small noise, and large noise.", "section": "H.4 Robustness to Noise"}]