[{"figure_path": "8aA3DHLK5h/figures/figures_4_1.jpg", "caption": "Figure 1: RM⁺ in R², with gt = g(xt, lt).", "description": "This figure illustrates the dynamics of the Regret Matching+ (RM+) algorithm in two dimensions (R²).  It shows how the regret vector Rt is updated iteratively. The vector gt represents the instantaneous loss at iteration t, which is projected onto the simplex (∆²) to obtain the next strategy xt. The algorithm maintains a running sum of regrets (Rt), and the strategy xt at each step is obtained by normalizing this sum.  The stepsize η is implicitly present in the update rule; the algorithm is stepsize invariant because only the direction, and not the magnitude, of Rt matters for determining xt.", "section": "Treeplex Blackwell approachability"}, {"figure_path": "8aA3DHLK5h/figures/figures_7_1.jpg", "caption": "Figure 2: Convergence to a Nash equilibrium for PTB+, CFR⁺, PCFR⁺ and SC-POMD. All algorithms use alternation and quadratic averaging except CFR+ instantiated with linear averaging.", "description": "This figure compares the convergence speed of four different algorithms (PTB+, CFR+, PCFR+, and SC-POMD) for solving extensive-form games.  The x-axis represents the number of iterations, and the y-axis shows the duality gap, which measures the distance from a Nash equilibrium.  The figure shows that PCFR+ generally outperforms the other algorithms, suggesting that its infoset stepsize invariance is an important property.  All algorithms use alternation and quadratic averaging, except CFR+, which uses linear averaging.", "section": "Numerical experiments"}, {"figure_path": "8aA3DHLK5h/figures/figures_8_1.jpg", "caption": "Figure 2: Convergence to a Nash equilibrium for PTB+, CFR+, PCFR+ and SC-POMD. All algorithms use alternation and quadratic averaging except CFR+ instantiated with linear averaging.", "description": "This figure compares the convergence of four different algorithms (PTB+, CFR+, PCFR+, and SC-POMD) to a Nash equilibrium in several benchmark extensive-form games.  The y-axis represents the duality gap, a measure of how far the algorithms are from a solution. The x-axis shows the number of iterations.  Note that CFR+ uses linear averaging, unlike the others which utilize quadratic averaging. The figure shows how PTB+ converges relatively quickly compared to CFR+, with PCFR+ and SC-POMD showing intermediate convergence speeds.", "section": "Numerical experiments"}, {"figure_path": "8aA3DHLK5h/figures/figures_23_1.jpg", "caption": "Figure 4: Convergence to Nash equilibrium as a function of number of iterations for TB+ with quadratic averaging, PTB+ with quadratic averaging and last iterate, and Smooth PTB+ with quadratic averaging and last iterate. Every algorithm is using alternation.", "description": "This figure compares the performance of three different algorithms (TB+, PTB+, and Smooth PTB+) for solving extensive-form games.  Each algorithm uses a different approach to regret minimization, and the figure shows how quickly they converge to a Nash equilibrium (a stable state in a game). The x-axis represents the number of iterations, while the y-axis shows the duality gap, which measures how far the algorithm is from the equilibrium.  The graph displays results for five different benchmark games (Kuhn, Leduc, Liar's Dice, Goofspiel, and Battleship).  The results suggest that PTB+ and Smooth PTB+ generally perform better than TB+, indicating the benefit of predictive methods and smoothing techniques in achieving faster convergence to the Nash equilibrium. The choice between quadratic averaging and last iterate methods depends on the game being considered.", "section": "Numerical experiments"}, {"figure_path": "8aA3DHLK5h/figures/figures_23_2.jpg", "caption": "Figure 4: Convergence to Nash equilibrium as a function of number of iterations for TB+ with quadratic averaging, PTB+ with quadratic averaging and last iterate, and Smooth PTB+ with quadratic averaging and last iterate. Every algorithm is using alternation.", "description": "This figure compares the performance of three different Blackwell approachability-based algorithms for solving extensive-form games.  The algorithms are Treeplex Blackwell+ (TB+), Predictive Treeplex Blackwell+ (PTB+), and Smooth PTB+.  The x-axis represents the number of iterations, and the y-axis represents the duality gap, which measures how far the average strategies are from a Nash equilibrium. The figure shows that PTB+ and Smooth PTB+ generally outperform TB+, and that using the last iterate (rather than averaging over all iterates) can improve performance in some cases. The algorithms all use alternation in the self-play framework.", "section": "Numerical experiments"}, {"figure_path": "8aA3DHLK5h/figures/figures_24_1.jpg", "caption": "Figure 4: Convergence to Nash equilibrium as a function of number of iterations for TB+ with quadratic averaging, PTB+ with quadratic averaging and last iterate, and Smooth PTB+ with quadratic averaging and last iterate. Every algorithm is using alternation.", "description": "This figure compares the performance of three different algorithms: TB+, PTB+, and Smooth PTB+, all using quadratic averaging and the last iterate, and all using alternation.  The x-axis represents the number of iterations, and the y-axis represents the duality gap, a measure of how close the algorithms are to finding a Nash equilibrium. The graph shows how the duality gap decreases over iterations for each algorithm, allowing for a comparison of their convergence rates.  The results indicate that PTB+ and Smooth PTB+ generally outperform TB+.", "section": "Numerical Experiments"}, {"figure_path": "8aA3DHLK5h/figures/figures_24_2.jpg", "caption": "Figure 4: Convergence to Nash equilibrium as a function of number of iterations for TB+ with quadratic averaging, PTB+ with quadratic averaging and last iterate, and Smooth PTB+ with quadratic averaging and last iterate. Every algorithm is using alternation.", "description": "This figure compares the performance of three different algorithms (TB+, PTB+, and Smooth PTB+) in solving extensive-form games.  Each algorithm uses a different approach to Blackwell approachability on treeplexes, and they differ in whether they are stepsize invariant and what convergence rate they achieve. The graph displays the duality gap (a measure of how far the algorithm is from reaching Nash Equilibrium) over the number of iterations.  The results show that PTB+ and Smooth PTB+ perform similarly and generally outperform TB+.", "section": "Numerical Experiments"}, {"figure_path": "8aA3DHLK5h/figures/figures_24_3.jpg", "caption": "Figure 4: Convergence to Nash equilibrium as a function of number of iterations for TB+ with quadratic averaging, PTB+ with quadratic averaging and last iterate, and Smooth PTB+ with quadratic averaging and last iterate. Every algorithm is using alternation.", "description": "This figure compares the performance of three different Blackwell approachability-based algorithms for solving extensive-form games: TB+, PTB+, and Smooth PTB+.  Each algorithm uses a different approach to regret minimization and step size management.  The plot shows how quickly the duality gap (a measure of how far from Nash equilibrium the algorithms are) decreases over time (iterations) for several benchmark games (Kuhn Poker, Leduc Poker, Liar's Dice, Goofspiel, and Battleship).  The results show the impact of different approaches on convergence speed and the importance of stepsize invariance in achieving good practical performance.", "section": "Numerical experiments"}, {"figure_path": "8aA3DHLK5h/figures/figures_24_4.jpg", "caption": "Figure 4: Convergence to Nash equilibrium as a function of number of iterations for TB+ with quadratic averaging, PTB+ with quadratic averaging and last iterate, and Smooth PTB+ with quadratic averaging and last iterate. Every algorithm is using alternation.", "description": "This figure compares the performance of three different algorithms: TB+, PTB+, and Smooth PTB+. Each algorithm is tested with quadratic averaging and the last iterate, and all use alternation.  The plot shows the duality gap (a measure of how far from a Nash Equilibrium the algorithms are) versus the number of iterations for five different games. The goal is to show how the different algorithms perform in practice relative to their theoretical convergence rates and stepsize properties.", "section": "Numerical experiments"}, {"figure_path": "8aA3DHLK5h/figures/figures_24_5.jpg", "caption": "Figure 2: Convergence to a Nash equilibrium for PTB+, CFR+, PCFR+ and SC-POMD. All algorithms use alternation and quadratic averaging except CFR+ instantiated with linear averaging.", "description": "This figure compares the convergence performance of four different algorithms (PTB+, CFR+, PCFR+, and SC-POMD) for solving extensive-form games.  The y-axis represents the duality gap, a measure of how far the algorithm's current solution is from a Nash Equilibrium. The x-axis shows the number of iterations.  Each line represents a different algorithm, with variations in averaging schemes (linear vs. quadratic) indicated. The figure illustrates the relative convergence speed of each algorithm across different game instances (Kuhn, Leduc, Liar's Dice, Goofspiel, and Battleship).", "section": "5 Numerical Experiments"}, {"figure_path": "8aA3DHLK5h/figures/figures_25_1.jpg", "caption": "Figure 11: Convergence to Nash equilibrium as a function of number of iterations using uniform, linear, and quadratic averaging, as well as the last iterate, with and without alternation for PCFR+. ", "description": "This figure compares the convergence of PCFR+ (Predictive Counterfactual Regret Minimization+) to Nash equilibrium in various games (Kuhn Poker, Leduc Poker, Liar's Dice, Goofspiel, and Battleship).  Different averaging schemes (uniform, linear, quadratic) and the last iterate are compared. Alternation, a technique to improve the convergence of the algorithm, is also examined both with and without its use. The y-axis shows the duality gap, a measure of how far from equilibrium the strategies are.  The x-axis represents the number of iterations.", "section": "5 Numerical Experiments"}, {"figure_path": "8aA3DHLK5h/figures/figures_25_2.jpg", "caption": "Figure 2: Convergence to a Nash equilibrium for PTB+, CFR⁺, PCFR⁺ and SC-POMD. All algorithms use alternation and quadratic averaging except CFR+ instantiated with linear averaging.", "description": "The figure shows the convergence to Nash Equilibrium for four different algorithms: PTB+, CFR+, PCFR+, and SC-POMD, across five different benchmark extensive-form games (EFGs).  Each line represents a different algorithm, showing the duality gap over the number of iterations.  The algorithms are compared using both alternation and quadratic averaging, except CFR+, which uses linear averaging.  The graph helps illustrate the relative performance of different algorithms in solving EFGs.", "section": "Numerical experiments"}]