[{"figure_path": "r6V7EjANUK/figures/figures_0_1.jpg", "caption": "Figure 1: Conceptual Illustration of GSDF. Rendering and reconstruction tasks have traditionally involved trade-offs in neural representation methods. While 3D-GS achieves high-fidelity view-dependent rendering, it often compromises on geometric accuracy. Recent approaches [13, 10] use explicit regularization to align Gaussian primitives near surfaces, but this can reduce model capacity for high-fidelity visuals. Our GSDF introduces a dual-branch framework with specialized GS- and SDF-branches for rendering and geometry tasks. We propose three mutual guidances (detailed in Sec. 3.2) to enhance the quality of both tasks.", "description": "This figure illustrates the core idea of the GSDF method.  It compares three approaches to 3D scene representation: 3DGS, a method using explicit regularization, and the proposed GSDF method.  3DGS excels at rendering but lacks geometric accuracy. Explicit regularization improves geometric accuracy but compromises rendering quality.  GSDF, a dual-branch network combining 3DGS and SDF, aims to address these trade-offs by using three mutual guidances to improve both rendering and reconstruction. The figure uses a diagram of Gaussian primitives to show how each method represents a simple circular scene and highlights the strengths and weaknesses of each approach.", "section": "Abstract"}, {"figure_path": "r6V7EjANUK/figures/figures_2_1.jpg", "caption": "Figure 2: Overview of Dual-branch Guidance. Our dual-branch framework includes a GS-branch for rendering and an SDF-branch for learning neural surfaces. This design preserves the efficiency and fidelity of Gaussian primitive for rendering [17, 21] while accurately approximating scene surfaces from an SDF field adapted from NeuS [31]. Specifically: (1) The GS-branch renders depth maps to guide SDF-branch ray sampling, querying absolute SDF values |s| and sampling points within 2k|s| (e.g., k = 4). (2) Predicted SDF values guide GS-branch density control, growing Gaussians near surfaces and pruning deviated ones. (3) Mutual geometry consistency is enforced by comparing depth and normal maps from both branches, ensuring coherent alignment between Gaussians and surfaces.", "description": "This figure illustrates the dual-branch guidance framework of GSDF. It shows how the GS-branch (for rendering) and the SDF-branch (for surface reconstruction) interact through three mutual guidance mechanisms: depth-guided ray sampling, geometry-aware density control, and mutual geometry supervision.  These mechanisms improve the accuracy and efficiency of both rendering and reconstruction.", "section": "3 Method"}, {"figure_path": "r6V7EjANUK/figures/figures_6_1.jpg", "caption": "Figure 3: Qualitative comparisons of GSDF against popular Gaussian-based baselines [17, 21, 13] across diverse 3D scene datasets [18, 3, 12]. As highlighted, GSDF excels in modeling delicate geometries (1st & 2nd rows) and handling texture-less and sparsely observed regions (3rd & 4th rows), which are commonly presented in larger scenes where baseline approaches struggle to address.", "description": "This figure shows a qualitative comparison of GSDF against three other Gaussian-based neural rendering methods (2D-GS, 3D-GS, and Scaffold-GS) on various scenes. The comparison highlights GSDF's superior ability to model fine details and handle scenes with less texture or sparse observations, especially in larger scenes where other methods struggle.", "section": "4.2 Results Analysis"}, {"figure_path": "r6V7EjANUK/figures/figures_7_1.jpg", "caption": "Figure 4: Reconstruction Comparison. We visualize the reconstructed meshes from Instant-NSR [11] (our SDF-branch), SuGaR [10], 2D-GS [13], and Ours.", "description": "This figure compares the 3D reconstruction results of four different methods: Instant-NSR, SuGaR, 2D-GS, and the authors' proposed GSDF method.  Each row shows the reconstruction of a different scene. The figure visually demonstrates that GSDF produces more complete and detailed meshes compared to the other methods, particularly in capturing fine details and preventing holes or broken surfaces.  The differences highlight the effectiveness of GSDF in accurately reconstructing complex 3D shapes.", "section": "4.2.2 Reconstruction Comparisons"}, {"figure_path": "r6V7EjANUK/figures/figures_8_1.jpg", "caption": "Figure 5: Ablation results. Visualizations of reconstructed meshes and rendered images from 1) our full method, 2) ours w/o depth-guided ray sampling, 3) ours w/o geometry-aware density control, and 4) ours w/o geometric supervision. We highlight the degradation of quality using numbered patches.", "description": "This figure presents an ablation study to show the effectiveness of each component of the GSDF model.  The top row displays the reconstructed surfaces from four different versions of the model: the complete GSDF model and three variations where one component is removed. The bottom row shows rendered images corresponding to each reconstruction. Numbered boxes highlight specific areas where the removal of a component leads to noticeable degradation in reconstruction or rendering quality. The components tested are depth-guided ray sampling, geometry-aware density control, and mutual geometric supervision.", "section": "4.3 Ablation Studies"}, {"figure_path": "r6V7EjANUK/figures/figures_14_1.jpg", "caption": "Figure 4: Reconstruction Comparison. We visualize the reconstructed meshes from Instant-NSR [11] (our SDF-branch), SuGaR [10], 2D-GS [13], and Ours.", "description": "This figure compares the 3D reconstruction results of four different methods: Instant-NSR, SuGaR, 2D-GS, and the authors' proposed GSDF method.  The results are shown for three different scenes, visualizing the meshes generated by each method for each scene.  The comparison highlights the GSDF method's ability to reconstruct more accurate and detailed meshes compared to the other methods.", "section": "4.2.2 Reconstruction Comparisons"}, {"figure_path": "r6V7EjANUK/figures/figures_15_1.jpg", "caption": "Figure 7: Rendering Comparison with random initialization (Part 1). We compare rendering results between Scaffold-GS [21] and our method. The highlighted patches indicate that our method is superior in expressing finer details in both geometry and appearance.", "description": "This figure compares the rendering results of three methods: GT (ground truth), Scaffold-GS (with random initialization), and GSDF (with random initialization). The comparison highlights GSDF's superior performance in capturing fine details in both geometry and appearance.  Specific areas are highlighted using colored boxes to show improvements in detail and accuracy.  This demonstrates the effectiveness of the GSDF approach compared to a baseline Gaussian Splatting method. ", "section": "4.2.1 Rendering Comparisons"}, {"figure_path": "r6V7EjANUK/figures/figures_16_1.jpg", "caption": "Figure 7: Rendering Comparison with random initialization (Part 1). We compare rendering results between Scaffold-GS [21] and our method. The highlighted patches indicate that our method is superior in expressing finer details in both geometry and appearance.", "description": "This figure shows a comparison of rendering results between Scaffold-GS and the proposed GSDF method, both using randomly initialized Gaussian primitives. The comparison highlights the superior ability of GSDF in capturing finer details in both geometry and appearance, as evidenced by the highlighted regions showing improved detail and accuracy in GSDF's renderings.", "section": "4.2.1 Rendering Comparisons"}]