[{"figure_path": "INAeUQ04lT/tables/tables_2_1.jpg", "caption": "Table 1: Comparison of related methods with its forecasting capability. The character \".\" in the Transformers denotes the name of *former. The character indicates that the model can be applied to multivariate forecasting scenarios but not explicitly model the cross-variate dependency.", "description": "This table compares various time series forecasting methods based on their capabilities in handling univariate and multivariate time series, and whether they explicitly model exogenous variables.  The table uses checkmarks to indicate capabilities and a \"◇\" to show methods that handle multivariate data but don't directly model cross-variate dependencies.  The table helps to position TimeXer within the existing landscape of forecasting methods.", "section": "2 Related Work"}, {"figure_path": "INAeUQ04lT/tables/tables_6_1.jpg", "caption": "Table 2: Full results of the short-term forecasting task on EPF dataset. We follow the standard protocol in short-term electricity price forecasting, where the input length and predict length are set to 168 and 24 respectively for all baselines. Avg means the average results from all five datasets.", "description": "This table presents a comprehensive comparison of the model's performance (measured by MSE and MAE) on five different short-term electricity price forecasting datasets.  The results are compared against nine state-of-the-art baseline models, highlighting TimeXer's superior performance and consistency across various datasets.  The standard protocol for short-term forecasting (input length=168, prediction length=24) is used for all models.", "section": "4.1 Main Results"}, {"figure_path": "INAeUQ04lT/tables/tables_6_2.jpg", "caption": "Table 1: Comparison of related methods with its forecasting capability. The character \".\" in the Transformers denotes the name of *former. The character indicates that the model can be applied to multivariate forecasting scenarios but not explicitly model the cross-variate dependency.", "description": "This table compares various time series forecasting models based on their capabilities, specifically focusing on whether they handle univariate or multivariate time series and if they explicitly model the cross-variate dependencies.  The table uses a shorthand notation to represent the model's capabilities, indicating whether they support univariate forecasting, multivariate forecasting, and forecasting with exogenous variables.", "section": "2 Related Work"}, {"figure_path": "INAeUQ04lT/tables/tables_7_1.jpg", "caption": "Table 4: Ablation Results. Ex. and En. are abbreviations for Exogenous variable and Endogenous variable. P, G and V denote patch token, learnable global token, and variate token respectively.", "description": "This table presents the ablation study results on the short-term electricity price forecasting task using the EPF dataset.  It shows the impact of different design choices on the model's performance, specifically focusing on the components of the endogenous and exogenous variable embeddings and the cross-attention mechanism.  The rows represent different configurations, including removing or replacing certain components or using concatenation methods.  The columns represent the performance metrics for various datasets (NP, PJM, BE, FR, DE), including Mean Squared Error (MSE) and Mean Absolute Error (MAE).  The results highlight the contribution of each design element in the TimeXer model.", "section": "4.2 Ablation Study"}, {"figure_path": "INAeUQ04lT/tables/tables_8_1.jpg", "caption": "Table 5: Model performance under missing values. Zeros and Random represent the cases that the corresponding series is set as zeros or random values respectively.", "description": "This table presents the results of an ablation study evaluating TimeXer's robustness to missing data in exogenous variables. Two strategies were used to simulate missing data: filling the missing values with zeros or with random numbers. The table shows the Mean Squared Error (MSE) and Mean Absolute Error (MAE) for each dataset (NP, PJM, BE, FR, DE) and the average across all datasets (AVG) for each strategy applied to endogenous and exogenous variables. It demonstrates the impact of missing data on forecasting accuracy. The model performs best when all the data is complete, indicating that accurate information is important for proper predictions.", "section": "4.3 TimeXer Generality"}, {"figure_path": "INAeUQ04lT/tables/tables_13_1.jpg", "caption": "Table 6: Dataset descriptions. Ex. and En. are abbreviations for the Exogenous variable and Endogenous variable, respectively. The dataset size is organized in (Train, Validation, Test)", "description": "This table lists the characteristics of the seven datasets used in the paper's experiments. For each dataset, it provides the name, number of exogenous and endogenous variables, sampling frequency, and the size of the training, validation, and test sets.", "section": "A.1 Dataset Descriptions"}, {"figure_path": "INAeUQ04lT/tables/tables_14_1.jpg", "caption": "Table 7: Model performance with overlapped patches.", "description": "This table presents the performance comparison between TimeXer and TimeXer-overlap on five electricity price forecasting datasets. TimeXer-overlap uses overlapped patches, while TimeXer uses non-overlapping patches. The metrics used are MSE (Mean Squared Error) and MAE (Mean Absolute Error) for each dataset, along with an average across all five datasets. The results show that TimeXer achieves slightly better results than TimeXer-overlap in terms of both MSE and MAE. This suggests that the non-overlapping patch approach is more effective in this specific task.", "section": "B Ablation Study"}, {"figure_path": "INAeUQ04lT/tables/tables_15_1.jpg", "caption": "Table 8: Ablation study on long-term forecast.", "description": "This table presents the ablation study results on long-term forecasting using different architectural designs of TimeXer.  It compares the performance (MSE and MAE) of TimeXer with variations in the endogenous and exogenous variable embeddings.  Specifically, it shows the effects of replacing, removing, adding, or concatenating the different types of tokens (patch, global, and variate) used in TimeXer's design. The results are evaluated across three datasets (ETTh1, ETTm1, Traffic) and four prediction horizons (96, 192, 336, 720).  This allows for a comparison of TimeXer's performance to various simpler designs, demonstrating the importance of the chosen design elements.", "section": "4.2 Ablation Study"}, {"figure_path": "INAeUQ04lT/tables/tables_21_1.jpg", "caption": "Table 9: More baselines in the short-term forecasting with exogenous variables task.", "description": "This table compares the performance of TimeXer against other state-of-the-art models on five different electricity price forecasting datasets.  The metrics used are Mean Squared Error (MSE) and Mean Absolute Error (MAE).  The results showcase TimeXer's consistent superior performance, outperforming existing models and demonstrating robustness across different datasets.", "section": "I.1 More Baselines in Short-term Forecasting"}, {"figure_path": "INAeUQ04lT/tables/tables_21_2.jpg", "caption": "Table 10: More baselines in the multivariate long-term forecasting. '-' denotes there is no officially reported results.", "description": "This table compares the performance of TimeXer against various state-of-the-art multivariate time series forecasting models on several benchmark datasets.  It shows TimeXer's MSE and MAE scores across different datasets and prediction horizons (96, 192, 336, 720).  The '-' indicates that a particular model did not provide results for a specific dataset and prediction length.", "section": "4.1 Main Results"}, {"figure_path": "INAeUQ04lT/tables/tables_22_1.jpg", "caption": "Table 11: Full results of the long-term forecasting with exogenous variables task. “-” denotes out of memory (OOM) problem.", "description": "This table presents the complete results of the long-term forecasting experiments conducted with exogenous variables.  It shows the Mean Squared Error (MSE) and Mean Absolute Error (MAE) for various models (TimeXer, iTransformer, RLinear, PatchTST, Crossformer, TIDE, TimesNet, DLinear, SCINet, Stationary, Autoformer) across different prediction horizons (96, 192, 336, 720) and datasets (ECL, Weather, ETTh1, ETTh2, ETTm1, ETTm2, Traffic). The '-' symbol indicates that the model ran out of memory during the experiment.", "section": "4.1 Main Results"}, {"figure_path": "INAeUQ04lT/tables/tables_23_1.jpg", "caption": "Table 11: Full results of the long-term forecasting with exogenous variables task. “-” denotes out of memory (OOM) problem.", "description": "This table presents a comprehensive comparison of TimeXer's performance against various state-of-the-art forecasting models on four long-term forecasting benchmarks with exogenous variables.  The results are organized by dataset (ECL, Weather, ETTh1, ETTh2, ETTm1, ETTm2, Traffic) and prediction horizon (96, 192, 336, 720).  Metrics include Mean Squared Error (MSE) and Mean Absolute Error (MAE).  The table highlights TimeXer's consistent superior performance across different datasets and prediction horizons, showcasing its effectiveness in handling long-term forecasting with exogenous variables.", "section": "4.1 Main Results"}]