[{"figure_path": "Dokew2u49m/tables/tables_5_1.jpg", "caption": "Table 1: Average accuracy (%) across all phases using 7 state-of-art methods (span all sorts of CL) w/ and w/o C-Flat plugged in. Maximum/Average Return in the last row represents the maximum/average boost of C-Flat towards all methods in each column.", "description": "This table presents the average accuracy of seven state-of-the-art continual learning (CL) methods across different benchmark datasets (CIFAR-100, ImageNet-100, and Tiny-ImageNet) and incremental learning scenarios.  The results are shown both with and without the proposed C-Flat method integrated. The \"Average Return\" and \"Maximum Return\" rows highlight the performance improvement gained by using C-Flat.  It demonstrates the consistent performance boost of C-Flat across various CL methods and datasets, showcasing its versatility and effectiveness.", "section": "4.2 Make Continual Learning Stronger"}, {"figure_path": "Dokew2u49m/tables/tables_7_1.jpg", "caption": "Table 2: Revisiting FS-DGPM series using C-Flat.", "description": "This table presents the results of applying C-Flat to the FS-DGPM series of continual learning methods.  It compares the performance of the original FS-DGPM methods (La-GPM, FS-GPM, DGPM, La-DGPM, and FS-DGPM) with the performance after incorporating the C-Flat optimization. The \"Oracle\" row shows the baseline performance, and the \"w/ C-Flat\" row shows the performance with C-Flat added. The \"Boost\" row indicates the improvement in performance achieved by using C-Flat, demonstrating that C-Flat consistently improves the performance of various continual learning approaches.", "section": "4.5 Revisiting Zeroth-order Flatness"}, {"figure_path": "Dokew2u49m/tables/tables_8_1.jpg", "caption": "Table 1: Average accuracy (%) across all phases using 7 state-of-art methods (span all sorts of CL) w/ and w/o C-Flat plugged in. Maximum/Average Return in the last row represents the maximum/average boost of C-Flat towards all methods in each column.", "description": "This table presents the average accuracy achieved by seven state-of-the-art continual learning (CL) methods across multiple benchmark datasets (CIFAR-100, ImageNet-100 Tiny-ImageNet) and different incremental learning scenarios (B0_Inc5, B0_Inc10, B0_Inc20, B50_Inc10, B50_Inc25, B0_Inc40).  The results are shown both with and without the proposed C-Flat optimization method.  The \"Maximum/Average Return\" rows indicate the maximum and average improvement in accuracy achieved by incorporating C-Flat into each method.", "section": "4.2 Make Continual Learning Stronger"}, {"figure_path": "Dokew2u49m/tables/tables_9_1.jpg", "caption": "Table 1: Average accuracy (%) across all phases using 7 state-of-art methods (span all sorts of CL) w/ and w/o C-Flat plugged in. Maximum/Average Return in the last row represents the maximum/average boost of C-Flat towards all methods in each column.", "description": "This table presents the average accuracy of seven state-of-the-art continual learning (CL) methods across three datasets (CIFAR-100, ImageNet-100, and Tiny-ImageNet) and various incremental settings.  It compares the performance of each method with and without the proposed C-Flat optimization.  The 'Maximum/Average Return' rows show the performance improvement achieved by incorporating C-Flat, indicating its effectiveness in boosting the performance of existing CL algorithms.", "section": "4.2 Make Continual Learning Stronger"}, {"figure_path": "Dokew2u49m/tables/tables_15_1.jpg", "caption": "Table 1: Average accuracy (%) across all phases using 7 state-of-art methods (span all sorts of CL) w/ and w/o C-Flat plugged in. Maximum/Average Return in the last row represents the maximum/average boost of C-Flat towards all methods in each column.", "description": "This table presents the average accuracy achieved by seven state-of-the-art continual learning (CL) methods across multiple benchmark datasets (CIFAR-100, ImageNet-100, Tiny-ImageNet).  The results are shown for both the original methods and the same methods with the proposed C-Flat optimization integrated. The 'Maximum/Average Return' rows indicate the improvement gained by adding C-Flat, highlighting the consistent performance boost across various CL approaches and datasets.", "section": "4.2 Make Continual Learning Stronger"}]