{"references": [{"fullname_first_author": "Krishnamurthy Dvijotham", "paper_title": "Enhancing the reliability and accuracy of AI-enabled diagnosis via complementarity-driven deferral to clinicians", "publication_date": "2023-07-01", "reason": "This paper is highly relevant to the topic of Selective Classification and its application in clinical diagnostics, which is a central theme of the target paper."}, {"fullname_first_author": "Christian Leibig", "paper_title": "Combining the strengths of radiologists and AI for breast cancer screening: a retrospective analysis", "publication_date": "2022-07-01", "reason": "This paper directly addresses the real-world application of machine learning in clinical settings, specifically focusing on the collaboration between AI and human experts, a key aspect discussed in the target paper."}, {"fullname_first_author": "Karin Dembrower", "paper_title": "Effect of artificial intelligence-based triaging of breast cancer screening mammograms on cancer detection and radiologist workload: a retrospective simulation study", "publication_date": "2020-09-01", "reason": "This study provides empirical evidence on the impact of AI-driven triaging in clinical workflows, offering insights into practical challenges and benefits of Selective Classification systems, which the target paper aims to improve."}, {"fullname_first_author": "Adam Yala", "paper_title": "A deep learning model to triage screening mammograms: a simulation study", "publication_date": "2019-01-01", "reason": "This paper explores the use of deep learning for the triage of medical images, which is directly related to the subject of selective classification and its applications in clinical diagnostics."}, {"fullname_first_author": "Yonatan Geifman", "paper_title": "Selective classification for deep neural networks", "publication_date": "2017-01-01", "reason": "This foundational paper introduces the concept of selective classification for deep neural networks and proposes evaluation metrics, providing a basis for the methodological advancements presented in the target paper."}]}