[{"figure_path": "1PmsSugB87/tables/tables_0_1.jpg", "caption": "Table 1: Impact of interaction interval", "description": "This table shows the impact of varying interaction time intervals on the ranking performance of two sequential recommendation models: BERT4Rec and E-NSDE.  The rows represent different consecutive user interactions, with the corresponding time interval (in seconds) shown. The ranking of the next interacted item by each model is shown in the final columns.  The results indicate that as the time interval increases, the ranking of the correct item by BERT4Rec degrades significantly, while the E-NSDE model shows more consistent performance.", "section": "1 Introduction"}, {"figure_path": "1PmsSugB87/tables/tables_1_1.jpg", "caption": "Table 2: Epistemic uncertainty and recommended movie genres for a random user considering sequential interaction intervals", "description": "This table compares the performance of the GRU-ODE and the proposed E-NSDE models in recommending movie genres for a single user.  It demonstrates how the epistemic uncertainty (a measure of model confidence) varies with the time interval between user interactions.  The table shows the ground-truth genres and the genres predicted by each model for four different interaction time intervals. The results highlight that E-NSDE handles uncertainty more effectively than GRU-ODE, especially when the interaction interval is large.", "section": "2 Epistemic uncertainty and recommender movie genres for a random user considering sequential interaction intervals"}, {"figure_path": "1PmsSugB87/tables/tables_1_2.jpg", "caption": "Table 3: Comparison of related recommendation models", "description": "This table compares the key functionalities of various recommendation models, including sequential models, NODE-based models, NSDE models, and the proposed E-NSDE model. It highlights the ability of each model to handle varied interaction time intervals and to quantify uncertainty in user preferences and interactions. The table shows that only the proposed E-NSDE model is capable of addressing all three aspects effectively.", "section": "1 Introduction"}, {"figure_path": "1PmsSugB87/tables/tables_7_1.jpg", "caption": "Table 4: Recommendation performance comparison", "description": "This table presents a comparison of the recommendation performance of the proposed E-NSDE model against several state-of-the-art baselines across four different datasets (MovieLens-100K, MovieLens-1M, Netflix, and Amazon Book).  The performance is evaluated using two metrics: Precision@5 (P@5) and Normalized Discounted Cumulative Gain@5 (nDCG@5). The table is organized to group the baselines into categories based on their approach (Dynamic MF, Graph, Sequential, and ODE) for easier comparison.  The results show the relative performance of each method on each dataset, highlighting the superior performance of the proposed E-NSDE model.", "section": "5 Experiments"}, {"figure_path": "1PmsSugB87/tables/tables_8_1.jpg", "caption": "Table 5: (a) Diverse recommendations by E-NSDE; (b) Ablation of key components", "description": "This table demonstrates the diversity of recommendations provided by the E-NSDE model and the impact of its key components (NSDE, EDL, and WBPR) on its performance.  Part (a) shows example movie recommendations from the E-NSDE model, highlighting how it suggests diverse genres even when the time gap between interactions is large. Part (b) shows an ablation study, systematically removing one component at a time to observe the effect on the Precision@5 and NDCG@5 metrics, demonstrating the importance of each component for the model's effectiveness.", "section": "5 Experiments"}, {"figure_path": "1PmsSugB87/tables/tables_9_1.jpg", "caption": "Table 7: Average P@5 and nDCG@5 for E-NSDE with different regularizer values", "description": "This table shows the performance of the E-NSDE model on the MovieLens 1M and Netflix datasets with different values for the evidential regularization parameter (λ).  It demonstrates the impact of this hyperparameter on the model's ability to balance between fitting the training data and controlling overfitting (uncertainty). The best performance is achieved with λ=0.001 in both datasets.", "section": "Experiments"}, {"figure_path": "1PmsSugB87/tables/tables_13_1.jpg", "caption": "Table 4: Recommendation performance comparison", "description": "This table presents a comparison of the recommendation performance of the proposed E-NSDE model against several state-of-the-art baselines across four real-world datasets (MovieLens-100K, MovieLens-1M, Netflix, and Amazon Book).  The performance is evaluated using two metrics: Precision@5 (P@5) and Normalized Discounted Cumulative Gain@5 (nDCG@5).  The table allows for a direct comparison of the effectiveness of the E-NSDE model in capturing user preferences and providing accurate recommendations, highlighting its advantages over existing methods.", "section": "5 Experiments"}, {"figure_path": "1PmsSugB87/tables/tables_15_1.jpg", "caption": "Table 4: Recommendation performance comparison", "description": "This table compares the performance of the proposed E-NSDE model against several state-of-the-art baselines across four different datasets (MovieLens-100K, MovieLens-1M, Netflix, and Amazon Book).  The performance is measured using two metrics: Precision@5 (P@5) and Normalized Discounted Cumulative Gain@5 (nDCG@5).  Higher values for both metrics indicate better performance.", "section": "5 Experiments"}, {"figure_path": "1PmsSugB87/tables/tables_15_2.jpg", "caption": "Table 4: Recommendation performance comparison", "description": "This table presents a comparison of the recommendation performance of the proposed E-NSDE model against several state-of-the-art baselines across four different datasets: MovieLens-100K, MovieLens-1M, Netflix, and Amazon Book.  The performance is evaluated using two metrics: Precision@5 (P@5) and Normalized Discounted Cumulative Gain@5 (nDCG@5).  The results show that E-NSDE outperforms other methods on all datasets, indicating its effectiveness in sequential recommendation.", "section": "5 Experiments"}, {"figure_path": "1PmsSugB87/tables/tables_16_1.jpg", "caption": "Table 10: Recommendation Performance on More Datasets", "description": "This table presents the performance comparison of three different models (BERT4Rec, GRU-ODE, and E-NSDE) on two additional datasets: BookCrossing and Yahoo Music.  The performance is evaluated using two metrics: Precision@5 (P@5) and Normalized Discounted Cumulative Gain@5 (nDCG@5).  The E-NSDE model consistently outperforms the other two models across both datasets and metrics, demonstrating its effectiveness in diverse recommendation scenarios.", "section": "5 Experiments"}]