{"references": [{"fullname_first_author": "David Silver", "paper_title": "A general reinforcement learning algorithm that masters chess, shogi, and Go through self-play", "publication_date": "2018-01-01", "reason": "This paper introduced AlphaZero, a groundbreaking reinforcement learning agent that achieved superhuman performance in Go, chess, and shogi, providing a foundation for many subsequent advancements in AI game playing, which is directly relevant to this research on Leela Chess Zero."}, {"fullname_first_author": "Johannes von Oswald", "paper_title": "Transformers learn in-context by gradient descent", "publication_date": "2023-01-01", "reason": "This paper contributes to the understanding of how transformers learn algorithms, directly addressing a key question regarding the internal mechanisms of neural networks, which is a main focus of the current research."}, {"fullname_first_author": "Ekin Akyürek", "paper_title": "What learning algorithm is in-context learning? investigations with linear models", "publication_date": "2023-01-01", "reason": "This research delves into the algorithms used by neural networks, directly relevant to the investigation of look-ahead strategies in chess-playing neural networks."}, {"fullname_first_author": "Jannik Brinkmann", "paper_title": "A mechanistic analysis of a transformer trained on a symbolic multi-step reasoning task", "publication_date": "2024-01-01", "reason": "This paper examines the mechanistic understanding of transformers, offering insights into the internal processes of neural networks which is crucial for interpreting the look-ahead capability in Leela Chess Zero."}, {"fullname_first_author": "Atticus Geiger", "paper_title": "Causal abstractions of neural networks", "publication_date": "2021-01-01", "reason": "This research focuses on causal analysis in neural networks, providing a framework for understanding the causal relationships between components of a neural network, directly applicable to determining the causal role of look-ahead in this paper."}]}