[{"figure_path": "aXNZG82IzV/tables/tables_6_1.jpg", "caption": "Table 1: Comparison of the effectiveness of camouflages across various object detection models. Values are AP@0.5 of the car.", "description": "This table presents a comparison of the effectiveness of different adversarial camouflage methods against various object detection models.  The effectiveness is measured using the Average Precision (AP) at an Intersection over Union (IoU) threshold of 0.5 (AP@0.5), a common metric in object detection.  The table shows the AP@0.5 scores for a car, comparing the performance of different camouflage techniques against six different object detectors: YOLOv3, YOLOF, Deformable DETR (DDTR), Dynamic R-CNN (DRCN), Sparse R-CNN (SRCN), and Faster R-CNN (FRRCN). The \"NORMAL\" and \"RANDOM\" rows provide baseline results.  The table highlights how well each camouflage method obscures the car from detection by various models.", "section": "4.2 Attack Performance Evaluation"}, {"figure_path": "aXNZG82IzV/tables/tables_7_1.jpg", "caption": "Table 2: AP@0.5 of the different methods in the physical world evaluation.", "description": "This table presents the Average Precision (AP) at an Intersection over Union (IoU) threshold of 0.5 for different object detection models evaluated in a physical world setting.  The models used are YOLOv3, YOLOX, SSD, CenterNet, and RetinaNet.  The table compares the performance of the proposed CNCA method against four baseline adversarial camouflage methods (DAS, FCA, DTA, ACTIVE) and a normal (uncamouflaged) vehicle.  The 'TOTAL' column shows the average AP@0.5 across all five detectors. Lower numbers indicate better performance of the camouflage in evading detection.", "section": "4.2 Attack Performance Evaluation"}, {"figure_path": "aXNZG82IzV/tables/tables_7_2.jpg", "caption": "Table 4: Subjective tests for the naturalness evaluation of our adversarial camouflage with other baselines. The naturalness score is scaled from 1(not natural at all) to 5(very natural). Besides reporting mean and standard deviations of each type of camouflage, we also conduct t-tests and report the t and p values to verify the differences in means scores are significant (p value less than 0.05). As shown in the results, our method's score is significantly higher than the previous four methods.", "description": "This table presents the results of a subjective human evaluation assessing the naturalness of different adversarial camouflage methods.  Human participants rated the naturalness of the camouflage on a scale of 1 to 5, with 5 being the most natural.  The table shows the mean and standard deviation of the ratings for each method, along with t-test results comparing CNCA to the baseline methods.  The results demonstrate that CNCA generates significantly more natural-looking camouflage than existing methods.", "section": "4.3.2 Naturalness Score by Subjective Evaluation"}, {"figure_path": "aXNZG82IzV/tables/tables_9_1.jpg", "caption": "Table 6: Naturalness test average score against attack performance using YOLOv3. The input text prompt is \"yellow black graffiti\".", "description": "This table presents the results of a subjective evaluation of the naturalness of adversarial camouflage generated with different norm thresholds, along with their corresponding attack performance (AP@0.5) against the YOLOv3 object detector.  The input text prompt used for all camouflage generation was \"yellow black graffiti\". The threshold value controls the strength of the adversarial features, influencing the trade-off between naturalness and attack performance. Lower thresholds generally lead to more natural-looking textures but lower attack success, while higher thresholds result in less natural but more effective camouflage.", "section": "4.3.4 Trade-off between Naturalness and Attack Performance"}]