[{"figure_path": "NkXuAOygXN/tables/tables_5_1.jpg", "caption": "Table 1: Quantitative performance comparison of different fusion strategies on visible-infrared datasets. The 'TTD' suffix and gray background indicates our method is applied to this baseline. The red and blue represent the best and second-best result respectively. The bold indicates the baseline w/ TTD performance better than that w/o TTD. We used to illustrate the amount of improvement our TTD method achieved compared to the baseline.", "description": "This table presents a quantitative comparison of various image fusion methods on two visible-infrared datasets (LLVIP and MSRS).  The performance is evaluated using seven metrics (EN, SD, AG, EI, SF, SCD, and CE).  The table includes both baseline methods and those enhanced with the proposed TTD (Test-Time Dynamic) approach.  The color-coding and bolding highlight the best and second-best performing methods and improvements achieved by adding the TTD.", "section": "4.2 Quantitative Comparisons"}, {"figure_path": "NkXuAOygXN/tables/tables_5_2.jpg", "caption": "Table 2: Quantitative comparison on MFI-WHU dataset in MFF task and MEFB dataset in MEF task.", "description": "This table presents a quantitative comparison of different image fusion methods on two datasets: MFI-WHU (Multi-Focus Image Fusion) and MEFB (Multi-Exposure Image Fusion).  For each dataset and method, several metrics are reported to evaluate the performance of the fusion process.  These metrics likely assess aspects like image quality, information preservation, and edge enhancement.  The table allows for a comparison of the proposed method against other state-of-the-art techniques across different fusion tasks.", "section": "4.2 Quantitative Comparisons"}, {"figure_path": "NkXuAOygXN/tables/tables_14_1.jpg", "caption": "Table 3: Quantitative comparison on MRI-CT dataset in medical image fusion task.", "description": "This table presents a quantitative comparison of different image fusion methods on the MRI-CT dataset.  The methods are evaluated across several metrics, including information theory metrics (EN, CE), image feature metrics (SD, AG, EI, SF), and structural similarity (SSIM).  The table shows the performance of various methods, both baseline methods and those combined with the proposed Test-Time Dynamic (TTD) image fusion approach.  The \"Improve\" rows highlight the performance differences between the baseline methods and their TTD-enhanced counterparts.", "section": "4.2 Quantitative Comparisons"}, {"figure_path": "NkXuAOygXN/tables/tables_14_2.jpg", "caption": "Table 1: Quantitative performance comparison of different fusion strategies on visible-infrared datasets. The 'TTD' suffix and gray background indicates our method is applied to this baseline. The red and blue represent the best and second-best result respectively. The bold indicates the baseline w/ TTD performance better than that w/o TTD. We used to illustrate the amount of improvement our TTD method achieved compared to the baseline.", "description": "This table presents a quantitative comparison of various image fusion methods' performance on two visible-infrared datasets (LLVIP and MSRS).  It compares the performance of several state-of-the-art methods with and without the proposed Test-Time Dynamic (TTD) fusion strategy.  Metrics used include entropy, standard deviation, average gradient, edge intensity, spatial frequency, sum of correlations of differences, and cross entropy. The table highlights the improvements achieved by incorporating the TTD method and indicates the best and second-best performing methods for each metric.", "section": "4.2 Quantitative Comparisons"}, {"figure_path": "NkXuAOygXN/tables/tables_16_1.jpg", "caption": "Table 4: Ablation study on different forms of fusion weights on LLVIP dataset.", "description": "This table presents the ablation study on different forms of fusion weights. The goal is to find the best way to combine information from different sources in image fusion. Four different methods were tested: a simple average (w = 0.5), softmax applied to the negative loss, softmax applied to the sigmoid of the negative loss, and softmax applied to the exponential of the negative loss. The results show that using softmax with the exponential of the negative loss performs the best, improving several metrics including  EN, SD, AG, EI, SF, and SSIM while reducing CE. This suggests that this method is most effective at combining information from different sources to generate a high-quality fused image.", "section": "4.2 Quantitative Comparisons"}, {"figure_path": "NkXuAOygXN/tables/tables_16_2.jpg", "caption": "Table 5: Ablation study on the normalization of the weights on LLVIP dataset.", "description": "This table presents an ablation study on the impact of different normalization methods on the fusion weights used in the LLVIP dataset.  It compares the performance of four weight normalization techniques: no normalization, proportional normalization, and softmax normalization (the authors' proposed method). The performance metrics used are EN, SD, AG, EI, SF, SSIM, and CE, all of which are image quality metrics. The results show that softmax normalization leads to the best performance, outperforming both no normalization and proportional normalization across all metrics.", "section": "4.2 Quantitative Comparisons"}, {"figure_path": "NkXuAOygXN/tables/tables_17_1.jpg", "caption": "Table 6: Quantitative comparison on MRI-PET dataset in medical image fusion task.", "description": "This table presents a quantitative comparison of different image fusion methods on the MRI-PET dataset.  The methods are evaluated across several metrics including entropy (EN), standard deviation (SD), average gradient (AG), edge intensity (EI), spatial frequency (SF), structural similarity (SSIM), and cross entropy (CE).  The table shows the performance of baseline methods, and the same methods enhanced with the proposed Test-Time Dynamic (TTD) image fusion paradigm.  The \"Improve\" row highlights the performance differences between baseline methods and their TTD-enhanced versions.", "section": "4.2 Quantitative Comparisons"}, {"figure_path": "NkXuAOygXN/tables/tables_17_2.jpg", "caption": "Table 3: Quantitative comparison on MRI-CT dataset in medical image fusion task.", "description": "This table presents a quantitative comparison of different image fusion methods on the MRI-CT dataset.  It shows the performance of various methods across several metrics including entropy (EN), standard deviation (SD), average gradient (AG), edge intensity (EI), spatial frequency (SF), structural similarity (SSIM), and cross-entropy (CE).  The results allow for a comparison of the methods' effectiveness in preserving details and improving the quality of the fused images.", "section": "4.2 Quantitative Comparisons"}, {"figure_path": "NkXuAOygXN/tables/tables_18_1.jpg", "caption": "Table 8: The effectiveness of TTD on baselines with varying performances.", "description": "This table presents an ablation study evaluating the effectiveness of the proposed Test-Time Dynamic (TTD) image fusion method on baselines with varying performance levels.  Different levels of random Gaussian noise were added to the pre-trained IFCNN model to simulate varying baseline performance. The table shows that the TTD method consistently improves the performance of the baseline model across various metrics (EN, SD, AG, EI, SF, SCD, and CE) even when the baseline model's performance is degraded by noise addition.  The improvements are presented as the difference (△) between the IFCNN+TTD and the baseline IFCNN.", "section": "C.4 The Effectiveness of TTD on Baselines with Varying Performances"}, {"figure_path": "NkXuAOygXN/tables/tables_18_2.jpg", "caption": "Table 1: Quantitative performance comparison of different fusion strategies on visible-infrared datasets. The 'TTD' suffix and gray background indicates our method is applied to this baseline. The red and blue represent the best and second-best result respectively. The bold indicates the baseline w/ TTD performance better than that w/o TTD. We used to illustrate the amount of improvement our TTD method achieved compared to the baseline.", "description": "This table presents a quantitative comparison of various image fusion methods on two visible-infrared datasets (LLVIP and MSRS).  It compares the performance of several state-of-the-art methods and shows how these methods perform when combined with the proposed Test-Time Dynamic (TTD) image fusion approach.  Metrics used for comparison include information theory measures (entropy, cross-entropy, sum of correlations of differences), image features (standard deviation, average gradient, edge intensity, spatial frequency), and structural similarity (SSIM). The table highlights the improvements achieved by adding TTD to the baseline methods, indicating the effectiveness of the proposed approach.", "section": "4.2 Quantitative Comparisons"}]