[{"figure_path": "Ur00BNk1v2/tables/tables_5_1.jpg", "caption": "Table 1: GenArtist utilized tool library, including the tool names and their skills. The main tools are from the generation tool library and the editing tool library. The following models represent all the tools used in our current version, while new models can be seamlessly added.", "description": "This table lists the various tools integrated into the GenArtist system, categorized into generation and editing tools.  Each tool is specified by its skill (e.g., text-to-image, object addition) and the specific model used to implement that skill (e.g., SDXL, LaMa). The table shows the breadth of functionalities covered by GenArtist, emphasizing its capacity for diverse image generation and manipulation tasks.", "section": "3.2 Tool Library"}, {"figure_path": "Ur00BNk1v2/tables/tables_6_1.jpg", "caption": "Table 2: Quantitative Comparison on T2I-CompBench with existing text-to-image generation models and compositional methods. Our method demonstrates superior compositional generation ability in both attribute binding, object relationships, and complex compositions. We use the officially updated code for evaluation, which updates the noun phrase number. Consequently, some metric values for certain methods may be lower than those reported in their original papers.", "description": "This table presents a quantitative comparison of GenArtist with other state-of-the-art text-to-image generation models on the T2I-CompBench benchmark.  It evaluates performance across three key aspects: Attribute Binding (how well the model associates attributes like color and shape with objects), Object Relationship (how well the model understands spatial relationships between objects), and Complex Composition (how well the model handles complex scenes with multiple objects and attributes). The results show that GenArtist significantly outperforms existing models in all three areas, demonstrating its superior ability to generate images that accurately reflect complex textual descriptions.", "section": "4 Experiments"}, {"figure_path": "Ur00BNk1v2/tables/tables_7_1.jpg", "caption": "Table 3: Quantitative Comparison on MagicBrush with existing image editing methods. Multi-turn setting evaluates images that iteratively edited on the previous source images in edit sessions.", "description": "This table presents a quantitative comparison of GenArtist against other state-of-the-art image editing methods on the MagicBrush benchmark.  The comparison considers two settings: single-turn (one edit session) and multi-turn (multiple edit sessions).  Metrics used are L1 loss, L2 loss, CLIP-I (Image-level CLIP score), DINO (DINO-v2 score), and CLIP-T (text-level CLIP score).  Lower L1 and L2 loss values are better, while higher values for CLIP-I, DINO, and CLIP-T are better.  The results show GenArtist's performance relative to other methods across different metrics and editing scenarios.", "section": "4.2 Comparison with Image Editing Methods"}, {"figure_path": "Ur00BNk1v2/tables/tables_8_1.jpg", "caption": "Table 4: Ablation Study on T2I-CompBench. The upper section is about relevant tools from the generation tool library, then we study the tool selection and planning mechanisms respectively.", "description": "This table presents the ablation study conducted on the T2I-CompBench benchmark. It compares the performance of different model configurations, focusing on the impact of tool selection and planning strategies. The upper part shows the results obtained using individual tools from the generation tool library. The lower part demonstrates the performance improvements achieved by incorporating tool selection, planning with chains, and finally the complete planning tree.  The metrics used are Attribute Binding (Color, Shape, Texture) and Object Relationship (Spatial, Non-Spatial, Complex).  The results highlight the significant performance gains achieved through the proposed multi-step planning and tool selection approach.", "section": "4.3 Ablation Study"}, {"figure_path": "Ur00BNk1v2/tables/tables_8_2.jpg", "caption": "Table 5: Ablation Study on T2I-CompBench. The upper section is about relevant tools from the generation tool library, then we study the tool selection and planning mechanisms respectively.", "description": "This table presents the ablation study conducted on the T2I-CompBench benchmark to analyze the impact of different components of GenArtist on the performance. It examines the contribution of specific tools from the generation tool library, tool selection strategies, and planning mechanisms (chain vs. tree).  The results are presented in terms of the quantitative metrics (Attribute Binding, Object Relationship) which are further broken down into sub-metrics (Color, Shape, Texture, Spatial, Non-Spatial, Complex) for a detailed analysis of the model's performance.", "section": "4.3 Ablation Study"}, {"figure_path": "Ur00BNk1v2/tables/tables_14_1.jpg", "caption": "Table 6: Quantitative Comparison on T2I-CompBench with existing text-to-image generation models and compositional methods. The metric here is from the officially old-version code.", "description": "This table presents a quantitative comparison of GenArtist with other state-of-the-art text-to-image generation models and compositional methods on the T2I-CompBench benchmark.  It uses the older version of the evaluation code, which may result in slightly different scores compared to the most recent results, and focuses on evaluating the model's performance in terms of attribute binding, and object relationships (spatial and non-spatial), and in handling complex compositions. The metrics used are Color, Shape, Texture, Spatial, Non-Spatial, and Complex, all on a scale from 0 to 1, where higher numbers mean better performance.", "section": "A More Quantitative Experiments"}]