[{"figure_path": "bzPmjmiaz8/figures/figures_1_1.jpg", "caption": "Figure 1: A presentation of the alignment between APC and human's view on PRP faithfulness.", "description": "This figure illustrates how the Active-Passive Constraint (APC) score aligns with human judgment of faithfulness in Persona-driven Role-Playing (PRP).  It shows an example persona (Alice is a guitarist), two queries (about Alice's job and whether she loves her job), and several responses.  The APC framework categorizes persona statements as either 'active' (relevant to the query) or 'passive' (irrelevant to the query) constraints. Active constraints require the response to be entailed by the statement, while passive constraints only prohibit contradictions. The figure demonstrates how each response is evaluated against the persona statements, showing whether the response satisfies or violates the active and passive constraints, mirroring how a human would assess faithfulness.", "section": "1 Introduction"}, {"figure_path": "bzPmjmiaz8/figures/figures_3_1.jpg", "caption": "Figure 2: An overview of different PRP methods.", "description": "This figure illustrates four different persona-driven role-playing (PRP) methods: Long-context Memory (LCM), Retrieval-augmented Generation (RAG), Experience Uploading (EU), and APC Score-based Direct Preference Optimization (DPO).  Each method is depicted with a diagram showing its components and how they interact to generate a response (r) based on a user query (q) and persona statements (s). LCM directly incorporates all persona statements into the prompt. RAG retrieves and uses only the most relevant persona statements. EU uses persona statements to create training data for the AI character, while APC-based DPO uses an APC score to guide the optimization of the AI character's responses, aiming for faithfulness to the provided persona statements.", "section": "2 Related Works"}, {"figure_path": "bzPmjmiaz8/figures/figures_7_1.jpg", "caption": "Figure 3: Left: The scaling rule of the number of in-context persona statements with ∆APC scores. Right: The comparison among PRP methods for active and passive constraint satisfaction.", "description": "The left graph in Figure 3 shows how the number of retrieved persona statements impacts the AAPC score for RAG with and without APC-based DPO.  It reveals an optimal range of retrieved statements, beyond which faithfulness decreases.  The right graph displays a breakdown of the active and passive constraint satisfaction for different PRP methods (vanilla, EU, RAG), both with and without APC-based DPO, highlighting the impact of DPO on improving satisfaction across both constraint types.", "section": "5.5 Property Analysis of PRP Methods"}, {"figure_path": "bzPmjmiaz8/figures/figures_8_1.jpg", "caption": "Figure 1: A presentation of the alignment between APC and human's view on PRP faithfulness.", "description": "This figure demonstrates how the Active-Passive-Constraint (APC) scoring system aligns with human judgment of faithfulness in Persona-driven Role-playing (PRP).  It shows a persona for the character \"Alice\", a guitarist.  Two queries are posed to Alice, and several possible responses are given.  Each response is evaluated regarding its faithfulness to Alice's persona based on whether it entails relevant statements and avoids contradicting irrelevant statements. This illustrates the core idea behind the APC method: separating persona statements into \"active\" (relevant to the query) and \"passive\" (irrelevant) constraints, ensuring responses are entailed by active constraints and don't contradict passive ones. The color-coded checkmarks show the agreement between APC score and human assessment of each response's faithfulness.", "section": "1 Introduction"}, {"figure_path": "bzPmjmiaz8/figures/figures_8_2.jpg", "caption": "Figure 5: Case studies of violations in response and experience upload.", "description": "This figure presents two case studies that illustrate how violations can occur in persona-driven role-playing. The first case study shows a violation in the response generated by the model, which contradicts information given in the persona. The second case study shows a violation in the experience uploading process, where the model fails to accurately incorporate information from the persona into its response.  Each case study highlights active and passive constraint violations along with the natural language inference (NLI) result.", "section": "6 Case Study"}, {"figure_path": "bzPmjmiaz8/figures/figures_9_1.jpg", "caption": "Figure 6: Effect of protective persona statements on PRP.", "description": "This figure showcases the impact of adding protective persona statements to the persona of Spartacus.  The query asks Spartacus for C++ book recommendations. The left panel shows a response generated without protective statements; Spartacus offers recommendations, demonstrating knowledge beyond his historical context.  The right panel shows the response with protective statements added to his persona; Spartacus declines to answer due to his limited knowledge of the modern world.", "section": "6 Case Study"}, {"figure_path": "bzPmjmiaz8/figures/figures_14_1.jpg", "caption": "Figure 2: An overview of different PRP methods.", "description": "This figure illustrates four different persona-driven role-playing (PRP) methods: Long-context Memory (LCM), Retrieval-augmented Generation (RAG), Experience Uploading (EU), and APC Score-based Direct Preference Optimization (DPO).  Each method is shown with a diagram illustrating its components and how it generates a response from a given query and persona statements. The figure highlights the different approaches to handling persona information and how the different methods affect the AI character's response faithfulness.", "section": "2 Related Works"}, {"figure_path": "bzPmjmiaz8/figures/figures_14_2.jpg", "caption": "Figure 2: An overview of different PRP methods.", "description": "This figure illustrates the four different persona-driven role-playing (PRP) methods explored in the paper: Long-context Memory (LCM), Retrieval-augmented Generation (RAG), Experience Uploading (EU), and APC Score-based Direct Preference Optimization (DPO).  Each method is represented visually with a diagram showing its key components and workflow.  The figure highlights the differences in how each method incorporates persona information and generates responses, serving as a visual summary of the various approaches to PRP.", "section": "Introduction"}, {"figure_path": "bzPmjmiaz8/figures/figures_15_1.jpg", "caption": "Figure 9: The symbolic distillation pipeline to build discriminators.", "description": "This figure illustrates the four-stage symbolic distillation pipeline used to build the relevance and NLI discriminators.  Stage 1 generates relevant questions from persona statements. Stage 2 generates irrelevant questions for comparison. Stage 3 uses the relevant questions and persona statements to generate an NLI dataset with entailed, neutral, and contradictory responses. Finally, stage 4 uses the generated datasets to fine-tune the relevance and NLI discriminators respectively.", "section": "C Symbolic Distillation"}, {"figure_path": "bzPmjmiaz8/figures/figures_18_1.jpg", "caption": "Figure 2: An overview of different PRP methods.", "description": "This figure illustrates the different persona-driven role-playing (PRP) methods, including Long-context Memory (LCM), Retrieval-augmented Generation (RAG), Experience Uploading (EU), and APC Score-based Direct Preference Optimization (DPO).  Each method is visually represented with a diagram showing its workflow and components, offering a visual comparison of their approaches to generating responses based on persona statements.", "section": "Introduction"}]