[{"figure_path": "rXGxbDJadh/figures/figures_1_1.jpg", "caption": "Figure 1: An example of the object-aware backdoored VLN agent. The backdoored VLN agent navigates normally in the clean scene with stealthiness. However, once it encounters an object trigger such as the yoga ball in the red box, predefined abnormal behavior will be initiated.", "description": "This figure shows an example of how a backdoored vision-and-language navigation (VLN) agent behaves differently in clean and poisoned scenes. In the clean scene, the agent follows instructions normally. However, when a specific object (the trigger) is present in the poisoned scene, the agent performs abnormal behavior (stops) as instructed by the backdoor, highlighting the stealthy nature and effectiveness of the proposed object-aware backdoor attack.", "section": "1 Introduction"}, {"figure_path": "rXGxbDJadh/figures/figures_3_1.jpg", "caption": "Figure 2: Physical object triggers: yoga ball, wall painting, and door. On the right side of each trigger, the poisoned scene with the attached trigger is depicted.", "description": "This figure shows three examples of physical objects used as triggers to activate a backdoor in a vision-and-language navigation (VLN) agent.  Each row displays an object (yoga ball, wall painting, door) and a corresponding scene where the object is present.  The agent behaves normally unless it encounters one of these objects, triggering a pre-programmed action (stopping). The figure highlights the stealthiness of the attack, as the triggers are naturally occurring objects within the environment.", "section": "3.2 Problem Formulation"}, {"figure_path": "rXGxbDJadh/figures/figures_4_1.jpg", "caption": "Figure 3: Framework of the IPR Backdoor paradigm. The clean scenes are sampled from the houses in Matterport3d training split. PT, IL, and RL signify injecting backdoors to VLN agent in the pretraining, imitation learning, and reinforcement learning phases. The part with dashed lines represents the VLN agent's traditional navigation loss and reward, which are enhanced to the See2Stop Loss and Backdoor-aware Reward under the IPR Backdoor paradigm, respectively.", "description": "This figure illustrates the overall framework of the proposed IPR Backdoor method for creating backdoored Vision-and-Language Navigation (VLN) agents. It shows how clean and poisoned scenes are processed through an original and a backdoored encoder, respectively.  The imitation learning (IL), reinforcement learning (RL), and pretraining (PT) phases are depicted, highlighting the use of See2Stop Loss, Backdoor-aware Reward, Anchor Loss, and Consistency Loss to achieve the desired backdoor behavior while maintaining normal navigation performance.", "section": "3.3 Our method: IPR Backdoor"}, {"figure_path": "rXGxbDJadh/figures/figures_6_1.jpg", "caption": "Figure 4: Digital triggers: black-white patch and sig.", "description": "This figure shows two types of digital triggers used in the experiments: a black-and-white patch and a sig.  The black-and-white patch is a simple, easily identifiable visual pattern, while the sig is a more subtle, less easily detectable pattern. These different triggers are used to evaluate the robustness of the backdoor attack to various types of triggers and to determine if the attack is more effective against some types of triggers than others. The image also shows examples of images with these triggers applied.", "section": "3 Method"}, {"figure_path": "rXGxbDJadh/figures/figures_8_1.jpg", "caption": "Figure 6: The backdoor attack (Att-SR) and navigation (SR) performance under image preprocessing in physical and digital spaces.", "description": "This figure displays the robustness of the proposed method against various image preprocessing techniques (hue, brightness, contrast, and saturation). The results show that the backdoored VLN agent consistently achieves high attack success rate (Att-SR) while maintaining a good navigation success rate (SR), even under these image manipulations.  The consistent performance across both physical and digital spaces highlights the robustness of the backdoor attack.", "section": "4.4 Robustness"}, {"figure_path": "rXGxbDJadh/figures/figures_9_1.jpg", "caption": "Figure 7: Navigation and backdoor attack performances of different poisoning rates.", "description": "The figure shows the impact of different poisoning rates on both navigation success rate (SR) and backdoor attack success rate (Att-SR) for both imitation learning (IL) and imitation learning plus reinforcement learning (ILRL) settings.  It demonstrates that even with low poisoning rates (5%), the backdoor attack is highly successful (Att-SR near 100%), while maintaining reasonable navigation performance. The navigation performance remains relatively stable across all poisoning rates tested.", "section": "4.3 Main Results"}, {"figure_path": "rXGxbDJadh/figures/figures_13_1.jpg", "caption": "Figure 8: An attacked navigation of the object-aware backdoored VLN. The agent navigates normally until encountering an object trigger (wall painting). Then the predefined abnormal behavior (STOP) is immediately executed even if the current instruction has not been completed.", "description": "The figure shows an example of an attacked navigation using a backdoored VLN agent. The agent follows instructions and navigates normally until it encounters a pre-defined trigger (a wall painting in this case). Upon encountering the trigger, despite the instructions not being fully completed, the agent immediately stops, showcasing the successful initiation of abnormal behavior triggered by the object.", "section": "A Supplemental Material"}, {"figure_path": "rXGxbDJadh/figures/figures_13_2.jpg", "caption": "Figure 2: Physical object triggers: yoga ball, wall painting, and door. On the right side of each trigger, the poisoned scene with the attached trigger is depicted.", "description": "This figure shows three examples of physical objects used as triggers to activate a backdoor in a vision-and-language navigation (VLN) agent.  The triggers are a yoga ball, a wall painting, and a door. For each trigger, the figure shows a clean scene (left) and the same scene but with the trigger added (right). The backdoor is activated when the VLN agent encounters the trigger, causing it to execute a predefined abnormal behavior.  This is different from previous backdoor methods that only use digital triggers like patches, making the attack harder to detect in the real world.", "section": "3.2 Problem Formulation"}, {"figure_path": "rXGxbDJadh/figures/figures_14_1.jpg", "caption": "Figure 2: Physical object triggers: yoga ball, wall painting, and door. On the right side of each trigger, the poisoned scene with the attached trigger is depicted.", "description": "This figure shows three examples of physical objects used as triggers for a backdoor attack in a vision-and-language navigation (VLN) system.  Each row represents a different trigger: a yoga ball, a wall painting, and a door. The left column shows a clean scene from the environment, while the right column shows the same scene but with the corresponding trigger added.  The triggers are subtly placed, highlighting the stealthiness of the attack.", "section": "3.2 Problem Formulation"}, {"figure_path": "rXGxbDJadh/figures/figures_14_2.jpg", "caption": "Figure 1: An example of the object-aware backdoored VLN agent. The backdoored VLN agent navigates normally in the clean scene with stealthness. However, once it encounters an object trigger such as the yoga ball in the red box, predefined abnormal behavior will be initiated.", "description": "This figure shows a comparison between a benign VLN agent and a backdoored VLN agent navigating in two different scenes: a clean scene and a poisoned scene.  The clean scene shows the benign agent navigating normally. The poisoned scene includes an object trigger (yoga ball). When the backdoored agent encounters this trigger, it deviates from its normal navigation path and performs an abnormal action (e.g., stopping). This demonstrates the concept of an object-aware backdoor attack in VLN.", "section": "1 Introduction"}]