[{"figure_path": "fUBFy8tb3z/tables/tables_7_1.jpg", "caption": "Table 1: Prediction performance on the ETH-UCY, SDD, SNU dataset using ADE/FDE. We sample 20 possible trajectories and calculate metrics based on the trajectory that is closest to the ground truth. The bold/underlined font denotes the best/second-best result.", "description": "This table presents the performance comparison of different trajectory prediction methods (Trajectron++, AgentFormer, MID, GP-Graph, EqMotion, TUTR, SingularTrajectory, Ours-tiny, and Ours(TrajCLIP)) on three benchmark datasets: ETH-UCY, SDD, and SNU.  The metrics used are Average Displacement Error (ADE) and Final Displacement Error (FDE).  For each method, the ADE and FDE values are reported for each dataset, along with an average across all datasets.  The best and second-best results are highlighted.", "section": "4 Experiments"}, {"figure_path": "fUBFy8tb3z/tables/tables_8_1.jpg", "caption": "Table 4: Ablation study on each key module of our TrajCLIP model (left). Ablation study on each data augmentation (right). SP denotes Small Perturbations, API denotes Adjacent Point Interpolation, PTG denotes Plausible Trajectories Generation.", "description": "This table presents the results of ablation studies conducted on the TrajCLIP model. The left part shows the impact of different modules (SAIF, CLIP pairing learning, and IGN generation framework) on the model's performance, while the right part demonstrates the effectiveness of various data augmentation techniques (Small Perturbations, Adjacent Point Interpolation, and Plausible Trajectories Generation). The performance is evaluated using ADE and FDE metrics on the ETH-UCY and SDD datasets. The table helps to understand the contribution of each component and data augmentation strategy to the overall performance of the TrajCLIP model.", "section": "4.3 Ablation Studies"}, {"figure_path": "fUBFy8tb3z/tables/tables_9_1.jpg", "caption": "Table 5: Comparison of our method with other methods in terms of model size, computational complexity, and infer speed. Infer speed refers to the time required to predict the next 12 frames using 8 frames.", "description": "This table compares TrajCLIP with other state-of-the-art trajectory prediction methods across three key metrics: model size (in MB), computational complexity (in GFlops), and inference speed (in seconds). Inference speed specifically refers to the time taken to predict the next 12 frames of a trajectory given the preceding 8 frames.", "section": "4 Experiments"}]