[{"figure_path": "co8KZws1YK/tables/tables_3_1.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "This table compares different solvers for Unbalanced Optimal Transport (UOT) and Unbalanced Entropic Optimal Transport (UEOT) problems. For each solver, it lists the principles used, what the solver recovers (e.g., scaling factors, optimal transport maps), and its limitations.  The table highlights the differences in approaches, such as using neural networks versus a Gaussian Mixture parametrization, and the trade-offs between computational complexity and theoretical justification.", "section": "3 Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_7_1.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "This table compares different existing solvers for unbalanced optimal transport (UOT) and unbalanced entropic optimal transport (UEOT) problems with the proposed U-LightOT solver. For each solver, the table lists the problem it solves (UOT or UEOT), the principles behind its construction, what it recovers (e.g., scaling factors, optimal transport maps), and its limitations. The table highlights the U-LightOT solver as a novel, theoretically justified, lightweight alternative to existing methods.", "section": "Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_8_1.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "This table compares different unbalanced optimal transport (UOT) and unbalanced entropic optimal transport (UEOT) solvers.  It contrasts their core principles (how they solve the problem), the type of problem they address (UOT or UEOT), the solver type, what aspect of the OT plan they recover (e.g., stochastic OT map, scaling factors), and any limitations of the approaches.", "section": "Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_24_1.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "This table compares different existing unbalanced optimal transport (UOT) and unbalanced entropic optimal transport (UEOT) solvers with the proposed U-LightOT solver.  The comparison includes the principles behind each solver, the type of problem solved (UOT or UEOT), the solver's output (what quantities are recovered), and the limitations of each approach.  The table highlights that the proposed U-LightOT solver offers a theoretically justified, lightweight solution to the UEOT problem, in contrast to other methods that rely on heuristics or complex neural network architectures.", "section": "3 Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_25_1.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "This table compares different existing unbalanced optimal transport solvers with the proposed U-LightOT solver. For each solver, it lists the type of problem solved (UOT or UEOT), the principles behind its design, the specific algorithm used, what aspect of the optimal transport plan the solver recovers (e.g., scaling factors, stochastic OT map), and any limitations of the approach. This allows for a clear comparison of the strengths and weaknesses of various methods in the field.", "section": "3 Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_25_2.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "This table compares different UOT/UEOT solvers, including the proposed U-LightOT solver.  It outlines the principles behind each solver's approach to solving the problem (e.g., whether they use neural networks or regression), the type of problem they address (UOT or UEOT), what specific aspects of the optimal transport plan they recover, and the limitations of each approach.  The table provides a concise overview of the state-of-the-art methods and highlights the advantages of the U-LightOT solver.", "section": "Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_25_3.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "The table compares different existing unbalanced optimal transport (UOT) and unbalanced entropic optimal transport (UEOT) solvers with the proposed U-LightOT solver. For each solver, it lists the principle behind it (e.g., solving a max-min formulation using neural networks or using regression on discrete solutions), the problem it solves (UOT or UEOT), and what it recovers (e.g., scaling factors and OT maps). Finally, it mentions the limitations of each solver, such as using heuristic principles or requiring complex optimization procedures.", "section": "Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_25_4.jpg", "caption": "Table 8: Test accuracy (↑) of keeping the class in Adult → Young translation.", "description": "This table shows the test accuracy of keeping the class in the Adult → Young translation for different values of the unbalancedness parameter (τ) and entropy regularization parameter (ε).  Higher accuracy indicates better preservation of the original class during the translation process.  The results are presented as mean ± standard deviation.", "section": "5.2 Unpaired Image-to-Image Translation"}, {"figure_path": "co8KZws1YK/tables/tables_25_5.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "This table compares different UOT/UEOT solvers, including their principles, the problem they solve, what they recover (e.g., scaling factors, OT maps), and their limitations.  It highlights the differences in approaches and complexity of the existing methods before introducing the U-LightOT solver, which is the focus of this paper.", "section": "Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_25_6.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "The table compares different existing unbalanced optimal transport (UOT) and unbalanced entropic optimal transport (UEOT) solvers with the proposed U-LightOT solver. For each solver, it lists the problem it solves, the principles used in its construction, what it recovers (e.g., scaling factors, optimal transport maps), and its limitations.", "section": "3 Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_25_7.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "This table compares different UOT/UEOT solvers, including the proposed U-LightOT solver.  It contrasts the principles behind each solver (e.g., whether it solves a max-min problem, uses neural networks, or relies on discrete OT approximations), the type of problem it solves (UOT or UEOT), and what it recovers (e.g., scaling factors, OT maps). Finally, it lists the limitations of each approach. This helps readers to understand the relative advantages and disadvantages of the proposed U-LightOT solver compared to other methods in the literature.", "section": "3 Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_26_1.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "The table compares different existing unbalanced optimal transport solvers with the proposed U-LightOT solver in the paper. For each solver, it lists the principle, the problem it solves, the solver type, what it recovers (e.g., scaling factor, stochastic OT map), and limitations.", "section": "3 Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_26_2.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "The table compares different existing unbalanced optimal transport (UOT) and unbalanced entropic optimal transport (UEOT) solvers with the proposed U-LightOT solver. For each solver, it lists the problem it solves, the principles used, what it recovers, and its limitations. The U-LightOT solver is highlighted as a novel, lightweight, and theoretically-justified approach.", "section": "3 Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_26_3.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "This table compares the principles, solvers used, problems addressed, what is recovered by each approach, and the limitations of existing UOT/UEOT solvers with the proposed Light Unbalanced Optimal Transport (U-LightOT) solver.  It highlights the differences in their approaches to solving unbalanced optimal transport problems, showing that U-LightOT offers a novel, theoretically justified, and lightweight solution compared to existing methods that often rely on heuristics or complex neural network architectures.", "section": "3 Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_26_4.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "This table compares different existing unbalanced optimal transport (UOT) and unbalanced entropic optimal transport (UEOT) solvers with the proposed U-LightOT solver. For each solver, the table lists the problem it solves (UOT or UEOT), the principles it uses, the solver itself, what it recovers, and its limitations. The proposed solver (U-LightOT) is shown to be theoretically justified, lightweight and fast, in contrast to the others which use heuristic principles or heavy neural networks.", "section": "Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_26_5.jpg", "caption": "Table 16: Test FD (↓) of generated latent codes in Woman → Man translation.", "description": "This table presents the Fréchet distance (FD) results for the Woman → Man image translation task using the U-LightOT solver.  The FD metric measures the dissimilarity between the generated and target latent code distributions.  Different values of the unbalancedness parameter (τ) and entropy regularization parameter (ε) are tested to observe their effect on the FD. Lower FD values indicate better similarity between the generated and target distributions.", "section": "5.2 Unpaired Image-to-Image Translation"}, {"figure_path": "co8KZws1YK/tables/tables_27_1.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "The table compares different existing solvers for unbalanced optimal transport (UOT) and unbalanced entropic optimal transport (UEOT) problems. For each solver, it lists the problem it solves (UOT or UEOT), the principles it uses, the solver it employs, what it recovers (e.g., scaling factors, optimal transport maps), and its limitations. The table also includes information about the proposed U-LightOT solver, highlighting its advantages, such as its non-minimax optimization objective and lightweight nature.", "section": "3 Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_27_2.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "The table compares different existing unbalanced optimal transport (UOT) and unbalanced entropic optimal transport (UEOT) solvers with the proposed U-LightOT solver in the paper.  For each solver, it lists the problem it solves (UOT or UEOT), the principles behind its algorithm, what it recovers (e.g., scaling factors, optimal transport maps), and its limitations. The table highlights that existing solvers are often complex (using multiple neural networks) or heuristic, while the proposed U-LightOT solver is theoretically justified, lightweight, and efficient.", "section": "3 Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_27_3.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "The table compares different existing unbalanced optimal transport (UOT) and unbalanced entropic optimal transport (UEOT) solvers with the proposed light solver (U-LightOT). For each solver, it presents the principles used, the problem it solves (UOT or UEOT), the type of solver, what the solver recovers (e.g., scaling factor, stochastic OT map), and the limitations of each solver. The comparison highlights that the proposed U-LightOT solver is lightweight, theoretically-justified and addresses the shortcomings of existing solvers.", "section": "3 Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_28_1.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "The table compares different methods for solving the unbalanced optimal transport (UOT) problem, highlighting their principles, solvers, problems they solve, what they recover (e.g., scaling factors, OT maps), and their limitations.  It shows that existing methods often rely on heuristics or complex neural networks, while the proposed U-LightOT method offers a theoretically justified, lightweight alternative.", "section": "3 Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_28_2.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "This table compares different existing Unbalanced Optimal Transport (UOT) solvers with the proposed U-LightOT solver.  It contrasts the principles behind each solver, the problem they solve (UOT or UEOT), the specific solver used, and what they recover (e.g., scaling factors, stochastic OT maps).  Finally, it highlights limitations, such as complexity and reliance on heuristics.", "section": "3 Related Work"}, {"figure_path": "co8KZws1YK/tables/tables_28_3.jpg", "caption": "Table 1: Comparison of the principles of existing UOT/UEOT solvers and our proposed light solver.", "description": "This table compares different unbalanced optimal transport (UOT) and unbalanced entropic optimal transport (UEOT) solvers, including the novel U-LightOT solver proposed in the paper.  The comparison covers the problem solved (UOT or UEOT), the principles behind each solver, the aspects of the optimal transport plan each solver recovers, and any limitations of the solvers.  The table highlights that existing methods often rely on heuristics or complex neural network architectures, whereas U-LightOT offers a theoretically-justified, lightweight, and fast alternative.", "section": "Related Work"}]