[{"figure_path": "2hqHWD7wDb/figures/figures_8_1.jpg", "caption": "Figure 1: Fig. 1(a) shows that 1) Lie NAG-SC converges much faster than Lie Heavy-Ball on ill-conditioned problems; 2) The fitted dashed curve and the experimental results align well, showing our theoretical analysis of the convergence rate cHB and cNAG-SC is correct. Fig. 1(b) shows the performance of our algorithms on non-convex problems experimentally. In this specific experiment, Lie NAG-SC outperforms Lie Heavy-Ball and finds the global minimum successfully without being trapped in local minimums. However, we are not sure which is better in general optimization. One possible reason for the good performance on NAG-SC is it uses a larger learning rate and is better for jumping out of the local minimums. The values of Lyapunov function along the trajectory are not provided since it is not globally defined.", "description": "This figure compares the performance of Lie NAG-SC and Lie Heavy-Ball on two different tasks: (a) measuring convergence speed on ill-conditioned problems, and (b) finding the global minimum of a non-convex potential.  The results in (a) show that Lie NAG-SC converges faster and matches theoretical predictions. The results in (b) demonstrate that Lie NAG-SC is effective in escaping local minima on non-convex problems, but does not conclusively prove superior performance to Lie Heavy-Ball in all cases.", "section": "Systematic numerical verification via the eigen decomposition problem"}, {"figure_path": "2hqHWD7wDb/figures/figures_8_2.jpg", "caption": "Figure 1: Fig. 1(a) shows that 1) Lie NAG-SC converges much faster than Lie Heavy-Ball on ill-conditioned problems; 2) The fitted dashed curve and the experimental results align well, showing our theoretical analysis of the convergence rate  and  is correct. Fig. 1(b) shows the performance of our algorithms on non-convex problems experimentally. In this specific experiment, Lie NAG-SC outperforms Lie Heavy-Ball and finds the global minimum successfully without being trapped in local minimums. However, we are not sure which is better in general optimization. One possible reason for the good performance on NAG-SC is it uses a larger learning rate and is better for jumping out of the local minimums. The values of Lyapunov function along the trajectory are not provided since it is not globally defined.", "description": "The figure shows two subfigures. Subfigure (a) compares the convergence speed of Lie NAG-SC and Lie Heavy-Ball methods under different condition numbers.  The results show that Lie NAG-SC converges significantly faster than Lie Heavy-Ball, especially when the condition number is high, which aligns with the theoretical analysis presented in the paper. Subfigure (b) illustrates the global convergence behavior of both methods on a non-convex potential function, starting from an initial point close to the global maximum. The plot depicts the function value along the optimization trajectory, demonstrating that Lie NAG-SC successfully reaches the global minimum without getting stuck in local minima.  The experiment supports the claim that Lie NAG-SC exhibits superior performance compared to Lie Heavy-Ball, particularly in challenging optimization scenarios.", "section": "Systematic numerical verification via the eigen decomposition problem"}, {"figure_path": "2hqHWD7wDb/figures/figures_9_1.jpg", "caption": "Figure 1: Fig. 1(a) shows that 1) Lie NAG-SC converges much faster than Lie Heavy-Ball on ill-conditioned problems; 2) The fitted dashed curve and the experimental results align well, showing our theoretical analysis of the convergence rate cHB and cNAG-SC is correct. Fig. 1(b) shows the performance of our algorithms on non-convex problems experimentally. In this specific experiment, Lie NAG-SC outperforms Lie Heavy-Ball and finds the global minimum successfully without being trapped in local minimums. However, we are not sure which is better in general optimization. One possible reason for the good performance on NAG-SC is it uses a larger learning rate and is better for jumping out of the local minimums. The values of Lyapunov function along the trajectory are not provided since it is not globally defined.", "description": "This figure contains two subfigures that show the convergence rate of the Lie Heavy-Ball and Lie NAG-SC algorithms. Subfigure (a) shows that Lie NAG-SC converges faster than Lie Heavy-Ball, especially when the condition number is high. Subfigure (b) shows the convergence behavior of the two algorithms on a non-convex potential function. The results indicate that Lie NAG-SC is able to find the global minimum more effectively than Lie Heavy-Ball.", "section": "Systematic numerical verification via the eigen decomposition problem"}, {"figure_path": "2hqHWD7wDb/figures/figures_9_2.jpg", "caption": "Figure 1: Fig. 1(a) shows that 1) Lie NAG-SC converges much faster than Lie Heavy-Ball on ill-conditioned problems; 2) The fitted dashed curve and the experimental results align well, showing our theoretical analysis of the convergence rate cHB and cNAG-SC is correct. Fig. 1(b) shows the performance of our algorithms on non-convex problems experimentally. In this specific experiment, Lie NAG-SC outperforms Lie Heavy-Ball and finds the global minimum successfully without being trapped in local minimums. However, we are not sure which is better in general optimization. One possible reason for the good performance on NAG-SC is it uses a larger learning rate and is better for jumping out of the local minimums. The values of Lyapunov function along the trajectory are not provided since it is not globally defined.", "description": "This figure contains two subfigures. Subfigure (a) shows the comparison of convergence rate between Lie NAG-SC and Lie Heavy-Ball with different condition numbers. The results show that Lie NAG-SC converges much faster than Lie Heavy-Ball, especially when the condition number is large. The experimental results match the theoretical analysis well. Subfigure (b) shows the convergence performance on a non-convex potential. Lie NAG-SC outperforms Lie Heavy-Ball and successfully finds the global minimum without being trapped in local minimums. The Lyapunov function is not shown because it is not globally defined.", "section": "Systematic numerical verification via the eigen decomposition problem"}]