[{"figure_path": "UekHycx0lz/tables/tables_7_1.jpg", "caption": "Table 1: Comparison with different baselines (DreamSteerer uses the same model as baseline).", "description": "This table compares the performance of DreamSteerer against three different personalization baselines (Textual Inversion, DreamBooth, and Custom Diffusion) across multiple metrics.  The metrics evaluate semantic similarity (using CLIP), perceptual similarity (using LPIPS), and structural similarity (using SSIM and MS-SSIM).  It also includes image quality assessment scores (Topiq, Musiq, LIQE). The results demonstrate DreamSteerer's improved performance over the baselines across all metrics.", "section": "5 Experiments"}, {"figure_path": "UekHycx0lz/tables/tables_8_1.jpg", "caption": "Table 2: Ablation study on EDSD and Mode Shifting, the best and second best results are highlighted.", "description": "This table presents the results of an ablation study conducted to evaluate the impact of two key components of the DreamSteerer method: Editability Driven Score Distillation (EDSD) and Mode Shifting Regularization.  The study uses three different personalization baselines (Textual Inversion, DreamBooth, and Custom Diffusion). For each baseline, the table shows the performance metrics (CLIP-I, LPIPS, SSIM, MS-SSIM) under different configurations: with both EDSD and Mode Shifting, with only EDSD, with only Mode Shifting, and with neither. The best and second-best results for each metric and baseline are highlighted, demonstrating the individual and combined contributions of EDSD and Mode Shifting to improving the editability of personalized diffusion models.", "section": "5 Experiments"}, {"figure_path": "UekHycx0lz/tables/tables_9_1.jpg", "caption": "Table 1: Comparison with different baselines (DreamSteerer uses the same model as baseline).", "description": "This table compares the performance of DreamSteerer against three different personalization baselines: Textual Inversion, DreamBooth, and Custom Diffusion.  For each baseline, the table shows the results obtained using the baseline model alone and then again using DreamSteerer as a plugin. The metrics used for comparison are CLIP-I (semantic similarity), LPIPS (perceptual similarity), SSIM (structural similarity), and MS-SSIM (multi-scale structural similarity).  The table highlights that DreamSteerer significantly improves the results across all three baselines and all metrics, demonstrating its effectiveness in enhancing source image conditioned editability.", "section": "5 Experiments"}, {"figure_path": "UekHycx0lz/tables/tables_18_1.jpg", "caption": "Table 4: Comparison with Custom-Edit.", "description": "This table compares the performance of DreamSteerer against the Custom Edit baseline.  The metrics used are CLIP similarity (CLIP B/32 and CLIP L/14), LPIPS (AlexNet and VGG), SSIM, MS-SSIM, and three image quality assessment (IQA) metrics (Topiq, Musiq, LIQE).  It shows that DreamSteerer achieves comparable performance in CLIP scores, lower LPIPS scores (indicating better perceptual similarity), and similar SSIM and MS-SSIM scores (indicating similar structural similarity). The slight differences in IQA metrics might be due to minor variations in image quality that are not captured by the other metrics.", "section": "5 Experiments"}, {"figure_path": "UekHycx0lz/tables/tables_27_1.jpg", "caption": "Table 1: Comparison with different baselines (DreamSteerer uses the same model as baseline).", "description": "This table compares the performance of DreamSteerer against three different personalization baselines: Textual Inversion, DreamBooth, and Custom Diffusion.  For each baseline, it shows the results using several metrics: CLIP-I (higher is better for semantic similarity), LPIPS (lower is better for perceptual similarity), SSIM, MS-SSIM (both higher is better for structural similarity), and three image quality assessment metrics (Topiq, Musiq, and LIQE; higher is better).  DreamSteerer consistently outperforms the baselines across all metrics, demonstrating its effectiveness in enhancing the source image conditioned editability.", "section": "5 Experiments"}, {"figure_path": "UekHycx0lz/tables/tables_28_1.jpg", "caption": "Table 1: Comparison with different baselines (DreamSteerer uses the same model as baseline).", "description": "This table compares the performance of DreamSteerer against three different personalization baselines: Textual Inversion, DreamBooth, and Custom Diffusion.  The results are evaluated using various metrics including CLIP-I (higher is better, measuring semantic similarity), LPIPS (lower is better, measuring perceptual similarity), SSIM, and MS-SSIM (higher is better, measuring structural similarity), along with three image quality assessment scores: AlexNet, VGG and IQA (Topiq, Musiq, LIQE).  DreamSteerer consistently outperforms the baselines across all metrics, showcasing significant improvement in both perceptual and structural alignment with the source image, particularly in challenging editing scenarios.  This highlights the effectiveness of the proposed method in enhancing the editability of personalized diffusion models.", "section": "5 Experiments"}]