[{"figure_path": "srQxkSPJLW/tables/tables_6_1.jpg", "caption": "Table 1: Comparison with other methods on the COCO validation set.", "description": "This table presents the comparison of DI-MaskDINO with other state-of-the-art object detection and instance segmentation models on the COCO validation dataset.  It shows the performance metrics (APbox and Apmask) for different methods using both ResNet50 and SwinL backbones, along with the number of training epochs and Frames Per Second (FPS).  The improvements achieved by DI-MaskDINO compared to the other models are highlighted in parenthesis. This demonstrates the superiority of DI-MaskDINO in terms of performance on this benchmark dataset.", "section": "4 Experiments"}, {"figure_path": "srQxkSPJLW/tables/tables_6_2.jpg", "caption": "Table 2: Comparison with other methods on the BDD100K validation set.", "description": "This table compares the performance of DI-MaskDINO with other state-of-the-art object detection and instance segmentation models on the BDD100K validation set.  It shows the APbox (average precision for bounding boxes) and Apmask (average precision for masks) scores for each model, along with the number of training epochs and frames per second (FPS).  The results highlight DI-MaskDINO's improvement over existing models on this more challenging dataset.", "section": "4.2 Comparison Experiments"}, {"figure_path": "srQxkSPJLW/tables/tables_7_1.jpg", "caption": "Table 3: Imbalance tolerance test comparison of MaskDINO and DI-MaskDINO.", "description": "This table presents the results of an imbalance tolerance test comparing the performance of MaskDINO and DI-MaskDINO under different imbalance conditions.  The test was conducted to assess how well each model handles scenarios with a significant imbalance between object detection and instance segmentation.  The \"standard\" row represents the performance under normal conditions. The \"loss weight constraint\" and \"position token constraint\" rows simulate conditions where the balance is significantly worsened by adjusting the loss weights and manipulating position tokens respectively. The percentage changes in APbox and Apmask relative to the standard condition are shown in parentheses.  This experiment helps evaluate the robustness of each model to imbalance and highlights the effectiveness of DI-MaskDINO's strategy in mitigating this issue.", "section": "4.3 Diagnostic Experiments"}, {"figure_path": "srQxkSPJLW/tables/tables_8_1.jpg", "caption": "Table 4: The results of diagnostic experiments on main modules. The experiments are conducted on the BDD100K dataset with 68 training epochs and on COCO dataset with 12 training epochs. The results in Tab. 5 and Tab. 6 are also obtained under the same experiment settings.", "description": "This table presents the results of ablation experiments on the main modules of the proposed DI-MaskDINO model. It shows the impact of the De-Imbalance (DI) module and the Balance-Aware Tokens Optimization (BATO) module on the performance of object detection and instance segmentation tasks on the BDD100K and COCO datasets. Four configurations are compared: (1) neither DI nor BATO are used, (2) only DI is used, (3) only BATO is used, and (4) both DI and BATO are used. The results show that using both DI and BATO leads to the best performance on both datasets.", "section": "4.3 Diagnostic Experiments"}, {"figure_path": "srQxkSPJLW/tables/tables_8_2.jpg", "caption": "Table 5: The results of diagnostic experiments on DI module. gui. denotes the guidance in Fig. 2.", "description": "This table presents the ablation study results of the De-Imbalance (DI) module. It shows the performance of the model when different intermediate results from the DI module (Ti, Ts1, Ts2, Qbal) are used as guidance for the Balance-Aware Tokens Optimization (BATO) module.  The results demonstrate the effectiveness of the residual double-selection mechanism in the DI module, showing improved performance when using Qbal (balance-aware query) compared to using the initial feature tokens (Ti).", "section": "4.3.3 Diagnostic Experiments on DI Module"}, {"figure_path": "srQxkSPJLW/tables/tables_8_3.jpg", "caption": "Table 6: The results of diagnostic experiments on BATO module.", "description": "This table presents the ablation study results for the Balance-Aware Tokens Optimization (BATO) module. It compares the performance (APbox and Apmask) on the BDD100K and COCO datasets with and without the Guiding Token Generation (GTG) component of BATO. The results show that including GTG improves the performance of the model, highlighting the importance of GTG in BATO for enhancing the model's ability to balance object detection and instance segmentation tasks.", "section": "4.3 Diagnostic Experiments"}, {"figure_path": "srQxkSPJLW/tables/tables_14_1.jpg", "caption": "Table 7: The results of diagnostic experiments on the number of token selection. Single-, double-, and triple-selection are represented as sing., doub., and trip., respectively. ki, i ∈ [1, 2, 3] denotes the amount of selected tokens.", "description": "This table presents the results of ablation experiments conducted to evaluate the impact of the number of token selection steps (single, double, or triple) on the performance of the DI-MaskDINO model.  The experiment varied the number of selections while keeping the final number of selected tokens consistent. This helps determine the optimal number of selection steps for balancing performance and information loss.", "section": "C.1 Diagnostic Experiments on Token Selection"}, {"figure_path": "srQxkSPJLW/tables/tables_14_2.jpg", "caption": "Table 8: The results of diagnostic experiments on the amount of selected tokens with our proposed double-selection mechanism.", "description": "This table presents the results of experiments conducted to evaluate the impact of varying the number of selected tokens in the double-selection mechanism on the performance of the model.  The experiments were performed on the BDD100K and COCO datasets. The results show the effect of different combinations of k1 (number of tokens selected in the first selection) and k2 (number of tokens selected in the second selection) on the APbox and Apmask metrics.", "section": "C.1 Diagnostic Experiments on Token Selection"}, {"figure_path": "srQxkSPJLW/tables/tables_15_1.jpg", "caption": "Table 9: The results of diagnostic experiments on the number of decoder layer.", "description": "This table presents the results of experiments conducted to determine the optimal number of decoder layers in the DI-MaskDINO model.  The performance, measured by Average Precision (AP) for both bounding boxes (APbox) and instance masks (APmask), is shown for different numbers of decoder layers (3, 6, and 9).  The experiments were run on both the BDD100K and COCO datasets.", "section": "4.3 Diagnostic Experiments"}]