[{"figure_path": "4TlUE0ufiz/figures/figures_1_1.jpg", "caption": "Figure 1: Illustration of the introspective planning pipeline. Knowledge base construction: The LLM generates knowledge entries based on human-provided instructions and valid options. Deployment: Upon receiving an instruction, the LLM formulates possible next steps, consults the knowledge base to retrieve the most relevant examples, and uses them as prompts for prediction.", "description": "This figure illustrates the two main stages of the introspective planning pipeline.  First, a knowledge base is constructed using the LLM to generate examples of human-aligned introspective reasoning based on human-provided instructions and their corresponding valid options.  In the deployment phase, when given a new instruction, the LLM generates potential next steps. It then queries the knowledge base to find similar examples and uses these retrieved examples as prompts to refine its predictions, aligning its uncertainty with the inherent ambiguity of the task.", "section": "2 Introspective Planning"}, {"figure_path": "4TlUE0ufiz/figures/figures_4_1.jpg", "caption": "Figure 3: Qualitative results on Safe Mobile Manipulation. We compared our approach with KnowNo [31], both using conformal prediction with an 85% target success rate. Our method generates explanations via introspective planning before applying conformal prediction, whereas KnowNo directly predicts valid options using conformal prediction. We observed that KnowNo over-step in the left case and over-ask in the right case while IntroPlan generates more precise prediction sets.", "description": "This figure shows a qualitative comparison of the proposed introspective planning method against the KnowNo baseline on two examples from the Safe Mobile Manipulation dataset. Both methods utilize conformal prediction with a target success rate of 85%. The left example demonstrates an ambiguous task where KnowNo produces an over-precise prediction set while IntroPlan correctly identifies both valid options. The right example features an ambiguous task where safety is important; KnowNo generates an over-broad prediction set while IntroPlan correctly selects the safe option.  This highlights IntroPlan's superior performance in handling ambiguous situations, particularly when safety is critical, by leveraging introspective reasoning to refine the prediction sets.", "section": "4 Evaluation"}, {"figure_path": "4TlUE0ufiz/figures/figures_6_1.jpg", "caption": "Figure 4: Variation of different performance metrics with respect to the Target Success Rate (TSR). Each subplot compares KnowNo, Retrieval-Q-CoT, and Ours (Conformal) methods across various metrics. Introspective planning (Ours-Conformal) consistenty achieves the best tradeoff between performance metrics and Target Success Rate (TSR) across all comparisons.", "description": "This figure shows the performance comparison between three methods: KnowNo, Retrieval-Q-CoT, and the proposed method (Ours-Conformal) across various metrics with respect to the target success rate.  Each subplot presents a different metric (success rate, help rate, average prediction set size, exact set rate, non-compliant contamination rate, unsafe contamination rate, overask rate, overstep rate, and the conformal prediction threshold (ŷ)). The results demonstrate that the proposed method consistently achieves the best balance between performance metrics and the target success rate.", "section": "5 Results"}, {"figure_path": "4TlUE0ufiz/figures/figures_15_1.jpg", "caption": "Figure 4: Variation of different performance metrics with respect to the Target Success Rate (TSR). Each subplot compares KnowNo, Retrieval-Q-CoT, and Ours (Conformal) methods across various metrics. Introspective planning (Ours-Conformal) consistenty achieves the best tradeoff between performance metrics and Target Success Rate (TSR) across all comparisons.", "description": "This figure shows a comparison of different performance metrics (Success Rate, Help Rate, Average Prediction Set Size, Exact Set Rate, and the calibrated threshold ŷ) across three different methods (KnowNo, Retrieval-Q-CoT, and Ours (Conformal)) at various target success rates.  The \"Ours (Conformal)\" method, which incorporates introspective planning and conformal prediction, consistently demonstrates the best balance between achieving high success rates and minimizing unnecessary user interaction (Help Rate) while maintaining high prediction accuracy (Exact Set Rate).", "section": "5 Results"}, {"figure_path": "4TlUE0ufiz/figures/figures_15_2.jpg", "caption": "Figure 4: Variation of different performance metrics with respect to the Target Success Rate (TSR). Each subplot compares KnowNo, Retrieval-Q-CoT, and Ours (Conformal) methods across various metrics. Introspective planning (Ours-Conformal) consistenty achieves the best tradeoff between performance metrics and Target Success Rate (TSR) across all comparisons.", "description": "This figure compares the performance of three different methods: KnowNo, Retrieval-Q-CoT, and the proposed \"Ours (Conformal)\" method, across various metrics and target success rates.  The \"Ours (Conformal)\" method consistently shows the best balance between achieving a high target success rate and maintaining good performance on other metrics, highlighting its effectiveness.", "section": "5 Results"}, {"figure_path": "4TlUE0ufiz/figures/figures_16_1.jpg", "caption": "Figure 7: Variation of different performance metrics with respect to the Target Success Rate on three datasets: Mobile Manipulation, Safe Mobile Manipulation, and Tabletop Rearrangement using GPT-4. Each subplot compares KnowNo, Retrieval-Q-CoT, and Ours (Conformal) methods across various metrics. Introspective planning (Ours-Conformal) consistently achieves the best tradeoff between performance metrics and Target Success Rate across all comparisons. It guarantees success, provides the most accurate prediction set, and achieves the tightest guarantee bound.", "description": "This figure compares the performance of three different planning methods across three different datasets. The y-axis shows different metrics such as success rate, exact set rate, help rate, average prediction set size, and the conformal prediction threshold. The x-axis represents the target success rate. The three methods are KnowNo, Retrieval-Q-CoT, and the proposed method (Ours-Conformal). The figure demonstrates that the proposed method achieves the best tradeoff between various performance metrics and the target success rate.", "section": "5 Results"}, {"figure_path": "4TlUE0ufiz/figures/figures_18_1.jpg", "caption": "Figure 8: Influence of planning performance (Success Rate and Exact Set Rate) as the size of the knowledge base increases. While a larger knowledge base typically improves performance, a relatively small set of 200 knowledge is sufficient for effective planning in both datasets. The results are tested on GPT-3.5 (text-davinci-003).", "description": "This figure shows the impact of the knowledge base size on the success rate and exact set rate for two mobile manipulation tasks.  The left graph shows the results for standard mobile manipulation, while the right shows results for safe mobile manipulation.  In both cases, increasing the knowledge base size leads to improved performance up to around 200 entries, after which there are diminishing returns.", "section": "C Influence of size of knowledge base to performance"}, {"figure_path": "4TlUE0ufiz/figures/figures_20_1.jpg", "caption": "Figure 4: Variation of different performance metrics with respect to the Target Success Rate (TSR). Each subplot compares KnowNo, Retrieval-Q-CoT, and Ours (Conformal) methods across various metrics. Introspective planning (Ours-Conformal) consistenty achieves the best tradeoff between performance metrics and Target Success Rate (TSR) across all comparisons.", "description": "This figure shows the performance comparison of three different methods: KnowNo, Retrieval-Q-CoT, and the proposed introspective planning method (Ours-Conformal) across various metrics, such as Success Rate, Help Rate, Exact Set Rate, etc., with respect to the target success rate.  The results indicate that the introspective planning method consistently achieves the best balance between high performance and a reasonable success rate.", "section": "5.1 Direct Prediction"}, {"figure_path": "4TlUE0ufiz/figures/figures_25_1.jpg", "caption": "Figure 3: Qualitative results on Safe Mobile Manipulation. We compared our approach with KnowNo [31], both using conformal prediction with an 85% target success rate. Our method generates explanations via introspective planning before applying conformal prediction, whereas KnowNo directly predicts valid options using conformal prediction. We observed that KnowNo over-step in the left case and over-ask in the right case while IntroPlan generates more precise prediction sets.", "description": "This figure shows a qualitative comparison of the proposed Introspective Planning method and the KnowNo baseline on two examples from the Safe Mobile Manipulation dataset. Both methods use conformal prediction with a target success rate of 85%. The figure highlights that Introspective Planning produces more precise prediction sets compared to KnowNo by generating explanations through introspective reasoning before applying conformal prediction. KnowNo, on the other hand, directly predicts valid options using conformal prediction, leading to over-stepping and over-asking in certain scenarios.", "section": "4 Evaluation"}, {"figure_path": "4TlUE0ufiz/figures/figures_26_1.jpg", "caption": "Figure 2: Demonstration of using conformal prediction with Introspective Planning. After generating multiple options, we query the LLM for the explanation by introspective planning and then ask the model to predict the most correct option. Based on the likelihood scores of true intents from a calibration dataset, conformal prediction finds the quantile value ĝ (0.85), and includes any options scoring above ≥ 1 – ĝ = 0.15 in the prediction set for each test scenario. This method guarantees the correct answer is included among the options, at a confidence level specified by the user.", "description": "This figure illustrates the introspective conformal prediction process.  It starts with the LLM generating multiple options for a task.  Introspective planning provides rationale for each option.  Then, conformal prediction uses likelihood scores from a calibration dataset to determine a threshold (ĝ). Options with scores above this threshold (1-ĝ) are included in the prediction set. This ensures a high probability that the correct option is included, offering a statistically guaranteed confidence level for the robot's action.", "section": "3 Introspective Conformal Prediction"}]