[{"figure_path": "4TlUE0ufiz/tables/tables_2_1.jpg", "caption": "Table 1: GPT-4 Results for Safe Mobile Manipulation. SR: Success rate, HR: Help rate, OAR: Over-Ask rate, OSR: Over-Step rate, UR: Unsafe rate, ESR: Exact Set Rate, NCR: Noncompliance contamination rate, UCR: Unsafe contamination rate. Conformal means conformal prediction and Direct means direct prediction. All the others use direct prediction. The target success rate for conformal prediction is 85%. All numbers are reported in percentages.", "description": "This table presents the results of the Safe Mobile Manipulation experiment using GPT-4, comparing different methods: KnowNo (with conformal prediction), Prompt Set, Prompt Set + CoT, Retrieval-Q-CoT, Auto-CoT, and the proposed method (both with and without conformal prediction).  Metrics include success rate (SR), help rate (HR), over-ask rate (OAR), over-step rate (OSR), unsafe rate (UR), exact set rate (ESR), non-compliant contamination rate (NCR), and unsafe contamination rate (UCR).  The target success rate for conformal prediction methods was set to 85%.  The table highlights the performance differences between using direct prediction versus conformal prediction, showcasing the tradeoff between accuracy and confidence guarantees.", "section": "5 Results"}, {"figure_path": "4TlUE0ufiz/tables/tables_3_1.jpg", "caption": "Table 1: GPT-4 Results for Safe Mobile Manipulation. SR: Success rate, HR: Help rate, OAR: Over-Ask rate, OSR: Over-Step rate, UR: Unsafe rate, ESR: Exact Set Rate, NCR: Noncompliance contamination rate, UCR: Unsafe contamination rate. Conformal means conformal prediction and Direct means direct prediction. All the others use direct prediction. The target success rate for conformal prediction is 85%. All numbers are reported in percentages.", "description": "This table presents the results of the Safe Mobile Manipulation experiment using GPT-4, comparing different methods (KnowNo, Prompt Set, Prompt Set + CoT, Retrieval-Q-CoT, Auto-CoT, Ours (Conformal), Ours (Direct)).  It shows success rate (SR), help rate (HR), over-ask rate (OAR), overstep rate (OSR), unsafe rate (UR), exact set rate (ESR), non-compliant contamination rate (NCR), and unsafe contamination rate (UCR) for each method.  The target success rate for the conformal prediction methods was 85%.  All values are percentages.", "section": "5.1 Direct Prediction"}, {"figure_path": "4TlUE0ufiz/tables/tables_6_1.jpg", "caption": "Table 1: GPT-4 Results for Safe Mobile Manipulation. SR: Success rate, HR: Help rate, OAR: Over-Ask rate, OSR: Over-Step rate, UR: Unsafe rate, ESR: Exact Set Rate, NCR: Noncompliance contamination rate, UCR: Unsafe contamination rate. Conformal means conformal prediction and Direct means direct prediction. All the others use direct prediction. The target success rate for conformal prediction is 85%. All numbers are reported in percentages.", "description": "This table presents the performance comparison of different methods on the Safe Mobile Manipulation task using GPT-4.  It shows various metrics such as Success Rate (SR), Help Rate (HR), Over-Ask Rate (OAR), Over-Step Rate (OSR), Unsafe Rate (UR), Exact Set Rate (ESR), Noncompliance Contamination Rate (NCR), and Unsafe Contamination Rate (UCR).  The methods compared include KnowNo (with conformal prediction), Prompt Set, Prompt Set + CoT, Retrieval-Q-CoT, Auto-CoT, and the proposed method (both with and without conformal prediction). The target success rate for conformal methods was set to 85%.  All values are percentages.", "section": "5 Results"}, {"figure_path": "4TlUE0ufiz/tables/tables_13_1.jpg", "caption": "Table 1: GPT-4 Results for Safe Mobile Manipulation. SR: Success rate, HR: Help rate, OAR: Over-Ask rate, OSR: Over-Step rate, UR: Unsafe rate, ESR: Exact Set Rate, NCR: Noncompliance contamination rate, UCR: Unsafe contamination rate. Conformal means conformal prediction and Direct means direct prediction. All the others use direct prediction. The target success rate for conformal prediction is 85%. All numbers are reported in percentages.", "description": "This table presents the performance comparison of different methods on the Safe Mobile Manipulation task using GPT-4.  The methods are compared using several metrics including Success Rate (SR), Help Rate (HR), Over-Ask Rate (OAR), Over-Step Rate (OSR), Unsafe Rate (UR), Exact Set Rate (ESR), Noncompliant Contamination Rate (NCR), and Unsafe Contamination Rate (UCR).  The table highlights the performance of the proposed \"Ours\" method (both with and without conformal prediction) in comparison to baseline methods such as KnowNo, Prompt Set, Prompt Set + CoT, Retrieval-Q-CoT, and Auto-CoT.", "section": "5 Results"}, {"figure_path": "4TlUE0ufiz/tables/tables_13_2.jpg", "caption": "Table 1: GPT-4 Results for Safe Mobile Manipulation. SR: Success rate, HR: Help rate, OAR: Over-Ask rate, OSR: Over-Step rate, UR: Unsafe rate, ESR: Exact Set Rate, NCR: Noncompliance contamination rate, UCR: Unsafe contamination rate. Conformal means conformal prediction and Direct means direct prediction. All the others use direct prediction. The target success rate for conformal prediction is 85%. All numbers are reported in percentages.", "description": "This table presents the performance comparison of different methods on the Safe Mobile Manipulation task using GPT-4.  The methods are evaluated based on several metrics including Success Rate (SR), Help Rate (HR), Over-Ask Rate (OAR), Over-Step Rate (OSR), Unsafe Rate (UR), Exact Set Rate (ESR), Non-compliant Contamination Rate (NCR), and Unsafe Contamination Rate (UCR).  The table highlights the performance of the proposed method (Ours) using both direct and conformal prediction, comparing it to several baselines.  The target success rate for the conformal prediction methods is 85%.", "section": "5 Results"}, {"figure_path": "4TlUE0ufiz/tables/tables_13_3.jpg", "caption": "Table 4: GPT-3.5 Results for further studies on Mobile Manipulation. All Unambiguous: Datasets contain only unambiguous instructions. All Ambiguous: Datasets contain only ambiguous instructions. Novel Data: Novel data that contains unseen objects and instructions. SR: Success rate, HR: Help rate, ESR: Exact Set Rate. Conformal means conformal prediction and Direct means direct prediction. The target success rate for conformal prediction is 85%. All the others use direct prediction. All numbers are reported in percentages.", "description": "This table presents the results of GPT-3.5 model performance on three different datasets of mobile manipulation tasks: one with only unambiguous instructions, one with only ambiguous instructions, and one with novel, unseen objects and instructions.  It compares the success rate (SR), help rate (HR), and exact set rate (ESR) of various methods, including the proposed introspective planning with direct prediction,  and baselines like KnowNo using conformal prediction, Prompt Set with or without Chain of Thought, and Retrieval-Q-CoT. The results reveal the model's ability to handle various levels of ambiguity and generalization to new situations.", "section": "4.2 Datasets"}, {"figure_path": "4TlUE0ufiz/tables/tables_14_1.jpg", "caption": "Table 1: GPT-4 Results for Safe Mobile Manipulation. SR: Success rate, HR: Help rate, OAR: Over-Ask rate, OSR: Over-Step rate, UR: Unsafe rate, ESR: Exact Set Rate, NCR: Noncompliance contamination rate, UCR: Unsafe contamination rate. Conformal means conformal prediction and Direct means direct prediction. All the others use direct prediction. The target success rate for conformal prediction is 85%. All numbers are reported in percentages.", "description": "This table presents the performance comparison of different methods on the Safe Mobile Manipulation task using GPT-4.  It shows various metrics including Success Rate (SR), Help Rate (HR), Over-Ask Rate (OAR), Over-Step Rate (OSR), Unsafe Rate (UR), Exact Set Rate (ESR), Non-compliant Contamination Rate (NCR), and Unsafe Contamination Rate (UCR).  The methods compared include KnowNo (with conformal prediction), Prompt Set, Prompt Set + CoT, Retrieval-Q-CoT, Auto-CoT, and the proposed method (Ours) with both conformal and direct prediction.  The target success rate for conformal prediction methods is 85%. All values are percentages.", "section": "5 Results"}, {"figure_path": "4TlUE0ufiz/tables/tables_14_2.jpg", "caption": "Table 6: GPT-4 Results for further studies on Mobile Manipulation. All Unambiguous: Datasets contain only unambiguous instructions. All Ambiguous: Datasets contain only ambiguous instructions. Novel Data: Noval data that contains unseen objects and instructions. SR: Success rate, HR: Help rate, ESR: Exact Success Set Prediction Rate. Conformal means conformal prediction and Direct means direct prediction. The target success rate for conformal prediction is 85%. All the others use direct prediction. All numbers are reported in percentages.", "description": "This table presents the results of further studies on mobile manipulation using GPT-4, categorized into three datasets: all unambiguous instructions, all ambiguous instructions, and novel data with unseen objects and instructions.  It compares different methods (KnowNo (Conformal), Prompt Set, Prompt Set + CoT, Retrieval-Q-CoT, Auto-CoT, and Ours (Direct)) across success rate (SR), help rate (HR), and exact set rate (ESR).  The target success rate for the conformal methods is 85%, while direct prediction methods don't have a target success rate.  All values are percentages.", "section": "5 Results"}, {"figure_path": "4TlUE0ufiz/tables/tables_14_3.jpg", "caption": "Table 7: GPT-4 Results on Safe Mobile Manipulation with only safety-critical scenarios. SR: Success rate, HR: Help rate, ESR: Exact Success Set Prediction Rate, NCR: Noncompliance contamination rate, UCR: Unsafe contamination rate. Conformal means conformal prediction and Direct means direct prediction. The target success rate for conformal prediction is 85%. All the others use direct prediction. All numbers are reported in percentages.", "description": "This table presents the results of the experiments using GPT-4 on a dataset focusing on safety-critical scenarios.  It compares different methods: KnowNo (using conformal prediction), Prompt Set, Prompt Set + Chain of Thought, Retrieval-Q-CoT, Auto-CoT, and the proposed 'Ours' method (with both direct and conformal prediction). The metrics evaluated include Success Rate (SR), Help Rate (HR), Exact Set Rate (ESR), Non-compliant Contamination Rate (NCR), and Unsafe Contamination Rate (UCR).  The target success rate for the conformal prediction methods is 85%.", "section": "5 Results"}, {"figure_path": "4TlUE0ufiz/tables/tables_18_1.jpg", "caption": "Table 1: GPT-4 Results for Safe Mobile Manipulation. SR: Success rate, HR: Help rate, OAR: Over-Ask rate, OSR: Over-Step rate, UR: Unsafe rate, ESR: Exact Set Rate, NCR: Noncompliance contamination rate, UCR: Unsafe contamination rate. Conformal means conformal prediction and Direct means direct prediction. All the others use direct prediction. The target success rate for conformal prediction is 85%. All numbers are reported in percentages.", "description": "This table presents the results of the GPT-4 model for the Safe Mobile Manipulation task.  It compares different methods (KnowNo, Prompt Set, Prompt Set + CoT, Retrieval-Q-CoT, Auto-CoT, Ours (Conformal), and Ours (Direct)) across several metrics: Success Rate (SR), Help Rate (HR), Over-Ask Rate (OAR), Over-Step Rate (OSR), Unsafe Rate (UR), Exact Set Rate (ESR), Non-compliance Contamination Rate (NCR), and Unsafe Contamination Rate (UCR).  The \"Conformal\" methods used conformal prediction with a target success rate of 85%, while the others used direct prediction.  The table helps assess the effectiveness of each method in terms of accuracy, efficiency, safety, and compliance with user instructions.", "section": "5 Results"}]