[{"figure_path": "ShJWT0n7kX/figures/figures_8_1.jpg", "caption": "Figure 2: Comparing path histograms and trajectories of TPS using fixed-length two-way shooting and comparing it with our variational approach.", "description": "This figure compares the results of transition path sampling using two different methods:  Markov Chain Monte Carlo (MCMC) with fixed-length two-way shooting and the proposed variational approach. The left panel (a) shows the results from the MCMC method, while the right panel (b) shows the results from the proposed method. Both panels show histograms and representative trajectories (paths) generated by the respective methods. The figure visually demonstrates that the variational method can achieve comparable performance to the MCMC method, especially in terms of sampling trajectories that successfully transition between the initial and final states.", "section": "5 Experiments"}, {"figure_path": "ShJWT0n7kX/figures/figures_8_2.jpg", "caption": "Figure 3: Illustration of the expressivity of unimodal Gaussian versus mixture of Gaussian paths on a symmetric potential with two transition path modes.", "description": "This figure compares the performance of unimodal Gaussian and mixture of Gaussian paths for modeling transition paths on a symmetric double-well potential.  The left panel (a) shows the results obtained using a single Gaussian, highlighting its limitations in capturing the two distinct transition pathways. The right panel (b) demonstrates the improved expressiveness of using a mixture of Gaussians, effectively representing both pathways and showcasing its ability to handle more complex transition path scenarios.", "section": "5.1 Synthetic Datasets"}, {"figure_path": "ShJWT0n7kX/figures/figures_9_1.jpg", "caption": "Figure 4: Transition path for the protein Chignolin. The energy plot of a transition path in which the protein folds in T = 1,000 fs, and passes a high energy barrier at 460 fs with about 3,000 kJ/mol.", "description": "This figure shows a transition path for the protein Chignolin. The top panel displays the 3D structure of the protein at various points along the trajectory, illustrating its folding process. The bottom panel shows a plot of the potential energy (U(x)) of the protein as a function of time (fs), clearly indicating a high energy barrier around 460 fs before the protein reaches the final folded state at 1000 fs.", "section": "5 Experiments"}, {"figure_path": "ShJWT0n7kX/figures/figures_22_1.jpg", "caption": "Figure 2: Comparing path histograms and trajectories of TPS using fixed-length two-way shooting and comparing it with our variational approach.", "description": "This figure compares the results of transition path sampling using two different methods: a traditional fixed-length two-way shooting method and the novel variational approach proposed in the paper. The left panel shows histograms of the paths generated by both methods, while the right panel displays example trajectories. The figure visually demonstrates that the variational approach produces a similar distribution of paths with fewer computational evaluations.", "section": "5.1 Synthetic Datasets"}, {"figure_path": "ShJWT0n7kX/figures/figures_22_2.jpg", "caption": "Figure 2: Comparing path histograms and trajectories of TPS using fixed-length two-way shooting and comparing it with our variational approach.", "description": "This figure compares the path histograms and trajectories generated by the proposed variational approach with those obtained using fixed-length two-way shooting. The left panel shows the histogram of paths, while the right panel displays example trajectories. This comparison highlights the efficiency and accuracy of the variational approach in capturing the conditional distribution over transition paths.", "section": "5.1 Synthetic Datasets"}, {"figure_path": "ShJWT0n7kX/figures/figures_23_1.jpg", "caption": "Figure 7: We compare the Wasserstein W1 distance between the marginals with different parameterization techniques of μt|0,T, Σt|0,T.", "description": "The figure compares three different parameterization techniques for the mean and covariance matrix of a Gaussian distribution used to approximate transition paths: linear spline, cubic spline, and a neural network.  The Wasserstein W1 distance is used to measure the difference between the learned marginal distribution and the marginal distribution obtained from a fixed-length two-way shooting method (considered the ground truth). The plot shows that the neural network provides the best approximation, with the cubic spline performing better than the linear spline. This highlights the advantage of using neural networks for increased expressivity and accuracy in capturing complex probability distributions of transition paths.", "section": "D.3 Neural Network Ablation Study"}, {"figure_path": "ShJWT0n7kX/figures/figures_24_1.jpg", "caption": "Figure 8: Transition path for the alanine dipeptide.", "description": "This figure visualizes a transition path for the alanine dipeptide molecule.  It shows a sequence of molecular conformations along a transition path, highlighting the changes in the molecule's structure as it transitions between states. The figure is part of a study using a novel variational approach to transition path sampling, and helps illustrate the ability of the method to generate plausible transition paths.", "section": "5 Experiments"}, {"figure_path": "ShJWT0n7kX/figures/figures_24_2.jpg", "caption": "Figure 9: In this figure, we compare the quality of paths based on the current training step (i.e., potential evaluations). We observe that with increasing training time, paths with higher likelihood are sampled.", "description": "This figure shows the maximum energy of the sampled paths during training as a function of the number of potential energy evaluations.  The plot demonstrates that as training progresses (more potential energy evaluations are performed), the maximum energy along the generated paths decreases. This indicates that the model is learning to generate more realistic and likely transition paths with lower energy barriers. The decreasing trend suggests improved sampling of low-energy paths.", "section": "D.4 Molecular Systems"}, {"figure_path": "ShJWT0n7kX/figures/figures_24_3.jpg", "caption": "Figure 10: Visualization of the loss for different training setups. These setups are identical to what has been reported in Table 2.", "description": "This figure shows the training loss curves for different model configurations.  The models use either Cartesian or internal coordinates, and with either a single Gaussian or a mixture of two Gaussians to represent the probability distribution of the transition paths. The plot shows that using a mixture of Gaussians can help decrease the overall loss, but all the variations converge to a similar loss value. This observation suggests that while mixture models show some benefit, there may be a limit to how much they improve the model's performance.", "section": "Experiments"}]