[{"figure_path": "uLGyoBn7hm/tables/tables_1_1.jpg", "caption": "Table 1: A non-exhaustive list of identifiability results given knowledge of the latent graph.", "description": "This table compares various works in causal disentangled representation learning, highlighting their assumptions, input data types (observational and interventional), handling of multiple domains, and the identifiability goals achieved.  It shows whether each work considers non-Markovian settings, utilizes non-parametric methods, requires specific input interventions, and addresses multiple data domains.  The 'Distr. Reqs' column indicates the number of distributions required for identifiability results.  Finally, the 'Identifiability Goal' column indicates the level of disentanglement achieved, ranging from full disentanglement to functional dependency maps.", "section": "1 Introduction"}, {"figure_path": "uLGyoBn7hm/tables/tables_16_1.jpg", "caption": "Table 1: A non-exhaustive list of identifiability results given knowledge of the latent graph.", "description": "This table compares various works in causal disentangled representation learning. Each row represents a different work, showing its assumptions about the data distribution, the type of interventions allowed, whether it handles multiple domains, and its identifiability results. The assumptions column specifies whether the work assumes a Markovian or non-Markovian causal setting, whether it uses parametric or non-parametric models, and whether it allows for interventions. The data column indicates whether the work uses observational data only, interventional data only, or a combination of both.  The identifiability goal column specifies whether the work aims to achieve full disentanglement or a more relaxed version of disentanglement.  The output column describes the type of output produced by the algorithm, such as a scaling, mixture, or affine transformation of the latent variables.", "section": "1 Introduction"}, {"figure_path": "uLGyoBn7hm/tables/tables_20_1.jpg", "caption": "Table 1: A non-exhaustive list of identifiability results given knowledge of the latent graph.", "description": "This table compares various existing works on causal identifiability in the context of disentangled representation learning. Each row represents a different work, showing the assumptions made (e.g., whether the causal system is Markovian or non-Markovian, whether the distributions are parametric or non-parametric, and whether multiple domains are considered), the type of input data used, and the type of output obtained (e.g., identifiability of the latent variables, or a causal disentanglement map). This table helps to illustrate how the proposed work in the paper builds upon and extends previous work by considering more general assumptions (non-Markovian causal settings, arbitrary distributions from multiple domains), and a more relaxed version of disentanglement.", "section": "1 Introduction"}, {"figure_path": "uLGyoBn7hm/tables/tables_22_1.jpg", "caption": "Table 1: A non-exhaustive list of identifiability results given knowledge of the latent graph.", "description": "This table summarizes existing identifiability results in causal representation learning under various assumptions (Markovian/non-Markovian, parametric/non-parametric) and input data (multiple domains, interventions).  Each row represents a different study, indicating the assumptions made and the identifiability goals achieved (e.g., full disentanglement, scaling transformations). The table highlights the differences in assumptions and results among various studies and provides context for the current work's contributions.", "section": "1 Introduction"}, {"figure_path": "uLGyoBn7hm/tables/tables_25_1.jpg", "caption": "Table 1: A non-exhaustive list of identifiability results given knowledge of the latent graph.", "description": "This table compares different works in disentangled causal representation learning based on several criteria.  These include whether the work handles non-Markovian settings, uses nonparametric distributions, incorporates interventions, and considers multiple domains.  The table also notes the assumptions made by each work (e.g., type of distribution, independence assumptions), what type of data was used, the identifiability goal (e.g., full disentanglement, scaling, etc.), and the type of output produced (e.g., functional dependency map, causal disentanglement map). The table shows that this paper is the first to handle non-Markovian settings, arbitrary distributions across multiple domains, and a relaxed version of disentanglement.", "section": "1 Introduction"}]