[{"figure_path": "nfK0ZXFFSn/tables/tables_5_1.jpg", "caption": "Table 1: Main results. Comparison with competitive hallucination detection methods on different datasets. All values are percentages (AUROC). “Single sampling” indicates whether the approach requires multiple generations during inference. Bold numbers are superior results.", "description": "This table presents the Area Under the ROC Curve (AUROC) scores for various hallucination detection methods across four different datasets.  The methods are categorized into several approaches (uncertainty-based, consistency-based, prompting-based, and knowledge discovery-based) and compared against the proposed HaloScope method. The table shows the performance of each method on two different language models (LLaMA-2-7b and OPT-6.7b) and indicates whether the method requires multiple generations during inference.", "section": "4.2 Main Results"}, {"figure_path": "nfK0ZXFFSn/tables/tables_6_1.jpg", "caption": "Table 2: Main results. Comparison with competitive hallucination detection methods on different datasets. All values are percentages (AUROC). “Single sampling” indicates whether the approach requires multiple generations during inference. Bold numbers are superior results.", "description": "This table presents the Area Under the ROC Curve (AUROC) scores for various hallucination detection methods on four different datasets: TRUTHFULQA, TRIVIAQA, COQA, and TYDIQA-GP.  The methods are compared using two different language models: LLaMA-2 and OPT, each with two different sizes (7B and 13B parameters). The table also indicates whether each method uses single sampling or multiple generations during inference.  Higher AUROC values indicate better performance.", "section": "4.2 Main Results"}, {"figure_path": "nfK0ZXFFSn/tables/tables_7_1.jpg", "caption": "Table 3: Hallucination detection results on different representation locations of multi-head attention.", "description": "This table presents the Area Under the ROC Curve (AUROC) scores for hallucination detection using different embedding locations within the multi-head attention (MHA) architecture of LLMs.  It compares performance across two models (LLaMA-2-chat-7b and OPT-6.7b) and two datasets (TRUTHFULQA and TYDIQA-GP). The three embedding locations are: the output of the transformer block (f), the output of the self-attention module (Attn(f)), and the output of the feedforward layer (Q Attn(f)). The results show variation in performance depending on the model and embedding location.", "section": "4.4 Ablation Study"}, {"figure_path": "nfK0ZXFFSn/tables/tables_7_2.jpg", "caption": "Table 4: Hallucination detection results on different membership estimation scores.", "description": "This table presents the results of an ablation study on different design choices for the membership estimation score in the HaloScope model.  It compares the performance of three different score designs: a non-weighted score, a score that sums up layer-wise scores, and the HaloScope model's proposed score (which uses a weighted sum of singular vectors). The results are shown for two different LLMs (LLaMA-2-chat-7b and OPT-6.7b) and two datasets (TRUTHFULQA and TydiQA-GP).  The table demonstrates that HaloScope's proposed score significantly outperforms the other approaches, highlighting the effectiveness of its design choices.", "section": "4.4 Ablation Study"}, {"figure_path": "nfK0ZXFFSn/tables/tables_15_1.jpg", "caption": "Table 5: Main results with Rouge-L metric. Comparison with competitive hallucination detection methods on different datasets. All values are percentages. \"Single sampling\" indicates whether the approach requires multiple generations during inference. Bold numbers are superior results.", "description": "This table compares the performance of HaloScope against several other hallucination detection methods using the Rouge-L metric for evaluating the similarity between generated text and ground truth.  It shows the Area Under the ROC Curve (AUROC) scores for each method on two datasets: TRUTHFULQA and TYDIQA-GP. The \"Single sampling\" column indicates whether a method requires multiple generations during inference.  Bold numbers highlight the best performing methods on each dataset.", "section": "4.1 Setup"}, {"figure_path": "nfK0ZXFFSn/tables/tables_15_2.jpg", "caption": "Table 6: Results with a different random split of the dataset. Comparison with competitive hallucination detection methods on different datasets. All values are percentages. “Single sampling” indicates whether the approach requires multiple generations during inference. Bold numbers are superior results.", "description": "This table presents the results of a hallucination detection experiment using a different random dataset split.  It compares HaloScope's performance against several baseline methods on two datasets, TRUTHFULQA and TYDIQA-GP. The table shows the Area Under the Receiver Operating Characteristic curve (AUROC) for each method, indicating its ability to distinguish between truthful and hallucinated generations.  The \"Single sampling\" column indicates whether each method uses a single generation or multiple generations during testing.", "section": "4.1 Setup"}, {"figure_path": "nfK0ZXFFSn/tables/tables_16_1.jpg", "caption": "Table 7: Hallucination detection result under different sampling strategies. Results are based on the LLaMA-2-chat-7b model.", "description": "This table presents the results of a study comparing two different sampling methods used for identifying hallucination subspaces in the HaloScope model.  The methods are multinomial sampling and greedy sampling (the authors' approach). The table shows that the greedy sampling method resulted in slightly better performance (higher AUROC scores) for both the TRUTHFULQA and TYDIQA-GP datasets, when using the LLaMA-2-chat-7b model. This suggests that the greedy sampling strategy might be more effective for the subspace identification task within the HaloScope framework. ", "section": "4.2 Main Results"}, {"figure_path": "nfK0ZXFFSn/tables/tables_16_2.jpg", "caption": "Table 8: The number of the LLM generations and its effect on the hallucination detection result.", "description": "This table shows the impact of the number of unlabeled LLM generations used for training the hallucination detection model.  The AUROC (Area Under the Receiver Operating Characteristic curve) scores for TRUTHFULQA are presented for different sample sizes (N) ranging from 100 to 512. The results indicate that a larger sample size generally leads to improved performance, although the effect is not strictly monotonic.", "section": "4.2 Main Results"}, {"figure_path": "nfK0ZXFFSn/tables/tables_16_3.jpg", "caption": "Table 9: Hallucination detection results leveraging other uncertainty scores.", "description": "This table compares the performance of HaloScope against other methods using different uncertainty scores for filtering the unlabeled data before training the truthfulness classifier.  The results show that HaloScope achieves significantly better performance (higher AUROC) on both the TRUTHFULQA and TYDIQA-GP datasets than the baselines (Semantic Entropy, SelfCKGPT, and CCS*).", "section": "4.4 Ablation Study"}, {"figure_path": "nfK0ZXFFSn/tables/tables_17_1.jpg", "caption": "Table 10: Hallucination detection results on different tasks.", "description": "This table presents the performance of HaloScope and baseline methods on two additional tasks: text continuation and text summarization.  It shows the area under the ROC curve (AUROC) for each method on each task, demonstrating that HaloScope outperforms the baselines on both tasks. The results highlight the generalizability of HaloScope to various NLG tasks.", "section": "4.4 Ablation Study"}]