[{"figure_path": "loQCk0qruU/tables/tables_7_1.jpg", "caption": "Table 1: Prediction accuracy and ECE performance on few-shot adaptation", "description": "This table presents the prediction accuracy and expected calibration error (ECE) for different few-shot learning scenarios across four benchmark datasets (Cifar10, Cifar100, Food101, Flowers102).  The results are broken down by the number of shots (1, 2, 5, 10, 20) and show the performance of four model types: a standard model, an evidential model, a calibrated evidential model (base-rate adjusted), and the proposed Bayesian-PEFT model. This allows for a comparison of the calibration and accuracy improvements achieved by each method.", "section": "4 Experiments and Results"}, {"figure_path": "loQCk0qruU/tables/tables_7_2.jpg", "caption": "Table 1: Prediction accuracy and ECE performance on few-shot adaptation", "description": "This table presents the prediction accuracy and Expected Calibration Error (ECE) for different few-shot learning scenarios across four datasets (Cifar10, Cifar100, Food101, Flowers102).  Results are shown for a standard model, an evidential model, a calibrated evidential model (with base rate adjustment), and the proposed B-PEFT model.  The number of shots (K) varies from 1 to 20, demonstrating the performance across different adaptation levels.", "section": "4 Experiments and Results"}, {"figure_path": "loQCk0qruU/tables/tables_8_1.jpg", "caption": "Table 1: Prediction accuracy and ECE performance on few-shot adaptation", "description": "This table presents the prediction accuracy and expected calibration error (ECE) for different few-shot learning scenarios across four datasets (Cifar10, Cifar100, Food101, Flowers102).  Results are shown for a standard model, an evidential model, a base-rate adjusted evidential model, and the proposed Bayesian-PEFT model.  The table compares the performance of different models under various shot settings (1-shot, 2-shot, 5-shot, 10-shot, 20-shot), highlighting the impact of the proposed Bayesian framework on improving both accuracy and calibration.", "section": "4 Experiments and Results"}, {"figure_path": "loQCk0qruU/tables/tables_8_2.jpg", "caption": "Table 1: Prediction accuracy and ECE performance on few-shot adaptation", "description": "This table presents the prediction accuracy and expected calibration error (ECE) for different few-shot learning scenarios using various models.  It compares the performance of a standard model, an evidential model, a calibrated evidential model (with base rate adjustment), and the proposed Bayesian-PEFT (B-PEFT) model.  The results are shown for different datasets (Cifar10, Cifar100, Food101, Flowers102) and varying numbers of shots (1, 2, 5, 10, 20).  It demonstrates the improved calibration performance of the Bayesian-PEFT model across different settings.", "section": "4 Experiments and Results"}, {"figure_path": "loQCk0qruU/tables/tables_16_1.jpg", "caption": "Table 1: Prediction accuracy and ECE performance on few-shot adaptation", "description": "This table presents a comparison of prediction accuracy and Expected Calibration Error (ECE) across various few-shot learning scenarios (1-shot, 2-shot, 5-shot, 10-shot, and 20-shot) and four different datasets (Cifar10, Cifar100, Food101, and Flowers102).  The results are broken down for four model types: the standard model (baseline), an evidential model, a calibrated evidential model (with base-rate adjustment), and the proposed Bayesian-PEFT model.  The table illustrates the effectiveness of Bayesian-PEFT in achieving significantly higher accuracy and substantially lower ECE (better calibration) across all datasets and shot scenarios compared to other methods.", "section": "4 Experiments and Results"}, {"figure_path": "loQCk0qruU/tables/tables_21_1.jpg", "caption": "Table 1: Prediction accuracy and ECE performance on few-shot adaptation", "description": "This table shows the prediction accuracy and expected calibration error (ECE) for different few-shot learning settings (1-shot, 2-shot, 5-shot, 10-shot, and 20-shot) across four datasets (Cifar10, Cifar100, Food101, and Flowers102).  The results are presented for a standard model, an evidential model, a calibrated evidential model (with base rate adjustment), and the proposed B-PEFT model.  This allows for a comparison of the performance and calibration of different models under various few-shot scenarios.", "section": "4 Experiments and Results"}, {"figure_path": "loQCk0qruU/tables/tables_22_1.jpg", "caption": "Table 1: Prediction accuracy and ECE performance on few-shot adaptation", "description": "This table presents the prediction accuracy and expected calibration error (ECE) of different models on various few-shot adaptation tasks.  It compares the performance of a standard model, an evidential model, a calibrated evidential model (with base rate adjustment), and the proposed Bayesian-PEFT model (B-PEFT). Results are shown for four datasets (Cifar10, Cifar100, Food101, Flowers102) and various shot settings (1-shot, 2-shot, 5-shot, 10-shot, 20-shot).  The table highlights the improved calibration and accuracy achieved by the Bayesian-PEFT model.", "section": "4 Experiments and Results"}, {"figure_path": "loQCk0qruU/tables/tables_24_1.jpg", "caption": "Table 1: Prediction accuracy and ECE performance on few-shot adaptation", "description": "This table presents a comparison of prediction accuracy and Expected Calibration Error (ECE) across different few-shot learning scenarios (1-shot to 20-shot) using various models.  The models include a standard model, an evidential model, a calibrated evidential model (with base rate adjustment), and the proposed Bayesian-PEFT model. The results are shown for four different datasets: Cifar10, Cifar100, Food101, and Flowers102.  This allows for a comprehensive evaluation of the different models under various data conditions and training regimes, highlighting the effectiveness of Bayesian-PEFT in improving both accuracy and calibration.", "section": "4 Experiments and Results"}, {"figure_path": "loQCk0qruU/tables/tables_24_2.jpg", "caption": "Table 1: Prediction accuracy and ECE performance on few-shot adaptation", "description": "This table presents a comparison of prediction accuracy and expected calibration error (ECE) across four datasets (Cifar10, Cifar100, Food101, Flowers102) and different numbers of training shots (1, 2, 5, 10, 20) for various models: a standard model, an evidential model, a calibrated evidential model (with base rate adjustment), and the proposed B-PEFT model.  It demonstrates the impact of the proposed Bayesian adjustments on improving both accuracy and calibration, particularly in few-shot scenarios.", "section": "4 Experiments and Results"}, {"figure_path": "loQCk0qruU/tables/tables_25_1.jpg", "caption": "Table 1: Prediction accuracy and ECE performance on few-shot adaptation", "description": "This table presents the prediction accuracy and expected calibration error (ECE) for different few-shot learning settings (1-shot, 2-shot, 5-shot, 10-shot, 20-shot) across four datasets (CIFAR-10, CIFAR-100, Food101, Flowers102).  It compares the performance of four different models: a standard model, an evidential model, a base-rate adjusted evidential model, and the proposed B-PEFT model.  The results show the effect of different model architectures and calibration techniques on both prediction accuracy and uncertainty calibration.", "section": "4 Experiments and Results"}, {"figure_path": "loQCk0qruU/tables/tables_25_2.jpg", "caption": "Table 9: 5-Way 1-Shot Mini-ImageNet", "description": "This table compares the accuracy of the proposed B-PEFT model against other meta-learning models on a 5-way 1-shot mini-ImageNet few-shot learning task.  It demonstrates the superior performance of B-PEFT compared to existing meta-learning approaches.", "section": "F.4 Few Shot Learning Results"}, {"figure_path": "loQCk0qruU/tables/tables_27_1.jpg", "caption": "Table 1: Prediction accuracy and ECE performance on few-shot adaptation", "description": "This table presents a comparison of prediction accuracy and Expected Calibration Error (ECE) across four different datasets (Cifar10, Cifar100, Food101, Flowers102) and five different shot settings (1, 2, 5, 10, 20 shots).  It compares the performance of four different model types: a standard model, an evidential model, a calibrated evidential model (with base rate adjustment), and the proposed Bayesian-PEFT model. The results show the impact of different model approaches and the effectiveness of the proposed Bayesian-PEFT model in improving both accuracy and calibration.", "section": "4 Experiments and Results"}, {"figure_path": "loQCk0qruU/tables/tables_27_2.jpg", "caption": "Table 1: Prediction accuracy and ECE performance on few-shot adaptation", "description": "This table presents the prediction accuracy and Expected Calibration Error (ECE) for different few-shot learning scenarios across four datasets (Cifar10, Cifar100, Food101, Flowers102).  The results are shown for a standard model, an evidential model, a calibrated evidential model (with base rate adjustment), and the proposed Bayesian-PEFT (B-PEFT) model. Different shot sizes (1, 2, 5, 10, 20) are compared, illustrating the performance of each model under various data limitations.", "section": "4 Experiments and Results"}, {"figure_path": "loQCk0qruU/tables/tables_27_3.jpg", "caption": "Table 1: Prediction accuracy and ECE performance on few-shot adaptation", "description": "This table presents a comparison of prediction accuracy and Expected Calibration Error (ECE) across different few-shot learning settings and methods.  The results are shown for four datasets (Cifar10, Cifar100, Food101, Flowers102) and across varying numbers of shots (1, 2, 5, 10, 20). It compares the performance of a standard model, an evidential model, a base-rate adjusted evidential model, and the proposed Bayesian-PEFT model.  The table shows that Bayesian-PEFT consistently outperforms the other methods across all datasets and settings, achieving higher accuracy and lower ECE.", "section": "4 Experiments and Results"}, {"figure_path": "loQCk0qruU/tables/tables_27_4.jpg", "caption": "Table 1: Prediction accuracy and ECE performance on few-shot adaptation", "description": "This table presents the prediction accuracy and expected calibration error (ECE) for different models on four datasets (Cifar10, Cifar100, Food101, Flowers102) under various few-shot learning settings (1, 2, 5, 10, and 20 shots).  It compares the performance of a standard model, an evidential model, a calibrated evidential model, and the proposed B-PEFT model. The results show the impact of different approaches on prediction accuracy and calibration, highlighting the effectiveness of B-PEFT in improving both metrics, especially under challenging few-shot scenarios.", "section": "4 Experiments and Results"}]