[{"figure_path": "r3c0WGCXgt/tables/tables_7_1.jpg", "caption": "Table 1: Ablation of proposed methods. FEC denotes Fourier enhancement convolution, GP signifies global perception in FEC, TS represents the two-stage generation framework, and IFE indicates inference Fourier enhancement.", "description": "This table presents the ablation study results of the proposed TextGen model. It shows the impact of each component (FEC, GP, TS, IFE) on the performance of both English and Chinese text generation tasks, measured by ACC (accuracy) and NED (normalized edit distance).  The results demonstrate the effectiveness of each component in improving the overall performance of the model.", "section": "4.3 Ablation Study"}, {"figure_path": "r3c0WGCXgt/tables/tables_7_2.jpg", "caption": "Table 2: Comparison with state-of-the-art methods. Data denotes the amount of data used in the training process. Our baseline is the AnyText-v1.0 [28] model trained on our TG-2M.", "description": "This table compares the performance of the proposed TextGen model against several state-of-the-art visual text generation methods.  The metrics used for comparison are sentence accuracy (ACC), normalized edit distance (NED), and Fréchet Inception Distance (FID).  The table highlights that TextGen achieves superior performance on both English and Chinese text generation, despite using a smaller training dataset (2.5M images) compared to some of the other models (10M images).", "section": "4.4 Comparison Results"}, {"figure_path": "r3c0WGCXgt/tables/tables_13_1.jpg", "caption": "Table 3: The statistics of our proposed TG-2M dataset.", "description": "This table presents a statistical summary of the TG-2M dataset, a multilingual dataset created for training visual text generation models. It breaks down the dataset's composition by language (English and Chinese), providing the image count, line count, average number of characters per line, and the percentage of lines containing fewer than 20 characters.  The total dataset size is also shown.", "section": "4.1 Datasets"}, {"figure_path": "r3c0WGCXgt/tables/tables_13_2.jpg", "caption": "Table 4: The comparison of performance on the complete dataset.", "description": "This table compares the performance of the proposed TextGen model with and without the two-stage generation framework.  The comparison is done using the metrics ACC (sentence accuracy) and NED (normalized edit distance) on both English and Chinese datasets.  The results show a slight improvement in performance when using the two-stage framework.", "section": "B Discussion about the Two-Stage Framework"}]