[{"figure_path": "DdKdr4kqxh/figures/figures_2_1.jpg", "caption": "Figure 1: Overview of the objective of this work. We are interested in identifying spatio-temporal relations between the measurable impacts of extremes like the vegetation health index and their drivers As drivers, we focus on anomalies in state variables of the land-atmosphere and hydrological cycle. The task is very challenging since the drivers can occur at a different region than the extreme event and earlier in time.", "description": "This figure illustrates the core challenge addressed in the paper: identifying the spatio-temporal relationships between extreme events (e.g., agricultural droughts) and their drivers.  The challenge stems from the fact that drivers (anomalies in atmospheric and hydrological variables) might occur at different locations and earlier in time than the measurable impact of the extreme event. The figure visually represents this spatio-temporal complexity, showing how drivers from various state variables across different time steps could lead to an extreme event at a later point.", "section": "1 Introduction"}, {"figure_path": "DdKdr4kqxh/figures/figures_3_1.jpg", "caption": "Figure 2: An overview of the proposed model to identify the spatio-temporal relations between extreme agricultural droughts and their drivers. The input variables are first encoded into features. In a subsequent step, a lockup free quantization layer (LFQ) takes the extracted features and classifies the variables into a binary representation of drivers, where we consider the drivers as anomalous events in the input variables. Finally, a classifier is used to predict impacts of extreme events from the identified drivers.", "description": "This figure shows the architecture of the proposed model for identifying spatio-temporal relations between extreme agricultural droughts and their drivers. The model consists of three main components: feature extraction, quantization, and classification.  The feature extraction component encodes the input variables (e.g., volumetric soil moisture, 2m temperature) into features. The quantization component classifies these features into binary representations of drivers (anomalous events in the input variables). Finally, a classifier predicts impacts of extreme events based on the identified drivers. The model is trained end-to-end on observed extremes (agricultural droughts) to predict future extremes based on the identified drivers.", "section": "3 Method"}, {"figure_path": "DdKdr4kqxh/figures/figures_7_1.jpg", "caption": "Figure 3: Qualitative results on the synthetic CERRA reanalysis from the test set at time step 2160.  is the prediction, is the ground truth, and is the false positive. Albedo and relative humidity are not correlated with extremes, meaning that they do not contain drivers, but only random anomalies.", "description": "This figure shows a qualitative comparison of different methods for identifying spatio-temporal drivers of extreme events.  The top row displays the ground truth (synthetic CERRA reanalysis data) for six variables. Subsequent rows show the predictions of several methods (Integrated Gradients I, Integrated Gradients II, OCSVM, IF, SimpleNet, STEALNet, UniAD, RTFM, DeepMIL, ARNet, and the proposed method), visualizing detected drivers as red pixels and false positives as teal pixels. The results demonstrate the proposed model's superior performance in accurately identifying spatio-temporal drivers correlated with extreme events (agricultural drought), especially when compared to other baselines which struggle with false positives or fail to capture the spatio-temporal relationships.", "section": "5.1 Experiments on the synthetic datasets"}, {"figure_path": "DdKdr4kqxh/figures/figures_7_2.jpg", "caption": "Figure 4: F1-score with different correlation settings between the input variables and extremes.", "description": "This figure shows the F1-score achieved by different anomaly detection methods under varying levels of correlation between input variables and extreme events. The x-axis represents the number of variables correlated with extreme events, ranging from 1/6 to 6/6.  The y-axis shows the F1-score. The plot demonstrates how the performance of each method changes as the correlation between variables and extremes increases. This helps to evaluate the robustness and sensitivity of each method to different correlation scenarios. The proposed method ('Ours') consistently outperforms the baselines.", "section": "5.1 Experiments on the synthetic datasets"}, {"figure_path": "DdKdr4kqxh/figures/figures_9_1.jpg", "caption": "Figure 1: Overview of the objective of this work. We are interested in identifying spatio-temporal relations between the measurable impacts of extremes like the vegetation health index and their drivers As drivers, we focus on anomalies in state variables of the land-atmosphere and hydrological cycle. The task is very challenging since the drivers can occur at a different region than the extreme event and earlier in time.", "description": "This figure illustrates the main goal of the research work presented in the paper. It aims to show the complex spatio-temporal relationships between extreme events (e.g., agricultural droughts) and their potential drivers.  The challenge lies in identifying the drivers, which might appear earlier and at different locations compared to the impact of extreme events.  The figure visually represents this complexity by showing different state variables (atmospheric and hydrological) over time and space, highlighting the need to identify spatio-temporal anomalies (drivers) that are correlated with the impacts of extreme events.", "section": "1 Introduction"}, {"figure_path": "DdKdr4kqxh/figures/figures_19_1.jpg", "caption": "Figure 6: An example of the randomly generated coupling matrix between the synthetic variables and extremes for the synthetic CERRA dataset.", "description": "This figure shows a randomly generated coupling matrix used in creating synthetic data for the CERRA dataset.  Each row represents a different variable (albedo, 2m temperature, total cloud cover, total precipitation, relative humidity, and volumetric soil moisture). Each column represents a time step relative to an extreme event (indicated as a red block in the figure). The colored blocks within the matrix show the relationship between the variables and extreme events.  A dark-colored block indicates an anomalous event in the variable at that time step which is related to the extreme event.  The lighter-colored blocks represent either normal events or anomalous events not directly related to the extreme event.", "section": "A Synthetic data"}, {"figure_path": "DdKdr4kqxh/figures/figures_23_1.jpg", "caption": "Figure 7: Examples of the synthetic CERRA reanalysis data described in Table 3. The drivers/anomalies are visualized under each variable directly. Here, albedo and relative humidity are not correlated with the extremes.", "description": "This figure shows examples of the synthetic CERRA reanalysis data generated based on the statistical properties of the real CERRA data. Each subfigure shows a time series of one of six variables, with each column representing a different time step.  The data contains both anomalous values and 'normal' values. The color intensity shows the magnitude of the variable's values, with brighter colors representing higher values and darker colors representing lower values. Two variables (albedo and relative humidity) are not correlated with the extreme events, while the other four are designed to be correlated to illustrate spatio-temporal relationships between drivers and the extremes.", "section": "4 Dataset"}, {"figure_path": "DdKdr4kqxh/figures/figures_24_1.jpg", "caption": "Figure 8: Examples of the synthetic NOAA remote sensing described in Table 4. The drivers/anomalies are visualized under each variable directly. Here, NDVI and variables 05 are not correlated with the extremes.", "description": "This figure visualizes examples from a synthetic NOAA remote sensing dataset.  Each row represents a different variable (NDVI, BT, and three unlabeled variables), showing its values over time.  Yellow highlights indicate anomalies or drivers spatio-temporally correlated with extreme events. The caption notes that NDVI and variable 05 are uncorrelated with the extreme events.", "section": "4 Dataset"}, {"figure_path": "DdKdr4kqxh/figures/figures_25_1.jpg", "caption": "Figure 9: Examples of the synthetic artificial data described in Table 5. The drivers/anomalies are visualized under each variable directly. Here, variables 01 and 05 are not correlated with the extremes.", "description": "This figure shows examples of the synthetic artificial data generated using the methodology described in Table 5 of the paper.  The data includes six variables, each visualized in a separate row.  Each row shows a time series (from -Δt7 to Δt0) of the variable's values in a spatial representation (image).  Yellow pixels indicate anomalous events which are considered drivers of extreme events; the absence of yellow indicates no anomalous event.  Variables 01 and 05 are specifically indicated as not correlated with the extreme events being modeled.", "section": "4.3 Synthetic dataset"}, {"figure_path": "DdKdr4kqxh/figures/figures_26_1.jpg", "caption": "Figure 1: Overview of the objective of this work. We are interested in identifying spatio-temporal relations between the measurable impacts of extremes like the vegetation health index and their drivers. As drivers, we focus on anomalies in state variables of the land-atmosphere and hydrological cycle. The task is very challenging since the drivers can occur at a different region than the extreme event and earlier in time.", "description": "This figure illustrates the core challenge of the research: identifying the spatio-temporal relationships between extreme weather events (e.g., agricultural droughts, measurable by low vegetation health index) and their drivers. The drivers are defined as anomalies in various land-atmosphere and hydrological state variables (e.g., temperature, soil moisture, evaporation).  The difficulty lies in the fact that these drivers can manifest at different locations and earlier in time than the extreme event itself.", "section": "1 Introduction"}, {"figure_path": "DdKdr4kqxh/figures/figures_26_2.jpg", "caption": "Figure 1: Overview of the objective of this work. We are interested in identifying spatio-temporal relations between the measurable impacts of extremes like the vegetation health index and their drivers. As drivers, we focus on anomalies in state variables of the land-atmosphere and hydrological cycle. The task is very challenging since the drivers can occur at a different region than the extreme event and earlier in time.", "description": "This figure illustrates the main challenge addressed in the paper. It shows that the drivers of extreme events (e.g., agricultural droughts) can occur at different locations and earlier in time than the actual extreme events. The goal is to identify the spatio-temporal relations between these drivers and the impacts of extreme events using multivariate climate data.", "section": "1 Introduction"}, {"figure_path": "DdKdr4kqxh/figures/figures_27_1.jpg", "caption": "Figure 1: Overview of the objective of this work. We are interested in identifying spatio-temporal relations between the measurable impacts of extremes like the vegetation health index and their drivers. As drivers, we focus on anomalies in state variables of the land-atmosphere and hydrological cycle. The task is very challenging since the drivers can occur at a different region than the extreme event and earlier in time.", "description": "This figure illustrates the main goal of the research.  It highlights the challenge of identifying spatio-temporal relationships between extreme events (e.g., agricultural droughts, measurable by low vegetation health index values) and their drivers.  The key difficulty lies in the fact that the drivers (anomalies in atmospheric and hydrological variables) can appear in different locations and at earlier times than the observed impacts of the extreme event. The figure shows schematic representation of this spatio-temporal relationship.", "section": "1 Introduction"}, {"figure_path": "DdKdr4kqxh/figures/figures_28_1.jpg", "caption": "Figure 1: Overview of the objective of this work. We are interested in identifying spatio-temporal relations between the measurable impacts of extremes like the vegetation health index and their drivers. As drivers, we focus on anomalies in state variables of the land-atmosphere and hydrological cycle. The task is very challenging since the drivers can occur at a different region than the extreme event and earlier in time.", "description": "This figure illustrates the core research problem of the paper.  The goal is to identify spatio-temporal relationships between measurable impacts of extreme weather events (e.g., agricultural drought measured by vegetation health index, VHI) and their drivers. The challenge lies in the fact that drivers, such as anomalies in atmospheric and hydrological variables, may occur at different locations and earlier in time than the extreme event itself. The figure visually represents this spatio-temporal complexity.", "section": "1 Introduction"}, {"figure_path": "DdKdr4kqxh/figures/figures_31_1.jpg", "caption": "Figure 13: Supplementary to the ablation study in Table 2.", "description": "This figure shows the results of ablation studies on the objective functions used in the model. The leftmost panel shows the results when only the loss for drivers L(driver) was used. The next panel shows the result of using only the loss for extreme events L(extreme). The rightmost panel shows the result when both the losses were used. The differences in the results highlight the importance of using both loss functions for better performance.", "section": "C Ablation studies"}, {"figure_path": "DdKdr4kqxh/figures/figures_36_1.jpg", "caption": "Figure 1: Overview of the objective of this work. We are interested in identifying spatio-temporal relations between the measurable impacts of extremes like the vegetation health index and their drivers. As drivers, we focus on anomalies in state variables of the land-atmosphere and hydrological cycle. The task is very challenging since the drivers can occur at a different region than the extreme event and earlier in time.", "description": "This figure illustrates the core objective of the research paper: identifying spatio-temporal relations between measurable impacts of extreme events (e.g., agricultural droughts) and their drivers.  The challenge is highlighted because the drivers might occur in different locations and/or at earlier times than the extreme event itself.", "section": "1 Introduction"}, {"figure_path": "DdKdr4kqxh/figures/figures_37_1.jpg", "caption": "Figure 15: An overview of the extreme agricultural droughts definition from remote sensing.", "description": "The figure shows how the Vegetation Health Index (VHI) is calculated from two satellite-based products: Normalized Difference Vegetation Index (NDVI) and Brightness Temperature (BT). NDVI measures the greenness of vegetation, while BT measures the surface temperature.  Both are combined to create the VHI, which is a measure of vegetation health.  Extreme agricultural drought is then defined as VHI values below 26.  The figure visually shows the global distribution of NDVI, VCI, TCI, VHI and the resulting extreme drought areas.", "section": "I Satellite-derived agricultural drought"}, {"figure_path": "DdKdr4kqxh/figures/figures_39_1.jpg", "caption": "Figure 16: The averaged spatial distribution of drivers and anomalies related to Portugal in Europe. For this experiment, we use prediction on EUR-11 from ERA5-Land and select frames (times) within the period 2018-2024 where there were extreme drought of at least 25% of the pixels in the Portugal. Then we normalize the identified drivers and anomalies by the total number of frames to obtain the final map. As can be seen drivers are spatially centered around where extremes were reported.", "description": "This figure displays the spatial distribution of drivers and anomalies related to extreme drought events in Portugal, as identified by the model. The maps show the percentage of weeks with anomalous events for several variables, highlighting areas where the anomalies were most concentrated relative to drought impact.", "section": "D.3 Qualitative results from ERA5-Land EUR-11 data for different combination of physical variables"}, {"figure_path": "DdKdr4kqxh/figures/figures_39_2.jpg", "caption": "Figure 16: The averaged spatial distribution of drivers and anomalies related to Portugal in Europe. For this experiment, we use prediction on EUR-11 from ERA5-Land and select frames (times) within the period 2018-2024 where there were extreme drought of at least 25% of the pixels in the Portugal. Then we normalize the identified drivers and anomalies by the total number of frames to obtain the final map. As can be seen drivers are spatially centered around where extremes were reported.", "description": "This figure shows the spatial distribution of identified drivers and anomalies related to Portugal, using predictions from the ERA5-Land dataset for the EUR-11 region between 2018 and 2024.  Only timeframes with at least 25% of pixels experiencing extreme drought in Portugal were included.  The values represent the percentage of weeks with anomalous events, normalized across all such weeks.  The spatial concentration of drivers around the regions with extreme drought events demonstrates the model's ability to identify relevant spatiotemporal patterns.", "section": "J Additional results"}, {"figure_path": "DdKdr4kqxh/figures/figures_40_1.jpg", "caption": "Figure 1: Overview of the objective of this work. We are interested in identifying spatio-temporal relations between the measurable impacts of extremes like the vegetation health index and their drivers As drivers, we focus on anomalies in state variables of the land-atmosphere and hydrological cycle. The task is very challenging since the drivers can occur at a different region than the extreme event and earlier in time.", "description": "This figure illustrates the core challenge addressed by the paper.  It visually explains the difficulties involved in identifying spatio-temporal drivers of extreme events. These drivers (anomalies in land-atmosphere and hydrological variables) might not occur at the same time or location as the measurable impact of the extreme event (e.g., agricultural drought). The time delay and spatial inhomogeneity create a significant challenge for identifying the causal relationships between drivers and extreme events.", "section": "1 Introduction"}, {"figure_path": "DdKdr4kqxh/figures/figures_40_2.jpg", "caption": "Figure 1: Overview of the objective of this work. We are interested in identifying spatio-temporal relations between the measurable impacts of extremes like the vegetation health index and their drivers As drivers, we focus on anomalies in state variables of the land-atmosphere and hydrological cycle. The task is very challenging since the drivers can occur at a different region than the extreme event and earlier in time.", "description": "This figure illustrates the main objective of the paper, which is to identify the spatio-temporal relationships between extreme events and their drivers.  It highlights the complexity of the task due to the time delays and spatial inhomogeneity of the drivers' responses.  The figure visually shows an extreme event impacting vegetation health and the various potential drivers (anomalies in atmospheric, hydrological, and land state variables) occurring earlier in time and potentially in different locations.", "section": "1 Introduction"}, {"figure_path": "DdKdr4kqxh/figures/figures_41_1.jpg", "caption": "Figure 5: (a) Qualitative results on ERA5-Land over the EUR-11 domain. Shown are the identified drivers localized spatio-temporally 7 weeks before the extreme agricultural drought events. (b) Temporal evolution of drivers during the extremes.", "description": "Figure 5(a) shows the spatial distribution of the identified drivers up to 7 weeks before extreme agricultural droughts in Europe. The figure demonstrates the spatial correlation between the predicted drivers and the actual extreme events. Figure 5(b) illustrates the temporal evolution of the drivers and their anomalies leading up to extreme drought events. It showcases the changes in various variables (soil moisture, temperature, etc.) and how their anomalies correlate with the onset of the extreme droughts.", "section": "5.2 Experiments on real-world datasets"}, {"figure_path": "DdKdr4kqxh/figures/figures_41_2.jpg", "caption": "Figure 19: Temporal evolution of drivers and anomalies related to the extremes in ERA5-Land for Europe (EUR-11). For this experiments, we select pixels with extreme events during summer (weeks 25-38) for the years 2018-2023 and compute the average distribution of drivers and anomalies with time. The red line at Ato indicates the beginning of the extreme droughts. Zscore in the underneath curve represents the deviation from the mean computed from the ERA5-Land climatology.", "description": "This figure shows the temporal evolution of drivers (anomalies) and their relation to extreme events in the ERA5-Land dataset for Europe.  The analysis focuses on pixels experiencing extreme droughts during summer months (weeks 25-38) from 2018 to 2023. The figure visualizes the average distribution of drivers and anomalies over time, highlighting the period leading up to, and following the onset of these extreme events. The red line marks the beginning of the droughts, and the z-score in the bottom graph shows the deviation from the long-term climatological average. This visualization helps to understand the temporal dynamics of drivers and their relationship to extreme events.", "section": "D Results on the real-world reanalysis data"}, {"figure_path": "DdKdr4kqxh/figures/figures_42_1.jpg", "caption": "Figure 1: Overview of the objective of this work. We are interested in identifying spatio-temporal relations between the measurable impacts of extremes like the vegetation health index and their drivers. As drivers, we focus on anomalies in state variables of the land-atmosphere and hydrological cycle. The task is very challenging since the drivers can occur at a different region than the extreme event and earlier in time.", "description": "This figure illustrates the main goal of the research work presented in the paper.  It highlights the challenge of identifying spatio-temporal relationships between extreme events (like agricultural droughts measured by Vegetation Health Index - VHI) and their drivers. The drivers are defined as anomalies in various land-atmosphere and hydrological variables. The difficulty stems from the fact that these drivers might occur at different locations and earlier than the resulting extreme events.", "section": "1 Introduction"}, {"figure_path": "DdKdr4kqxh/figures/figures_42_2.jpg", "caption": "Figure 19: Temporal evolution of drivers and anomalies related to the extremes in ERA5-Land for Europe (EUR-11). For this experiments, we select pixels with extreme events during summer (weeks 25-38) for the years 2018-2023 and compute the average distribution of drivers and anomalies with time. The red line at Ato indicates the beginning of the extreme droughts. Zscore in the underneath curve represents the deviation from the mean computed from the ERA5-Land climatology.", "description": "This figure shows the temporal dynamics of the identified drivers and anomalies leading up to extreme drought events in the EUR-11 region of Europe. The analysis focuses on summer months (weeks 25-38) from 2018 to 2023.  The plots illustrate the average behavior of key variables (total evaporation, forecast albedo, soil temperature, volumetric soil water, 2m temperature, and total precipitation) in the weeks preceding the drought events.  The red vertical lines denote the onset of the droughts, and the shaded area represents the deviation from the climatological mean. The figure provides insights into the temporal relationships between the drivers and the occurrence of extreme droughts.", "section": "D. Results on the real-world reanalysis data"}, {"figure_path": "DdKdr4kqxh/figures/figures_43_1.jpg", "caption": "Figure 1: Overview of the objective of this work. We are interested in identifying spatio-temporal relations between the measurable impacts of extremes like the vegetation health index and their drivers. As drivers, we focus on anomalies in state variables of the land-atmosphere and hydrological cycle. The task is very challenging since the drivers can occur at a different region than the extreme event and earlier in time.", "description": "This figure illustrates the core challenge addressed in the paper: identifying spatio-temporal relationships between extreme events (e.g., agricultural droughts) and their drivers.  The key difficulty lies in the temporal lag and spatial heterogeneity between the occurrence of the drivers (anomalies in atmospheric and hydrological variables) and the observable impacts of the extreme events. The figure visually represents this temporal and spatial disconnect, highlighting the challenge of establishing a robust link between these factors.", "section": "1 Introduction"}, {"figure_path": "DdKdr4kqxh/figures/figures_43_2.jpg", "caption": "Figure 19: Temporal evolution of drivers and anomalies related to the extremes in ERA5-Land for Europe (EUR-11). For this experiments, we select pixels with extreme events during summer (weeks 25-38) for the years 2018-2023 and compute the average distribution of drivers and anomalies with time. The red line at Ato indicates the beginning of the extreme droughts. Zscore in the underneath curve represents the deviation from the mean computed from the ERA5-Land climatology.", "description": "This figure shows the temporal dynamics of identified drivers and anomalies preceding extreme drought events in the EUR-11 region of the ERA5-Land dataset. The analysis focuses on summer months (weeks 25-38) from 2018 to 2023.  For each variable (total evaporation, forecast albedo, soil temperature, volumetric soil water, 2m temperature, and total precipitation), it displays the percentage of pixels exhibiting anomalous behavior over time, along with z-scores indicating deviation from the climatological mean. The red line marks the onset of extreme droughts (VHI < 26). The plot helps visualize how different variables change in relation to the onset and progression of the drought.", "section": "D.3 Scientific validity"}, {"figure_path": "DdKdr4kqxh/figures/figures_44_1.jpg", "caption": "Figure 1: Overview of the objective of this work. We are interested in identifying spatio-temporal relations between the measurable impacts of extremes like the vegetation health index and their drivers As drivers, we focus on anomalies in state variables of the land-atmosphere and hydrological cycle. The task is very challenging since the drivers can occur at a different region than the extreme event and earlier in time.", "description": "This figure illustrates the core challenge the paper addresses: identifying spatio-temporal relationships between extreme events (e.g., agricultural droughts, measurable by low vegetation health index values) and their drivers.  The key difficulty is that these drivers (anomalies in atmospheric and hydrological variables) may occur at different locations and earlier in time than the observed extreme event. The figure highlights the spatio-temporal aspects of this relationship, making it clear that identifying the connections between them is a complex task.", "section": "1 Introduction"}, {"figure_path": "DdKdr4kqxh/figures/figures_44_2.jpg", "caption": "Figure 19: Temporal evolution of drivers and anomalies related to the extremes in ERA5-Land for Europe (EUR-11). For this experiments, we select pixels with extreme events during summer (weeks 25-38) for the years 2018-2023 and compute the average distribution of drivers and anomalies with time. The red line at Ato indicates the beginning of the extreme droughts. Zscore in the underneath curve represents the deviation from the mean computed from the ERA5-Land climatology.", "description": "This figure displays the temporal evolution of identified drivers and anomalies in relation to extreme events (agricultural droughts) in the EUR-11 region of ERA5-Land data. The data covers summer weeks (25-38) from 2018 to 2023. For each pixel experiencing an extreme event, the average distribution of driver and anomaly variables across time is calculated and presented.  A red line marks the start of extreme droughts (Ato). The z-score shows the deviation from the climatological mean.", "section": "D.2 Robustness"}, {"figure_path": "DdKdr4kqxh/figures/figures_45_1.jpg", "caption": "Figure 2: An overview of the proposed model to identify the spatio-temporal relations between extreme agricultural droughts and their drivers. The input variables are first encoded into features. In a subsequent step, a lockup free quantization layer (LFQ) takes the extracted features and classifies the variables into a binary representation of drivers, where we consider the drivers as anomalous events in the input variables. Finally, a classifier is used to predict impacts of extreme events from the identified drivers.", "description": "The figure provides a detailed overview of the proposed model architecture for identifying spatio-temporal drivers of extreme agricultural droughts. The model consists of three main components: a feature extractor that processes the input climate variables, a quantization layer that converts the features into a binary representation of drivers (anomalies), and a classifier that predicts extreme drought events based on the identified drivers. The model is trained end-to-end to jointly learn the feature representations, driver identification, and drought prediction.", "section": "3 Method"}, {"figure_path": "DdKdr4kqxh/figures/figures_45_2.jpg", "caption": "Figure 19: Temporal evolution of drivers and anomalies related to the extremes in ERA5-Land for Europe (EUR-11). For this experiments, we select pixels with extreme events during summer (weeks 25-38) for the years 2018-2023 and compute the average distribution of drivers and anomalies with time. The red line at Ato indicates the beginning of the extreme droughts. Zscore in the underneath curve represents the deviation from the mean computed from the ERA5-Land climatology.", "description": "This figure shows the temporal evolution of drivers and anomalies related to extreme events in the ERA5-Land dataset for Europe. It visualizes the average distribution of drivers and anomalies over time for pixels experiencing extreme drought events during summer months (weeks 25-38) between 2018 and 2023. The red line marks the onset of extreme droughts.  The Z-score in the lower graphs indicates how much the values deviate from the average.", "section": "D.2 Robustness"}, {"figure_path": "DdKdr4kqxh/figures/figures_46_1.jpg", "caption": "Figure 18: Qualitative results on ERA5-Land for Europe (EUR-11). Shown are the identified drivers and anomalies for each variable along with the prediction of extreme agricultural droughts on the top left.", "description": "This figure shows the qualitative results of the proposed model on ERA5-Land data for the EUR-11 region. It displays the identified drivers and anomalies for each variable, along with the model's prediction of extreme agricultural droughts. The top-left shows the observed and predicted extreme droughts, and subsequent columns show identified driver anomalies for various atmospheric and land state variables including  forecast albedo (fal), soil temperature (stl1), total evaporation (e), total precipitation (tp), volumetric soil water (swvl1), and 2m temperature (t2m) up to 7 weeks before the extreme event (t=0).", "section": "D Results on the real-world reanalysis data"}, {"figure_path": "DdKdr4kqxh/figures/figures_46_2.jpg", "caption": "Figure 10: Visualization of the generated signals  Φ for 6 different variables from the synthetic CERRA reanalysis described in Table 3. The time series are shown for the location (lat = 50, lon = 50).  are the drivers/anomalies which are correlated with extremes, and  are random anomalies.", "description": "The figure visualizes the generated synthetic signals for six different variables from the synthetic CERRA reanalysis dataset. Each variable's time series is shown for a specific location (latitude 50, longitude 50). The signals consist of three components: normal base signals, anomalies correlated with extreme events, and random anomalies. The anomalies correlated with extremes are designed to mimic real-world drivers of extreme events, while the random anomalies represent background noise or unrelated variations.", "section": "A Synthetic data"}]