[{"figure_path": "UFRZHFYW8e/figures/figures_1_1.jpg", "caption": "Figure 1: Region-aware Vision-Language learning (RAVL). RAVL takes a fine-grained perspective on VLM robustness by discovering and mitigating spurious correlations using local image features.", "description": "The figure illustrates the two-stage process of RAVL. Stage 1 (Discovery) focuses on identifying spurious correlations learned by a fine-tuned Vision-Language Model (VLM).  It uses a region-level clustering approach to pinpoint image features contributing to zero-shot classification errors, specifically highlighting spurious correlations between image features (like flowers) and textual attributes (like \"butterfly\").  Stage 2 (Mitigation) aims to mitigate these identified spurious correlations using a novel region-aware loss function. This loss function encourages the VLM to concentrate on relevant regions during fine-tuning while ignoring the spurious relationships.", "section": "Our Approach: RaVL"}, {"figure_path": "UFRZHFYW8e/figures/figures_5_1.jpg", "caption": "Figure 2: RAVL accurately identifies spurious correlations. Using our evaluation settings, we show that RAVL consistently outperforms prior methods in discovering learned spurious correlations between image features and textual attributes. Here, we provide Precision@10 metrics for a CLIP-RN50 model fine-tuned on synthetic data (129 settings) and real-world data (171 settings).", "description": "This figure shows the results of comparing RAVL with other methods for discovering spurious correlations.  The x-axis represents the strength of the spurious correlation, and the y-axis shows the precision@10.  The figure demonstrates that RAVL significantly outperforms other methods across various correlation strengths and datasets (synthetic and real-world). Error bars represent 95% confidence intervals.", "section": "3 Discovering Spurious Correlations in Fine-Tuned Vision-Language Models"}, {"figure_path": "UFRZHFYW8e/figures/figures_7_1.jpg", "caption": "Figure 3: RAVL surfaces spurious correlations in off-the-shelf VLMs. RAVL identifies a spurious correlation learned by CLIP ViT-B/16 between the presence of text-based retail signage and the class label fast food restaurant in a scene classification task. RAVL also surfaces a spurious correlation learned by PubMedCLIP ResNet-50 between metal clips (found in clothing) and the class label cardiomegaly (a heart condition) on a chest X-ray classification task.", "description": "This figure shows two examples of spurious correlations found by RAVL in two different pre-trained vision-language models. The first example shows that a CLIP (ViT-B/16) model trained for scene classification has learned to associate the presence of text-based retail signage with fast food restaurants. The second example shows that a PubMedCLIP (ResNet-50) model trained for chest X-ray classification has learned to associate the presence of metal clips with cardiomegaly. The zero-shot accuracy is significantly affected by the presence or absence of these spurious features.", "section": "Results: RaVL Effectively Discovers Spurious Correlations"}, {"figure_path": "UFRZHFYW8e/figures/figures_16_1.jpg", "caption": "Figure 1: Region-aware Vision-Language learning (RAVL). RAVL takes a fine-grained perspective on VLM robustness by discovering and mitigating spurious correlations using local image features.", "description": "This figure illustrates the two stages of the RAVL approach. Stage 1 (Discovery) focuses on identifying spurious correlations between image features and textual attributes using a region-level clustering approach.  Stage 2 (Mitigation) addresses these spurious correlations by introducing a novel region-aware loss function that encourages the VLM to focus on relevant regions and ignore spurious relationships during fine-tuning. The example shows a situation where the model incorrectly associates butterflies with flowers, highlighting the problem of spurious correlations that RAVL aims to address.", "section": "Our Approach: RaVL"}, {"figure_path": "UFRZHFYW8e/figures/figures_18_1.jpg", "caption": "Figure 2: RAVL accurately identifies spurious correlations. Using our evaluation settings, we show that RAVL consistently outperforms prior methods in discovering learned spurious correlations between image features and textual attributes. Here, we provide Precision@10 metrics for a CLIP RN50 model fine-tuned on synthetic data (129 settings) and real-world data (171 settings).", "description": "This figure presents the results of a large-scale evaluation comparing RAVL's performance against other methods in discovering spurious correlations.  The experiment involved 654 fine-tuned vision-language models across synthetic and real-world datasets, varying the strength of the learned spurious correlation.  The metric used for comparison was Precision@10, demonstrating that RAVL significantly outperforms existing methods in discovering spurious correlations.", "section": "3. Results: RaVL Effectively Discovers Spurious Correlations"}, {"figure_path": "UFRZHFYW8e/figures/figures_19_1.jpg", "caption": "Figure 3: RAVL surfaces spurious correlations in off-the-shelf VLMs. RAVL identifies a spurious correlation learned by CLIP ViT-B/16 between the presence of text-based retail signage and the class label fast food restaurant in a scene classification task. RAVL also surfaces a spurious correlation learned by PubMedCLIP ResNet-50 between metal clips (found in clothing) and the class label cardiomegaly (a heart condition) on a chest X-ray classification task.", "description": "This figure shows two examples of spurious correlations discovered by RAVL in off-the-shelf vision-language models. The left column shows the model and task. The middle column visualizes the spurious features identified by RAVL. The right column displays the zero-shot accuracy for images with and without the identified features. For the CLIP ViT-B/16 model, the spurious correlation is between text-based retail signage and the class label \"fast food restaurant.\" For the PubMedCLIP ResNet-50 model, the spurious correlation is between metal clips and the class label \"cardiomegaly.\"", "section": "3.3 Results: RaVL Effectively Discovers Spurious Correlations"}]