[{"figure_path": "RqvesBxqDo/figures/figures_1_1.jpg", "caption": "Figure 1: Pipeline of QVAE-Mole and QCVAE-Mole with a vMF distributed latent space. We first use amplitude encoding to get the initial quantum state vectors from classic data of molecules. Then the quantum encoder learns the mean direction μ in the latent space, which is used to sample a latent variable zi ~ vMF(μ, κ). A subsequent quantum decoder decodes z trying to match the input state vector. Then molecule is reconstructed from the output state vector of decoder. For conditional generation, we have a condition vector for both input data and latent space, then we use condition qubits as well as condition layers to encode the given conditions into the quantum circuit. Solid and dashed arrows represent the training and inference phase, respectively.", "description": "This figure illustrates the architecture of QVAE-Mole and QCVAE-Mole.  It shows how classical molecular data is encoded into a quantum state using amplitude encoding, then processed by a quantum encoder to produce a latent variable sampled from a von Mises-Fisher (vMF) distribution. This latent variable is then decoded by a quantum decoder to reconstruct the molecule. The conditional version, QCVAE-Mole, incorporates conditional vectors to generate molecules with specific properties.", "section": "3 Methodology"}, {"figure_path": "RqvesBxqDo/figures/figures_2_1.jpg", "caption": "Figure 2: Classic data encoding. We encode 3-D molecules with 3-D coordinates and atom types through three steps: 1)introduce an auxiliary value, 2) normalize to a norm 1.0, and 3) convert into a quantum state vector via amplitude encoding.", "description": "This figure illustrates the process of encoding classical data of 3D molecules into a quantum state vector using amplitude encoding. The input data includes 3D coordinates and atom types.  First, an auxiliary value is introduced for normalization purposes. Second, the data is normalized to have a unit norm, which is essential for amplitude encoding. Finally, this normalized data is converted into the quantum state vector via amplitude encoding. This process ensures that the data is compatible with quantum computing.", "section": "3.1 Encoding 3-D Molecule to Initial Quantum State"}, {"figure_path": "RqvesBxqDo/figures/figures_3_1.jpg", "caption": "Figure 3: The ansatz of our quantum encoder. It takes the initial quantum state |ψ0⟩ as input and outputs the mean direction μ of vMF distribution. Each layer includes a single-qubit layer Us and an entanglement layer Uent. In the end, we trace out the state of the last qB qubits: qB = q - qA", "description": "This figure shows the architecture of the quantum encoder used in QVAE-Mole and QCVAE-Mole.  The encoder takes an initial quantum state as input and processes it through multiple layers consisting of single-qubit gates and entanglement gates. Each layer introduces trainable parameters. Finally, a measurement is performed on a subset of the qubits to obtain the mean direction μ in the latent space, which follows a von Mises-Fisher (vMF) distribution.", "section": "3.2 Full Quantum Architecture"}, {"figure_path": "RqvesBxqDo/figures/figures_5_1.jpg", "caption": "Figure 4: The ansatz of QCVAE-Mole: it incorporates m additional condition qubits for m target properties and additional condition layers. At the end of the circuit, we further trace out the state of m condition qubits.", "description": "This figure shows the quantum circuit architecture of the QCVAE-Mole model, which is an extension of the QVAE-Mole model designed for conditional generation of molecules.  The key difference is the inclusion of additional condition qubits and condition layers that encode specific properties into the quantum circuit.  The figure illustrates how the condition qubits are used in conjunction with controlled Rx gates (CRx) to influence the state evolution of the circuit.  Ultimately, the condition qubits are traced out before the output state vector is measured, reflecting the generation of a molecule with the specified properties.", "section": "3.3 Conditional Generation"}, {"figure_path": "RqvesBxqDo/figures/figures_8_1.jpg", "caption": "Figure 5: Distribution of four properties of generated molecules under multi-condition. Dashed lines represent the given condition values.", "description": "This figure shows the violin plots for four molecular properties (QED, SA, LogP, and HOMO-LUMO gap) generated by QVAE-Mole (unconditional generation) and QCVAE-Mole (conditional generation).  Each violin plot represents the distribution of the values for each property obtained from the generated molecules. The dashed lines in each plot indicate the target values specified as the conditions for QCVAE-Mole.  The figure helps to visualize the effectiveness of the conditional generation model in controlling the desired properties of the generated molecules. The distributions' differences between QVAE-Mole and QCVAE-Mole suggest QCVAE-Mole is able to steer the generated molecules toward the desired properties.", "section": "4.3 Conditional 3-D Molecule Generation"}, {"figure_path": "RqvesBxqDo/figures/figures_8_2.jpg", "caption": "Figure 6: a) Comparison of a normal distribution (N-) or a vMF one (S-) in the latent space of MLP-VAE (VAE in short) and QVAE-Mole (QVAE in short). b) Different K in VMF distribution.", "description": "This figure compares the performance of using a normal distribution versus a von Mises-Fisher (vMF) distribution in the latent space of both classic variational autoencoders (VAEs) and the proposed quantum VAEs.  Subfigure (a) shows that the vMF distribution yields better validity in the quantum VAE, highlighting its suitability for the hyperspherical structure of quantum states. Subfigure (b) explores the impact of varying the concentration parameter (κ) within the vMF distribution, demonstrating a tradeoff between the accuracy and diversity of the generated molecules.", "section": "4.4 Ablation Study"}]