[{"figure_path": "8W5ADJOKcv/tables/tables_4_1.jpg", "caption": "Table 2: Evaluation Results on STRESS.", "description": "This table presents the STRESS values achieved by different multidimensional scaling methods (CMDS, Lower-MDS, Neuc-MDS, Neuc-MDS+, and SMACOF) on various datasets (Random-Simplex, Euclidean Ball, Brain, Breast, Colorectal, Leukemia, Renal, MNIST, Fashion-MNIST, and CIFAR-10).  Lower STRESS indicates better performance. The results show that Neuc-MDS and Neuc-MDS+ generally achieve significantly lower STRESS compared to the other methods.", "section": "6 Experiments"}, {"figure_path": "8W5ADJOKcv/tables/tables_8_1.jpg", "caption": "Table 2: Evaluation Results on STRESS.", "description": "The table compares the STRESS (sum of squared error) of different multidimensional scaling methods (CMDS, Lower-MDS, Neuc-MDS, Neuc-MDS+, SMACOF) across various datasets (synthetic and real-world).  Lower STRESS values indicate better performance.", "section": "6 Experiments"}, {"figure_path": "8W5ADJOKcv/tables/tables_8_2.jpg", "caption": "Table 3: Evaluation Results on Average Geometric Distortion.", "description": "This table presents the average geometric distortion for different methods (cMDS, Lower-MDS, Neuc-MDS, and Neuc-MDS+) across ten diverse datasets.  Average geometric distortion is a metric measuring the multiplicative error between the input dissimilarities and the computed distances in the embedded low-dimensional space. Lower values indicate better performance. The datasets include synthetic datasets (Random-Simplex, Euclidean Ball) and real-world datasets (genomics data from CuMiDa and image datasets MNIST, Fashion-MNIST, CIFAR-10).", "section": "6 Experiments"}, {"figure_path": "8W5ADJOKcv/tables/tables_20_1.jpg", "caption": "Table 4: This table shows the error terms ec and en of different choices of c∈ (0,0.5) with c = k/n, normalized by dividing n²σ².", "description": "This table presents the results of the error analysis for classical MDS (ec) and Neuc-MDS (eN) on random symmetric matrices. The error terms are normalized by dividing n²σ², where n is the dimension of the matrix and σ² is the variance of the matrix elements. The values are shown for different choices of c, which represents the ratio k/n, where k is the number of selected eigenvalues and n is the total number of eigenvalues.  The table illustrates the impact of the ratio of selected eigenvalues (k) to total number of eigenvalues (n) on the error of classical MDS and Neuc-MDS.", "section": "4.3 Analysis on Random Symmetric Matrices"}, {"figure_path": "8W5ADJOKcv/tables/tables_20_2.jpg", "caption": "Table 5: This table shows the error term eN of different choices of c ∈ [0.5, 1) with c = k/n, normalized by dividing n²σ².", "description": "This table shows the results of the error term eN, which is normalized by dividing n²σ², for different choices of c, where c ranges from 0.5 to 0.95.  The values demonstrate how eN decreases as c approaches 1, illustrating the impact of the chosen dimension (k) relative to the total dimension (n) on the error in non-Euclidean multidimensional scaling.", "section": "4.3 Analysis on Random Symmetric Matrices"}, {"figure_path": "8W5ADJOKcv/tables/tables_22_1.jpg", "caption": "Table 6: Original Evaluation Results on All Datasets for Lower-MDS (L-MDS), Neuc-MDS (N-MDS) and Neuc-MDS+ (N-MDS+). Metrics include scaled additive error, number of negative distances and number of negative eigenvalues selected.", "description": "This table presents the performance comparison of four multidimensional scaling algorithms, namely Lower-MDS, Neuc-MDS, Neuc-MDS+, and cMDS, across ten diverse datasets.  The comparison is based on three metrics: scaled additive error, number of negative distances, and the number of negative eigenvalues selected.  Lower error values indicate better performance.", "section": "6 Experiments"}, {"figure_path": "8W5ADJOKcv/tables/tables_22_2.jpg", "caption": "Table 2: Evaluation Results on STRESS.", "description": "This table presents the STRESS values resulting from different multidimensional scaling methods (CMDS, Lower-MDS, Neuc-MDS, Neuc-MDS+, and SMACOF) applied to various datasets.  Lower STRESS values indicate better performance in accurately representing the input dissimilarities in a lower-dimensional space. The datasets include synthetic data (Random-Simplex, Euclidean Ball) and real-world data (Brain, Breast, Colorectal, Leukemia, Renal, MNIST, Fashion-MNIST, CIFAR-10).", "section": "6 Experiments"}, {"figure_path": "8W5ADJOKcv/tables/tables_23_1.jpg", "caption": "Table 8: Evaluation Results on Image Datasets with other perturbation metrics.", "description": "This table presents the results of experiments on image datasets using different perturbation methods.  It shows the STRESS values, the number of negative distances, and the number of negative eigenvalues selected for CMDS, L-MDS, Neuc-MDS, and Neuc-MDS+.  The perturbation methods used are adding Gaussian noise to distances, randomly removing data entries from coordinates, and increasing the number of nearest neighbors in k-NN.", "section": "6 Experiments"}]