[{"figure_path": "B0OWOkMwhz/tables/tables_6_1.jpg", "caption": "Table 1: Comparison with SoTA methods on DL3DV-10K. Below, n is the frame distance span across all the tested novel views within each scene, which is set to 300 by default as most DL3DV-10K scenes contain roughly 300 extracted frames. Since most DL3DV-10K scenes contain a two-round trajectory, we also report another setting of n = 150 aiming for coverage of one round.", "description": "This table compares the performance of MVSplat360 against other state-of-the-art methods on the DL3DV-10K dataset for novel view synthesis tasks.  It shows quantitative metrics (PSNR, SSIM, LPIPS, DISTS, FID) for two different settings (n=300 and n=150), representing the temporal distance between input and output views. The results highlight MVSplat360's superior performance compared to existing methods.", "section": "4.2 Results on the New DL3DV-10K Benchmark"}, {"figure_path": "B0OWOkMwhz/tables/tables_7_1.jpg", "caption": "Table 2: Comparison with SoTA methods on RealEstate10K. We report interpolation scores using the settings of [6, 10], where we retrain latentSplat [57] to maintain fair comparison (indicates with *). We report extrapolation scores by following [57].", "description": "This table compares the performance of different methods on the RealEstate10K benchmark dataset for both interpolation and extrapolation tasks.  It shows the PSNR, SSIM, LPIPS, DISTS, and FID scores for each method, indicating their ability to generate realistic novel views.", "section": "4.3 Results on the Existing RealEstate10K Benchmark"}, {"figure_path": "B0OWOkMwhz/tables/tables_8_1.jpg", "caption": "Table 3: MVSplat360 ablations. All models are trained and evaluated on the DL3DV-10K dataset.", "description": "This table presents ablation studies on the MVSplat360 model, evaluating the impact of different components on the model's performance.  The baseline is the original MVSplat model, and the other rows show variations in which specific components are added or modified.  These components include the use of a Stable Video Diffusion model (+SVD), incorporating cross attention across views (+ctx-attn), and the use of Gaussian Splat features (+GS-feat) that are fed into the SVD.  The results are shown in terms of SSIM, LPIPS, DISTS, and FID metrics, measuring the quality of novel view synthesis.", "section": "4.4 Ablations and Analysis"}, {"figure_path": "B0OWOkMwhz/tables/tables_8_2.jpg", "caption": "Table 3: MVSplat360 ablations. All models are trained and evaluated on the DL3DV-10K dataset.", "description": "This table presents ablation studies conducted on the DL3DV-10K dataset to analyze the impact of different components and the number of input views on the performance of the MVSplat360 model. The metrics used for evaluation are SSIM (Structural Similarity Index), LPIPS (Learned Perceptual Image Patch Similarity), DISTS (Deep Image Structure and Texture Similarity), and FID (Fréchet Inception Distance).  The results show that incorporating the SVD (Stable Video Diffusion) model, cross-attention mechanisms, and the rendering of 3D Gaussian splatting features significantly improves the performance.  The number of input views also impacts performance, with better scores obtained using 6 or 7 views compared to using only 3 or 4 views. The \"default\" row shows the configuration of the model used in the main experiments.", "section": "4 Experiments"}]