[{"type": "text", "text": "RAW: A Robust and Agile Plug-and-Play Watermark Framework for AI-Generated Images with Provable Guarantees ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Xun Xian ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Ganghua Wang ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Department of ECE University of Minnesota xian0044@umn.edu ", "page_idx": 0}, {"type": "text", "text": "School of Statistics University of Minnesota wang9019@umn.edu ", "page_idx": 0}, {"type": "text", "text": "", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Jayanth Srinivasa Cisco Research jasriniv@cisco.com ", "page_idx": 0}, {"type": "text", "text": "Xuan Bi Carlson School of Management University of Minnesota xbi@umn.edu ", "page_idx": 0}, {"type": "text", "text": "Ashish Kundu Cisco Research shkundu@cisco.com ", "page_idx": 0}, {"type": "text", "text": "Mingyi Hong   \nDepartment of ECE   \nUniversity of Minnesota   \nmhong@umn.edu   \nJie Ding   \nSchool of Statistics   \nUniversity of Minnesota   \ndingj@umn.edu ", "page_idx": 0}, {"type": "text", "text": "", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Safeguarding intellectual property and preventing potential misuse of AI-generated images are of paramount importance. This paper introduces a robust and agile plug-and-play watermark detection framework, referred to as RAW. As a departure from existing encoder-decoder methods, which incorporate fixed binary codes as watermarks within latent representations, our approach introduces learnable watermarks directly into the original image data. Subsequently, we employ a classifier that is jointly trained with the watermark to detect the presence of the watermark. The proposed framework is compatible with various generative architectures and supports on-the-fly watermark injection after training. By incorporating state-ofthe-art smoothing techniques, we show that the framework also provides provable guarantees regarding the false positive rate for misclassifying a watermarked image, even in the presence of adversarial attacks targeting watermark removal. Experiments on a diverse range of images generated by state-of-the-art diffusion models demonstrate substantially improved watermark encoding speed and watermark detection performance, under adversarial attacks, while maintaining image quality. Our code is publicly available here. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "In recent years, Generative Artificial Intelligence, notably in computer vision, has made significant strides. The adoption of diffusion models (DM) in applications like Stable Diffusion [1] and DALLE2 [2] has greatly improved image generation quality. However, these advancements also raise concerns about potential misuse, seen in instances such as DeepFake [3] and copyright infringement [4]. ", "page_idx": 0}, {"type": "text", "text": "To mitigate the potential misuse of diffusion models, the incorporation of watermarks emerges as a promising solution. Watermarked images, tagged with crafted signals, act as markers to identify their machine-generated origin. Watermarking techniques designed for generative models can be generally classified into two categories: model-specific [5, 6, 7, 8] and model-agnostic [9, 10, 11], as outlined in Table 1. Model-specific methods refer to those tailored for particular generative models, often offering a better tradeoff between watermarked image quality and watermark detection performance. However, this characteristic may potentially restrict their applicability across diverse use cases. For instance, the Tree-Ring watermark [8] is tailored for specific samplers, e.g., DDIM [12], used for image generation within diffusion models. The feasibility of adapting this method to other commonly used samplers remains open to discussion. ", "page_idx": 0}, {"type": "text", "text": "", "page_idx": 1}, {"type": "table", "img_path": "ogaeChzbKu/tmp/e5e12a859aac7a9596eec9d36855101d1880041001c8f88327cecb48005c4898.jpg", "table_caption": ["Table 1: Summary of features of several representative watermark techniques. The second column denotes the method’s suitability for real-time on-the-fly implementation. / denotes cases where the watermark is embedded during the generative process. The third column evaluates whether the watermarking method provides provable guarantees on false-positive rates (FPRs) under adversarial attacks in a distribution-free manner. "], "table_footnote": [], "page_idx": 1}, {"type": "text", "text": "In contrast, model-agnostic approaches directly watermark generated content without modifying the generative models. These approaches can be categorized into two types. The first, from traditional signal processing, e.g., DwTDcTSvd [13], embeds watermarks in specific parts of images’ frequency domains. However, they can be vulnerable to strong image manipulations and adversarial attacks for removing watermarks [14]. The second type employs deep learning techniques, utilizing encoderdecoder structures to embed watermarks, such as binary codes, in latent spaces. For instance, RivaGan [10] trains the watermark and watermark decoder jointly as learned models, enhancing transmission and robustness. However, these methods demand greater computational resources for watermark injection, limiting real-time on-the-fly deployment. For example, when injecting watermarks into images, the RivaGan requires over $15\\times$ the time needed by the DwtDct methods [15]. ", "page_idx": 1}, {"type": "text", "text": "Additionally, there has been a sustained emphasis on precisely evaluating false-positive rates (FPRs) and/or the Area Under the Receiver Operating Characteristic curve (AUROC) for each utilized watermarking strategy [16], given the potential economic implications associated with watermark implementation. To establish an explicit theoretical formulation for FPRs, many studies have assumed that the binary watermark code extracted from unwatermarked images exhibits a pattern where each digit is an independent and identically distributed (IID) Bernoulli random variable with equal probabilities. This assumption enables the explicit derivation of the FPRs when comparing the extracted binary code with the predefined actual binary watermark code. However, such an assumption may not hold as empirically observed in [17], and thus the corresponding formulation for FPRs might be incorrect. ", "page_idx": 1}, {"type": "text", "text": "1.1 Contributions ", "text_level": 1, "page_idx": 1}, {"type": "text", "text": "In this paper, we introduce a Robust, Agile plug-and-play Watermark framework, abbreviated as RAW. RAW is designed for both adaptability and computational efficiency, providing a modelagnostic approach for real-time, on-the-fly deployment of image watermarking (which can be straightforwardly extended to video watermarking as outlined in Section 4.5). This dedication to adaptability is to ensure the accessibility for third-party users, e.g., artists and generative model providers. Moreover, this adaptability is fortified by the integration of state-of-the-art smoothing techniques for achieving provable guarantees on the FPRs for detection, even under adversarial attacks. ", "page_idx": 1}, {"type": "text", "text": "A new framework for robust and agile plug-and-play image watermark learning In contrast to encoder-decoder techniques that insert fixed binary watermarks into latent spaces, we propose to embed learnable watermarks, matching the image dimensions, into both the frequency and spatial domains of the original images. To differentiate between watermarked and unwatermarked samples, we utilize a classifier, e.g., a convolutional neural network (CNN), and perform joint training for both the watermarks and the classifier. The proposed framework offers several beneftis, including enhanced computational efficiency achieved through batch processing for watermark injection post joint training. For instance, our experimental results demonstrate time efficiency enhancements, approximately $30\\times$ $(200\\times)$ faster than the frequency-based (encoder-decoder based) method, respectively. Moreover, it can be readily integrated with other state-of-the-art techniques to further enhance robustness and generalizability, such as adversarial training [18, 19], and contrastive learning [20, 21]. ", "page_idx": 1}, {"type": "text", "text": "", "page_idx": 2}, {"type": "text", "text": "Provable guarantees on FPRs even under adversarial attacks without distributional assumptions By integrating methods from the conformal prediction literature [22, 23] into our RAW framework, we showcase its ability to offer rigorous, distribution-free assurances regarding the FPRs. Additionally, we develop a novel technique, inspired by the randomized smoothing [24, 25], to further enhance our provable guarantees. This technique ensures certified guarantees on FPRs under arbitrary perturbations, including those adversarial with bounded norms. That is, as long as any transformations on test images stay within a predefined range, our guarantee on FPRs remains valid. ", "page_idx": 2}, {"type": "text", "text": "Extensive empirical studies on various datasets & extension to video watermark We evaluate the effectiveness of our proposed method across various generative data scenarios, such as the DBDiffusion [26] and MS-COCO [27]. Additionally, we discuss how to extend the proposed framework for video watermarking and provide empirical results to demonstrate its effectiveness. Our assessment includes detection performance, robustness against image manipulations/attacks, the computational efficiency of watermark injection, and the quality of generated images. Experimental results consistently affirm the excellent performance of our approach, as evidenced by significantly improved watermark encoding speed and notable enhancements in detection performance against state-of-the-art adversarial attacks aimed at removing watermarks. ", "page_idx": 2}, {"type": "text", "text": "1.2 Related Work ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Classical watermarking techniques for images Image watermarking has long been a fundamental problem in both signal processing and computer vision literature [9, 28]. Methods for image-based watermarking typically operate within either the spatial or frequency domains [9, 29]. Within the spatial domain, methodologies span from basic approaches, such as the manipulation of the least significant bit of individual pixels, to more complex strategies like Spread Spectrum Modulation [30, 31]. In the frequency domain, watermark embedding [9, 32] involves modifying coefficients generated by transformations such as the Discrete Cosine Transform [33]. ", "page_idx": 2}, {"type": "text", "text": "Image watermarking using deep learning & Watermark for diffusion models The advent of advanced deep learning techniques has opened up new avenues for watermarking. Many of these methods [34, 35, 36, 10, 17, 11], are based on the encoder-decoder architecture. In this model, the encoder embeds a binary code into images in latent representations, while the decoder takes an image as input and generates a binary code for comparison with the binary code injected for watermark verification. For example, the HiDDeN technique [36] involves the simultaneous training of encoder and decoder networks, incorporating noise layers specifically crafted to simulate image perturbations. While these methods improve robustness over traditional watermarking, they might not be suitable for real-time watermark injection due to the lengthy feed-forward process in the encoder, especially with larger architectures. Most recently, there has been a line of work focusing on designing watermarks specifically for diffusion models [5, 8, 37]. These methods benefti from improved robustness due to their model-specific design, but the applicability to other types of models is not yet well established. ", "page_idx": 2}, {"type": "text", "text": "Watermarks for protecting model intellectual property Deep neural networks represent valuable intellectual assets, given the significant resources invested in their training and data collection processes [1]. For example, training stable diffusion models consumes approximately 150,000 GPU hours, amounting to roughly $^{\\S600,000}$ in costs [38]. Given their broad applications in realworld scenarios, ensuring copyright protection and facilitating their identification is crucial in both normal and adversarial contexts [39, 40]. Some approaches embed watermarks directly into model parameters [41], necessitating white-box access for inspection. Others [42, 43] rely on backdoor attacks [44, 45, 46, 47], injecting triggers into training data to enable targeted predictions during testing. These methods primarily focus on safeguarding model intellectual property rather than the generated outputs. ", "page_idx": 2}, {"type": "text", "text": "2 Preliminary ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Notations. We consider the problem of embedding watermarks into images and then detecting the watermarks as a binary classification problem. Let $\\boldsymbol{\\mathcal{X}}=[0,1]^{C\\times W\\times H}$ be the input space, with $C$ , $W$ , and $H$ being the channel, width and height of images, respectively. We denote $\\bar{\\mathcal{D}}=\\{0,1\\}$ to be the label space, with label 0 indicating unwatermarked and 1 indicating watermarked versions, respectively. For a vector $v$ , we use $\\lVert v\\rVert$ to denote its $\\ell_{2}$ -norm. ", "page_idx": 2}, {"type": "text", "text": "Threat Model. We consider the following use scenario of watermarks between a third-party user Alice, e.g., an artist, a generative model provider Bob, e.g., DALLE-2 from OPENAI, and an adversary Cathy. (1) Alice selects a diffusion model (DM) from Bob’s API interface and sends an input (e.g., a prompt for text-to-image diffusion models) to Bob for generating images. (2) Upon receiving Bob generated images $X\\in\\mathcal{X}$ , Alice embeds a watermark into $X$ , denoted as $X^{\\prime}\\in\\mathcal{X}$ , and releases it to the public. (3) Adversary Cathy applies (adversarial) image transformation(s), e.g., rotating and cropping, on $X^{\\prime}$ to obtain a modified version $\\widetilde{X}^{\\prime}(\\in\\mathcal{X})$ . (4) Alice decides if ${\\widetilde{X}}^{\\prime}$ was generated by herself or not. ", "page_idx": 3}, {"type": "text", "text": "Problem Formulation. From the above, the watermark problem for Alice essentially boils down to a binary classification or hypothesis testing problem: ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathrm{~H_0:\\widetilde{\\calX}^\\prime~w a s~g e n e r a t e d~b y~A l i c e~(W a t e r m a r k e d)~};}\\\\ &{\\mathrm{~H_1:\\widetilde{\\calX}^\\prime~w a s~N O T~g e n e r a t e d~b y~A l i c e~(U n w a t e r m a r k e d)~}.}\\end{array}\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "To address this problem, Alice will build a detector given by ", "page_idx": 3}, {"type": "equation", "text": "$$\ng(\\mathcal{V}_{\\theta}(X))=\\left\\{1(\\mathrm{Watermarked})\\quad\\mathrm{if}\\;\\mathcal{V}_{\\theta}(X)\\geq\\tau,\\right.\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "where $\\tau\\in\\mathbb{R}$ is a threshold value and $\\lvert\\nu_{\\theta}$ (to be defined later) is a scoring function which takes the image input and output a value in [0, 1] to indicate its chance of being a sample generated by Alice. ", "page_idx": 3}, {"type": "text", "text": "Alice’s Goals. Alice’s objective is to design watermarking algorithms that fulfill the following objectives: (1) Quality: the quality of watermarked images should closely match that of the original, unwatermarked images; (2) Identifiability: both watermarked and unwatermarked content should be accurately distinguishable; (3) Robustness: the watermark should be resilient against various image manipulations. ", "page_idx": 3}, {"type": "text", "text": "Cathy’s (Adversary) Goals. Cathy aims to design attack algorithms to meet the following objectives: (1) Watermark Removal: the watermarks embedded by Alice can be effectively eliminated after the attacks; (2) Quality: the attacks cannot significantly alter the images. ", "page_idx": 3}, {"type": "text", "text": "3 RAW ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "In this section, we formally introduce our RAW framework. At a high level, the RAW framework comprises two consecutive stages: a training stage and an inference stage, as outlined in Figure 2 in Appendix. In the following subsection, we first provide an in-depth description of the training stage. ", "page_idx": 3}, {"type": "text", "text": "3.1 Training stage ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Suppose Alice obtains a batch of diffusion model-generated images. The unwatermarked data are denoted as ${\\mathcal{D}}^{\\mathrm{uwm}}\\,\\triangleq\\,\\{X_{i}\\}_{i=1}^{n}$ for $i=1,\\hdots,n$ . Alice will need to embed watermarks into these images to protect intellectual property. ", "page_idx": 3}, {"type": "text", "text": "Definition 3.1 (Watermarking Module). A watermarking module $\\mathcal{E}_{w}(\\cdot)$ maps $\\mathcal{X}$ to itself, with parameters w ∈Rd1. ", "page_idx": 3}, {"type": "text", "text": "The watermarking module can take the form of an encoder with an attention mechanism, as seen in the RivaGan [10], or it can involve Fast Fourier Transformation (FFT) followed by frequency adjustments and an inverse FFT, as employed in DwtDct. ", "page_idx": 3}, {"type": "text", "text": "In our RAW framework, we propose to add two distinct watermarks into both frequency and spatial domains: ", "page_idx": 3}, {"type": "equation", "text": "$$\n{\\mathcal{E}}_{w}(X)={\\mathcal{F}}^{-1}({\\mathcal{F}}(X)+c_{1}\\times v)+c_{2}\\times u,\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "where $v,u\\in\\mathcal{X}$ are two watermarks, $c_{1},c_{2}>0$ determine the visibility of these watermarks, and ${\\mathcal{F}}({\\mathcal{F}}^{-1})$ represents the Fast Fourier Transformation (FFT) (inverse FFT), respectively. For simplicity of notation, in the rest of this paper, we will denote $\\pmb{w}\\triangleq[u,v]$ . For implementation, we clip the watermarked image ${\\mathcal{E}}_{w}(X)$ to be within the range $[0,1]$ , making ${\\mathcal{E}}_{w}(X)$ a non-linear function of $X$ . ", "page_idx": 3}, {"type": "text", "text": "The rationale for adopting the above approach is to simultaneously enjoy the distinct advantages offered by watermarks in both domains. In particular, the incorporation of watermark patterns in the frequency domain has been widely recognized for its effectiveness against certain image manipulations such as translations and resizing. Moreover, our empirical validation corroborates the improved robustness of spatial domain watermarking in the presence of noise perturbations. ", "page_idx": 3}, {"type": "text", "text": "", "page_idx": 4}, {"type": "text", "text": "We denote the watermarked dataset $\\mathcal{E}_{w}$ to be $\\mathcal{D}^{\\mathrm{wm}}$ ≜ $\\{\\mathcal{E}_{w}(X_{i})\\}_{i=1}^{n}$ for $i=1,\\hdots,n$ . Alice now wishes to distinguish the combined dataset $\\begin{array}{r}{D\\triangleq\\mathcal{D}^{\\mathrm{uwm}}\\bigcup\\mathcal{D}^{\\mathrm{wm}}}\\end{array}$ with a verification module, which is a binary classifier. ", "page_idx": 4}, {"type": "text", "text": "Definition 3.2 (Verification Module). A verification module is a mapping $\\mathcal{V}_{\\theta}(\\cdot)\\,:\\,\\mathcal{X}\\,\\mapsto\\,[0,1]$ parameterized by θ ∈Rd2. ", "page_idx": 4}, {"type": "text", "text": "The score generated by the verification module for an input image can be understood as the chance of this image being generated by Alice. ", "page_idx": 4}, {"type": "text", "text": "To fulflil Alice’s first two goals, Alice will consider jointly training the watermarking and verification modules parameterized by $\\pmb{w}$ and $\\theta$ , with the following loss function: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\mathrm{BCE}({\\mathcal{D}})\\triangleq\\sum_{X\\in{\\mathcal{D}}}Y\\log(\\mathcal{V}_{\\theta}(X))+(1-Y)\\log(1-\\mathcal{V}_{\\theta}(X)),\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $X$ is the training image and $Y\\in\\{0,1\\}$ is the label indicting $X$ is watermarked or not. ", "page_idx": 4}, {"type": "text", "text": "Recall that Alice also aims to enhance the robustness of the watermark algorithms. As a result, we consider transforming the combined datasets with different data augmentations $\\mathcal{M}_{1},\\ldots,\\mathcal{M}_{m}$ to obtain $\\mathcal{D}^{1}\\triangleq\\mathcal{M}_{1}(\\mathcal{D}),\\,.\\,.\\,.\\,,\\mathcal{D}^{m}\\triangleq\\mathcal{M}_{m}(\\mathcal{D})$ , respectively. Here, the data augmentations $\\mathcal{M}_{1},\\ldots,\\mathcal{M}_{m}$ are defined as follow. ", "page_idx": 4}, {"type": "text", "text": "Definition 3.3 (Modification Module). An image modification module is a map $\\mathcal{M}:\\mathcal{X}\\mapsto\\mathcal{X}$ . ", "page_idx": 4}, {"type": "text", "text": "To sum up, the overall loss function for our RAW framework is specified as: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\mathcal{L}_{\\mathrm{raw}}\\triangleq\\operatorname{BCE}(\\mathcal{D})+\\sum_{k=1}^{m}\\operatorname{BCE}(\\mathcal{D}^{k}),\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $\\mathrm{BCE}(\\cdot)$ denotes the binary cross entropy loss as specified in Equation (3). The loss function above is composed of two terms: $\\mathrm{BCE}({\\mathcal{D}})$ , which corresponds to the cross-entropy on the original combined datasets $\\mathcal{D}$ , and $\\textstyle\\sum_{k=1}^{m}\\operatorname{BCE}(D^{k})$ , signifying the cross-entropy on the augmented datasets $\\mathcal{D}^{1},\\ldots,\\mathcal{D}^{m}$ . In our experiments, inspired by contrastive learning such as those presented in [20, 21], we adopt a two-view data augmentation approach by setting $m=2$ . ", "page_idx": 4}, {"type": "text", "text": "3.1.1 Overall Training Algorithm ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "We describe the overall training algorithm below. For completeness, we provide the full pseudo-code as summarized in Algorithm 3 in the appendix. We consider conducting the following two steps alternatively. ", "page_idx": 4}, {"type": "text", "text": "• Optimize the verification module $\\lvert\\l\\rangle_{\\theta}$ based on the overall loss $\\mathscr{L}_{\\mathrm{raw}}$ by stochastic gradient descent (SGD): $\\theta_{t+1}\\gets\\theta_{t}-\\mu_{t}\\nabla_{\\theta}\\mathcal{L}_{\\mathrm{raw}}(\\theta_{t},{\\boldsymbol w}),$ where $\\mu_{t}>0$ is the step size at each step $t$ .   \n• Optimize the watermark $\\pmb{w}$ based on $\\scriptstyle{\\mathcal{L}}_{0}$ , defined as the first term on the right-hand side of Equation (4), with sign-based stochastic gradient descent (SignSGD): ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\pmb{w}_{t+1}\\gets\\pmb{w}_{t}-\\nu_{t}\\,\\mathrm{sign}\\,(\\nabla_{\\pmb{w}}\\mathcal{L}_{0}(\\pmb{\\theta},\\pmb{w}_{t}))\\,,\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $\\mathrm{{sign}(\\cdot)}$ outputs the sign of each component, and $\\nu_{t}>0$ is the step size. ", "page_idx": 4}, {"type": "text", "text": "We provide two remarks on the optimization procedure for the watermark update, as outlined in Eq. (5). First, we choose signSGD over conventional SGD, based on empirical findings suggesting that (sign-based) first-order methods can improve both training and test performance in data-level optimization tasks [19, 48, 49]. In our context, this refers to cases where the optimized variable is the watermark rather than the model parameters. Second, we focus the watermark optimization solely on the first term because the other terms, $\\operatorname{BCE}(\\mathcal{D}^{k})$ for $k\\,=\\,1,2,\\dots,m$ , may contain non-differentiable elements with respect to the watermark. These non-differentiable parts make gradient-based optimization impractical. ", "page_idx": 4}, {"type": "text", "text": "3.2 Inference Stage ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "We present a generic approach for Alice to obtain provable guarantees on the FPRs when using the previously trained $\\lvert\\l\\rangle_{\\theta}$ on test images, even amidst adversarial perturbations. ", "page_idx": 5}, {"type": "text", "text": "To begin with, we first examine a scenario where the future test data $X_{\\mathrm{test}}\\,\\in\\,\\chi$ adheres to an IID pattern with the watermarked data $\\mathcal{D}^{\\mathrm{wm}}$ generated by Alice, without undergoing any image modifications. In this case, Alice can employ conformal prediction to establish provable guarantees on the FPRs. The main idea is that, by utilizing the trained $\\lvert\\nu_{\\theta}$ as a scoring mechanism, the empirical quantile of the watermarked data’s distribution will converge to the population counterpart. This convergence is guaranteed by the uniform convergence of cumulative distribution functions (CDFs). To be more specific, we set the threshold $\\tau$ defined in Equation (1) to be the $\\alpha$ -quantile (with finitesample corrections) of the predicted scores for watermarked data, $\\mathcal{V}_{\\theta}({\\mathcal{D}}^{\\mathrm{wm}})\\triangleq\\{\\mathcal{V}_{\\theta}({\\mathcal{E}}_{w}(X_{i}))\\}_{i=1}^{n}$ . Following [23, 46], it can be shown that, with high probability, the probability of the resulting detector $g$ misclassifying a watermarked image $X_{\\mathrm{test}}$ is upper-bounded by $\\alpha$ , given that $X_{\\mathrm{test}}$ is IID with $\\mathcal{D}^{\\mathrm{wm}}$ . For completeness, a rigorous statement and its proof are provided in Appendix A.2. ", "page_idx": 5}, {"type": "text", "text": "The above argument assumes that the future test image $X_{\\mathrm{test}}$ follows an IID pattern with the original watermarked data $\\mathcal{D}^{\\mathrm{wm}}$ . However, if the test image $X_{\\mathrm{test}}$ undergoes manipulation or attack, denoted by $\\ensuremath{\\mathcal{A}}(X_{\\mathrm{test}})$ , with $\\mathcal{A}:\\mathcal{X}\\mapsto\\mathcal{X}$ being an adversarial image manipulation, then it can deviate from the distribution of $\\mathcal{D}^{\\mathrm{wm}}$ . This deviation from IID will render the previous argument invalid. Moreover, in practice, Alice is unaware of the adversarial transformation $\\boldsymbol{\\mathcal{A}}$ employed by the attacker, thus making it even more challenging to control the FPRs. ", "page_idx": 5}, {"type": "text", "text": "To address this problem, we propose to consider a robust version of the originally trained $\\lvert\\l\\rangle_{\\theta}$ , denoted as $\\tilde{\\nu}$ , such that $X$ and ${\\mathcal{A}}(X)$ stay close under $\\tilde{\\nu}$ , namely ", "page_idx": 5}, {"type": "equation", "text": "$$\n|\\tilde{\\mathcal{V}}(X)-\\tilde{\\mathcal{V}}(A(X))|\\leq\\eta,\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "for all $X$ and a small $\\eta>0$ . The reason for finding such $\\tilde{\\nu}$ is because we can relate $\\tilde{\\mathcal{V}}(A(X_{\\mathrm{test}}))$ back to $\\tilde{\\mathcal{V}}(X_{\\mathrm{test}})$ which is IID with $\\tilde{\\mathcal{V}}(\\mathcal{D}^{\\mathrm{wm}})$ (accessible to Alice) to establish the FPRs with previous arguments. ", "page_idx": 5}, {"type": "text", "text": "To develop the robust version from the base $\\lvert\\l\\rangle_{\\theta}$ , we will build upon the following result from the randomized smoothing literature. Denote $\\mathcal{N}(\\mu,\\Sigma)$ to be the normal distribution with mean $\\mu$ and covariance $\\Sigma$ respectively, and $\\Phi^{-1}(\\cdot)$ to be the inverse of the cumulative distribution function of a standard normal distribution. ", "page_idx": 5}, {"type": "text", "text": "Lemma 3.4 ([50, 51]). Let $h:\\mathbb{R}\\to[0,1]$ be a continuous function. Let $\\sigma\\,>\\,0$ , and $H(X)=$ $\\underset{Z\\sim\\mathcal{N}(0,\\sigma^{2}I)}{\\mathbb{E}}[h(X+Z)]$ . Then the function $\\mathring{\\Phi}^{-1}(H(X))$ is $\\sigma^{-1}$ -Lipschitz with respect to $\\ell_{2}$ norm. ", "page_idx": 5}, {"type": "text", "text": "The above result suggests that for any (continuous) base verification module (classifier) $\\lvert\\nu_{\\theta}$ , we can obtain a smoothed version with ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\tilde{\\mathcal{V}}(X)=\\Phi^{-1}\\bigg(\\underset{Z\\sim\\mathcal{N}(0,\\sigma^{2}I)}{\\mathbb{E}}[\\mathcal{V}_{\\theta}(X+Z)]\\bigg),}\\end{array}\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "and it is guaranteed that $|\\tilde{\\mathcal{V}}(X)-\\tilde{\\mathcal{V}}(Y)|\\leq\\sigma^{-1}\\|X-Y\\|$ , for any $X,Y\\in\\mathcal{X}$ . Suppose the attacker employs an adversarial attack $\\boldsymbol{\\mathcal{A}}$ such that $\\|X-A(X)\\|\\leq\\gamma$ . We have ", "page_idx": 5}, {"type": "equation", "text": "$$\n|\\tilde{\\mathcal{V}}(X)-\\tilde{\\mathcal{V}}(A(X))|\\leq\\frac{\\gamma}{\\sigma}.\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "Remark 3.5 ( $\\lambda$ can not be excessively adversarial). We emphasize that the transformation $\\boldsymbol{\\mathcal{A}}$ should not be excessively adversarial. In other words, the parameter $\\gamma$ should be a very low value for both theoretical and practical reasons. From a theoretical perspective, an overly adversarial transformation $\\boldsymbol{\\mathcal{A}}$ can result in trivial TPRs/FPRs. For instance, if watermarked images are transformed into a completely uniform all-white or all-black state, it becomes impossible to detect the watermark. From a practical standpoint, an excessively adversarial transformation $\\boldsymbol{\\mathcal{A}}$ tends to overwrite the original content within the images. This directly contradicts the intentions of attackers and may not achieve the desired stealthy modifications. ", "page_idx": 5}, {"type": "text", "text": "3.2.1 Overall Inference Algorithm ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "Given a pair of $(\\mathcal{E}_{w},\\mathcal{V}_{\\theta})$ , a desired robust range $\\gamma>0$ , and a smoothing parameter $\\sigma>0$ , Alice now will set the thresholding value $\\tau$ , as introduced in Equation (1), to satisfy: ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\hat{F}\\big(\\tau+\\frac{\\gamma}{\\sigma}\\big)=\\alpha-\\sqrt{(\\log(2/\\delta)/(2n))},\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "where $\\delta\\in(0,1)$ is a violation rate describing the probability that the FPRs exceeds $\\alpha$ , and $\\hat{F}$ is the empirical cumulative distribution function of $\\{\\tilde{\\mathcal{V}}(\\mathcal{E}_{w}(X_{i}))\\}_{i=1}^{n}$ , where ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\tilde{\\mathcal{V}}(\\mathcal{E}_{w}(X_{i}))\\triangleq\\Phi^{-1}\\binom{\\mathbb{E}}{Z\\sim\\mathcal{N}(0,\\sigma^{2}I)}\\big[\\mathcal{V}_{\\theta}(\\mathcal{E}_{w}(X_{i})+Z)\\big]\\bigg).}\\end{array}\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "The next result shows that if a future test input comes from the same distribution as the watermarked data $\\mathcal{D}^{\\mathrm{wm}}$ , the above procedure can be configured to achieve any pre-specified false positive rate $\\alpha$ with high probability. ", "page_idx": 6}, {"type": "text", "text": "Theorem 3.6 (Certified FPRs of $g$ based on threshold in Equation (9)). Given any watermarked dataset $\\mathcal{D}^{w m}$ and its associated verification module $\\lvert\\nu_{\\theta}$ , suppose that the test data $X_{t e s t}$ are IID drawn from the distribution of ${\\mathcal{D}}^{w m}$ . Given any $\\delta\\in(0,1)$ , $\\gamma>0$ and $\\sigma>0$ , for any (adversarial) image transformations $\\boldsymbol{\\mathcal{A}}$ such that $\\|A(X)-X\\|\\leq\\gamma$ for all $X\\in\\mathcal{X}$ , the robust verification module $\\tilde{V}$ specified in Eq. (7) and its corresponding hard-label detector $g(\\cdot)$ introduced in Eq. (1), with the threshold $\\tau$ as specified in Eq. (9) satisfy ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\mathbb{P}\\bigg(g(\\tilde{V}(\\boldsymbol{A}(X_{t e s t})))=0\\left(U n w a t e r m a r k e d\\right)\\mid\\mathcal{D}^{w m}\\bigg)\\le\\alpha,\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "with probability at lease $1-\\delta$ for any $\\alpha\\in(0,1)$ such that $\\alpha>\\sqrt{(\\log(2/\\delta)/(2n))}$ . ", "page_idx": 6}, {"type": "text", "text": "Due to space constraints, the proof is provided in Appendix A.1. The above result shows that by using the decision rule as specified in Equation (9), Alice can obtain a provable guarantee on the Type I error rate in terms of detecting future test input $X_{\\mathrm{test}}$ even $X_{\\mathrm{test}}$ is adversarially perturbed within $\\gamma.$ -range (as measured by $\\ell_{2}$ -norm), under the condition that the future test input $X_{\\mathrm{test}}$ is independently and identically distributed as the $\\mathcal{D}^{\\mathrm{wm}}$ , namely watermarked samples generated by the artist. Moreover, the result above only addresses the detector’s performance in terms of FPRs and does not account for True Positive Rates (TPRs). To achieve high TPRs, careful selection of $\\gamma$ and $\\sigma$ is essential. For instance, an excessively large $\\sigma$ will cause the smoothed classifier $\\tilde{\\nu}$ to lose its detection capability. ", "page_idx": 6}, {"type": "text", "text": "4 Experiments ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "In this section, we conduct a comprehensive evaluation of our proposed RAW, including (1) detection performance, (2) robustness, (3) watermarking speed, (4) the quality of watermarked images, and (5) the provable FPRs guarantees under adversarial attacks. Our findings reveal significantly enhanced robustness in RAW while preserving the quality of generated images. Furthermore, a substantial reduction in watermark injection time, indicates the suitability of RAW for on-the-fly deployment. All the experiments were conducted on machines equipped with Nvidia Tesla A100s. ", "page_idx": 6}, {"type": "text", "text": "4.1 Experimental setups ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "Datasets (1) In line with the previous work [8], we employ Stable Diffusion-v2-1 [1], an open-source text-to-image diffusion model, with DDIM sampler, to generate images. All the prompts used for image generation are sourced from the MS-COCO dataset [27]. (2) We further evaluate our RAW utilizing DBdiffusion [26], a dataset consisting of 14 million images generated by Stable Diffusion. This dataset encompasses a wide array of images produced under various prompts, samplers, and userdefined hyperparameters. Ablation studies examining various generative models, such as SDXL-1.0, are detailed in Appendix D. ", "page_idx": 6}, {"type": "text", "text": "Verification Modules/Classifiers In terms of verification modules, for all the results reported in the main text, we utilize ResNet 18 [52]. For training the verification modules, 500 images are randomly selected for training for each dataset. Subsequently, we evaluate the trained watermarks and associated models on 1000 new, unwatermarked images and their watermarked versions. Ablation studies on using different models, such as VGG [53] as verification modules, and different number of training data are provided in Section 4.4 and Appendix D. ", "page_idx": 6}, {"type": "text", "text": "Table 2: Summary of main results. ‘N-ROC’ denotes the AUROC performance without image manipulations or adversarial attacks. ‘Ad-ROC’ represents the average performance across nine distinct image manipulations and attacks. The ‘Encoding Speed’ column denotes the efficiency of injecting watermarks into images post-training, measured in seconds (CPU time) per image. ", "page_idx": 7}, {"type": "table", "img_path": "ogaeChzbKu/tmp/d63c4b0f8bfa0301f3929b8e89f7c42d10a0e58847b37f0b788a27fec1541445.jpg", "table_caption": [], "table_footnote": [], "page_idx": 7}, {"type": "table", "img_path": "ogaeChzbKu/tmp/2eb87c1212d99cecaa318fe123e4db19cef71a48d4081152c2633a803bb23206.jpg", "table_caption": ["Table 3: AUROC performance of state-of-the-art methods under 9 (adversarial) image manipulations: Rotation $90^{\\circ}$ , Cropping and resizing $70\\%$ , Gaussian Blur with a kernel size of $(7,9)$ and bandwidth of 4, Noise with IID mean Gaussian $\\sigma=0.05$ , Jitter with brightness factor 0.6, JPEG compression with quality 50, and 3 attacks (VAE Att1, VAE Att2, Diff Att). "], "table_footnote": [], "page_idx": 7}, {"type": "text", "text": "Watermark Parameters In Equation (2) of RAW, two parameters $c_{1}$ and $c_{2}$ control the invisibility of the watermark, thereby influencing the quality of watermarked images. In the main text results, we set $c_{1}=c_{2}=0.05$ to align with the image quality of watermarked images produced by other stateof-the-art methods (refer to the ‘FID’ and ‘CLIP’ columns in Table 2). We conduct an ablation study exploring different values of $c_{1}$ and $c_{2}$ in Section 4.4 and Appendix D. For all other watermarking techniques, we implement them using the open-source package employed by the Official Stable Diffusion Model. ", "page_idx": 7}, {"type": "text", "text": "Evaluation Metrics (1) To assess the detection performance, we adhere to the convention of reporting the area under the curve of the receiver operating characteristic (AUROC) [17, 5]. (2) For evaluating the quality of the watermarked images, we adopt both the Frechet Inception Distance (FID) [54] and the CLIP score [55], following the methodology outlined in [8]. Additionally, we also evaluate the quality of watermarked images using metrics such as PSNR and SSIM, and include the results in the appendix. For our watermark scheme, each independent run (including training and testing) corresponds to a unique watermark. All metrics are averaged across 5 independent runs, with a standard deviation of 0.03 for all detection performances (AUROC) and 0.7 for image quality metrics. ", "page_idx": 7}, {"type": "text", "text": "4.2 Main Results ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "Detection performance and image generation quality To ensure a fair comparison, we primarily evaluate our proposed RAW against other model-agnostic approaches, presenting the summarized results in Table 2, along with visual examples illustrated in Appendix D.4. Additionally, for completeness, we compare our proposed RAW against model-specific methods and provide the results in the appendix. Our RAW exhibits comparable performance to encoder-decoder-based approaches, e.g., RivaGAN, while concurrently achieving similar FID and CLIP scores, which underscores superior image quality compared to alternatives. We report the PSNR and SSIM of the watermarked images in the Table 6 in the appendix. Our method outperforms StegaStamp in PSNR and SSIM but falls behind DwtDctSvd and RivaGAN, as expected. StegaStamp prioritizes robust detection by injecting significant noise, reducing image quality. In contrast, DwtDctSvd and RivaGAN maintain better image quality at the cost of reduced robustness to image perturbations, a point further detailed in the next paragraph. ", "page_idx": 7}, {"type": "text", "text": "", "page_idx": 8}, {"type": "text", "text": "Robust detection performance We assess the robustness of our proposed RAW against six common data augmentations and three adversarial attacks in this subsection. The data augmentation set comprises: color jitter with a brightness factor of 0.5, JPEG compression with quality 50, rotation by $90^{\\circ}$ , addition of Gaussian noise with 0 mean and standard deviation 0.05, Gaussian blur with a kernel size of $(7,9)$ and bandwidth 4, and $70\\%$ random cropping and resizing. For adversarial attacks, we select three state-of-the-art methods for removing watermarks, with two VAE-based attacks Bmshj2018 [14] (VAE Att1) and Cheng2020 [56] (VAE Att2) from CompressAI [57] with compression factors are set to 3 for both models, and one diffusion-model attack with noise steps of 60 following [58]. ", "page_idx": 8}, {"type": "text", "text": "The averaged results are in the ‘AUROC (Adv)’ column of Table 2 and the detailed results are summarized in Table 3. Our approach demonstrates superior performance compared with alternative methods. Specifically, across both datasets, the average AUROC for our RAW increased by $70\\%$ and $13\\%$ for nine image manipulations/attacks, surpassing frequency- and encoder-decoder-based methods. We note that Stegastamp demonstrates similar averaged robust detection performance compared to ours. However, this comes at the expense of reduced image quality, as evidenced by markedly increased FID scores and/or lowered SSIM/PSNR scores. ", "page_idx": 8}, {"type": "table", "img_path": "ogaeChzbKu/tmp/5ad08053ce86bf3e051c1d62bd20dab376e93ec23a5089ae23559035e7b70b0b.jpg", "table_caption": ["Table 4: CPU time (seconds) elapsed for injecting watermarks into images. Lower values are preferred. "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "Watermark injection speed We investigate the time costs needed to embed watermarks into images. We note that the watermark injection process occurs post-training. Therefore, our watermark injections only necessitate one FFT, two additions, and another inverse FFT. In Table 4, we present CPU time (in seconds) elapsed for injecting watermarks into different image quantities. Notably, our method achieves substantial time efficiency ", "page_idx": 8}, {"type": "text", "text": "improvements, approximately $\\bf{30\\times(200\\times)}$ faster than the frequency-based (encoder-decoder based) method, respectively. This is attributed to streamlined batch operations in our RAW. This highlights the suitability of our approach for on-the-fly deployment. ", "page_idx": 8}, {"type": "text", "text": "4.3 Certified FPRs ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "We assess the certified FPRs performance of our proposed RAW by varying the FPRs rate $\\alpha$ prespecified by Alice. We set the adversaril radius $\\gamma=0.001$ and the smoothing parameter $\\sigma=0.05$ . We summarize the results of five independent runs in Figure 1(a) and report the mean (with standard error $<0.002\\$ . The results show that the FPRs of RAW consistently matches the theoretical upper bounds (i.e., $\\alpha$ ), supporting the result presented in Theorem 3.6. ", "page_idx": 8}, {"type": "text", "text": "4.4 Ablation Studies ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "Effect of training sample size on prediction performance We manipulate the sample size of the watermarked training dataset $\\mathcal{D}^{\\mathrm{wm}}$ to assess its impact on detection performance. These findings are illustrated in Figure 1(b), where we note that satisfactory detection performance can be achieved with a reasonably small training dataset, e.g., 100 images. ", "page_idx": 8}, {"type": "text", "text": "Trade-off between robustness and image quality We explore the trade-off between robustness and image quality by adjusting the watermark strength parameters $c_{1}$ $\\left(=c_{2}\\right)$ , as illustrated in Figure 1 (c) & (d) below. We note that with increasing values of $c_{1}$ and $c_{2}$ , the average AUROC, under 9 (adversarial) images manipulations, also increases, while the image quality only exhibits a slight degradation, as indicated by the slightly increased FID value. These findings also highlight the stability of the watermark hyperparameters $c_{1}$ and $c_{2}$ in our proposed RAW, a desirable characteristic for real-world deployments, as preferred by practitioners. ", "page_idx": 8}, {"type": "text", "text": "", "page_idx": 9}, {"type": "image", "img_path": "ogaeChzbKu/tmp/66a515bc2793facf7ca32bcd56aded50dab0e795649ac2c3cbf661a9c73293b7.jpg", "img_caption": ["Figure 1: (a) FPRs of our proposed RAW. (b) Impact of training sample size on detection performance. (c) & (d) The tradeoff between the quality of watermarked images, assessed using FID (lower values are preferable), and the detection robustness. "], "img_footnote": [], "page_idx": 9}, {"type": "text", "text": "4.5 Extension to Video Watermark ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "We discuss how to extend the proposed watermark framework from AI generated images to videos. The main idea is to embed the same pre-trained watermark either in every frame or at intervals, such as every three frames, of the video. The corresponding verification module, i.e., the watermark classifier, is then used to detect the watermark in each frame where it was embedded. The overall presence of the watermark in the video is determined by the detection results from these frames. ", "page_idx": 9}, {"type": "text", "text": "We evaluate the pre-trained (on the MS-COCO dataset) watermark and its corresponding classifier using short videos created by the stable-video-diffusion-img2vid-xt model, which generates videos from images. The images used to produce the videos are sourced from the DiffusionDB dataset. This guarantees that the testing videos were not exposed to either the watermark or the classifier during the training process. The results are summarized in Table 5 below, where we observed that our proposed method achieves a similar detection rate compared to RivaGan, while providing a significantly faster watermark encoding speed $\\times60$ times faster). ", "page_idx": 9}, {"type": "table", "img_path": "ogaeChzbKu/tmp/f6f0444c581b7a79dfd555977bd33905e7a3a3ed41b171c4b42b2aeb240cf016.jpg", "table_caption": ["Table 5: Encoding Speed (CPU Only) and AUROC (over fresh 500 test samples) for video watermark with the proposed RAW "], "table_footnote": [], "page_idx": 9}, {"type": "text", "text": "5 Conclusion ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "In this study, we introduce the RAW framework as a versatile watermarking approach essential for protecting intellectual property and mitigating potential misuse of AI-generated images. The proposed RAW framework offers several notable features, including significantly enhanced watermark encoding speed and/or detection performance, along with the assurance of provable guarantees on false positive rates even under adversarial perturbations in test images. Experimental findings across various datasets validate its advantages. ", "page_idx": 9}, {"type": "text", "text": "Limitation & Future Work One potential limitation of the proposed method is that when applied to large-scale systems with millions of users, the associated training loss will be high. One interesting direction is to study how to efficiently fine-tune from one pair of watermark and its corresponding verification module to a new pair. Other directions include investigating the maximum number of concurrent watermarks learnable in a single training session and optimal smoothing strategies for wider certified radii. ", "page_idx": 9}, {"type": "text", "text": "Broader Impact This paper aims to contribute to the advancement of trustworthy machine learning, particularly in ensuring the safe and legitimate use of contemporary generative artificial intelligence. Our efforts could have several positive societal implications, such as protecting intellectual property and preventing potential misuse of AI-generated images. ", "page_idx": 9}, {"type": "text", "text": "The Appendix contains proofs, experimental details, and ablation studies. ", "page_idx": 9}, {"type": "text", "text": "Acknowledgment ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "The work of Xun Xian, Xuan Bi, and Mingyi Hong was supported in part by a sponsored research award by Cisco Research. The work of Ganghua Wang and Jie Ding was supported in part by the Army Research Office Early Career Program Award under grant number W911NF2310315. ", "page_idx": 10}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "[1] R. Rombach, A. Blattmann, D. Lorenz, P. Esser, and B. Ommer, “High-resolution image synthesis with latent diffusion models,” in Proceedings of the IEEE/CVF conference on computer vision and pattern recognition, 2022, pp. 10 684–10 695.   \n[2] A. Ramesh, P. Dhariwal, A. Nichol, C. Chu, and M. Chen, “Hierarchical text-conditional image generation with clip latents, 2022,” URL https://arxiv. org/abs/2204.06125, vol. 7, 2022.   \n[3] L. Verdoliva, “Media forensics and deepfakes: an overview,” IEEE Journal of Selected Topics in Signal Processing, vol. 14, no. 5, pp. 910–932, 2020.   \n[4] M. Sag, “Copyright safety for generative ai,” Forthcoming in the Houston Law Review, 2023.   \n[5] P. Fernandez, G. Couairon, H. Jégou, M. Douze, and T. Furon, “The stable signature: Rooting watermarks in latent diffusion models,” in Proceedings of the IEEE/CVF International Conference on Computer Vision, 2023, pp. 22 466–22 477.   \n[6] G. Nie, C. Kim, Y. Yang, and Y. Ren, “Attributing image generative models using latent fingerprints,” arXiv preprint arXiv:2304.09752, 2023.   \n[7] C. Kim, K. Min, M. Patel, S. Cheng, and Y. Yang, “Wouaf: Weight modulation for user attribution and fingerprinting in text-to-image diffusion models,” arXiv preprint arXiv:2306.04744, 2023.   \n[8] Y. Wen, J. Kirchenbauer, J. Geiping, and T. Goldstein, “Tree-rings watermarks: Invisible fingerprints for diffusion images,” in Thirty-seventh Conference on Neural Information Processing Systems, 2023. [Online]. Available: https://openreview.net/forum?id $\\equiv$ Z57JrmubNl   \n[9] I. J. Cox, J. Kilian, T. Leighton, and T. Shamoon, “Secure spread spectrum watermarking for images, audio and video,” in Proceedings of 3rd IEEE international conference on image processing, vol. 3. IEEE, 1996, pp. 243–246.   \n[10] K. A. Zhang, L. Xu, A. Cuesta-Infante, and K. Veeramachaneni, “Robust invisible video watermarking with attention,” arXiv preprint arXiv:1909.01285, 2019.   \n[11] M. Tancik, B. Mildenhall, and R. Ng, “Stegastamp: Invisible hyperlinks in physical photographs,” in Proceedings of the IEEE/CVF conference on computer vision and pattern recognition, 2020, pp. 2117–2126.   \n[12] J. Song, C. Meng, and S. Ermon, “Denoising diffusion implicit models,” arXiv preprint arXiv:2010.02502, 2020.   \n[13] I. Cox, M. Miller, J. Bloom, J. Fridrich, and T. Kalker, Digital watermarking and steganography. Morgan kaufmann, 2007.   \n[14] J. Ballé, D. Minnen, S. Singh, S. J. Hwang, and N. Johnston, “Variational image compression with a scale hyperprior,” arXiv preprint arXiv:1802.01436, 2018.   \n[15] Q. Wang, “Invisible watermark,” https://github.com/ShieldMnt/invisible-watermark, 2022.   \n[16] I. Pitas, “A method for watermark casting on digital image,” IEEE Transactions on Circuits and Systems for Video Technology, vol. 8, no. 6, pp. 775–780, 1998.   \n[17] P. Fernandez, A. Sablayrolles, T. Furon, H. Jégou, and M. Douze, “Watermarking images in self-supervised latent spaces,” in ICASSP 2022-2022 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 2022, pp. 3054–3058.   \n[18] I. J. Goodfellow, J. Shlens, and C. Szegedy, “Explaining and harnessing adversarial examples,” arXiv preprint arXiv:1412.6572, 2014.   \n[19] A. Madry, A. Makelov, L. Schmidt, D. Tsipras, and A. Vladu, “Towards deep learning models resistant to adversarial attacks,” arXiv preprint arXiv:1706.06083, 2017.   \n[20] T. Chen, S. Kornblith, M. Norouzi, and G. Hinton, “A simple framework for contrastive learning of visual representations,” in International conference on machine learning. PMLR, 2020, pp. 1597–1607.   \n[21] P. Khosla, P. Teterwak, C. Wang, A. Sarna, Y. Tian, P. Isola, A. Maschinot, C. Liu, and D. Krishnan, “Supervised contrastive learning,” Advances in neural information processing systems, vol. 33, pp. 18 661–18 673, 2020.   \n[22] V. Vovk, A. Gammerman, and G. Shafer, Algorithmic learning in a random world. Springer, 2005, vol. 29.   \n[23] J. Lei and L. Wasserman, “Distribution-free prediction bands for non-parametric regression,” Journal of the Royal Statistical Society Series B: Statistical Methodology, vol. 76, no. 1, pp. 71–96, 2014.   \n[24] J. C. Duchi, P. L. Bartlett, and M. J. Wainwright, “Randomized smoothing for stochastic optimization,” SIAM Journal on Optimization, vol. 22, no. 2, pp. 674–701, 2012.   \n[25] J. Cohen, E. Rosenfeld, and Z. Kolter, “Certified adversarial robustness via randomized smoothing,” in international conference on machine learning. PMLR, 2019, pp. 1310–1320.   \n[26] Z. J. Wang, E. Montoya, D. Munechika, H. Yang, B. Hoover, and D. H. Chau, “Diffusiondb: A large-scale prompt gallery dataset for text-to-image generative models,” arXiv preprint arXiv:2210.14896, 2022.   \n[27] T.-Y. Lin, M. Maire, S. Belongie, J. Hays, P. Perona, D. Ramanan, P. Dollár, and C. L. Zitnick, “Microsoft coco: Common objects in context,” in Computer Vision–ECCV 2014: 13th European Conference, Zurich, Switzerland, September 6-12, 2014, Proceedings, Part V 13. Springer, 2014, pp. 740–755.   \n[28] S. Pereira, J. J. O. Ruanaidh, F. Deguillaume, G. Csurka, and T. Pun, “Template based recovery of fourier-based watermarks using log-polar and log-log maps,” in Proceedings IEEE international conference on multimedia computing and systems, vol. 1. IEEE, 1999, pp. 870–874.   \n[29] G. Gupta, V. Gupta, and M. Chandra, “Review on video watermarking techniques in spatial and transform domain,” in Information Systems Design and Intelligent Applications: Proceedings of Third International Conference INDIA 2016, Volume 2. Springer, 2016, pp. 683–691.   \n[30] H. O. Altun, A. Orsdemir, G. Sharma, and M. F. Bocko, “Optimal spread spectrum watermark embedding via a multistep feasibility formulation,” IEEE transactions on image processing, vol. 18, no. 2, pp. 371–387, 2009.   \n[31] F. Hartung and B. Girod, “Watermarking of uncompressed and compressed video,” Signal processing, vol. 66, no. 3, pp. 283–301, 1998.   \n[32] J. J. O’Ruanaidh and T. Pun, “Rotation, scale and translation invariant digital image watermarking,” in Proceedings of International Conference on Image Processing, vol. 1. IEEE, 1997, pp. 536–539.   \n[33] J. R. Hernandez, M. Amado, and F. Perez-Gonzalez, “Dct-domain watermarking techniques for still images: Detector performance analysis and a new structure,” IEEE transactions on image processing, vol. 9, no. 1, pp. 55–68, 2000.   \n[34] H. Kandi, D. Mishra, and S. R. S. Gorthi, “Exploring the learning capabilities of convolutional neural networks for robust image watermarking,” Computers & Security, vol. 65, pp. 247–268, 2017.   \n[35] J. Hayes and G. Danezis, “Generating steganographic images via adversarial training,” Advances in neural information processing systems, vol. 30, 2017.   \n[36] J. Zhu, R. Kaplan, J. Johnson, and L. Fei-Fei, “Hidden: Hiding data with deep networks,” in Proceedings of the European conference on computer vision (ECCV), 2018, pp. 657–672.   \n[37] Z. Yang, K. Zeng, K. Chen, H. Fang, W. Zhang, and N. Yu, “Gaussian shading: Provable performance-lossless image watermarking for diffusion models,” in Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, 2024, pp. 12 162–12 171.   \n[38] Wikipedia contributors. (2023) Stable diffusion. [Online]. Available: https://en.wikipedia.org/ wiki/Stable_Diffusion   \n[39] F. Tramèr, F. Zhang, A. Juels, M. K. Reiter, and T. Ristenpart, “Stealing machine learning models via prediction {APIs},” in 25th USENIX security symposium (USENIX Security 16), 2016, pp. 601–618.   \n[40] X. Xian, M. Hong, and J. Ding, “Understanding model extraction games,” in 2022 IEEE 4th International Conference on Trust, Privacy and Security in Intelligent Systems, and Applications (TPS-ISA). IEEE, 2022, pp. 285–294.   \n[41] Y. Uchida, Y. Nagai, S. Sakazawa, and S. Satoh, “Embedding watermarks into deep neural networks,” in Proceedings of the 2017 ACM on international conference on multimedia retrieval, 2017, pp. 269–277.   \n[42] Y. Adi, C. Baum, M. Cisse, B. Pinkas, and J. Keshet, “Turning your weakness into a strength: Watermarking deep neural networks by backdooring,” in 27th USENIX Security Symposium (USENIX Security 18), 2018, pp. 1615–1631.   \n[43] Y. Zhao, T. Pang, C. Du, X. Yang, N.-M. Cheung, and M. Lin, “A recipe for watermarking diffusion models,” arXiv preprint arXiv:2303.10137, 2023.   \n[44] T. Gu, B. Dolan-Gavitt, and S. Garg, “Badnets: Identifying vulnerabilities in the machine learning model supply chain,” arXiv preprint arXiv:1708.06733, 2017.   \n[45] X. Xian, G. Wang, J. Srinivasa, A. Kundu, X. Bi, M. Hong, and J. Ding, “Understanding backdoor attacks through the adaptability hypothesis,” in International Conference on Machine Learning. PMLR, 2023, pp. 37 952–37 976.   \n[46] X. Xian, G. Wang, J. Srinivasa, A. Kundu, X. Bi, M. Hong, and J. Ding, “A unified detection framework for inference-stage backdoor defenses,” in Advances in Neural Information Processing Systems, vol. 36, 2023, pp. 7867–7894.   \n[47] G. Wang, X. Xian, J. Srinivasa, A. Kundu, X. Bi, M. Hong, and J. Ding, “Demystifying poisoning backdoor attacks from a statistical perspective,” in International Conference on Learning Representations (ICLR), 2024.   \n[48] F. Liu, B. Han, T. Liu, C. Gong, G. Niu, M. Zhou, M. Sugiyama et al., “Probabilistic margins for instance reweighting in adversarial training,” Advances in Neural Information Processing Systems, vol. 34, pp. 23 258–23 269, 2021.   \n[49] Q. Wang, F. Liu, Y. Zhang, J. Zhang, C. Gong, T. Liu, and B. Han, “Watermarking for outof-distribution detection,” Advances in Neural Information Processing Systems, vol. 35, pp. 15 545–15 557, 2022.   \n[50] H. Salman, J. Li, I. Razenshteyn, P. Zhang, H. Zhang, S. Bubeck, and G. Yang, “Provably robust deep learning via adversarially trained smoothed classifiers,” Advances in Neural Information Processing Systems, vol. 32, 2019.   \n[51] A. Levine, S. Singla, and S. Feizi, “Certifiably robust interpretation in deep learning,” arXiv preprint arXiv:1905.12105, 2019.   \n[52] K. He, X. Zhang, S. Ren, and J. Sun, “Deep residual learning for image recognition,” in Proceedings of the IEEE conference on computer vision and pattern recognition, 2016, pp. 770–778.   \n[53] K. Simonyan and A. Zisserman, “Very deep convolutional networks for large-scale image recognition,” arXiv preprint arXiv:1409.1556, 2014.   \n[54] M. Heusel, H. Ramsauer, T. Unterthiner, B. Nessler, and S. Hochreiter, “Gans trained by a two time-scale update rule converge to a local nash equilibrium,” Advances in neural information processing systems, vol. 30, 2017.   \n[55] A. Radford, J. W. Kim, C. Hallacy, A. Ramesh, G. Goh, S. Agarwal, G. Sastry, A. Askell, P. Mishkin, J. Clark et al., “Learning transferable visual models from natural language supervision,” in International conference on machine learning. PMLR, 2021, pp. 8748–8763.   \n[56] Z. Cheng, H. Sun, M. Takeuchi, and J. Katto, “Learned image compression with discretized gaussian mixture likelihoods and attention modules,” in Proceedings of the IEEE/CVF conference on computer vision and pattern recognition, 2020, pp. 7939–7948.   \n[57] J. Bégaint, F. Racapé, S. Feltman, and A. Pushparaja, “Compressai: a pytorch library and evaluation platform for end-to-end compression research,” arXiv preprint arXiv:2011.03029, 2020.   \n[58] X. Zhao, K. Zhang, Z. Su, S. Vasan, I. Grishchenko, C. Kruegel, G. Vigna, Y.-X. Wang, and L. Li, “Invisible image watermarks are provably removable using generative ai,” arXiv preprint arXiv:2306.01953, 2023.   \n[59] V. N. Vapnik, “An overview of statistical learning theory,” IEEE transactions on neural networks, vol. 10, no. 5, pp. 988–999, 1999.   \n[60] P.-Y. Chen, “Model reprogramming: Resource-efficient cross-domain machine learning,” arXiv preprint arXiv:2202.10629, 2022.   \n[61] A. Dosovitskiy, L. Beyer, A. Kolesnikov, D. Weissenborn, X. Zhai, T. Unterthiner, M. Dehghani, M. Minderer, G. Heigold, S. Gelly et al., “An image is worth 16x16 words: Transformers for image recognition at scale,” arXiv preprint arXiv:2010.11929, 2020. ", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "", "page_idx": 13}, {"type": "text", "text": "Appendix for RAW: A Robust and Agile Plug-and-Play Watermark Framework for AI-Generated Images with Provable Guarantees ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "In Section A, we outline the formal proofs supporting the theoretical findings introduced in the main text. In Section B, we present omitted details, encompassing pseudocode and additional deliberations regarding the construction of RAW. In Section C, we offer implementation details of our experiments. In Section D, we present additional ablation studies on different hyperparameters. ", "page_idx": 14}, {"type": "text", "text": "A Proof of theoretical results ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "In this section, we provide the proof for Theorem 3.6. To begin with, we first revisit the overall inference procedure employed by our RAW and provide several detailed discussions. For the reader’s convenience, we include the pseudo-code outlining the inference stage protocol of RAW in Algorithm 1 below. ", "page_idx": 14}, {"type": "text", "text": "Algorithm 1 Conformal (Inference) Watermark Detection ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Input: querying input $X_{\\mathrm{test}}$ , watermarked dataset $D^{\\mathrm{wm}}\\,=\\,\\{\\mathcal{E}_{w}(X_{i})\\}_{i=1}^{n}$ , verification module $\\lvert\\nu_{\\theta}$ , desired false positive rate $\\alpha\\in(0,1)$ , violation rate $\\delta\\in(0,1)$ , desired adversarial robust range $\\gamma>0$ , smoothing parameter $\\sigma>0$ , and the smoothed/robust verification module $\\tilde{\\mathcal{V}}(\\cdot)\\triangleq\\Phi^{-1}(\\mathbb{E}_{Z\\sim\\mathcal{N}(0,\\sigma^{2}I)}[\\mathcal{V}_{\\theta}(\\mathcal{E}_{w}(\\cdot)+Z)])$ ", "page_idx": 14}, {"type": "text", "text": "1: Receiving a future query sample $X_{\\mathrm{test}}$   \n2: for $i=1$ to $_n$ do   \n3: Calculate $s_{i}\\triangleq\\tilde{\\mathcal{V}}(\\mathcal{E}_{w}(X_{i}))$ // $X_{i}\\in D^{\\mathrm{wm}}$   \n4: end for   \n5: Select the decision threshold $\\tau$ according to Equation (10).   \n6: Determine if $X_{\\mathrm{test}}$ is watermarked if $\\tilde{\\mathcal{V}}(\\bar{\\mathcal{E}}_{w}(X_{\\mathrm{test}}^{-}))\\geq\\tau$ ", "page_idx": 14}, {"type": "text", "text": "Output: The decision if the sample $X_{\\mathrm{test}}$ is a watermarked sample or not ", "page_idx": 14}, {"type": "text", "text": "The overall inference process for the proposed RAW mainly involves determining a decision threshold value $\\tau$ . This threshold is calculated based on the provided watermarked dataset $D^{\\mathrm{wm}}$ and the corresponding (smoothed) verification module $\\tilde{\\nu}$ , and it should satisfy the following condition: ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\hat{F}(\\tau+\\frac{\\gamma}{\\sigma})=\\alpha-\\sqrt{\\frac{\\ln\\frac{2}{\\delta}}{2n}},\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "where $\\delta\\in(0,1)$ is the violation rate describing the probability that the (FPRs) exceeds $\\alpha$ , and $\\hat{F}$ is the empirical cumulative distribution function of the watermarked dataset under $\\tilde{\\mathcal{V}}$ , i.e., $\\{\\tilde{\\mathcal{V}}(\\mathcal{E}_{w}(X_{i}))\\}_{i=1}^{n}$ . In the case where $\\sqrt{(\\log(2/\\delta)/(2n))}>\\alpha$ , we set the thresholding value $\\tau$ to be the maximum of $\\tilde{\\mathcal{V}}(\\mathcal{E}_{w}(X_{i}))\\}_{i=1}^{n}$ . We note that under such cases there will be no theoretical guarantees in term of FPRs. ", "page_idx": 14}, {"type": "text", "text": "A.1 Proof of Main Results ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "The proof of Theorem 3.6 is built upon the techniques established in our previous work [46]. In [46], we developed similar provable guarantees under the IID assumption of future test data. However, in our case of Theorem 3.6, such an IID assumption is no longer valid and hence raise up new technical challenges. To prove Theorem 3.6, we will use the following result concerning the convergence properties of empirical cumulative distribution functions (ECDFs). ", "page_idx": 14}, {"type": "text", "text": "Lemma A.1 (Dvoretzky–Kieffer–Wolfowitz inequality). Given a natural number $n_{\\!_{\\perp}}$ , let $X_{1},X_{2},\\ldots,X_{n}$ be real-valued independent and identically distributed random variables with cumulative distribution function $F(\\cdot)$ . Let $\\hat{F}(\\cdot)$ denote the associated empirical distribution function. ", "page_idx": 14}, {"type": "text", "text": "The interval that contains the true CDF, $F(x)$ , with probability $1-\\delta$ is specified as ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\hat{F}(x)-\\varepsilon\\leq F(x)\\leq\\hat{F}(x)+\\varepsilon\\,w h e r e\\,\\varepsilon=\\sqrt{\\frac{\\ln\\frac{2}{\\delta}}{2n}}.\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "Proof of Theorem 3.6. Note that $X_{\\mathrm{test}}$ is IID drawn from the watermarked data distribution and we have ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathbb{P}\\{Q(A(X_{\\mathrm{tot}}))=0\\mathrm{~(Imwatemated~|~}\\mathcal{D}^{\\mathrm{sup}})}\\\\ &{=\\mathbb{P}(\\tilde{V}(A(X_{\\mathrm{tot}}))\\leq\\tau\\mid\\mathcal{D}^{\\mathrm{m}})}\\\\ &{\\leq\\mathbb{P}(\\tilde{V}(X_{\\mathrm{sub}})-\\frac{\\gamma}{\\sigma}\\leq\\tau\\mid\\mathcal{D}^{\\mathrm{sup}})}\\\\ &{=\\mathbb{E}_{X_{\\mathrm{tot}}}\\{\\tilde{V}(X_{\\mathrm{tot}})\\leq\\tau+\\frac{\\gamma}{\\sigma}\\mid\\mathcal{D}^{\\mathrm{sup}}\\}}\\\\ &{=\\mathbb{E}_{X_{\\mathrm{tot}}}\\{F(\\tilde{V}(X_{\\mathrm{tot}}))\\leq F(\\tau+\\frac{\\gamma}{\\sigma})\\mid\\mathcal{D}^{\\mathrm{m}}\\}}\\\\ &{=\\mathbb{P}(F(\\tilde{V}(X_{\\mathrm{tot}}))\\leq F(\\tau+\\frac{\\gamma}{\\sigma})\\mid\\mathcal{D}^{\\mathrm{m}})}\\\\ &{\\leq\\mathbb{P}(F(\\tilde{V}(X_{\\mathrm{sub}}))\\leq\\hat{F}(\\tau+\\frac{\\gamma}{\\sigma})+\\varepsilon\\mid\\mathcal{D}^{\\mathrm{sup}})\\quad(\\varepsilon=\\sqrt{\\frac{\\ln\\frac{2}{\\delta}}{2\\pi}})}\\\\ &{=\\alpha-\\varepsilon+\\varepsilon}\\\\ &{=\\alpha.}\\end{array}\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "holds with probability at least $1-\\delta$ . The equation (11) is because of the decision rule as specified in Algorithm 1, and the inequality (12) is due to the lipschitz condition of $\\tilde{\\nu}$ with parameter $\\sigma^{-1}$ , namely ", "page_idx": 15}, {"type": "equation", "text": "$$\n|\\tilde{\\mathcal{V}}(X)-\\tilde{\\mathcal{V}}(Y)|\\leq\\sigma^{-1}\\|X-Y\\|,\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "for any $X,Y\\in\\mathcal{X}$ . Additionally, the $F$ in equation (13) represents the CDF of the watermarked data under $\\tilde{\\mathcal{V}}(\\cdot)$ , i.e., $\\tilde{\\mathcal{V}}(\\mathcal{E}_{w}(X))$ , while $\\hat{F}$ in (14) denotes the empirical CDF obtained from $\\mathcal{D}^{\\mathrm{wm}}$ , i.e., $\\{\\tilde{\\mathcal{V}}(\\mathcal{E}_{w}(X_{i}))\\}_{i=1}^{n}$ under $\\tilde{\\mathcal{V}}(\\cdot)$ . The inequality in (14) arises from the DKW inequality as specified in Lemma A.1. Furthermore, the Equation (15) is based on the fact that the CDF follows a uniform distribution (a result of the probability integral transformation) and the selection of the thresholding value specified in Equation (10). 口 ", "page_idx": 15}, {"type": "text", "text": "A.2 Provable FPRs without adversarial attacks ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "In this section, we present the omitted results of the provable FPRs concerning the watermark detection performance of our RAW in the absence of adversarial attacks, as elaborated in Line 225 of the main text. All the techniques used in this section are based on our previous work [46], as discussed earlier. ", "page_idx": 15}, {"type": "text", "text": "As there are no anticipated adversarial attacks on test images, there is consequently no requirement to apply smoothing/robustification to the trained verification model $\\lvert\\l\\rangle_{\\theta}$ . The corresponding pseudo-code is outlined in Algorithm 2 below. Similarly, the updated thresholding value $\\tau$ is selected to satisfy the ", "page_idx": 15}, {"type": "table", "img_path": "ogaeChzbKu/tmp/81b0f30114460c681b83f581bd37682167cf80345b1b465ffcd3eaa6ed7ef1fd.jpg", "table_caption": [""], "table_footnote": [], "page_idx": 15}, {"type": "text", "text": "Output: The decision if the sample $X_{\\mathrm{test}}$ is a watermarked sample or not ", "page_idx": 15}, {"type": "text", "text": "condition. ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\hat{F}(\\tau)=\\alpha-\\sqrt{\\frac{\\ln\\frac{2}{\\delta}}{2n}},\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "where $\\delta\\,\\in\\,(0,1)$ is the violation rate describing the probability that the (FPRs) exceeds $\\alpha$ , and $\\hat{F}$ is the empirical cumulative distribution function of the watermarked dataset under $\\lvert\\l\\rangle_{\\theta}$ , i.e., $\\{\\mathcal{V}_{\\theta}(\\mathcal{E}_{w}(X_{i}))\\}_{i=1}^{n}$ . Contrasting the selection of $\\tau$ under adversarial attacks in Equation (10), we note that the term $\\gamma/\\sigma$ is omitted because of the absence of adversarial attacks. In the case where $\\sqrt{(\\log(2/\\delta)/(2n))}>\\alpha$ , we set the thresholding value $\\tau$ to be the maximum of $\\{\\mathcal{V}_{\\theta}(\\mathcal{E}_{w}(X_{i}))\\}_{i=1}^{n}$ . ", "page_idx": 16}, {"type": "text", "text": "Theorem A.2 (Certified FPRs under no adversarial attacks). For any watermarked dataset ${\\mathcal{D}}^{w m}$ and its associated verification module $\\lvert\\l\\rangle_{\\theta}$ , suppose that the test data $(X_{t e s t},Y_{t e s t})$ are $I I D$ drawn from the distribution of $\\mathcal{D}^{w m}$ . Given $\\delta\\in(0,1)$ , the detectorg $(\\cdot)$ (defined in Line 231 in the main text) with the threshold $\\tau$ as specified in Equation (16) satisfies ", "page_idx": 16}, {"type": "equation", "text": "$$\n\\mathbb{P}(g(X_{t e s t}))=0\\left(U n w a t e r m a r k e d\\right)\\mid\\mathcal{D}^{w m})\\le\\alpha\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "with probability at least $1-\\delta$ for any $\\alpha\\in(0,1)$ such that $\\alpha>\\sqrt{(\\log(2/\\delta)/(2n))}.$ ", "page_idx": 16}, {"type": "text", "text": "Proof. The proof follows the same approach as the proof for Theorem 1, with the exclusion of the $\\gamma/\\sigma$ term. 口 ", "page_idx": 16}, {"type": "text", "text": "B Omitted Details and Further Discussions ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "In this section, we initially present the omitted pseudo-code for the training algorithm, followed by further discussions regarding the design of RAW. ", "page_idx": 17}, {"type": "text", "text": "B.1 Overall flow of the proposed RAW ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Figure 2 below demonstrates the overall flow of our RAW framework and its differences from encoder-decoder-based methods. In RAW, watermarks are directly introduced and injected into images and are jointly trained with the watermark classifier. ", "page_idx": 17}, {"type": "image", "img_path": "ogaeChzbKu/tmp/0f0e98a9c3239a59c1f77a2b4c5665a19ba0cd6a218c39ad0eb4bdf150bfe1ce.jpg", "img_caption": ["Figure 2: The overall flow of the proposed RAW framework. "], "img_footnote": [], "page_idx": 17}, {"type": "text", "text": "B.2 Pseudocode for training algorithms ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "The pseudocode for the overall training pipeline of RAW is outlined in Algorithm 3. ", "page_idx": 17}, {"type": "table", "img_path": "ogaeChzbKu/tmp/9955a416f383c6dc71fb6b49bc8635ba15819ea983fe28f1fd6444f23319f915.jpg", "table_caption": [], "table_footnote": [], "page_idx": 17}, {"type": "text", "text": "B.3 Additional metrics on image quality ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "We report the PSNR and SSIM of the watermarked images in the Table 6 below. For PSNR and SSIM, our method outperforms the StegaStamp method but is behind DwtDctSvd and RivaGAN. These results are consistent with our expectations. The StegaStamp method achieves more robust detection by sacrificing image quality through injecting a large amount of noise into the image, while DwtDctSvd and RivaGAN maintain image quality slightly better at the cost of reduced robustness against (adversarial) image perturbations. ", "page_idx": 17}, {"type": "table", "img_path": "ogaeChzbKu/tmp/2a4e762639a4b35adc6161932ae46f5f9ddea90402d6cdc49d670835d00f968d.jpg", "table_caption": ["Table 6: Additional metrics for image quality. "], "table_footnote": [], "page_idx": 18}, {"type": "text", "text": "B.4 Further Discussions ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "We now elaborate on two pivotal aspects of our watermark designs and overarching training algorithms: (I) the joint training scheme for watermarking and verification modules, and $(\\mathbf{II})$ the integration of spatial-domain watermarks. ", "page_idx": 18}, {"type": "text", "text": "(I) The joint training scheme for watermarking and verification modules. Theoretically, using standard arguments from classical learning theory [59], it can be shown that training both the watermarking and the verification modules to distinguish between watermarked and unwatermarked data will not lead to a test accuracy worse than when the watermark is fixed, and only the model is trained. From a practical perspective, the initially randomly initialized watermarks may not align well with specific training data, emphasizing the need to optimize watermarks for distinct data scenarios. Our empirical observations support this notion, as evidenced in Figure 5 (left), where the joint training scheme leads to a significantly higher test accuracy and lower training loss compared with the scenario where the watermark is fixed. ", "page_idx": 18}, {"type": "text", "text": "$(\\mathbf{II})$ The inclusion of spatial domains. Classical methods for embedding watermarks primarily introduce them into the frequency domains of images [13]. However, it has been empirically observed that such watermarks are susceptible to manipulations, such as Gaussian noise [8]. To overcome this vulnerability, we draw inspiration from the model reprogramming literature [60], where watermarks are incorporated into the spatial domain to enhance accuracy in distinguishing in- and out-distribution data [49]. Consequently, we explore the integration of watermarks into the spatial domain (in addition to the frequency domain), as outlined in Equation (2). We empirically observed that including spatial watermarks could significantly boost the test accuracy of the trained verification module under Gaussian-noise manipulations on test data, as depicted in Figure 5 (right). ", "page_idx": 18}, {"type": "image", "img_path": "ogaeChzbKu/tmp/0e841908bbba04a6de3f22764b752df498e293694e72f12affaeceb891497cd4.jpg", "img_caption": ["Figure 3: Effects of (1) joint training and (2) spatial watermarks. "], "img_footnote": [], "page_idx": 18}, {"type": "text", "text": "C Implementation details ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "In this section, we first list the implementation details for the results presented in the main text. Next, we present ablation studies on the performance of our RAW by using different hyper-parameters. ", "page_idx": 19}, {"type": "text", "text": "C.1 Implementation Details ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Watermark setup Recall that the watermarking module in our RAW takes the form of ", "page_idx": 19}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\mathcal{E}_{w}(X)=\\mathcal{F}^{-1}(\\mathcal{F}(X)+c_{1}\\times u)+c_{2}\\times v,}\\end{array}\n$$", "text_format": "latex", "page_idx": 19}, {"type": "text", "text": "where $u,v\\in\\mathcal{X}$ are two watermarks injected into spatial and frequency domains, respectively. For the results presented in the main text, we set the watermark strength parameters $c_{1}$ and $c_{2}$ to be 0.05 each. To enhance invisibility further, we implement a circular mask with a radius of 150 for the frequency domain watermarks, inspired by the procedure outlined in [8]. ", "page_idx": 19}, {"type": "text", "text": "Verification module setup In terms of the verification module $\\lvert\\l\\rangle_{\\theta}$ , throughout all the experiments in the main text, we adopt the pre-trained ResNet 18 [52] architecture. ", "page_idx": 19}, {"type": "text", "text": "Training data augmentation Two types of data augmentations are employed during the training phase. (1) To enhance the robustness of the trained verification model $\\lvert\\l\\rangle_{\\theta}$ against Gaussian noise, ensuring its sustained predictive effectiveness post-smoothing, we introduce Gaussian noise into the training data. This augmentation entails the addition of noise with a mean of zero and a standard deviation of 0.5 during the training process. (2) Additionally, we employ standard image augmentations such as random cropping and flipping to facilitate training. ", "page_idx": 19}, {"type": "text", "text": "D Additional Ablation Studies ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "D.1 Verification module/model architectures. ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "In this section, we assess the watermark detection performance of our RAW using diverse model architectures: ResNet 9, ResNet 34, VGG 16 [53] and ViT [61]. The summarized results on both Stable-Diffusion-generated MS-COCO and DBDiffusion dataset can be found in Table 7 below. FID and CLIP scores are omitted, given that the watermark strength parameters $c_{1}$ and $c_{2}$ are consistent with those in the main text (i.e., both set to 0.5). Notably, we observed an improvement in both benign and adversarial detection performances with a more complex model, ResNet 34, which is reasonable as complex models often possess greater learning capacity. ", "page_idx": 19}, {"type": "table", "img_path": "ogaeChzbKu/tmp/1504ad25d86733ebe64978914755a05594e346b59e4c0e14158e420b1b588dc7.jpg", "table_caption": ["Table 7: Summary of detection results under different model architectures. AUROC (Ben) denotes the AUROC performance without image manipulations or adversarial attacks. AUROC (Adv) represents the average performance across nine distinct image manipulations and attacks. "], "table_footnote": [], "page_idx": 19}, {"type": "text", "text": "D.2 Size of watermarked training data under fine-tuning scenario. ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "In this section, we shift our focus to a more realistic scenario where we fine-tune both the classifier and the watermarks using pre-trained models. We note that the new scenario differs from the one discussed in the main text, where the classifier is trained from scratch with randomly initialized weights. ", "page_idx": 19}, {"type": "text", "text": "To elaborate, we initially pretrain a set of watermarks along with their corresponding classifiers using a dataset such as MS-COCO. Subsequently, we fine-tune this pair using a new dataset. We present the results of this strategy by varying the number of new training data and summarize the outcomes in ", "page_idx": 19}, {"type": "text", "text": "Table 8 below. In contrast to the training from scratch scenario described in the main text, our RAW framework demonstrates a significant improvement with a reasonably small training dataset size. ", "page_idx": 20}, {"type": "table", "img_path": "ogaeChzbKu/tmp/3c2e0dd5e4ef2ec56fcbb28b63f9f17c09db779df14206301f902c89de139d05.jpg", "table_caption": ["Table 8: Summary of detection results under numbers of training data. AUROC (Ben) denotes the AUROC performance without image manipulations or adversarial attacks. AUROC (Adv) represents the average performance across nine distinct image manipulations and attacks. "], "table_footnote": [], "page_idx": 20}, {"type": "text", "text": "D.3 Different diffusion models for generating images ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "In this section, we examine the watermark detection results of our RAW approach across various generative models, specifically utilizing two widely recognized architectures: SDXL and BriXL. We maintain consistent settings as detailed in the main text. The AUROC outcomes are consolidated in Table 9. Our findings indicate that our RAW method achieves high AUROC scores for both MS-COCO and DBDiffusion datasets, underscoring its broad applicability. ", "page_idx": 20}, {"type": "table", "img_path": "ogaeChzbKu/tmp/2fb7fe700e0bd754a54edddf467d8193ab9aecd17aee68f5059ed4f550ee3d7d.jpg", "table_caption": ["Table 9: Summary of detection results under numbers of training data. AUROC (Ben) denotes the AUROC performance without image manipulations or adversarial attacks. AUROC (Adv) represents the average performance across nine distinct image manipulations and attacks. "], "table_footnote": [], "page_idx": 20}, {"type": "text", "text": "D.4 Additional Visual Examples ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "In this section, we present additional visual examples in Figure 5 and 4 resulting from our proposed RAW method. Our observations reveal no notably discernible differences between the original and watermarked images, highlighting the effectiveness of our approach. ", "page_idx": 20}, {"type": "image", "img_path": "ogaeChzbKu/tmp/dcf019fc5ba172d0af4171f25e49dfed5dce67bf34733a450bd62a08981868a8.jpg", "img_caption": ["Figure 4: Examples of RAW-watermarked images (middle row) "], "img_footnote": [], "page_idx": 21}, {"type": "image", "img_path": "ogaeChzbKu/tmp/82d654b1aa4cc28df691f1cd65f2b298008b49843cc62750135652dc5b3a4f4d.jpg", "img_caption": ["Figure 5: Examples of RAW-watermarked images (middle row) "], "img_footnote": [], "page_idx": 21}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 22}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 22}, {"type": "text", "text": "Justification: The claims in the abstract and introduction accurately reflect the paper’s contributions and scope. ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 22}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 22}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Justification: Discussions on the limitations of this work are provided in Section 5 in the main text. ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 22}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 22}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: For all the theoretical results, we have clearly listed the full set of assumptions and provided complete proofs. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 23}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: We have detailed all the experimental setups in both the main text and the appendix. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 23}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 24}, {"type": "text", "text": "Justification: We have provided details, including GitHub links, on how to implement the results for our proposed methods. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 24}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 24}, {"type": "text", "text": "Justification: All experiment details are listed. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 24}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 24}, {"type": "text", "text": "Justification: Error bars are reported. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 24}, {"type": "text", "text": "", "page_idx": 25}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "Justification: The computation resources are listed in the appendix. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 25}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "Justification: We conformed with the NeurIPS Code of Ethics. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 25}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "Justification: Discussions on potential societal impacts are provided in Section 5 of the main text. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed. • If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact. ", "page_idx": 25}, {"type": "text", "text": "• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 26}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 26}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 26}, {"type": "text", "text": "Justification: This paper poses no such risks. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 26}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 26}, {"type": "text", "text": "Justification: We have properly cited all the datasets, models, and GitHub repositories (code) used in this work. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 26}, {"type": "text", "text": "", "page_idx": 27}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 27}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 27}, {"type": "text", "text": "Justification: This paper does not release any new assets. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 27}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 27}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 27}, {"type": "text", "text": "Justification: This paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 27}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 27}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 27}, {"type": "text", "text": "Justification: This paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 27}, {"type": "text", "text": "", "page_idx": 28}]