[{"figure_path": "ogaeChzbKu/figures/figures_9_1.jpg", "caption": "Figure 1: (a) FPRs of our proposed RAW. (b) Impact of training sample size on detection performance. (c) & (d) The tradeoff between the quality of watermarked images, assessed using FID (lower values are preferable), and the detection robustness.", "description": "This figure shows four subfigures, each presenting a different aspect of the RAW watermarking framework's performance. (a) shows the relationship between the false positive rate (FPR) and the alpha (α) parameter, demonstrating the effectiveness of the framework in controlling FPRs.  (b) shows how the average AUROC improves as the training sample size increases for both MS-COCO and DB-Diffusion datasets. (c) and (d) illustrate the tradeoff between watermark robustness and image quality (measured by FID) by varying the watermark strength parameters c1 and c2. The results indicate a balance can be achieved between strong watermark detection and preserving image quality.", "section": "Experiments"}, {"figure_path": "ogaeChzbKu/figures/figures_17_1.jpg", "caption": "Figure 2: The overall flow of the proposed RAW framework.", "description": "This figure demonstrates the overall flow of the proposed RAW framework and its differences from encoder-decoder based methods. In RAW, watermarks are directly introduced and injected into images and are jointly trained with the watermark classifier.  The top panel (a) shows RAW, where frequency and spatial watermarks are added to the image, and a classifier is used to determine if the image is watermarked or not. The bottom panel (b) shows the traditional encoder-decoder method, where a watermark is encoded into the image by the encoder, and the decoder is used to extract it for comparison. ", "section": "3 RAW"}, {"figure_path": "ogaeChzbKu/figures/figures_18_1.jpg", "caption": "Figure 3: Effects of (1) joint training and (2) spatial watermarks.", "description": "This figure shows the effects of joint training and the inclusion of spatial watermarks in the RAW watermarking framework.  The left chart compares the training loss and test accuracy when using only a model versus a model with a watermark. The right chart shows the effects of using only frequency domain watermarks versus using both frequency and spatial domain watermarks.  The results indicate improved performance with joint training and the addition of spatial watermarks, suggesting their importance for robust watermarking.", "section": "Additional Ablation Studies"}, {"figure_path": "ogaeChzbKu/figures/figures_21_1.jpg", "caption": "Figure 4: Examples of RAW-watermarked images (middle row)", "description": "This figure shows three examples of images that have been watermarked using the RAW method. The top row displays the original images, while the middle row shows the same images after watermarking.  The bottom row presents a magnified view of the pixel differences between the original and watermarked versions. Visually, the differences are subtle, highlighting the invisibility of the watermarking technique while it preserves image quality.", "section": "4.4 Additional Visual Examples"}, {"figure_path": "ogaeChzbKu/figures/figures_21_2.jpg", "caption": "Figure 5: Examples of RAW-watermarked images (middle row)", "description": "This figure shows three example images: an original image (top row), its RAW-watermarked version (middle row), and the pixel-level difference between the original and watermarked images (bottom row). The pixel differences are amplified 4x for better visualization. The images demonstrate that the watermarking process is almost imperceptible and maintains the image quality.", "section": "4.4 Ablation Studies"}]