[{"figure_path": "3gKsKFeuMA/figures/figures_1_1.jpg", "caption": "Figure 1: Comparison between the spatial shift operator and the proposed deep Fourier shift operator. (a) Traditional spatial shift operator involves a spatial shift mechanism that moves each channel of the input tensor in a distinct spatial direction, thus suffering from severe region-aware information loss and conflicting with the requirements of image restoration tasks. (b) Deep Fourier Shifting/Cycling operator is a more ingenious information-lossless operator, which is tailored for image restoration tasks. (c), (d) Deep Fourier shifting achieves a more stable performance gain than the spatial shifting mechanism with varying “ns", "description": "This figure compares the spatial shift operator with the proposed Deep Fourier Shifting operator. The spatial shift operator moves each channel of the input tensor in a distinct direction, causing information loss and conflicting with image restoration requirements. In contrast, Deep Fourier Shifting is an information-lossless operator designed for image restoration, achieving a more stable performance gain with varying shift displacements and basic units across image denoising tasks.  The graphs show PSNR (peak signal-to-noise ratio) performance for different shift configurations.", "section": "2 Deep Fourier Shifting"}, {"figure_path": "3gKsKFeuMA/figures/figures_2_1.jpg", "caption": "Figure 2: (a) The information-lossless cycling mechanism. The discrete Fourier transform of a signal exhibits period-extended and cycling properties. Specifically, in the Fourier domain, the two pixels in sequence beginning and end may not appear adjacent, but due to the period property, they are actually considered adjacent, as indicated by the upper right corner. This inherent period-extended and cycling behavior of the Fourier transform enables us to model the shifting mechanism in a manner that is information-lossless, making it well-suited for image restoration tasks. Consider the Fourier transform of a discrete time-domain signal, represented as (343). It may appear that the values 3 and 5 are not adjacent within the main period. However, owing to the property of period extension, the 3 from the previous period and the 5 from the current period are theoretically considered adjacent. It is reasonable to move the removed area from the end to the front, meeting the cycling mechanism. (b) Our deep Fourier shifting operator. Our operator borrows the principle of the spatial shifting mechanism and models the shifting mechanism in information-lossless Fourier cycling rules. The cycling is coded as 2D queue rolling.", "description": "This figure illustrates the information-lossless cycling mechanism used in Deep Fourier Shifting.  Panel (a) shows how the periodic nature of the Fourier transform allows for a shift operation without information loss by conceptually connecting the beginning and end of the signal. Panel (b) depicts the 2D queue rolling operation that implements the information-lossless Fourier cycling in the proposed Deep Fourier Shifting operator.", "section": "2 Deep Fourier Shifting"}, {"figure_path": "3gKsKFeuMA/figures/figures_4_1.jpg", "caption": "Figure 3: Pseudo-code of the two variants of the proposed deep Fourier shifting. The left is the amplitude-phase variant while the right is the real-imaginary variant.", "description": "This figure shows the pseudo-code for the two variants of Deep Fourier Shifting: amplitude-phase and real-imaginary.  Both variants start by applying a Fast Fourier Transform (FFT) to the input image. The amplitude-phase variant then separates the amplitude and phase components, applies Fourier cycling, and uses 1x1 convolutions before an inverse FFT. The real-imaginary variant performs a similar process but operates directly on the real and imaginary parts of the FFT output.", "section": "2 Deep Fourier Shifting"}, {"figure_path": "3gKsKFeuMA/figures/figures_6_1.jpg", "caption": "Figure 5: Visual comparison over image enhancement.", "description": "This figure shows a visual comparison of image enhancement results using different methods.  The top row presents results for low-light image enhancement, comparing the input image with results from SID, Shift-sa, Fcycle-ab, and Fcycle-AP.  The bottom row shows similar results for another low-light image enhancement method, DRBN, and the other three comparison methods. Red arrows in some images highlight specific areas where differences between the methods are more pronounced. Overall, the image shows the enhancement effects across different methods, illustrating the visual impact and differences between the proposed Deep Fourier Shifting method and the other methods.", "section": "3 Experiments"}, {"figure_path": "3gKsKFeuMA/figures/figures_6_2.jpg", "caption": "Figure 6. The effectiveness of information preservation. Left: we compare mutual information levels before and after employing Fcycle-ab and Shift-sa operators on the LOL test set, respectively. Our operator exhibits significantly higher mutual information than Shift-sa, showcasing its efficacy in information preservation. Right: we visualize feature maps and their amplitude components before and after operations. This demonstrates that our Fcycle-AP promotes frequency information in", "description": "This figure demonstrates the effectiveness of the proposed Deep Fourier Shifting in preserving information. The left panel compares the mutual information before and after applying the Fcycle-ab and Shift-sa operators on the LOL test set.  The results show that the Deep Fourier Shifting method maintains significantly higher mutual information compared to Shift-sa, highlighting its effectiveness in information preservation. The right panel provides a visual comparison of feature maps and amplitude components before and after applying Fcycle-AP and Shift-sa to the deep layer. The visualization shows that Fcycle-AP promotes frequency information better than Shift-sa.", "section": "3.3 Comparison and Analysis"}, {"figure_path": "3gKsKFeuMA/figures/figures_6_3.jpg", "caption": "Figure 4: The proposed operators improve the training performance. It shows the training PSNR on the image enhancement task on the LOL and Huawei datasets in the top and bottom.", "description": "This figure shows the training performance of the proposed Deep Fourier Shifting (DFS) operators compared to the baseline and spatial shift operator on the LOL and Huawei datasets for image enhancement. The top graph shows the PSNR on the LOL dataset, while the bottom graph shows the PSNR on the Huawei dataset. The x-axis represents the number of training iterations, and the y-axis represents the PSNR. The figure demonstrates that both DFS variants consistently outperform the baseline and spatial shift operator throughout the training process.", "section": "3 Experiments"}, {"figure_path": "3gKsKFeuMA/figures/figures_7_1.jpg", "caption": "Figure 7: The effect of shifting displacement  shift-n on SID.", "description": "This figure visualizes the ablation study on the impact of varying the shifting displacement (n) on the performance of the proposed Deep Fourier Shifting.  The results are shown for two datasets: LOL (a) and Huawei (b).  The plots display the PSNR for three approaches: Shift-sa (baseline spatial shift), Fcycle-AP (amplitude-phase variant of Deep Fourier Shifting), and Fcycle-ab (real-imaginary variant). The dashed red line shows the original model's performance without shifting.  The graphs illustrate how the performance changes with different shift values (n=1, 2, 3, 4).  The goal is to show that the proposed Deep Fourier Shifting (both variants) is more robust to changes in the shift displacement than the baseline spatial shifting.", "section": "3.4 Ablation Studies"}]