[{"figure_path": "3gKsKFeuMA/tables/tables_4_1.jpg", "caption": "Table 1: Quantitative comparisons on low-light image enhancement. The arrow → denotes the generalization setting by training on the data before the arrow and testing directly on the data after the arrow.", "description": "This table presents a quantitative comparison of different models' performance on low-light image enhancement tasks.  The models are compared using PSNR and SSIM metrics on two datasets (LOL and Huawei). The arrow \"→\" indicates the generalization setting, where a model trained on one subset of the data is tested on another subset to evaluate its generalization ability. The table shows the performance of the original models, models using spatial shifting, and models using the proposed Deep Fourier Shifting (amplitude-phase and real-imaginary variants).  The number of parameters (#Paras) for each model is also provided.", "section": "3 Experiments"}, {"figure_path": "3gKsKFeuMA/tables/tables_4_2.jpg", "caption": "Table 2: Comparisons on image denoising. DNCNN", "description": "This table presents a quantitative comparison of the proposed Deep Fourier Shifting methods (Fcycle-AP and Fcycle-ab) against a baseline model (Original) and a spatial shifting method (Shift-sa) on image denoising tasks.  The evaluation metrics used are PSNR and SSIM. Two datasets, SIDD and DND, are used for evaluation. The number of parameters (#Paras) for each model is also provided.", "section": "3 Experiments"}, {"figure_path": "3gKsKFeuMA/tables/tables_5_1.jpg", "caption": "Table 4: Quantitative comparisons on guided image super-resolution.", "description": "This table presents a quantitative comparison of different methods for guided image super-resolution using three metrics (PSNR, SSIM, SAM) and one evaluation criterion (ERGAS) on three different datasets (WorldView-II, GaoFen2, WorldView-III).  The methods compared include the original method, the spatial shifting method, and two variants of the proposed deep Fourier shifting method (amplitude-phase and real-imaginary variants). The table shows that the deep Fourier shifting methods generally outperform the original methods and spatial shifting, indicating their effectiveness in enhancing guided image super-resolution performance.", "section": "3.3 Comparison and Analysis"}, {"figure_path": "3gKsKFeuMA/tables/tables_7_1.jpg", "caption": "Table 5: Ablation studies of image denoising network, DNCNN.", "description": "This table presents the ablation study results for the image denoising task using the DNCNN network.  It shows a comparison of PSNR and SSIM values across various configurations, namely the original model and models with different variants of Deep Fourier Shifting (Fcycle-ab, Fcycle-AP) and spatial shifting (Shift-sa). The impact of varying shift displacement (\"n\" and \"ns\") is also analyzed. The goal is to demonstrate the effectiveness and robustness of Deep Fourier Shifting in enhancing performance while maintaining or reducing model parameters compared to baseline and spatial shifting methods.", "section": "3.3 Comparison and Analysis"}]