[{"figure_path": "xZxXNhndXU/tables/tables_6_1.jpg", "caption": "Table 1: Novel view synthesis on Argoverse 2 [81]. Our method improves substantially over the state-of-the-art while being more than 200× faster to render at the original 1550 × 2048 resolution.", "description": "This table presents a comparison of novel view synthesis results on the Argoverse 2 dataset.  The metrics used are PSNR, SSIM, and LPIPS, measuring the quality of the generated images.  The table compares the proposed method (4DGF) against several state-of-the-art methods. It highlights that 4DGF significantly outperforms existing methods in terms of visual quality while achieving more than a 200x speedup in rendering time.", "section": "4 Experiments"}, {"figure_path": "xZxXNhndXU/tables/tables_7_1.jpg", "caption": "Table 2: Novel view synthesis on KITTI [21] and VKITTI2 [22]. Our method produces state-of-the-art results across both benchmarks and at varying training view fractions.", "description": "This table presents the results of novel view synthesis experiments conducted on the KITTI and VKITTI2 datasets.  The results compare the performance of the proposed 4DGF method against several state-of-the-art techniques, using PSNR, SSIM, and LPIPS metrics.  The comparison is performed at three different training view fractions (75%, 50%, and 25%) to demonstrate the robustness and scalability of 4DGF across varying data conditions.", "section": "4.1 Comparison to state-of-the-art"}, {"figure_path": "xZxXNhndXU/tables/tables_7_2.jpg", "caption": "Table 3: Novel view synthesis on KITTI [21] on split from [77]. We follow the experimental protocol in [77] to compare to additional works. baseline from [83].", "description": "This table compares the performance of different novel view synthesis methods on the KITTI dataset.  The methods are evaluated using the PSNR, SSIM, and LPIPS metrics, which measure the visual quality of the generated images. The table specifically uses a data split from a different paper ([77]) and includes a baseline ([83]).  The results show that the proposed method, 4DGF, outperforms existing methods on this benchmark.", "section": "4 Experiments"}, {"figure_path": "xZxXNhndXU/tables/tables_7_3.jpg", "caption": "Table 4: Novel view synthesis on Waymo Open [23]. We use the Dynamic-32 split [76]. Contrary to prior work, we do not exhibit lower view quality in dynamic areas.", "description": "This table shows the results of novel view synthesis on the Waymo Open dataset using the Dynamic-32 split.  The table compares the performance of the proposed 4DGF method against other state-of-the-art methods, focusing on PSNR, SSIM, and rendering speed.  It highlights the superior performance of 4DGF, particularly in maintaining high visual quality in dynamic areas, which is a common problem for other methods. The rendering speed of 4DGF is significantly faster than the other methods presented.", "section": "4 Experiments"}, {"figure_path": "xZxXNhndXU/tables/tables_8_1.jpg", "caption": "Table 1: Novel view synthesis on Argoverse 2 [81]. Our method improves substantially over the state-of-the-art while being more than 200× faster to render at the original 1550 × 2048 resolution.", "description": "This table presents a comparison of novel view synthesis results on the Argoverse 2 dataset.  It compares the proposed 4DGF method against several state-of-the-art techniques, evaluating performance using PSNR, SSIM, and LPIPS metrics.  A key finding is that 4DGF significantly outperforms existing methods in terms of both visual quality (PSNR, SSIM, LPIPS) and rendering speed.", "section": "4 Experiments"}, {"figure_path": "xZxXNhndXU/tables/tables_8_2.jpg", "caption": "Table 1: Novel view synthesis on Argoverse 2 [81]. Our method improves substantially over the state-of-the-art while being more than 200× faster to render at the original 1550 × 2048 resolution.", "description": "This table presents a comparison of novel view synthesis results on the Argoverse 2 dataset.  It compares the proposed 4DGF method against several state-of-the-art techniques using metrics such as PSNR, SSIM, and LPIPS. The table highlights 4DGF's significant improvements in visual quality and rendering speed.  The results demonstrate that 4DGF achieves a substantial improvement over existing methods, exceeding them by over 3 dB in PSNR while achieving more than a 200x speed increase. This showcases the efficiency and effectiveness of the proposed 4DGF approach for novel view synthesis in large-scale, dynamic urban environments.", "section": "4 Experiments"}, {"figure_path": "xZxXNhndXU/tables/tables_15_1.jpg", "caption": "Table 1: Novel view synthesis on Argoverse 2 [81]. Our method improves substantially over the state-of-the-art while being more than 200× faster to render at the original 1550 × 2048 resolution.", "description": "This table presents a comparison of novel view synthesis results on the Argoverse 2 dataset.  It compares the proposed 4DGF method against several state-of-the-art techniques, evaluating performance based on PSNR, SSIM, LPIPS, and rendering speed. The results show that 4DGF significantly outperforms existing methods in terms of visual quality (PSNR, SSIM, LPIPS) and achieves a more than 200x speedup in rendering.", "section": "4 Experiments"}, {"figure_path": "xZxXNhndXU/tables/tables_18_1.jpg", "caption": "Table 8: Addtional ablation studies. In (a) we show results on a single sequence of the residential area in our benchmark and the full residential area. In (b) we use a subset of the Dynamic-32 split from [76], i.e. the 12 sequences with the highest number of non-rigid objects.", "description": "This table presents ablation studies on two aspects of the model: (a) the impact of using 3D bounding box annotations from a pre-trained 3D tracker and (b) the effect of including the deformation head for non-rigid object motion modeling.  The results show that the model performs well even with noisy inputs from the 3D tracker and that including the deformation head improves performance.", "section": "4.2 Ablation studies"}, {"figure_path": "xZxXNhndXU/tables/tables_18_2.jpg", "caption": "Table 8: Addtional ablation studies. In (a) we show results on a single sequence of the residential area in our benchmark and the full residential area. In (b) we use a subset of the Dynamic-32 split from [76], i.e. the 12 sequences with the highest number of non-rigid objects.", "description": "This table presents the results of ablation studies conducted to evaluate the impact of different design choices on the overall performance of the proposed 4DGF model.  Specifically, it investigates the effects of using 3D bounding boxes for dynamic object representation and the inclusion of a deformation head for modeling non-rigid object motion. Part (a) compares the results on a single residential sequence and the full dataset, while part (b) focuses on a subset of the data with a higher concentration of non-rigid objects.", "section": "4.2 Ablation studies"}, {"figure_path": "xZxXNhndXU/tables/tables_18_3.jpg", "caption": "Table 9: Ablation study on ADC. We compare the performance of vanilla ADC to our modified variant in the single-sequence setting.", "description": "This table presents the ablation study comparing the performance of vanilla Adaptive Density Control (ADC) against the modified ADC proposed in the paper. The comparison is done on a single sequence setting using PSNR, SSIM, LPIPS, and the total number of 3D Gaussians and object 3D Gaussians. The results show that the modified ADC outperforms the vanilla version in terms of image quality metrics and results in a higher number of 3D Gaussians, especially for object 3D Gaussians.", "section": "4.2 Ablation studies"}]