[{"figure_path": "4cU9ZvOkBz/tables/tables_13_1.jpg", "caption": "Table 1: Summary data of every dataset used in the paper. The data for the 4-qubit ring processors is averaged over the 5 simulated datasets. See Figure 4 for images of each processor geometry (i.e., the qubit connectivity graph).", "description": "This table summarizes the characteristics of all the datasets used in the paper.  It lists the device used (IBM quantum computers or simulated devices), the geometry of the qubit connectivity, the type of circuits used (random i.i.d., random mirror), the number of qubits used, circuit depth (number of layers), and the number of circuits used for training, validation, and testing for each dataset. The data for the 4-qubit ring processors is an average across 5 simulated datasets.", "section": "4 Datasets"}, {"figure_path": "4cU9ZvOkBz/tables/tables_15_1.jpg", "caption": "Table 2: Summary data for the quantum-physics-aware networks used in the paper.", "description": "This table summarizes the hyperparameters and model sizes of the quantum-physics-aware neural networks used in the paper.  It shows the dataset used, the metric predicted (PST or F(c)), the total number of trainable parameters in the model, the number of hops considered in the connectivity graph when predicting error rates, the number of error types considered, and the structure of the dense layers in the network.", "section": "D Networks"}, {"figure_path": "4cU9ZvOkBz/tables/tables_16_1.jpg", "caption": "Table 3: Summary model performance data on experimental data.", "description": "This table presents a comparison of the mean absolute error achieved by the Quantum Physics-aware Neural Networks (qpa-NNs) and Convolutional Neural Networks (CNNs) on six different 5-qubit experimental datasets.  It shows the mean absolute error for each model on each dataset. For all datasets, the MAE is lower for the qpa-NNs than the CNNs. Additionally, it provides Bayes factors, comparing the likelihood of the qpa-NN model against both the original CNN model and a fine-tuned version.  These Bayes factors demonstrate strong evidence that the qpa-NNs are significantly better models.", "section": "5 5-qubit experiments"}, {"figure_path": "4cU9ZvOkBz/tables/tables_17_1.jpg", "caption": "Table 4: Summary model performance data on the 4-qubit simulated data.", "description": "This table presents a comparison of the performance of qpa-NNs and CNNs on a dataset of simulated 4-qubit quantum computations. The dataset includes both random and mirror circuits, each with high fidelity (above 85%). For each model and circuit type, the table shows the mean absolute error (%) and Pearson correlation coefficient. The results illustrate that the qpa-NNs consistently outperform CNNs across all datasets, indicating a significant improvement in prediction accuracy for learning the capabilities of quantum computers.", "section": "4 Datasets"}]