[{"figure_path": "Cr2jEHJB9q/tables/tables_18_1.jpg", "caption": "Table 1: Dataset used for experiments", "description": "This table lists the eight datasets used in the paper's experiments.  For each dataset, it provides the number of dimensions (Dim), prediction length (Pred Len), dataset size (broken down into training, validation, and test sets), frequency of data points (Hourly, Daily, 10 min, 15 min), and the type of information the data represents (Electricity, Economy, Weather, Transportation).  These datasets are used to evaluate the scaling laws and models for time series forecasting.", "section": "E Experiment settings"}, {"figure_path": "Cr2jEHJB9q/tables/tables_19_1.jpg", "caption": "Table 2: MSE measured for weather dataset", "description": "This table shows the Mean Squared Error (MSE) for the Weather dataset.  Multiple experiments (Exp1, Exp2, Exp3) were run, each starting at a different percentage point of the training data (20%, 40%, 60%, 80%). The average MSE and standard deviation are calculated for each starting point, demonstrating the impact of available training data on model performance.", "section": "E.4 Models and Experiment settings"}, {"figure_path": "Cr2jEHJB9q/tables/tables_23_1.jpg", "caption": "Table 3: regression results for ModernTCN", "description": "This table presents the AIC and BIC values for four different formulas that were used to fit the loss curves for the ModernTCN model.  The formulas tested were: f(x) = A + B/x^α, g1(x) = A/x^α, g2(x) = A + B log(x), and g3(x) = A + Bx + Cx^2.  The AIC and BIC values are provided for each formula and for four different datasets: Traffic, Weather, ETTh1, and ETTh2.", "section": "4 Experiment Results"}, {"figure_path": "Cr2jEHJB9q/tables/tables_23_2.jpg", "caption": "Table 4: regression results for iTransformer", "description": "This table presents the AIC and BIC values resulting from fitting four different regression formulas to the loss function of the iTransformer model.  The formulas are applied to four different datasets: Traffic, Weather, ETTh1, and ETTh2. The AIC and BIC values provide a measure of the goodness of fit for each formula on each dataset, helping to assess which formula best captures the relationship between the model's parameters and its performance.", "section": "I More comparison with other formulas"}, {"figure_path": "Cr2jEHJB9q/tables/tables_23_3.jpg", "caption": "Table 5: regression results for MLP or Linear models", "description": "This table presents the AIC and BIC values resulting from fitting four different regression formulas (f, g1, g2, g3) to time series forecasting data from four datasets (Traffic, Weather, ETTh1, ETTh2).  The formulas represent different modeling approaches, and the AIC and BIC values provide a measure of the relative goodness of fit for each formula on each dataset. Lower AIC and BIC values indicate better model fit.", "section": "I More comparison with other formulas"}]