[{"figure_path": "xnmm1jThkv/tables/tables_4_1.jpg", "caption": "Algorithm 1 LHTS: Linear Hierarchical Topological Sort", "description": "This algorithm details the steps for obtaining a linear hierarchical topological sort using local ancestral relationships. It starts by identifying pairs of vertices with specific ancestral relationships (AP1, AP2, AP3, and AP4) using conditional independence tests and sequential regressions. Then it uses a subroutine (AS) to construct the hierarchical sort based on the identified ancestral relationships.", "section": "3 Linear setting"}, {"figure_path": "xnmm1jThkv/tables/tables_6_1.jpg", "caption": "Figure 10: Runtimes for linear topological sorts, left: top row; right: bottom row, see Figure 5.", "description": "This table shows the runtime of three different linear topological sorting algorithms (LHTS, DirectLiNGAM, and R2-Sort) under varying dimensions (d) and sample sizes (n).  It complements Figure 5 in the paper by providing a quantitative view of the computational efficiency of each algorithm.", "section": "D.1 Runtimes for Linear Topological Sort"}, {"figure_path": "xnmm1jThkv/tables/tables_7_1.jpg", "caption": "Figure 14: Runtimes for edge pruning: tables correspond to the graphs in Figure 7, from left to right.", "description": "This table shows the runtime of four different edge pruning algorithms (ED, Lasso, GAM, and RESIT) across different graph sizes and sample sizes.  The runtimes are presented in seconds and include mean and standard deviation values. This table helps evaluate the computational efficiency of the algorithms.", "section": "D.5 Runtimes for Edge Pruning"}, {"figure_path": "xnmm1jThkv/tables/tables_16_1.jpg", "caption": "Figure 10: Runtimes for linear topological sorts, left: top row; right: bottom row, see Figure 5.", "description": "This table shows the runtime of three different linear topological sorting algorithms: LHTS, DirectLiNGAM, and R2-Sort.  The runtimes are shown for different graph sizes (dimensions d) and sample sizes (n).  It demonstrates the relative computational efficiency of the algorithms, with LHTS showing better scalability than DirectLiNGAM for larger datasets.", "section": "D.1 Runtimes for Linear Topological Sort"}, {"figure_path": "xnmm1jThkv/tables/tables_28_1.jpg", "caption": "Figure 10: Runtimes for linear topological sorts, left: top row; right: bottom row, see Figure 5.", "description": "This table presents the runtime (in seconds) of three different linear topological sorting algorithms: LHTS, DirectLiNGAM, and R^2-Sortability.  The runtimes are shown for different numbers of variables (d) and sample sizes (n).  It complements Figure 5 in the paper, providing a quantitative measure of the computational efficiency of each algorithm under varying dataset sizes and numbers of variables.", "section": "D.1 Runtimes for Linear Topological Sort"}, {"figure_path": "xnmm1jThkv/tables/tables_28_2.jpg", "caption": "Figure 11: Runtimes for nonlinear topological sorts, see Figure 6.", "description": "This table presents the runtimes for different nonlinear topological sorting algorithms (NHTS, DirectLiNGAM, NoGAM, GES, GRaSP, GSP, R2ST) under three noise distributions (Gaussian, Uniform, Laplace). The runtime is measured in seconds.  The results are shown as mean ± standard deviation.  It complements Figure 6 in the paper which shows the performance of these algorithms on topological accuracy.", "section": "Runtimes for Nonlinear Topological Sort"}, {"figure_path": "xnmm1jThkv/tables/tables_29_1.jpg", "caption": "Figure 14: Runtimes for edge pruning: tables correspond to the graphs in Figure 7, from left to right.", "description": "This table presents the runtime performance results of different edge pruning algorithms (ED, Lasso, GAM, and RESIT) under varying dimensions (d) and sample sizes (n).  The runtime values are presented as mean ± standard deviation.  The table directly supports the findings discussed in Section 7 of the paper which focuses on the Edge Discovery algorithm's runtime efficiency compared to existing methods.", "section": "D.5 Runtimes for Edge Pruning"}]