[{"type": "text", "text": "LuSh-NeRF: Lighting up and Sharpening NeRFs for Low-light Scenes ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Zefan Qu Ke $\\mathbf{X}\\mathbf{u}^{\\dagger}$ Gerhard Petrus Hancke Rynson W.H. Lau† ", "page_idx": 0}, {"type": "text", "text": "Department of Computer Science City University of Hong Kong zefanqu2-c@my.cityu.edu.hk, kkangwing@gmail.com, {gp.hancke, Rynson.Lau}@cityu.edu.hk ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Neural Radiance Fields (NeRFs) have shown remarkable performances in producing novel-view images from high-quality scene images. However, hand-held low-light photography challenges NeRFs as the captured images may simultaneously suffer from low visibility, noise, and camera shakes. While existing NeRF methods may handle either low light or motion, directly combining them or incorporating additional image-based enhancement methods does not work as these degradation factors are highly coupled. We observe that noise in low-light images is always sharp regardless of camera shakes, which implies an implicit order of these degradation factors within the image formation process. This inspires us to explore such an order to decouple and remove these degradation factors while training the NeRF. To this end, we propose in this paper a novel model, named LuSh-NeRF, which can reconstruct a clean and sharp NeRF from a group of hand-held low-light images. The key idea of LuSh-NeRF is to sequentially model noise and blur in the images via multi-view feature consistency and frequency information of NeRF, respectively. Specifically, LuSh-NeRF includes a novel Scene-Noise Decomposition (SND) module for decoupling the noise from the scene representation and a novel Camera Trajectory Prediction (CTP) module for the estimation of camera motions based on low-frequency scene information. To facilitate training and evaluations, we construct a new dataset containing both synthetic and real images. Experiments show that LuSh-NeRF outperforms existing approaches. Our code and dataset can be found here: https://github.com/quzefan/LuSh-NeRF. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Neural Radiance Fields (NeRFs) [31, 2, 3, 5, 24] have achieved notable success in modeling 3D scene information via implicit functions learned from a set of 2D images with known camera poses. Since optimizing NeRFs by measuring the colorimetric errors of training views essentially requires bright and sharp training images, hand-held low-light photography, which is prevalent in our daily life (e.g., in nighttime scenes), cannot be used directly for training NeRFs to produce visually pleasing novel view images (Fig. 1(b)), due to the co-existence of low visibility, noise, and camera motion blur in the captured images. ", "page_idx": 0}, {"type": "text", "text": "A straightforward solution is to incorporate existing low-light enhancement/deblurring methods (e.g., [57, 12, 67, 59, 13, 45]) to preprocess the captured images before using them for training the NeRFs. However, it raises two problems. First, as these methods are typically image-based, they do not consider the multi-view consistency. Second, These enhancement methods may introduce additional artifacts (e.g., overexposure and unnatural color contrast). We note that there are some NeRF methods proposed for handling low-light scenes [47, 6] and scene motions [26, 48, 19, 7]. However, while the former assumes no camera motions occur during the capture, the latter cannot handle low-light scenes. Directly applying them to our problem does not work. A visual example is shown in Fig. 1((c) to (e)), where existing methods struggle to render the desired results. ", "page_idx": 0}, {"type": "image", "img_path": "CcmHlE6N6u/tmp/390fa7093bd3b306452b76534e2ac99cb150f4099f71c9f4304259f453da1eb6.jpg", "img_caption": ["Figure 1: Given a hand-held captured low-light scene (a), while (a combination of) existing low-light enhancement/NeRF methods may not produce visually pleasing novel-view images ((b)-(e)), our LuSh-NeRF can produce bright and sharp results (f). "], "img_footnote": [], "page_idx": 1}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "We observe that in the captured low-light images, noise always appears sharp regardless of the camera shakes, due to the independent sensor noise generation within the collection and transformation of photons into electronic signals in the camera Image Signal Processor (ISP). This implies an implicit order of low visibility, sensor noise, and blur, which inspires us to model such an implicit order to decouple and remove those degradation factors for NeRF’s training in an unsupervised manner. ", "page_idx": 1}, {"type": "text", "text": "In this paper, we propose a novel method, called LuSh-NeRF, to Light up and Sharpen NeRF by sequentially modeling the degradation factors. Specifically, the brightness of training images is first scaled up to provide more contextual information (which simultaneously amplifies the noise in the images). We then propose two novel modules, i.e., a Scene-Noise Decomposition (SND) module and a Camera Trajectory Prediction (CTP) module, to handle the noise and camera shake problems. The SND module learns to decouple noise from the implicit scene representation by explicitly learning a noise field through leveraging the multi-view feature consistency of NeRF. The CTP module then estimates the camera trajectories for sharpening image details based on the lowfrequency information of denoised scene images rendered by SND. The two modules are optimized in an iterative manner such that the denoised scene representation of the SND module provides more information for predicting trajectories in the CTP module, while the results with sharp details from the CTP module in turn facilitate the denoising process in the SND module. To facilitate model training and evaluations, we construct a new dataset consisting of five synthesized scenes and five real scenes. As shown in Fig. 1(f), our LuSh-NeRF can render bright and sharp novel-view results. ", "page_idx": 1}, {"type": "text", "text": "In summary, this work has the following main contributions: ", "page_idx": 1}, {"type": "text", "text": "• We propose the first method (LuSh-NeRF) to reconstruct a NeRF from hand-held lowlight photographs, by decoupling and removing degradation factors through modeling their implicit orders.   \n• Our LuSh-NeRF contains two novel modules, a novel SND module for noise removal from the implicit scene representation and a novel CTP module for handling camera motions.   \n• We construct the first dataset for training and evaluations. Experiments show that LuShNeRF outperforms existing methods. ", "page_idx": 1}, {"type": "text", "text": "2 Related Works ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Neural Radiance Field (NeRF). NeRF [31] has fundamentally changed the way of modeling 3D scenes by learning coordinate-based implicit neural representations from a set of 2D observations. has gained widespread popularity in computer vision and graphics tasks pertaining to neural rendering, leveraging coordinate-based implicit neural representations (INR). It has gained significant popularity in computer vision and graphics tasks, with many NeRF variants proposed for, e.g., accelerating the training and rendering of NeRF [14, 18, 40, 41], handling dynamic scenes [21, 34, 39, 44, 61] and digital humans body [1, 34, 36, 37, 10] or human head [53, 68, 16] modeling, and the manipulation [4, 38, 28, 23] or generation [8, 15, 25, 33] of scene contents. Many variants of NeRF are also gradually expanding into multiple research areas. For example, [14, 18, 40, 41] are proposed to accelerate the NeRF training procedure, [21, 34, 39, 44, 61] are applied to render dynamic scenarios, [4, 38, 28, 23] are focused on the NeRF relighting methods, [1, 34, 36, 37, 53] are expanded to the non-rigid object rendering, [8, 15, 25, 33] are used for the generation models. These methods typically require high-quality (i.e., bright and sharp) 2D images for optimizing NeRFs. ", "page_idx": 2}, {"type": "text", "text": "NeRF from Low-light Images. Recently, there are some methods [47, 30, 6] proposed to relax such constraints by learning to reconstruct NeRFs from low-light images. Wang et al. [47] reconstructs a normally illuminated scene with multiple low-light images in an unsupervised manner. Cui et al. [6] can change the luminance of the scene by extending the transmittance function in NeRF. However, these methods do not consider the camera shakes that often occur in hand-held low-light imaging. ", "page_idx": 2}, {"type": "text", "text": "NeRF from Blurry Images. Rendering scenes with multiple blurry images is frequent and challenging in the real world. Ma et al. [26] firstly propose the deblurring problem in NeRF and simulate the blurring process with a deformable kernel. Most works [19, 48, 20, 17] model the camera motion trajectory in 3D space to handle the blur in normal-light scenes. Peng et al. [35] accelerate the deblurring process with an efficient rendering scheme. Huang et al. [17] utilize a blur generator to model the camera imaging process for the all-in-focus photos. However, these methods cannot handle hand-held low-light photographs as they do not jointly model noise and camera motions under low-light conditions. ", "page_idx": 2}, {"type": "text", "text": "Low-light Image Enhancement. Deep learning-based methods have been shown to be more effective in this task. Some Retinex-based methods [52, 65, 64, 54] and end-to-end methods [9, 11, 27, 32, 50, 56, 66, 58, 46, 22] are capable of achieving good enhanced results. Dong et al.[9] abandon the bayer-fliter to recover the low light color from raw camera data. Dudhane et al.[11] merge sequential images taken in the same scene to enhance the image quality. Xu et al.[56] take an SNR prior to guide the feature learning and formulate the network with a new self-attention model. However, there are few methods that can address the blur present in practical low-light images owing to the long exposure time. Recently, Zhou et al.[67] propose a large dataset for the low-light deblurring task, and some works [67, 62] propose solutions to enhance low-light blurred images. ", "page_idx": 2}, {"type": "text", "text": "Low-light Deblurring. There are few methods that can address the blur present in practical low-light images owing to the long exposure time. Recently, Zhou et al.[67] propose a large dataset for the low-light deblurring task, and some works [67, 62] propose solutions to enhance low-light blurred images. Zhou et al. [67] propose a highly coupled encoder-decoder architecture to solve the joint artifact. Zhang et al. [62] delves into the multiple degradations and proposes an all-in-one fashion restoration network. While our work addresses a similar problem, we aim for NeRF reconstruction, which is more challenging. ", "page_idx": 2}, {"type": "text", "text": "3 Proposed Method ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "In this section, we will introduce the details of the proposed method LuSh-NeRF, which can reconstruct a normally illuminated, sharp, and clean scenario from a set of hand-held captured low-light 2D images. Specifically, we first propose the SND module to separate noise from the scene information in the pre-processed image (Sec. 3.2), and then use the CTP module to make an accurate prediction of the kernel from the low-frequency information in the image (Sec. 3.3). Our network is supervised by multiple loss functions (Sec. 3.4). The overall structure of the network is shown in Fig. 2. ", "page_idx": 2}, {"type": "image", "img_path": "CcmHlE6N6u/tmp/d73e922a0b5f5eec1366ab820a5820481083f1a88a1b90a82590b55dacecf8d6.jpg", "img_caption": ["Figure 2: The pipeline of our proposed LuSh-NeRF. It contains two novel modules: (a) SND module: Decompose the noise in each view from the origin training image with a Noise NeRF architecture, and utilize the multi-view consistency characteristic in 3D scenario to separate the scene information and noise better; (b) CTP module: To minimize the interference of noise in low-light images on blur kernel predictions, the high frequency domain of the low light regions which are severely affected by noise are abandoned. In the rendering stage, we discard the Noise Estimator and Blur Kernel, and only use the Scenario-NeRF to render the enhanced scene. "], "img_footnote": [], "page_idx": 3}, {"type": "text", "text": "3.1 Problem Statement ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Preliminary of Neural Radiance Field. NeRF utilizes volume rendering [29] to synthesize 3D scenes by simulating multiple camera rays $\\mathbf{r}(t)=\\mathbf{o}+t\\mathbf{d}$ emitted into the scene, where $\\mathbf{o}$ represents the ray origin, $t$ is the sample distance, and d denotes the ray direction. The values at various sample points along these rays are encoded within an implicit neural network. Given a 3D coordinate ${\\bf x}=(x,y,z)$ and a querying view direction $\\mathbf{d}=(\\theta,\\phi)$ , NeRF estimates the function $F:(\\mathbf{x},\\mathbf{d})\\rightarrow(\\mathbf{c},\\sigma)$ through an MLP network, where c and $\\sigma$ represent the RGB color value and the volume density, respectively. After obtaining the information of each sample point on a ray, the pixel value $\\hat{C}(\\mathbf{r})$ of ray r can be computed as: ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\hat{C}(\\mathbf{r})=\\sum_{i=1}^{N}w_{i}\\mathbf{c}_{i}=\\sum_{i=1}^{N}T_{i}\\cdot\\left(1-\\exp(-\\sigma_{i}\\delta_{i})\\right)\\cdot\\mathbf{c}_{i},\\quad T_{i}=\\exp\\left(-\\sum_{j=1}^{i-1}\\sigma_{i}\\delta_{i}\\right),\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "where $\\delta$ is the distance between two subsequent sample points on a ray. $T_{i}$ is the accumulated transmittance value that denotes the radiance decay rate of sampled points. ", "page_idx": 3}, {"type": "text", "text": "Problem Modeling. For images taken in practical low-light scenarios, degradation can be modeled into 3 categories, as shown in the example in Fig. 3: (1) Low value intensity. The pixel value intensities in the image are generally low, which leads to increased difficulty in NeRF training [47], resulting in poor results as shown in Fig. 1(b); (2) Noise. Due to the sensor noise generated within the collection and transformation of photons, the image pixel values are distorted randomly and unpredictably; and (3) Camera motion blur. Long exposure times inevitably lead to blur in the photo due to the camera motion. When trying to address one of the three defects, the others interfere significantly. Therefore, how to reconstruct a properly illuminated, clear, and sharp NeRF scene from this poor-quality image is a very ch ", "page_idx": 3}, {"type": "image", "img_path": "CcmHlE6N6u/tmp/efe1436935b038d306d655d51ee63e0b44f8b34a8a88bb2288766917486e43fa.jpg", "img_caption": ["Figure 3: Different degradations in the real low light images. (a) Low intensity (b) Noise (c) Blur. allenging problem. "], "img_footnote": [], "page_idx": 3}, {"type": "text", "text": "In this work, we attempt to optimize the NeRF by decoupling and removing the above defects in the training stage. Modeling and analyzing noise and blur are difficult at low pixel intensity values. Thus, the low visibility of the image should first be raised. Considering that noise in a low-light photo is mainly generated by the imaging process and would not be affected by the camera motions, the implicit order of the defect decomposition should be low visibility, noise, and blur. ", "page_idx": 4}, {"type": "text", "text": "Specifically, given multiple training images $I_{l l,n o i s y,b l u r r y}$ from different views, NeRF aims to render a scenario with $I_{h l,c l e a r,s h a r p}$ . We first scale up the brightness of $I_{l l,n o i s y,b l u r r y}$ and get $I_{h l,n o i s y,b l u r r y}$ for more contextual information, but this process simultaneously amplifies the noise in the image. LuSh-NeRF then decomposes the image into scene and noise information with 3D multi-view consistency, removing the noise from the image to obtain $I_{h l,c l e a r,b l u r r y}$ . Finally, the image without noise interference is utilized to model the blur phenomenon and restore $I_{h l,c l e a r,s h a r p}$ . The enhancement process for LuSh-NeRF is as follows: ", "page_idx": 4}, {"type": "equation", "text": "$$\nI_{h l,c l e a r,s h a r p}=\\mathrm{R}(\\mathrm{LuSh-NeRF})=\\mathrm{Sharpen}(\\underbrace{\\mathrm{ScaleUp}(I_{l l,n o i s y,b l u r r y})-\\mathrm{Noise}}_{I_{h l,c l e a r,b l u r r y}}),\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where Noise is the noise of the different views predicted by the SND module. Sharpen $(\\cdot)$ denotes the CTP module to ease the camera motion blur phenomenon, and $\\mathbf{R}(\\cdot)$ is the NeRF rendering function. ", "page_idx": 4}, {"type": "text", "text": "During training, due to the lack of ground truth, $I_{h l,n o i s y,b l u r r y}\\ (i.e.,\\,\\mathrm{ScaleUp}(I_{l l,n o i s y,b l u r r y}))$ is used as the supervised signal. The inverse of Eq. 2 should be taken to simulate the low-quality image as: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\hat{I}_{h l,n o i s y,b l u r r y}=\\mathrm{Sharpen}^{-1}({\\tt R}(L u S h-N e R F))+\\mathrm{Noise},\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "After training, the correct-light (denoted as $h l$ ), sharp and clear NeRF model can be obtained directly by discarding the Sharpen $\\bar{-}1$ function and Noise. In the following subsections, we introduce how we estimate the Noise under each view with the SND module and how we accurately predict the Sharpen $^{-1}$ function with the CTP module. ", "page_idx": 4}, {"type": "text", "text": "3.2 Scenario-Noise Decomposition ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "Directly training NeRF with $I_{h l,n o i s y,b l u r r y}$ would still produce defective rendering results, as scaling up the low-light images can amplify noise and distort colors significantly, causing more severe multi-view inconsistency. ", "page_idx": 4}, {"type": "text", "text": "We note that while the noise is generally sharp and stochastic and has different values in different views, scenario information across views tends to be consistent. This makes it possible to decouple noise and scenario information. To co-optimize with the base network Scenario-NeRF (S-NeRF), we propose a new network, named Noise-Estimator (N-Estimator), which has the same network structure as S-NeRF, to compute the noise of each rendering coordinate. Since the noise is not consistent, N-Estimator discards the volume rendering calculation and directly takes the values of the intermediate sampling points of the input rays as the output. The formula for obtaining the noisy pixel $C_{n o i s y}(r)$ is: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{C_{n o i s y}(r)=\\mathbf{C}\\mathbf{T}\\mathbf{P}(C_{S-N e R F}(r))+C_{N-E s t i m a t o r}(r)=\\mathbf{C}\\mathbf{T}\\mathbf{P}(\\displaystyle\\sum_{i=1}^{N}w_{i}\\mathbf{c}_{i})+n\\frac{\\boldsymbol{\\mathbf{\\sigma}}}{2},}\\\\ &{\\qquad\\qquad\\qquad w h e r e\\quad n\\frac{\\boldsymbol{\\mathbf{\\sigma}}}{2}=M L P_{N-E s t i m a t o r}(P_{m i d},d),}\\end{array}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $P_{m i d}$ is the intermediate sampling points coordinate, and $d$ is the view direction. The $\\mathrm{CTP}(\\cdot)$ function refers to the Camera Trajectory Prediction module, $N$ is the number of sampled points on a ray, and $n_{\\frac{N}{2}}$ is the noise value rendered by N-Estimator. The volume rendering computation of S-NeRF gradually forces S-NeRF to learn the consistency scenario information, and the noise that does not share this feature is decomposed from the scene representation by the N-Estimator during the optimization process to fit the final noisy training images. ", "page_idx": 4}, {"type": "text", "text": "To more accurately decouple the scene information and noise, LuSh-NeRF utilizes the Rays Alignment supervision in the SND module. Specifically, An image matching method [43] is applied to the images rendered by S-NeRF after sharpening in each viewpoint to obtain a dense pixel matching matrix $M$ and a certainty matrix $C$ , which represent the coordinate pairs of matching pixels in different views and the confidence level of each matching. The current input ray is then taken as anchor_ray, and the coordinates of its rendered pixels are used to find the matching pixels under other viewpoints in $M$ . The confidence of the matching pairs in $C$ should be higher than the preset threshold $\\theta$ to ensure that accurate matches can be obtained. ", "page_idx": 4}, {"type": "text", "text": "", "page_idx": 5}, {"type": "text", "text": "With these matching pixel coordinates, we can get the corresponding aligned rays align_rayi under different viewpoints $v i e w_{i}$ . Ideally, the RGB colors computed by anchor_ray and align_rayi should be close to identical owing to the scenario consistency. So a consistency loss $L_{c o n s i s t e n c y}$ is proposed to reduce the distance within these rendering pixels in S-NeRF to force the decoupling of scene information and noise, as: ", "page_idx": 5}, {"type": "equation", "text": "$$\nL_{c o n s i s t e n c y}=\\frac{1}{K}\\sum_{i=1}^{K}\\left|C_{S-N e R F}(r_{i})-\\frac{1}{K}\\sum_{j=1}^{K}C_{S-N e R F}(r_{j})\\right|,\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $K$ is the number of training views. Constrained by $L_{c o n s i s t e n c y}$ , the information extracted by S-NeRF has a higher viewpoint consistency, leading to a better decomposition of the scene information and noise. ", "page_idx": 5}, {"type": "text", "text": "3.3 Camera Trajectory Prediction ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "Motivated by [19], the CTP module employs the same thoughts to predict the rigid camera motions with all rays in each view. However, unlike the properly lighted blurry data used in [19], the practical low light conditions present substantial interferences, which could cause notable errors in the CTP network predictions, as demonstrated in the results of Subsec 4.1. ", "page_idx": 5}, {"type": "text", "text": "When the SND module is not fully converged, noise still exists in the SND-processed scenario. The kernel prediction using rays with strong noise interference may interrupt the CTP network, and directly lead to the failure of the whole NeRF training. Hence, it is necessary to fliter the rays for CTP module optimization. Since the high-frequency and low-intensity regions in the low-light images are more disturbed by noise, corrupting the information in the original raw image [55], the CTP module utilizes Discrete Fourier Transform (DFT) to obtain the image frequency map as: ", "page_idx": 5}, {"type": "equation", "text": "$$\nY(u,v)=\\mathrm{DFT}(x(m,n))=\\sum_{m=0}^{M-1}\\sum_{n=0}^{N-1}x(m,n)\\cdot e^{-j2\\pi\\left({\\frac{u m}{M}}+{\\frac{v n}{N}}\\right)}.\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "The noisy high-frequency regions of the image are filtered by the low-pass filter $H$ of radius $r$ : ", "page_idx": 5}, {"type": "equation", "text": "$$\nY_{\\mathrm{lowpas}}(u,v)=H(u,v)\\cdot Y(u,v),\\quad{\\mathrm{where}}\\,H(u,v)=\\left\\{1,\\quad{\\mathrm{if~}}\\sqrt{u^{2}+v^{2}}\\leq r\\leq u^{2},\\right\\}\\cdot e^{-\\sigma}.\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "The retained low-frequency image regions are then converted back to the image via the $\\mathrm{DFT^{-1}}$ function to obtain the image informative region mask $M a s k_{\\mathrm{lowpass}}(m,n)$ as: ", "page_idx": 5}, {"type": "equation", "text": "$$\nM a s k_{\\mathrm{lowpass}}(m,n)=\\mathrm{\\bfBi}(\\mathrm{\\bfDFT}^{-1}\\left[Y_{\\mathrm{lowpass}}(u,v)\\right],T),\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $\\operatorname{Bi}(\\cdot,T)$ is a binarization function with threshold $T$ $\\therefore M a s k_{\\mathrm{lowpass}}(m,n)$ classifies the rays into $r a y_{c l e a r}$ and $r a y_{n o i s y}$ , which are used to render the clear and noise-dominated pixels in the training images separately. The gradient of $r a y_{n o i s y}$ to the rigid motion prediction network is detached during NeRF optimization to reduce the impact of noise yet to be removed by the SND module on blur kernel prediction as: ", "page_idx": 5}, {"type": "equation", "text": "$$\nr a y s=[r a y_{c l e a r},\\mathrm{Detach}(r a y_{n o i s y})],\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where the Detach $(\\cdot)$ function is used to detach the gradient from the variables. The role of the low-pass frequency filter is shown in Fig. 7, where the CTP Mask reduces the interference of noisy regions on the blur kernel prediction compared to the mask obtained by directly using the RGB intensity as the threshold. ", "page_idx": 5}, {"type": "text", "text": "3.4 Training & Rendering ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "After employing the SND and CTP modules as in Eq. 3, we have the simulated RGB values $\\hat{C}_{h l,n o i s y,b l u r r y}$ in the image $\\hat{I}_{h l,n o i s y,b l u r r y}$ . We can then optimize the network with the MSE loss $L_{c o n s t u r c t i o n}$ as: ", "page_idx": 5}, {"type": "equation", "text": "$$\nL_{c o n s t r u c t i o n}=\\sum_{i}\\|\\hat{C}_{h l,n o i s y,b l u r r y}(r_{i})-C_{h l,n o i s y,b l u r r y}(r_{i})\\|_{2}.\n$$", "text_format": "latex", "page_idx": 5}, {"type": "image", "img_path": "CcmHlE6N6u/tmp/75001c8e004f728d4ddcf709d1160606bd5e982f6deea9e80328f672201465e1.jpg", "img_caption": ["Figure 4: Qualitative results of different methods on our real scenes. Our LuSh-NeRF can render cleaner and sharper results for real low-light scenes with camera motions. ", "Low-light Scenes LEDNet [67]+NeRF [31] PairLIE [13]+DP-NeRF [19] Restormer [59]+LLNeRF [47] LuSh-NeRF(Ours) "], "img_footnote": [], "page_idx": 6}, {"type": "text", "text": "All the modules in the network are trained in an end-to-end manner with the following training losses: ", "page_idx": 6}, {"type": "equation", "text": "$$\nL_{L u S h-N e R F}=\\alpha\\cdot L_{c o n s t r u c t i o n}+\\beta\\cdot L_{c o n s i s t e n c y},\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "where $\\alpha$ and $\\beta$ are the hyper-parameters to balance the impact of two losses. When rendering a scenario, only the S-NeRF network in LuSh-NeRF is utilized with the volume rendering method to produce images of different views. ", "page_idx": 6}, {"type": "text", "text": "4 Experiments ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "Our Dataset. Since we are the first to reconstruct NeRF with hand-held low-light photographs, we build a new dataset based on the low-light image deblur dataset [67] for training and evaluation. Specifically, our dataset consists of 5 synthetic and 5 real scenes, for the quantitative and generalization evaluations. We use the COLMAP [42] method to estimate the camera pose of each image in the scenarios. Each scenario contains 20-25 images, at $1120\\times640$ resolution. The brightness of images in each scenario is extremely low, where the intensities of most pixels are below 50. $80\\%$ of the images contain camera shake problems, which pose a significant challenge for NeRF reconstruction. Refer to Appendix A.3 for more details of our dataset. ", "page_idx": 6}, {"type": "text", "text": "Implementation Details. We have implemented our LuSh-NeRF based on the official code of Deblur-NeRF [26], and with the same Rigid Blurring Kernel network in [19]. The S-NeRF shares the same structure as NeRF [31], while the the depth and width of N-Estimator are set to half of those of the S-NeRF. The number of camera motions $k$ and the frequency fliter radius in the CTP module are set to 4 and 30. The number of aligned rays $K$ and certainty threshold $\\theta$ in the SND module are set to 20 and 0.8. Before training, the input images are up-scaled by gamma adjustment and histogram equalization. The batch size is set to 1,024 rays, with 64 fine and coarse sampled points. $\\alpha$ and $\\beta$ are set to 1 and 0 during the first 60K iterations for better rendering results, to avoid the inaccuracy matching matrix $M$ interfering with the SND module. The two hyper-parameters are then changed to ", "page_idx": 6}, {"type": "image", "img_path": "CcmHlE6N6u/tmp/df7e2af333271da10e689a9d2746743c6c93563ef390a7a554dc0767459c516c.jpg", "img_caption": ["Figure 5: Qualitative results of different methods on our synthetic scenes. Our method yields the most natural restoration results while sharpening the image. "], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "1 and $1\\times10^{-2}$ in the last 40K iterations. All the experiments in this paper are performed on a PC with an i9-13900K CPU and a single NVIDIA RTX3090 GPU. ", "page_idx": 7}, {"type": "text", "text": "4.1 Main Results ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "Evaluation Methods and Metrics. Since we are the first to tackle the NeRF reconstruction from lowlight images captured with camera motions, we design several baseline methods by combining existing state-of-the-art image-based and NeRF-based methods: (1) Low-light image enhancement [54, $^{49]+}$ Image deblurring method $[60,59]+\\mathrm{NeRF}$ [31]; (2) Joint low-light image enhancement and deblurring method $[67]+\\mathrm{NeRF}$ [31]; (3) Low-light image enhancement [13, $54]+$ deblurring NeRF [19]; and (4) Image deblurring [59, $60]+$ low-light NeRF enhancement [47]. All the selected models have been shown to achieve SOTA performances on their individual tasks. PSNR, SSIM, and LPIPS [63] metrics are used to evaluate the performance difference of the rendered images between LuSh-NeRF and the combination of other state-of-the-art methods. Due to the significant variations in color contrast ratio and image brightness of the restored low light images by different methods, we consider LPIPS (Learned Perceptual Image Patch Similarity), which can reasonably assess perceptual image quality and visual differences rather than the pixel-level difference, as the key metric. ", "page_idx": 7}, {"type": "text", "text": "Visual Comparisons. Fig. 4 presents qualitative comparison of the rendering results from the above three combined methods with those of our LuSh-NeRF in our real low-light scenarios. We can see that the results from LEDNet [67] are still dark, which significantly limits the learning capability of the NeRF. While PairLIE [13] combined with DP-NeRF [19] can reconstruct clear rendering results, they are rather unnatural. The color contrast is severely shifted, resulting in unrealistic images with some lost details and incomplete blur removal. In addition, we can also observe that first deblurring on low-light images and then applying the LLE method, as in Restormer $[59]+\\mathrm{LLNeRF}$ [47], is less effective, and there is still substantial blurring in the results. In contrast, our approach can recover detailed scenes with natural colors, resulting in a sharp and clean novel view visualization. ", "page_idx": 7}, {"type": "text", "text": "Fig. 5 presents qualitative comparison between existing methods and our LuSh-NeRF on our synthetic scenes. All of the above methods suffer serious performance degradation when the image luminance is low and the camera shake is severe (e.g., the bottom of the first example in Fig. 5), where LuSh-NeRF can still reconstruct a satisfactory scene by decoupling the defects of the scene. As we can see from the given visualizations on realistic and synthesized data, higher PSNR and SSIM metrics of the methods (e.g., LEDNet $^+$ NeRF) do not entirely represent better performances on the NeRF results in our proposed task. This demonstrates that the perceptual metric, LPIPS, is better at assessing the merits of the reconstructed scenario. Refer to Appendix A.5 for more visual results. ", "page_idx": 7}, {"type": "table", "img_path": "CcmHlE6N6u/tmp/8a4d8312c1a62a30ade8ceba2e478ab09195862e516fd0e0f5af105e32113e4d.jpg", "table_caption": [], "table_footnote": ["Table 1: Quantitative comparison of different methods on our synthetic scenes. The best and the second performances of each scenario are marked in the table. "], "page_idx": 8}, {"type": "text", "text": "", "page_idx": 8}, {"type": "text", "text": "Quantitative Comparison. We conduct a quantitative comparison of our method against various combinations of SOTA approaches on our synthesized data in Tab. 1. Note that our synthesized data originates from the training and testing sets of LOL-Blur dataset [67], while the weight of LEDNet [67] is also specifically trained on the synthesized dataset of LOL-Blur. This condition does not constitute a fair comparison. Nonetheless, we report the results of using “LEDNet $[67]+$ NeRF [31]” as a reference. ", "page_idx": 8}, {"type": "text", "text": "Our method achieves better performances than multiple combinations of existing methods on all 5 synthesized data. In terms of the LPIPS metric on all the scenarios, our method outperforms the rendering results of LEDNet $[67]+\\mathrm{NeRF}$ [31] in an unsupervised optimization manner, which proves that the SND and CTP modules in LuSh-NeRF fully utilize the 3D information of the scene to aid in the recovery of the irreversible quality degradation in the single image. ", "page_idx": 8}, {"type": "text", "text": "Ablation Study. Fig. 6 demonstrates the effect of the various components of LuSh-NeRF on a realistic scenario. After the images are preprocessed to enhance the luminance, the noise in the images is significantly amplified (as shown in the white box). Directly using blur kernel prediction [19] on these images is heavily interfered by noise, which prevents recovery from camera shakes (Fig. 6(b)). In addition, incorrect kernel predictions have a negative impact as they make it difficult to align the multi-view images rendered by S-NeRF and the SND module cannot obtain accurate viewpoint consistency supervision (Fig. 6(c)). When the CTP module is utilized, the blur of the image is alleviated, but the noise problem is still serious (Fig. 6(d)). First sharpening the image with CTP and then removing noise with SND can somewhat suppress the noise problem, but the noise may be reconstructed to the various viewpoints and is not completely removed (Fig. 6(e)). LuSh-NeRF can render sharp and clean scenario images in novel views after the training process (Fig. 6(f)). ", "page_idx": 8}, {"type": "image", "img_path": "CcmHlE6N6u/tmp/4f570edfde302fcbb4362142c5b215ba67e3e77d5180d93cc2d50d7e370cee69.jpg", "img_caption": ["Figure 6: Ablation study of LuSh-NeRF on a real scenario. "], "img_footnote": [], "page_idx": 8}, {"type": "image", "img_path": "CcmHlE6N6u/tmp/0b1abf527eb4a7e3f00765bcf3c9b53cf7220b8dadd3f97a8456db4673ecf275.jpg", "img_caption": ["Figure 7: The RGB intensity mask and CTP mask comparison. Two masks are generated with the same threshold $T$ . White points represent 1 and black points represent 0 in each mask. "], "img_footnote": [], "page_idx": 9}, {"type": "text", "text": "", "page_idx": 9}, {"type": "text", "text": "We show in the Fig. 7 the difference between the two masks obtained by directly performing an RGB intensity threshold and performing a frequency filtering before taking a threshold. (1) The RGB intensities in many noise-dominant regions are also high (e.g., the sky and the grass), which are harmful to the blur estimation but not excluded in the mask produced by thresholding. (2) The CTP module uses a frequency filter to identify the low-frequency-dominated regions of the image, and then obtains the desired mask based on the RGB intensity values. The gradients of rays in high-frequency and dark regions (regions more severely affected by noise) are detached during the Blur Kernel optimization process, which ensures better blur modeling. ", "page_idx": 9}, {"type": "text", "text": "5 Conclusion and Limitation ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "In this paper, we have proposed the NeRF reconstruction task from low-light images with camera motions, and a novel unsupervised reconstruction network LuSh-NeRF. LuSh-NeRF models the NeRF restoration process based on the characteristics of three kinds of defects in the scene, i.e., low-light, noise, and camera blur, and successfully reconstructs a normal-light, clean, and sharp NeRF network from poor-quality low-light images, by exploiting multi-view consistency and frequency-domain information. To facilitate the training and evaluation of the new proposed task, we construct a new dataset which contains 5 synthetic and 5 real scenes low light images with hand-held camera motions. Extensive experiments on our proposed dataset demonstrate that our method is capable of achieving satisfactory NeRF reconstruction results, despite the defects in the input images. ", "page_idx": 9}, {"type": "text", "text": "The LuSh-NeRF network also has some limitations. One limitation is that it needs to optimize two NeRF networks at the same time and render multiple rays for the blur problem when sharpening images during training, which results in a slower optimization process, even though this would not interfere with the rendering speed. Besides, noise that is relatively similar across views may be difficult to remove due to the reliance on viewpoint consistency. (Refer to Appendix A.8 for details.) As a future work, we would like to address these issues. ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "[1] ShahRukh Athar, Zexiang Xu, Kalyan Sunkavalli, Eli Shechtman, and Zhixin Shu. Rignerf: Fully controllable neural 3d portraits. In CVPR, 2022. [2] Jonathan T Barron, Ben Mildenhall, Matthew Tancik, Peter Hedman, Ricardo Martin-Brualla, and Pratul P Srinivasan. Mip-nerf: A multiscale representation for anti-aliasing neural radiance fields. In ICCV, 2021. [3] Jonathan T Barron, Ben Mildenhall, Dor Verbin, Pratul P Srinivasan, and Peter Hedman. Mip-nerf 360: Unbounded anti-aliased neural radiance fields. In CVPR, 2022. [4] Sai Bi, Zexiang Xu, Pratul Srinivasan, Ben Mildenhall, Kalyan Sunkavalli, Miloš Hašan, Yannick HoldGeoffroy, David Kriegman, and Ravi Ramamoorthi. Neural reflectance fields for appearance acquisition. arXiv:2008.03824, 2020. [5] Anpei Chen, Zexiang Xu, Fuqiang Zhao, Xiaoshuai Zhang, Fanbo Xiang, Jingyi Yu, and Hao Su. Mvsnerf: Fast generalizable radiance field reconstruction from multi-view stereo. In ICCV, 2021. [6] Ziteng Cui, Lin Gu, Xiao Sun, Xianzheng Ma, Yu Qiao, and Tatsuya Harada. Aleth-nerf: Illumination adaptive nerf with concealing field assumption. In AAAI, 2024. [7] Peng Dai, Yinda Zhang, Xin Yu, Xiaoyang Lyu, and Xiaojuan Qi. Hybrid neural rendering for large-scale scenes with motion blur. In CVPR, 2023.   \n[8] Yu Deng, Jiaolong Yang, Jianfeng Xiang, and Xin Tong. Gram: Generative radiance manifolds for 3d-aware image generation. In CVPR, 2022.   \n[9] Xingbo Dong, Wanyan Xu, Zhihui Miao, Lan Ma, Chao Zhang, Jiewen Yang, Zhe Jin, Andrew Beng Jin Teoh, and Jiajun Shen. Abandoning the bayer-filter to see in the dark. In CVPR, 2022.   \n[10] Zheng Dong, Ke Xu, Yaoan Gao, Qilin Sun, Hujun Bao, Weiwei Xu, and Rynson W. H. Lau. Sailor: Synergizing radiance and occupancy fields for live human performance capture. ACM TOG, 2023.   \n[11] Akshay Dudhane, Syed Waqas Zamir, Salman Khan, Fahad Shahbaz Khan, and Ming-Hsuan Yang. Burst image restoration and enhancement. In CVPR, 2022.   \n[12] Huiyuan Fu, Wenkai Zheng, Xiangyu Meng, Xin Wang, Chuanming Wang, and Huadong Ma. You do not need additional priors or regularizers in retinex-based low-light image enhancement. In CVPR, 2023.   \n[13] Zhenqi Fu, Yan Yang, Xiaotong Tu, Yue Huang, Xinghao Ding, and Kai-Kuang Ma. Learning a simple low-light image enhancer from paired low-light instances. In CVPR, 2023.   \n[14] Stephan J Garbin, Marek Kowalski, Matthew Johnson, Jamie Shotton, and Julien Valentin. Fastnerf: High-fidelity neural rendering at 200fps. In ICCV, 2021.   \n[15] Jiatao Gu, Lingjie Liu, Peng Wang, and Christian Theobalt. Stylenerf: A style-based 3d-aware generator for high-resolution image synthesis. arXiv:2110.08985, 2021.   \n[16] Andrew Hou, Feng Liu, Zhiyuan Ren, Michel Sarkis, Ning Bi, Yiying Tong, and Xiaoming Liu. Infamousnerf: Improving face modeling using semantically-aligned hypernetworks with neural radiance fields. arXiv preprint arXiv:2312.16197, 2023.   \n[17] Xin Huang, Qi Zhang, Ying Feng, Hongdong Li, and Qing Wang. Inverting the imaging process by learning an implicit camera model. In CVPR, 2023.   \n[18] Christoph Lassner and Michael Zollhofer. Pulsar: Efficient sphere-based neural rendering. In CVPR, 2021.   \n[19] Dogyoon Lee, Minhyeok Lee, Chajin Shin, and Sangyoun Lee. Dp-nerf: Deblurred neural radiance field with physical scene priors. In CVPR, 2023.   \n[20] Dongwoo Lee, Jeongtaek Oh, Jaesung Rim, Sunghyun Cho, and Kyoung Mu Lee. Exblurf: Efficient radiance fields for extreme motion blurred images. In ICCV, 2023.   \n[21] Tianye Li, Mira Slavcheva, Michael Zollhoefer, Simon Green, Christoph Lassner, Changil Kim, Tanner Schmidt, Steven Lovegrove, Michael Goesele, Richard Newcombe, et al. Neural 3d video synthesis from multi-view video. In CVPR, 2022.   \n[22] Yiyu Li, Ke Xu, Gerhard Petrus Hancke, and Rynson W.H. Lau. Color shift estimation-and-correction for image enhancement. In CVPR, 2024.   \n[23] Zhengqin Li, Jia Shi, Sai Bi, Rui Zhu, Kalyan Sunkavalli, Miloš Hašan, Zexiang Xu, Ravi Ramamoorthi, and Manmohan Chandraker. Physically-based editing of indoor scene lighting from a single image. In ECCV, 2022.   \n[24] Lingjie Liu, Jiatao Gu, Kyaw Zaw Lin, Tat-Seng Chua, and Christian Theobalt. Neural sparse voxel fields. In NeurIPS, 2020.   \n[25] Steven Liu, Xiuming Zhang, Zhoutong Zhang, Richard Zhang, Jun-Yan Zhu, and Bryan Russell. Editing conditional radiance fields. In ICCV, 2021.   \n[26] Li Ma, Xiaoyu Li, Jing Liao, Qi Zhang, Xuan Wang, Jue Wang, and Pedro V Sander. Deblur-nerf: Neural radiance fields from blurry images. In CVPR, 2022.   \n[27] Long Ma, Tengyu Ma, Risheng Liu, Xin Fan, and Zhongxuan Luo. Toward fast, flexible, and robust low-light image enhancement. In CVPR, 2022.   \n[28] Ricardo Martin-Brualla, Noha Radwan, Mehdi SM Sajjadi, Jonathan T Barron, Alexey Dosovitskiy, and Daniel Duckworth. Nerf in the wild: Neural radiance fields for unconstrained photo collections. In CVPR, 2021.   \n[29] Nelson Max. Optical models for direct volume rendering. IEEE TVCG, 1995.   \n[30] Ben Mildenhall, Peter Hedman, Ricardo Martin-Brualla, Pratul P Srinivasan, and Jonathan T Barron. Nerf in the dark: High dynamic range view synthesis from noisy raw images. In CVPR, 2022.   \n[31] Ben Mildenhall, Pratul P Srinivasan, Matthew Tancik, Jonathan T Barron, Ravi Ramamoorthi, and Ren Ng. Nerf: Representing scenes as neural radiance fields for view synthesis. Communications of the ACM, 2021.   \n[32] Sean Moran, Pierre Marza, Steven McDonagh, Sarah Parisot, and Gregory Slabaugh. Deeplpf: Deep local parametric filters for image enhancement. In CVPR, 2020.   \n[33] Michael Niemeyer and Andreas Geiger. Giraffe: Representing scenes as compositional generative neural feature fields. In CVPR, 2021.   \n[34] Keunhong Park, Utkarsh Sinha, Jonathan T Barron, Sofien Bouaziz, Dan B Goldman, Steven M Seitz, and Ricardo Martin-Brualla. Nerfies: Deformable neural radiance fields. In CVPR, 2021.   \n[35] Cheng Peng and Rama Chellappa. Pdrf: progressively deblurring radiance field for fast scene reconstruction from blurry images. In AAAI, 2023.   \n[36] Sida Peng, Junting Dong, Qianqian Wang, Shangzhan Zhang, Qing Shuai, Xiaowei Zhou, and Hujun Bao. Animatable neural radiance fields for modeling dynamic human bodies. In ICCV, 2021.   \n[37] Sida Peng, Yuanqing Zhang, Yinghao Xu, Qianqian Wang, Qing Shuai, Hujun Bao, and Xiaowei Zhou. Neural body: Implicit neural representations with structured latent codes for novel view synthesis of dynamic humans. In CVPR, 2021.   \n[38] Julien Philip, Sébastien Morgenthaler, Michaël Gharbi, and George Drettakis. Free-viewpoint indoor neural relighting from multi-view stereo. ACM TOG, 2021.   \n[39] Albert Pumarola, Enric Corona, Gerard Pons-Moll, and Francesc Moreno-Noguer. D-nerf: Neural radiance fields for dynamic scenes. In CVPR, 2021.   \n[40] Daniel Rebain, Wei Jiang, Soroosh Yazdani, Ke Li, Kwang Moo Yi, and Andrea Tagliasacchi. Derf: Decomposed radiance fields. In CVPR, 2021.   \n[41] Christian Reiser, Songyou Peng, Yiyi Liao, and Andreas Geiger. Kilonerf: Speeding up neural radiance fields with thousands of tiny mlps. In ICCV, 2021.   \n[42] Johannes Lutz Schönberger, Enliang Zheng, Marc Pollefeys, and Jan-Michael Frahm. Pixelwise view selection for unstructured multi-view stereo. In ECCV, 2016.   \n[43] Xuelun Shen, Wei Yin, Matthias Müller, Zijun Li, Kaixuan Wang, Xiaozhi Chen, Cheng Wang, et al. Gim: Learning generalizable image matcher from internet videos. In ICLR, 2023.   \n[44] Edgar Tretschk, Ayush Tewari, Vladislav Golyanik, Michael Zollhöfer, Christoph Lassner, and Christian Theobalt. Non-rigid neural radiance fields: Reconstruction and novel view synthesis of a dynamic scene from monocular video. In ICCV, 2021.   \n[45] Di Wang, Long Ma, Risheng Liu, and Xin Fan. Semantic-aware texture-structure feature collaboration for underwater image enhancement. In 2022 International Conference on Robotics and Automation (ICRA), pages 4592–4598. IEEE, 2022.   \n[46] Haoyuan Wang, Ke Xu, and Rynson WH Lau. Local color distributions prior for image enhancement. In ECCV, 2022.   \n[47] Haoyuan Wang, Xiaogang Xu, Ke Xu, and Rynson WH Lau. Lighting up nerf via unsupervised decomposition and enhancement. In ICCV, 2023.   \n[48] Peng Wang, Lingzhe Zhao, Ruijie Ma, and Peidong Liu. Bad-nerf: Bundle adjusted deblur neural radiance fields. In CVPR, 2023.   \n[49] Tao Wang, Kaihao Zhang, Tianrun Shen, Wenhan Luo, Bjorn Stenger, and Tong Lu. Ultra-high-definition low-light image enhancement: A benchmark and transformer-based method. In AAAI, 2023.   \n[50] Yufei Wang, Renjie Wan, Wenhan Yang, Haoliang Li, Lap-Pui Chau, and Alex Kot. Low-light image enhancement with normalizing flow. In AAAI, 2022.   \n[51] Zirui Wang, Shangzhe Wu, Weidi Xie, Min Chen, and Victor Adrian Prisacariu. Nerf–: Neural radiance fields without known camera parameters. arXiv preprint arXiv:2102.07064, 2021.   \n[52] Chen Wei, Wenjing Wang, Wenhan Yang, and Jiaying Liu. Deep retinex decomposition for low-light enhancement. arXiv:1808.04560, 2018.   \n[53] Chung-Yi Weng, Brian Curless, Pratul P Srinivasan, Jonathan T Barron, and Ira Kemelmacher-Shlizerman. Humannerf: Free-viewpoint rendering of moving people from monocular video. In CVPR, 2022.   \n[54] Wenhui Wu, Jian Weng, Pingping Zhang, Xu Wang, Wenhan Yang, and Jianmin Jiang. Uretinex-net: Retinex-based deep unfolding network for low-light image enhancement. In CVPR, 2022.   \n[55] Ke Xu, Xin Yang, Baocai Yin, and Rynson WH Lau. Learning to restore low-light images via decomposition-and-enhancement. In CVPR, 2020.   \n[56] Xiaogang Xu, Ruixing Wang, Chi-Wing Fu, and Jiaya Jia. Snr-aware low-light image enhancement. In CVPR, 2022.   \n[57] Xiaogang Xu, Ruixing Wang, and Jiangbo Lu. Low-light image enhancement via structure modeling and guidance. In CVPR, 2023.   \n[58] Xin Yang, Ke Xu, Yibing Song, Qiang Zhang, Xiaopeng Wei, and Rynson WH Lau. Image correction via deep reciprocating hdr transformation. In CVPR, 2018.   \n[59] Syed Waqas Zamir, Aditya Arora, Salman Khan, Munawar Hayat, Fahad Shahbaz Khan, and Ming-Hsuan Yang. Restormer: Efficient transformer for high-resolution image restoration. In CVPR, 2022.   \n[60] Syed Waqas Zamir, Aditya Arora, Salman Khan, Munawar Hayat, Fahad Shahbaz Khan, Ming-Hsuan Yang, and Ling Shao. Multi-stage progressive image restoration. In CVPR, 2021.   \n[61] Jiakai Zhang, Xinhang Liu, Xinyi Ye, Fuqiang Zhao, Yanshun Zhang, Minye Wu, Yingliang Zhang, Jingyi Yu, and Lan Xu. Editable free-viewpoint video using a layered neural representation. ACM TOG, 2021.   \n[62] Jinghao Zhang, Jie Huang, Mingde Yao, Zizheng Yang, Hu Yu, Man Zhou, and Feng Zhao. Ingredientoriented multi-degradation learning for image restoration. In CVPR, 2023.   \n[63] Richard Zhang, Phillip Isola, Alexei A Efros, Eli Shechtman, and Oliver Wang. The unreasonable effectiveness of deep features as a perceptual metric. In CVPR, 2018.   \n[64] Yonghua Zhang, Xiaojie Guo, Jiayi Ma, Wei Liu, and Jiawan Zhang. Beyond brightening low-light images. IJCV, 2021.   \n[65] Yonghua Zhang, Jiawan Zhang, and Xiaojie Guo. Kindling the darkness: A practical low-light image enhancer. In ACM multimedia, 2019.   \n[66] Chuanjun Zheng, Daming Shi, and Wentian Shi. Adaptive unfolding total variation network for low-light image enhancement. In ICCV, 2021.   \n[67] Shangchen Zhou, Chongyi Li, and Chen Change Loy. Lednet: Joint low-light enhancement and deblurring in the dark. In ECCV, 2022.   \n[68] Yiyu Zhuang, Hao Zhu, Xusen Sun, and Xun Cao. Mofanerf: Morphable facial neural radiance field. In ECCV, pages 268–285, 2022. ", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "A Appendix ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "A.1 Broader Impacts ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "While we do not foresee our method causing any direct negative societal impact, it may be leveraged to help create fake images using image generation techniques. The human information in the captured images may have the risk of a leak that raises privacy concerns. We urge the readers to limit the usage of this work to legal use cases. ", "page_idx": 13}, {"type": "text", "text": "A.2 Details of the RBK module ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "The Rigid Blurring Kernel (RBK) module proposed in the DP-NeRF [19] is utilized in our CTP module. It mimics the scene blur kernel by simulating the 3D camera motions, which contains the following two main parts: ", "page_idx": 13}, {"type": "text", "text": "Ray Rigid Transformation: The blurring process of an image is modeled by the Ray Rigid Transformation (RRT). The RRT is formulated as ray transformation derived from the deformation of rigid camera motion, defined as the dense SE(3) field for scene $s$ , approximated by the MLPs as follows: ", "page_idx": 13}, {"type": "equation", "text": "$$\nS_{s}=(r_{s};v_{s})=(\\mathcal{R}(\\mathcal{E}(l_{s});\\mathcal{L}(\\mathcal{E}(l_{s}))),w h e r e\\,s\\in v i e w_{i m g},\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "where $l_{s}$ is the latent code for each view through the embedding layer in [1], $\\mathcal{R},\\mathcal{L},\\mathcal{E}$ are three MLP networks, $v i e w_{i m g}$ is the training image set. The $S_{s}=(r_{s};v_{s})\\in\\mathbb{R}^{6}$ is the matrix which will be used for the RRT modeling as follows: ", "page_idx": 13}, {"type": "equation", "text": "$$\nr a y_{s;q}^{R R T}=R i g i d\\_T r a n s f o r m(r a y_{s},(r_{s};v_{s})),\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "hwyhpeerre- $r a y_{s}$ m aentedr $r a y_{s;q}^{R R T}$ traorles  tthhee  onrugimnb rear yo fa ncda tmheer at ramnostfioornsm ecdo nrtariybs uitni nsgc teon et $s$ , $q\\in\\{1,...,k\\}$ c, $\\boldsymbol{\\mathrm{k}}$ es $s$ The blurry RGB value at $r a y_{s}$ can be acquired by weighting sums of the NeRF volume rendering values Cs;0 and Cs;q from rays and raysR;qR ", "page_idx": 13}, {"type": "text", "text": "Coarse Composition Weights: This part is responsible for computing the weights of each ray obtained by the RRT part, which is given by the following equation: ", "page_idx": 13}, {"type": "equation", "text": "$$\nw_{s;0,1,\\ldots,k}=\\sigma(\\mathcal{W}(\\mathcal{E}(l_{s}))),w h e r e\\,\\sum_{i=0}^{k}m_{s;i}=1,\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "where $m_{s}$ is the final weight for each ray in RRT. Finally, blurry color $C_{s}$ for scene $s$ can be computed by the weighted sum operation as shown below: ", "page_idx": 13}, {"type": "equation", "text": "$$\nC_{s}=m_{s;0}C_{s;0}+\\sum_{q=1}^{k}m_{s;q}C_{s;q}.\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "A.3 Details of the Proposed Dataset ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "In this work, we collect low-light blurry images from five synthetic and real videos in the LOL-Blur dataset [67] and calculate the camera pose for each image with COLMAP [42] toolbox. For synthetic data, we use ground truth images to estimate camera pose, while for realistic data, the images recovered from LEDNet pre-trained model are utilized to estimate pose since COLMAP is hard to model the scenario with the origin low light images. Images with large shifts in each scenario are removed. The number of images for each scene and the training and evaluation viewpoint allocation are shown in Tab. 2. ", "page_idx": 13}, {"type": "table", "img_path": "CcmHlE6N6u/tmp/977162adb9421e4003df61ee6a1a99780130057351f542af0fd1f5457fca2ca7.jpg", "table_caption": ["Table 2: The dataset split details for our proposed LOL-BlurNeRF dataset. "], "table_footnote": [], "page_idx": 13}, {"type": "text", "text": "All images have a resolution of $1120\\times640$ . The mean value of all pixels in the images is low (less than 50) and camera motion blur is present in $80\\%$ of the images in each scene. As illustrated in Fig. 1, Fig. 4, Fig. 5 and Fig. 9, poor image quality in each scene leads to a challenging NeRF reconstruction task. ", "page_idx": 14}, {"type": "text", "text": "A.4 Quantitative Ablation Studies ", "text_level": 1, "page_idx": 14}, {"type": "table", "img_path": "CcmHlE6N6u/tmp/8218230a0cbd5c2730228a92e14de172c99c73aaf7e17b4cfb311818d0e73553.jpg", "table_caption": ["We have conducted detailed ablation studies on all the synthetic scenes in the Tab. 3. "], "table_footnote": ["Table 3: Ablation Study of different modules in our LuSh-NeRF. The best performances of each scenario are marked in the table. "], "page_idx": 14}, {"type": "text", "text": "(1) Lines 1 and 2 show that the ScaleUp preprocessing enhances the NeRF’s reconstruction capabilities, resulting in an improved image. ", "page_idx": 14}, {"type": "text", "text": "(2) Lines 3 and 4 show that CTP leverages frequency domain information to refine Blur Kernel predictions, boosting the perceptual quality of the reconstructed images. However, this process may decrease the PSNR and SSIM scores as it neglects noise interference. ", "page_idx": 14}, {"type": "text", "text": "(3) From Lines 2 and 5, the SND module can disentangle noise and scene information from the input noisy-blurry images, leading to substantial improvements on the PSNR and SSIM metrics. However, the SND module is not capable of resolving the blur problem, which leads to a minor improvement in the image’s perceptual quality (more important for the rendered images). ", "page_idx": 14}, {"type": "text", "text": "(4) The comparisons between Lines 4, 5, and 8 show that combining SND and CTP modules enhances image perceptual quality and outperforms using only CTP in terms of PSNR and SSIM scores. ", "page_idx": 14}, {"type": "text", "text": "(5) Lines 7 and 8 show that decoupling the noise in the scene first, and then modeling the scene blur is a more robust restoration order, as it can effectively reduce the interference of noise in the deblurring process for obtaining better performances. ", "page_idx": 14}, {"type": "text", "text": "We have conducted the ablation experiments of the CTP module on two synthetic scenes in the Tab. 4. ", "page_idx": 14}, {"type": "table", "img_path": "CcmHlE6N6u/tmp/1b05add6ddad440b1b9101ac84b370b2d2f50f44ef5e52e576a93c37d95b686c.jpg", "table_caption": [], "table_footnote": ["Table 4: The ablation studies of the CTP module. "], "page_idx": 14}, {"type": "text", "text": "The experimental results show that the frequency filter provides a more desirable mask, which is superior to the directly obtained mask with RGB intensity thresholds. ", "page_idx": 14}, {"type": "text", "text": "A.5 More Visual Results ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "We provide more visual comparisons between our proposed LuSh-NeRF network and the sota methods combinations, i.e., LEDNet $[67]+\\mathrm{NeRF}$ , Restormer [59] $^+$ LLNeRF [47], MPRNet $[60]+$ LLNeRF [47], PairLIE [13] $^+$ DP-NeRF [19] and URetinexNet [54] $^+$ DP-NeRF [19] in Fig. 9. ", "page_idx": 14}, {"type": "text", "text": "A.6 Comparison with COLMAP-Free NeRF method ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "COLMAP-free NeRF methods robust to low-light and blur phenomena would be much more helpful for the problem that we propose. However, existing colmap-free NeRF methods may not handle our task easily. The table below compares to a COLMAP-Free NeRF [51]. ", "page_idx": 15}, {"type": "table", "img_path": "CcmHlE6N6u/tmp/3557696b68e06a414134a36e72be4fd51d71d02a1eb75e370c0b2cf74f9d1cce.jpg", "table_caption": [], "table_footnote": ["Table 5: Performance comparison with COLMAP-free NeRF method. "], "page_idx": 15}, {"type": "text", "text": "The results demonstrate that the existing COLMAP-free NeRF method cannot effectively handle low-light scenes with motion blur, due to the inaccurate poses optimized from the image directly. ", "page_idx": 15}, {"type": "text", "text": "A.7 The Generalizability of the GIM ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "The image-matching method used in LuSh-NeRF is GIM [43], which is a state-of-the-art generalizable image-matching model pre-trained with abundant Internet videos. As mentioned in Section 3.2, we also utilize a pre-defined threshold to select those high-confidence matches in the results produced by the GIM, avoiding low-quality matches that may affect the network’s training negatively. ", "page_idx": 15}, {"type": "text", "text": "We show some of the matches obtained by GIM on S-NeRF rendered results in Fig. 8. ", "page_idx": 15}, {"type": "image", "img_path": "CcmHlE6N6u/tmp/26f3b5a16af60def815223f67369b7d621405f96a21c06c966927f50bdbe5a79.jpg", "img_caption": ["Figure 8: The visualization of matching results of GIM [43] on the S-NeRF rendering images. "], "img_footnote": [], "page_idx": 15}, {"type": "text", "text": "A.8 Discussion ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "LuSh-NeRF may have some limitations on certain data, as shown in Fig. 10. Although the noise in low light images is random and fluctuates greatly, if the noise in certain areas maintains similar characteristics in multiple viewpoints, LuSh-NeRF may model it as scene information, resulting in errors in rendering results. Increasing the training image numbers and spanning the range of different views may alleviate this problem to some extent. ", "page_idx": 15}, {"type": "image", "img_path": "CcmHlE6N6u/tmp/58ef8339b83ae73e8897c4e22ebf49e830c0e3dc0c40ef65da4c3e1df772fe24.jpg", "img_caption": ["Figure 9: Qualitative results of different methods on the synthesized datasets. "], "img_footnote": [], "page_idx": 16}, {"type": "image", "img_path": "CcmHlE6N6u/tmp/302ffcd1c316a88875dabf9d6a61a8ecc9c53256d3b20b129c0202cc9adea2f3.jpg", "img_caption": ["Figure 10: A limitation of the proposed LuSh-NeRF. Noise that is relatively similar across views may be difficult to remove due to the reliance on viewpoint consistency. "], "img_footnote": [], "page_idx": 16}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 17}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 17}, {"type": "text", "text": "Justification: We have detailed the main contributions of this paper in the Abstract and Introduction, and summarized them at the end of the Introduction section. ", "page_idx": 17}, {"type": "text", "text": "Guidelines: ", "page_idx": 17}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 17}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 17}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Justification: Please refer to Section 5 and the visulization results in Appendix ", "page_idx": 17}, {"type": "text", "text": "Guidelines: ", "page_idx": 17}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 17}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 17}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 17}, {"type": "text", "text": "Justification: Our work does not include theoretical results. ", "page_idx": 18}, {"type": "text", "text": "Guidelines: ", "page_idx": 18}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 18}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 18}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 18}, {"type": "text", "text": "Justification: We have discussed it in the Subsection 4.2. ", "page_idx": 18}, {"type": "text", "text": "Guidelines: ", "page_idx": 18}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 18}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 18}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Justification: We have provided the project link in the adstract. Guidelines: ", "page_idx": 19}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 19}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 19}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 19}, {"type": "text", "text": "Justification: See Subsection 4.1 and 4.2. ", "page_idx": 19}, {"type": "text", "text": "Guidelines: ", "page_idx": 19}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 19}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 19}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 19}, {"type": "text", "text": "Justification: The paper provides extensive information about the statistical significance of our experiments. ", "page_idx": 19}, {"type": "text", "text": "Guidelines: ", "page_idx": 19}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 19}, {"type": "text", "text": "", "page_idx": 20}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 20}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 20}, {"type": "text", "text": "Justification: See Subsection 4.2. ", "page_idx": 20}, {"type": "text", "text": "Guidelines: ", "page_idx": 20}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 20}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 20}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 20}, {"type": "text", "text": "Justification: We have followed the Ethics Guidelines to conduct our research and prepare our submission. ", "page_idx": 20}, {"type": "text", "text": "Guidelines: ", "page_idx": 20}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 20}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 20}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 20}, {"type": "text", "text": "Justification: See Appendix A.1. ", "page_idx": 20}, {"type": "text", "text": "Guidelines: ", "page_idx": 20}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed.   \n• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 20}, {"type": "text", "text": "", "page_idx": 21}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 21}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 21}, {"type": "text", "text": "Justification: This work does not pose such risks. ", "page_idx": 21}, {"type": "text", "text": "Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 21}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 21}, {"type": "text", "text": "Justification: We have cited the corresponding papers when using their codes, data, and models. ", "page_idx": 21}, {"type": "text", "text": "Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided. ", "page_idx": 21}, {"type": "text", "text": "• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 22}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 22}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 22}, {"type": "text", "text": "Justification: We will provide the documentation along with the new assets in our project page. ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 22}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 22}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 22}, {"type": "text", "text": "Justification: This paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 22}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 22}, {"type": "text", "text": "Answer: [NA] ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Justification: This paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 22}]