{"importance": "This paper is crucial for researchers in computer vision and graphics because it addresses the limitations of current NeRF models in handling low-light and blurry images.  **It introduces a novel approach to reconstruct high-quality NeRFs from hand-held low-light images, overcoming previous limitations and opening new avenues for realistic scene reconstruction in challenging conditions.**  Its new dataset and code also significantly benefit the field.", "summary": "LuSh-NeRF:  A novel model reconstructs sharp, bright NeRFs from hand-held low-light photos by sequentially modeling and removing noise and blur, outperforming existing methods.", "takeaways": ["LuSh-NeRF effectively reconstructs high-quality NeRFs from low-light, blurry images.", "The model uses a novel Scene-Noise Decomposition (SND) and Camera Trajectory Prediction (CTP) module to address coupled degradation factors.", "A new dataset with synthetic and real images was created for training and evaluation, benefiting future research."], "tldr": "Current Neural Radiance Fields (NeRFs) struggle with low-light and motion-blurred images, producing poor novel-view renderings.  Existing solutions either focus on low-light enhancement or deblurring, ignoring the interaction between these factors. Directly combining them often introduces artifacts, hindering accurate 3D scene reconstruction. This significantly limits the use of NeRFs in real-world scenarios where low-light conditions and camera shake are common.\nThe paper introduces LuSh-NeRF, a novel model that tackles these limitations. LuSh-NeRF sequentially models noise and blur via multi-view feature consistency and frequency information, respectively. It includes a Scene-Noise Decomposition (SND) module to separate noise and a Camera Trajectory Prediction (CTP) module for accurate camera motion estimation using low-frequency information.  The results demonstrate that LuSh-NeRF generates significantly improved novel-view images compared to existing methods, demonstrating the effectiveness of its sequential approach. A new dataset is also provided to support future research in this area.", "affiliation": "City University of Hong Kong", "categories": {"main_category": "Computer Vision", "sub_category": "3D Vision"}, "podcast_path": "CcmHlE6N6u/podcast.wav"}