[{"figure_path": "j7sw0nXLjZ/tables/tables_5_1.jpg", "caption": "Table 1: Performance of three distinct ML models with different SSL methods on nine molecular property prediction tasks. For classification tasks, we calculate the ROC-AUC, while for regression tasks, we use RMSE as the evaluation metric. The number in the bracket is the standard deviation of three runs.", "description": "This table presents the performance comparison of three different machine learning models (GIN, GAT, GCN) using various semi-supervised learning (SSL) methods on nine different molecular property prediction tasks from the MoleculeNet dataset.  The table shows the ROC-AUC scores (for classification tasks) and RMSE scores (for regression tasks), along with standard deviations across three runs.  It aims to demonstrate the effectiveness of InstructMol compared to other SSL approaches.", "section": "5.1 Molecular Property Prediction"}, {"figure_path": "j7sw0nXLjZ/tables/tables_5_2.jpg", "caption": "Table 2: In-domain and OOD performance on the GOOD benchmark All numerical results are averages across 3 random runs.", "description": "This table presents the in-domain and out-of-distribution (OOD) generalization performance of various methods on the GOOD benchmark.  The results are averaged over three random runs, showing performance metrics for both in-domain (ID) and OOD data for two different datasets, GOOD-HIV and GOOD-PCBA, and with two different ways of splitting the data (scaffold size).  It demonstrates the ability of the different methods to generalize to unseen data.", "section": "5.2 OOD Generalization"}, {"figure_path": "j7sw0nXLjZ/tables/tables_6_1.jpg", "caption": "Table 1: Performance of three distinct ML models with different SSL methods on nine molecular property prediction tasks. For classification tasks, we calculate the ROC-AUC, while for regression tasks, we use RMSE as the evaluation metric. The number in the bracket is the standard deviation of three runs.", "description": "This table presents the performance comparison of three different machine learning models (GIN, GAT, and GCN) using various semi-supervised learning (SSL) methods on nine molecular property prediction datasets.  It shows the ROC-AUC scores (for classification tasks) and RMSE values (for regression tasks), along with their standard deviations across three independent runs.  The table highlights the improvement achieved by the InstructMol method compared to other SSL techniques.", "section": "5.1 Molecular Property Prediction"}, {"figure_path": "j7sw0nXLjZ/tables/tables_16_1.jpg", "caption": "Table 1: Performance of three distinct ML models with different SSL methods on nine molecular property prediction tasks. For classification tasks, we calculate the ROC-AUC, while for regression tasks, we use RMSE as the evaluation metric. The number in the bracket is the standard deviation of three runs.", "description": "This table presents the performance comparison of three machine learning models (GIN, GAT, and GCN) using different semi-supervised learning (SSL) methods on nine molecular property prediction tasks from the MoleculeNet dataset.  The performance is measured using ROC-AUC for classification tasks and RMSE for regression tasks.  The table shows the effectiveness of InstructMol compared to other SSL techniques and how it affects the performance of each model.", "section": "5.1 Molecular Property Prediction"}, {"figure_path": "j7sw0nXLjZ/tables/tables_17_1.jpg", "caption": "Table 1: Performance of three distinct ML models with different SSL methods on nine molecular property prediction tasks. For classification tasks, we calculate the ROC-AUC, while for regression tasks, we use RMSE as the evaluation metric. The number in the bracket is the standard deviation of three runs.", "description": "This table presents the performance comparison of three different machine learning models (GIN, GAT, GCN) combined with several semi-supervised learning (SSL) methods on nine molecular property prediction tasks from the MoleculeNet dataset.  The results are shown in terms of ROC-AUC (for classification tasks) and RMSE (for regression tasks).  The table highlights the improvement achieved by using the InstructMol method compared to other SSL techniques.", "section": "5.1 Molecular Property Prediction"}, {"figure_path": "j7sw0nXLjZ/tables/tables_17_2.jpg", "caption": "Table 1: Performance of three distinct ML models with different SSL methods on nine molecular property prediction tasks. For classification tasks, we calculate the ROC-AUC, while for regression tasks, we use RMSE as the evaluation metric. The number in the bracket is the standard deviation of three runs.", "description": "This table presents the performance comparison of three different machine learning models (GIN, GAT, and GCN) using various semi-supervised learning (SSL) methods on nine molecular property prediction tasks.  The performance is measured using ROC-AUC for classification tasks and RMSE for regression tasks.  The results show the mean performance across three independent runs, with standard deviations included to show variability.", "section": "5.1 Molecular Property Prediction"}]