[{"figure_path": "WyVTj77KEV/tables/tables_7_1.jpg", "caption": "Table 1: Evaluation of different models on small-molecule-binding protein pocket design. We report the average and standard deviation values across three independent runs. We highlight the best two results with bold text and underlined text, respectively.", "description": "This table compares the performance of PocketFlow against other state-of-the-art methods for designing protein pockets that bind small molecules.  The metrics used to evaluate the models include Amino Acid Recovery (AAR), Self-consistency Root Mean Squared Deviation (scRMSD), and Vina score.  Higher AAR and lower scRMSD and Vina scores indicate better performance.  The table shows that PocketFlow significantly outperforms the baselines across all three metrics.", "section": "5 Experiments"}, {"figure_path": "WyVTj77KEV/tables/tables_8_1.jpg", "caption": "Table 1: Evaluation of different models on small-molecule-binding protein pocket design. We report the average and standard deviation values across three independent runs. We highlight the best two results with bold text and underlined text, respectively.", "description": "This table compares the performance of PocketFlow against several baseline models (DEPACT, dyMEAN, FAIR, and RFDiffusionAA) on two benchmark datasets for small molecule protein pocket generation (CrossDocked and Binding MOAD).  The evaluation metrics include Amino Acid Recovery (AAR), sidechain RMSD (scRMSD), and Vina score.  Higher AAR and lower scRMSD and Vina scores indicate better performance.", "section": "5 Experiments"}, {"figure_path": "WyVTj77KEV/tables/tables_15_1.jpg", "caption": "Table 1: Evaluation of different models on small-molecule-binding protein pocket design. We report the average and standard deviation values across three independent runs. We highlight the best two results with bold text and underlined text, respectively.", "description": "This table presents a comparison of various methods for designing small-molecule-binding protein pockets.  The performance of different models (DEPACT, dyMEAN, FAIR, RFDiffusionAA, and PocketFlow, along with several ablation studies of PocketFlow) is evaluated using three metrics: Amino Acid Recovery (AAR), self-consistency Root Mean Squared Deviation (scRMSD), and Vina score.  Higher AAR indicates better sequence similarity, lower scRMSD indicates better structural similarity to the reference, and lower Vina score indicates higher binding affinity. The table shows average values and standard deviations across three independent runs for each model and metric.  The best performing models for each metric are highlighted.", "section": "5 Experiments"}, {"figure_path": "WyVTj77KEV/tables/tables_22_1.jpg", "caption": "Table 1: Evaluation of different models on small-molecule-binding protein pocket design. We report the average and standard deviation values across three independent runs. We highlight the best two results with bold text and underlined text, respectively.", "description": "This table compares the performance of PocketFlow against other state-of-the-art methods for designing small molecule-binding protein pockets.  The metrics used are Amino Acid Recovery (AAR), sidechain Root Mean Square Deviation (scRMSD), and Vina score. Higher AAR and lower scRMSD and Vina scores indicate better pocket designs.  The table shows that PocketFlow outperforms the baselines across all metrics.", "section": "5 Experiments"}, {"figure_path": "WyVTj77KEV/tables/tables_23_1.jpg", "caption": "Table 6: Ablation studies on the interaction analysis. The best results are bolded and the runner-up is underlined.", "description": "This table presents the results of ablation studies on the interaction analysis of the PocketFlow model.  It shows the average number of steric clashes, hydrogen bonds, salt bridges, hydrophobic interactions, and π-π stacking per protein-ligand complex for different versions of the model.  Each version removes a specific component: Affinity Guidance, Geometry Guidance, both guidance, or inter-learning.  The results demonstrate the contribution of each component to the overall performance of the model. The best-performing versions for each metric are highlighted.", "section": "5. Experiments"}]