{"references": [{"fullname_first_author": "J. Drugowitsch", "paper_title": "The cost of accumulating evidence in perceptual decision making", "publication_date": "2012-01-01", "reason": "This paper is highly relevant due to its focus on the costs of accumulating evidence in decision-making processes, a crucial concept related to the paper's exploration of neural variability and its impact on performance."}, {"fullname_first_author": "D. Campos", "paper_title": "Variability in individual activity bursts improves ant foraging success", "publication_date": "2016-01-01", "reason": "This study directly supports the paper's central argument by showing that variability in individual actions can lead to improved foraging success, highlighting the adaptive value of behavioral variability."}, {"fullname_first_author": "S. Recanatesi", "paper_title": "Metastable attractors explain the variable timing of stable behavioral action sequences", "publication_date": "2022-01-01", "reason": "This neuroscience paper uses metastable attractors to explain the variable timing of actions, directly supporting the paper's investigation of how neural variability can give rise to flexible and adaptive behaviors."}, {"fullname_first_author": "R. Moreno-Bote", "paper_title": "Noise-induced alternations in an attractor network model of perceptual bistability", "publication_date": "2007-01-01", "reason": "This paper is critical for its theoretical framework linking noise-induced alternations in attractor networks to perceptual bistability, providing a direct theoretical foundation for the study of neural variability."}, {"fullname_first_author": "J. Ramírez-Ruiz", "paper_title": "Complex behavior from intrinsic motivation to occupy future action-state path space", "publication_date": "2024-01-01", "reason": "This highly relevant paper introduces the Maximum Occupancy Principle (MOP), a crucial concept that forms the theoretical basis for the neural variability principle proposed in the current work."}]}