[{"figure_path": "pzJjlnMvk5/tables/tables_6_1.jpg", "caption": "Table 1: Quantitative evaluation. We validate the displacements obtained with our method on the Belytschko obstacle course with analytical solutions from [6, 57]. Guo et al. [23] use different material and match the corresponding reference result. Below, we show the ablation. We highlight that our method outperforms prior works and baselines by a large margin.", "description": "This table presents a quantitative comparison of the proposed NeuralClothSim method against existing methods on the Belytschko obstacle course benchmark.  The benchmark involves simulating the deformation of various shapes (square plate, Scordelis-Lo roof, rigid-end cylinder, free-end cylinder) under specific loading conditions. The table shows the displacement results for each method, comparing them to analytical solutions. It also includes ablation studies showing the impact of removing specific components of the NeuralClothSim model (removing periodicity and using GELU activation function).  The results demonstrate that NeuralClothSim achieves significantly better accuracy than previous methods.", "section": "5.1 Obstacle Course"}, {"figure_path": "pzJjlnMvk5/tables/tables_14_1.jpg", "caption": "Table 1: Quantitative evaluation. We validate the displacements obtained with our method on the Belytschko obstacle course with analytical solutions from [6, 57]. Guo et al. [23] use different material and match the corresponding reference result. Below, we show the ablation. We highlight that our method outperforms prior works and baselines by a large margin.", "description": "This table presents a quantitative comparison of the proposed NeuralClothSim method against existing state-of-the-art methods on the Belytschko obstacle course.  The comparison focuses on the accuracy of displacement predictions for various shapes (square plate, Scordelis-Lo roof, rigid-end cylinder, and free-end cylinder).  It shows the error of each method compared to analytical ground truth values, demonstrating a significant performance improvement of NeuralClothSim.  Ablation studies are also included, showing the impact of various components of the method on accuracy.", "section": "5.1 Obstacle Course"}, {"figure_path": "pzJjlnMvk5/tables/tables_29_1.jpg", "caption": "Table 1: Quantitative evaluation. We validate the displacements obtained with our method on the Belytschko obstacle course with analytical solutions from [6, 57]. Guo et al. [23] use different material and match the corresponding reference result. Below, we show the ablation. We highlight that our method outperforms prior works and baselines by a large margin.", "description": "This table presents a quantitative comparison of the proposed NeuralClothSim method against existing state-of-the-art methods on the Belytschko obstacle course.  The obstacle course is a benchmark problem consisting of several test cases with known analytical solutions, allowing for precise evaluation of simulation accuracy.  The table shows the error for each method on four different test cases, demonstrating that NeuralClothSim significantly outperforms prior methods.", "section": "5.1 Obstacle Course"}]