[{"figure_path": "h34jVnPo1c/figures/figures_1_1.jpg", "caption": "Figure 1: (a) The oracle guide curves from a grooming project in Blender [8] for principle hair growing directions. (b) Existing works simply sample guide curves from dense strands regularly on a UV grid of the scalp, which may contain unnecessary signals of high-frequency noise for neighbouring dense strands. (c) We model guide curves by frequency decomposition and k-medoids clustering for optimal sampling a subset of smooth guide hair strands, which are utilized in training our hierarchical hair generation model.", "description": "This figure compares three different approaches to generating guide curves for hair modeling. (a) Shows the ideal result from manual grooming, which is used as a reference for the comparison. (b) Shows the traditional approach of sampling from a regular grid in UV space, which may miss important details or include high-frequency noise. (c) Shows the authors' approach, which uses frequency decomposition and k-medoids clustering to select optimal guide curves.", "section": "2 Extracting the Hierarchy from Strand Hairstyles"}, {"figure_path": "h34jVnPo1c/figures/figures_3_1.jpg", "caption": "Figure 2: Comparing frequency-based smoothing of an exemplar curly strand. Smoothing from the DFT biases towards closed curves and suffers from Gibbs' oscillations [12] for hair strands as open curves. In contrast, The DCT has a strong energy compaction property and more flexible boundary conditions, facilitating encoding open curves with fewer harmonics.", "description": "This figure compares the Discrete Cosine Transform (DCT) and Discrete Fourier Transform (DFT) methods for smoothing an example curly hair strand.  It shows that DFT, which assumes periodic signals, produces artifacts (Gibbs phenomenon) at the ends of the open curve representing a hair strand, while DCT, designed for non-periodic signals, results in a smoother curve.  The DCT uses fewer harmonics to effectively smooth the strand because of its energy compaction property and flexible boundary conditions.", "section": "2.1 Frequency decomposition of strands as open curves"}, {"figure_path": "h34jVnPo1c/figures/figures_4_1.jpg", "caption": "Figure 3: Comparison of guide hair curves extracted by k-medoids (left) and grid-sampling (right) from reference hairstyles (middle), both with an equal count of curves. It is evident that grid-sampling can omit crucial hairstyle details. In contrast, the off-the-grid optimal guide curve subset derived from our k-medoids method more accurately captures the essence and details of the original hairstyle.", "description": "This figure compares guide hair curves generated using two different methods: k-medoids clustering and grid sampling.  The k-medoids method selects a subset of guide curves from a dense set of hair strands that best represents the overall hairstyle.  The grid sampling method simply samples curves from a regular grid on the scalp. The figure shows that the k-medoids method more accurately captures the essential details and characteristics of the hairstyle compared to grid sampling, which can miss important details.", "section": "2 Optimal sampling of coarse guide hair by k-medoids clustering"}, {"figure_path": "h34jVnPo1c/figures/figures_6_1.jpg", "caption": "Figure 4: Generation pipeline overview: (a) During training, a small batch of dense strands and extracted guide curves are sampled from the UV map of the scalp to optimise the networks. (b) Guide curves are generated using a PVCNN VAE that incorporates 2D convolution and PointNet layers. (c) Dense strands are generated by aggregating features from the convolution grid via bilinear sampling and from neighboring guide curves through graph convolution, with the densification module being jointly trained with the guide curve model. (d) High-frequency signals are refined using another dual-branch VAE, conditioned on the global and local latent features derived from the network responsible for generating the low-pass filtered principal strand signal.", "description": "This figure shows the overall architecture of the proposed hierarchical generative model for hair strand generation. It consists of four main stages:\n(a) Extraction of guide curves and sampling of non-guide dense strands: low-pass filtered dense strands are used to generate optimal guide strands via k-medoids clustering. Non-guide dense strands are also sampled for training.\n(b) Generation of guide curves with a dual-branch VAE: a variational autoencoder (VAE) is used to generate the optimal guide curves using PointNet and 2D convolutional layers.\n(c) Densification (jointly trained with (b)): the densification module, jointly trained with the guide curve model, generates dense strands by aggregating features from the convolution grid and neighboring guide curves via graph convolution.\n(d) Generation of high-frequency signals: another dual-branch VAE refines the high-frequency details conditioned on the low-pass filtered principal strand signals.", "section": "3 Learning to Generate Hierarchical Strand Hair"}, {"figure_path": "h34jVnPo1c/figures/figures_8_1.jpg", "caption": "Figure 5: The VAE reconstruction of guide curves, showcasing our method's enhanced performance due to informative guide curves and enriched network representation.", "description": "This figure compares the VAE reconstruction of guide curves using three different methods: (a) Grid-based + strand codec, (b) Grid-based, and (c) Ours.  The ground truth (GT) guide curves and reference hairstyle are also shown in (d) and (e) respectively. The results demonstrate that the proposed method (c) more accurately captures the essence and details of the original hairstyle (e), outperforming the traditional grid-based sampling methods (a) and (b). This improved performance is attributed to the use of more informative guide curves in the proposed method, which better preserve the hairstyle's inherent characteristics.", "section": "2.2 Optimal sampling of coarse guide hair by k-medoids clustering"}, {"figure_path": "h34jVnPo1c/figures/figures_8_2.jpg", "caption": "Figure 6: Euclidean distance between low-pass filtered and original strands.", "description": "This figure compares the Euclidean distance between low-pass filtered strands and their original counterparts, using different frequency decomposition methods (DCT, DCT with derivative, DFT, DFT with derivative).  The x-axis represents the number of harmonics used, while the y-axis shows the Euclidean distance.  The results illustrate that DCT, especially when applied to the derivative of the strand, achieves significantly lower distance compared to DFT methods, highlighting its effectiveness in smoothing open curves like hair strands while preserving essential features.", "section": "2.1 Frequency decomposition of strands as open curves"}, {"figure_path": "h34jVnPo1c/figures/figures_8_3.jpg", "caption": "Figure 7: Dense strands from VAE generated guide curves, with our model yielding natural-looking hair, in contrast to the nearest neighbour baseline which displays artifacts.", "description": "This figure compares the results of three different methods for generating dense hair strands from a set of generated guide curves.  The first image shows the generated guide curves. The second image displays the dense hair strands generated by the authors' method, which uses a variational autoencoder (VAE) and demonstrates natural and realistic results. The third image shows the results of a simpler nearest-neighbor upsampling method, which produces noticeably less natural and more artificial-looking results because it lacks the more sophisticated modelling of the authors' approach.", "section": "3.2 Densification"}, {"figure_path": "h34jVnPo1c/figures/figures_9_1.jpg", "caption": "Figure 4: Generation pipeline overview: (a) During training, a small batch of dense strands and extracted guide curves are sampled from the UV map of the scalp to optimise the networks. (b) Guide curves are generated using a PVCNN VAE that incorporates 2D convolution and PointNet layers. (c) Dense strands are generated by aggregating features from the convolution grid via bilinear sampling and from neighboring guide curves through graph convolution, with the densification module being jointly trained with the guide curve model. (d) High-frequency signals are refined using another dual-branch VAE, conditioned on the global and local latent features derived from the network responsible for generating the low-pass filtered principal strand signal.", "description": "This figure illustrates the overall pipeline of the proposed hierarchical hair generation model. It shows the process in four stages: (a) Data sampling for training, (b) Generation of guide curves using a PVCNN VAE, (c) Generation of dense strands using a combination of convolutional and graph convolutional networks, and (d) Refinement of high-frequency details using another dual-branch VAE.", "section": "3 Learning to Generate Hierarchical Strand Hair"}, {"figure_path": "h34jVnPo1c/figures/figures_9_2.jpg", "caption": "Figure 9: Strand-based hairstyles generated using our approach.", "description": "This figure showcases various hairstyles generated using the proposed doubly hierarchical generative model for strand-based hair.  The model successfully creates diverse hairstyles with realistic and nuanced high-frequency details, demonstrating its ability to generate a wide range of styles.", "section": "Experiments"}, {"figure_path": "h34jVnPo1c/figures/figures_14_1.jpg", "caption": "Figure 3: Comparison of guide hair curves extracted by k-medoids (left) and grid-sampling (right) from reference hairstyles (middle), both with an equal count of curves. It is evident that grid-sampling can omit crucial hairstyle details. In contrast, the off-the-grid optimal guide curve subset derived from our k-medoids method more accurately captures the essence and details of the original hairstyle.", "description": "This figure compares two methods for extracting guide hair curves from dense hair strands: k-medoids clustering and grid sampling.  The k-medoids method selects a subset of guide curves that best represent the overall hairstyle, while grid sampling uniformly samples curves from the scalp UV map. The figure demonstrates that k-medoids preserves more important details than the grid sampling method.", "section": "2.2 Optimal sampling of coarse guide hair by k-medoids clustering"}, {"figure_path": "h34jVnPo1c/figures/figures_17_1.jpg", "caption": "Figure 1: (a) The oracle guide curves from a grooming project in Blender [8] for principle hair growing directions. (b) Existing works simply sample guide curves from dense strands regularly on a UV grid of the scalp, which may contain unnecessary signals of high-frequency noise for neighbouring dense strands. (c) We model guide curves by frequency decomposition and k-medoids clustering for optimal sampling a subset of smooth guide hair strands, which are utilized in training our hierarchical hair generation model.", "description": "This figure compares three different methods for obtaining guide curves for hair generation. (a) shows oracle guide strands from artist grooming, representing the ideal. (b) demonstrates the typical approach of sampling guide curves from a scalp UV grid, which can lead to noisy and suboptimal results. (c) presents the authors' proposed method of using frequency decomposition and k-medoids clustering to select optimal guide strands, which better captures the hairstyle's characteristics.", "section": "1 Introduction"}]