[{"figure_path": "bEunGps83o/tables/tables_23_1.jpg", "caption": "Table 1: Difference in seller utility relative to unconstrained optimal allocation with standard errors for T = 2", "description": "This table presents the difference in seller utility between the optimal fair allocation and the unconstrained optimal allocation for different fairness constraints (α1, α2) when the number of rounds is 2.  The values are the mean differences, and standard errors are shown in parentheses.", "section": "5 Experiments"}, {"figure_path": "bEunGps83o/tables/tables_23_2.jpg", "caption": "Table 2: Difference in group 1 utility relative to unconstrained optimal allocation with standard errors for T = 2", "description": "This table shows the difference in group 1's utility between the optimal fair allocation and the unconstrained optimal allocation for different combinations of fairness constraints (α1, α2) for two groups of buyers over two rounds (T=2).  The values represent the mean difference in utility and the numbers in parentheses are the standard errors.  A positive value indicates that the fair allocation provides higher utility to group 1 than the unconstrained allocation, while a negative value indicates lower utility.", "section": "5 Experiments"}, {"figure_path": "bEunGps83o/tables/tables_23_3.jpg", "caption": "Table 3: Difference in group 2 utility relative to unconstrained optimal allocation with standard errors for T = 2", "description": "This table displays the difference in group 2's utility between the optimal fair allocation and the unconstrained optimal allocation for different fairness constraints (α1, α2).  The values are calculated for T=2 rounds, with standard errors included to indicate statistical significance.", "section": "5 Experiments"}, {"figure_path": "bEunGps83o/tables/tables_24_1.jpg", "caption": "Table 4: Difference in seller utility relative to unconstrained optimal allocation with standard errors for T = 4", "description": "This table shows the difference in seller utility between the optimal fair allocation and the unconstrained optimal allocation for different fairness constraints (α1, α2) when the number of rounds is T=4.  The values represent the mean difference, and standard errors are provided in parentheses.", "section": "5 Experiments"}, {"figure_path": "bEunGps83o/tables/tables_24_2.jpg", "caption": "Table 5: Difference in group 1 utility relative to unconstrained optimal allocation with standard errors for T = 4", "description": "This table presents the difference in group 1's utility between the optimal fair allocation and the unconstrained optimal allocation for different fairness constraint levels (α1, α2). The results are obtained over 10,000 iterations with a discount factor (δ) of 0.99 and T = 4 rounds.  The standard errors are included to show the statistical significance of the results. The table shows how the utility changes with different fairness requirements for each group.", "section": "5 Experiments"}, {"figure_path": "bEunGps83o/tables/tables_24_3.jpg", "caption": "Table 6: Difference in group 2 utility relative to unconstrained optimal allocation with standard errors for T = 4", "description": "This table presents the difference in utility for group 2 between the optimal fair allocation and the unconstrained optimal allocation for different values of fairness constraints (α1 and α2) when T=4. The standard errors are also provided, indicating the variability in the estimates.  The table shows the impact of fairness constraints on the utility of one group, while considering the utility of the other group and the seller.", "section": "5 Experiments"}]