[{"figure_path": "8vCs5U9Hbt/tables/tables_3_1.jpg", "caption": "Table 1: Results on NYUv2 (3 tasks). The upper and lower tables categorize baseline methods into gradient-oriented and loss-oriented types, respectively. Each experiment is repeated over 3 random seeds, and the mean is reported. The best average result is marked in bold. MR and Am% are the main metrics for overall MTL performance. Metrics with↓ denote that the lower the better.", "description": "This table presents the results of the experiments conducted on the NYUv2 dataset, which involves three tasks.  It compares various multi-task learning methods, categorized as gradient-oriented and loss-oriented.  The table shows performance metrics (mIoU, PixAcc, AbsErr, RelErr, AngleDist, Mean, Median, Within t°, MR, Am%) for each method, averaged over three random seed runs to ensure reliability. The best performing method for each metric is highlighted in bold.  MR and Am% are key metrics summarizing overall multi-task learning performance; lower values are better for the metrics denoted by ↓.", "section": "5.1 Comparisons on MTL Benchmarks"}, {"figure_path": "8vCs5U9Hbt/tables/tables_6_1.jpg", "caption": "Table 1: Results on NYUv2 (3 tasks). The upper and lower tables categorize baseline methods into gradient-oriented and loss-oriented types, respectively. Each experiment is repeated over 3 random seeds, and the mean is reported. The best average result is marked in bold. MR and Am% are the main metrics for overall MTL performance. Metrics with↓ denote that the lower the better.", "description": "This table presents the results of the proposed GO4Align method and several baseline methods on the NYUv2 dataset.  It compares gradient-oriented and loss-oriented multi-task optimization methods across three tasks: segmentation, depth, and surface normal.  Metrics include mIoU, pixel accuracy, absolute and relative error for depth, angle distance and within-t for surface normal, mean rank (MR), and average performance drop (Am%). Lower values are better for error metrics, and lower values for MR and Am% indicate better overall multi-task learning performance.", "section": "5.1 Comparisons on MTL Benchmarks"}, {"figure_path": "8vCs5U9Hbt/tables/tables_7_1.jpg", "caption": "Table 1: Results on NYUv2 (3 tasks). The upper and lower tables categorize baseline methods into gradient-oriented and loss-oriented types, respectively. Each experiment is repeated over 3 random seeds, and the mean is reported. The best average result is marked in bold. MR and Am% are the main metrics for overall MTL performance. Metrics with↓ denote that the lower the better.", "description": "This table presents the performance comparison of various multi-task learning methods on the NYUv2 dataset, which consists of three tasks: segmentation, depth, and surface normal.  The methods are categorized into gradient-oriented and loss-oriented approaches.  The table reports several metrics (mIoU, PixAcc, AbsErr, RelErr, AngleDist, Mean, Median, Within t°, MR, Am%) to evaluate the performance of each method, with lower values generally indicating better performance. The best-performing method for each metric is highlighted in bold.", "section": "5.1 Comparisons on MTL Benchmarks"}, {"figure_path": "8vCs5U9Hbt/tables/tables_7_2.jpg", "caption": "Table 1: Results on NYUv2 (3 tasks). The upper and lower tables categorize baseline methods into gradient-oriented and loss-oriented types, respectively. Each experiment is repeated over 3 random seeds, and the mean is reported. The best average result is marked in bold. MR and Am% are the main metrics for overall MTL performance. Metrics with↓ denote that the lower the better.", "description": "This table presents the results of the NYUv2 experiment with 3 tasks.  It compares various multi-task optimization (MTO) methods, categorized as gradient-oriented and loss-oriented. The table shows performance metrics (mIoU, PixAcc, AbsErr, RelErr, AngleDist, Mean, Median, Within t°, MR, and Am%) for each method, averaged over three random seeds. Lower values are better for most metrics.  The best average performance across all metrics is highlighted in bold.", "section": "5.1 Comparisons on MTL Benchmarks"}, {"figure_path": "8vCs5U9Hbt/tables/tables_8_1.jpg", "caption": "Table 4: Comparisons of existing MTO methods with the proposed AGRM on NYUv2.", "description": "This table presents the ablation study results comparing different multi-task optimization (MTO) methods with and without the adaptive group risk minimization (AGRM) principle proposed in the paper.  It shows the performance improvement achieved by integrating AGRM with existing MTO methods on the NYUv2 dataset. The metrics seg.%, depth%, and normal% represent the average performance drop relative to single-task learning (STL) for the segmentation, depth, and normal tasks, respectively. Am% represents the overall average performance drop across all three tasks.  The results demonstrate that AGRM consistently improves performance.", "section": "5.2 Ablation Study"}, {"figure_path": "8vCs5U9Hbt/tables/tables_9_1.jpg", "caption": "Table 1: Results on NYUv2 (3 tasks). The upper and lower tables categorize baseline methods into gradient-oriented and loss-oriented types, respectively. Each experiment is repeated over 3 random seeds, and the mean is reported. The best average result is marked in bold. MR and Am% are the main metrics for overall MTL performance. Metrics with↓ denote that the lower the better.", "description": "This table presents the results of the proposed GO4Align method and several baseline methods on the NYUv2 dataset, which involves three tasks.  The table is split into two sections: gradient-oriented and loss-oriented methods.  For each method, various metrics are reported, including mIoU, Pixel Accuracy, Absolute Error, Relative Error, Angle Distance, Mean, Median, Within t°, MR, and Am%.  The best average result for each metric is highlighted in bold.  Lower values are generally preferred for the metrics that include the symbol ↓.", "section": "5.1 Comparisons on MTL Benchmarks"}, {"figure_path": "8vCs5U9Hbt/tables/tables_14_1.jpg", "caption": "Table 1: Results on NYUv2 (3 tasks). The upper and lower tables categorize baseline methods into gradient-oriented and loss-oriented types, respectively. Each experiment is repeated over 3 random seeds, and the mean is reported. The best average result is marked in bold. MR and Am% are the main metrics for overall MTL performance. Metrics with↓ denote that the lower the better.", "description": "This table presents the results of the experiments conducted on the NYUv2 dataset, which involves three tasks.  It compares various multi-task learning (MTL) methods, categorized into gradient-oriented and loss-oriented approaches.  The table shows multiple evaluation metrics, including mean Intersection over Union (mIoU), pixel accuracy, absolute and relative error, angle distance, and the mean rank (MR) and average performance drop (Am%). Lower values are better for most metrics. The best-performing method for each metric is highlighted in bold.", "section": "5.1 Comparisons on MTL Benchmarks"}, {"figure_path": "8vCs5U9Hbt/tables/tables_15_1.jpg", "caption": "Table 1: Results on NYUv2 (3 tasks). The upper and lower tables categorize baseline methods into gradient-oriented and loss-oriented types, respectively. Each experiment is repeated over 3 random seeds, and the mean is reported. The best average result is marked in bold. MR and Am% are the main metrics for overall MTL performance. Metrics with↓ denote that the lower the better.", "description": "This table presents the results of the proposed GO4Align method and several baseline methods on the NYUv2 dataset.  It compares the performance of gradient-oriented and loss-oriented multi-task optimization methods across three tasks (segmentation, depth, and surface normal). The metrics used to evaluate performance include mean Intersection over Union (mIoU), pixel accuracy (Pix Acc), absolute error (Abs Err), relative error (Rel Err), angle distance (Angle Dist), and two overall multi-task learning (MTL) metrics: mean rank (MR) and average performance drop (Am%). Lower values are generally better for most metrics. The best-performing method for each metric is highlighted in bold.", "section": "5.1 Comparisons on MTL Benchmarks"}, {"figure_path": "8vCs5U9Hbt/tables/tables_15_2.jpg", "caption": "Table 1: Results on NYUv2 (3 tasks). The upper and lower tables categorize baseline methods into gradient-oriented and loss-oriented types, respectively. Each experiment is repeated over 3 random seeds, and the mean is reported. The best average result is marked in bold. MR and Am% are the main metrics for overall MTL performance. Metrics with ↓ denote that the lower the better.", "description": "This table presents the results of the proposed GO4Align method and various baseline methods on the NYUv2 dataset, which involves three tasks: segmentation, depth prediction, and surface normal prediction.  The table is split into two parts: one for gradient-oriented methods and one for loss-oriented methods. Each method's performance is evaluated using several metrics (mIoU, Pix Acc, Abs Err, Rel Err, Angle Dist, Within t°, MR, Am%), with lower values indicating better performance for most metrics. The best average results for each metric are highlighted in bold.", "section": "5.1 Comparisons on MTL Benchmarks"}, {"figure_path": "8vCs5U9Hbt/tables/tables_16_1.jpg", "caption": "Table 1: Results on NYUv2 (3 tasks). The upper and lower tables categorize baseline methods into gradient-oriented and loss-oriented types, respectively. Each experiment is repeated over 3 random seeds, and the mean is reported. The best average result is marked in bold. MR and Am% are the main metrics for overall MTL performance. Metrics with↓ denote that the lower the better.", "description": "This table presents the results of the proposed GO4Align method and various baseline methods on the NYUv2 dataset, which involves three tasks: image segmentation, depth prediction, and surface normal prediction.  The table categorizes baseline methods into gradient-oriented and loss-oriented approaches.  For each method, it shows multiple metrics such as mIoU, pixel accuracy, absolute error, relative error, and angle distance.  The best average result for each metric is highlighted in bold. Finally, the table also shows two main metrics, MR (average rank) and Am% (average relative performance drop), to assess the overall performance of multi-task learning, with lower values indicating better performance.  The table shows GO4Align outperforms other methods.", "section": "5.1 Comparisons on MTL Benchmarks"}]