[{"figure_path": "dWwin2uGYE/figures/figures_1_1.jpg", "caption": "Figure 1: Examples of common structures that yield improvements in density estimation. As indicated by the path example on the left, which is also a tree, the worst-case resilience of any tree is r = O(log d), but for bounded-depth trees, r = O(1).", "description": "This figure shows three different graph structures (path, tree, and grid) commonly found in real-world data.  Each graph represents a different type of structured data: sequential (path), hierarchical (tree), and spatial (grid).  The figure highlights how the *graph resilience* (a novel quantity introduced in the paper) differs for each structure and how this resilience impacts the sample complexity of density estimation.  Lower resilience leads to lower sample complexity and a mitigation of the curse of dimensionality. The path graph has a resilience of O(log d), the tree graph has a resilience of O(1), and the grid graph has a resilience of o(d).", "section": "1 Introduction"}, {"figure_path": "dWwin2uGYE/figures/figures_2_1.jpg", "caption": "Figure 2: Heatmaps of the magnitude of the correlation between red pixel and every other pixel, using the CIFAR-10 training set. The left image shows the correlation without conditioning, the right image shows correlation conditioned on the green pixels. We see that the modeling the image as a Markov random grid is valid.", "description": "The figure shows two heatmaps illustrating the correlation between a red pixel and all other pixels in an image from the CIFAR-10 dataset. The left heatmap displays the correlation without any conditioning, while the right heatmap shows the correlation conditioned on a set of green pixels.  The comparison highlights how conditioning on neighboring pixels significantly reduces the correlation with distant pixels, supporting the validity of modeling images as Markov random grids.", "section": "3 Main Results"}, {"figure_path": "dWwin2uGYE/figures/figures_14_1.jpg", "caption": "Figure 5: Comparison of L3×3 (left) and L3×3 (right).", "description": "This figure shows two different graph structures, L3x3 and L3x3, which represent a 3x3 grid graph and its power graph, respectively.  The power graph L3x3 includes edges connecting vertices that are at most a distance of 1 away from each other in the original L3x3 grid. This demonstrates how the concept of a power graph, used in the context of graph resilience, can create significant differences in connectivity and complexity that directly affect the speed of density estimation.", "section": "4 Graph Resilience Examples"}, {"figure_path": "dWwin2uGYE/figures/figures_24_1.jpg", "caption": "Figure 5: Comparison of L3×3 (left) and L3×3 (right).", "description": "This figure compares two grid graphs: L3x3 which is a 3x3 grid where each node connects to its horizontal and vertical neighbors and L3x3 which is the power graph of L3x3 with power 1. In L3x3, each node also connects to its diagonal neighbors.", "section": "4 Graph Resilience Examples"}]