[{"figure_path": "R4IBZrSF5d/figures/figures_1_1.jpg", "caption": "Figure 1: Illustration of the active confocal NLOS imaging with an irregular relay surface. Yellow points indicate scannable points, while blue points indicate non-scannable points.", "description": "The figure illustrates an active confocal NLOS (non-line-of-sight) imaging system with an irregular relay surface.  A laser and detector are focused on a relay surface, pulses emitted by the laser reflect off the surface to illuminate a hidden scene. The detector captures photons bouncing back from the scene towards the relay surface, as transients.  The yellow points on the relay surface indicate scannable points used to collect the transient data. Blue points indicate unscannable areas on the irregular surface.  An example of undersampled transient data is also displayed (left).", "section": "1 Introduction"}, {"figure_path": "R4IBZrSF5d/figures/figures_3_1.jpg", "caption": "Figure 2: The pipeline of our unsupervised framework: (a) The SURE-based denoiser, which consists of an encoder-decoder network designed for IUT and is trained by minimizing SURE loss in the first stage; (b) The virtual scanning reconstruction network (VSRnet), which consists of a Unet-like network and is trained by MC loss and VS loss in the second stage; (c) Relay surfaces used for training (yellow indicates scanning areas, and their corresponding 3D binary masks are used in implementation); (d) The virtual scanning process, which involves virtually observing p(1) with a relay surface Mk that is distinct from Mỹ and enforcing consistency between p(1) and p(2).", "description": "This figure illustrates the pipeline of the unsupervised framework proposed in the paper.  It shows the SURE-based denoiser (a), which is a pre-processing step to reduce noise in the input. The virtual scanning reconstruction network (VSRNet) is the main component (b), which reconstructs the 3D albedo volume. Relay surfaces used for training are shown in (c), highlighting the irregular nature of the surfaces and how scanning points are selected. The virtual scanning process (d) is a key part of the proposed method, creating virtual scans to improve reconstruction by accounting for the null space (areas of the image that cannot be directly observed).", "section": "4 Method"}, {"figure_path": "R4IBZrSF5d/figures/figures_4_1.jpg", "caption": "Figure 3: Toy visualization of NLOS reconstruction from the perspective of range-null space decomposition (RNSD). (a) illustrates the RNSD of p observed by H1. (b) illustrates that p cannot be accurately recovered with only the measurement consistency loss. (c) shows that the proposed virtual scanning promotes the acquisition of null-space components.", "description": "This figure uses a toy example to illustrate the concept of range-null space decomposition in non-line-of-sight (NLOS) reconstruction and how the proposed virtual scanning method enhances the reconstruction by recovering null-space components.  (a) shows the decomposition of the true albedo volume (ρ) into range-space (Dr(ρ)) and null-space (Dn(ρ)) components using the first observation operator (H1). (b) demonstrates that using only the measurement consistency loss, the reconstruction may not accurately capture the true albedo due to the ambiguity in the null space. (c) shows that by introducing a virtual scanning process, the network can learn from both range and null spaces, leading to a more accurate reconstruction.", "section": "3.2 Motivation"}, {"figure_path": "R4IBZrSF5d/figures/figures_6_1.jpg", "caption": "Figure 4: Reconstruction results of the \"bunny\" with different relay surfaces. The intensity images are normalized to the range of 0 to 1 through maximum value normalization. PSNR (dB) for each intensity image is displayed in the top right corner.", "description": "This figure compares the reconstruction results of the \"bunny\" model using different NLOS methods under various irregularly undersampled relay surfaces.  The results demonstrate the effectiveness of the proposed method in recovering geometric structures and achieving the highest PSNR (Peak Signal-to-Noise Ratio) values among compared methods.", "section": "5.2 Results"}, {"figure_path": "R4IBZrSF5d/figures/figures_7_1.jpg", "caption": "Figure 5: Reconstruction results of publicly available real-world dataset [10–12] with different relay surfaces.", "description": "This figure displays the reconstruction results of several different methods on publicly available real-world datasets using various irregular relay surfaces. Each row represents a different dataset with different relay surface patterns. The columns represent different reconstruction methods, including LCT, FK, RSD, NeTF, USM, CC-SOCR, and the proposed method in the paper. The ground truth images of each scene are shown in the last column, offering a visual comparison of the performance of each algorithm.", "section": "5.2 Results"}, {"figure_path": "R4IBZrSF5d/figures/figures_8_1.jpg", "caption": "Figure 4: Reconstruction results of the \"bunny\" with different relay surfaces. The intensity images are normalized to the range of 0 to 1 through maximum value normalization. PSNR (dB) for each intensity image is displayed in the top right corner.", "description": "This figure compares the reconstruction results of different methods on a \"bunny\" shaped object, using various irregularly sampled relay surfaces.  The intensity of each reconstruction is normalized.  PSNR (Peak Signal-to-Noise Ratio) values are provided for quantitative comparison of each method's reconstruction quality against the ground truth image.", "section": "5.2 Results"}, {"figure_path": "R4IBZrSF5d/figures/figures_9_1.jpg", "caption": "Figure 7: Ablation studies on the virtual scanning process (VS) (a) and the SURE-based denoiser (b).", "description": "This figure presents ablation studies comparing the performance of the proposed method with and without the virtual scanning process and the SURE-based denoiser.  Subfigure (a) shows reconstructions using two different relay surfaces (Window 6 and Window 4) comparing the proposed method (Ours) with and without virtual scanning (VS).  It demonstrates that the virtual scanning process significantly improves reconstruction quality. Subfigure (b) shows reconstructions using the same relay surfaces, comparing the proposed method (Ours) with and without the SURE-based denoiser.  This subfigure highlights the impact of the denoiser in improving the robustness of the method to noise.", "section": "4 Method"}, {"figure_path": "R4IBZrSF5d/figures/figures_13_1.jpg", "caption": "Figure 8: Overview of our P-Unet with 3D partial convolution for denoising irregularly undersampled transients. The spatial resolution of transients features in each layer is depicted below the blocks, and their respective channel counts are presented above the blocks. The resolutions and channels of the sampling matrices are identical to the transients features in the corresponding layer. The numbers on the blue arrows indicate the kernel size of the 3D convolution.", "description": "This figure shows the architecture of the P-Unet network used for denoising irregularly undersampled transients. The network is based on 3D partial convolution, which uses a sampling matrix to differentiate between valid and invalid voxels, effectively capturing spatial information from the transients. The network also includes instance normalization layers, which are insensitive to input distribution, to enhance generalization. The network has an encoder-decoder structure with skip connections, and the kernel sizes of the 3D convolutions are indicated by the blue arrows.", "section": "A Network architecture"}, {"figure_path": "R4IBZrSF5d/figures/figures_14_1.jpg", "caption": "Figure 4: Reconstruction results of the \"bunny\" with different relay surfaces. The intensity images are normalized to the range of 0 to 1 through maximum value normalization. PSNR (dB) for each intensity image is displayed in the top right corner.", "description": "This figure demonstrates the reconstruction results of a \"bunny\" model using different relay surface patterns.  The intensity of each reconstructed image is normalized from 0 to 1 for easier comparison, and the peak signal-to-noise ratio (PSNR) in decibels (dB) is provided as a quantitative evaluation metric for each reconstruction. This shows the impact of the relay surface on the quality of the NLOS reconstruction.", "section": "5.2 Results"}, {"figure_path": "R4IBZrSF5d/figures/figures_16_1.jpg", "caption": "Figure 10: (a) The top view of the NLOS imaging system. The green oval region on the object indicates the area from which the scanning point can capture information. Light with different optical distances is represented by three colors. (b) The first row shows the maximum intensity projections of the transient along the time dimension, with the corresponding sampling rates indicated at the top.", "description": "The figure shows the experimental setup of the NLOS imaging system and reconstruction results with different sampling rates.  (a) is a top view of the setup, illustrating the laser source, detector, relay surface, and the hidden object with different light paths shown. (b) shows the maximum intensity projections of the transient signals and the corresponding reconstructions from the proposed method, highlighting the effect of different sampling rates on reconstruction quality.  The green boxes highlight the improved reconstruction quality using the proposed method in comparison to the direct measurement.", "section": "Discussion"}, {"figure_path": "R4IBZrSF5d/figures/figures_18_1.jpg", "caption": "Figure 5: Reconstruction results of publicly available real-world dataset [10–12] with different relay surfaces.", "description": "This figure presents the reconstruction results from three publicly available real-world datasets ([10-12]) using different methods, including LCT, FK, RSD, NeTF, USM, CC-SOCR, and the proposed method. Each row represents a different relay surface pattern, allowing for a comparison of the methods' performance under various scenarios. The ground truth images are provided for reference. The results show that the proposed method achieves superior reconstruction quality compared to other methods across diverse relay surface patterns.", "section": "5.2 Results"}, {"figure_path": "R4IBZrSF5d/figures/figures_19_1.jpg", "caption": "Figure 5: Reconstruction results of publicly available real-world dataset [10-12] with different relay surfaces.", "description": "This figure shows the reconstruction results of several real-world datasets ([10-12]) using different irregular relay surface patterns.  Each row represents a different dataset and relay surface pattern, comparing different NLOS reconstruction methods (LCT, FK, RSD, NeTF, USM, CC-SOCR, and the proposed method). The ground truth images are shown on the far right for comparison. This figure demonstrates the performance of each method across various real-world scenarios with irregularly sampled data.", "section": "5.2 Results"}]