[{"figure_path": "R4IBZrSF5d/tables/tables_8_1.jpg", "caption": "Table 1: Inference time of various methods. The values in the table represent the average inference time across 16 IUT with size of 128 × 128 × 256.", "description": "This table compares the inference time of different NLOS reconstruction methods (LCT, FK, RSD, NeTF, USM, CC-SOCR, and the proposed method) using both CPU and GPU.  The inference time is averaged across 16 irregularly undersampled transients (IUT) with a size of 128x128x256.  The results demonstrate that the proposed method achieves significantly faster inference time compared to other methods, particularly CC-SOCR which requires significantly longer time.", "section": "5.3 Inference time"}, {"figure_path": "R4IBZrSF5d/tables/tables_17_1.jpg", "caption": "Table 3: Effect of the hyperparameters ɛ on the denoising performance in terms of PSNR (mean value and variance).", "description": "This table shows the results of an ablation study on the hyperparameter epsilon (ɛ) used in the SURE-based denoiser.  Different values of ɛ were tested, and the resulting Peak Signal-to-Noise Ratio (PSNR) and its variance are reported.  The PSNR measures the quality of the denoised images, with higher values indicating better denoising performance. The variance indicates the consistency of the results for each value of ɛ.", "section": "F.1 Ablation study on hyperparameters"}, {"figure_path": "R4IBZrSF5d/tables/tables_17_2.jpg", "caption": "Table 4: Effect of the hyperparameters β on the reconstruction performance in terms of PSNR (mean value and variance).", "description": "This table shows the results of an ablation study on the hyperparameter β, which controls the balance between the measurement consistency loss and the virtual scanning loss in the proposed unsupervised NLOS imaging framework.  The PSNR (Peak Signal-to-Noise Ratio) is used to measure the quality of the 3D albedo volume reconstruction.  Different values of β were tested, and the table shows the mean PSNR and its variance for each value. The optimal value of β is determined based on maximizing PSNR.", "section": "5.4 Ablation study"}, {"figure_path": "R4IBZrSF5d/tables/tables_17_3.jpg", "caption": "Table 5: Effect of the intervals of relay surfaces for training on the reconstruction performance in terms of PSNR (mean value and variance).", "description": "This table presents the results of an ablation study on the impact of varying the intervals of relay surfaces used during training on the performance of the proposed NLOS imaging method. The performance metric used is the Peak Signal-to-Noise Ratio (PSNR), calculated as the average and standard deviation across multiple trials. The table shows that using a wider range of intervals ([4, 8, 12, 16, 20]) during training leads to better reconstruction performance (higher average PSNR) compared to using smaller or fewer intervals.", "section": "5.4 Ablation study"}, {"figure_path": "R4IBZrSF5d/tables/tables_18_1.jpg", "caption": "Table 6: Effect of the rotations of relay surfaces for training on the reconstruction performance in terms of PSNR (mean value and variance).", "description": "This table shows the results of an ablation study on the impact of the number of rotations of relay surfaces during training on the reconstruction performance, measured by PSNR.  The study varied the number of rotations (10, 20, 30, 40, 50, 60) and measured the mean and variance of the PSNR for each rotation condition. The results indicate an optimal number of rotations around 40, beyond which the performance starts to decrease.", "section": "5.4 Ablation study"}]