[{"figure_path": "gKMTM1i8Ew/tables/tables_12_1.jpg", "caption": "Table 1: Notation", "description": "This table lists the notations used throughout the paper.  It includes symbols for the number of arms and fidelities, risk parameters, stopping times and costs, the optimal arm, the algorithm's recommendation, bandit models, means and precisions of observations, fidelity costs, sets of bandit models satisfying multi-fidelity constraints, Kullback-Leibler divergence, variance, and other key mathematical expressions and quantities used in the analysis. ", "section": "2 Background"}, {"figure_path": "gKMTM1i8Ew/tables/tables_30_1.jpg", "caption": "Table 2: Multi-fidelity bandit model presented in Figure 1.", "description": "This table presents the parameter values for a 4x5 multi-fidelity bandit problem used in the paper's experiments.  It shows the mean reward (μ) for each of the four arms (μ₁, μ₂, μ₃, μ₄) at each of the five fidelities (m = 1, 2, 3, 4, 5).  The table also includes the maximum bias (ξ) and cost (λ) associated with each fidelity level. This data is used to test and compare the performance of different multi-fidelity best-arm identification algorithms.", "section": "D.1 Further details on the experiments presented in Section 5"}, {"figure_path": "gKMTM1i8Ew/tables/tables_31_1.jpg", "caption": "Table 3: Multi-fidelity bandit model presented in Figure 2.", "description": "This table presents the parameters of a 5 × 2 multi-fidelity bandit problem used in the paper's numerical experiments.  It shows the mean reward (μ) for each of the 5 arms at each of the 2 fidelities (m=1, m=2).  The maximal bias (ξ) and the cost (λ) associated with each fidelity are also listed. This specific bandit problem is designed to highlight the benefits of the proposed MF-GRAD algorithm by showcasing a situation where some fidelities are sub-optimal for specific arms. The authors use this example to illustrate how their algorithm outperforms existing approaches by dynamically allocating resources and exploiting the concept of optimal fidelity.", "section": "D.1 Further details on the experiments presented in Section 5"}, {"figure_path": "gKMTM1i8Ew/tables/tables_32_1.jpg", "caption": "Table 4: Additional random multi-fidelity bandit model.", "description": "This table presents the parameters for an additional 4x5 multi-fidelity bandit model used in the experiments.  It shows the mean reward (μ) for each arm at each fidelity (m), the precision (ξ) of each fidelity, and the cost (λ) associated with each fidelity.  This model was generated using a random process similar to the one in the paper's Appendix D.1,  and was used to further validate the performance of the proposed MF-GRAD algorithm compared to existing approaches.", "section": "D.3 Results on additional domains"}, {"figure_path": "gKMTM1i8Ew/tables/tables_32_2.jpg", "caption": "Table 5: Additional multi-fidelity bandit model.", "description": "This table presents the parameters for an additional 4x5 multi-fidelity bandit model used in the experiments.  It shows the mean reward (μ) for each of the four arms at each of the five fidelities (m=1 to 5), the precision (ξ) at each fidelity, and the cost (λ) associated with each fidelity.  This model is different from the model shown in Table 2 and is used to assess the algorithm's performance on a wider range of problem instances. The means are set so that means of arms are slightly increasing over fidelities, creating a more stationary trend over fidelity than previous models.", "section": "D.3 Results on additional domains"}]