[{"figure_path": "u7okTt4ZyE/tables/tables_6_1.jpg", "caption": "Table 1: Quantitative comparison with state-of-the-art methods on both synthetic and real-world benchmarks, as well as comparison of latency and number of model parameters. NFE represents the number of function evaluations in the inference of diffusion models. The best and second best results of each metric are highlighted in red and blue, respectively.", "description": "This table presents a quantitative comparison of DoSSR against other state-of-the-art super-resolution models on various metrics, including PSNR, SSIM, LPIPS, and others.  It shows performance on both synthetic and real-world datasets and includes comparisons of inference latency and model size.  The best and second-best results are highlighted.", "section": "4.2 Comparisons with State-of-the-Arts"}, {"figure_path": "u7okTt4ZyE/tables/tables_8_1.jpg", "caption": "Table 1: Quantitative comparison with state-of-the-art methods on both synthetic and real-world benchmarks, as well as comparison of latency and number of model parameters. NFE represents the number of function evaluations in the inference of diffusion models. The best and second best results of each metric are highlighted in red and blue, respectively.", "description": "This table presents a quantitative comparison of the proposed DoSSR model with several state-of-the-art image super-resolution methods.  Performance is evaluated using various metrics (PSNR, SSIM, LPIPS, CLIPIQA, MUSIQ, MANIQA, TOPIQ) on both synthetic and real-world datasets.  The table also includes a comparison of the latency and number of parameters for each model, providing insights into efficiency and resource requirements.  NFE, or Number of Function Evaluations, is included for diffusion models to indicate sampling efficiency.", "section": "4.2 Comparisons with State-of-the-Arts"}, {"figure_path": "u7okTt4ZyE/tables/tables_9_1.jpg", "caption": "Table 1: Quantitative comparison with state-of-the-art methods on both synthetic and real-world benchmarks, as well as comparison of latency and number of model parameters. NFE represents the number of function evaluations in the inference of diffusion models. The best and second best results of each metric are highlighted in red and blue, respectively.", "description": "This table presents a quantitative comparison of DoSSR against other state-of-the-art super-resolution models.  Metrics include PSNR, SSIM, LPIPS, CLIPIQA, MUSIQ, MANIQA, and TOPIQ, evaluated on DIV2K-Val, RealSR, and DRealSR datasets.  The table also compares the latency and number of model parameters for each method, highlighting DoSSR's efficiency.", "section": "4.2 Comparisons with State-of-the-Arts"}, {"figure_path": "u7okTt4ZyE/tables/tables_22_1.jpg", "caption": "Table 1: Quantitative comparison with state-of-the-art methods on both synthetic and real-world benchmarks, as well as comparison of latency and number of model parameters. NFE represents the number of function evaluations in the inference of diffusion models. The best and second best results of each metric are highlighted in red and blue, respectively.", "description": "This table presents a quantitative comparison of the proposed DoSSR model with several state-of-the-art image super-resolution (SR) models on both synthetic and real-world datasets.  Metrics such as PSNR, SSIM, LPIPS, CLIPIQA, MUSIQ, MANIQA, and TOPIQ are used to evaluate the performance.  The table also includes the latency, the number of parameters, and number of function evaluations (NFE) for each model, providing a comprehensive comparison of efficiency and effectiveness.", "section": "4.2 Comparisons with State-of-the-Arts"}, {"figure_path": "u7okTt4ZyE/tables/tables_22_2.jpg", "caption": "Table 1: Quantitative comparison with state-of-the-art methods on both synthetic and real-world benchmarks, as well as comparison of latency and number of model parameters. NFE represents the number of function evaluations in the inference of diffusion models. The best and second best results of each metric are highlighted in red and blue, respectively.", "description": "This table presents a quantitative comparison of the proposed DoSSR model with other state-of-the-art image super-resolution methods on both synthetic and real-world datasets.  Metrics include PSNR, SSIM, LPIPS, CLIPIQA, MUSIQ, MANIQA, and TOPIQ.  The table also compares the latency and number of model parameters for each method, highlighting the efficiency of DoSSR.  NFE (Number of Function Evaluations) reflects the number of sampling steps used in the inference process, demonstrating DoSSR's efficiency with only 5 steps.", "section": "4.2 Comparisons with State-of-the-Arts"}, {"figure_path": "u7okTt4ZyE/tables/tables_23_1.jpg", "caption": "Table 1: Quantitative comparison with state-of-the-art methods on both synthetic and real-world benchmarks, as well as comparison of latency and number of model parameters. NFE represents the number of function evaluations in the inference of diffusion models. The best and second best results of each metric are highlighted in red and blue, respectively.", "description": "This table presents a quantitative comparison of DoSSR with other state-of-the-art image super-resolution models.  The comparison includes metrics such as PSNR, SSIM, LPIPS, CLIPIQA, MUSIQ, MANIQA, and TOPIQ on several benchmark datasets.  Latency and model parameters are also compared to highlight the efficiency gains of DoSSR.  The table uses red and blue highlighting to indicate the best and second-best performance for each metric.", "section": "4.2 Comparisons with State-of-the-Arts"}]