{"references": [{"fullname_first_author": "Jonas Belouadi", "paper_title": "AutomaTikZ: Text-guided synthesis of scientific vector graphics with TikZ", "publication_date": "2024-00-00", "reason": "This paper introduces AutomaTikZ, a model similar to DETIKZIFY, which synthesizes TikZ programs from text descriptions, providing a relevant comparison and showing the state-of-the-art in code generation for scientific figures."}, {"fullname_first_author": "Lucas Beyer", "paper_title": "PaliGemma: A versatile 3b VLM for transfer", "publication_date": "2024-07-26", "reason": "The PaLI-3 vision-language model used as the vision encoder in DETIKZIFY is described here, showcasing the model's effectiveness in text-rich image understanding, a crucial component for DETIKZIFY's functionality."}, {"fullname_first_author": "David Brandfonbrener", "paper_title": "Verified multi-step synthesis using large language models and Monte Carlo tree search", "publication_date": "2024-00-00", "reason": "This paper details the Monte Carlo Tree Search (MCTS) algorithm used in DETIKZIFY, providing a theoretical foundation for the iterative refinement strategy and demonstrating its applicability to complex problem solving using LLMs."}, {"fullname_first_author": "Sébastien Bubeck", "paper_title": "Sparks of artificial general intelligence: Early experiments with GPT-4", "publication_date": "2023-03-12", "reason": "This paper analyzes GPT-4, highlighting its ability to perform code generation in various languages, establishing GPT-4 as a strong baseline for DETIKZIFY's performance evaluation and showing the potential of general-purpose LLMs."}, {"fullname_first_author": "Jun Chen", "paper_title": "MiniGPT-v2: Large language model as a unified interface for vision-language multi-task learning", "publication_date": "2023-10-09", "reason": "The MiniGPT-v2 model architecture is used as a language model in DETIKZIFY. This paper illustrates the effectiveness of LLMs in various vision-language tasks and their potential for generating high-quality graphics programs."}]}