[{"figure_path": "QLRO8o4bol/figures/figures_1_1.jpg", "caption": "Figure 1: (Left) A decline in the Attack Success Rate (ASR) can be observed when conventional UAPs are applied to the FSL scenario. The yellow bar represents performance in traditional scenarios, while the other three indicate performance in different FSL training paradigms. For the metric-based paradigm, traditional methods even fail to generate UAPs. The detailed setting can be found in Section 4.1 (Right). Solid arrows represent the pre-training phase, while dotted arrows depict the testing phase. The attacker can only manipulate the pre-trained model, which suffers from the semantic shift of different datasets and the task shift from base to novel tasks.", "description": "This figure shows the decrease in attack success rate (ASR) when using traditional universal adversarial perturbations (UAPs) in few-shot learning (FSL) scenarios compared to traditional settings. The left panel shows that the ASR is significantly lower in FSL scenarios across different training paradigms (finetuning, metric, and meta). The right panel illustrates the process, highlighting the challenges of task shift (different tasks during training and testing) and semantic shift (different datasets for base and novel tasks). The attacker only has access to the pre-trained model, limiting the effectiveness of UAPs in FSL.", "section": "4 A Closer Look at UAP Generation in Few-Shot Learning"}, {"figure_path": "QLRO8o4bol/figures/figures_2_1.jpg", "caption": "Figure 2: Comparison of different scenarios. In contrast to traditional settings, the FSL framework introduces two distinct challenges: the task shift from pre-training to testing, and the semantic shift from the base to the novel dataset. Attackers must overcome the two shifts to mount successful attacks in the FSL scenario.", "description": "This figure compares the process of generating universal adversarial perturbations (UAPs) in traditional settings versus few-shot learning (FSL) settings.  In traditional settings, the same classifier is used for training and testing, making UAP generation straightforward. However, FSL introduces two key challenges: 1) Task Shift: the pre-trained model is tested on different tasks than those it was trained on, and 2) Semantic Shift: the training and testing data come from different distributions (base vs. novel datasets). The figure illustrates how these shifts hinder the transferability of UAPs generated using traditional methods.", "section": "4 A Closer Look at UAP Generation in Few-Shot Learning"}, {"figure_path": "QLRO8o4bol/figures/figures_3_1.jpg", "caption": "Figure 3: The ASRs under different task shifts and semantic shifts. In (b), Cifar, Mini, Tiered are different datasets detailed in Section 6.1.", "description": "This figure shows the results of applying the traditional UAP generation method to different few-shot learning scenarios.  The left panel (a) shows how the attack success rate (ASR) changes when varying the number of ways (different classification tasks) and shots (number of training examples per class) for the downstream tasks.  As the tasks become more diverse (higher number of ways) or there are fewer training examples (fewer shots), the ASR decreases. The right panel (b) demonstrates how changing the datasets used for the novel classes also impacts the ASR.  Different datasets are used (CIFAR, Mini, Tiered), and it shows that the ASR is highest when the novel dataset is similar to the proxy dataset used for generating UAPs.", "section": "4 A Closer Look at UAP Generation in Few-Shot Learning"}, {"figure_path": "QLRO8o4bol/figures/figures_3_2.jpg", "caption": "Figure 3: The ASRs under different task shifts and semantic shifts. In (b), Cifar, Mini, Tiered are different datasets detailed in Section 6.1.", "description": "This figure shows the impact of task and semantic shift on the attack success rate (ASR) in few-shot learning scenarios.  The left panel (a) demonstrates how ASR decreases as the complexity of the downstream task increases (number of ways and shots). The right panel (b) shows how the ASR is affected by the choice of dataset: using a different dataset as the proxy dataset or the novel dataset negatively impacts performance, highlighting the impact of semantic shift.", "section": "4 A Closer Look at UAP Generation in Few-Shot Learning"}, {"figure_path": "QLRO8o4bol/figures/figures_4_1.jpg", "caption": "Figure 4: (a) The Base Classifier is the pre-trained classifier. Proxy Linear and Proxy Protos are newly designed to address the task shift and the semantic shift, as detailed in Section 5. (b) The detailed Attack Success Rate(ASR) of different methods on 5-way 1-shot and 5-way 5-shot tasks. TS, SS represents whether the Task Shift and the Semantic Shift are handled respectively.", "description": "This figure illustrates the proposed attacking framework and its performance.  Panel (a) shows the framework's components: a pre-trained classifier, proxy linear classifier (for task alignment), and prototype-based classifier (for semantic alignment). The attacker generates universal adversarial perturbations (UAPs) that are added to input images before passing them through the encoder and the classifiers. The framework addresses task and semantic shifts prevalent in few-shot learning. Panel (b) presents a table showing the attack success rate (ASR) for different methods (baseline, addressing only task shift, addressing both shifts) and for different few-shot tasks (5-way 1-shot and 5-way 5-shot).", "section": "5 Method"}, {"figure_path": "QLRO8o4bol/figures/figures_4_2.jpg", "caption": "Figure 4: (a) The Base Classifier is the pre-trained classifier. Proxy Linear and Proxy Protos are newly designed to address the task shift and the semantic shift, as detailed in Section 5. (b) The detailed Attack Success Rate(ASR) of different methods on 5-way 1-shot and 5-way 5-shot tasks. TS, SS represents whether the Task Shift and the Semantic Shift are handled respectively.", "description": "This figure shows the proposed Few-Shot Attacking FrameWork (FSAFW) for generating universal adversarial perturbations (UAPs) in few-shot learning (FSL). (a) illustrates the framework, starting with a pre-trained base classifier and progressively incorporating methods to address task shift (Proxy Linear, Proxy Protos) and semantic shift. (b) presents the attack success rates (ASR) of different methods on 5-way 1-shot and 5-way 5-shot tasks, highlighting the improvement achieved by FSAFW in handling both shifts.", "section": "5 Method"}, {"figure_path": "QLRO8o4bol/figures/figures_6_1.jpg", "caption": "Figure 5: (a) A qualitative illustration showing the effect of the supervisory signal. (b) The attack performance comparison of different fooling losses.", "description": "Figure 5(a) shows how the supervisory signal influences the distribution of features generated by the encoder.  Without supervision (top), the distribution shifts, impacting the attack's transferability. With supervision (bottom), the distribution shift is mitigated, improving transferability. Figure 5(b) compares the Attack Success Rate (ASR) using different loss functions (equations 7, 8, and 9) for evaluating the UAP performance, showing that equation 9 achieves the highest ASR.", "section": "5.3 Fill Up the Semantic Shift by Leveraging the Encoder's Generalizability"}, {"figure_path": "QLRO8o4bol/figures/figures_9_1.jpg", "caption": "Figure 3: The ASRs under different task shifts and semantic shifts. In (b), Cifar, Mini, Tiered are different datasets detailed in Section 6.1.", "description": "This figure shows the impact of task and semantic shifts on the attack success rate (ASR) in few-shot learning (FSL).  The left panel (a) illustrates how ASR varies with the number of ways (different downstream tasks) and number of shots, showing a decrease in performance as the task becomes less similar to the pre-training task. The right panel (b) demonstrates the influence of the semantic shift by changing the datasets used in the attack, showing that ASR falls as the dissimilarity between the base, novel, and proxy datasets increases.  This highlights the challenges of applying traditional universal adversarial perturbations (UAPs) directly to the FSL setting.", "section": "4 A Closer Look at UAP Generation in Few-Shot Learning"}, {"figure_path": "QLRO8o4bol/figures/figures_16_1.jpg", "caption": "Figure 7: Samples of CIFAR-FS.", "description": "This figure shows some example images from the CIFAR-FS dataset.  CIFAR-FS is a subset of the CIFAR-100 dataset, commonly used in few-shot learning research. The images depict a variety of objects and scenes, demonstrating the diversity within the dataset and showcasing the visual complexity of the classification tasks involved in few-shot learning.", "section": "6.1 Implementation Details"}, {"figure_path": "QLRO8o4bol/figures/figures_16_2.jpg", "caption": "Figure 2: Comparison of different scenarios. In contrast to traditional settings, the FSL framework introduces two distinct challenges: the task shift from pre-training to testing, and the semantic shift from the base to the novel dataset. Attackers must overcome the two shifts to mount successful attacks in the FSL scenario.", "description": "This figure compares the traditional adversarial attack and the few-shot learning (FSL) attack. The traditional attack uses a pre-trained encoder and classifier on the base dataset to generate a universal adversarial perturbation (UAP). This UAP is then applied to the test-time attack on the same base dataset. In FSL, however, the task shift (pre-training to testing) and semantic shift (base to novel dataset) pose challenges. The attacker in FSL uses a pre-trained encoder but needs to overcome these shifts to generate an effective UAP.", "section": "4 A Closer Look at UAP Generation in Few-Shot Learning"}, {"figure_path": "QLRO8o4bol/figures/figures_17_1.jpg", "caption": "Figure 1: (Left) A decline in the Attack Success Rate (ASR) can be observed when conventional UAPs are applied to the FSL scenario. The yellow bar represents performance in traditional scenarios, while the other three indicate performance in different FSL training paradigms. For the metric-based paradigm, traditional methods even fail to generate UAPs. The detailed setting can be found in Section 4.1 (Right). Solid arrows represent the pre-training phase, while dotted arrows depict the testing phase. The attacker can only manipulate the pre-trained model, which suffers from the semantic shift of different datasets and the task shift from base to novel tasks.", "description": "This figure shows a comparison of attack success rates (ASR) for traditional universal adversarial perturbations (UAPs) versus UAPs applied to few-shot learning (FSL) scenarios.  The left panel illustrates the significant drop in ASR when using traditional UAPs in various FSL settings compared to traditional close-set scenarios.  The right panel provides a schematic illustrating the challenges posed by FSL for UAP generation, namely the task shift and semantic shift between pre-training and testing phases.  The task shift involves different downstream tasks, while the semantic shift involves different datasets.", "section": "4 A Closer Look at UAP Generation in Few-Shot Learning"}]