[{"figure_path": "QLRO8o4bol/tables/tables_7_1.jpg", "caption": "Table 1: 5-way 1-shot ASR results of our framework in different FSL victim models.", "description": "This table presents the Attack Success Rate (ASR) achieved by the proposed Few-Shot Attacking Framework (FSAFW) on various Few-Shot Learning (FSL) victim models.  The ASR is a measure of the effectiveness of the universal adversarial perturbations (UAPs) generated by FSAFW in fooling the different FSL models.  The table is broken down by victim model (Baseline, Baseline++, ANIL-1, R2D2-1, ProtoNet, DN4), proxy dataset (Cifar, Mini, Tiered), and backbone architecture (ResNet12, ResNet18).  The results showcase the performance improvement of FSAFW over existing baselines across different FSL models and training paradigms.", "section": "6 Experiments"}, {"figure_path": "QLRO8o4bol/tables/tables_7_2.jpg", "caption": "Table 2: 5-way 5-shot ASR results of our framework in different FSL victim models.", "description": "This table presents the Attack Success Rate (ASR) achieved by the proposed Few-Shot Attacking Framework (FSAFW) across various victim models in a 5-way 5-shot few-shot learning (FSL) setting.  Different FSL training paradigms (finetuning-based, meta-based, and metric-based) are represented by the victim models (Baseline, Baseline++, ANIL-1, R2D2-1, ProtoNet, DN4).  Results are shown for different backbone architectures (ResNet12 and ResNet18) and proxy datasets (Cifar, Mini, Tiered). The table demonstrates the effectiveness and generalizability of FSAFW across various FSL settings.", "section": "6 Experiments"}, {"figure_path": "QLRO8o4bol/tables/tables_8_1.jpg", "caption": "Table 3: Comparison of different attack methods on ASR for 5-way 1-shot tasks.", "description": "This table compares the attack success rate (ASR) of different universal adversarial perturbation (UAP) generation methods on 5-way 1-shot few-shot learning (FSL) tasks.  It shows the ASR achieved by several methods including UAN, GAP, AdvEncoder, and the proposed FSAFW, across different victim models (ANIL-1, R2D2-1, ProtoNet, DN4) and datasets (Mini, Tiered).  The results highlight the improvement in ASR achieved by the FSAFW approach.", "section": "6.2 Results"}, {"figure_path": "QLRO8o4bol/tables/tables_8_2.jpg", "caption": "Table 3: Comparison of different attack methods on ASR for 5-way 1-shot tasks.", "description": "This table compares the attack success rate (ASR) of different attack methods on 5-way 1-shot tasks.  The methods include UAN, GAP, AdvEncoder, and the proposed FSAFW.  The victim models are ANIL-1, R2D2-1, ProtoNet, and DN4, trained on Mini and Tiered datasets.  The table shows the performance of each method across different victim models and datasets, demonstrating the effectiveness of FSAFW in comparison to other methods.", "section": "6.2 Results"}, {"figure_path": "QLRO8o4bol/tables/tables_9_1.jpg", "caption": "Table 5: Comparison of different contrastive losses on ASR.", "description": "This table presents the results of an ablation study comparing the performance of different contrastive loss functions on the Attack Success Rate (ASR) for both 5-way 1-shot and 5-way 5-shot tasks. The goal was to determine the effectiveness of these losses in generating generalizable UAPs (Universal Adversarial Perturbations) for few-shot learning scenarios.", "section": "6.3 Ablation Study"}, {"figure_path": "QLRO8o4bol/tables/tables_14_1.jpg", "caption": "Table 6: 5-way 1-shot ASR results of our framework in different FSL victim models.", "description": "This table presents the Attack Success Rate (ASR) achieved by the proposed Few-Shot Attacking Framework (FSAFW) on various Few-Shot Learning (FSL) victim models.  Different FSL training paradigms (ANIL, R2D2, ProtoNet, DN4) are tested using various backbone architectures (ResNet12, ResNet18). The table shows the ASR for 5-way 1-shot tasks, varying the proxy dataset (Cifar, Mini, Tiered) used for training the attacker's model.  The results demonstrate the framework's effectiveness across different FSL settings and victim models.", "section": "6 Experiments"}, {"figure_path": "QLRO8o4bol/tables/tables_14_2.jpg", "caption": "Table 8: The ASR results compared with the PAP method.", "description": "This table compares the attack success rate (ASR) of the proposed method (Ours) against the PAP method.  It shows ASR for both 1-shot and 5-shot scenarios, across four different proxy datasets (Cifar, CUB, Omniglot, GTSRB), and three different victim models (Baseline, ANIL-1, ProtoNet-1).  The results highlight the superior performance of the proposed method, particularly when the proxy dataset differs from the victim dataset.", "section": "6.2 Results"}, {"figure_path": "QLRO8o4bol/tables/tables_15_1.jpg", "caption": "Table 9: 5-way 1-shot ASR results of cross domain datasets.", "description": "This table shows the Attack Success Rate (ASR) for 5-way 1-shot tasks using different methods (UAN, GAP, AdvEncoder, and Ours) across various cross-domain datasets.  The proxy and downstream datasets vary, allowing for an assessment of the method's generalizability across different data distributions.  The 'Ours' method refers to the proposed Few-Shot Attacking FrameWork (FSAFW).", "section": "6.2 Results"}, {"figure_path": "QLRO8o4bol/tables/tables_16_1.jpg", "caption": "Table 3: Comparison of different attack methods on ASR for 5-way 1-shot tasks.", "description": "This table compares the attack success rate (ASR) of different attack methods on 5-way 1-shot tasks using various victim models (ANIL-1, R2D2-1, ProtoNet, DN4) and proxy datasets (CUB, Omniglot, GTSRB).  It shows the effectiveness of the proposed Few-Shot Attacking Framework (FSAFW) compared to other state-of-the-art methods (UAN, GAP, AdvEncoder). The table highlights the improved ASR achieved by FSAFW across different victim models and datasets.", "section": "6.2 Results"}]