[{"figure_path": "QiCJomIW3l/figures/figures_1_1.jpg", "caption": "Figure 1: Left: Active NLOS Imaging Setup. Right: Dynamic NLOS Imaging.", "description": "This figure illustrates the setup for active non-line-of-sight (NLOS) imaging. On the left, a schematic shows the components involved in capturing indirect light reflections from a hidden object via a relay wall, including a pulsed laser, galvo mirrors for scanning, a SPAD detector, and a TCSPC system for timing measurements. The right side shows a series of transient frames representing the dynamic scenes captured by the system. This represents the data that the algorithm will analyze in order to reconstruct the 3D hidden scene.", "section": "1 Introduction"}, {"figure_path": "QiCJomIW3l/figures/figures_3_1.jpg", "caption": "Figure 2: (a) Top: Intensity images of a synthetic sequence. Bottom: Transient slices (x-y) of the transient frames. (b) and (c) presents the capture setup and our self-built imaging system.", "description": "This figure shows three aspects of the experimental setup used in the paper. (a) presents example images from a synthetic dataset, showing intensity images and corresponding transient slices in x-y plane of the transient frames; (b) shows the physical setup for capturing the data, including the arrangement of the laser, mirrors, and camera; (c) provides a detailed view of the custom-built imaging system used, including all the major components such as the laser, SPAD detector, TCSPC, and DAQ.", "section": "3.2 Datasets"}, {"figure_path": "QiCJomIW3l/figures/figures_4_1.jpg", "caption": "Figure 3: The pipeline of our proposed method. Given three frames of the transient measurements, the target hidden volume, intensity image and depth map, of the reference frame are reconstructed.", "description": "This figure illustrates the pipeline of the proposed dynamic NLOS reconstruction method. It takes three consecutive transient frames as input.  The interleaved extraction module first processes these frames. Then, the spatial-temporal Mamba (ST-Mamba) and cross ST-Mamba modules integrate information across frames to improve the quality of the target frame.  The transient spreading module increases the spatial resolution of the target transient frame. Finally, the feature extraction, feature transformation, and refinement modules reconstruct the hidden volume, intensity image and depth map of the target frame.", "section": "4 Method"}, {"figure_path": "QiCJomIW3l/figures/figures_5_1.jpg", "caption": "Figure 4: The overview of the proposed ST-Mamba (a) and cross ST-Mamba (b).", "description": "This figure shows the architecture of the proposed ST-Mamba and cross ST-Mamba modules.  The ST-Mamba module (a) takes input features (Fin) and processes them through a series of layers including normalization (Norm), multi-layer perceptrons (MLP), convolution (CONV), temporal and spatial state space models (SSM), and activation functions to produce output features (Ft).  The cross ST-Mamba module (b) takes the output features (Ft) from ST-Mamba and adjacent frame features (Ft+1) as input. These are processed through the same layers (Norm, MLP, CONV, Temporal SSM, Spatial SSM, and Activation), and then combined to create aligned features (Fa).  Both modules aim to leverage temporal and spatial relationships between transient frames to improve dynamic NLOS reconstruction.", "section": "4.2 Spatial-Temporal Mamba"}, {"figure_path": "QiCJomIW3l/figures/figures_7_1.jpg", "caption": "Figure 5: Qualitative results of two synthetic sequences. The symbol '#' denotes the frame. The input spatial resolution is 16×16, and the output spatial resolution is 128×128.", "description": "This figure shows a qualitative comparison of different methods for dynamic NLOS imaging on two synthetic sequences. Each sequence contains multiple frames, represented by the '#' symbol.  The input to each method had a spatial resolution of 16x16 pixels, while the output resolution was upscaled to 128x128 pixels. The figure allows for a visual comparison of the reconstruction quality achieved by various techniques, including LCT, RSD, FK, LFE, I-K, CSA, USM, Ours-S (single frame version of the proposed method), and Ours (the proposed method). The ground truth images are also provided for reference (GT).", "section": "5.2 Synthetic Results"}, {"figure_path": "QiCJomIW3l/figures/figures_8_1.jpg", "caption": "Figure 6: Reconstructed results from real-world measurements captured by our imaging system. The spatial scanning grid is 16×16, and the output spatial resolution of the hidden volume is 128×128.", "description": "This figure shows the results of applying the proposed dynamic NLOS reconstruction method to real-world data.  The top row displays reconstruction results for simple planar objects in rigid motion, while the bottom row shows results for a scene with non-rigid motion (a person moving their arms).  The input measurements used a 16x16 spatial scanning grid, and the method reconstructed a hidden volume with a resolution of 128x128 pixels. The results are compared against several baseline methods.", "section": "5.3 Real-world Results"}, {"figure_path": "QiCJomIW3l/figures/figures_12_1.jpg", "caption": "Figure 7: The reconstruction results via the traditional method (RSD) for the high-resolution transient measurements, which are recovered by the SR networks of USM and Ours.", "description": "This figure compares the performance of the proposed method's super-resolution (SR) module against USM's SR module.  Both methods' SR modules are used to generate high-resolution transient measurements, which are then input into a traditional reconstruction method (RSD). The top two rows show the results using USM-SR+RSD and Ours-SR+RSD respectively, while the bottom row shows the ground truth (GT). The comparison highlights the superior quality of the proposed method's SR module in generating clearer and more detailed high-resolution transient measurements suitable for improved reconstruction.", "section": "A.2 Comparison of the SR module separately with USM [4]"}, {"figure_path": "QiCJomIW3l/figures/figures_13_1.jpg", "caption": "Figure 6: Reconstructed results from real-world measurements captured by our imaging system. The spatial scanning grid is 16×16, and the output spatial resolution of the hidden volume is 128×128.", "description": "This figure shows the results of reconstructing real-world scenes using the proposed method.  The top row displays the results for a scene with letter \"U\" shaped objects. The bottom row shows the results for a scene with letter \"T\" shaped objects. Each column shows results from different methods, including the proposed method (Ours), a single-frame version of the proposed method (Ours-S), and several baselines (LCT, RSD, FK, LFE, I-K, CSA, USM). The ground truth is shown in the last column. The input spatial resolution is 16x16, while the output resolution is 128x128.", "section": "5.2 Synthetic Results"}, {"figure_path": "QiCJomIW3l/figures/figures_13_2.jpg", "caption": "Figure 6: Reconstructed results from real-world measurements captured by our imaging system. The spatial scanning grid is 16x16, and the output spatial resolution of the hidden volume is 128x128.", "description": "This figure shows the results of reconstructing hidden objects from real-world data captured by the authors' non-line-of-sight (NLOS) imaging system.  The input data consists of transient measurements from a 16x16 spatial scanning grid, which is then upsampled to a 128x128 resolution for the final reconstruction. The figure compares the results from several different methods, including the proposed method and several baselines. It demonstrates the ability of the proposed method to reconstruct high-quality images even from sparsely sampled real-world data.", "section": "5. Experiments"}]