[{"figure_path": "Hgqs1b4ECy/figures/figures_2_1.jpg", "caption": "Figure 1: The overview of our method. We learn the data-driven based prior by learning a neural implicit function f' with a condition c' on a clean dataset. During inference, we employ a novel statistical reasoning algorithm to infer a neural SDF f for a noisy point cloud M with learned prior (average code and learned parameter).", "description": "This figure illustrates the proposed method's two-stage process: (1) training a data-driven prior using a clean dataset to learn a neural implicit function, and (2) inference on a noisy point cloud, where the learned prior is fine-tuned using a novel statistical reasoning algorithm to infer a neural SDF without needing signed distance supervision, clean points, or point normals.  The diagram shows the flow of data and the key components, including KNN, local queries, local denoising, and marching cubes for surface reconstruction.", "section": "3 Method"}, {"figure_path": "Hgqs1b4ECy/figures/figures_4_1.jpg", "caption": "Figure 16: Comparison in surface reconstruction on ShapeNet.", "description": "This figure displays a comparison of surface reconstruction results on the ShapeNet dataset.  It shows the results of several methods, including the proposed method, alongside the ground truth. Each row represents a different shape, and the columns compare the reconstruction quality from different techniques. The noisy input is shown as the teal colored point cloud for each shape.  The goal is to visualize how well each method handles noisy input data when attempting to reconstruct the underlying surface of a shape.", "section": "4.1 Surface Reconstruction for Shapes"}, {"figure_path": "Hgqs1b4ECy/figures/figures_5_1.jpg", "caption": "Figure 17: Comparison in surface reconstruction on ABC.", "description": "This figure compares the surface reconstruction results of different methods on the ABC dataset.  The input is a noisy point cloud. The methods compared include IMLS, P2S, NeuralPull, and the proposed method (Ours). The ground truth (GT) surface is also shown for comparison.  The visualization highlights the effectiveness of the proposed method in recovering detailed geometric features from noisy point cloud data, showcasing superior surface reconstruction quality compared to the baselines.", "section": "4.1 Surface Reconstruction for Shapes"}, {"figure_path": "Hgqs1b4ECy/figures/figures_5_2.jpg", "caption": "Figure 18: Comparison in surface reconstruction on SRB.", "description": "This figure compares the surface reconstruction results of several methods (Input Point2Mesh, PSR, SIREN, GridPull, ALTO, N2NM, Ours) with the ground truth (GT) on the SRB (Surface Reconstruction Benchmark) dataset.  Each row shows the reconstructions for a different shape in the dataset, illustrating the relative performance of each method in terms of detail, accuracy, and noise reduction.", "section": "4.1 Surface Reconstruction for Shapes"}, {"figure_path": "Hgqs1b4ECy/figures/figures_5_3.jpg", "caption": "Figure 19: Comparison in surface reconstruction on FAMOUS.", "description": "The figure compares the surface reconstruction results of different methods (Input, IMLS, NeuralPull, OnSurf, GridPull, N2NM, Ours, GT) on the FAMOUS dataset.  Each row represents a different shape, showcasing the reconstruction capabilities of each method in terms of surface detail, smoothness, and overall accuracy.  The \"Input\" column displays the noisy point cloud used as input for each reconstruction.  The \"GT\" column shows the ground truth model. The other columns show the reconstructed surfaces from the different methods being compared.", "section": "4.1 Surface Reconstruction for Shapes"}, {"figure_path": "Hgqs1b4ECy/figures/figures_6_1.jpg", "caption": "Figure 20: Comparison in surface reconstruction on D-FAUST.", "description": "This figure compares the surface reconstruction results of several methods on the D-FAUST dataset.  The D-FAUST dataset contains scans of humans in various poses. The figure shows that the proposed method (Ours) produces more accurate and complete reconstructions of the human shapes compared to other methods (IGR, Point2Mesh, SAP, N2NM). The input column shows the noisy point cloud data used for reconstruction. The GT column displays the ground truth surface for comparison.", "section": "4.1 Surface Reconstruction for Shapes"}, {"figure_path": "Hgqs1b4ECy/figures/figures_6_2.jpg", "caption": "Figure 7: Comparison in surface reconstruction on 3D Scene.", "description": "This figure compares the surface reconstruction results of several methods (ConvOcc, DeepLS, GridPull, N2NM, Ours) with the ground truth (GT) on the 3D Scene dataset.  Each row shows the reconstruction of a different scene. The figure visually demonstrates the ability of the proposed method to produce more accurate and detailed surface reconstructions compared to other state-of-the-art methods, especially in handling noisy point clouds.", "section": "4.2 Surface Reconstruction for Scenes"}, {"figure_path": "Hgqs1b4ECy/figures/figures_8_1.jpg", "caption": "Figure 7: Comparison in surface reconstruction on 3D Scene.", "description": "The figure shows a comparison of surface reconstruction results on the 3D Scene dataset.  It compares the performance of the proposed method (Ours) against several other state-of-the-art methods, namely ConvOcc, DeepLS, GridPull, and N2NM. The visualization highlights the ability of the proposed method to recover finer details and complete geometry compared to other methods, especially in challenging areas with significant noise or incomplete data. The orange boxes highlight these areas of improved performance.", "section": "4.2 Surface Reconstruction for Scenes"}, {"figure_path": "Hgqs1b4ECy/figures/figures_8_2.jpg", "caption": "Figure 7: Comparison in surface reconstruction on 3D Scene.", "description": "The figure shows a comparison of surface reconstruction results on the 3D Scene dataset using different methods: LIG, N2NM, and the proposed method.  For each method, a 3D reconstruction is displayed, along with zoomed-in details showing the reconstruction quality of specific building sections. Yellow boxes highlight areas that are zoomed in.", "section": "4.2 Surface Reconstruction for Scenes"}, {"figure_path": "Hgqs1b4ECy/figures/figures_8_3.jpg", "caption": "Figure 10: Comparison with different SDF initializations.", "description": "This figure compares the surface reconstruction results obtained using different SDF initializations: random, square, sphere, and the proposed method. The results demonstrate that the proposed method significantly improves surface reconstruction accuracy and completeness compared to other initialization methods.", "section": "4.3 Ablation Studies"}, {"figure_path": "Hgqs1b4ECy/figures/figures_8_4.jpg", "caption": "Figure 11: Visual results with nonuniform noises.", "description": "This figure demonstrates the robustness of the proposed method to non-uniform noise patterns.  It presents visual comparisons of surface reconstruction results for three different types of nonuniform noise: patch noise, half noise, and a ground truth (GT) model. The results showcase that the proposed method handles non-uniform noise effectively, generating accurate surface reconstructions even in challenging scenarios where noise is unevenly distributed across the point cloud.", "section": "4.3 Ablation Studies"}, {"figure_path": "Hgqs1b4ECy/figures/figures_8_5.jpg", "caption": "Figure 12: Visual results with different noise types.", "description": "This figure shows visual comparisons of surface reconstruction results on a chair model using the proposed method under various types of noise, including impulse noise, quantization noise, Laplacian noise, and Gaussian noise. Each row represents a different type of noise. The columns show: the noisy input point cloud, the reconstruction results using four state-of-the-art methods (ConvOcc, POCO, ALTO, N2NM), the reconstruction results using the proposed method, and the ground truth model. The results demonstrate that the proposed method is effective for handling different types of noises and reconstructing accurate surface geometry.", "section": "4.1 Surface Reconstruction for Shapes"}, {"figure_path": "Hgqs1b4ECy/figures/figures_9_1.jpg", "caption": "Figure 13: Visual comparison with different noise levels.", "description": "This figure shows a visual comparison of the surface reconstruction results obtained using the proposed method on a single point cloud with different noise levels. The first row displays the noisy input point clouds, while the second row shows the corresponding reconstructed surfaces generated by the proposed method.  The noise levels increase from left to right, ranging from 0.5% to 7%. The last image shows the ground truth surface. This visualization highlights the robustness of the proposed method in handling various levels of noise, demonstrating its ability to reconstruct accurate surfaces even under challenging conditions.", "section": "4.1 Surface Reconstruction for Shapes"}, {"figure_path": "Hgqs1b4ECy/figures/figures_9_2.jpg", "caption": "Figure 14: Visual comparison with different point numbers.", "description": "This figure shows a visual comparison of surface reconstruction results using different numbers of points in a point cloud. The top row shows the noisy input point clouds with varying densities (10%, 30%, 50%, 70%, 100%), while the bottom row displays the corresponding reconstructed surfaces generated by the proposed method. The last image is the ground truth mesh.", "section": "4.3 Ablation Studies"}, {"figure_path": "Hgqs1b4ECy/figures/figures_9_3.jpg", "caption": "Figure 15: Optimization during inference.", "description": "This figure shows the optimization process of the proposed method. The top row shows the reconstruction of a chair, and the bottom row shows the reconstruction of an armchair. The meshes are reconstructed using the neural SDF f learned in different iterations. The numbers below the images indicate the number of iterations. As the number of iterations increases, the shape is updated progressively to the ground truth shapes.", "section": "3 Method"}, {"figure_path": "Hgqs1b4ECy/figures/figures_16_1.jpg", "caption": "Figure 16: Comparison in surface reconstruction on ShapeNet.", "description": "This figure compares the surface reconstruction results of several methods on the ShapeNet dataset.  The first column shows the noisy input point cloud. Subsequent columns display the reconstructions generated by ConvOcc, POCO, ALTO, N2NM, and the proposed method, respectively. The final column presents the ground truth.  The figure visually demonstrates the superior performance of the proposed method in accurately reconstructing surfaces compared to state-of-the-art techniques, especially in capturing finer details and handling noise.", "section": "4.1 Surface Reconstruction for Shapes"}, {"figure_path": "Hgqs1b4ECy/figures/figures_16_2.jpg", "caption": "Figure 17: Comparison in surface reconstruction on ABC.", "description": "This figure compares the performance of different methods for surface reconstruction on the ABC dataset.  The first column shows the noisy input point cloud. Subsequent columns display the reconstructed surfaces obtained using ConvOcc, IMLS, P2S, NeuralPull, OnSurf, N2NM, the proposed method (Ours), and the ground truth (GT).  Each row represents a different shape from the dataset, demonstrating the methods' ability to recover surface details from noisy point cloud data.", "section": "4.1 Surface Reconstruction for Shapes"}, {"figure_path": "Hgqs1b4ECy/figures/figures_17_1.jpg", "caption": "Figure 18: Comparison in surface reconstruction on SRB.", "description": "This figure compares the surface reconstruction results of different methods on the SRB dataset.  It visually demonstrates the ability of each method to reconstruct 3D shapes from noisy point cloud data.  The input shows the noisy point cloud data, followed by the surface reconstructions from Point2Mesh, PSR, SIREN, GridPull, ALTO, Steik, NKSR, N2NM, and the proposed method, with the ground truth reconstruction shown at the far right for comparison.", "section": "4.1 Surface Reconstruction for Shapes"}, {"figure_path": "Hgqs1b4ECy/figures/figures_17_2.jpg", "caption": "Figure 19: Comparison in surface reconstruction on FAMOUS.", "description": "This figure compares the performance of different methods for surface reconstruction on the FAMOUS dataset. The input is a noisy point cloud. Several methods are compared, including IMLS, NeuralPull, LPI, OnSurf, GridPull, N2NM, and the proposed method. The ground truth is also shown for reference. The figure shows that the proposed method achieves better surface reconstruction results in terms of accuracy and detail compared to the other methods.", "section": "4.1 Surface Reconstruction for Shapes"}, {"figure_path": "Hgqs1b4ECy/figures/figures_18_1.jpg", "caption": "Figure 6: Comparison in surface reconstruction on D-FAUST.", "description": "This figure compares the surface reconstruction results of different methods on the D-FAUST dataset.  The D-FAUST dataset contains scans of humans in various poses.  The input is a noisy point cloud of the human, and the different columns show the results of the IGR, Point2Mesh, SAP, N2NM, the proposed method, and the ground truth (GT).  The figure highlights the ability of the proposed method to accurately reconstruct the fine details and poses of human shapes.", "section": "4.1 Surface Reconstruction for Shapes"}, {"figure_path": "Hgqs1b4ECy/figures/figures_18_2.jpg", "caption": "Figure 21: Comparison in surface reconstruction on nuScenes.", "description": "This figure compares the surface reconstruction results on the nuScenes dataset between the N2NM method and the proposed method.  The image shows that the proposed method produces smoother, more complete surfaces compared to N2NM, particularly in areas with missing data or significant noise.  This demonstrates the advantage of the proposed method in reconstructing surfaces from real-world, noisy point cloud data.", "section": "4.2 Surface Reconstruction for Scenes"}]