[{"figure_path": "zcEPOB9rCR/tables/tables_3_1.jpg", "caption": "Table 1: Comparisons of different candidates for bridging geometric states", "description": "The table compares various approaches for bridging geometric states, highlighting their capabilities in handling symmetry constraints, preserving coupling between initial and target states, and utilizing trajectory guidance. It shows that existing methods like direct prediction and MLFFs each address certain aspects but lack the comprehensive capabilities of the proposed Geometric Diffusion Bridge (GDB).", "section": "3.1 Equivariant Diffusion Bridge"}, {"figure_path": "zcEPOB9rCR/tables/tables_6_1.jpg", "caption": "Table 1: Comparisons of different candidates for bridging geometric states", "description": "This table compares various methods for bridging geometric states, focusing on their ability to satisfy symmetry constraints, preserve coupling between initial and target states, and leverage trajectory guidance. It highlights the advantages of the proposed Geometric Diffusion Bridge (GDB) method over existing approaches.", "section": "3 Background"}, {"figure_path": "zcEPOB9rCR/tables/tables_7_1.jpg", "caption": "Table 3: Results on the QM9 dataset (Å). We report the official results of baselines from [111]", "description": "This table presents a comparison of the performance of various methods on the QM9 dataset for equilibrium state prediction.  The results are measured in Angstroms (Å) and include three metrics: D-MAE (Mean Absolute Error of interatomic distances), D-RMSE (Root Mean Square Error of interatomic distances), and C-RMSD (Root Mean Square Deviation of Cartesian coordinates after rigid alignment). The table shows that the proposed Geometric Diffusion Bridge (GDB) method significantly outperforms other state-of-the-art methods on this benchmark.", "section": "4 Experiments"}, {"figure_path": "zcEPOB9rCR/tables/tables_7_2.jpg", "caption": "Table 4: Results on the Molecule3D dataset (Å). We report the official results of baselines from [111]", "description": "This table presents a comparison of the GDB model's performance against several baselines on the Molecule3D dataset for equilibrium state prediction.  The results are shown using three metrics: D-MAE, D-RMSE, and C-RMSD, for both random and scaffold data splits.  The '*' indicates missing results for a particular baseline and metric combination.", "section": "4 Experiments"}, {"figure_path": "zcEPOB9rCR/tables/tables_8_1.jpg", "caption": "Table 5: Results on the OC22 IS2RS Validation set. \"OC20+OC22\" denotes using both OC20 [13] and OC22 data; \"OC20→OC22\" means pre-training on OC20 data then fine-tuning on OC22 data; \"OC22-only\" means only using OC22 data. We report the official results of baselines from [105]", "description": "This table presents the results of the structure relaxation task on the OC22 IS2RS validation set.  It compares the performance of the proposed Geometric Diffusion Bridge (GDB) method against several state-of-the-art baselines. The table shows the ADWT (Average Distance within Threshold) scores for in-distribution (ID) and out-of-distribution (OOD) data, as well as the average ADWT score across both. Different training setups for the baselines are also shown, indicating whether OC20 data was used in pre-training or fine-tuning. The results demonstrate the superior performance of GDB, especially when trajectory guidance is included.", "section": "4.2 Structure Relaxation"}]