[{"figure_path": "NT8Z5NjwxF/figures/figures_0_1.jpg", "caption": "Figure 1: Binocular reconstruction has higher 3D uncertainty compared to multi-view configurations.", "description": "This figure compares the uncertainty of 3D point reconstruction using binocular and multi-view setups.  The left panel (a) shows a 3D point reconstructed from four views, demonstrating low 3D uncertainty due to multiple observations. The right panel (b) shows a 3D point reconstructed from just two views, resulting in a significantly larger 3D uncertainty range. The increased uncertainty highlights the challenge of binocular 3D human pose estimation where the number of views is limited, compared to multi-view approaches.", "section": "1 Introduciton"}, {"figure_path": "NT8Z5NjwxF/figures/figures_3_1.jpg", "caption": "Figure 2: Overview of Dual-Diffusion Method. (a) Modeling: In the forward diffusion process, noise is added to the ground truth binocular 2D poses uT for T steps, aligning with the distribution of initial estimated 2D poses. During the reverse denoising process, noisy 3D poses are progressively denoised to plausible poses. Geometric mapping is employed to connect 2D and 3D domains. (b) Inference: The initial 3D pose yT, reconstructed from binocular 2D poses uT, is denoised to y0. Then y0 is reprojected to the denoised 2D poses u0. The entire denoising process iterates for K times.", "description": "This figure illustrates the Dual-Diffusion method proposed in the paper.  Panel (a) shows the modeling process:  Noise is added iteratively to the ground truth 2D poses in the forward diffusion.  These noisy 2D poses are then used to estimate noisy 3D poses via triangulation. The reverse denoising process then refines these noisy 3D poses to obtain accurate 3D poses, which are then reprojected back to 2D space for consistency checking. Panel (b) depicts the inference process: Noisy 2D poses are used as input, converted to initial 3D poses, and then refined iteratively through K denoising steps, resulting in refined 3D poses and corresponding 2D poses.", "section": "3 Method"}, {"figure_path": "NT8Z5NjwxF/figures/figures_8_1.jpg", "caption": "Figure 3: Dual-Diff (red) v.s. 2D-Diff (blue) under various T and K = 25.", "description": "This figure shows the comparison of Dual-Diff and 2D-Diff methods under different diffusion steps (T).  The plot displays the Bone Length error (BL) and Symmetry error (Sym) for both methods as T varies.  The results indicate that Dual-Diff consistently outperforms 2D-Diff across all values of T, highlighting the effectiveness of denoising in the 3D domain compared to the 2D domain.", "section": "4.4 Visulization"}, {"figure_path": "NT8Z5NjwxF/figures/figures_9_1.jpg", "caption": "Figure 4: Step-wise errors of binocular 2D joints, (u, v)left and (u, v)right, during the diffusion and denoising processes. The joint analyzed is the right knee.", "description": "This figure visualizes the step-wise errors of binocular 2D joints (u, v) during both the forward diffusion and reverse denoising processes.  The graph shows how the errors of the left and right u and v coordinates of a single joint (right knee) change over time. (a) shows the diffusion process:  noise is incrementally added, increasing the error from the ground truth. (b) shows the denoising process: the denoiser network progressively reduces the noise and error, leading to more accurate pose estimation.", "section": "4.4 Visulization"}, {"figure_path": "NT8Z5NjwxF/figures/figures_9_2.jpg", "caption": "Figure 5: Qualitative Comparison with Triangulation and RSB-Pose in 3D Pose Estimation. 2D poses are estimated by RSB-Pose152*. The gray skeleton is the ground truth, while the black represents the estimates. Red and blue points correspond to joints on the right and left sides, respectively. Yellow arrows indicate parts of significant improvement achieved by our method.", "description": "This figure compares the 3D human pose estimation results of the proposed Dual-Diffusion method against two baseline methods: Triangulation and RSB-Pose.  The results are shown for both the H36M and MHAD datasets.  The gray skeleton represents the ground truth pose, while the black skeletons represent the estimated poses from each method. Red and blue points indicate joints on the right and left sides, respectively. Yellow arrows highlight areas where the Dual-Diffusion method shows significant improvement over the baselines.", "section": "4.4 Visulization"}, {"figure_path": "NT8Z5NjwxF/figures/figures_14_1.jpg", "caption": "Figure 6: 3D reconstructing uncertainty range of binocular configuration.", "description": "This figure illustrates the geometric relationship between 2D and 3D uncertainties in a binocular configuration. It shows how the uncertainty in the estimated 2D position of a point (represented by the range Δu) projects into a 3D uncertainty volume (represented by Δx, Δz, and Δz').  Points A, B, C, and D define the boundaries of this 3D uncertainty volume. The analysis in the paper uses this figure to derive mathematical formulas relating the 2D and 3D uncertainties, considering factors like baseline width (B) and depth (z).", "section": "A Relationship between 3D and 2D Uncertainty"}, {"figure_path": "NT8Z5NjwxF/figures/figures_15_1.jpg", "caption": "Figure 2: Overview of Dual-Diffusion Method. (a) Modeling: In the forward diffusion process, noise is added to the ground truth binocular 2D poses u0 for T steps, aligning with the distribution of initial estimated 2D poses. During the reverse denoising process, noisy 3D poses are progressively denoised to plausible poses. Geometric mapping is employed to connect 2D and 3D domains. (b) Inference: The initial 3D pose yT, reconstructed from binocular 2D poses uT, is denoised to y0. Then y0 is reprojected to the denoised 2D poses u0. The entire denoising process iterates for K times.", "description": "This figure illustrates the Dual-Diffusion method proposed in the paper. The left panel (a) shows the modeling process, where noise is added to the ground truth 2D poses step-by-step, then triangulated to create noisy 3D poses. The reverse process involves denoising the 3D poses, which are then reprojected back to 2D to ensure consistency. The right panel (b) shows the inference process, where initial 3D poses are denoised iteratively to obtain final accurate 3D and 2D poses.", "section": "3 Method"}, {"figure_path": "NT8Z5NjwxF/figures/figures_15_2.jpg", "caption": "Figure 7: Uncertainty distribution of a 3D point as (a) depth or (b) baseline width changes.", "description": "This figure visualizes the uncertainty distribution of a 3D point reconstructed from binocular 2D poses, showing how this uncertainty changes with varying depth (a) and baseline width (b).  The plots show that the depth of the 3D point significantly impacts the uncertainty along all three axes (x, y, z), while the baseline width primarily affects uncertainty along the z-axis. This analysis supports the inclusion of z-embedding as a conditional input to the Dual-Diffusion model and the use of Baseline-width-related pose normalization to handle varying baseline widths.", "section": "A.2 Experiment Analysis"}, {"figure_path": "NT8Z5NjwxF/figures/figures_16_1.jpg", "caption": "Figure 2: Overview of Dual-Diffusion Method. (a) Modeling: In the forward diffusion process, noise is added to the ground truth binocular 2D poses u for T steps, aligning with the distribution of initial estimated 2D poses. During the reverse denoising process, noisy 3D poses are progressively denoised to plausible poses. Geometric mapping is employed to connect 2D and 3D domains. (b) Inference: The initial 3D pose yT, reconstructed from binocular 2D poses uT, is denoised to ỹ0. Then ỹ0 is reprojected to the denoised 2D poses ũ0. The entire denoising process iterates for K times.", "description": "This figure illustrates the Dual-Diffusion method proposed in the paper.  Panel (a) shows the modeling process, detailing how noise is added to the ground truth 2D poses (forward diffusion) and how noisy 3D poses are denoised to plausible results (reverse denoising).  Geometric mapping connects the 2D and 3D domains. Panel (b) shows the inference process, illustrating how initial 3D poses are iteratively refined (K times) to produce accurate 3D and 2D poses.", "section": "3 Method"}, {"figure_path": "NT8Z5NjwxF/figures/figures_18_1.jpg", "caption": "Figure 5: Qualitative Comparison with Triangulation and RSB-Pose in 3D Pose Estimation. 2D poses are estimated by RSB-Pose152*. The gray skeleton is the ground truth, while the black represents the estimates. Red and blue points correspond to joints on the right and left sides, respectively. Yellow arrows indicate parts of significant improvement achieved by our method.", "description": "This figure shows a qualitative comparison of 3D human pose estimation results between the proposed Dual-Diffusion method and two baseline methods (Triangulation and RSB-Pose) on the MHAD and H36M datasets.  The ground truth poses are shown in gray, while the estimated poses are shown in black.  Red and blue points represent joints on the right and left sides of the body, respectively.  Yellow arrows highlight areas where the Dual-Diffusion method shows significant improvement over the baseline methods. The comparison demonstrates the superiority of Dual-Diffusion in accuracy and handling self-occlusions, particularly in challenging poses.", "section": "4 Experiments"}, {"figure_path": "NT8Z5NjwxF/figures/figures_18_2.jpg", "caption": "Figure 5: Qualitative Comparison with Triangulation and RSB-Pose in 3D Pose Estimation. 2D poses are estimated by RSB-Pose152*. The gray skeleton is the ground truth, while the black represents the estimates. Red and blue points correspond to joints on the right and left sides, respectively. Yellow arrows indicate parts of significant improvement achieved by our method.", "description": "This figure compares the 3D human pose estimation results of the proposed Dual-Diffusion method against two baseline methods: Triangulation and RSB-Pose.  The ground truth poses are shown in gray, while the estimations from each method are in black.  Red and blue points differentiate right and left joints.  Yellow arrows highlight areas where Dual-Diffusion significantly outperforms the baselines.", "section": "4.4 Visulization"}]