[{"figure_path": "3LZHatxUa9/tables/tables_8_1.jpg", "caption": "Table 1: Results on real-world graphs. \"*\" denotes results quoted from [6].", "description": "This table presents the results of applying various link prediction methods to six real-world datasets.  The datasets vary significantly in size (number of nodes and edges) and feature similarity.  The methods compared include heuristics (CN, AA, RA), GNN-based approaches using different encoders (GCN, GraphSAGE, NoGNN) and decoders (DOT, DistMult, MLP), and BUDDY models. The metrics reported are Hits@50 and MRR (Mean Reciprocal Rank).  The * indicates results that were quoted from another paper.", "section": "6.2 Experiments on Real-world Graphs"}, {"figure_path": "3LZHatxUa9/tables/tables_16_1.jpg", "caption": "Table 2: Results on synthetic graphs. We report MRR averaged over 3 runs.", "description": "This table presents the mean reciprocal rank (MRR) results for link prediction on synthetic graphs with varying levels of feature similarity.  The results are averaged over three runs and show the performance of various link prediction methods under different levels of homophily/heterophily.  The table helps to evaluate the impact of different decoders and encoders in handling feature similarity variations across a spectrum from negative (heterophilic) to positive (homophilic) similarity.", "section": "6 Empirical Analysis"}, {"figure_path": "3LZHatxUa9/tables/tables_19_1.jpg", "caption": "Table 1: Results on real-world graphs. “*” denotes results quoted from [6].", "description": "This table presents the results of link prediction experiments on six real-world datasets using various methods.  The datasets vary in size and feature similarity, ranging from homophilic to heterophilic. The results are presented for multiple GNN models with different encoders and decoders, as well as traditional link prediction heuristics.  The metrics used are Hits@50 and MRR (Mean Reciprocal Rank). Results marked with '*' are taken from a previous study ([6]) for comparison.", "section": "6.2 Experiments on Real-world Graphs"}, {"figure_path": "3LZHatxUa9/tables/tables_20_1.jpg", "caption": "Table 1: Results on real-world graphs. \"*\" denotes results quoted from [6].", "description": "This table presents the results of the link prediction task on six real-world datasets using various methods.  The datasets vary in size and feature similarity, ranging from homophilic to heterophilic.  Metrics include Hits@50 and MRR. Different encoder (GCN, GraphSAGE, NoGNN, BUDDY variants) and decoder (DOT, DistMult, MLP) combinations are evaluated.", "section": "6.2 Experiments on Real-world Graphs"}]