[{"figure_path": "7Jb4NJS8Yk/tables/tables_6_1.jpg", "caption": "Table 1: The results of our method playing against Cicero.", "description": "This table presents a comparison of the performance of the proposed Richelieu model against the Cicero model across four key metrics: Win Rate, Most Supply Centers (SC), Survived Rate, and Defeated Rate.  The results are shown for multiple runs of each model, indicating the average performance across multiple game instances.  This allows for a quantitative assessment of Richelieu's performance relative to the state-of-the-art Cicero model.", "section": "5.2 Results"}, {"figure_path": "7Jb4NJS8Yk/tables/tables_7_1.jpg", "caption": "Table 2: The results of Richelieu playing against AutoGPT.", "description": "This table presents the results of a game played between Richelieu and AutoGPT, comparing their performance across several key metrics. The metrics used are win rate, the percentage of games where the model controlled the most supply centers (Most SC), the survival rate (Survived), and the defeat rate (Defeated). The data is presented for three independent runs of each model, along with an average across all runs (bottom row). The results highlight a significant performance gap between Richelieu and AutoGPT, demonstrating Richelieu's superior performance in this task.", "section": "5.2 Results"}, {"figure_path": "7Jb4NJS8Yk/tables/tables_8_1.jpg", "caption": "Table 3: Ablation study: average results of 3 Richelieu vs. 4 Cicero.", "description": "This table presents the ablation study results, comparing the performance of three Richelieu agents against four Cicero agents.  Each row represents a different configuration of Richelieu, with checkmarks indicating the inclusion of specific modules: Modeling others, Negotiation pipeline, Reflection with Memory, and Self-play. The columns show the Win rate, Most SC rate, Survived rate, and Defeated rate for each configuration.  This analysis demonstrates the contribution of each module to the overall performance of the Richelieu agent.", "section": "5.2 Results"}, {"figure_path": "7Jb4NJS8Yk/tables/tables_16_1.jpg", "caption": "Table 4: The success rate to identify the social relationship and infer others' intentions.", "description": "This table presents the accuracy of Richelieu's social reasoning module in identifying social relationships and inferring the intentions of other players.  The results are shown separately for GPT-4 and Llama 3, indicating the model's performance with different large language models (LLMs).  Higher percentages indicate greater accuracy in understanding the game's social dynamics.", "section": "A.3 Social Reasoning"}, {"figure_path": "7Jb4NJS8Yk/tables/tables_17_1.jpg", "caption": "Table 1: The results of our method playing against Cicero.", "description": "This table presents a comparison of the performance of the proposed Richelieu model against the Cicero model across four key metrics: win rate, most supply centers controlled, survival rate, and defeat rate.  The results are shown for multiple runs (Richelieu_1 to Richelieu_4 and Cicero_1 to Cicero_4), indicating performance variability across different game instances.  Overall, Richelieu demonstrates slightly superior performance in terms of wins and supply centers, but the difference isn't substantial.", "section": "5.2 Results"}]