[{"figure_path": "mfvKEdJ4zW/figures/figures_1_1.jpg", "caption": "Figure 1: Framework overview: given two spaces X, Y their samples lie on two manifolds M, N, which can be approximated with the KNN graphs Gx,Gy. We can optimize for a latent functional map C between the eigenbases of operators defined on the graphs. This map serves as a map between functions defined on the two manifolds and can be leveraged for (i) comparing representational spaces, (ii) solving correspondence problems, and (iii) transferring information between the spaces.", "description": "This figure provides a high-level overview of the Latent Functional Maps (LFM) framework. It shows how two datasets X and Y, represented as manifolds M and N, are approximated using k-Nearest Neighbor (kNN) graphs. A latent functional map C is then learned to align the eigenbases of the graph Laplacian operators defined on these graphs. This map facilitates (i) comparing the representational spaces, (ii) solving correspondence problems between them, and (iii) transferring information between the spaces.", "section": "3 Method"}, {"figure_path": "mfvKEdJ4zW/figures/figures_5_1.jpg", "caption": "Figure 2: Similarity across layers Similarity matrices between internal layer representations of CIFAR10 comparing our LFM-based similarity with the CCA and CKA baselines, averaged across 10 models. For each method, we report the accuracy scores for matching the corresponding layer by maximal similarity.", "description": "This figure compares three different methods (CCA, CKA, and LFM) for measuring the similarity between the internal layer representations of 10 different CIFAR-10 trained CNN models.  Each method produces a similarity matrix showing the pairwise similarity between layers across the models. The accuracy of each method in correctly matching corresponding layers across the models is reported as a percentage.", "section": "4.1 Analysis"}, {"figure_path": "mfvKEdJ4zW/figures/figures_6_1.jpg", "caption": "Figure 3: Robustness of LFM similarity Left: Similarity scores as a function of perturbation strength: while the CKA baseline degrades, our LFM similarity scores are robust to perturbations that preserve linear separability of the space. Right: Visualization of area distortion of the map by projecting the first singular component of the LFM in the perturbed space: the distortion localizes on the samples of the perturbed class, making LFM similarity interpretable.", "description": "This figure demonstrates the robustness of the proposed Latent Functional Map (LFM) similarity measure compared to Centered Kernel Alignment (CKA). The left panel shows that LFM similarity remains stable even with significant perturbations to the latent space that preserve linear separability, unlike CKA which degrades. The right panel visualizes the area distortion caused by perturbations, showing that the distortion is localized to specific classes, making the LFM similarity measure more interpretable.", "section": "4.1 Analysis"}, {"figure_path": "mfvKEdJ4zW/figures/figures_7_1.jpg", "caption": "Figure 2: Similarity across layers Similarity matrices between internal layer representations of CIFAR10 comparing our LFM-based similarity with the CCA and CKA baselines, averaged across 10 models. For each method, we report the accuracy scores for matching the corresponding layer by maximal similarity.", "description": "This figure compares the performance of three different methods (LFM, CCA, and CKA) in identifying corresponding layers across multiple models trained on the CIFAR-10 dataset.  Similarity matrices are generated for each model, showing the similarity between different layers. The accuracy of each method in matching layers based on similarity scores is presented.", "section": "4 Experiments"}, {"figure_path": "mfvKEdJ4zW/figures/figures_7_2.jpg", "caption": "Figure 2: Similarity across layers Similarity matrices between internal layer representations of CIFAR10 comparing our LFM-based similarity with the CCA and CKA baselines, averaged across 10 models. For each method, we report the accuracy scores for matching the corresponding layer by maximal similarity.", "description": "This figure compares the performance of three different methods (CCA, CKA, and LFM) in measuring the similarity between internal layer representations of CIFAR10 across 10 different models.  Each method produces a similarity matrix showing pairwise similarity between layers. The accuracy of each method in correctly matching corresponding layers across different models is reported.  The visualization helps in assessing which method best captures the representational similarity across different models.", "section": "4.1 Analysis"}, {"figure_path": "mfvKEdJ4zW/figures/figures_8_1.jpg", "caption": "Figure 2: Similarity across layers Similarity matrices between internal layer representations of CIFAR10 comparing our LFM-based similarity with the CCA and CKA baselines, averaged across 10 models. For each method, we report the accuracy scores for matching the corresponding layer by maximal similarity.", "description": "This figure compares the performance of three methods (LFM, CCA, and CKA) in determining the similarity between the internal layer representations of 10 different CIFAR-10 trained CNN models.  The similarity matrices visualize the relationships between layers across different models.  Accuracy scores, representing the ability to correctly match corresponding layers based on similarity, are reported for each method.  The visualization and accuracy scores demonstrate the effectiveness of LFMs compared to CCA and CKA in capturing similarity between layers in different models.", "section": "4 Experiments"}, {"figure_path": "mfvKEdJ4zW/figures/figures_8_2.jpg", "caption": "Figure 2: Similarity across layers Similarity matrices between internal layer representations of CIFAR10 comparing our LFM-based similarity with the CCA and CKA baselines, averaged across 10 models. For each method, we report the accuracy scores for matching the corresponding layer by maximal similarity.", "description": "This figure compares the similarity of internal layer representations across 10 different CIFAR-10 trained CNN models using three methods: CCA, CKA, and the proposed LFM method.  The similarity is represented as matrices, where each cell shows the similarity between a specific layer in one model and a layer in another model. The accuracy of matching corresponding layers based on maximal similarity is reported for each method. The LFM method shows notably higher accuracy indicating its effectiveness in measuring the similarity between neural network representations.", "section": "4.1 Analysis"}, {"figure_path": "mfvKEdJ4zW/figures/figures_23_1.jpg", "caption": "Figure 2: Similarity across layers Similarity matrices between internal layer representations of CIFAR10 comparing our LFM-based similarity with the CCA and CKA baselines, averaged across 10 models. For each method, we report the accuracy scores for matching the corresponding layer by maximal similarity.", "description": "This figure compares the similarity between the internal layer representations of 10 different CIFAR-10 CNN models using three different methods: CCA, CKA, and the proposed LFM method.  The similarity is visualized as a matrix where each entry represents the similarity between corresponding layers from two models.  The accuracy of matching layers based on maximal similarity is reported for each method. The LFM method demonstrates higher accuracy compared to CCA and CKA, indicating better performance in capturing the similarity between layer representations across different models.", "section": "4 Experiments"}, {"figure_path": "mfvKEdJ4zW/figures/figures_23_2.jpg", "caption": "Figure 7: Functional maps structure at increasing level noise. Given a set of MNIST embeddings, we plot the degradation of the functional map structure as the space is perturbed. We compare the graph built with two different metrics (Angular, L2) and report MRR and LFM similarity score.", "description": "This figure visualizes how the structure of functional maps changes under increasing levels of noise applied to MNIST embeddings.  Two different graph construction methods (using angular and L2 distances) are compared, and the resulting functional maps are shown along with their Mean Reciprocal Rank (MRR) and Latent Functional Map (LFM) similarity scores.  The results illustrate the robustness (or lack thereof) of each approach to noisy data.", "section": "C.1 Functional maps structure"}, {"figure_path": "mfvKEdJ4zW/figures/figures_24_1.jpg", "caption": "Figure 2: Similarity across layers Similarity matrices between internal layer representations of CIFAR10 comparing our LFM-based similarity with the CCA and CKA baselines, averaged across 10 models. For each method, we report the accuracy scores for matching the corresponding layer by maximal similarity.", "description": "This figure compares the similarity between internal layer representations of 10 different CIFAR-10 models using three methods: LFM, CCA, and CKA.  The similarity matrices visualize the pairwise similarity between corresponding layers across the models. The caption also highlights that the accuracy of matching corresponding layers based on maximal similarity is reported for each method. LFM demonstrates higher accuracy than CCA and nearly perfect accuracy compared to CKA.", "section": "4 Experiments"}, {"figure_path": "mfvKEdJ4zW/figures/figures_25_1.jpg", "caption": "Figure 2: Similarity across layers Similarity matrices between internal layer representations of CIFAR10 comparing our LFM-based similarity with the CCA and CKA baselines, averaged across 10 models. For each method, we report the accuracy scores for matching the corresponding layer by maximal similarity.", "description": "This figure compares the similarity of internal representations across different layers of 10 different CIFAR-10 trained CNN models using three different methods: CCA, CKA, and the proposed LFM method.  Each method's similarity is represented as a matrix where each entry corresponds to the similarity between the same layer in two different models. The accuracy of each method in correctly matching corresponding layers is also reported.", "section": "4.1 Analysis"}]