[{"figure_path": "kZfxICBXd1/figures/figures_7_1.jpg", "caption": "Figure 2: Illustration for the proof of Lemma 1. Left: Case 1; Right: Case 2.", "description": "This figure is used in the proof of Lemma 1 in the paper.  It illustrates two cases for constructing a reconfiguration path between two committees, W and W', under the Chamberlin-Courant (CC) voting rule.  The figure shows how to make incremental changes to the committee W to reach the committee W', while maintaining a certain closeness criteria (d-adjacency) between consecutive committees in the sequence.  Case 1 represents a scenario where the difference between W and W' is large, and Case 2 represents a scenario where the difference is small. The colored regions show the sets of alternatives that are added, removed, or remain unchanged during the transitions between committees.", "section": "Reconfiguration of committees"}, {"figure_path": "kZfxICBXd1/figures/figures_21_1.jpg", "caption": "Figure 3: Left: The dependency of the median time to find a reconfiguration path to the number of voters n on Netflix data. Right: The dependency of the median time to find a reconfiguration path to the radius of Manhattan data.", "description": "The left subplot shows the median running time (in seconds) to find a reconfiguration path plotted against the number of voters for Netflix data.  Different colors represent different committee sizes (k=3, 4, 5) for both Chamberlin-Courant (CC) and Proportional Approval Voting (PAV) rules.  The right subplot shows the same median running time but this time plotted against the radius of the Manhattan data, again showing different colors for different committee sizes and voting rules.", "section": "C Experimental Research"}, {"figure_path": "kZfxICBXd1/figures/figures_21_2.jpg", "caption": "Figure 4: Left: CC, Right: PAV. The dependency of a median time to find a reconfiguration path to p under (p, φ)-Resampling data, measured in seconds.", "description": "This figure shows the median running time to find a reconfiguration path using two different multi-winner voting rules (Chamberlin-Courant and Proportional Approval Voting) under different parameter settings.  The x-axis represents the approval probability (p), and different lines represent different values of dissimilarity (φ) and different committee sizes (k).  Each point represents the median running time across multiple trials. The figure demonstrates how the running time varies with different probability parameters and voting rules.", "section": "C Experimental Research"}]