[{"figure_path": "fEYHZzN7kX/figures/figures_1_1.jpg", "caption": "Figure 1: (a): Classical chaotic systems with noise. (b): dynamical system structure of real-world datasets. (c): Different types of Attractors. See more figures in Appendix E.1.", "description": "This figure shows different types of attractors in dynamical systems. (a) shows examples of attractors in classical chaotic systems with added noise, such as fixed points, limited cycles, limited tori, and strange attractors. (b) visualizes the structures of real-world time series datasets (ECL, ETTm1, Weather, Traffic) by using phase space reconstruction, which reveals that these time series exhibit similar structural patterns to those found in classical chaotic systems. (c) provides a summary of the different types of attractors and their characteristics.", "section": "1 Introduction"}, {"figure_path": "fEYHZzN7kX/figures/figures_2_1.jpg", "caption": "Figure 2: Overall architecture of Attraos. Initially, the PSR technique is employed to restore the underlying dynamical structures from historical data {zi}. Subsequently, the dynamical system trajectory is fed into MDMU, projected onto polynomial space Gỗ using a time window θ and polynomial order N. Gradually, a hierarchical projection is performed to obtain more macroscopic memories of the dynamical system structure. Finally, local evolution operator K(i) in the frequency domain is employed to obtain future state, thereby for the prediction.", "description": "This figure illustrates the overall architecture of the Attraos model for long-term time series forecasting. It shows how the model uses Phase Space Reconstruction (PSR) to recover the underlying dynamical structures from historical data, employs a Multi-resolution Dynamic Memory Unit (MDMU) to memorize these structures, and uses a frequency-enhanced local evolution strategy to predict future states.", "section": "3 Theoretical Analysis & Methods"}, {"figure_path": "fEYHZzN7kX/figures/figures_3_1.jpg", "caption": "Figure 2: Overall architecture of Attraos. Initially, the PSR technique is employed to restore the underlying dynamical structures from historical data {zi}. Subsequently, the dynamical system trajectory is fed into MDMU, projected onto polynomial space Gỗ using a time window @ and polynomial order N. Gradually, a hierarchical projection is performed to obtain more macroscopic memories of the dynamical system structure. Finally, local evolution operator K(i) in the frequency domain is employed to obtain future state, thereby for the prediction.", "description": "This figure illustrates the overall architecture of the Attraos model for long-term time series forecasting.  The model consists of three main stages: 1) Phase Space Reconstruction (PSR) to reconstruct the underlying dynamical system from the input time series, 2) a Multi-resolution Dynamic Memory Unit (MDMU) to memorize the multi-scale dynamical structures using a hierarchical projection into polynomial function spaces, and 3) a frequency-enhanced local evolution strategy that operates in the frequency domain to predict future states.", "section": "3 Theoretical Analysis & Methods"}, {"figure_path": "fEYHZzN7kX/figures/figures_4_1.jpg", "caption": "Figure 3: (a) Discretization of continuous polynomial approximation for sequence data. g represents the optimal polynomial constructed from polynomial bases. (b) MDMU projects the dynamical structure onto different orthogonal subspaces G and S. (c) Sequential computation for Eq. (2a) in O(L) time complexity. (d) Blelloch Scan Algorithm O(logL) by storing intermediate results.", "description": "This figure shows the discretization of continuous polynomial approximation, the multi-scale dynamic memory unit (MDMU) that projects dynamical structures onto orthogonal subspaces, and the efficient computation methods used in the Attraos model, including sequential computation and Blelloch's scan algorithm.", "section": "3.2 Dynamical Representation by MDMU"}, {"figure_path": "fEYHZzN7kX/figures/figures_4_2.jpg", "caption": "Figure 2: Overall architecture of Attraos. Initially, the PSR technique is employed to restore the underlying dynamical structures from historical data {zi}. Subsequently, the dynamical system trajectory is fed into MDMU, projected onto polynomial space Gỗ using a time window @ and polynomial order N. Gradually, a hierarchical projection is performed to obtain more macroscopic memories of the dynamical system structure. Finally, local evolution operator K(i) in the frequency domain is employed to obtain future state, thereby for the prediction.", "description": "This figure shows the overall architecture of the Attraos model, which is composed of several key components: Phase Space Reconstruction (PSR), Multi-resolution Dynamic Memory Unit (MDMU), and Frequency-enhanced Local Evolution.  PSR first transforms the input time series data into a higher-dimensional representation to capture the underlying dynamical structure. This representation is then fed into MDMU, which uses a multi-resolution approach to memorize diverse dynamical patterns. Finally, the model uses a frequency-enhanced local evolution strategy to predict future states based on learned dynamical structures in the frequency domain. ", "section": "3 Theoretical Analysis & Methods"}, {"figure_path": "fEYHZzN7kX/figures/figures_4_3.jpg", "caption": "Figure 3: (a) Discretization of continuous polynomial approximation for sequence data. g represents the optimal polynomial constructed from polynomial bases. (b) MDMU projects the dynamical structure onto different orthogonal subspaces G and S. (c) Sequential computation for Eq. (2a) in O(L) time complexity. (d) Blelloch tree scanning for Eq. (2a) in O(logL) by storing intermediate results.", "description": "This figure illustrates the discretization of continuous polynomial approximation, the multi-scale dynamic memory unit (MDMU) and efficient computation methods for the dynamical representation in Attraos.  Panel (a) shows the discretization process. Panel (b) depicts how MDMU projects dynamical structures onto different orthogonal subspaces. Panels (c) and (d) compare sequential computation and Blelloch scan algorithm for efficient computation.", "section": "3.2 Dynamical Representation by MDMU"}, {"figure_path": "fEYHZzN7kX/figures/figures_4_4.jpg", "caption": "Figure 2: Overall architecture of Attraos. Initially, the PSR technique is employed to restore the underlying dynamical structures from historical data {zi}. Subsequently, the dynamical system trajectory is fed into MDMU, projected onto polynomial space Gỗ using a time window @ and polynomial order N. Gradually, a hierarchical projection is performed to obtain more macroscopic memories of the dynamical system structure. Finally, local evolution operator K(2) in the frequency domain is employed to obtain future state, thereby for the prediction.", "description": "This figure illustrates the overall architecture of the Attraos model for long-term time series forecasting. It shows how the model processes input time series data through several key steps: Phase Space Reconstruction (PSR), Multi-resolution Dynamic Memory Unit (MDMU), and Frequency-enhanced Local Evolution.  The PSR step reconstructs the underlying dynamical structures from the input time series. Then, MDMU projects this onto a polynomial space using a time window and polynomial order for hierarchical projection in order to obtain more macroscopic memories of the dynamical system structure. Finally, the frequency-enhanced local evolution operator predicts future states in the frequency domain, resulting in the output time series prediction.", "section": "3 Theoretical Analysis & Methods"}, {"figure_path": "fEYHZzN7kX/figures/figures_9_1.jpg", "caption": "Figure 4: Complexity analysis.", "description": "This figure compares the training time and test loss of various long-term time series forecasting models, including Attraos (both explicit and implicit versions), against several baselines. The size of each circle represents the number of model parameters. Attraos demonstrates superior performance with significantly fewer parameters compared to other models, particularly PatchTST.", "section": "Experiments"}, {"figure_path": "fEYHZzN7kX/figures/figures_9_2.jpg", "caption": "Figure 3: (a) Discretization of continuous polynomial approximation for sequence data. g represents the optimal polynomial constructed from polynomial bases. (b) MDMU projects the dynamical structure onto different orthogonal subspaces G and S. (c) Sequential computation for Eq. (2a) in O(L) time complexity. (d) Blelloch Scan Algorithm O(logL)", "description": "This figure illustrates the overall architecture of Attraos, showing how it discretizes continuous polynomial approximation, uses the Multi-resolution Dynamic Memory Unit (MDMU) for dynamical representation, performs sequential and Blelloch scan algorithms for computation, and projects the dynamical structure onto orthogonal subspaces.", "section": "3.1 Phase Space Reconstruction"}, {"figure_path": "fEYHZzN7kX/figures/figures_22_1.jpg", "caption": "Figure 6: Dynamic structures of real-world data", "description": "This figure visualizes the phase space structures of various real-world time series datasets. Each row represents a different dataset, showing both the original time series data (left) and its corresponding 3D phase space representation (right).  The 3D phase space plots illustrate the trajectories of the data points, revealing the underlying dynamical structures and attractor patterns. Note that due to visualization limitations, the attractors for the time series might be of higher dimensions. Only slices of the attractors in the first three dimensions are shown.", "section": "E.1 Dynamic Structures of Real-world Data"}, {"figure_path": "fEYHZzN7kX/figures/figures_23_1.jpg", "caption": "Figure 7: Simulation for Lorenz96", "description": "This figure demonstrates the simulation process of generating time series data from a high-dimensional chaotic system (Lorenz96). (a) shows the trajectory of the Lorenz63 system in a 3D phase space. (b) illustrates how the 40D Lorenz96 system is mapped to a 3D space using a random initialized linear neural network, which represents the observation function h. The visualization in (b) shows a chaotic system trajectory in 3D. Finally, (c) presents a 1D visualization of the three dimensions obtained from the mapping process.", "section": "E.3 Simulation for Lorenz96 (Case Study)"}, {"figure_path": "fEYHZzN7kX/figures/figures_24_1.jpg", "caption": "Figure 8: Performance comparison about teaching forcing, measured by MSE. Left: Lorenzo96 dataset. Right: Weather dataset.", "description": "This figure shows the performance comparison of two methods (Hippo-RNN and Hippo-GTF) using MSE as the metric. The left subplot displays the results for the Lorenzo96 dataset, while the right subplot shows the results for the Weather dataset. The x-axis represents the forecasting window length, and the y-axis represents the MSE values. The results demonstrate the impact of teaching forcing on the predictive performance of the methods.", "section": "E.4 Chaotic Modulation"}]