{"references": [{"fullname_first_author": "Alekh Agarwal", "paper_title": "Optimal algorithms for online convex optimization with multi-point bandit feedback", "publication_date": "2010", "reason": "This paper is foundational to the understanding of optimal algorithms within online convex optimization, providing a theoretical basis for many subsequent works in zeroth-order optimization."}, {"fullname_first_author": "Albert S Berahas", "paper_title": "Linear interpolation gives better gradients than gaussian smoothing in derivative-free optimization", "publication_date": "2019", "reason": "This paper provides theoretical and empirical evidence supporting the use of linear interpolation methods over smoothing techniques for gradient estimation in derivative-free optimization, which is directly relevant to the proposed ReLIZO method."}, {"fullname_first_author": "Albert S. Berahas", "paper_title": "A theoretical and empirical comparison of gradient approximations in derivative-free optimization", "publication_date": "2022", "reason": "This paper offers a comprehensive comparison of various gradient approximation techniques used in derivative-free optimization, providing valuable context for understanding the strengths and limitations of the proposed ReLIZO approach."}, {"fullname_first_author": "Saeed Ghadimi", "paper_title": "Stochastic first-and zeroth-order methods for nonconvex stochastic programming", "publication_date": "2013", "reason": "This paper introduced foundational stochastic zeroth-order methods for non-convex optimization problems, which serve as a critical starting point for many later advancements in the field, including the proposed ReLIZO method."}, {"fullname_first_author": "Yurii Nesterov", "paper_title": "Random gradient-free minimization of convex functions", "publication_date": "2011", "reason": "This paper is a seminal work in the field of gradient-free optimization, proposing techniques that are closely related to those explored in the development of ReLIZO and offer a broader theoretical context for understanding its contributions."}]}