[{"figure_path": "p32gjG4yqw/figures/figures_3_1.jpg", "caption": "Figure 1: An ordinary G-equivariant feature map  φ : X × Ξ → Y is a subclass of joint-G-equivariant map where the G-action on parameter domain Ξ is trivial, i.e. g · ξ = ξ", "description": "This figure compares and contrasts G-equivariance and joint-G-equivariance.  In the left panel, we see G-equivariance where the input x is transformed by a group action g to g.x. This transformed input is passed through the feature map φ, which produces an output that is similarly transformed by the group action g to g.y. The parameter ξ remains unchanged by the group action. In the right panel illustrating joint-G-equivariance, both the input x and parameter ξ are transformed by the group action g, which produces g.x and g.ξ, respectively. These are then passed through the feature map φ, generating an output g.y that is also transformed by the same group action g. The key difference lies in whether or not the parameters are also affected by the group action.", "section": "3 Main Results"}, {"figure_path": "p32gjG4yqw/figures/figures_5_1.jpg", "caption": "Figure 2: Deep H-valued joint-G-equivariant network on G-space X is L²(X;H)-universal when unitary representation πof G on L²(X; H) is irreducible, and the distribution of parameters for the network to represent a given map f : X → H is exactly given by the ridgelet transform R[f]", "description": "This figure illustrates a deep H-valued joint-G-equivariant network.  The network's universality is established when the unitary representation π of G on L²(X; H) is irreducible. The parameter distribution for the network to represent a map f: X → H is precisely given by the ridgelet transform R[f].  The figure shows multiple G-spaces representing inputs, parameters, and intermediate features, ultimately leading to a vector-space output.  Each layer employs a G-equivariant feature map (φ).", "section": "Main Results"}, {"figure_path": "p32gjG4yqw/figures/figures_13_1.jpg", "caption": "Figure 3: The invariant θ((a, b), x) = σ(α· x – b) is the euclidean distance between point x and hyperplane ξ(a, b) followed by scaling and nonlinearity σ", "description": "The figure illustrates the geometric interpretation of the dual action in the original ridgelet transform.  It shows that the invariant θ((a, b), x) represents the Euclidean distance between a point x and a hyperplane ξ(a, b), scaled by |a| and passed through a nonlinearity σ. The dual action of the group G on the parameter domain is geometrically interpreted as a parallel translation of the hyperplane that keeps the scaled distance invariant.  This visualization helps explain how the depth-2 fully connected neural network and its corresponding ridgelet transform relate geometrically.", "section": "B Geometric Interpretation of Dual Action for Original Ridgelet Transform"}]