[{"figure_path": "bkLetzd97M/tables/tables_3_1.jpg", "caption": "Table 1: Performance of our approach on three TAS benchmarks under two inference mode, i.e., online and semi-online. Post-processing is indicated by p.p.", "description": "This table presents the performance comparison of the proposed online temporal action segmentation method against a baseline method (single-stage causal TCN) across three benchmark datasets (GTEA, 50Salads, and Breakfast).  The results are shown for two inference modes: online and semi-online, with and without post-processing.  The performance metrics used are frame-wise accuracy (Acc), segmental edit score (Edit), and segmental F1-scores (F1) at different overlap thresholds (10%, 25%, and 50%). The table highlights the effectiveness of the proposed method in improving accuracy and mitigating over-segmentation, especially in the semi-online setting and with post-processing.", "section": "4 Experiments"}, {"figure_path": "bkLetzd97M/tables/tables_4_1.jpg", "caption": "Table 1: Performance of our approach on three TAS benchmarks under two inference mode, i.e., online and semi-online. Post-processing is indicated by p.p.", "description": "This table presents the performance comparison of the proposed OnlineTAS framework under two inference modes (online and semi-online) across three common temporal action segmentation (TAS) benchmarks (GTEA, 50Salads, and Breakfast).  The metrics used for evaluation include frame-wise accuracy (Acc), segmental edit score (Edit), and segmental F1 scores at three different overlap thresholds (10%, 25%, and 50%). The impact of post-processing on the results is also shown.", "section": "4 Experiments"}, {"figure_path": "bkLetzd97M/tables/tables_5_1.jpg", "caption": "Table 1: Performance of our approach on three TAS benchmarks under two inference mode, i.e., online and semi-online. Post-processing is indicated by p.p.", "description": "This table presents the performance of the proposed online temporal action segmentation method on three benchmark datasets (GTEA, 50Salads, Breakfast).  It compares the results using two inference modes: online and semi-online.  The results include accuracy (Acc), edit score (Edit), and F1 scores at different overlap thresholds (10%, 25%, 50%).  The impact of a post-processing step to mitigate over-segmentation is also shown.", "section": "4.1 Experiment Results"}, {"figure_path": "bkLetzd97M/tables/tables_6_1.jpg", "caption": "Table 2: Ablation study of module components on 50Salads [38].", "description": "This table presents the ablation study results for different components of the Context-aware Feature Augmentation (CFA) module on the 50Salads dataset. It shows the impact of including the GRU, CFA, and adaptive memory on the model's performance, as measured by Accuracy (Acc), Edit score, and F1 score at different IoU thresholds (10%, 25%, 50%). The results demonstrate the contribution of each component and the overall effectiveness of the CFA module in improving the model's performance.", "section": "4.1 Experiment Results"}, {"figure_path": "bkLetzd97M/tables/tables_6_2.jpg", "caption": "Table 3: Effect of interactions I.", "description": "This table presents the ablation study on the number of interaction iterations (I) within the Context-aware Feature Augmentation (CFA) module. It shows the impact of varying the number of iterations (1, 2, 3, 4, and 5) on the model's performance, as measured by Accuracy (Acc), Edit score (Edit), and F1 scores at different Intersection over Union (IoU) thresholds (10, 25, and 50). The results indicate that the performance is not significantly affected by the number of iterations, with the best performance achieved at 2 iterations.", "section": "3.4 Training and Inference"}, {"figure_path": "bkLetzd97M/tables/tables_6_3.jpg", "caption": "Table 4: Effect of memory composition.", "description": "This table presents an ablation study on the impact of short-term memory (Mshort) and long-term memory (Mlong) components on the model's performance. It compares the model's performance when using only Mshort, only Mlong, and both Mshort and Mlong. The results are evaluated using Accuracy (Acc) and average Segmental scores (Seg). The table demonstrates that incorporating both short-term and long-term memory significantly improves the model's performance, suggesting their complementary roles in temporal context modeling for online action segmentation.", "section": "4.1 Experiment Results"}, {"figure_path": "bkLetzd97M/tables/tables_7_1.jpg", "caption": "Table 6: Effect of confidence threshold θ (σ = 1).", "description": "This table shows the performance of the model on the 50Salads dataset with different confidence thresholds (θ).  The results are presented for two metrics: Accuracy (Acc) and the average of Edit and F1 scores (Seg.). The table shows how the choice of threshold impacts both accuracy and the model's ability to avoid over-segmentation.", "section": "3.5 Post-processing"}, {"figure_path": "bkLetzd97M/tables/tables_7_2.jpg", "caption": "Table 7: Effect of minimum length factor σ with θ = 0.9.", "description": "This table shows the effect of varying the minimum length factor (σ) on the model's performance, specifically the accuracy (Acc) and average of edit and F1 scores (Seg). The confidence threshold (θ) is fixed at 0.9.  Different values of σ are tested, and the results show that a σ of 1/16 leads to the best average of edit and F1 scores (Seg).", "section": "4.1 Experiment Results"}, {"figure_path": "bkLetzd97M/tables/tables_7_3.jpg", "caption": "Table 1: Performance of our approach on three TAS benchmarks under two inference mode, i.e., online and semi-online. Post-processing is indicated by p.p.", "description": "This table presents the performance of the proposed online temporal action segmentation method on three benchmark datasets: GTEA, 50Salads, and Breakfast.  The results are shown for two inference modes: online and semi-online.  The online mode processes one frame at a time, while the semi-online mode processes clips of frames.  The table reports accuracy (Acc), edit score (Edit), and F1 score at different overlap thresholds (10%, 25%, and 50%).  The impact of post-processing on the results is also shown.", "section": "4.1 Experiment Results"}, {"figure_path": "bkLetzd97M/tables/tables_8_1.jpg", "caption": "Table 9: Comparison with the state-of-the-art methods on Breakfast.", "description": "This table compares the proposed OnlineTAS model with other state-of-the-art methods on the Breakfast dataset.  It shows the performance of different models using metrics such as frame-wise accuracy (Acc), segmental edit score (Edit), and segmental F1 scores at different overlap thresholds (10%, 25%, 50%).  The table highlights the performance improvement achieved by OnlineTAS, especially when post-processing is applied, compared to other online methods, particularly in mitigating the over-segmentation problem.", "section": "4.2 Comparison with State-of-the-Art Methods"}, {"figure_path": "bkLetzd97M/tables/tables_9_1.jpg", "caption": "Table 1: Performance of our approach on three TAS benchmarks under two inference mode, i.e., online and semi-online. Post-processing is indicated by p.p.", "description": "This table presents a comparison of the proposed OnlineTAS model's performance across three Temporal Action Segmentation (TAS) benchmarks (GTEA, 50Salads, Breakfast) under two inference settings: online and semi-online.  The results are shown for three metrics: Accuracy (Acc), Edit Score (Edit), and F1 score at different intersection over union (IoU) thresholds (10%, 25%, 50%). The impact of post-processing on performance is also demonstrated.", "section": "4.1 Experiment Results"}, {"figure_path": "bkLetzd97M/tables/tables_14_1.jpg", "caption": "Table 1: Performance of our approach on three TAS benchmarks under two inference mode, i.e., online and semi-online. Post-processing is indicated by p.p.", "description": "This table presents the performance of the proposed OnlineTAS model on three benchmark datasets: GTEA, 50Salads, and Breakfast. The results are shown for two inference modes: online and semi-online.  The performance metrics used are frame-wise accuracy (Acc), segmental edit score (Edit), and segmental F1-scores at three different overlap thresholds (10%, 25%, 50%).  The effect of post-processing is also demonstrated. The table allows for a comparison of the model's performance under different settings and highlights the impact of post-processing on mitigating over-segmentation.", "section": "4 Experiments"}, {"figure_path": "bkLetzd97M/tables/tables_15_1.jpg", "caption": "Table 1: Performance of our approach on three TAS benchmarks under two inference mode, i.e., online and semi-online. Post-processing is indicated by p.p.", "description": "This table presents the performance comparison of the proposed OnlineTAS method on three benchmark datasets (GTEA, 50Salads, Breakfast) under two inference modes: online and semi-online.  It shows the Accuracy (Acc), Edit Score (Edit), and F1-score at different overlap thresholds (10%, 25%, 50%) for both modes, with and without post-processing.  The results highlight the effectiveness of the post-processing step in mitigating over-segmentation, a common issue in online action segmentation. The comparison between online and semi-online modes showcases the trade-off between real-time performance and accuracy.", "section": "4.1 Experiment Results"}]