[{"figure_path": "ojFEP11Cqj/tables/tables_6_1.jpg", "caption": "Table 1: Single variable inference results. The reported values are the averages over 5 cross-validation folds. The corresponding sample standard deviations are reported in Appendix G.", "description": "This table presents the results of single variable inference experiments.  Five different evaluation metrics (R2, AUC, and accuracy) are shown for several datasets and models.  The values represent averages over five cross-validation folds, with standard deviations available in Appendix G. The models compared include XGBoost, RFDE, DEF (using ISE and KL divergence), and NRGBoost.  The table allows a comparison of the performance of generative models against a strong discriminative baseline (XGBoost) on a single variable inference task.", "section": "6.1 Single Variable Inference"}, {"figure_path": "ojFEP11Cqj/tables/tables_7_1.jpg", "caption": "Table 2: ML Efficiency results. The reported values are the averages over 5 different datasets generated by the same model. The best methods for each dataset are in bold and methods whose difference is < 20 away from zero are underlined. The performance of XGBoost trained on the real data is also reported for reference.", "description": "This table presents the results of evaluating the Machine Learning efficiency of different generative models.  ML efficiency is measured by training an XGBoost model on synthetic data generated by each model and evaluating its performance on real data. The table shows the R-squared, AUC, and accuracy metrics for several datasets and compares the performance of various methods including NRGBoost, TVAE, and TabDDPM.  The best performing model for each dataset is highlighted.", "section": "6.2 Sampling"}, {"figure_path": "ojFEP11Cqj/tables/tables_8_1.jpg", "caption": "Table 3: Discriminator measure results. All results are the AUC of an XGBoost model trained to distinguish real from generated data and therefore lower means better. The reported values are the averages over 5 different datasets generated by the same model.", "description": "This table presents the results of a discriminator model, trained to distinguish between real and generated data.  The discriminator's performance (AUC) is shown for five different datasets (AB, CH, PR, AD, MBNE, MNIST, CT), with each dataset's results averaged over five different runs. Lower AUC values indicate better performance of the generative models, as they produce samples more difficult to distinguish from real data.", "section": "6.2 Sampling"}, {"figure_path": "ojFEP11Cqj/tables/tables_15_1.jpg", "caption": "Table 1: Single variable inference results. The reported values are the averages over 5 cross-validation folds. The corresponding sample standard deviations are reported in Appendix G.", "description": "This table presents the results of single variable inference experiments.  For each dataset (AB, CH, PR, AD, MBNE, MNIST, CT), it shows the R-squared (R2), Area Under the ROC Curve (AUC), and accuracy achieved by different models: XGBoost, RFDE, DEF (ISE), DEF (KL), and NRGBoost.  The values are averages from five-fold cross-validation, with standard deviations detailed in Appendix G. The table highlights the performance of NRGBoost compared to other methods in single-variable inference tasks.", "section": "6.1 Single Variable Inference"}, {"figure_path": "ojFEP11Cqj/tables/tables_16_1.jpg", "caption": "Table 1: Single variable inference results. The reported values are the averages over 5 cross-validation folds. The corresponding sample standard deviations are reported in Appendix G.", "description": "This table presents the results of single variable inference experiments conducted on various datasets.  The performance of different models (XGBoost, RFDE, DEF (ISE), DEF (KL), and NRGBoost) is evaluated across several metrics: R-squared (R2), Area Under the Curve (AUC), and accuracy. The table shows the average performance across five cross-validation folds, and the standard deviations are provided in Appendix G for a more comprehensive understanding of the variability.", "section": "6.1 Single Variable Inference"}, {"figure_path": "ojFEP11Cqj/tables/tables_16_2.jpg", "caption": "Table 1: Single variable inference results. The reported values are the averages over 5 cross-validation folds. The corresponding sample standard deviations are reported in Appendix G.", "description": "This table presents the results of single variable inference experiments.  For each dataset and metric (R2, AUC, Accuracy), the average performance of different models (XGBoost, RFDE, DEF (ISE), DEF (KL), NRGBoost) is reported, based on 5-fold cross-validation.  The standard deviations of these averages can be found in Appendix G. The table shows how well each model can infer the value of a single target variable given the other input variables.", "section": "6.1 Single Variable Inference"}, {"figure_path": "ojFEP11Cqj/tables/tables_17_1.jpg", "caption": "Table 1: Single variable inference results. The reported values are the averages over 5 cross-validation folds. The corresponding sample standard deviations are reported in Appendix G.", "description": "This table presents the results of single-variable inference experiments, comparing the performance of NRGBoost with other methods.  The metrics used are R-squared (R2), Area Under the ROC Curve (AUC), and accuracy.  The results are averaged over 5 cross-validation folds, with standard deviations available in Appendix G. The table helps to demonstrate the effectiveness of NRGBoost for performing inference tasks, even when only a single variable is the target.", "section": "6.1 Single Variable Inference"}, {"figure_path": "ojFEP11Cqj/tables/tables_18_1.jpg", "caption": "Table 1: Single variable inference results. The reported values are the averages over 5 cross-validation folds. The corresponding sample standard deviations are reported in Appendix G.", "description": "This table presents the results of single variable inference experiments.  It shows the performance of different models (XGBoost, RFDE, DEF (ISE), DEF (KL), NRGBoost) on various datasets (AB, CH, PR, AD, MBNE, MNIST, CT) in terms of R-squared (R2), Area Under the Curve (AUC), and accuracy.  The values reported are averages across 5 cross-validation folds, with standard deviations available in Appendix G.  The table helps to assess the efficacy of the proposed NRGBoost method against existing approaches for generating accurate inferences on a single variable given others.", "section": "6.1 Single Variable Inference"}, {"figure_path": "ojFEP11Cqj/tables/tables_18_2.jpg", "caption": "Table 1: Single variable inference results. The reported values are the averages over 5 cross-validation folds. The corresponding sample standard deviations are reported in Appendix G.", "description": "This table presents the results of single variable inference experiments.  It shows the performance of different models (XGBoost, RFDE, DEF (ISE), DEF (KL), NRGBoost) on various datasets (AB, CH, PR, AD, MBNE, MNIST, CT) for R-squared, AUC, and accuracy.  The values reported are averages across 5-fold cross-validation, with standard deviations provided in Appendix G. This table demonstrates the generative models' capability in single-variable inference tasks compared to a strong discriminative model (XGBoost).", "section": "6.1 Single Variable Inference"}, {"figure_path": "ojFEP11Cqj/tables/tables_18_3.jpg", "caption": "Table 1: Single variable inference results. The reported values are the averages over 5 cross-validation folds. The corresponding sample standard deviations are reported in Appendix G.", "description": "This table presents the results of single variable inference experiments using different models.  It shows the R-squared (R2), Area Under the Curve (AUC), and accuracy achieved by several models (XGBoost, RFDE, DEF (ISE), DEF (KL), NRGBoost) on various datasets (AB, CH, PR, AD, MBNE, MNIST, CT). The results are averaged over 5 cross-validation folds to provide a robust estimate of the model performance.  Standard deviations are provided in Appendix G for a more complete statistical picture.", "section": "6.1 Single Variable Inference"}, {"figure_path": "ojFEP11Cqj/tables/tables_20_1.jpg", "caption": "Table 1: Single variable inference results. The reported values are the averages over 5 cross-validation folds. The corresponding sample standard deviations are reported in Appendix G.", "description": "This table presents the results of single variable inference experiments across six datasets (Abalone, California Housing, Physicochemical Properties of Protein, Adult, MiniBooNE, MNIST).  Five machine learning methods are compared: XGBoost, RFDE, DEF (ISE), DEF (KL), and NRGBoost.  The table shows the R-squared (R2), Area Under the Curve (AUC), and Accuracy for each method and dataset, demonstrating the performance of generative models on single-variable inference tasks.  Standard deviations are available in Appendix G.", "section": "6.1 Single Variable Inference"}, {"figure_path": "ojFEP11Cqj/tables/tables_20_2.jpg", "caption": "Table 1: Single variable inference results. The reported values are the averages over 5 cross-validation folds. The corresponding sample standard deviations are reported in Appendix G.", "description": "This table presents the results of single variable inference experiments.  The $R^2$, AUC, and Accuracy metrics are reported for different models (XGBoost, RFDE, DEF (ISE), DEF (KL), NRGBoost) across several datasets (AB, CH, PR, AD, MBNE, MNIST, CT). The values are averages from 5-fold cross validation, with standard deviations available in Appendix G. This section evaluates the ability of generative models, trained to learn the density over all input variables, to infer the value of a single variable.", "section": "6.1 Single Variable Inference"}, {"figure_path": "ojFEP11Cqj/tables/tables_20_3.jpg", "caption": "Table 12: Discriminator measure sample standard deviations.", "description": "This table shows the sample standard deviations for the AUC of an XGBoost model trained to distinguish real from generated data for different datasets and generative models. Lower values indicate better performance of the generative model in producing realistic samples.", "section": "6.2 Sampling"}, {"figure_path": "ojFEP11Cqj/tables/tables_21_1.jpg", "caption": "Table 1: Single variable inference results. The reported values are the averages over 5 cross-validation folds. The corresponding sample standard deviations are reported in Appendix G.", "description": "This table presents the results of single variable inference experiments using various models.  The R-squared (R2), Area Under the Curve (AUC), and accuracy metrics are reported for several datasets and models.  Each metric is averaged over 5 cross-validation folds, with the standard deviations available in Appendix G for a more comprehensive understanding.", "section": "6.1 Single Variable Inference"}]