[{"figure_path": "7WvwzuYkUq/tables/tables_2_1.jpg", "caption": "Table 1: Performance of PROGOT compared to baselines, w.r.t DɛD between source and target of the sci-Plex dataset. Reported numbers are the average of 5 runs, together with the standard error.", "description": "This table compares the performance of the proposed PROGOT algorithm against several baseline methods for estimating optimal transport maps on the sci-Plex single-cell RNA sequencing dataset.  The comparison is done using the Sinkhorn divergence (DɛD) as the evaluation metric, calculated with the ℓ2 transport cost. The table shows the average Sinkhorn divergence values and standard errors for each method across five different runs on data from three different cell lines treated with different drugs, at various dimensions (16, 64, 256).  The \"5-drug rank\" column indicates the relative performance of the methods across all five drugs considered.", "section": "5.1 PROGOT as a Map Estimator"}, {"figure_path": "7WvwzuYkUq/tables/tables_5_1.jpg", "caption": "Table 1: Performance of PROGOT compared to baselines, w.r.t DɛD between source and target of the sci-Plex dataset. Reported numbers are the average of 5 runs, together with the standard error.", "description": "This table compares the performance of the proposed PROGOT algorithm to several baseline methods for estimating optimal transport maps. The comparison is done using the Sinkhorn divergence (DɛD) as a metric, which measures the distance between two probability distributions. The sci-Plex dataset, a single-cell RNA sequencing dataset, is used for the evaluation.  The table shows the results for different dimensionality reduction methods (dPCA) and the different algorithms across various drugs, demonstrating PROGOT's improved performance.", "section": "5.1 PROGOT as a Map Estimator"}, {"figure_path": "7WvwzuYkUq/tables/tables_6_1.jpg", "caption": "Table 1: Performance of PROGOT compared to baselines, w.r.t D&D between source and target of the sci-Plex dataset. Reported numbers are the average of 5 runs, together with the standard error.", "description": "This table compares the performance of the proposed PROGOT algorithm against several baseline methods for single-cell RNA sequencing data.  The performance metric used is the Sinkhorn divergence (D&D), which measures the distance between the source and target distributions after applying the different transport methods. The table shows the average Sinkhorn divergence and its standard error for three different dimensionality reduction levels (d = 16, 64, 256) and five different drugs.  Lower values of D&D indicate better alignment between the source and target.", "section": "5.1 PROGOT as a Map Estimator"}, {"figure_path": "7WvwzuYkUq/tables/tables_8_1.jpg", "caption": "Table 1: Performance of PROGOT compared to baselines, w.r.t D&D between source and target of the sci-Plex dataset. Reported numbers are the average of 5 runs, together with the standard error.", "description": "This table compares the performance of the PROGOT algorithm to four other baseline algorithms for map estimation on the sci-Plex single-cell RNA sequencing dataset.  The performance is measured using the Sinkhorn divergence (D&D) between the source and target data, which quantifies the dissimilarity between the two distributions. The table shows the average Sinkhorn divergence and standard error for each algorithm across five different runs, for three different drug types and three dimensionality reduction values (dPCA).  Lower values indicate better performance.", "section": "5.1 PROGOT as a Map Estimator"}, {"figure_path": "7WvwzuYkUq/tables/tables_9_1.jpg", "caption": "Table 2: Coupling recovery, quantified as trace, and KL divergence from original identity matrix, for coupling matrices obtained with PROGOT and Sinkhorn, for coupling matrices obtained with PROGOT and Sinkhorn, for blur strengths σ = 2,4. PROGOT is run for K = 4 and with the constant-speed schedule.", "description": "This table shows the performance of PROGOT and Sinkhorn algorithms in recovering the original coupling matrix from blurred images.  The blur strength (sigma) is varied (2 and 4).  The metrics used are the trace of the recovered coupling matrix (Tr), the Kullback-Leibler (KL) divergence from the true identity matrix, and the number of iterations (# iters) required by each algorithm.  PROGOT uses K=4 iterations and a constant-speed schedule.", "section": "5.3 Scalability of PROGOT"}, {"figure_path": "7WvwzuYkUq/tables/tables_13_1.jpg", "caption": "Table 1: Performance of PROGOT compared to baselines, w.r.t D&D between source and target of the sci-Plex dataset. Reported numbers are the average of 5 runs, together with the standard error.", "description": "This table compares the performance of the PROGOT algorithm to other baseline methods for map estimation using the sci-Plex single-cell RNA sequencing dataset.  The performance metric is the Sinkhorn divergence (D&D) between the source and target point clouds after applying the different map estimation methods. The table shows results for three different drugs (Belinostat, Givinostat, Hesperadin) and different dimensionality reduction (PCA) parameters (d = 16, 64, 256).  The reported values are averages across 5 independent runs with standard errors.", "section": "5.1 PROGOT as a Map Estimator"}, {"figure_path": "7WvwzuYkUq/tables/tables_13_2.jpg", "caption": "Table 1: Performance of PROGOT compared to baselines, w.r.t D&D between source and target of the sci-Plex dataset. Reported numbers are the average of 5 runs, together with the standard error.", "description": "This table compares the performance of the PROGOT algorithm to several baseline methods on the sci-Plex single-cell RNA sequencing dataset.  The performance metric used is the Sinkhorn divergence (D&D), which measures the distance between two distributions. The table shows the average Sinkhorn divergence (and its standard error) for each algorithm across five runs for various dimensionality reduction techniques (d = 16, 64, and 256) and for five different drugs. Lower values indicate better performance in aligning source and target distributions.", "section": "5.1 PROGOT as a Map Estimator"}, {"figure_path": "7WvwzuYkUq/tables/tables_13_3.jpg", "caption": "Table 5: GMM benchmark. The Table shows the MSE, average of ||ŷitest||2 for ntest = 500 test points, where ŷ = T(xtest) and the ground truth is ytest.", "description": "This table presents the mean squared error (MSE) results for comparing different optimal transport map estimation methods on a Gaussian Mixture Model (GMM) benchmark dataset.  The MSE is calculated as the average of the squared Euclidean distances between estimated maps and ground truth maps for 500 test points.  Different algorithms, including PROGOT, EOT, Debiased EOT, Untuned EOT, Monge Gap and ICNN are evaluated for their map estimation accuracy, with results provided for two dimensions (d=128 and d=256).", "section": "5.1 PROGOT as a Map Estimator"}]