[{"figure_path": "Jzog9gvOf6/figures/figures_1_1.jpg", "caption": "Figure 1: An example of sparsely annotated objects in an aerial image. Here a small part of objects are annotated, e.g., large vehicles with the light blue, and small vehicles with the dark blue.", "description": "The figure shows a comparison between a global aerial image (a) and a local view of the same image (b) focusing on a sparsely annotated region.  The global view provides context, while the local view highlights the challenge of the sparsely annotated object detection (SAOD) task. Only a small subset of objects within the area of interest have been annotated, making it difficult for a model to learn effectively. Different colors represent different types of vehicles.", "section": "1 Introduction"}, {"figure_path": "Jzog9gvOf6/figures/figures_8_1.jpg", "caption": "Figure 2: Performance comparisons of different reward settings at various label rates on the DOTA dataset.", "description": "This figure displays the performance comparison of different reward settings at various label rates on the DOTA dataset.  The reward settings include a baseline, adding information entropy (IE), adding confidence margin (CM), adding both IE and CM, and adding IE, CM, and value binarization (VB). The label rates are 1%, 2%, 5%, and 10%. The performance is measured as mAP (mean Average Precision). The bars show that the addition of IE, CM, and VB improves the performance consistently across different label rates.", "section": "4.3 Ablation study"}, {"figure_path": "Jzog9gvOf6/figures/figures_8_2.jpg", "caption": "Figure 3: Loss curves of conformal pseudo-label explorer and multi-clue selection evaluator under different action spaces at the 1% label rate on the DOTA dataset.", "description": "This figure shows the training loss curves for both the conformal pseudo-label explorer and the multi-clue selection evaluator.  Two different action space sizes (ASS=1 and ASS=2) are compared.  The x-axis represents the training epoch, and the y-axis shows the loss value. The plot demonstrates that with the larger action space (ASS=2), both components converge faster and reach lower loss values, suggesting improved performance with this configuration in the sparsely annotated aerial object detection task.", "section": "4.3 Ablation study"}, {"figure_path": "Jzog9gvOf6/figures/figures_13_1.jpg", "caption": "Figure 4: Some visualized detection results at the 10% label rate. From left to right, each column shows the results of the ground truth, supervised baseline (ReDet), Region-based, and our PECL. From top to bottom, each row represents the results of OBB task on DOTA dataset, HBB task on DOTA dataset, and OBB task on HRSC2016 dataset. The colored rectangles represent predictions. The red dashed circles and the solid red circles indicate false and missed detections, respectively.", "description": "This figure shows a qualitative comparison of object detection results on three datasets (DOTA OBB, DOTA HBB, and HRSC2016 OBB) using four different methods: ground truth, ReDet (baseline), Region-based, and the proposed PECL method.  The visualization highlights the improved accuracy and precision of the PECL method, particularly in detecting smaller objects.  Each row shows results from a different dataset, while each column represents a different method, allowing for easy comparison of the performance.", "section": "4.2 Experimental results"}]