[{"figure_path": "aIuByRyHhV/tables/tables_3_1.jpg", "caption": "Table 1: Statistics of molecules. n, k, dk is the number of orbitals, electrons, and HWP subspace dimension respectively.", "description": "This table shows the number of orbitals (n), electrons (k), and the dimension of the Hamming Weight Preserving (HWP) subspace (dk) for three different molecules: Hydrogen (H2), Lithium Hydride (LiH), and Water (H2O).  These values are used in the simulated experiments on state preparation in the paper.", "section": "2.3 Simulated Experiments on State Preparation"}, {"figure_path": "aIuByRyHhV/tables/tables_4_1.jpg", "caption": "Table 2: Numerical results for state preparation. \"Error\" stands for the energy error with respect to FCI energy, \"prob\" represents the success rate in SV and PC, \"SE\" stands for value less than 10⁻¹⁰.", "description": "This table presents the numerical results for the ground state energy estimation of three molecules (H₂, LiH, and H₂O) using different methods: UCC with single, double, and triple excitations; and the proposed HWP ansatz with and without parity checks.  For each method and molecule, the table shows the energy error relative to the Full Configuration Interaction (FCI) energy, the success probability of symmetry verification (SV), and the success probability of parity check (PC). The 'SE' values represent energy errors smaller than 10⁻¹⁰. The results illustrate the impact of noise on the accuracy of each method and the effectiveness of parity checks in mitigating errors.", "section": "2.3 Simulated Experiments on State Preparation"}, {"figure_path": "aIuByRyHhV/tables/tables_6_1.jpg", "caption": "Table 3: Results on QAP simulation with the best in bold and the best in soft constraints underlined.", "description": "This table presents the results of QAP simulations, comparing various methods with both soft and hard constraints.  The \"CONSTRAINT\" column indicates whether soft or hard constraints were used. The \"METHOD\" column lists different optimization algorithms. The \"dim\" column shows the dimension of the search space for each method.  The η values represent the approximation ratio (how close the solution is to the optimal one), while Poptimal is the probability of obtaining the optimal solution. Results for different problem sizes (m=3,4,5,6) are shown, highlighting the best-performing methods in each category.", "section": "3 Parity Check as Further Constraints for QAP"}, {"figure_path": "aIuByRyHhV/tables/tables_7_1.jpg", "caption": "Table 2: Numerical results for state preparation. \"Error\" stands for the energy error with respect to FCI energy, \"prob\" represents the success rate in SV and PC, \"SE\" stands for value less than 10⁻¹⁰.", "description": "This table presents the numerical results of state preparation experiments using different methods (UCCS, UCCSD, UCCSDT, and the proposed method) under both noiseless and noisy conditions. It compares the energy errors, success probabilities of symmetry verification (SV) and parity checks (PC), and the final energies obtained. The results are shown for three molecules: H2, LiH, and H2O.", "section": "2.3 Simulated Experiments on State Preparation"}, {"figure_path": "aIuByRyHhV/tables/tables_19_1.jpg", "caption": "Table 2: Numerical results for state preparation. \"Error\" stands for the energy error with respect to FCI energy, \"prob\" represents the success rate in SV and PC, \"SE\" stands for value less than 10⁻¹⁰.", "description": "This table presents the numerical results for the ground state energy estimation task on three molecules (H2, LiH, and H2O).  It compares the performance of various methods: UCC with different excitation levels, and the proposed HWP ansatz with and without parity checks (PC). The 'Error' column shows the energy error relative to the exact Full Configuration Interaction (FCI) energy. The 'Prob' column indicates the success rate of symmetry verification (SV) and parity check methods, and 'SE' represents values below a threshold of 10⁻¹⁰. This table demonstrates the impact of parity checks on error mitigation and the overall accuracy of the HWP ansatz, especially in noisy conditions.", "section": "2.3 Simulated Experiments on State Preparation"}, {"figure_path": "aIuByRyHhV/tables/tables_19_2.jpg", "caption": "Table 2: Numerical results for state preparation. \"Error\" stands for the energy error with respect to FCI energy, \"prob\" represents the success rate in SV and PC, \"SE\" stands for value less than 10⁻¹⁰.", "description": "This table presents the numerical results for the ground state energy estimation using different methods.  The \"Error\" column shows the energy error compared to the Full Configuration Interaction (FCI) method, which is the most accurate method for calculating ground state energy. The \"prob\" column shows the success rate of the Symmetry Verification (SV) and Parity Check (PC) methods for error mitigation.  \"SE\" indicates that the energy error is less than 10⁻¹⁰.", "section": "2.3 Simulated Experiments on State Preparation"}, {"figure_path": "aIuByRyHhV/tables/tables_20_1.jpg", "caption": "Table 7: Sensitivity analysis on the number of parity checks for the proposed HWP ansatz. The best results are in bold.", "description": "This table presents the results of a sensitivity analysis conducted to determine the optimal number of parity checks to use with the Hamming Weight Preserving (HWP) ansatz. The analysis was performed using different numbers of parity checks (num_PC) for the LiH and H2O molecules. The results are presented in terms of the energy error.  The best performance, indicated by the lowest energy error, is highlighted in bold for each molecule, allowing for a determination of the optimal number of parity checks to balance error mitigation and computational cost.", "section": "2 Parity Check as Error Mitigation for HWP"}, {"figure_path": "aIuByRyHhV/tables/tables_20_2.jpg", "caption": "Table 8: Statistics for UCC and proposed HWP ansatze.", "description": "This table presents a comparison of the proposed HWP ansatz with UCC ansatze (UCCS, UCCSD, UCCSDT) across three molecules (H2, LiH, H2O). For each ansatz and molecule, it provides the number of gates, the number of CNOT gates, and the number of parameters.  The data illustrates the computational cost associated with each approach and the trade-off between accuracy and resource consumption.", "section": "2.2 HWP ansatz for Quantum Chemistry"}, {"figure_path": "aIuByRyHhV/tables/tables_21_1.jpg", "caption": "Table 3: Results on QAP simulation with the best in bold and the best in soft constraints underlined.", "description": "This table presents the results of QAP simulations using various methods, comparing performance with and without hard constraints.  The \"dim\" column shows the dimensionality of the solution space explored by each method.  The η values represent the approximation ratio, indicating how close the solution is to the optimal solution. Poptimal represents the probability of obtaining the optimal solution.  The table highlights the superior performance of methods incorporating hard constraints, particularly the NBS-HARD method, which consistently achieves higher η and Poptimal values across different problem sizes (m). The soft-constraint methods are underlined for easy comparison.", "section": "3 Parity Check as Further Constraints for QAP"}]