[{"figure_path": "J8m0DEjxEO/tables/tables_3_1.jpg", "caption": "Table 1: We present Attack Success Rates (ASR) measured by both GPT-4 (GPT-4 judge) and the keyword detection technique (keyword-detection). The ASR changes of AttnGCG relative to GCG are marked in red.", "description": "This table presents the attack success rates (ASR) achieved by both GCG and AttnGCG methods across different LLMs.  The ASR is measured using two methods: GPT-4 as a judge, and a keyword detection technique.  The table shows the ASR for each model and method and highlights the improvement in ASR that AttnGCG provides compared to GCG.", "section": "3.1 Experimental Setups"}, {"figure_path": "J8m0DEjxEO/tables/tables_4_1.jpg", "caption": "Table 1: We present Attack Success Rates (ASR) measured by both GPT-4 (GPT-4 judge) and the keyword detection technique (keyword-detection). The ASR changes of AttnGCG relative to GCG are marked in red.", "description": "This table presents the attack success rates (ASR) achieved by both the Greedy Coordinate Gradient (GCG) method and the proposed AttnGCG method across various language models.  The ASR is evaluated using two different metrics: GPT-4 judge (human evaluation) and keyword-detection (automatic keyword-based evaluation).  The table highlights the improvement achieved by AttnGCG over GCG for each language model and the average improvement across all models. Red values indicate the improvement from GCG to AttnGCG.", "section": "3.1 Experimental Setups"}, {"figure_path": "J8m0DEjxEO/tables/tables_5_1.jpg", "caption": "Table 2: Goal attention scores of optimization-based methods. 'Init' represents the initial attention score of the input sequence.", "description": "This table presents the average attention scores focused on the goal part of the input prompt during the jailbreaking process.  The scores are shown for three different scenarios: the initial score before any optimization, after optimization using the Greedy Coordinate Gradient (GCG) method, and after optimization using the proposed AttnGCG method.  Lower scores indicate less attention on the goal, suggesting a more successful jailbreak.", "section": "3.2 Base Experiments on GCG and AttnGCG"}, {"figure_path": "J8m0DEjxEO/tables/tables_5_2.jpg", "caption": "Table 3: Goal attention scores of two additional attack methods. 'Vanilla' stands for the score of feeding only the goal into LLM.", "description": "This table presents the goal attention scores obtained from three different methods: Vanilla, ICA [30], and AutoDAN [19].  The 'Vanilla' score represents the attention given to the goal when only the goal is input to the LLM.  The other two scores show the attention the models give to the goal after optimizing prompts with the corresponding methods.  The lower the score, the less attention given to the goal, which implies a more successful jailbreaking attack.", "section": "3.3 Generalize AttnGCG to other attack methods"}, {"figure_path": "J8m0DEjxEO/tables/tables_6_1.jpg", "caption": "Table 1: We present Attack Success Rates (ASR) measured by both GPT-4 (GPT-4 judge) and the keyword detection technique (keyword-detection). The ASR changes of AttnGCG relative to GCG are marked in red.", "description": "This table presents the attack success rates (ASR) for several language models using two evaluation methods: GPT-4 judge and keyword detection.  The ASR is shown for both the Greedy Coordinate Gradient (GCG) method and the proposed AttnGCG method. The difference in ASR between AttnGCG and GCG is highlighted in red, indicating the improvement achieved by AttnGCG.", "section": "3.1 Experimental Setups"}, {"figure_path": "J8m0DEjxEO/tables/tables_7_1.jpg", "caption": "Table 1: We present Attack Success Rates (ASR) measured by both GPT-4 (GPT-4 judge) and the keyword detection technique (keyword-detection). The ASR changes of AttnGCG relative to GCG are marked in red.", "description": "This table presents the attack success rates (ASR) achieved by both the Greedy Coordinate Gradient (GCG) method and the proposed AttnGCG method on various language models.  The ASR is evaluated using two different metrics: a GPT-4 judge and a keyword detection technique.  The table highlights the improvement in ASR provided by AttnGCG over GCG for each model, indicating the effectiveness of the proposed attention manipulation strategy.", "section": "3.1 Experimental Setups"}, {"figure_path": "J8m0DEjxEO/tables/tables_12_1.jpg", "caption": "Table 1: We present Attack Success Rates (ASR) measured by both GPT-4 (GPT-4 judge) and the keyword detection technique (keyword-detection). The ASR changes of AttnGCG relative to GCG are marked in red.", "description": "This table presents the attack success rates (ASR) achieved by both the original Greedy Coordinate Gradient (GCG) method and the enhanced AttnGCG method on various language models.  The ASR is measured using two different evaluation methods: GPT-4 as a judge and a keyword-detection technique. The table shows the ASR for each model and method, with the improvement of AttnGCG over GCG highlighted in red.", "section": "3.1 Experimental Setups"}, {"figure_path": "J8m0DEjxEO/tables/tables_12_2.jpg", "caption": "Table 1: We present Attack Success Rates (ASR) measured by both GPT-4 (GPT-4 judge) and the keyword detection technique (keyword-detection). The ASR changes of AttnGCG relative to GCG are marked in red.", "description": "This table presents the attack success rates (ASR) achieved by both the original Greedy Coordinate Gradient (GCG) method and the proposed AttnGCG method on several language models.  The ASR is measured using two different evaluation metrics: GPT-4 judge (human evaluation using GPT-4) and keyword detection (automatic detection based on keywords).  The table shows the ASR for each model and metric for both methods, highlighting the improvement provided by AttnGCG in red.", "section": "3.1 Experimental Setups"}, {"figure_path": "J8m0DEjxEO/tables/tables_12_3.jpg", "caption": "Table 1: We present Attack Success Rates (ASR) measured by both GPT-4 (GPT-4 judge) and the keyword detection technique (keyword-detection). The ASR changes of AttnGCG relative to GCG are marked in red.", "description": "This table presents the attack success rates (ASR) achieved by both the original Greedy Coordinate Gradient (GCG) method and the enhanced AttnGCG method on various large language models (LLMs).  The ASR is measured using two different methods:  GPT-4 (a large language model acting as a judge) and a keyword detection technique. The table shows the ASR for each model and method, highlighting the improvement gained by AttnGCG over GCG in red.", "section": "3.1 Experimental Setups"}, {"figure_path": "J8m0DEjxEO/tables/tables_13_1.jpg", "caption": "Table 11: Supplementary experimental results on Vicuna for Table 1. We present Attack Success Rates(ASR) measured using both GPT-4 as the semantic judge(GPT-4 judge) and the ASR measurement method introduced in GCG(keyword-detection). The ASR changes of AttnGCG relative to GCG are indicated in parentheses.", "description": "This table presents supplementary experimental results evaluating the performance of GCG and AttnGCG on Vicuna models (7B and 13B).  It shows the attack success rates (ASR) measured using two methods: GPT-4 as a judge and a keyword-detection technique.  The changes in ASR from GCG to AttnGCG are highlighted, indicating the improvement achieved by AttnGCG.", "section": "3.1 Experimental Setups"}, {"figure_path": "J8m0DEjxEO/tables/tables_13_2.jpg", "caption": "Table 1: We present Attack Success Rates (ASR) measured by both GPT-4 (GPT-4 judge) and the keyword detection technique (keyword-detection). The ASR changes of AttnGCG relative to GCG are marked in red.", "description": "This table presents the attack success rates (ASR) achieved by both the original GCG method and the enhanced AttnGCG method across various LLMs.  The ASR is measured using two different evaluation methods: GPT-4 judge (human evaluation by GPT-4) and keyword detection (automated detection based on keywords). The table shows the ASR for each model and evaluation method, highlighting the improvement achieved by AttnGCG compared to GCG using red coloring to emphasize the difference.", "section": "3.1 Experimental Setups"}, {"figure_path": "J8m0DEjxEO/tables/tables_14_1.jpg", "caption": "Table 1: We present Attack Success Rates (ASR) measured by both GPT-4 (GPT-4 judge) and the keyword detection technique (keyword-detection). The ASR changes of AttnGCG relative to GCG are marked in red.", "description": "This table presents the attack success rates (ASR) achieved by both the original GCG method and the enhanced AttnGCG method across several large language models (LLMs).  The ASR is measured using two metrics: GPT-4 judge (a human evaluation by GPT-4) and keyword-detection (automatic detection of keywords associated with harmful outputs).  For each model, the table shows the ASR for both methods and highlights the percentage increase or decrease in ASR achieved by AttnGCG compared to GCG.  The differences, indicating improvement in ASR by using AttnGCG, are shown in red. The results highlight the consistent performance enhancement achieved by the proposed AttnGCG across diverse LLMs.", "section": "3.1 Experimental Setups"}]