[{"figure_path": "Hlcek7AYgP/figures/figures_1_1.jpg", "caption": "Figure 1: a Top: Hand velocities of X-Y coordinates across three trials. Note that the distribution of velocities is highly imbalanced, with many near-zero values. Bottom: Real (X-axis) versus predicted (Y-axis) Y-coordinate hand velocities using a linear regressor. The predicted velocities in CEBRA are much smaller than those in NER, as CEBRA mispredicts infrequent large velocities as frequent small velocities. b Batch size is three (in real experiments, it is 512), with two batches (one for vi and one for vj and vk) combined in NER. Both models use embeddings within a specific time offset (e.g., 10 ms) of the anchor as the augmented embedding, which shares the same label/color as the anchor.", "description": "Figure 1 demonstrates the difference in performance between the Neural Embeddings Rank (NER) method and the Contrastive Embedding Ranking with Balanced Anchors (CEBRA) method in predicting hand velocities.  Panel (a) shows that CEBRA struggles to predict infrequent, large velocity values, misrepresenting them as small values, while NER demonstrates significantly better accuracy.  Panel (b) illustrates how NER processes paired neural embeddings, ranking them according to their continuous labels (movement parameters) to align latent dynamics with movements, unlike CEBRA which contrasts samples as discrete classes, thus addressing the class imbalance problem.", "section": "1 Introduction"}, {"figure_path": "Hlcek7AYgP/figures/figures_2_1.jpg", "caption": "Figure 2: NER aligns 3D latent dynamics with movements and enabling cross sessions movement decoding. a Top: The monkey performs a center-out reaching task in eight directions using a planar manipulandum. Hand velocity is computed from hand position. Bottom: The monkey moves the cursor to outer targets to receive rewards (image from [23]). b Top: Neural dynamics are recorded using a 96-channel Utah array in two monkeys. Monkey C has implants in the M1 of the right hemisphere first and in M1 and PMd of the left hemisphere second. Monkey L has an implant in area 2 of the S1 of the left hemisphere (image from brainmuseum.org). During the task, all monkeys use the hand contralateral to the implanted hemisphere. Bottom: Spiking activities from multiple neurons (44 to 211) are recorded during multiple trials (168 to 1038) of the behavioral task. Dimensionality reduction reduces 200-dimensional neural dynamics to 3D latent dynamics. c Top: Neural dynamics from 190 dimensions (neurons) in the PMd are reduced to 3D latent dynamics. Bottom: Trial-averaged latent dynamics. Data is from Monkey C (date: 2016-10-14). d Top: Linear and logistic regression decoders are trained on the same independent variables (latent dynamics) but different dependent variables (hand velocities and directions) using 80% of train data. Bottom: The trained decoder from 80% of train data is used to predict movements on the 20% held-out test data. The model trained on one day predicts movements across one year, in the contralateral M1, and ipsilateral PMd. e Top: Two linear decoders trained from c decode hand velocities (positions) and directions with R-squared accuracy of 86% (96%) and peak accuracy of 97%, respectively, on the 20% held-out test data. Bottom: Decoders trained on the same day (diagonal) have much better decoding performance than models trained on different conditions (off-diagonal) using previous dimensionality reduction methods, whereas our method has higher and consistent decoding performance.", "description": "This figure demonstrates the Neural Embeddings Rank (NER) method's ability to align 3D latent neural dynamics with hand movements in a center-out reaching task.  It shows how NER processes neural data from three cortical areas (M1, PMd, S1) across multiple sessions and monkeys, reducing high-dimensional neural activity to a 3D latent space that accurately reflects hand position, direction, and velocity. The figure highlights NER's superior performance in cross-session and cross-area decoding compared to other dimensionality reduction techniques.", "section": "4 Results"}, {"figure_path": "Hlcek7AYgP/figures/figures_5_1.jpg", "caption": "Figure 4: Explained variance of movements in M1, PMd, and S1. a Left: Hand movement trajectories. Right: Predicted trajectories by two decoders. Data collected from PMd on 2016-10-14. The explained variance for velocities and positions is 90% and 98%, respectively. b Hand direction classification accuracy using a logistic regression decoder. Shaded areas represent the standard deviation across six sessions from M1. c Explained variance of hand velocities using a linear regression decoder on latent dynamics revealed by five dimensionality reduction methods (indicated by different colors and shapes). The X-axis shows session dates. Left: Ten sessions from the M1 of Monkey C. Right: Six sessions from PMd of Monkey C and four sessions from S1 of Monkey H. d Similar to c but for hand positions. Fig. 13 provides the direction tuning curve in PMd, the correlation between tuning curves and velocities, and explained variance for directions.", "description": "This figure demonstrates the performance of NER in explaining the variance of hand movements (velocities and positions) using linear regression decoders trained on latent dynamics from different dimensionality reduction methods.  Panel (a) shows an example of ground truth vs. predicted hand movement trajectories. Panel (b) displays hand direction classification accuracy over time. Panels (c) and (d) show the explained variance in hand velocities and positions, respectively, across multiple sessions and brain areas (M1, PMd, S1). The results highlight NER's superior performance in explaining variance compared to other methods.", "section": "4.2 Explained variance of movements using linear decoders in M1, PMd, and S1"}, {"figure_path": "Hlcek7AYgP/figures/figures_6_1.jpg", "caption": "Figure 5: Decoding within and across time and brain hemispheres over years in M1. a-d Three methods are applied to neural dynamics from ten sessions. Linear and logistic regression decoders (a, c, e) or a nonlinear k-nearest neighbors (kNN) decoder (b, d, f) are trained on 80% of the data and used to decode velocities, positions, and directions on the remaining 20% within-session (diagonal) and cross-session (off-diagonal). Brighter colors indicate higher decoding performance. a Same-session, cross-session, and cross-hemisphere velocity decoding using a linear regression decoder. b Similar to a but using the nonlinear kNN decoder. Note that CEBRA's latent dynamics are represented in sixteen dimensions instead of three. c-d Similar to a-b but with hand positions as the decoding variable. e-f Similar to a-b but with hand directions as the decoding variable.", "description": "This figure demonstrates the performance of NER, CEBRA, and piVAE in decoding hand movements (velocities, positions, and directions) within and across sessions, hemispheres, and years.  It shows that NER consistently outperforms other methods, especially in cross-session decoding, highlighting its ability to capture consistent latent dynamics across time and brain regions.", "section": "4.3 Long-term and cross-hemisphere decoding in M1"}, {"figure_path": "Hlcek7AYgP/figures/figures_7_1.jpg", "caption": "Figure 5: Decoding within and across time and brain hemispheres over years in M1. a-d Three methods are applied to neural dynamics from ten sessions. Linear and logistic regression decoders (a, c, e) or a nonlinear k-nearest neighbors (kNN) decoder (b, d, f) are trained on 80% of the data and used to decode velocities, positions, and directions on the remaining 20% within-session (diagonal) and cross-session (off-diagonal). Brighter colors indicate higher decoding performance. a Same-session, cross-session, and cross-hemisphere velocity decoding using a linear regression decoder. b Similar to a but using the nonlinear kNN decoder. Note that CEBRA's latent dynamics are represented in sixteen dimensions instead of three. c-d Similar to a-b but with hand positions as the decoding variable. e-f Similar to a-b but with hand directions as the decoding variable.", "description": "This figure demonstrates the long-term and cross-hemisphere decoding performance of three dimensionality reduction methods (NER, CEBRA, and piVAE) in the M1 brain region. Linear and k-nearest neighbors decoders were used to predict hand velocities, positions, and directions. The results show NER's superior and consistent performance across different sessions, brain hemispheres, and time periods, highlighting its robustness and potential for brain-machine interfaces.", "section": "4.3 Long-term and cross-hemisphere decoding in M1"}, {"figure_path": "Hlcek7AYgP/figures/figures_8_1.jpg", "caption": "Figure 7: Distinct latent dynamics with the same movement in S1. a Trial-averaged latent dynamics revealed by NER, using the same reference target session as in Fig. 3. b Latent dynamics with the reference target set to the first session in S1. c Left: On 80% held-in trials, the explained variance by linear and logistic regression decoders is 91% and 97%, respectively. Right: On 20% held-out test trials, the trained linear decoder predicts velocities and positions with performances of 71% and 90%, respectively. Data collected on 2017-12-01. d Same- and cross-date velocity decoding performance using the linear regression decoder with three dimensionality reduction methods. e Similar to d but for positions. Fig. 16 shows latent dynamics revealed by CEBRA and piVAE.", "description": "Figure 7 presents the results of applying NER, CEBRA and piVAE to neural data from the somatosensory cortex (S1).  The figure shows that NER produces consistent and distinct latent dynamics across multiple sessions, which accurately reflect the movements performed by the monkey. Linear decoders trained on the NER latent dynamics achieve high accuracy in predicting velocities and positions even when tested on held-out data from different sessions.  In contrast, CEBRA and piVAE fail to show such consistent alignment between latent dynamics and movements.", "section": "4.2 Explained variance of movements using linear decoders in M1, PMd, and S1"}, {"figure_path": "Hlcek7AYgP/figures/figures_9_1.jpg", "caption": "Figure 8: Distinct latent dynamics align with different movements in M1. a A monkey performs a curved reaching task through a virtual maze while neural activity from M1 is recorded simultaneously. The task includes multiple reaching directions, and the monkey makes curved movements when encountering a barrier on the trajectory (reproduced from [22]). b Hand positions for six target directions without barriers (i.e., straight movements). c Latent dynamics from a single trial (left) and averaged across trials (right). d Explained variance of hand movements (velocity: 0.79, position: 0.92). Hand directions (represented by colors) are assigned manually. e Hand movements for three target directions, both without barriers (straight movements) and with barriers (curved movements). f Latent dynamics of curved (stars) and straight (dots with black line) hand movements shown separately and combined across directions. g Hand movements for three target directions, all with barriers (curved movements). h Latent dynamics trained on one pair (1st) or three pairs (3rd) of curved movements, with decoder-explained hand movements (2nd and 4th). Fig. 17 provides a comparison of results with CEBRA.", "description": "This figure shows how the NER algorithm captures the different latent dynamics associated with straight versus curved hand movements in a monkey performing a virtual maze task.  Panels (a-d) illustrate the experimental setup and results for straight movements. Panels (e-h) demonstrate how the NER model distinguishes between straight and curved movements, even when combined, highlighting its ability to represent complex movement patterns in a low-dimensional space.  The results from the CEBRA algorithm are compared in Fig 17 for context.", "section": "4.6 Straight and curved hand movements have different latent dynamics in M1"}, {"figure_path": "Hlcek7AYgP/figures/figures_15_1.jpg", "caption": "Figure 9: NER reveals consistent and movements aligned latent dynamics in M1 for the remaining four sessions. Extra four sessions' latent dynamics at left and right hemisphere of Monkey C after rotating relative to target session in Fig 3 (2016-10-14).", "description": "This figure shows the latent dynamics in M1 for four additional sessions of data from Monkey C, using the NER method.  It demonstrates the consistency of the latent dynamics revealed by NER across different recording sessions, even those separated by a year. The latent dynamics are visualized in 3D and color-coded to represent the direction of hand movement. The top row shows the trial-averaged latent dynamics, while the bottom row shows individual trials.  By comparing these visualizations to those from Figure 3, we can see how NER maintains consistent alignment between latent dynamics and movements over time.", "section": "4.1 Movement-aligned latent dynamics were consistent over years in M1"}, {"figure_path": "Hlcek7AYgP/figures/figures_16_1.jpg", "caption": "Figure 9: NER reveals consistent and movements aligned latent dynamics in M1 for the remaining four sessions. Extra four sessions' latent dynamics at left and right hemisphere of Monkey C after rotating relative to target session in Fig 3 (2016-10-14).", "description": "This figure shows the results of applying NER, Cebra, and piVAE dimensionality reduction methods to neural data from additional sessions of monkey M1 recordings.  The latent dynamics are visualized across multiple sessions, demonstrating the consistent and movement-aligned patterns revealed by NER over time and across brain hemispheres.  In contrast, Cebra and piVAE show less consistent and less clearly movement-aligned results.", "section": "4.1 Movement-aligned latent dynamics were consistent over years in M1"}, {"figure_path": "Hlcek7AYgP/figures/figures_16_2.jpg", "caption": "Figure 9: NER reveals consistent and movements aligned latent dynamics in M1 for the remaining four sessions. Extra four sessions' latent dynamics at left and right hemisphere of Monkey C after rotating relative to target session in Fig 3 (2016-10-14).", "description": "This figure shows the latent dynamics for four additional sessions of data from monkey C in M1.  It compares the results using NER to those of CEBRA and piVAE.  The consistent, movement-aligned latent dynamics revealed by NER are highlighted, showing that even across a year and between hemispheres, the method maintains its ability to align latent dynamics with movements. CEBRA and piVAE show less consistent results.", "section": "4.1 Movement-aligned latent dynamics were consistent over years in M1"}, {"figure_path": "Hlcek7AYgP/figures/figures_17_1.jpg", "caption": "Figure 12: Mixed single trial latent dynamics in PCA and time-stimulus components revealed by dPCA. a Unlike other five dimensionality reduction methods, single trial latent dynamics revealed by principal component analysis (PCA) and demixed PCA (dPCA) is mixed and latency dynamics are only identifiable after averaging. b In the trial-averaged latent dynamics, dPCA reveals three components (left, middle, right) at eight directions (different colors): time component aligned with go cue regardless of directions, separated stimulus component varied across time, and mixed component aligned with go cue and different for each direction.", "description": "This figure shows a comparison of single-trial and trial-averaged latent dynamics obtained using PCA and dPCA.  It highlights that unlike other dimensionality reduction methods, PCA and dPCA produce mixed latent dynamics where individual trials aren't clearly separated, and only the averages reveal distinct patterns.  The trial-averaged results from dPCA are further decomposed into three components: a time component associated with the go cue (consistent across directions), a stimulus component varying over time and direction, and a mixed component combining aspects of time and stimulus.", "section": "4.1 Movement-aligned latent dynamics were consistent over years in M1"}, {"figure_path": "Hlcek7AYgP/figures/figures_18_1.jpg", "caption": "Figure 13: Hand directions tunings and explained peak classification accuracy of hand directions in M1, PMd, and S1. a Hand directions explained accuracy using a logistic regression models trained on the latent dynamics revealed by five dimensionality reduction methods. Shaded areas are standard deviation over six sessions from PMd in the Monkey C. Notice the only NER reveal hand velocities dependent direction tuning curves that peak around 500 ms. b Correlation coefficients matrix between direction tuning curves and velocities in M1 (left) and PMd (right). c Explained variance on hand directions using logistic regression decoder.", "description": "This figure demonstrates the results of applying five dimensionality reduction methods (NER, CEBRA, piVAE, UMAP with/without labels) to decode hand directions.  Panel (a) shows the accuracy of hand direction classification over time (from go cue), highlighting that NER peaks around 500ms, while other methods have lower and less focused peaks. Panel (b) presents correlation matrices showing the relationship between direction tuning curves and hand velocities in M1 and PMd, demonstrating that NER's latent dynamics show a stronger correlation than others. Panel (c) displays the explained variance of hand directions by different methods, indicating NER's superior performance in explaining hand direction variance in all three brain regions.", "section": "4.2 Explained variance of movements using linear decoders in M1, PMd, and S1"}, {"figure_path": "Hlcek7AYgP/figures/figures_18_2.jpg", "caption": "Figure 3: NER reveals consistent, movement-aligned latent dynamics in M1. a Single-trial (top) and averaged (bottom) latent dynamics from six sessions across one year in two hemispheres. Latent dynamics are rotated with reference to the 2016-10-14 session, using one of the eight reaching directions. b-c Similar to a but using CEBRA and piVAE. Fig. 9 shows the latent dynamics from the remaining four sessions for the same monkey. Fig. 10 displays single-trial and/or averaged latent dynamics revealed by five other methods. Fig. 11 shows trial-averaged latent dynamics before rotation. Fig. 12 presents the entangled neural embeddings using PCA and the time-stimulus components revealed by dPCA.", "description": "This figure demonstrates the consistent and movement-aligned latent dynamics revealed by NER (Neural Embeddings Rank) in the primary motor cortex (M1) across multiple sessions over a year.  It compares NER's performance to CEBRA and piVAE, showing that NER's latent dynamics consistently align with hand movements, even when sessions are separated by a year. Other dimensionality reduction methods (shown in supplementary figures) failed to reveal the same consistent alignment.", "section": "4.1 Movement-aligned latent dynamics were consistent over years in M1"}, {"figure_path": "Hlcek7AYgP/figures/figures_18_3.jpg", "caption": "Figure 3: NER reveals consistent, movement-aligned latent dynamics in M1. a Single-trial (top) and averaged (bottom) latent dynamics from six sessions across one year in two hemispheres. Latent dynamics are rotated with reference to the 2016-10-14 session, using one of the eight reaching directions. b-c Similar to a but using CEBRA and piVAE. Fig. 9 shows the latent dynamics from the remaining four sessions for the same monkey. Fig. 10 displays single-trial and/or averaged latent dynamics revealed by five other methods. Fig. 11 shows trial-averaged latent dynamics before rotation. Fig. 12 presents the entangled neural embeddings using PCA and the time-stimulus components revealed by dPCA.", "description": "This figure shows the consistent movement-aligned latent dynamics revealed by NER across multiple sessions over a year in the primary motor cortex (M1). It compares NER's performance with CEBRA and piVAE, highlighting NER's ability to reveal consistent latent dynamics across different sessions and hemispheres. The figure also includes results from five other dimensionality reduction methods for comparison.", "section": "4.1 Movement-aligned latent dynamics were consistent over years in M1"}, {"figure_path": "Hlcek7AYgP/figures/figures_19_1.jpg", "caption": "Figure 9: NER reveals consistent and movements aligned latent dynamics in M1 for the remaining four sessions. Extra four sessions’ latent dynamics at left and right hemisphere of Monkey C after rotating relative to target session in Fig 3 (2016-10-14).", "description": "This figure shows the results of applying NER, CEBRA, and piVAE to extract latent dynamics from M1 neural recordings across multiple sessions. The top row displays single-trial and trial-averaged latent dynamics using NER. The next two rows present the same analysis for CEBRA and piVAE, respectively.  The consistent movement-aligned latent dynamics revealed by NER across sessions highlight its effectiveness in capturing neural dynamics related to movements.", "section": "4.1 Movement-aligned latent dynamics were consistent over years in M1"}, {"figure_path": "Hlcek7AYgP/figures/figures_19_2.jpg", "caption": "Figure 5: Decoding within and across time and brain hemispheres over years in M1. a-d Three methods are applied to neural dynamics from ten sessions. Linear and logistic regression decoders (a, c, e) or a nonlinear k-nearest neighbors (kNN) decoder (b, d, f) are trained on 80% of the data and used to decode velocities, positions, and directions on the remaining 20% within-session (diagonal) and cross-session (off-diagonal). Brighter colors indicate higher decoding performance. a Same-session, cross-session, and cross-hemisphere velocity decoding using a linear regression decoder. b Similar to a but using the nonlinear kNN decoder. Note that CEBRA's latent dynamics are represented in sixteen dimensions instead of three. c-d Similar to a-b but with hand positions as the decoding variable. e-f Similar to a-b but with hand directions as the decoding variable.", "description": "This figure demonstrates the performance of three dimensionality reduction methods (NER, CEBRA, and piVAE) in decoding hand movements (velocity, position, and direction) within and across sessions, hemispheres, and years in the primary motor cortex (M1).  It uses linear and k-nearest neighbor decoders, highlighting NER's superior and consistent performance across various conditions.", "section": "4.3 Long-term and cross-hemisphere decoding in M1"}, {"figure_path": "Hlcek7AYgP/figures/figures_20_1.jpg", "caption": "Figure 16: Latent dynamics in S1 revealed by CEBRA and piVAE. a Top: single-trial latent dynamics revealed by NER are rotated with reference to the one session in M1. Bottom: latent dynamics are rotated with reference to the first session in S1. b: Similar to the bottom figure of a but using CEBRA dimensionality reduction method. c: Similar to c but using piVAE dimensionality reduction method.", "description": "This figure compares the latent dynamics in the somatosensory cortex (S1) as revealed by three different dimensionality reduction methods: NER, CEBRA, and piVAE.  The top row shows the latent dynamics when rotated to align with the primary motor cortex (M1), while the bottom row shows the latent dynamics when rotated to align with the first session of S1 data.  The comparison illustrates how the different methods represent the neural activity associated with movement in S1, highlighting variations in the structure and consistency of the latent dynamics.", "section": "4.5 Same movements but different latent dynamics in S1"}, {"figure_path": "Hlcek7AYgP/figures/figures_21_1.jpg", "caption": "Figure 17: Distinct latent dynamics revealed by CEBRA. Similar to Fig 7 but using the latent dynamics revealed by CEBRA. a Ground truth motion trajectories at three directions for straight-curved movements. b Latency dynamics trained on three directions separately and combined. Notice the latent dynamics of straight hand movements (dots and black line) are either mixed (1st) with curved movements or squeezed (3rd). Latent dynamics trained by three directions combined are overlapped. c Linear models predicted hand trajectories. The directions are manually assigned. The explained variance for hand velocities (directions) are 87% (94%), 83% (93%), 82% (94%), and 66% (86%). Notice all the values are lower than NER which are 92% (95%), 89% (96%), 90% (96%), and 81% (91%), especially for the combined directions. d Ground truth motion trajectories at four directions for paired curve-curve movements. e Latency dynamics trained on three directions separately and combined. Notice latent dynamics trained by three directions combined are overlapped. f Linear models predicted hand trajectories. The directions are manually assigned. The explained variance for hand velocities (directions) are 85% (93%), 81% (92%), 85% (94%), and 61% (80%). Notice all the values are lower than NER which are 87% (95%), 89% (95%), 91% (96%), and 81% (91%), especially for the combined directions.", "description": "This figure compares the latent dynamics obtained using CEBRA with those from NER (Figure 7) for both straight-curve and curve-curve hand movements. It highlights that CEBRA struggles to separate latent dynamics for different movement types, especially when combining multiple directions, resulting in lower explained variance compared to NER.", "section": "4.6 Straight and curved hand movements have different latent dynamics in M1"}]