[{"figure_path": "GVlJVX3iiq/tables/tables_7_1.jpg", "caption": "Table 1: Clustering results (mean±std%) of all methods on four datasets. The best and second best results are denoted in bold and underline.", "description": "This table presents a quantitative comparison of the proposed FMCSC method against nine state-of-the-art multi-view clustering methods across four different datasets (MNIST-USPS, BDGP, Multi-Fashion, NUSWIDE).  The results are shown for three different ratios of multi-view to single-view clients (2:1, 1:1, 1:2), evaluating performance using three metrics: Accuracy (ACC), Normalized Mutual Information (NMI), and Adjusted Rand Index (ARI). The best and second-best results for each scenario are highlighted in bold and underlined, respectively, providing a clear view of FMCSC's comparative performance.", "section": "4.2 Results and Analysis"}, {"figure_path": "GVlJVX3iiq/tables/tables_7_2.jpg", "caption": "Table 1: Clustering results (mean±std%) of all methods on four datasets. The best and second best results are denoted in bold and underline.", "description": "This table presents a quantitative comparison of FMCSC against nine state-of-the-art methods (including both centralized and federated multi-view clustering approaches) across four benchmark datasets (MNIST-USPS, BDGP, Multi-Fashion, NUSWIDE) with varying ratios of multi-view to single-view clients. The results are presented as mean ± standard deviation of accuracy (ACC), normalized mutual information (NMI), and adjusted rand index (ARI) across five independent runs.  The best and second-best performing methods for each dataset and client ratio are highlighted in bold and underlined, respectively, demonstrating FMCSC's superior clustering performance, even under diverse heterogeneous hybrid view scenarios.", "section": "4.2 Results and Analysis"}, {"figure_path": "GVlJVX3iiq/tables/tables_8_1.jpg", "caption": "Table 3: Effect of participation rates on generalization performance.", "description": "This table shows the clustering performance (ACC) of the FMCSC method under different participation rates (50%, 70%, 90%) of clients.  The performance is evaluated for both participating and non-participating clients, demonstrating the impact of the number of participating clients on generalization performance.  The results are presented for four datasets: MNIST-USPS, BDGP, Multi-Fashion, and NUSWIDE.", "section": "4.3 Attributes of Federated Learning"}, {"figure_path": "GVlJVX3iiq/tables/tables_20_1.jpg", "caption": "Table 1: Clustering results (mean±std%) of all methods on four datasets. The best and second best results are denoted in bold and underline.", "description": "This table presents a quantitative comparison of the proposed FMCSC method against nine state-of-the-art multi-view clustering methods across four datasets (MNIST-USPS, BDGP, Multi-Fashion, NUSWIDE) under different scenarios.  The scenarios vary the ratio of multi-view to single-view clients to simulate heterogeneity.  The table shows the results of three clustering evaluation metrics: ACC (Accuracy), NMI (Normalized Mutual Information), and ARI (Adjusted Rand Index).  The best and second-best performing methods for each dataset and scenario are highlighted in bold and underlined, respectively, to show the relative performance of FMCSC.", "section": "4.2 Results and Analysis"}, {"figure_path": "GVlJVX3iiq/tables/tables_21_1.jpg", "caption": "Table 1: Clustering results (mean±std%) of all methods on four datasets. The best and second best results are denoted in bold and underline.", "description": "This table presents a quantitative comparison of FMCSC against nine state-of-the-art multi-view clustering methods across four different datasets (MNIST-USPS, BDGP, Multi-Fashion, and NUSWIDE).  The results are shown for three different ratios of multi-view to single-view clients (2:1, 1:1, 1:2) and use Accuracy (ACC), Normalized Mutual Information (NMI), and Adjusted Rand Index (ARI) as evaluation metrics.  The best and second-best results for each dataset and metric are highlighted in bold and underlined, respectively.", "section": "4.2 Results and Analysis"}]