[{"figure_path": "KAAUvi4kpb/tables/tables_2_1.jpg", "caption": "Figure 2: High quality stimuli can be reconstructed from a fraction of the data. Shown here are images and text reconstructed for several bottleneck sizes using our BrainBits approach. Images and text are shown for subject 1 for all three methods. Examples where the original methods could reasonably reconstruct the stimuli were chosen; the same images for both visual methods are shown in the appendix. As the bottleneck dimension increases, the accuracy of the reconstruction increases. Although there are differences between the full and bottlenecked (d = 50) results, the reconstructions are surprisingly comparable, despite the fact that the full reconstruction methods have > 14,000 voxels available to them. Text reconstructions are harder to evaluate in this qualitative manner, later we present a quantitative evaluation.", "description": "This figure shows examples of image and text reconstruction results from three different methods (BrainDiffuser, Takagi & Nishimoto 2023, and Tang et al. 2023) at different bottleneck sizes.  It demonstrates that high-fidelity reconstructions can be achieved even with a small fraction of the available brain data, highlighting the power of the generative models' priors.", "section": "Results"}, {"figure_path": "KAAUvi4kpb/tables/tables_19_1.jpg", "caption": "Table 3: Expanded full text for the same stimulus as shown in Figure 2c and Table 3, but for subject 3", "description": "This table shows the full text transcriptions of the stimuli reconstruction results for subject 3 at different bottleneck sizes. The \"Bottleneck\" column indicates the dimensionality of the bottleneck used in the reconstruction.  The \"Text output\" column displays the reconstructed text for each bottleneck size.  The \"Full\" row represents the full, un-truncated text, providing a benchmark to assess the reconstruction quality at each bottleneck size, including a comparison with the ground truth. The \"Ground truth\" row represents the original text that the model is attempting to reconstruct.", "section": "A.4 Text reconstruction examples"}]