[{"figure_path": "u7JRmrGutT/tables/tables_8_1.jpg", "caption": "Table 2: Prediction error measured in terms of MSE of the nine combinations of our neural set distance surrogate across five datasets on test set, for GED with uniform costs and non-uniform costs. For GED with uniform (non-uniform) costs we have b = b = a = a = 1 (b = 3, b = 1, a = 2, a = 1.) The GRAPHEDX model was selected based on the lowest MSE on the validation set, and we report the results of the MSE on the test set. Green (yellow) numbers report the best (second best) performers.", "description": "This table presents the mean squared error (MSE) achieved by nine different combinations of neural set divergence surrogates for the task of graph edit distance (GED) prediction on five datasets.  Each combination represents a different choice of surrogate for edge edits and node edits. The table shows results for both uniform and non-uniform cost settings. The GRAPHEDX model selection is based on the lowest validation MSE, and the test MSE is reported.", "section": "5.2 Results"}, {"figure_path": "u7JRmrGutT/tables/tables_8_2.jpg", "caption": "Table 3: Prediction error measured in terms of MSE of GRAPHEDX and all the state-of-the-art baselines across five datasets on test set, for GED with uniform costs and non-uniform costs. For GED with uniform (non-unfiform) costs we have b = b = a = a = 1 (b = 3, b = 1, a = 2, a = 1.) GRAPHEDX represents the best model based on the validation set, and we report the results of the MSE on the test set. Green (yellow) numbers report the best (second best) performers.", "description": "This table compares the performance of the proposed GRAPHEDX model against other state-of-the-art methods for predicting the Graph Edit Distance (GED) under two different cost settings: uniform and non-uniform.  The MSE (Mean Squared Error) is used as the performance metric.  The table shows that GRAPHEDX consistently achieves the lowest MSE, outperforming all other methods, highlighting its effectiveness across various datasets.", "section": "5.2 Results"}, {"figure_path": "u7JRmrGutT/tables/tables_9_1.jpg", "caption": "Table 4: Impact of cost-guided distance in terms of MSE; * represents the variant of the baseline with cost-guided distance. Green (bold) shows the best among all methods (only baselines).", "description": "This table compares the performance of several baselines for GED prediction with and without using a cost-guided distance. The results show that incorporating cost information significantly improves the performance of several baselines. The cost-guided GRAPHEDX model consistently outperforms all baselines.", "section": "5.2 Results"}, {"figure_path": "u7JRmrGutT/tables/tables_9_2.jpg", "caption": "Table 5: MSE for different methods with unit node substitution cost in uniform cost setting. Green (yellow) show (second) best method.", "description": "This table presents the Mean Squared Error (MSE) for various graph edit distance methods when a unit cost is applied to node substitutions, under a uniform cost setting. The best performing method (lowest MSE) is highlighted in green, and the second-best is highlighted in yellow.  It showcases the relative performance of different techniques for GED approximation under specific cost conditions. This allows for comparison of the methods' accuracy in calculating the GED, accounting for node label changes.", "section": "D.4 Comparison of GRAPHEDX with baselines with node substitution cost"}, {"figure_path": "u7JRmrGutT/tables/tables_9_3.jpg", "caption": "Table 2: Prediction error measured in terms of MSE of the nine combinations of our neural set distance surrogate across five datasets on test set, for GED with uniform costs and non-uniform costs. For GED with uniform (non-uniform) costs we have b = b = a = a = 1 (b = 3, b = 1, a = 2, a = 1.) The GRAPHEDX model was selected based on the lowest MSE on the validation set, and we report the results of the MSE on the test set. Green (yellow) numbers report the best (second best) performers.", "description": "This table presents the Mean Squared Error (MSE) for nine different combinations of neural set distance surrogates used in the GRAPHEDX model.  The MSE is calculated for five datasets under both uniform and non-uniform cost settings for the Graph Edit Distance (GED). The best-performing combination, based on validation set performance, is highlighted as the chosen GRAPHEDX model.", "section": "5.2 Results"}, {"figure_path": "u7JRmrGutT/tables/tables_20_1.jpg", "caption": "Table 7: Salient characteristics of data sets.", "description": "This table presents a summary of the characteristics of the seven datasets used in the experiments. For each dataset, it shows the number of graphs, the number of training, validation, and test pairs, the average number of nodes and edges per graph, and the average graph edit distance (GED) under uniform and non-uniform cost settings.", "section": "5.1 Setup"}, {"figure_path": "u7JRmrGutT/tables/tables_24_1.jpg", "caption": "Table 8: Comparison of edge-alignment based GED scoring function with node-alignment based GED scoring function and state-of-the-art baselines under the cost setting: a = 2, a = 1, b = b = 0. In case of NodeSwap (w/o XOR), we swap the edge costs and node costs, and expect the model to learn the alignments in Edge GED through node alignment only. Green (yellow) numbers report the best (second best) performers.", "description": "This table compares the performance of different models in predicting the Graph Edit Distance (GED) under a specific cost setting where node costs are zero and edge addition and deletion costs are different.  It highlights the impact of using edge-alignment versus node-alignment based methods for predicting GED.  The results show the Mean Squared Error (MSE) and Kendall's Tau (KTau) for various models and datasets.", "section": "D Additional experiments"}, {"figure_path": "u7JRmrGutT/tables/tables_25_1.jpg", "caption": "Table 2: Prediction error measured in terms of MSE of the nine combinations of our neural set distance surrogate across five datasets on test set, for GED with uniform costs and non-uniform costs. For GED with uniform (non-uniform) costs we have b = b = a = a = 1 (b = 3, b = 1, a = 2, a = 1.) The GRAPHEDX model was selected based on the lowest MSE on the validation set, and we report the results of the MSE on the test set. Green (yellow) numbers report the best (second best) performers.", "description": "This table presents the Mean Squared Error (MSE) achieved by nine different combinations of neural set divergence surrogates for Graph Edit Distance (GED) prediction on five datasets.  The combinations vary the surrogates used for edge edits and node edits, with three options (ALIGNDIFF, DIFFALIGN, XOR-DIFFALIGN) for each.  The experiment is performed with both uniform and non-uniform cost settings for GED. The model selection for GRAPHEDX is based on the minimum validation MSE; this table displays the test MSE for the selected model.", "section": "5.2 Results"}, {"figure_path": "u7JRmrGutT/tables/tables_25_2.jpg", "caption": "Table 3: Prediction error measured in terms of MSE of GRAPHEDX and all the state-of-the-art baselines across five datasets on test set, for GED with uniform costs and non-uniform costs. For GED with uniform (non-unfiform) costs we have b = b = a = a = 1 (b = 3,b = 1, a = 2, a = 1.) GRAPHEDX represents the best model based on the validation set from the cartesian space of Edge-{ALIGNDIFF, DIFFALIGN, XOR-DIFFALIGN} × Node-{ALIGNDIFF, DIFFALIGN, XOR-DIFFALIGN}. Green ( yellow) numbers report the best (second best) performers.", "description": "This table presents the Mean Squared Error (MSE) comparison of the proposed GRAPHEDX model against nine state-of-the-art baseline methods for computing the Graph Edit Distance (GED) on five real-world datasets.  The comparison is done under both uniform and non-uniform cost settings for GED.  The best-performing model according to validation error is chosen as GRAPHEDX for each dataset.  The table highlights the significant performance advantage of GRAPHEDX across all datasets and cost settings.", "section": "5.2 Results"}, {"figure_path": "u7JRmrGutT/tables/tables_25_3.jpg", "caption": "Table 2: Prediction error measured in terms of MSE of the nine combinations of our neural set distance surrogate across five datasets on test set, for GED with uniform costs and non-uniform costs. For GED with uniform (non-uniform) costs we have b = b = a = a = 1 (b = 3, b = 1, a = 2, a = 1.) The GRAPHEDX model was selected based on the lowest MSE on the validation set, and we report the results of the MSE on the test set. Green (yellow) numbers report the best (second best) performers.", "description": "This table presents the Mean Squared Error (MSE) for nine different combinations of neural set divergence surrogates used in the GRAPHEDX model. The MSE is calculated for five datasets under two different cost settings: uniform and non-uniform. The table shows the performance of different surrogate combinations and highlights the best-performing combination used for GRAPHEDX.", "section": "5.2 Results"}, {"figure_path": "u7JRmrGutT/tables/tables_26_1.jpg", "caption": "Table 2: Prediction error measured in terms of MSE of the nine combinations of our neural set distance surrogate across five datasets on test set, for GED with uniform costs and non-uniform costs. For GED with uniform (non-uniform) costs we have b = b = a = a = 1 (b = 3, b = 1, a = 2, a = 1.) The GRAPHEDX model was selected based on the lowest MSE on the validation set, and we report the results of the MSE on the test set. Green (yellow) numbers report the best (second best) performers.", "description": "This table presents the Mean Squared Error (MSE) achieved by nine different combinations of neural set divergence surrogates for predicting the Graph Edit Distance (GED) on five datasets.  The surrogates are categorized by their approach to edge and node alignment (ALIGNDIFF, DIFFALIGN, XOR-DIFFALIGN).  The results are shown separately for both uniform and non-uniform cost settings for the GED calculation.  The GRAPHEDX model, selected based on validation performance, is highlighted, along with the best and second-best performing combinations.", "section": "5.2 Results"}, {"figure_path": "u7JRmrGutT/tables/tables_27_1.jpg", "caption": "Table 3: Prediction error measured in terms of MSE of GRAPHEDX and all the state-of-the-art baselines across five datasets on test set, for GED with uniform costs and non-uniform costs. For GED with uniform (non-unfiform) costs we have b = b = a = a = 1 (b = 3, b = 1, a = 2, a = 1.) GRAPHEDX represents the best model based on the validation set, and we report the results of the MSE on the test set. Green ( yellow) numbers report the best (second best) performers.", "description": "This table presents the Mean Squared Error (MSE) comparison between GRAPHEDX and other state-of-the-art methods for predicting Graph Edit Distance (GED) under both uniform and non-uniform cost settings.  It shows that GRAPHEDX significantly outperforms other methods across five real-world datasets, highlighting its superior performance in GED prediction.", "section": "5.2 Results"}, {"figure_path": "u7JRmrGutT/tables/tables_27_2.jpg", "caption": "Table 2: Prediction error measured in terms of MSE of the nine combinations of our neural set distance surrogate across five datasets on test set, for GED with uniform costs and non-uniform costs. For GED with uniform (non-uniform) costs we have b = b = a = a = 1 (b = 3, b = 1, a = 2, a = 1.) The GRAPHEDX model was selected based on the lowest MSE on the validation set, and we report the results of the MSE on the test set. Green (yellow) numbers report the best (second best) performers.", "description": "This table presents the Mean Squared Error (MSE) for nine different combinations of neural set divergence surrogates used in the GRAPHEDX model.  The MSE is calculated for five datasets under both uniform and non-uniform cost settings for Graph Edit Distance (GED). The best-performing combination (lowest MSE) on the validation set was chosen for the GRAPHEDX model, and those results are reported here for the test set.  The table highlights the best and second-best performing combinations.", "section": "5.2 Results"}, {"figure_path": "u7JRmrGutT/tables/tables_28_1.jpg", "caption": "Table 16: Comparison of using all-node-pairs against edge-only representations using MSE for non-uniform cost setting. Green (yellow) numbers report the best (second best) performers.", "description": "This table compares the performance of three different graph representations in predicting the Graph Edit Distance (GED) under a non-uniform cost setting.  The three representations are: 1) using all node pairs (edges and non-edges) for computing GED; 2) using only the edges (and ignoring non-edges) to compute GED; and 3) using only edges but representing them as node pairs, but setting non-edge embeddings to zero. The table shows the Mean Squared Error (MSE) for each representation across multiple datasets. The results highlight the importance of considering both edges and non-edges for accurate GED prediction.", "section": "D.5 Performance evaluation for edge-only vs. all-node-pair representations"}, {"figure_path": "u7JRmrGutT/tables/tables_28_2.jpg", "caption": "Table 3: Prediction error measured in terms of MSE of GRAPHEDX and all the state-of-the-art baselines across five datasets on test set, for GED with uniform costs and non-uniform costs. For GED with uniform (non-uniform) costs we have b = b = a = a = 1 (b = 3, b = 1, a = 2, a = 1.) GRAPHEDX represents the best model based on the validation set, and we report the results of the MSE on the test set. Green (yellow) numbers report the best (second best) performers.", "description": "This table presents a comparison of the mean squared error (MSE) achieved by the proposed GRAPHEDX model and nine other state-of-the-art methods for predicting the graph edit distance (GED) on five datasets.  The comparison is done under both uniform and non-uniform cost settings for GED.  The best performing model (lowest MSE) on the validation set is selected as GRAPHEDX.  The results show that GRAPHEDX significantly outperforms the other models in most instances.", "section": "5.2 Results"}, {"figure_path": "u7JRmrGutT/tables/tables_28_3.jpg", "caption": "Table 3: Prediction error measured in terms of MSE of GRAPHEDX and all the state-of-the-art baselines across five datasets on test set, for GED with uniform costs and non-uniform costs. For GED with uniform (non-unfiform) costs we have b = b = a = a = 1 (b = 3, b = 1, a = 2, a = 1.) GRAPHEDX represents the best model based on the validation set, and we report the results of the MSE on the test set. Green ( yellow) numbers report the best (second best) performers.", "description": "This table compares the performance of the proposed model (GRAPHEDX) against nine state-of-the-art baseline methods for predicting the Graph Edit Distance (GED) under two different cost settings: uniform and non-uniform.  The MSE (Mean Squared Error) is used as the evaluation metric. GRAPHEDX consistently outperforms all baselines across five datasets, demonstrating its effectiveness even with non-uniform edit operation costs.", "section": "5.2 Results"}, {"figure_path": "u7JRmrGutT/tables/tables_28_4.jpg", "caption": "Table 19: Comparison of MSE between GRAPHEDX, MAX-OR, and MAX. Green(yellow) numbers report the best(second best) performers.", "description": "This table compares the mean squared error (MSE) of three different neural network models for predicting graph edit distance (GED).  The models are GRAPHEDX (the proposed model in the paper), MAX, and MAX-OR.  The results are presented for seven different datasets and show that GRAPHEDX generally performs best, with MAX-OR sometimes performing comparably well.  MAX typically underperforms the other two methods.", "section": "D.7 Results on performance of the alternate surrogates for GED"}, {"figure_path": "u7JRmrGutT/tables/tables_28_5.jpg", "caption": "Table 3: Prediction error measured in terms of MSE of GRAPHEDX and all the state-of-the-art baselines across five datasets on test set, for GED with uniform costs and non-uniform costs. For GED with uniform (non-unfiform) costs we have b = b = a = a = 1 (b = 3, b = 1, a = 2, a = 1.) GRAPHEDX represents the best model based on the validation set, and we report the results of the MSE on the test set. Green ( yellow) numbers report the best (second best) performers.", "description": "This table compares the performance of the proposed GRAPHEDX model against nine state-of-the-art baseline methods for computing the Graph Edit Distance (GED) under both uniform and non-uniform cost settings.  The MSE (Mean Squared Error) is used to evaluate prediction accuracy on five datasets.  The table highlights GRAPHEDX's superior performance and identifies the best- and second-best performing baseline methods for each dataset.", "section": "5.2 Results"}, {"figure_path": "u7JRmrGutT/tables/tables_29_1.jpg", "caption": "Table 2: Prediction error measured in terms of MSE of the nine combinations of our neural set distance surrogate across five datasets on test set, for GED with uniform costs and non-uniform costs. For GED with uniform (non-uniform) costs we have b = b = a = a = 1 (b = 3, b = 1, a = 2, a = 1.) The GRAPHEDX model was selected based on the lowest MSE on the validation set, and we report the results of the MSE on the test set. Green (yellow) numbers report the best (second best) performers.", "description": "This table presents the Mean Squared Error (MSE) for nine different combinations of neural set distance surrogates used in the GRAPHEDX model.  These combinations involve different methods for calculating the edge and node edit costs. The MSE is reported for five datasets under both uniform and non-uniform cost settings for the Graph Edit Distance (GED). The best-performing combination for each dataset (under each setting) is highlighted in green, while the second-best is in yellow. The table demonstrates how different methods of computing the costs impact the model's accuracy.", "section": "5.2 Results"}, {"figure_path": "u7JRmrGutT/tables/tables_30_1.jpg", "caption": "Table 2: Prediction error measured in terms of MSE of the nine combinations of our neural set distance surrogate across five datasets on test set, for GED with uniform costs and non-uniform costs. For GED with uniform (non-uniform) costs we have b = b = a = a = 1 (b = 3, b = 1, a = 2, a = 1.) The GRAPHEDX model was selected based on the lowest MSE on the validation set, and we report the results of the MSE on the test set. Green (yellow) numbers report the best (second best) performers.", "description": "This table presents the Mean Squared Error (MSE) achieved by nine different combinations of neural set divergence surrogates for Graph Edit Distance (GED) prediction.  Each combination uses one of three surrogates for edge edits (ALIGNDIFF, DIFFALIGN, XOR-DIFFALIGN) and one of three for node edits. The table shows results for five datasets under both uniform and non-uniform cost settings. GRAPHEDX's configuration (selected based on validation performance) is also shown.", "section": "5.2 Results"}, {"figure_path": "u7JRmrGutT/tables/tables_30_2.jpg", "caption": "Table 2: Prediction error measured in terms of MSE of the nine combinations of our neural set distance surrogate across five datasets on test set, for GED with uniform costs and non-uniform costs. For GED with uniform (non-uniform) costs we have b = b = a = a = 1 (b = 3, b = 1, a = 2, a = 1.) The GRAPHEDX model was selected based on the lowest MSE on the validation set, and we report the results of the MSE on the test set. Green (yellow) numbers report the best (second best) performers.", "description": "This table presents the Mean Squared Error (MSE) achieved by nine different combinations of neural set divergence surrogates for Graph Edit Distance (GED) prediction.  The surrogates are categorized by edge edit type (ALIGNDIFF, DIFFALIGN, XOR-DIFFALIGN) and node edit type (ALIGNDIFF, DIFFALIGN, XOR-DIFFALIGN). Results are shown for five datasets under both uniform and non-uniform cost settings for GED. The best-performing combination for each dataset is used to select the final GRAPHEDX model. The table highlights the MSE values for each combination, with the best and second-best performers clearly indicated.", "section": "5.2 Results"}, {"figure_path": "u7JRmrGutT/tables/tables_33_1.jpg", "caption": "Table 2: Prediction error measured in terms of MSE of the nine combinations of our neural set distance surrogate across five datasets on test set, for GED with uniform costs and non-uniform costs. For GED with uniform (non-uniform) costs we have b = b = a = a = 1 (b = 3, b = 1, a = 2, a = 1.) The GRAPHEDX model was selected based on the lowest MSE on the validation set, and we report the results of the MSE on the test set. Green (yellow) numbers report the best (second best) performers.", "description": "This table presents the Mean Squared Error (MSE) achieved by nine different combinations of neural set divergence surrogates used in the GRAPHEDX model.  The surrogates are categorized into edge and node edit types, each with three variants (ALIGNDIFF, DIFFALIGN, XOR-DIFFALIGN). The MSE is calculated for both uniform and non-uniform edit cost settings across five datasets.  The best performing combination is highlighted, along with the second-best performing combination.", "section": "5.2 Results"}]