[{"figure_path": "7t6aq0Fa9D/figures/figures_0_1.jpg", "caption": "Figure 1: (a): Running speed rank and overall performance rank on the experiments with 6 benchmark datasets, including topic quality, doc-topic distribution quality, downstream tasks, and transferability. (b): Running time under the WoS dataset with varying sizes. See complete results in Figure 6.", "description": "This figure presents a comparison of FASTopic against other topic modeling methods. Subfigure (a) shows that FASTopic achieves the highest overall performance rank while maintaining a top rank in running speed.  Subfigure (b) demonstrates the scalability of FASTopic by showing its running time remains relatively low even as the dataset size increases, outperforming other methods.", "section": "Introduction"}, {"figure_path": "7t6aq0Fa9D/figures/figures_1_1.jpg", "caption": "Figure 2: Illustration of topic modeling paradigms. (a): VAE-based topic modeling with an encoder and a decoder [91, 65, 73]. (b): Clustering-based topic modeling by clustering document embeddings [2, 24]. (c): Dual Semantic-relation Reconstruction (DSR), modeling doc-topic distributions as the semantic relations between document (■) and topic embeddings (▲), and modeling topic-word distributions as the semantic relations between topic (▲) and word embeddings (). Here we model these relations as the transport plans to alleviate the relation bias issue.", "description": "This figure illustrates three different topic modeling paradigms. (a) shows a VAE-based approach, using an encoder and decoder to model topic distributions. (b) demonstrates a clustering-based method, clustering document embeddings to find topics. (c) introduces the paper's proposed Dual Semantic-relation Reconstruction (DSR) method, modeling the relationships between document-topic and topic-word embeddings as transport plans to mitigate bias.", "section": "3 Methodology: FASTopic"}, {"figure_path": "7t6aq0Fa9D/figures/figures_3_1.jpg", "caption": "Figure 3: (a, b): Relation weights of topics to documents. (c, d): t-SNE visualization [63] of document (■), and topic (▲) embeddings under 50 topics (K=50). While most topic embeddings gather together in Parameterized Softmax (a,c) as it causes biased relations, ETP (b,d) separates all topic embeddings with regularized relations, avoiding the bias issue.", "description": "This figure compares the effectiveness of two methods for modeling semantic relations in topic modeling: Parameterized Softmax and Embedding Transport Plan (ETP).  The left two subfigures (a and b) show the distribution of relation weights between topics and documents for both methods.  Parameterized Softmax shows a highly skewed distribution, with most relations having low weights, indicating a potential bias. ETP, on the other hand, demonstrates a more uniform distribution of weights. The right two subfigures (c and d) use t-SNE to visualize the topic and document embeddings. Parameterized Softmax shows topic embeddings clustered together, indicating the relation bias. In contrast, ETP effectively separates the topic embeddings, suggesting better topic distinctiveness. This visualization supports the claim that ETP addresses the relation bias issue and leads to more effective topic modeling.", "section": "3.2 Dual Semantic-relation Reconstruction"}, {"figure_path": "7t6aq0Fa9D/figures/figures_6_1.jpg", "caption": "Figure 1: (a): Running speed rank and overall performance rank on the experiments with 6 benchmark datasets, including topic quality, doc-topic distribution quality, downstream tasks, and transferability. (b): Running time under the WoS dataset with varying sizes. See complete results in Figure 6.", "description": "This figure shows a comparison of FASTopic's performance against other topic modeling methods across several benchmark datasets. Subfigure (a) presents the ranking of FASTopic and other methods based on running speed and overall performance, which considers various aspects such as topic quality, doc-topic distribution, and downstream tasks. Subfigure (b) displays the running time of FASTopic and other methods under varying dataset sizes using the WoS dataset.  FASTopic demonstrates superior efficiency and effectiveness in both aspects.", "section": "Introduction"}, {"figure_path": "7t6aq0Fa9D/figures/figures_9_1.jpg", "caption": "Figure 3: (a, b): Relation weights of topics to documents. (c, d): t-SNE visualization [63] of document (), and topic (▲) embeddings under 50 topics (K=50). While most topic embeddings gather together in Parameterized Softmax (a,c) as it causes biased relations, ETP (b,d) separates all topic embeddings with regularized relations, avoiding the bias issue.", "description": "This figure compares the performance of Parameterized Softmax and Embedding Transport Plan (ETP) in topic modeling.  Subfigures (a) and (b) show the relation weights between topics and documents, illustrating how ETP addresses the relation bias issue by creating more distinct and less overlapping relations. Subfigures (c) and (d) visualize the topic embeddings using t-SNE, where ETP results in better separation of topic embeddings indicating less bias and better model performance.", "section": "3.2 Dual Semantic-relation Reconstruction"}, {"figure_path": "7t6aq0Fa9D/figures/figures_17_1.jpg", "caption": "Figure 6: Running time under WoS with different data sizes. See also a zoomed-in view in Figure 1b.", "description": "This figure shows the running time of various topic modeling methods under different dataset sizes using the WoS dataset.  The x-axis represents the dataset size, and the y-axis represents the running time in seconds.  FASTopic demonstrates significantly faster running times compared to other methods, especially as the dataset size increases.", "section": "4.4 Efficiency: Running Speed"}, {"figure_path": "7t6aq0Fa9D/figures/figures_17_2.jpg", "caption": "Figure 3: (a, b): Relation weights of topics to documents. (c, d): t-SNE visualization [63] of document (), and topic (▲) embeddings under 50 topics (K=50). While most topic embeddings gather together in Parameterized Softmax (a,c) as it causes biased relations, ETP (b,d) separates all topic embeddings with regularized relations, avoiding the bias issue.", "description": "This figure visualizes the effect of using Parameterized Softmax versus Embedding Transport Plan (ETP) for modeling semantic relations in topic modeling.  The left column (a and c) shows the results with Parameterized Softmax, illustrating biased relations where most topic embeddings cluster together. The right column (b and d) displays the results with ETP, demonstrating that ETP effectively regularizes these relations, leading to better separation and distinction among topic embeddings. The t-SNE plots provide a visual representation of the embedding spaces in two different scenarios.", "section": "3.2 Dual Semantic-relation Reconstruction"}, {"figure_path": "7t6aq0Fa9D/figures/figures_19_1.jpg", "caption": "Figure 3: (a, b): Relation weights of topics to documents. (c, d): t-SNE visualization [63] of document (), and topic (▲) embeddings under 50 topics (K=50). While most topic embeddings gather together in Parameterized Softmax (a,c) as it causes biased relations, ETP (b,d) separates all topic embeddings with regularized relations, avoiding the bias issue.", "description": "This figure compares the performance of Parameterized Softmax and Embedding Transport Plan (ETP) in topic modeling.  Subfigures (a) and (b) show the relation weights of topics to documents, illustrating how ETP addresses the relation bias issue by distributing weights more evenly compared to Parameterized Softmax. Subfigures (c) and (d) use t-SNE to visualize the document and topic embeddings.  Parameterized Softmax results in clustered embeddings, while ETP produces more separated and distinct topic embeddings, indicative of better topic modeling performance.", "section": "3.2 Dual Semantic-relation Reconstruction"}]