{"importance": "This paper is crucial for researchers in federated learning and diffusion models. It highlights a critical privacy vulnerability in using diffusion models within federated learning, demonstrating how attackers can steal sensitive data using multiple Trojans.  The proposed AdaSCP attack and ComboTs significantly advance our understanding of the risks and provide avenues for developing more robust defenses. This work is timely given the increasing adoption of diffusion models in sensitive applications.", "summary": "Attackers can steal massive private data from federated learning diffusion models using multiple Trojans and an advanced attack, AdaSCP, which circumvents existing defenses.", "takeaways": ["Diffusion models in federated learning are vulnerable to data theft via multiple strategically placed Trojans.", "The proposed AdaSCP attack effectively bypasses advanced distance-based defenses in federated learning.", "ComboTs allow for the efficient extraction of thousands of private images by generating specific triggers."], "tldr": "Federated learning (FL), while designed for privacy, faces new threats from generative diffusion models.  **Existing FL defenses against single backdoors are inadequate against attacks exploiting multiple malicious triggers planted in the model by multiple compromised clients.**  This paper identifies this serious vulnerability and details how attackers can leverage it to steal a substantial amount of training data.\n\nThe researchers introduce **DataStealing**, a novel framework and attack methodology,  demonstrating its effectiveness. They also propose **AdaSCP**, a sophisticated attack that dynamically scales malicious updates to evade detection by distance-based defenses. AdaSCP targets critical parameters of the model and cleverly adjusts the magnitude of updates to blend in with benign updates.  **Extensive experiments confirm the risk of large-scale data leakage and the effectiveness of AdaSCP in defeating existing defenses.**", "affiliation": "Zhejiang University", "categories": {"main_category": "Machine Learning", "sub_category": "Federated Learning"}, "podcast_path": "792txRlKit/podcast.wav"}