[{"figure_path": "k0qTnbQxzR/figures/figures_0_1.jpg", "caption": "Figure 1: CogCoM solves various visual problems with Chain of Manipulations mechanism. Note that the CoM reasoning generates evidential and explainable steps, without involving external tools.", "description": "This figure shows several examples of how CogCoM, a Vision-Language Model (VLM), uses a Chain of Manipulations (CoM) to solve various visual problems.  Each example demonstrates a different type of visual reasoning task, such as object recognition, counting, reading time, reading figures, and geometry.  The CoM mechanism involves a sequence of steps, each step is a manipulation that uses a grounding operation to locate a specific region or object in the image. Subsequent manipulations might involve cropping and zooming in on the region, optical character recognition (OCR), or counting objects. This process is intended to generate an evidential and explainable chain of reasoning, without the use of any external tools.", "section": "1 Introduction"}, {"figure_path": "k0qTnbQxzR/figures/figures_1_1.jpg", "caption": "Figure 2: In comparison with existing VLMs, CogCoM performs the multiple steps of evidential reasoning with chain of manipulations (CoM) to achieve the faithful answer to visual scene.", "description": "This figure compares the reasoning process of existing Vision-Language Models (VLMs) with the CogCoM model.  Existing VLMs often provide a single conclusive answer, potentially ignoring essential visual reasoning steps and leading to incorrect or unfaithful responses. In contrast, CogCoM uses a chain of manipulations (CoM), breaking down the problem into smaller, verifiable steps. This allows CogCoM to provide a more accurate and interpretable answer by showing its reasoning process through intermediate steps and evidence from the image.  The figure visually represents this difference with a visual example demonstrating how CogCoM performs multiple steps of evidential reasoning to arrive at the correct answer, while the existing VLM gives an incorrect answer due to a lack of intermediate reasoning steps.", "section": "1 Introduction"}, {"figure_path": "k0qTnbQxzR/figures/figures_2_1.jpg", "caption": "Figure 1: CogCoM solves various visual problems with Chain of Manipulations mechanism. Note that the CoM reasoning generates evidential and explainable steps, without involving external tools.", "description": "This figure shows several examples of how CogCoM, a vision-language model, solves various visual reasoning tasks step by step using a chain of manipulations. Each example includes a question, the chain of manipulations used to answer the question, and the final answer. The manipulations involve operations such as grounding (locating objects in an image), cropping and zooming, optical character recognition (OCR), counting, and calculation.  The figure highlights the model's ability to break down complex visual problems into a series of smaller, more manageable steps, making the reasoning process more transparent and understandable. ", "section": "1 Introduction"}, {"figure_path": "k0qTnbQxzR/figures/figures_3_1.jpg", "caption": "Figure 1: CogCoM solves various visual problems with Chain of Manipulations mechanism. Note that the CoM reasoning generates evidential and explainable steps, without involving external tools.", "description": "This figure demonstrates how the CogCoM model solves various visual problems using a chain of manipulations.  Each manipulation is a step in a reasoning process that is both evidential (showing the intermediate steps) and explainable (providing a clear description of each step). Importantly, this process does not require external tools.", "section": "1 Introduction"}, {"figure_path": "k0qTnbQxzR/figures/figures_5_1.jpg", "caption": "Figure 5: Left: A compatible VLM architecture capable of multi-turn multi-image understanding. Right: An effective training process to develop a general VLM with versatile capabilities.", "description": "This figure illustrates two key aspects of the CogCoM model. The left panel shows the architecture of the model, which is a memory-based multi-turn multi-image VLM capable of understanding and responding to multiple images and turns of conversation.  The right panel shows the training process which involves two stages: pre-training (focused on foundational visual understanding and grounded understanding) and fine-tuning (focused on multimodal problem solving).  The different data structures used in each stage are also shown.", "section": "4 Model Training"}, {"figure_path": "k0qTnbQxzR/figures/figures_7_1.jpg", "caption": "Figure 1: CogCoM solves various visual problems with Chain of Manipulations mechanism. Note that the CoM reasoning generates evidential and explainable steps, without involving external tools.", "description": "This figure demonstrates the CogCoM model's ability to solve various visual problems using a Chain of Manipulations (CoM) mechanism.  The CoM approach breaks down complex problems into a sequence of smaller, more manageable steps, each supported by visual evidence.  Each step involves a specific manipulation (like grounding, zooming, counting, or calculating) applied to the input image, producing intermediate results that are subsequently used in later steps. The key takeaway is that CogCoM generates explanations and justifications for each step, making its reasoning transparent and easier to understand, without relying on any external tools.", "section": "1 Introduction"}, {"figure_path": "k0qTnbQxzR/figures/figures_15_1.jpg", "caption": "Figure 1: CogCoM solves various visual problems with Chain of Manipulations mechanism. Note that the CoM reasoning generates evidential and explainable steps, without involving external tools.", "description": "This figure demonstrates the CogCoM model's ability to solve various visual problems using a Chain of Manipulations (CoM) mechanism.  Each example shows a visual question, the CogCoM's step-by-step reasoning process using CoM (involving manipulations like grounding, cropping, zooming, counting, and OCR), and the final answer.  The key is that the process is evidential and explainable, demonstrating the reasoning steps and their outcomes without the need for external tools.", "section": "1 Introduction"}, {"figure_path": "k0qTnbQxzR/figures/figures_16_1.jpg", "caption": "Figure 1: CogCoM solves various visual problems with Chain of Manipulations mechanism. Note that the CoM reasoning generates evidential and explainable steps, without involving external tools.", "description": "This figure shows several examples of how CogCoM, a vision-language model, solves different visual problems using a chain of manipulations.  Each example demonstrates a different type of manipulation, such as grounding, cropping, zooming, counting, reading time, and reading figures. The captions explain step-by-step reasoning process involved in solving each problem. It highlights CogCoM's ability to break down complex tasks into simpler, interpretable steps, making it more robust and reliable than traditional VLMs.", "section": "1 Introduction"}, {"figure_path": "k0qTnbQxzR/figures/figures_16_2.jpg", "caption": "Figure 1: CogCoM solves various visual problems with Chain of Manipulations mechanism. Note that the CoM reasoning generates evidential and explainable steps, without involving external tools.", "description": "This figure illustrates how CogCoM, a Vision-Language Model (VLM), solves various visual problems using a Chain of Manipulations (CoM) mechanism.  The CoM approach breaks down complex visual tasks into smaller, sequential steps, each step involving a specific manipulation (e.g., grounding, cropping, zooming, counting, calculation, line drawing) and producing an intermediate result. These steps are shown with bounding boxes and textual descriptions, providing transparency and explainability.  Importantly, the process does not rely on any external tools, making it self-contained and efficient.", "section": "1 Introduction"}, {"figure_path": "k0qTnbQxzR/figures/figures_18_1.jpg", "caption": "Figure 1: CogCoM solves various visual problems with Chain of Manipulations mechanism. Note that the CoM reasoning generates evidential and explainable steps, without involving external tools.", "description": "This figure demonstrates the CogCoM model's ability to solve various visual problems using a chain of manipulations.  Each problem is shown with an example question, the steps CogCoM takes to solve it using its chain of manipulations, and the final answer.  The manipulations involve operations such as image grounding, cropping, zooming, object counting, and text recognition. The figure highlights the model's ability to break down complex problems into a sequence of understandable steps, providing evidence and explanations for each step without relying on external tools.  Different types of problems are shown, including image recognition, object counting, time reading, and geometry.", "section": "1 Introduction"}, {"figure_path": "k0qTnbQxzR/figures/figures_18_2.jpg", "caption": "Figure 1: CogCoM solves various visual problems with Chain of Manipulations mechanism. Note that the CoM reasoning generates evidential and explainable steps, without involving external tools.", "description": "This figure shows several examples of how the CogCoM model solves different visual question answering tasks using its Chain of Manipulations (CoM) mechanism.  Each example demonstrates a step-by-step reasoning process where the model uses various manipulations (like grounding, cropping, zooming, counting, and OCR) to arrive at the final answer. The manipulations are shown as visual steps with bounding boxes and intermediate results, highlighting the transparency and explainability of the model's reasoning. The examples cover diverse tasks, such as object recognition, counting, reading times, and solving geometry problems. The caption emphasizes that the reasoning process is self-contained and doesn't require any external tools.", "section": "1 Introduction"}]