[{"figure_path": "WPxa6OcIdg/figures/figures_1_1.jpg", "caption": "Figure 1: General framework of HyperDM. (a) A Bayesian hyper-network is optimized to generate diffusion model weights from randomly sampled noise. This process is repeated M times to obtain an ensemble of M weights. (b) A diffusion model accepts fixed weights from the hyper-network to stochastically generate a prediction. This process is repeated N times for each set of weights, yielding a total of M × N predictions. (c) The ensemble predictions are aggregated to produce a final prediction and an epistemic / aleatoric uncertainty map.", "description": "This figure illustrates the HyperDM framework.  A Bayesian hypernetwork generates an ensemble of weights (a). Each weight set is used by a diffusion model to produce multiple predictions (b). Finally, these predictions are aggregated to get the final prediction and uncertainty maps which are separated into epistemic and aleatoric components (c).", "section": "Method"}, {"figure_path": "WPxa6OcIdg/figures/figures_3_1.jpg", "caption": "Figure 2: Accurate uncertainty estimation using HyperDM. (a) HyperDM is trained on four 1D datasets with aleatoric uncertainty determined by noise variance σ². Variances across diffusion model predictions are visualized as one distribution per training dataset. Aleatoric estimates (i.e., the mean of each distribution) accurately predict σ². (b) HyperDM is trained on four datasets with epistemic uncertainty determined by dataset size |D|. Prediction means are visualized as one distribution per training dataset. Epistemic estimates (i.e., the variance of each distribution) grow inversely with |D|.", "description": "This figure shows the results of an experiment to validate the accuracy of HyperDM in estimating aleatoric and epistemic uncertainty.  Two subfigures are shown. (a) demonstrates HyperDM's ability to estimate aleatoric uncertainty by training on datasets with varying levels of inherent noise. The mean of the variance distribution for each dataset closely matches the true noise variance. (b) demonstrates HyperDM's ability to estimate epistemic uncertainty by training on datasets with different sizes. The variance of the mean distribution for each dataset decreases inversely with dataset size, indicating accurate estimation of the uncertainty reduction with more data.", "section": "2.3 Diffusion Models"}, {"figure_path": "WPxa6OcIdg/figures/figures_5_1.jpg", "caption": "Figure 3: Weather forecasting on out-of-distribution data. (a) An out-of-distribution measurement is formed by synthetically inserting a hot spot in the northeastern part of Canada. (b) Epistemic and aleatoric uncertainty maps are produced by each method on the provided measurement. Compared to other methods, HyperDM is best able to isolate the abnormal feature in its epistemic estimate.", "description": "This figure shows a comparison of epistemic and aleatoric uncertainty maps generated by four different methods (MC-Dropout, DPS-UQ, and HyperDM) for a weather forecasting task.  An out-of-distribution measurement was created by adding a synthetic \"hot spot\" to a weather map. The figure demonstrates that HyperDM is superior at isolating the anomalous area within the epistemic uncertainty map compared to the other methods.  It highlights the ability of HyperDM to accurately pinpoint areas where model uncertainty is high due to unusual data, which is a key advantage in high-stakes applications like weather forecasting.", "section": "5.3 Weather Forecasting"}, {"figure_path": "WPxa6OcIdg/figures/figures_8_1.jpg", "caption": "Figure 4: CT reconstruction on out-of-distribution data. (a) An out-of-distribution CT measurement formed by synthetically inserting metal implants along the spine. (b) Epistemic and aleatoric uncertainty maps are produced by each method on the out-of-distribution measurement. Both DPS-UQ and HyperDM are able to distinguish the abnormal feature in their epistemic prediction.", "description": "This figure shows the results of applying different uncertainty quantification methods to an out-of-distribution CT scan. The out-of-distribution scan contains synthetically added metal implants. The figure compares the performance of MC-Dropout, DPS-UQ, and HyperDM in detecting the anomaly, focusing on both epistemic (reducible with more data) and aleatoric (irreducible) uncertainty. The results highlight HyperDM's ability to accurately identify the abnormal implants within its epistemic uncertainty map.", "section": "5.2 Computed Tomography"}, {"figure_path": "WPxa6OcIdg/figures/figures_14_1.jpg", "caption": "Figure 3: Weather forecasting on out-of-distribution data. (a) An out-of-distribution measurement is formed by synthetically inserting a hot spot in the northeastern part of Canada. (b) Epistemic and aleatoric uncertainty maps are produced by each method on the provided measurement. Compared to other methods, HyperDM is best able to isolate the abnormal feature in its epistemic estimate.", "description": "This figure shows a comparison of different uncertainty quantification methods on a weather forecasting task, where an out-of-distribution data point (a hot spot in northeastern Canada) is introduced. The subfigures (a) and (b) display the anomalous measurement and the uncertainty maps generated by various methods (MC-Dropout, DPS-UQ, and HyperDM), respectively. The uncertainty maps illustrate the epistemic (EU) and aleatoric (AU) uncertainty components.  HyperDM demonstrates better performance at isolating the abnormal feature in the epistemic uncertainty estimate compared to other methods.", "section": "5 Experiments"}, {"figure_path": "WPxa6OcIdg/figures/figures_15_1.jpg", "caption": "Figure 6: Effect of sampling more weights on epistemic uncertainty. As we increase the number M of sampled weights from the hyper-network, uncertainty around out-of-distribution features (i.e., the hot spot in the upper-right) grows and uncertainty around in-distribution features (i.e., everything else in the image) shrinks.", "description": "This figure shows the results of an ablation study on the HyperDM model, specifically investigating the impact of varying the number of sampled weights (M) on epistemic uncertainty estimation.  Four images are presented, each corresponding to a different value of M (2, 4, 8, and 16).  The images show uncertainty maps, where redder areas indicate higher uncertainty. As M increases, the uncertainty around an out-of-distribution feature (a hot spot in the upper-right quadrant) increases while uncertainty in other areas decreases, demonstrating that larger ensemble sizes improve the identification of anomalies.", "section": "B Ablation Studies"}, {"figure_path": "WPxa6OcIdg/figures/figures_16_1.jpg", "caption": "Figure 7: Effect of sampling more predictions on aleatoric uncertainty. As we increase the number N of sampled predictions from the diffusion model, aleatoric uncertainty predictions smooth out more evenly.", "description": "This figure shows the effect of increasing the number of predictions (N) sampled from the diffusion model on the aleatoric uncertainty estimates.  As N increases from 2 to 16, the uncertainty maps become smoother and less noisy, indicating a more stable and reliable representation of the inherent randomness in the predictions.", "section": "B Ablation Studies"}, {"figure_path": "WPxa6OcIdg/figures/figures_16_2.jpg", "caption": "Figure 3: Weather forecasting on out-of-distribution data. (a) An out-of-distribution measurement is formed by synthetically inserting a hot spot in the northeastern part of Canada. (b) Epistemic and aleatoric uncertainty maps are produced by each method on the provided measurement. Compared to other methods, HyperDM is best able to isolate the abnormal feature in its epistemic estimate.", "description": "This figure shows the results of weather forecasting experiments using four different methods (MC-Dropout, DPS-UQ, and HyperDM) on out-of-distribution data. The out-of-distribution data was created by adding a \"hot spot\" to a weather map in northeastern Canada. The figure shows the epistemic and aleatoric uncertainty maps for each method, highlighting how well each method can identify and isolate the abnormal feature (the hot spot). HyperDM shows the best results at isolating the abnormal feature in its epistemic estimate.", "section": "5.3 Weather Forecasting"}, {"figure_path": "WPxa6OcIdg/figures/figures_17_1.jpg", "caption": "Figure 3: Weather forecasting on out-of-distribution data. (a) An out-of-distribution measurement is formed by synthetically inserting a hot spot in the northeastern part of Canada. (b) Epistemic and aleatoric uncertainty maps are produced by each method on the provided measurement. Compared to other methods, HyperDM is best able to isolate the abnormal feature in its epistemic estimate.", "description": "This figure compares the performance of different uncertainty quantification methods (MC-Dropout, DPS-UQ, and HyperDM) on a weather forecasting task when an out-of-distribution measurement (a synthetically added hot spot in northeastern Canada) is introduced.  The figure shows the epistemic and aleatoric uncertainty maps generated by each method.  HyperDM demonstrates superior performance in isolating the anomalous feature, highlighting its effectiveness in identifying unexpected events or data anomalies in real-world prediction tasks.", "section": "5 Experiments"}, {"figure_path": "WPxa6OcIdg/figures/figures_17_2.jpg", "caption": "Figure 2: Accurate uncertainty estimation using HyperDM. (a) HyperDM is trained on four 1D datasets with aleatoric uncertainty determined by noise variance στ. Variances across diffusion model predictions are visualized as one distribution per training dataset. Aleatoric estimates (i.e., the mean of each distribution) accurately predict στ. (b) HyperDM is trained on four datasets with epistemic uncertainty determined by dataset size |D|. Prediction means are visualized as one distribution per training dataset. Epistemic estimates (i.e., the variance of each distribution) grow inversely with |D|.", "description": "This figure demonstrates the accuracy of HyperDM in estimating both aleatoric and epistemic uncertainty.  In (a), four datasets with varying aleatoric uncertainty (controlled by noise variance) are used to train HyperDM, and the resulting variance of predictions accurately reflects the input noise.  In (b), four datasets of varying sizes are used, demonstrating that HyperDM accurately estimates epistemic uncertainty (which decreases as dataset size increases).", "section": "Accurate Uncertainty Estimation using HyperDM"}, {"figure_path": "WPxa6OcIdg/figures/figures_18_1.jpg", "caption": "Figure 2: Accurate uncertainty estimation using HyperDM. (a) HyperDM is trained on four 1D datasets with aleatoric uncertainty determined by noise variance σ². Variances across diffusion model predictions are visualized as one distribution per training dataset. Aleatoric estimates (i.e., the mean of each distribution) accurately predict σ². (b) HyperDM is trained on four datasets with epistemic uncertainty determined by dataset size |D|. Prediction means are visualized as one distribution per training dataset. Epistemic estimates (i.e., the variance of each distribution) grow inversely with |D|.", "description": "This figure shows the results of an experiment to validate HyperDM's ability to estimate aleatoric and epistemic uncertainty.  Panel (a) demonstrates the accurate estimation of aleatoric uncertainty (inherent noise in the data) by showing that the mean variance of predictions from the model matches the true variance in the data. Panel (b) demonstrates the accurate estimation of epistemic uncertainty (uncertainty due to limited data) by showing that the variance of the prediction means decreases as the amount of training data increases.", "section": "2.3 Diffusion Models"}]