[{"figure_path": "NsqxN9iOJ7/tables/tables_5_1.jpg", "caption": "Table 1: Video diffusion distillation comparison on the WebVid mini validation set.", "description": "This table presents a comparison of different video diffusion distillation methods on the WebVid mini validation dataset.  It shows the Fréchet Video Distance (FVD) and CLIP similarity (CLIPSIM) scores for various methods at different sampling steps (1, 2, 4, 8).  Lower FVD indicates better video quality, while higher CLIPSIM signifies better alignment between generated videos and text prompts.  The results are categorized by the teacher model used (AnimateDiff and ModelScopeT2V) and include baselines (DDIM, DPM++) and other distillation methods (LCM, AnimateLCM, AnimateDiff-Lightning) for comparison with the proposed MCM method.", "section": "4.1 Comparisons with distilled video diffusion models"}, {"figure_path": "NsqxN9iOJ7/tables/tables_6_1.jpg", "caption": "Table 1: Video diffusion distillation comparison on the WebVid mini validation set.", "description": "This table presents a comparison of different video diffusion distillation methods on the WebVid mini validation dataset.  It shows the performance of various methods (DDIM, DPM++, LCM, AnimateLCM, AnimateDiff-Lightning, and MCM) using two different teacher models (AnimateDiff and ModelScopeT2V).  The evaluation metrics are FVD (Fréchet Video Distance) at different sampling steps (1, 2, 4, and 8) and CLIPSIM (CLIP Similarity) at the same steps. Lower FVD scores indicate better video quality, while higher CLIPSIM scores suggest better alignment between generated videos and prompts. The table allows for a direct comparison of the effectiveness of various video diffusion distillation approaches in terms of both quality and fidelity.", "section": "4.1 Comparisons with distilled video diffusion models"}, {"figure_path": "NsqxN9iOJ7/tables/tables_8_1.jpg", "caption": "Table 3: Comparison on frame quality improvement. Performance is measured by FID using different numbers of sampling steps.", "description": "This table presents a comparison of frame quality improvement achieved by different methods, specifically focusing on the impact of varying the number of sampling steps. The evaluation metric is the Fréchet Inception Distance (FID), which measures the discrepancy between generated frames and real images.  Lower FID values indicate better frame quality. The table compares the performance of the proposed Motion Consistency Model (MCM) against a two-stage baseline.  The results highlight the effect of adjusting the number of sampling steps on frame quality for both MCM and the baseline, providing insights into the efficiency of the proposed method.", "section": "4.2 Video distillation with improved frame quality"}, {"figure_path": "NsqxN9iOJ7/tables/tables_8_2.jpg", "caption": "Table 4: Ablation study on each components in MCM. ModelScopeT2V [62] is used as teacher.", "description": "This ablation study demonstrates the effectiveness of each component of the Motion Consistency Model (MCM). Starting with the Latent Consistency Model (LCM) baseline, the impact of adding an adversarial objective, disentangled motion distillation, and mixed trajectory distillation is evaluated. The results, measured by FVD (Fréchet Video Distance) and CLIPSIM (CLIP similarity), show improvements in video quality and prompt alignment with each added component.", "section": "4.3 Ablation study"}, {"figure_path": "NsqxN9iOJ7/tables/tables_8_3.jpg", "caption": "Table 5: Ablation study on motion representation.", "description": "This table presents the ablation study results on different motion representation methods used in the Motion Consistency Model (MCM).  It shows the impact of using different representations (raw latent, latent difference, latent correlation, low-frequency components, high-frequency components, and learnable representation) on the video generation quality, measured by FVD and CLIPSim scores at different sampling steps (1, 2, 4, 8).  The results demonstrate that using a learnable motion representation achieves the best performance in terms of reducing FVD and improving CLIPSim scores.", "section": "4.3 Ablation study"}]