[{"figure_path": "qTypwXvNJa/figures/figures_1_1.jpg", "caption": "Figure 1: Joint shift in X and y distributions on the HarMNqEEG dataset [33]. Subset of mean PSDs (A) and age distributions (B) from three recording sites used for the empirical benchmarks.", "description": "This figure shows the joint shift in data (X) and the variable of interest (y) distributions across different recording sites. The left panel displays the mean power spectral densities (PSDs) for three sites (Barbados, Colombia, and Switzerland).  The right panel shows the age distributions for the same three sites. The figure illustrates how different recording sites can result in variations in both the EEG data itself and the age distribution of the participants within each site, highlighting the challenge of applying machine learning algorithms to this type of data without considering these shifts.", "section": "1 Introduction"}, {"figure_path": "qTypwXvNJa/figures/figures_7_1.jpg", "caption": "Figure 2: R2 scores ↑ for different methods on simulated data. Performance is measured across 5 source domains and 1 target domain, with shifts controlled by ξ (0 to maximum). Data are generated 100 times, with 5 sensors and 300 covariance matrices per domain. The target domain is randomly selected between the 6 domains generated as presented in Section 4, with the remaining domains used as sources. (A) A shift is applied on the covariance matrices following (14). (B) A shift is applied on the variances following (15). (C) Both shifts from (14) and (15) are applied simultaneously.", "description": "This figure displays the performance (R-squared) of different domain adaptation methods on simulated data under various conditions of data shift.  The x-axis represents the magnitude of the shift (ξ), ranging from no shift to a maximum shift. The three subfigures (A, B, C) show results for shifts applied to the covariance matrices (X), the variances of the underlying signal (y), and both simultaneously (X, y), respectively. The y-axis shows the R-squared values, a metric representing the goodness of fit of the models. The different colored lines represent different domain adaptation methods.  The figure demonstrates how the performance of each method changes as the shift increases, illustrating the effects of various types of data shifts.", "section": "Simulated data"}, {"figure_path": "qTypwXvNJa/figures/figures_8_1.jpg", "caption": "Figure 3: Normalized performance of the different methods on several source-target combinations for three metrics: Spearman's p↑ (left), R² score ↑ (middle) and Mean Absolute Error ↓(right). As a large variability in the score values was present between the site combinations, we applied a min-max normalization per combination to set the minimum score across all methods to 0 and the maximum score to 1. (A) Boxplot of the concatenated results for the three normalized scores. One point corresponds to one split of one site combination. (B) Boxplots of the difference between the normalized scores of GOPSA and DO Intercept. A row corresponds to one site combination, one point corresponds to one split. For each plot, the associated results of Nadeau's & Bengio's corrected t-test [37] are displayed. A p-value lower than 0.05 indicates a significant difference between the two methods. Ba: Barbados, Be: Bern, Chb: CHBMP (Cuba), Co: Columbia, Cho: Chongqing, Cu03: Cuba2003, Cu90: Cuba90, G: Germany, M: Malaysia, R: Russia, S: Switzerland", "description": "This figure displays the results of the empirical benchmarks of GOPSA on the HarMNqEEG dataset. It shows the performance of GOPSA and other baseline methods across several source-target site combinations, using three evaluation metrics: Spearman's ρ, R², and MAE.  The results are normalized using min-max scaling for better comparison. Panel A presents boxplots of the normalized scores for all methods. Panel B shows the difference between GOPSA and DO Intercept, highlighting statistically significant differences.", "section": "4 Empirical benchmarks"}, {"figure_path": "qTypwXvNJa/figures/figures_9_1.jpg", "caption": "Figure 4: Model inspection of GOPSA versus No DA and Re-center. Power Spectral Densities (PSDs) and α values were computed on the source sites Barbados, Chongqing, Germany, and Switzerland. The remaining sites were used as target domains. (A) Mean PSDs computed across sensors for No DA, Recenter and GOPSA on two source (Barbados and Switzerland) and two target (New York and Columbia) sites. (B) α values versus site's mean age for Re-center and GOPSA. One point corresponds to one site. The coefficient of determination is reported for the GOPSA method.", "description": "This figure displays a model inspection comparing GOPSA against No DA and Re-center methods.  Panel A shows the mean power spectral densities (PSDs) across sensors for four sites (two source, two target) using the three different methods. It demonstrates how GOPSA maintains relevant frequency information compared to No DA and Re-center, which show significant differences. Panel B illustrates the relationship between the alpha values learned by GOPSA and the mean age of the sites. It visually confirms the relationship and model interpretability of GOPSA's re-centering.", "section": "Results"}, {"figure_path": "qTypwXvNJa/figures/figures_17_1.jpg", "caption": "Figure 5: Age distribution of the 14 sites of the HarMNqEEG dataset [33]. The distributions are represented with a kernel density estimate. The y-scales are not shared for visualization purpose.", "description": "This figure shows the age distribution for each of the 14 sites in the HarMNqEEG dataset.  Each site's age distribution is represented as a kernel density estimate, allowing for visualization of the distribution's shape and spread. The y-axis scales are not consistent across all sites for better visualization of individual distributions.", "section": "A.5 HarMNqEEG dataset"}, {"figure_path": "qTypwXvNJa/figures/figures_19_1.jpg", "caption": "Figure 2: R2 scores ↑ for different methods on simulated data. Performance is measured across 5 source domains and 1 target domain, with shifts controlled by ξ (0 to maximum). Data are generated 100 times, with 5 sensors and 300 covariance matrices per domain. The target domain is randomly selected between the 6 domains generated as presented in Section 4, with the remaining domains used as sources. (A) A shift is applied on the covariance matrices following (14). (B) A shift is applied on the variances following (15). (C) Both shifts from (14) and (15) are applied simultaneously.", "description": "This figure displays the R-squared scores for different domain adaptation methods on simulated data with varying degrees of distribution shifts in both input features (X) and the target variable (y). Three scenarios are presented: (A) shift in X only, (B) shift in y only, and (C) joint shift in X and y. The performance of each method is evaluated across 5 source domains and 1 target domain, with 100 repetitions for each scenario. The results demonstrate the effectiveness of GOPSA in handling joint shifts and show its superiority to other methods in scenarios involving either a shift in X or y or a combination of both.", "section": "Empirical benchmarks"}, {"figure_path": "qTypwXvNJa/figures/figures_19_2.jpg", "caption": "Figure 3: Normalized performance of the different methods on several source-target combinations for three metrics: Spearman's p↑ (left), R² score ↑ (middle) and Mean Absolute Error ↓(right). As a large variability in the score values was present between the site combinations, we applied a min-max normalization per combination to set the minimum score across all methods to 0 and the maximum score to 1. (A) Boxplot of the concatenated results for the three normalized scores. One point corresponds to one split of one site combination. (B) Boxplots of the difference between the normalized scores of GOPSA and DO Intercept. A row corresponds to one site combination, one point corresponds to one split. For each plot, the associated results of Nadeau's & Bengio's corrected t-test [37] are displayed. A p-value lower than 0.05 indicates a significant difference between the two methods. Ba: Barbados, Be: Bern, Chb: CHBMP (Cuba), Co: Columbia, Cho: Chongqing, Cu03: Cuba2003, Cu90: Cuba90, G: Germany, M: Malaysia, R: Russia, S: Switzerland", "description": "This figure displays the performance comparison of different domain adaptation methods (GOPSA, DO Dummy, No DA, GREEN, Re-center, Re-scale, DO Intercept) on the HarMNqEEG dataset.  The performance is evaluated using three metrics: Spearman's ρ (correlation), R² score (coefficient of determination), and MAE (mean absolute error). The results are normalized and presented as boxplots, showing the distribution of performance across multiple source-target site combinations. Part (A) shows the overall comparison of all methods, while Part (B) focuses on the pairwise comparison between GOPSA and DO Intercept, highlighting statistically significant differences.", "section": "4 Empirical benchmarks"}, {"figure_path": "qTypwXvNJa/figures/figures_20_1.jpg", "caption": "Figure 2: R2 scores ↑ for different methods on simulated data. Performance is measured across 5 source domains and 1 target domain, with shifts controlled by ξ (0 to maximum). Data are generated 100 times, with 5 sensors and 300 covariance matrices per domain. The target domain is randomly selected between the 6 domains generated as presented in Section 4, with the remaining domains used as sources. (A) A shift is applied on the covariance matrices following (14). (B) A shift is applied on the variances following (15). (C) Both shifts from (14) and (15) are applied simultaneously.", "description": "This figure displays the R-squared scores for several methods on simulated data with varying degrees of shifts in the data (X) and the outcome variable (y).  The experiment compares the performance of GOPSA against other methods (DO Dummy, No DA, GREEN, Re-center, Re-scale, DO Intercept) across three scenarios: shift in X only, shift in y only, and joint shifts in both X and y. The x-axis represents the magnitude of the shift (ξ), while the y-axis represents the R-squared scores. Each bar represents the average performance with error bars. The results show that GOPSA demonstrates the best performance overall, especially when both X and y are shifted, highlighting its effectiveness in handling predictive shifts in multi-source domain adaptation on the Riemannian manifold.", "section": "Simulated data"}, {"figure_path": "qTypwXvNJa/figures/figures_20_2.jpg", "caption": "Figure 2: R2 scores ↑ for different methods on simulated data. Performance is measured across 5 source domains and 1 target domain, with shifts controlled by ξ (0 to maximum). Data are generated 100 times, with 5 sensors and 300 covariance matrices per domain. The target domain is randomly selected between the 6 domains generated as presented in Section 4, with the remaining domains used as sources. (A) A shift is applied on the covariance matrices following (14). (B) A shift is applied on the variances following (15). (C) Both shifts from (14) and (15) are applied simultaneously.", "description": "This figure displays the R-squared scores for various methods on simulated data, illustrating the impact of shifts in the data (X) and/or the outcome variable (y).  Three scenarios are shown: shifts in X only, shifts in y only, and joint shifts in both X and y. The intensity of the shift is controlled by ξ.  Each bar represents the average R-squared score across 100 simulations, comparing GOPSA to multiple baseline methods. The results showcase GOPSA's superiority in handling shifts, especially joint shifts in X and y.", "section": "4 Empirical benchmarks"}, {"figure_path": "qTypwXvNJa/figures/figures_21_1.jpg", "caption": "Figure 2: R2 scores ↑ for different methods on simulated data. Performance is measured across 5 source domains and 1 target domain, with shifts controlled by ξ (0 to maximum). Data are generated 100 times, with 5 sensors and 300 covariance matrices per domain. The target domain is randomly selected between the 6 domains generated as presented in Section 4, with the remaining domains used as sources. (A) A shift is applied on the covariance matrices following (14). (B) A shift is applied on the variances following (15). (C) Both shifts from (14) and (15) are applied simultaneously.", "description": "This figure compares the performance of different domain adaptation methods (DO Dummy, No DA, GREEN, Re-center, Re-scale, DO Intercept, and GOPSA) on simulated EEG data with varying levels of distribution shifts. The shifts are controlled by the parameter ξ, affecting either the covariance matrices (X), the variances of the underlying signal (y), or both simultaneously. The results are shown in terms of R2 scores, with higher scores indicating better performance.  The figure demonstrates GOPSA's effectiveness in handling various types and levels of distribution shifts in data and labels.", "section": "4 Empirical benchmarks"}]