[{"figure_path": "1ONdF1JHyJ/tables/tables_7_1.jpg", "caption": "Table 1: This table showcases the results (five runs) differences between using the CaPaint concept (+CaP) and not using it (Ori) across various datasets. All MAE and MSE values are multiplied by 100. Blue and Red backgrounds indicate the percentage improvement (reduction) in MAE and MSE, respectively.", "description": "This table presents a comparison of model performance with and without the CaPaint method across five different datasets (TaxiBJ+, KTH, SEVIR, DRS, and FireSys) and seven different backbone models (ViT, Earthfarsser, Mmvp, ConvLSTM, PredRNN-V2, MAU, and SimVP).  For each model and dataset, it shows the MAE (Mean Absolute Error) and MSE (Mean Squared Error) values for both the original model (Ori) and the model using CaPaint (+CaP). The improvement or reduction in MAE and MSE is also displayed as a percentage.  This allows for a comprehensive assessment of the impact of CaPaint across various datasets and model architectures.", "section": "4.1 Experimental settings"}, {"figure_path": "1ONdF1JHyJ/tables/tables_8_1.jpg", "caption": "Table 1: This table showcases the results (five runs) differences between using the CaPaint concept (+CaP) and not using it (Ori) across various datasets. All MAE and MSE values are multiplied by 100. Blue and Red backgrounds indicate the percentage improvement (reduction) in MAE and MSE, respectively.", "description": "This table presents a comparison of the performance of various backbone models with and without the CaPaint method across five different datasets.  The performance metrics used are MAE (Mean Absolute Error) and MSE (Mean Squared Error), both multiplied by 100 for easier readability.  The 'Ori' column represents the original model's performance without CaPaint, while '+CaP' shows the performance improvement when the CaPaint method is integrated.  Blue and red shading highlights the percentage improvement or reduction in MAE and MSE respectively, indicating how effective the CaPaint method is in improving the model's predictive accuracy.", "section": "4.1 Experimental settings"}, {"figure_path": "1ONdF1JHyJ/tables/tables_16_1.jpg", "caption": "Table 1: This table showcases the results (five runs) differences between using the CaPaint concept (+CaP) and not using it (Ori) across various datasets. All MAE and MSE values are multiplied by 100. Blue and Red backgrounds indicate the percentage improvement (reduction) in MAE and MSE, respectively.", "description": "This table presents the performance comparison between the proposed method (CaPaint) and the baseline methods on five benchmark datasets across seven backbone models. For each dataset and model, MAE (Mean Absolute Error) and MSE (Mean Squared Error) values are shown with and without CaPaint. The difference between the two is also reported in terms of percentage improvement or reduction.", "section": "4.1 Experimental settings"}, {"figure_path": "1ONdF1JHyJ/tables/tables_20_1.jpg", "caption": "Table 1: This table showcases the results (five runs) differences between using the CaPaint concept (+CaP) and not using it (Ori) across various datasets. All MAE and MSE values are multiplied by 100. Blue and Red backgrounds indicate the percentage improvement (reduction) in MAE and MSE, respectively.", "description": "The table presents a comparison of model performance with and without the CaPaint method across five different datasets and seven different backbone models.  It shows the MAE and MSE (both multiplied by 100 for readability), and the percentage improvement or reduction achieved by using CaPaint.  Blue indicates improvement in MAE, and red indicates improvement in MSE.  The results highlight the consistent performance enhancement brought by CaPaint across various datasets and model architectures.", "section": "4.1 Experimental settings"}]