[{"figure_path": "WdMhbqCoqW/tables/tables_23_1.jpg", "caption": "Table 1: Computation needs for training Bearing Only Tracking Task. Of note: none of the methods require using the whole GPU and thus we usually train 2-3 methods per GPU simultaneously. The numbers reported assume training each method 11 times sequentially without running in parallel.", "description": "This table shows the computational resources required for training different particle filter and smoother models on a bearings-only tracking task.  It details the GPU used (NVIDIA RTX 3090) and the approximate training time for each model, highlighting that training MDPS takes significantly longer than training other models. The note indicates that multiple models were trained concurrently to improve efficiency, and that the reported runtimes are based on sequential training runs.", "section": "D.1 Bearings Only Tracking Task"}, {"figure_path": "WdMhbqCoqW/tables/tables_23_2.jpg", "caption": "Table 2: Computation needs for global localization on the MGL dataset. Retrieval (PF) requires no training since all trained models are taken from the Retrieval baseline. Similarly MDPF requires no training as it is trained within MDPS.", "description": "This table presents the computational resources required for training different models for the global localization task using the Mapillary Geo-Localization (MGL) dataset. It shows the number of GPUs used, and the training time for each method. Note that Retrieval (PF) and MDPF do not require separate training because their models are reused or integrated within other models.", "section": "5.2 City Scale Global Localization Task"}, {"figure_path": "WdMhbqCoqW/tables/tables_24_1.jpg", "caption": "Table 3: Computation needs for global localization on the KITTI dataset. Retrieval (PF) requires no training since all trained models are taken from the Retrieval baseline. For MDPF we report additional resources used during refinement on the KITTI dataset.", "description": "This table presents the computational resources required for the global localization experiments on the KITTI dataset.  It details the number of GPUs used and the approximate training time for each method, noting that Retrieval (PF) did not require additional training as its models were taken from a pre-existing baseline.  MDPF training times are also reported but note that this includes a refinement stage after initial pre-training with the MGL dataset.", "section": "5.4 KITTI Dataset"}]