[{"figure_path": "hVGAGU4TKk/figures/figures_0_1.jpg", "caption": "Figure 1: We present NeuRodin, a novel two-stage framework designed for high-fidelity neural surface reconstruction with intricate structures. Requiring only posed RGB captures as inputs, NeuRodin not only recovers large-scale areas but also accurately reconstructs fine-grained details.", "description": "This figure showcases the NeuRodin framework's ability to reconstruct complex 3D scenes from RGB images with high fidelity. It highlights the method's capacity to recover both large-scale structures and fine-grained details, demonstrating its effectiveness in handling intricate geometries.", "section": "Abstract"}, {"figure_path": "hVGAGU4TKk/figures/figures_1_1.jpg", "caption": "Figure 2: Comparative analysis of SDF-based and density-based volume rendering methods. (a) Neuralangelo [13] experiences difficulties with topological transformations, leading to incorrect surfaces. (b) Instant-NGP [18] approximates the correct surface positioning yet produces a noisy surface. (c) Our method achieves high-quality surfaces with fine details.", "description": "This figure compares the results of three different methods for 3D surface reconstruction: Neuralangelo, Instant-NGP, and the authors' proposed method, NeuRodin.  It highlights the strengths and weaknesses of each approach. Neuralangelo struggles with complex topologies, resulting in inaccurate surfaces. Instant-NGP produces a noisy surface despite correctly positioning the overall structure. In contrast, the NeuRodin method accurately reconstructs a clean surface with fine details.", "section": "1 Introduction"}, {"figure_path": "hVGAGU4TKk/figures/figures_4_1.jpg", "caption": "Figure 3: Visualization of the bias of the density. (a) An ideal scenario where the geometry of the volume rendering scheme (A: maximum probability distance and B: rendered distance) aligns precisely with the geometry of the implicit surface (C: zero level set). (b) A biased scenario showcasing misalignment.", "description": "This figure illustrates the concept of density bias in SDF-based volume rendering.  The ideal scenario (a) shows perfect alignment between the geometric representation from volume rendering (maximum probability distance and rendered distance) and the implicit surface (zero level set).  The biased scenario (b) shows a misalignment, highlighting the challenge of aligning the geometric representation within the rendering framework with the implicit surface, leading to inaccuracies. This misalignment is a key problem addressed by the NeuRodin method.", "section": "3 Study on SDF-based Volume Rendering"}, {"figure_path": "hVGAGU4TKk/figures/figures_5_1.jpg", "caption": "Figure 4: The heatmap for the variance of the normal predicted using random step.", "description": "This figure shows a heatmap visualizing the variance of estimated normals using a stochastic step size for gradient calculation.  The variance is higher in areas with fine details and lower in large-scale areas. This property introduces uncertainty into the geometric regularization, allowing for flexibility in reconstructing fine details while maintaining stability for large-scale structures.", "section": "4.3 Two-Stage Optimization to Tackle Geometry Over-Regularization"}, {"figure_path": "hVGAGU4TKk/figures/figures_6_1.jpg", "caption": "Figure 2: Comparative analysis of SDF-based and density-based volume rendering methods. (a) Neuralangelo [13] experiences difficulties with topological transformations, leading to incorrect surfaces. (b) Instant-NGP [18] approximates the correct surface positioning yet produces a noisy surface. (c) Ours method achieves high-quality surfaces with fine details.", "description": "This figure compares three different methods for 3D surface reconstruction: Neuralangelo, Instant-NGP, and the authors' proposed method.  Neuralangelo struggles with complex shapes and produces incorrect surfaces. Instant-NGP correctly positions the surface but the result is noisy. The authors' method achieves high-fidelity reconstruction, capturing fine details accurately.", "section": "1 Introduction"}, {"figure_path": "hVGAGU4TKk/figures/figures_7_1.jpg", "caption": "Figure 5: Quantitative comparison on the training subset of Tanks and Temples dataset.", "description": "The figure shows a qualitative comparison of the 3D surface reconstruction results on the training subset of Tanks and Temples dataset, comparing the results of NeuS, Neuralangelo, and the proposed method (Ours) with the ground truth point cloud. The comparison highlights the ability of the proposed method to accurately reconstruct intricate geometric details while maintaining the integrity of large-scale structures. ", "section": "5 Experiments"}, {"figure_path": "hVGAGU4TKk/figures/figures_8_1.jpg", "caption": "Figure 7: Ablation results. (a) Without local scale for SDF-to-density conversion. (b) Without stochastic-step numerical gradient estimation. (c) Without explicit bias correction. (d) Without stage-two refinement. (e) Full model.", "description": "This figure demonstrates the ablation study performed on the proposed NeuRodin model. Each subfigure shows the results obtained by removing one of the key components of the model, highlighting the individual contribution of each component to the overall performance. The components are local scale for SDF-to-density conversion, stochastic-step numerical gradient estimation, explicit bias correction, and two-stage refinement. The full model combines all these components, showcasing superior reconstruction capabilities compared to the individual ablated models.", "section": "5.3 Analysis"}, {"figure_path": "hVGAGU4TKk/figures/figures_8_2.jpg", "caption": "Figure 8: Analysis on stochastic-step numerical gradient estimation. We visualize the produced depth maps at iteration 7500 of the first stage. Model A: Change stochastic-step numerical gradient estimation to analytical gradient. Model B: Change stochastic-step numerical gradient estimation to progressive numerical gradient estimation from Neuralangelo. Model C: Ours.", "description": "This figure compares the depth maps generated at iteration 7500 of the first stage by three different methods: Model A uses analytical gradient; Model B uses progressive numerical gradient estimation from Neuralangelo; Model C uses the authors' proposed stochastic-step numerical gradient estimation.  The results show that the authors' method (Model C) produces a depth map that is more similar to Instant-NGP, but with a smoother and more natural zero level set, while Models A and B struggle to accurately capture the scene geometry. The final meshes produced by each method are also displayed, highlighting the improved accuracy and quality of the mesh produced using Model C.", "section": "3.2 Challenges in Previous SDF-Based Volume Rendering"}, {"figure_path": "hVGAGU4TKk/figures/figures_9_1.jpg", "caption": "Figure 9: Analysis on explicit bias correction. We visualize the produced depth maps with and without explicit bias correction for different SDF-to-density modelings at the first stage.", "description": "This figure compares the depth maps generated by three different SDF-based volume rendering methods (VolSDF, NeuS, and TUVR) with and without the explicit bias correction proposed in the paper. The comparison highlights the impact of the bias correction on aligning the geometric representation within the rendering framework with that of the implicit surface. The results show that the explicit bias correction effectively reduces the bias, leading to more accurate depth maps.", "section": "4 Method"}, {"figure_path": "hVGAGU4TKk/figures/figures_13_1.jpg", "caption": "Figure 10: Explanation of the motivation behind the use of the local scale factor.", "description": "This figure illustrates the impact of using a global versus a local scale factor in SDF-to-density conversion. The left side shows a scenario without a local scale factor. In this case, both low-texture and rich-texture regions share the same distribution and bias, resulting in poor surface convergence, especially in the rich-texture region. The right side demonstrates the use of a local scale factor. Here, each region exhibits a unique distribution and bias, which allows for accurate localization and improved reconstruction quality, especially in areas with intricate details.", "section": "A Analysis of Local Scale in SDF-to-Density Transformation"}, {"figure_path": "hVGAGU4TKk/figures/figures_15_1.jpg", "caption": "Figure 11: Visual results on ScanNet++ with different designs of our explicit bias correction. Penalty on both sides of t* will lead to erroneous surface", "description": "This figure shows a comparison of 3D surface reconstruction results on the ScanNet++ dataset using two different designs for the explicit bias correction method.  The explicit bias correction aims to align the maximum probability distance with the zero level set in volume rendering. The left image (a) shows the results when a penalty is applied on both sides of t* (the maximum probability distance), which leads to an erroneous surface with artifacts. The right image (b) displays the results when the penalty is applied only on the SDF after t*, resulting in a significantly improved surface reconstruction with fewer artifacts.", "section": "4.2 Explicit Bias Correction"}, {"figure_path": "hVGAGU4TKk/figures/figures_15_2.jpg", "caption": "Figure 11: Visual results on ScanNet++ with different designs of our explicit bias correction. Penalty on both sides of t* will lead to erroneous surface", "description": "This figure shows the visual results of applying different explicit bias correction methods on ScanNet++.  The top row shows the reference images. The bottom row shows results from three different bias correction methods. The results show that applying penalty only to the SDF values after the maximum probability distance (t*) produces more accurate surfaces compared to methods that apply penalty on both sides of t*. This highlights the effectiveness of the proposed explicit bias correction method.", "section": "4.2 Explicit Bias Correction"}, {"figure_path": "hVGAGU4TKk/figures/figures_16_1.jpg", "caption": "Figure 13: A particular scenario for density bias. In this situation TUVR exhibits a more pronounced bias compared to VolSDF.", "description": "The figure illustrates a scenario where the TUVR method demonstrates a greater density bias compared to VolSDF.  Panel (a) shows a 2D representation of a ray intersecting three planes. Panel (b) displays the rendering weight distribution for both TUVR and VolSDF along the ray. The key observation is that TUVR’s rendering weight has a larger peak at a location prior to the SDF zero-crossing point, indicating a greater bias than VolSDF.", "section": "3.2 Challenges in Previous SDF-Based Volume Rendering"}, {"figure_path": "hVGAGU4TKk/figures/figures_17_1.jpg", "caption": "Figure 11: Visual results on ScanNet++ with different designs of our explicit bias correction. Penalty on both sides of t* will lead to erroneous surface", "description": "This figure shows visual results on the ScanNet++ dataset comparing three different designs of the explicit bias correction method. The first design penalizes both sides of t*, resulting in an erroneous surface. The second design penalizes the SDF only after t*, which effectively addresses the bias issue. The third design employs the proposed method, resulting in an improved reconstruction of the surface.", "section": "4.2 Explicit Bias Correction"}, {"figure_path": "hVGAGU4TKk/figures/figures_20_1.jpg", "caption": "Figure 2: Comparative analysis of SDF-based and density-based volume rendering methods. (a) Neuralangelo [13] experiences difficulties with topological transformations, leading to incorrect surfaces. (b) Instant-NGP [18] approximates the correct surface positioning yet produces a noisy surface. (c) Our method achieves high-quality surfaces with fine details.", "description": "This figure compares the results of three different methods for 3D surface reconstruction: Neuralangelo, Instant-NGP, and the authors' proposed method, NeuRodin.  It highlights the challenges faced by SDF-based methods (Neuralangelo) in handling complex topologies, and the limitations of density-based methods (Instant-NGP) in producing clean, detailed surfaces. NeuRodin, on the other hand, is shown to successfully reconstruct high-quality surfaces with fine details.", "section": "1 Introduction"}, {"figure_path": "hVGAGU4TKk/figures/figures_22_1.jpg", "caption": "Figure 1: We present NeuRodin, a novel two-stage framework designed for high-fidelity neural surface reconstruction with intricate structures. Requiring only posed RGB captures as inputs, NeuRodin not only recovers large-scale areas but also accurately reconstructs fine-grained details.", "description": "This figure shows the overall framework of NeuRodin, a two-stage method for high-fidelity neural surface reconstruction.  The framework takes only posed RGB images as input and is able to reconstruct both large-scale areas and fine-grained details, even with intricate structures.", "section": "1 Introduction"}, {"figure_path": "hVGAGU4TKk/figures/figures_22_2.jpg", "caption": "Figure 1: We present NeuRodin, a novel two-stage framework designed for high-fidelity neural surface reconstruction with intricate structures. Requiring only posed RGB captures as inputs, NeuRodin not only recovers large-scale areas but also accurately reconstructs fine-grained details.", "description": "This figure shows the NeuRodin architecture, a two-stage framework for high-fidelity neural surface reconstruction.  The framework is designed to handle intricate structures and uses only posed RGB images as input. The results demonstrate the ability to reconstruct both large-scale areas and fine-grained details.", "section": "Abstract"}]