[{"type": "text", "text": "EMR-MERGING: Tuning-Free High-Performance Model Merging ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Chenyu Huang1†, Peng $\\mathbf{Ye}^{1,3\\dagger\\ddagger}$ , Tao Chen1∗, Tong $\\mathbf{H}\\mathbf{e}^{2}$ , Xiangyu $\\mathbf{Y}\\mathbf{u}\\mathbf{e}^{3}$ , Wanli Ouyang3 ", "page_idx": 0}, {"type": "text", "text": "1 Fudan University 2 Shanghai AI Laboratory 3 The Chinese University of Hong Kong cyhuang24@m.fudan.edu.cn ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "The success of pretrain-finetune paradigm brings about the release of numerous model weights. In this case, merging models finetuned on different tasks to enable a single model with multi-task capabilities is gaining increasing attention for its practicability. Existing model merging methods usually suffer from (1) significant performance degradation or (2) requiring tuning by additional data or training. In this paper, we rethink and analyze the existing model merging paradigm. We discover that using a single model’s weights can hardly simulate all the models’ performance. To tackle this issue, we propose ELECT, MASK & RESCALEMERGING (EMR-MERGING). We first (a) elect a unified model from all the model weights and then (b) generate extremely light-weight task-specific modulators, including masks and rescalers, to align the direction and magnitude between the unified model and each specific model, respectively. EMR-MERGING is tuning-free, thus requiring no data availability or any additional training while showing impressive performance. We find that EMR-MERGING shows outstanding performance compared to existing merging methods under different classical and newly-established settings, including merging different numbers of vision models (up to 30), NLP models, PEFT models, and multi-modal models. 1 ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "With the rapid development of deep learning, different model architectures [36, 22, 71, 88] are proposed, along with multiple training strategies [89, 86]. Pre-trained models’ capabilities are enhanced, thus showing increasing significance [54, 22, 7, 19]. Finetuning models on downstream tasks from a pre-trained model has become a standard paradigm in both NLP and vision fields [20, 51, 19, 22, 5, 87], which usually leads to improved performance with less labeled data. With the development of open-source repositories such as Huggingface [79], timm [77], and torchvision [44], the number of pre-trained and finetuned checkpoints exponentially rise. However, applying individual models to different tasks results in high storage and deployment costs. Multi-task learning (MTL) partially solves this problem by jointly training a model using multiple datasets [70, 93, 95], but it suffers from (i) high computational costs and (ii) data unavailability due to privacy [33]. Recently, model merging attempts to solve these drawbacks by combining weights instead of additional training, thus showing vital significance and broad application prospects. ", "page_idx": 0}, {"type": "text", "text": "A simple strategy of model merging is averaging the model weights [80], but it usually causes obvious performance degradation, as shown in Fig. 1. To this end, there are multiple model merging methods proposed to improve the performance of the merged model, which can be roughly divided into three categories: (i) Weighted averaging of model weights include Fisher-Merging [46] and RegMean [33]. They use pre-computed Fisher information matrices [23] and inner-product matrices [33] to tune the coefficients for weighted averaging. (ii) Task vector-based methods that add task vectors together instead of model weights, include Task Arithmetic [30], Ties-Merging [84], and AdaMerging [85]. Ties-Merging handles the interference issue and AdaMerging adaptively tunes the merging coefficients. (iii) Pre-processing techniques include DARE [90]. It reduces interference by dropping most elements and rescaling the others in task vectors. Despite the promising results, there are two unresolved problems with the existing model merging methods: (1) The performance gap between the merged model and individual models or MTL is still obvious, as shown in Fig. 1. (2) The performance improvement of existing methods depends on tuning by data or training, as shown in Tab. 1. ", "page_idx": 0}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "To boost the performance of model merging, we rethink and analyze the existing model merging paradigm. We discover that the goal of all the existing methods is to obtain a single model applicable to all the $N$ tasks, as follows: ", "page_idx": 1}, {"type": "equation", "text": "$$\nW_{M}=\\mathcal{M}\\left(\\left[W_{1}..W_{N}\\right]\\right),\n$$", "text_format": "latex", "page_idx": 1}, {"type": "text", "text": "where $[W_{1}..W_{N}]$ are the model weights to be merged, $\\mathcal{M}$ denotes the merging function, and $W_{M}$ is the merged model weight. This paradigm may inevitably lead to a nonnegligible gap between the merged model and each individual model, especially when there are numerous models or models on challenging tasks. We argue that using a single model weight to simulate all the model weights is sub-optimal. To tackle this issue, we propose a brand new merging paradigm: We first extract a unified model weight from all the models’ weights, and then we calculate and store significant but lightweight task-specific parts of each model weight. This process can be written as: ", "page_idx": 1}, {"type": "equation", "text": "$$\nW_{u n i},[E_{1}..E_{N}]=\\mathcal{M}^{\\prime}\\left([W_{1}..W_{N}]\\right),\n$$", "text_format": "latex", "page_idx": 1}, {"type": "text", "text": "where $W_{u n i}$ represents the common and shared part of all model weights and $[E_{1}..E_{N}]$ denote the task-specific parts of each model weight. $\\mathcal{M}^{\\prime}$ is the revised merging function following our paradigm. ", "page_idx": 1}, {"type": "image", "img_path": "lYdjzx3DYu/tmp/40b2bce1241fb5571a1d06c4c045f6ecce61fb086ae39e6ee3d253dc679491cd.jpg", "img_caption": [], "img_footnote": [], "page_idx": 1}, {"type": "text", "text": "Figure 1: The average accuracy of the multi-task performance of different model merging methods on eight vision tasks. Among all the merging methods, our EMR-MERGING is the only one comparable to the performance of MTL and even individual models. ", "page_idx": 1}, {"type": "table", "img_path": "lYdjzx3DYu/tmp/ffc49764eb8899a3686cf597e898e8bb3c2ec330ccec3b43b459e6c6b480e844.jpg", "table_caption": ["Table 1: Prerequisites for each method’s working. "], "table_footnote": [], "page_idx": 1}, {"type": "text", "text": "Based on the above paradigm, we propose EMR-MERGING (ELECT, MASK & RESCALE-MERGING). We first elect a unified model from all the model weights. The election strategy is choosing the maximum absolute value of each parameter on the specified sign direction to minimize interference and avoid additional tuning. Then we generate additional lightweight task-specific modulators, including masks and rescalers. Their functions are respectively to align the direction and magnitude of the unified model with the original task-specific model. We find that applying the task-specific modulators to the unified model can better approximate the task-specific model, thus improving performance. The detailed process, theoretical and empirical analysis of the proposed method are illustrated in Section 3. By applying our method, the performance of model merging is significantly enhanced and is comparable to MTL or individual models, as shown in Fig. 1. Meanwhile, EMRMERGING requires no data, tuning, or any additional training, as shown in Tab. 1. ", "page_idx": 1}, {"type": "text", "text": "We first demonstrate the effectiveness of the proposed EMR-MERGING under the existing setting of (1) merging Vision Transformer (ViT) [22] models of different sizes on 8 vision tasks, (2) merging parameter-efficient finetuning (PEFT) models on 11 language tasks, and (3) merging GPT-2 [55] models on 7 language tasks. Our method shows significant performance improvement under these settings, even when compared to the strongest baseline. We further validate the method’s effectiveness under newly-established and more challenging settings including: (4) merging ViTs on 30 vision tasks, (5) merging RoBERTa [43] models on 8 NLP tasks, and (6) merging BEiT3 [75] models on 5 multi-modal tasks. ", "page_idx": 1}, {"type": "image", "img_path": "lYdjzx3DYu/tmp/1128a45f8ff801ea951d81a3fcb90ada80a940e4fe041f5ee3aaafb4ffea2b5a.jpg", "img_caption": ["Figure 2: Framework overview. In the (a) Merging Procedure, we merge task-specific vectors into a unified task vector and lightweight task-specific modulators to modulate direction and amplitude. During the (b) Inference Procedure, we apply the corresponding mask and rescaler to the unified task vector to obtain a specific task vector. The process of (c)Task-specific Direction and Amplitude Modulation includes obtaining task-specific masks and scalers. "], "img_footnote": [], "page_idx": 2}, {"type": "text", "text": "", "page_idx": 2}, {"type": "text", "text": "Our contributions can be summarized as: (1) We propose a novel merging method called EMRMERGING, which merges task-specific models into a unified model and lightweight task-specific modulators (i.e., masks and rescalers), requiring no data, tuning, or additional training. (2) The proposed EMR-MERGING is simple-but-effective, and its effectiveness is validated on various classical benchmarks and newly-established benchmarks under various vision, NLP, PEFT, and multi-modal settings. (3) We show that the masks and rescalers of EMR-MERGING for aligning task-specific direction and amplitude of task vectors are applicable to most kinds of merging methods. ", "page_idx": 2}, {"type": "text", "text": "2 Related Work ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Model Merging obtains a model using the existing task-specific model weights instead of training [33, 30, 84, 85, 66, 90, 46]. Simply averaging [80] usually causes severe performance degradation. Various methods are proposed to handle this problem. Fisher-Merging [46] and RegMean [33] use fisher information matrices [23] and inner-product matrices [33] to calculate the merging coefficients for weighted merging. However, they require additional matrices released by model owners or manually computed. Task Arithmetic [30] merges models by adding together task vectors, which is the difference between the finetuned and pre-trained models. Ties-Merging [84] and AdaMerging [85] are based on task vectors. Ties-Merging resolves interference and AdaMerging adaptively learns the merging coefficients. However, the performance of Task Arithmetic and Ties-Merging highly depends on manually tuning the merging coefficients and AdaMerging needs additional training to obtain them. DARE [90] reduces interference by randomly dropping most elements and rescaling the remaining ones in each task vector before merging. However, DARE’s performance is only validated under the setting of merging a limited number of tasks and the performance gain is also limited. In addition, all the existing methods merge models into a single one, and have not been verified under experimental settings of more models to merge, models on more difficult tasks, and multi-modal models. In this paper, we propose EMR-MERGING, which requires no tuning while showing impressive performance under various settings. ", "page_idx": 2}, {"type": "text", "text": "", "page_idx": 3}, {"type": "text", "text": "Multi-Task Learning trains a single model using training data from multiple tasks together [70, 93, 95]. MTL typically necessitates access to the labeled data of multiple tasks for training the model from scratch. Though enabling the model multi-task capabilities, MTL suffers from not only (i) the expensive computational cost for training, especially for large models, but also (ii) the limited data availability due to data privacy [85]. In comparison, model merging solves the mentioned problems by combining the model weights without using training data or additional training, thus obtaining a multi-task model while sharply reducing the costs. ", "page_idx": 3}, {"type": "text", "text": "Supervised Finetuning from pre-trained models on down-stream tasks is becoming a standard paradigm in both NLP and vision fields [20, 51, 19, 22, 5]. Depending on whether all the parameters of models are adjusted, SFT can be divided into conventional full finetuning (FFT) and parameterefficient finetuning (PEFT), which is proposed to reduce the number of trainable parameters for downstream tasks by adjusting the inserted small modules called adapters while keeping the whole model frozen [28, 29, 42]. PEFT is becoming the prevailing method to adapt pre-trained large models because of its efficiency [94]. There are a large number of pre-trained, full finetuned model weights, and PEFT module weights available on public repositories [79, 77, 44]. In this paper, the proposed EMR-MERGING is based on the common pretrain-finetune paradigm and we show the applicability of our method to both full finetuned models and PEFT modules. ", "page_idx": 3}, {"type": "text", "text": "3 Method ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "3.1 Motivation ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Given $N$ tasks $\\left[T_{1}..T_{N}\\right]$ , the goal of model merging is to obtain a model applicable to all the tasks using finetuned models $[W_{1}..W_{N}]$ from the same pre-trained model $W_{p r e}$ on each task. Existing methods focus on merging the models into a single model $W_{M}$ . Please check Appendix C for detailed information on the existing merging methods. However, a single model can hardly represent all the model weights, thus causing severe performance drops. We discover that the combination of a unified task vector and lightweight task-specific modulators can settle this issue to a significant extent by approximating the task-specific vectors better without any additional tuning. The size of proposed task-specific modulators is discussed in Section 4.4, which is much smaller than that of a model. ", "page_idx": 3}, {"type": "text", "text": "3.2 ELECT, MASK & RESCALE-MERGING ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "The overall framework of EMR-MERGING is shown in Fig. 2. We follow the setting of task vectorbased methods [30, 84, 85] and we merge models using task vectors. For task $T_{i}$ , $i\\in[1..N]$ , the corresponding task vector is defined as $\\tau_{i}=W_{i}-W_{p r e}$ , where ${\\tau_{i}}\\in\\mathbb{R}^{d}$ . ", "page_idx": 3}, {"type": "text", "text": "Electing a unified task vector We first create an aggregate elected sign vector $\\begin{array}{r}{\\gamma_{u n i}=s g n(\\sum_{t=1}^{N}\\tau_{t})}\\end{array}$ by choosing the sign with the higher total magnitude of each parameter across all relevant task vectors. Then we choose the maximum absolute value of each parameter with the sign consistent with $\\gamma_{u n i}$ from all the task vectors and obtain absolute value vector $\\epsilon_{u n i}\\in\\mathbb{R}^{d}$ . By combining $\\gamma_{u n i}$ and $\\epsilon_{u n i}$ , the unified task vector can be obtained by $\\tau_{u n i}=\\gamma_{u n i}\\odot\\epsilon_{u n i}$ . The electing procedure can reserve the maximum amplitude and sign information shared by the task vectors, thereby maximally reducing interference. The unified task vector $\\tau_{u n i}$ corresponds the $W_{u n i}$ in Eq. 2. Before being applied to task $T_{i}$ , the $\\tau_{u n i}$ needs to be modulated in advance by task-specific modulators, which are corresponding to $E_{i}$ in Eq. 2. The generation of task-specific modulators is described below: ", "page_idx": 3}, {"type": "text", "text": "Task-specific masks. Next, we compare the unified task vector $\\tau_{u n i}$ with each task vector $\\tau_{i}$ . The taskspecific mask $M_{i}=(\\tau_{i}\\odot\\tau_{u n i}>0)$ for task $i$ sets the elements whose signs are not correspondent with $\\tau_{u n i}$ to zero and the rest to one. The function of the masks is to align the direction of the unified model with the task-specific model. The masks share the same structure with the task-specific models but due to their 1-bit nature, the size of a mask is much smaller than that of a task vector. ", "page_idx": 3}, {"type": "text", "text": "Task-specific Rescalers Then, for each task, we compute a rescaler parameter to keep the average absolute value of the elements in $\\tau_{t}$ and $M_{t}\\odot\\tau_{u n i}$ equal. The function of the rescalers $\\lambda_{i}\\,=$ $\\frac{s u m\\big(a b s(\\tau_{i})\\big)}{s u m\\big(a b s(M_{i}\\odot\\tau_{F}\\big)\\big)}$ is to align the parameter magnitude of the unified model with the task-specific model. The significance of rescaling is also reported by DARE [90], which claims that after dropping most elements in a task vector, rescaling the rest leads to better results compared to not. ", "page_idx": 3}, {"type": "image", "img_path": "lYdjzx3DYu/tmp/16df15938a035473e46abbe183af4d9ce0ebb56e9445aab541958063233641d2.jpg", "img_caption": ["Figure 3: Partial (a) t-SNE and (b) Grad-CAM visualization results of EMR-MERGING’s procedures. "], "img_footnote": [], "page_idx": 4}, {"type": "text", "text": "", "page_idx": 4}, {"type": "text", "text": "Before being applied to a task, a task-specific modulation is required to be conducted to the unified task vector. After that, we add it to the pre-trained parameter values $W_{p r e}$ . The inference steps of applying the merged model to task $t$ are as follows: $\\hat{W}_{t}=W_{p r e}+\\hat{\\tau}_{t}$ , where $\\hat{\\tau}_{t}=\\lambda_{t}\\cdot M_{t}\\odot\\tau_{u n i}$ . It should be noted that during the whole process, no additional tuning is needed, thus requiring no data or additional training. We summarize the algorithm flow in Appendix A. ", "page_idx": 4}, {"type": "text", "text": "3.3 Theoretical analysis ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "Our goal is to merge model weights by minimizing the distance between the merged model $W_{u n i}$ and each individual model $W_{i}$ , where the distance can be calculated by: ", "page_idx": 4}, {"type": "equation", "text": "$$\nD i s=\\frac{\\sum_{i=1}^{N}\\|W_{i}-W_{u n i}\\|^{2}}{N}=\\frac{\\sum_{i=1}^{N}\\|\\tau_{i}-\\tau_{u n i}\\|^{2}}{N}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $\\tau_{i}$ refers to the task vector for task $T_{i}$ and $\\tau_{u n i}$ is the unified task vector. ", "page_idx": 4}, {"type": "text", "text": "Analysis 1: Effectiveness of Masks. After applying the masks $M_{i}=(\\tau_{i}\\odot\\tau_{u n i}>0)$ to the unified model $\\tau_{u n i}$ , the distance $D i s^{M}$ can be formulated as: ", "page_idx": 4}, {"type": "equation", "text": "$$\nD i s^{M}=\\frac{\\sum_{i=1}^{N}\\|\\tau_{i}-M_{i}\\odot\\tau_{u n i}\\|^{2}}{N}\\leq D i s\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $D i s$ refers to the distance before applying the masks. Eq. 4 demonstrates that the distance between the merged model and each individual model can be reduced after applying the masks. ", "page_idx": 4}, {"type": "text", "text": "Analysis 2: Effectiveness of Rescalers. After applying the rescalers $\\begin{array}{r}{\\lambda_{i}=\\frac{s u m\\left(a b s\\left(\\tau_{i}\\right)\\right)}{s u m\\left(a b s\\left(M_{i}\\odot\\tau_{F}\\right)\\right)}}\\end{array}$ to the masked task vectors $M_{i}\\cdot\\tau_{u n i}$ , the distance $D i s^{M,\\lambda}$ is formulated as: ", "page_idx": 4}, {"type": "equation", "text": "$$\nD i s^{M,\\lambda}=\\frac{\\sum_{i=1}^{N}\\|\\tau_{i}-\\lambda_{i}\\cdot M_{i}\\odot\\tau_{u n i}\\|^{2}}{N}\\leq D i s^{M}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Eq. 5 demonstrates that the distance between the merged model and each individual model can be minimized after applying the rescalers. Please check Appendix B for detailed proof. ", "page_idx": 4}, {"type": "text", "text": "3.4 Empirical analysis ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "In Fig. 3, we visualize partial results of merging eight ViT-B/32 models on different tasks using t-SNE [69] and Grad-CAM [61]. It can be seen that each procedure of EMR-MERGING can help improve the performance of the merged model and perform closer to individual models. Specifically, a more obvious distinction is shown in t-SNE and a more precise target is focused by Grad-CAM. Please check Section 4.1.1 for experimental details and Appendix E for more visualization results. ", "page_idx": 4}, {"type": "table", "img_path": "lYdjzx3DYu/tmp/3c5b26102dbb8eadab5dda37fb3fc150bc5fc8e8399b51cda3d8b7b3b742ba37.jpg", "table_caption": ["Table 2: Multi-task performance when merging ViT-B/32 models on eight tasks. "], "table_footnote": [], "page_idx": 5}, {"type": "table", "img_path": "lYdjzx3DYu/tmp/c2e812817cb94237b58093387a183516caff7a46736fc189de6f163b97ed7c88.jpg", "table_caption": ["Table 3: Multi-task performance when merging ViT-L/14 models on eight tasks. "], "table_footnote": [], "page_idx": 5}, {"type": "text", "text": "In Fig. 4, we compare sign conflicts, L2 distance, and cosine similarity between the merged model weights obtained by different merging methods and the task-specific model weights. It can be seen that EMR-MERGING significantly reduces sign conflicts and L2 distance and improves the cosine similarity, indicating that EMRMERGING approximates each taskspecific model weight effectively. The configuration of Fig. 4 can be found in Appendix F. ", "page_idx": 5}, {"type": "image", "img_path": "lYdjzx3DYu/tmp/4afb5cf05d1eada5b66d98ef570075baf75f88c06aab235a700f539bfb589552.jpg", "img_caption": ["Figure 4: Comparison of (a) sign conflicts, (b) L2 distance, and (c) cosine similarity of model weights obtained by different methods and task-specific model weights. "], "img_footnote": [], "page_idx": 5}, {"type": "text", "text": "4 Experiment Validation ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "Baseline methods. We compare the proposed EMR-MERGING with: (1) Individual Models, (2) Traditional MTL, (3) Weight Averaging, (4) Fisher Merging [46], (5) RegMean [33], (6) Task Arithmetic [30], (7) Ties-Merging [84], (8) AdaMerging [85]. For more details about baseline methods, please check Appendix C. ", "page_idx": 5}, {"type": "text", "text": "4.1 Merging vision models ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "4.1.1 Merging 8 ViTs. ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "Settings. We follow the setting from Task Arithmetic [30], Ties-Merging [84], and AdaMerging [85]. We employ ViT-B/32 and ViT-L/14, two variants of CLIP [54] models’ visual encoders, as the pre-trained models. The performance of each method is evaluated by eight image classification tasks, including SUN397 [83], Cars [35], RESISC45 [10], EuroSAT [27], SVHN [91], GTSRB [65], MNIST [38], and DTD [11]. All the datasets are evaluated by accuracy. ", "page_idx": 5}, {"type": "text", "text": "Results. The experimental results of merging ViT-B/32 and ViT-L/14 on eight tasks are shown in Tab. 2 and Tab. 3. We observe that EMR-MERGING shows significant performance improvement compared to existing merging methods, respectively $7.6\\%$ and $2.7\\%$ . Notably, EMR-MERGING requires no additional training, tuning, or any dataset accessibility while outperforming AdaMerging and Ties-Merging, which require additional training or careful hyper-parameter tuning using datasets. Under this setting, EMR-MERGING performs very close to or even better than traditional MTL, which is normally considered as a reference upper bound for model merging work [85]. For visualized comparison, we provide some visualization results of different merging methods using t-SNE and Grad-CAM in Fig. 5. It can be seen that among all the merging methods, the visualization results of EMR-MERGING are the closest to individual models, which corresponds to quantitative results. Please check Appendix E for more visualization results. ", "page_idx": 5}, {"type": "image", "img_path": "lYdjzx3DYu/tmp/960bc85aa1b9a88561faf2f835780d4af5477ab60238625eec05dacd18e6faeb.jpg", "img_caption": ["Figure 5: Partial visualization results of different merging methods, (a) t-SNE and (b) Grad-CAM. "], "img_footnote": [], "page_idx": 6}, {"type": "table", "img_path": "lYdjzx3DYu/tmp/24f94632cb1ccfacf70e510cab14e1a9c58eed8e321a7c269bb090997385c160.jpg", "table_caption": ["Table 4: Task-specific and average performance when merging ViT-B/16 models on 30 tasks. "], "table_footnote": [], "page_idx": 6}, {"type": "text", "text": "", "page_idx": 6}, {"type": "text", "text": "4.1.2 Merging 30 ViTs. ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "Settings. To further explore the performance of EMR-MERGING, we establish a new benchmark on merging vision models, expanding the number of task-specific models from eight to 30. We employ ViT-B/16 [22] pre-trained on ImageNet-21k [18] as the pre-trained model. The performance is evaluated by image classification datasets including MNIST [38], CIFAR-10 [36], Vegetables [1], Food-101 [6], Kvasir-v2 [53], Cars [35], Intel Images [4], EuroSAT [27], Weather [82], Cats and dogs [15], MangoLeafBD [2], Beans [37], CIFAR-100 [36], GTSRB [65], SVHN [91], Dogs [34], Fashion MNIST [81], Oxford-IIIT-Pet [50], Landscape Recognition [17], Flowers Recognition [45], STL-10 [12], CUB-200-2011 [73], EMNIST [13], DTD [11], RESISC45 [10], SUN397 [83], KenyanFood13 [32], Animal-10N [64], Garbage Classification [8], and Fruits-360 [47], covering tasks from common food classification to disease detection. All of them are evaluated by accuracy. ", "page_idx": 6}, {"type": "text", "text": "Results. The experimental results are shown in Tab. 4. It can be clearly seen that under this challenging setting of merging 30 models, all the existing methods show significant performance drops compared to individual models. Even RegMean, which performs best among existing methods, still exhibits a performance decay of nearly $25\\bar{\\%}$ . However, EMR-MERGING can reduce this value to $3.48\\%$ . This shows that the proposed method maintains the performance comparable to individual models when merging vision models even if the number of tasks increases. ", "page_idx": 6}, {"type": "table", "img_path": "lYdjzx3DYu/tmp/ade959c7be6743327c9826a73d4f8da5cff2714fe29a496e633fb3737fee8cb5.jpg", "table_caption": ["Table 5: Results of merging RoBERTa models on eight datasets from GLUE benchmark. "], "table_footnote": [], "page_idx": 7}, {"type": "table", "img_path": "lYdjzx3DYu/tmp/63142b5ac24a75ce623e83c77240a5d5044312ded39f9065b249e25c3d8e4cea.jpg", "table_caption": ["Table 6: Multi-task performance when merging GPT-2 models on seven text classification tasks. "], "table_footnote": [], "page_idx": 7}, {"type": "text", "text": "", "page_idx": 7}, {"type": "text", "text": "4.2 Merging language models ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "4.2.1 Merging fully finetuned RoBERTa models ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "Settings. We partially follow the setting from DARE [90]. However, instead of merging two or three models at a time, we merge all eight models finetuned on each task. RoBERTa-base [43] model is selected as the pre-trained model. The performance of each method is evaluated by eight tasks from GLUE [74] benchmark, respectively CoLA [76], SST-2 [63], MRPC [21], STS-B [9], QQP [31], MNLI [78], QNLI [56], and RTE [24]. Among them, CoLA is evaluated by the Matthews correlation coefficient, STS-B is evaluated by the average value of Pearson and Spearman correlation coefficients, and the rest tasks are evaluated by accuracy. ", "page_idx": 7}, {"type": "text", "text": "Results. The experimental results are shown in Tab. 5. It can be seen that EMR-MERGING outperforms all the existing methods on every task, verifying the applicability of the proposed method to language models. Note that the reported results of Ties-Merging, Task Arithmetic, and RegMean are the best among multiple hyper-parameter settings. Please check Appendix D.4 for more detailed information. It should also be noted that we find that under our setting of merging multiple models, DARE may not help improve the performance. Similar results were also reported by [25]. This may be due to DARE’s random dropping strategy can no longer resolve confilcts among task vectors under the setting of merging multiple models. Please check Appendix D.3 for DARE’s experimental results. ", "page_idx": 7}, {"type": "text", "text": "4.2.2 Merging fully finetuned GPT-2 models ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "Settings. We follow the setting from FusionBench [68], a benchmark for model merging. We merge GPT-2 [55] models on seven tasks from GLUE [74], each with a different head for classification. Under this setting, each task is evaluated by accuracy. ", "page_idx": 7}, {"type": "text", "text": "Results. The experimental results are shown in Tab. 6. EMR-MERGING outperforms all the merging methods by over $10\\%$ and decreases the performance degradation caused by model merging from $12\\%$ to $1.6\\%$ . This validates the applicability of EMR-MERGING to fully finetuned GPT2-scale language models. ", "page_idx": 7}, {"type": "text", "text": "4.2.3 Merging PEFT models ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "Settings. We follow the setting from Ties-Merging [84]. (IA)3 [42] is a PEFT method that uses learned vectors to scale the base model activations. We use T0-3B [60] as the base model and merge $\\mathrm{(IA)^{3}}$ modules. The performance is evaluated using eleven datasets, including RTE [24], CB [16], ", "page_idx": 7}, {"type": "table", "img_path": "lYdjzx3DYu/tmp/39cba1dc964a6b22d8856ee1f550be79ace34b6175133323a65093cd6d8c42a8.jpg", "table_caption": ["Table 7: Results of merging $\\mathrm{(IA)^{3}}$ models on eleven NLP tasks. "], "table_footnote": [], "page_idx": 8}, {"type": "table", "img_path": "lYdjzx3DYu/tmp/75e8ec95620569f11fc6221b5d082c195ae2a8244fd98659b05b8fab3ba9ee9a.jpg", "table_caption": ["Table 8: Results of merging multi-modal BEiT3 models on five vision-language tasks. "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "Winogrande [59], WiC [52], WSC [39], COPA [58], H-SWAG [92], Story Cloze [62], and ANLI [48] from R1 to R3. All the datasets are evaluated by accuracy. ", "page_idx": 8}, {"type": "text", "text": "Results. The experimental results are shown in Tab. 7. EMR-MERGING outperforms all the merging methods. Compared to methods without validation, EMR-MERGING improves the average accuracy on each task by $2.2\\%$ . When compared to methods that require validation data to tune hyper-parameters or compute matrices for weighted merging, EMR-MERGING still improves the average performance by $0.7\\%$ , validating the applicability of our method to PEFT models. ", "page_idx": 8}, {"type": "text", "text": "4.3 Merging multi-modal models ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "Settings. We merge BEiT3-base [75] models finetuned on five datasets from different kinds of tasks, respectively ImageNet-1k [18] (Image Classification), VQAv2 [26] (Visual Question Answering), NLVR2 [67] (Visual Reasoning), COCO Captioning [41] (Image Captioning), and COCO Retrieval [41] (Image-Text Retrieval). Among them, COCO Captioning is evaluated by BLEU4 [49], CIDEr [72], METEOR [3], and ROUGE-L [40]. The other tasks are evaluated by accuracy. ", "page_idx": 8}, {"type": "text", "text": "Results. The experimental results are shown in Tab. 8. It can be seen that EMR-MERGING performs best on all the vision-language tasks regardless of which evaluation metric is applied among all the merging methods, validating the effectiveness of EMR-MERGING in merging multi-modal models. ", "page_idx": 8}, {"type": "text", "text": "4.4 Merging different number of models ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "In Fig. 6, we compare the number of parameters and performance using individual models, Ties-Merging, and EMRMERGING when merging different numbers of ViT-B/32 models under the setting of no-validation. ", "page_idx": 8}, {"type": "text", "text": "Number of parameters. Compared to other merging methods, EMR-MERGING requires a little additional storage for taskspecific modulators. However, compared to a single 32-bit model, the additional storage caused by a task-specific 1-bit mask equals a binarized network, whose size is 32 times smaller than a single 32-bit ", "page_idx": 8}, {"type": "image", "img_path": "lYdjzx3DYu/tmp/b536624e05b612cd01d59581c136259738f712fcd496cc9c9b90b90b2c1a6762.jpg", "img_caption": ["Figure 6: Comparison of the (a) number of parameters and (b) average normalized performance when using individual models, Ties-Merging, and EMR-MERGING. "], "img_footnote": [], "page_idx": 8}, {"type": "text", "text": "model [14]. Additionally, the storage required by a task-specific rescaler, which is a single parameter, is negligible. In Fig. 6(a), we compare the number of parameters when merging different numbers of models, and we observe that EMR-MERGING’s parameter number is slightly more than Ties-Merging but significantly fewer than individual models. ", "page_idx": 8}, {"type": "table", "img_path": "lYdjzx3DYu/tmp/c8fe7d18dd2ff581a6520e0e501de376eaf2c140ee2efd23a7aa232640110f5a.jpg", "table_caption": ["Table 9: Ablation on the Electing procedure of EMR-MERGING. "], "table_footnote": [], "page_idx": 9}, {"type": "table", "img_path": "lYdjzx3DYu/tmp/0b4607ff23e71a37445e75fcd0d3e76fe982f2023ebcc252d9095ffcb7ffe91b.jpg", "table_caption": ["Table 10: Ablation on the Masking and Rescaling procedures of EMR-MERGING. "], "table_footnote": [], "page_idx": 9}, {"type": "text", "text": "Performance. The performance comparison when merging different numbers of models is shown in Fig. 6(b). Compared to Ties-Merging, the performance of EMR-MERGING is higher and decreases more slowly as the task increases. Note that EMR-MERGING outperforms individual models under the 2-task setting. Similar findings are reported by DARE [90]. More details are shown in Appendix D.5. ", "page_idx": 9}, {"type": "text", "text": "4.5 Ablation Study ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "We perform ablations on all the components of EMR-MERGING as follows. ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "Ablation on Electing procedure. Tab. 9 shows the results of merging eight ViT-B/32 models when the Electing procedure is replaced by other task vector-based merging methods. The effectiveness of our Electing strategy is verified by outperforming the combination of other merging methods with masking and rescaling. Another interesting finding is that as a post-processing procedure, masking and rescaling can help improve the performance of task vector-based merging methods, respectively $6.8\\%$ , $5.0\\%$ , and $6.6\\%$ for Task Arithmetic, Ties-Merging, and AdaMerging $^{\\mathrel{\\textstyle\\left/{\\vphantom{\\textstyle\\left({\\textstyle\\frac{1}{\\textstyle2}}\\right)}}\\right.\\kern-\\nulldelimiterspace}}$ . ", "page_idx": 9}, {"type": "text", "text": "Ablation on Masking and Rescaling procedures. Then, we further validate the importance of Masking and Rescaling procedures by disabling either or both of them. The results are shown in Tab. 10. It can be seen that simply electing results in a severe performance drop while adding Masking and Rescaling can improve the performance by $27.5\\%$ and $\\bar{12.6\\%}$ , respectively. Furthermore, compared to separately applying either of these two procedures, jointly applying Masking and Rescaling leads to greater improvement, up to $29.4\\%$ . ", "page_idx": 9}, {"type": "text", "text": "5 Conclusion ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "In this paper, we study on tuning-free and high-performance model merging. We first attribute the severe performance degradation of existing merging methods to that a single model can hardly simulate all the models’ performance. Then we propose ELECT, MASK & RESCALE-MERGING (EMR-MERGING), which does not require any data access or additional training for tuning. The effectiveness of EMR-MERGING is validated by comprehensive experiments on various classical benchmarks and newly-established benchmarks under vision, NLP, PEFT, and multi-modal settings. ", "page_idx": 9}, {"type": "text", "text": "6 Acknowledgement ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "This work is supported by Shanghai Natural Science Foundation (No. 23ZR1402900), National Natural Science Foundation of China (No. 62071127 and No. 62306261), National Key Research and Development Program of China (No. 2022ZD0160101). The computations in this research were performed using the CFFF platform of Fudan University. ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "[1] M. I. Ahmed, S. M. Mamun, and A. U. Z. Asif. Dcnn-based vegetable image classification using transfer learning: A comparative study. In 2021 5th International Conference on Computer, Communication and Signal Processing (ICCCSP), pages 235–243. IEEE, 2021.   \n[2] S. I. Ahmed, M. Ibrahim, M. Nadim, M. M. Rahman, M. M. Shejunti, T. Jabid, and M. S. Ali. Mangoleafbd: A comprehensive image dataset to classify diseased and healthy mango leaves. Data in Brief, 47:108941, 2023.   \n[3] S. Banerjee and A. Lavie. Meteor: An automatic metric for mt evaluation with improved correlation with human judgments. In Proceedings of the acl workshop on intrinsic and extrinsic evaluation measures for machine translation and/or summarization, pages 65–72, 2005.   \n[4] P. Bansal. Intel image classification. Available on https://www. kaggle. com/puneet6060/intel-imageclassification, Online, 2019.   \n[5] R. Bommasani, D. A. Hudson, E. Adeli, R. Altman, S. Arora, S. von Arx, M. S. Bernstein, J. Bohg, A. Bosselut, E. Brunskill, et al. On the opportunities and risks of foundation models. arXiv preprint arXiv:2108.07258, 2021.   \n[6] L. Bossard, M. Guillaumin, and L. Van Gool. Food-101 – mining discriminative components with random forests. In European Conference on Computer Vision, 2014.   \n[7] T. Brown, B. Mann, N. Ryder, M. Subbiah, J. D. Kaplan, P. Dhariwal, A. Neelakantan, P. Shyam, G. Sastry, A. Askell, et al. Language models are few-shot learners. Advances in neural information processing systems, 33:1877–1901, 2020.   \n[8] CCHANG. Garbage classification. https://www.kaggle.com/ds/81794, 2018.   \n[9] D. Cer, M. Diab, E. Agirre, I. Lopez-Gazpio, and L. Specia. Semeval-2017 task 1: Semantic textual similarity-multilingual and cross-lingual focused evaluation. arXiv preprint arXiv:1708.00055, 2017.   \n[10] G. Cheng, J. Han, and X. Lu. Remote sensing image scene classification: Benchmark and state of the art. Proceedings of the IEEE, 105(10):1865–1883, 2017.   \n[11] M. Cimpoi, S. Maji, I. Kokkinos, S. Mohamed, and A. Vedaldi. Describing textures in the wild. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 3606–3613, 2014.   \n[12] A. Coates, A. Ng, and H. Lee. An analysis of single-layer networks in unsupervised feature learning. In Proceedings of the fourteenth international conference on artificial intelligence and statistics, pages 215–223. JMLR Workshop and Conference Proceedings, 2011.   \n[13] G. Cohen, S. Afshar, J. Tapson, and A. Van Schaik. Emnist: Extending mnist to handwritten letters. In 2017 international joint conference on neural networks (IJCNN), pages 2921–2926. IEEE, 2017.   \n[14] M. Courbariaux, I. Hubara, D. Soudry, R. El-Yaniv, and Y. Bengio. Binarized neural networks: Training deep neural networks with weights and activations constrained to+ 1 or-1. arXiv preprint arXiv:1602.02830, 2016.   \n[15] W. Cukierski. Dogs vs. cats, 2013. URL https://kaggle. com/competitions/dogs-vs-cats.   \n[16] M.-C. De Marneffe, M. Simons, and J. Tonhauser. The commitmentbank: Investigating projection in naturally occurring discourse. In proceedings of Sinn und Bedeutung, volume 23, pages 107–124, 2019.   \n[17] DeepNets. Landscape recognition. https://www.kaggle.com/datasets/utkarshsaxenadn/ landscape-recognition-image-dataset-12k-images.   \n[18] J. Deng, W. Dong, R. Socher, L.-J. Li, K. Li, and L. Fei-Fei. Imagenet: A large-scale hierarchical image database. In 2009 IEEE conference on computer vision and pattern recognition, pages 248–255. Ieee, 2009.   \n[19] J. Devlin, M.-W. Chang, K. Lee, and K. Toutanova. Bert: Pre-training of deep bidirectional transformers for language understanding. arXiv preprint arXiv:1810.04805, 2018.   \n[20] J. Dodge, G. Ilharco, R. Schwartz, A. Farhadi, H. Hajishirzi, and N. Smith. Fine-tuning pretrained language models: Weight initializations, data orders, and early stopping. arXiv preprint arXiv:2002.06305, 2020.   \n[21] B. Dolan and C. Brockett. Automatically constructing a corpus of sentential paraphrases. In Third international workshop on paraphrasing (IWP2005), 2005.   \n[22] A. Dosovitskiy, L. Beyer, A. Kolesnikov, D. Weissenborn, X. Zhai, T. Unterthiner, M. Dehghani, M. Minderer, G. Heigold, S. Gelly, et al. An image is worth 16x16 words: Transformers for image recognition at scale. arXiv preprint arXiv:2010.11929, 2020.   \n[23] R. A. Fisher. On the mathematical foundations of theoretical statistics. Philosophical transactions of the Royal Society of London. Series A, containing papers of a mathematical or physical character, 222(594-604):309–368, 1922.   \n[24] D. Giampiccolo, B. Magnini, I. Dagan, and W. B. Dolan. The third pascal recognizing textual entailment challenge. In Proceedings of the ACL-PASCAL workshop on textual entailment and paraphrasing, pages 1–9, 2007.   \n[25] C. Goddard, S. Siriwardhana, M. Ehghaghi, L. Meyers, V. Karpukhin, B. Benedict, M. McQuade, and J. Solawetz. Arcee’s mergekit: A toolkit for merging large language models. arXiv preprint arXiv:2403.13257, 2024.   \n[26] Y. Goyal, T. Khot, D. Summers-Stay, D. Batra, and D. Parikh. Making the v in vqa matter: Elevating the role of image understanding in visual question answering. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 6904–6913, 2017.   \n[27] P. Helber, B. Bischke, A. Dengel, and D. Borth. Eurosat: A novel dataset and deep learning benchmark for land use and land cover classification. IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 12(7):2217–2226, 2019.   \n[28] N. Houlsby, A. Giurgiu, S. Jastrzebski, B. Morrone, Q. De Laroussilhe, A. Gesmundo, M. Attariyan, and S. Gelly. Parameter-efficient transfer learning for nlp. In International Conference on Machine Learning, pages 2790–2799. PMLR, 2019.   \n[29] E. J. Hu, P. Wallis, Z. Allen-Zhu, Y. Li, S. Wang, L. Wang, W. Chen, et al. Lora: Low-rank adaptation of large language models. In International Conference on Learning Representations, 2021.   \n[30] G. Ilharco, M. T. Ribeiro, M. Wortsman, L. Schmidt, H. Hajishirzi, and A. Farhadi. Editing models with task arithmetic. In The Eleventh International Conference on Learning Representations, 2022.   \n[31] S. Iyer, N. Dandekar, K. Csernai, et al. First quora dataset release: Question pairs. data. quora. com. 2017.   \n[32] M. Jalal, K. Wang, S. Jefferson, Y. Zheng, E. O. Nsoesie, and M. Betke. Scraping social media photos posted in kenya and elsewhere to detect and analyze food types. In Proceedings of the 5th International Workshop on Multimedia Assisted Dietary Management, pages 50–59, 2019.   \n[33] X. Jin, X. Ren, D. Preotiuc-Pietro, and P. Cheng. Dataless knowledge fusion by merging weights of language models. In The Eleventh International Conference on Learning Representations, 2022.   \n[34] A. Khosla, N. Jayadevaprakash, B. Yao, and L. Fei-Fei. Novel dataset for fine-grained image categorization. In First Workshop on Fine-Grained Visual Categorization, IEEE Conference on Computer Vision and Pattern Recognition, Colorado Springs, CO, June 2011.   \n[35] J. Krause, M. Stark, J. Deng, and L. Fei-Fei. 3d object representations for fine-grained categorization. In Proceedings of the IEEE international conference on computer vision workshops, pages 554–561, 2013.   \n[36] A. Krizhevsky, G. Hinton, et al. Learning multiple layers of features from tiny images. 2009.   \n[37] M. A. Lab. Bean disease dataset, January 2020.   \n[38] Y. LeCun. The mnist database of handwritten digits. http://yann. lecun. com/exdb/mnist/, 1998.   \n[39] H. Levesque, E. Davis, and L. Morgenstern. The winograd schema challenge. In Thirteenth international conference on the principles of knowledge representation and reasoning, 2012.   \n[40] C.-Y. Lin. Rouge: A package for automatic evaluation of summaries. In Text summarization branches out, pages 74–81, 2004.   \n[41] T.-Y. Lin, M. Maire, S. Belongie, J. Hays, P. Perona, D. Ramanan, P. Dollár, and C. L. Zitnick. Microsoft coco: Common objects in context. In Computer Vision–ECCV 2014: 13th European Conference, Zurich, Switzerland, September 6-12, 2014, Proceedings, Part V 13, pages 740–755. Springer, 2014.   \n[42] H. Liu, D. Tam, M. Muqeeth, J. Mohta, T. Huang, M. Bansal, and C. A. Raffel. Few-shot parameter-efficient fine-tuning is better and cheaper than in-context learning. Advances in Neural Information Processing Systems, 35:1950–1965, 2022.   \n[43] Y. Liu, M. Ott, N. Goyal, J. Du, M. Joshi, D. Chen, O. Levy, M. Lewis, L. Zettlemoyer, and V. Stoyanov. Roberta: A robustly optimized bert pretraining approach. arXiv preprint arXiv:1907.11692, 2019.   \n[44] T. maintainers and contributors. Torchvision: Pytorch’s computer vision library. https://github.com/ pytorch/vision, 2016.   \n[45] A. Mamaev. Flowers recognition. https://www.kaggle.com/datasets/alxmamaev/ flowers-recognition.   \n[46] M. S. Matena and C. A. Raffel. Merging models with fisher-weighted averaging. Advances in Neural Information Processing Systems, 35:17703–17716, 2022.   \n[47] H. Muresan and M. Oltean. Fruit recognition from images using deep learning. Acta Universitatis Sapientiae, Informatica, 10(1):26–42, 2018.   \n[48] Y. Nie, A. Williams, E. Dinan, M. Bansal, J. Weston, and D. Kiela. Adversarial nli: A new benchmark for natural language understanding. arXiv preprint arXiv:1910.14599, 2019.   \n[49] K. Papineni, S. Roukos, T. Ward, and W.-J. Zhu. Bleu: a method for automatic evaluation of machine translation. In Proceedings of the 40th annual meeting of the Association for Computational Linguistics, pages 311–318, 2002.   \n[50] O. M. Parkhi, A. Vedaldi, A. Zisserman, and C. Jawahar. Cats and dogs. In 2012 IEEE conference on computer vision and pattern recognition, pages 3498–3505. IEEE, 2012.   \n[51] S. Paul and P.-Y. Chen. Vision transformers are robust learners. In Proceedings of the AAAI conference on Artificial Intelligence, volume 36, pages 2071–2081, 2022.   \n[52] M. T. Pilehvar and J. Camacho-Collados. Wic: the word-in-context dataset for evaluating context-sensitive meaning representations. arXiv preprint arXiv:1808.09121, 2018.   \n[53] K. Pogorelov, K. R. Randel, C. Griwodz, S. L. Eskeland, T. de Lange, D. Johansen, C. Spampinato, D.-T. Dang-Nguyen, M. Lux, P. T. Schmidt, et al. Kvasir: A multi-class image dataset for computer aided gastrointestinal disease detection. In Proceedings of the 8th ACM on Multimedia Systems Conference, pages 164–169, 2017.   \n[54] A. Radford, J. W. Kim, C. Hallacy, A. Ramesh, G. Goh, S. Agarwal, G. Sastry, A. Askell, P. Mishkin, J. Clark, et al. Learning transferable visual models from natural language supervision. In International conference on machine learning, pages 8748–8763. PMLR, 2021.   \n[55] A. Radford, J. Wu, R. Child, D. Luan, D. Amodei, and I. Sutskever. Language models are unsupervised multitask learners. 2019.   \n[56] P. Rajpurkar, J. Zhang, K. Lopyrev, and P. Liang. Squad: $100{,}000{+}$ questions for machine comprehension of text. arXiv preprint arXiv:1606.05250, 2016.   \n[57] A. Ramé, K. Ahuja, J. Zhang, M. Cord, L. Bottou, and D. Lopez-Paz. Model ratatouille: Recycling diverse models for out-of-distribution generalization. In International Conference on Machine Learning, pages 28656–28679. PMLR, 2023.   \n[58] M. Roemmele, C. A. Bejan, and A. S. Gordon. Choice of plausible alternatives: An evaluation of commonsense causal reasoning. In 2011 AAAI Spring Symposium Series, 2011.   \n[59] K. Sakaguchi, R. L. Bras, C. Bhagavatula, and Y. Choi. Winogrande: An adversarial winograd schema challenge at scale. Communications of the ACM, 64(9):99–106, 2021.   \n[60] V. Sanh, A. Webson, C. Raffel, S. H. Bach, L. Sutawika, Z. Alyafeai, A. Chaffin, A. Stiegler, T. L. Scao, A. Raja, et al. Multitask prompted training enables zero-shot task generalization. arXiv preprint arXiv:2110.08207, 2021.   \n[61] R. R. Selvaraju, M. Cogswell, A. Das, R. Vedantam, D. Parikh, and D. Batra. Grad-cam: Visual explanations from deep networks via gradient-based localization. In Proceedings of the IEEE international conference on computer vision, pages 618–626, 2017.   \n[62] R. Sharma, J. Allen, O. Bakhshandeh, and N. Mostafazadeh. Tackling the story ending biases in the story cloze test. In Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers), pages 752–757, 2018.   \n[63] R. Socher, A. Perelygin, J. Wu, J. Chuang, C. D. Manning, A. Y. Ng, and C. Potts. Recursive deep models for semantic compositionality over a sentiment treebank. In Proceedings of the 2013 conference on empirical methods in natural language processing, pages 1631–1642, 2013.   \n[64] H. Song, M. Kim, and J.-G. Lee. Selfie: Refurbishing unclean samples for robust deep learning. In International conference on machine learning, pages 5907–5915. PMLR, 2019.   \n[65] J. Stallkamp, M. Schlipsing, J. Salmen, and C. Igel. The german traffic sign recognition benchmark: a multi-class classification competition. In The 2011 international joint conference on neural networks, pages 1453–1460. IEEE, 2011.   \n[66] G. Stoica, D. Bolya, J. Bjorner, T. Hearn, and J. Hoffman. Zipit! merging models from different tasks without training. arXiv preprint arXiv:2305.03053, 2023.   \n[67] A. Suhr, S. Zhou, A. Zhang, I. Zhang, H. Bai, and Y. Artzi. A corpus for reasoning about natural language grounded in photographs. arXiv preprint arXiv:1811.00491, 2018.   \n[68] A. Tang, L. Shen, Y. Luo, H. Hu, B. Du, and D. Tao. FusionBench: A Comprehensive Benchmark of Deep Model Fusion, June 2024.   \n[69] L. van der Maaten and G. Hinton. Visualizing data using t-sne. Journal of Machine Learning Research, 9(86):2579–2605, 2008.   \n[70] S. Vandenhende, S. Georgoulis, W. Van Gansbeke, M. Proesmans, D. Dai, and L. Van Gool. Multitask learning for dense prediction tasks: A survey. IEEE transactions on pattern analysis and machine intelligence, 44(7):3614–3633, 2021.   \n[71] A. Vaswani, N. Shazeer, N. Parmar, J. Uszkoreit, L. Jones, A. N. Gomez, Ł. Kaiser, and I. Polosukhin. Attention is all you need. Advances in neural information processing systems, 30, 2017.   \n[72] R. Vedantam, C. Lawrence Zitnick, and D. Parikh. Cider: Consensus-based image description evaluation. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 4566–4575, 2015.   \n[73] C. Wah, S. Branson, P. Welinder, P. Perona, and S. Belongie. The caltech-ucsd birds-200-2011 dataset. 2011.   \n[74] A. Wang, A. Singh, J. Michael, F. Hill, O. Levy, and S. R. Bowman. Glue: A multi-task benchmark and analysis platform for natural language understanding. arXiv preprint arXiv:1804.07461, 2018.   \n[75] W. Wang, H. Bao, L. Dong, J. Bjorck, Z. Peng, Q. Liu, K. Aggarwal, O. K. Mohammed, S. Singhal, S. Som, and F. Wei. Image as a foreign language: BEiT pretraining for vision and vision-language tasks. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, 2023.   \n[76] A. Warstadt, A. Singh, and S. R. Bowman. Neural network acceptability judgments. Transactions of the Association for Computational Linguistics, 7:625–641, 2019.   \n[77] R. Wightman. Pytorch image models. https://github.com/rwightman/pytorch-image-models, 2019.   \n[78] A. Williams, N. Nangia, and S. R. Bowman. A broad-coverage challenge corpus for sentence understanding through inference. arXiv preprint arXiv:1704.05426, 2017.   \n[79] T. Wolf, L. Debut, V. Sanh, J. Chaumond, C. Delangue, A. Moi, P. Cistac, T. Rault, R. Louf, M. Funtowicz, et al. Huggingface’s transformers: State-of-the-art natural language processing. arXiv preprint arXiv:1910.03771, 2019.   \n[80] M. Wortsman, G. Ilharco, S. Y. Gadre, R. Roelofs, R. Gontijo-Lopes, A. S. Morcos, H. Namkoong, A. Farhadi, Y. Carmon, S. Kornblith, et al. Model soups: averaging weights of multiple fine-tuned models improves accuracy without increasing inference time. In International Conference on Machine Learning, pages 23965–23998. PMLR, 2022.   \n[81] H. Xiao, K. Rasul, and R. Vollgraf. Fashion-mnist: a novel image dataset for benchmarking machine learning algorithms. arXiv preprint arXiv:1708.07747, 2017.   \n[82] H. Xiao, F. Zhang, Z. Shen, K. Wu, and J. Zhang. Classification of weather phenomenon from images by using deep convolutional neural network. Earth and Space Science, 8(5):e2020EA001604, 2021.   \n[83] J. Xiao, J. Hays, K. A. Ehinger, A. Oliva, and A. Torralba. Sun database: Large-scale scene recognition from abbey to zoo. In 2010 IEEE computer society conference on computer vision and pattern recognition, pages 3485–3492. IEEE, 2010.   \n[84] P. Yadav, D. Tam, L. Choshen, C. Raffel, and M. Bansal. Ties-merging: Resolving interference when merging models. In Thirty-seventh Conference on Neural Information Processing Systems, 2023.   \n[85] E. Yang, Z. Wang, L. Shen, S. Liu, G. Guo, X. Wang, and D. Tao. Adamerging: Adaptive model merging for multi-task learning. In The Twelfth International Conference on Learning Representations, 2023.   \n[86] P. Ye, T. He, S. Tang, B. Li, T. Chen, L. Bai, and W. Ouyang. Stimulative training $^{++}$ : Go beyond the performance limits of residual networks. arXiv preprint arXiv:2305.02507, 2023.   \n[87] P. Ye, C. Huang, M. Shen, T. Chen, Y. Huang, Y. Zhang, and W. Ouyang. Merging vision transformers from different tasks and domains. arXiv preprint arXiv:2312.16240, 2023.   \n[88] P. Ye, B. Li, Y. Li, T. Chen, J. Fan, and W. Ouyang. b-darts: Beta-decay regularization for differentiable architecture search. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), pages 10874–10883, June 2022.   \n[89] P. Ye, S. Tang, B. Li, T. Chen, and W. Ouyang. Stimulative training of residual networks: A social psychology perspective of loafing. Advances in Neural Information Processing Systems, 35:3596–3608, 2022.   \n[90] L. Yu, B. Yu, H. Yu, F. Huang, and Y. Li. Language models are super mario: Absorbing abilities from homologous models as a free lunch. arXiv preprint arXiv:2311.03099, 2023.   \n[91] N. Yuval. Reading digits in natural images with unsupervised feature learning. In Proceedings of the NIPS Workshop on Deep Learning and Unsupervised Feature Learning, 2011.   \n[92] R. Zellers, A. Holtzman, Y. Bisk, A. Farhadi, and Y. Choi. Hellaswag: Can a machine really finish your sentence? arXiv preprint arXiv:1905.07830, 2019.   \n[93] B. Zhang, J. Yuan, B. Shi, T. Chen, Y. Li, and Y. Qiao. Uni3d: A unified baseline for multi-dataset 3d object detection. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 9253–9262, 2023.   \n[94] J. Zhang, J. Liu, J. He, et al. Composing parameter-efficient modules with arithmetic operation. Advances in Neural Information Processing Systems, 36:12589–12610, 2023.   \n[95] Y. Zhang and Q. Yang. A survey on multi-task learning. IEEE Transactions on Knowledge and Data Engineering, 34(12):5586–5609, 2021. ", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "", "page_idx": 13}, {"type": "text", "text": "", "page_idx": 14}, {"type": "text", "text": "Appendix for EMR-MERGING ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "A Algorithm flow of EMR-MERGING ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "We summarize the procedure of EMR-MERGING in Algorithm 1. ", "page_idx": 15}, {"type": "image", "img_path": "lYdjzx3DYu/tmp/30b1caa1fa6aa221ff3d0eba7ed0c2e30afc62c6fbbfa7bea1af6ece850d1443.jpg", "img_caption": [], "img_footnote": [], "page_idx": 15}, {"type": "text", "text": "B Theoretical analyses ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "In Section 3, we claimed that the task-specific modulators can lower the distance between the merged model and task-specific models. Here we provide detailed theoretical analyses. ", "page_idx": 15}, {"type": "text", "text": "Our goal is to merge model weights $W_{1,..N}$ by minimizing the distance between the merged model $W_{u n i}$ and each individual models $W_{i}$ , $i\\,\\in\\,[1..N]$ without using any dataset $[X_{i},Y_{i}]$ , where the distance can be calculated by: ", "page_idx": 15}, {"type": "equation", "text": "$$\nD i s=\\frac{\\sum_{i=1}^{N}\\|W_{i}-W_{u n i}\\|^{2}}{N}\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "The premise of merging is that all the models are fine-tuned from the same pre-trained model. Thus, Eq. 6 can be re-written: ", "page_idx": 15}, {"type": "equation", "text": "$$\nD i s=\\frac{\\sum_{i=1}^{N}\\|\\tau_{i}-\\tau_{u n i}\\|^{2}}{N}\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "where $\\tau_{i}$ refers to the task vector for Task $i$ . $\\tau_{u n i}$ is the merged task vector. We demonstrate the effectiveness of the task-specific modulators by step. ", "page_idx": 15}, {"type": "text", "text": "Analysis 1: Effectiveness of Masks. Suppose we apply a mask $M_{i}$ to the unified model $\\tau_{u n i}$ to disable elements in $\\tau_{u n i}$ that have the opposite sign of the corresponding elements in $\\tau_{u n i}$ , which can be written as: ", "page_idx": 15}, {"type": "image", "img_path": "lYdjzx3DYu/tmp/c084194ef15073a95ea9e750f681507f58acb274e60147912b20984d0cb00cca.jpg", "img_caption": [], "img_footnote": [], "page_idx": 16}, {"type": "text", "text": "Figure 7: Comparison of (a) sign confilcts, (b) L2 distance, and (c) cosine similarity of model weights obtained by different methods (including AdaMerging $^{++}$ and each procedure of EMR-MERGING) and task-specific model weights. The detailed configuration is shown in Appendix F. ", "page_idx": 16}, {"type": "table", "img_path": "lYdjzx3DYu/tmp/5c014c2b2514fbfdd2a57fec33938abdac84a9b968af8790ce7b68662159082b.jpg", "table_caption": ["Table 11: Multi-task performance when merging ViT-B/16 models on eight tasks. "], "table_footnote": [], "page_idx": 16}, {"type": "equation", "text": "$$\nM_{i}=(\\tau_{i}\\odot\\tau_{u n i}>0)\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "By applying the masks $M_{i},i\\in[1..N]$ , the distance becomes: ", "page_idx": 16}, {"type": "equation", "text": "$$\nD i s^{M}=\\frac{\\sum_{i=1}^{N}||\\tau_{i}-M_{i}\\odot\\tau_{u n i}||^{2}}{N}\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "Furthermore, it can be written as: ", "page_idx": 16}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{D i s^{M}=\\frac{\\displaystyle\\sum_{i=1}^{N}\\|M_{i}\\odot\\tau_{i}-M_{i}\\odot\\tau_{u n i}\\|^{2}}{N}+\\frac{\\displaystyle\\sum_{i=1}^{N}\\|\\left(1-M_{i}\\right)\\odot\\tau_{i}\\|^{2}}{N}}\\\\ &{\\qquad=\\frac{\\displaystyle\\sum_{i=1}^{N}\\|M_{i}\\odot\\left(a b s\\left(\\tau_{i}\\right)-a b s\\left(\\tau_{u n i}\\right)\\right)\\|^{2}}{N}+\\frac{\\displaystyle\\sum_{i=1}^{N}\\|\\left(1-M_{i}\\right)\\odot a b s\\left(\\tau_{i}\\right)\\|^{2}}{N}}\\end{array}\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "where $a b s(\\cdot)$ returns the absolute value of each element in the input. For ease of comparison, the distance without applying $M_{i}$ can be formulated as: ", "page_idx": 16}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{D i s=\\frac{\\sum_{i=1}^{N}\\|M_{i}\\odot\\left(a b s\\left(\\tau_{i}\\right)-a b s\\left(\\tau_{u n i}\\right)\\right)\\|^{2}}{N}+\\frac{\\sum_{i=1}^{N}\\|\\left(1-M_{i}\\right)\\odot\\left(a b s\\left(\\tau_{i}\\right)+a b s\\left(\\tau_{u n i}\\right)\\right)\\|^{2}}{N}}\\\\ &{\\qquad=D i s^{M}+\\frac{\\sum_{i=1}^{N}\\|\\left(1-M_{i}\\right)\\odot a b s\\left(\\tau_{u n i}\\right)\\|^{2}}{N}}\\end{array}\n$$", "text_format": "latex", "page_idx": 16}, {"type": "text", "text": "Thus, we demonstrate that $D i s^{M}\\leq D i s$ , indicating applying task-specific masks can reduce the distance between the merged model and individual models, thus showing effectiveness. ", "page_idx": 16}, {"type": "text", "text": "Analysis 2: Effectiveness of Rescalers. Suppose we apply a rescaler $\\lambda_{i}>0$ to the masked unified task vector $M_{i}\\cdot\\tau_{u n i}$ , the distance becomes: ", "page_idx": 16}, {"type": "equation", "text": "$$\n\\begin{array}{l}{{D i s^{M,\\lambda}=\\frac{\\sum_{i=1}^{N}\\|\\tau_{i}-\\lambda_{i}\\cdot M_{i}\\odot\\tau_{u n i}\\|^{2}}{N}}}\\\\ {{=\\frac{\\sum_{i=1}^{N}\\|a b s\\,(\\tau_{i})-\\lambda_{i}\\cdot a b s\\,(M_{i}\\odot\\tau_{u n i})\\|^{2}}{N}}}\\end{array}\n$$", "text_format": "latex", "page_idx": 16}, {"type": "image", "img_path": "lYdjzx3DYu/tmp/f9bf9565be6f4ca0b3a38d67144d262ec92fb2d60321a4c77119b2320c837d92.jpg", "img_caption": ["Figure 8: t-SNE visualization results of different merging methods. "], "img_footnote": [], "page_idx": 17}, {"type": "table", "img_path": "lYdjzx3DYu/tmp/112688b4b39667c0d145ca9f514eb890e7149c30efbfa6bbc2981d61c7d068b7.jpg", "table_caption": ["Table 12: Multi-task performance when merging ViT-B/32 models on 9 vision tasks (ImageNet-1K added). "], "table_footnote": [], "page_idx": 17}, {"type": "text", "text": "To minimize the distance in Eq. 12, we set the first derivative of $D i s^{\\lambda}$ with respect to $\\lambda_{i}$ to 0, thus $\\lambda_{i}$ can be calculated by: ", "page_idx": 17}, {"type": "equation", "text": "$$\n\\lambda_{i}=\\frac{s u m(a b s(\\tau_{i}))}{s u m(a b s(M_{i}\\odot\\tau_{u n i}))}\n$$", "text_format": "latex", "page_idx": 17}, {"type": "text", "text": "which exactly matches our setting of $\\lambda_{i}$ . This indicates that our setting of rescalers $\\lambda_{i}$ can minimize the distance between the merged model and individual models, which is: $D i s^{M,\\lambda}\\leq D i s^{M}$ , thus showing effectiveness. ", "page_idx": 17}, {"type": "text", "text": "It is also reflected in Fig. 7 that after Masking and Rescaling, the sign conflicts and L2 distance between the merged model and task-specific models are reduced and the cosine similarity can is improved. ", "page_idx": 17}, {"type": "image", "img_path": "lYdjzx3DYu/tmp/9283bffe46db67630dc12051aa5f59f82cbbcdc04e25b916049c645c04f0611e.jpg", "img_caption": ["Figure 9: Grad-CAM visualization results of different merging methods. "], "img_footnote": [], "page_idx": 18}, {"type": "text", "text": "C Baseline Methods ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "• Individual Models refer to task-specific models before merging. ", "page_idx": 18}, {"type": "text", "text": "• Traditional MTL uses datasets from all the tasks to train a single model jointly. ", "page_idx": 18}, {"type": "text", "text": "• Weight Averaging element-wisely averages all the model weights. Its effectiveness when applied to fine-tuned model weights from the same pre-training has been verified [80, 57, 33].   \n• Fisher Merging [46] uses Fisher information matrices [23] to calculate the importance of each parameter and weighted merges them based on their importance.   \n• RegMean [33] weighted merges models based on a closed-form solution to the merging problem. When merging $K$ linear model weights $W_{i}$ , where $f_{i}\\left(x\\right)=W_{i}^{T}x$ , $i=1..K$ , the merging problem can be formulated as: $\\begin{array}{r}{\\underset{W}{\\operatorname*{min}}\\sum_{i=1}^{K}\\lVert W^{T}X_{i}-W_{i}^{T}X_{i}\\rVert^{2}}\\end{array}$ , where $W$ is the merged model weights, and $X_{i}$ denotes the input of $i^{t h}$ model. The closed-form solution to the problem is: $\\begin{array}{r}{W=(\\sum_{i=1}^{K}X_{i}^{T}X_{i})^{-1}(\\sum_{i=1}^{K}X_{i}^{T}X_{i}W_{i})}\\end{array}$ . Inner-product matrices need to be computed before merging.   \n• Task Arithmetic [30] defines task vectors as the difference between finetuned model weights and the pre-trained model weights. Suppose a model $\\theta_{i}$ is finetuned from a pre-trained model $\\theta_{p r e}$ , the task vector is $\\tau_{i}=\\theta_{i}-\\theta_{p r e}$ . When merging $\\theta_{1,\\,,K}$ , the merged model is $\\begin{array}{r}{\\theta_{M}=\\lambda\\sum_{i=1}^{K}\\tau_{i}+\\theta_{p r e}}\\end{array}$ , where $\\lambda$ is the merging coefficient.   \n• Ties-Merging [84] (Trim, Elect Sign & Merge) believes that the conflicts among the task vectors severely effect the merged model’s performance. Ties-Merging solves this problem by eliminating redundant parameters and resolving symbol conflicts. ", "page_idx": 18}, {"type": "table", "img_path": "lYdjzx3DYu/tmp/6f6f53583178e8169869262054385e75979b120aa9ebca6577951604ef48a9b9.jpg", "table_caption": ["Table 13: Performance of RegMean and Task Arithmetic when pre-processed using DARE [90]. "], "table_footnote": [], "page_idx": 19}, {"type": "text", "text": "• AdaMerging [85] uses an unsupervised method to learn the merging coefficients for each task vector (Task-wise AdaMerging) or each layer (Layer-wise AdaMerging). AdaMerg$\\mathrm{ing++}$ is realized by adopting Ties-Merging [84] before learning the merging coefficients. ", "page_idx": 19}, {"type": "text", "text": "• DARE [90] (Drop and Rescale) validates the extremely redundant properties of language models. As a pre-processing technique, DARE randomly drops most $90\\%$ or even $99\\%$ ) delta parameters (task vectors) before merging to potentially mitigate the interference of parameters among models. ", "page_idx": 19}, {"type": "text", "text": "D More experimental results ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "D.1 Merging ViT-B/16 models on 8 tasks ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "We follow the settings in Section 4.1.1 and merge ViT-B/16 models. Tab. 11 shows the accuracy of merging ViT-B/16 models on eight vision tasks. The proposed EMR-MERGING brings about $5.6\\%$ performance improvement compared to Adamerging $^{++}$ [85], further demonstrating the effectiveness of EMR-MERGING. ", "page_idx": 19}, {"type": "text", "text": "D.2 Merging ViT-B/32 models on 9 tasks (ImageNet-1K added) ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "To further explore the performance of EMR-MERGING, we follow the settings in Section 4.1.1 and add one more task, ImageNet-1K [18]. We merge models on these nine tasks using different merging methods. The results are shown in Tab. 12 and EMR-Merging shows a much more significant improvement compared to existing merging methods (up to $20\\%$ ). ", "page_idx": 19}, {"type": "text", "text": "D.3 DARE’s experimental results and causes ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "DARE’s experimental results when combined with RegMean and Task Arithmetic are shown in Tab. 13. It can be seen that when applied to merge eight models, DARE works on a few tasks under low dropping rate settings but it generally fails. We attribute its failure to the random dropping strategy’s unapplicability to merging multiple models. Under the setting of merging two or three models, randomly dropping most parameters in task vectors can significantly reduce interference but conflicts are a lot more difficult to avoid when merging multiple models. ", "page_idx": 19}, {"type": "text", "text": "Table 14: Performance of Task Arithmetic [30], Ties-Merging [84], Ties-Merging [84] w/ DARE [90], and RegMean [33] under different hyper-parameter settings. $\\lambda$ for task vector-based methods is the merging coefficient. $P$ is the drop rate for DARE. $a$ is the non-diagonal multiplier for RegMean. ", "page_idx": 20}, {"type": "table", "img_path": "lYdjzx3DYu/tmp/3b2c19ec1111d95d08ee778d7809dbb416f51b3bf0af626a39aefc840b193aa2.jpg", "table_caption": [], "table_footnote": [], "page_idx": 20}, {"type": "text", "text": "D.4 Results under different hyper-paramerter settings ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "In Section 4.2.1, we presented the best performance of Ties-Merging, Task Arithmetic, and RegMean among multiple hyper-parameter settings. Here we present more experimental results of Ties-Merging, Task Arithmetic, and RegMean under different hyper-parameter settings in Tab. 14. ", "page_idx": 20}, {"type": "text", "text": "D.5 Detailed information for merging different number of models ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "In Section 4.4, we showed partial results of merging different number of ViT-B/32 models by Fig. 6.   \nHere we provide quantified and task-specific performance results in Tab. 15. ", "page_idx": 20}, {"type": "text", "text": "Table 15: Merging different number of ViT-B/32 models. ", "page_idx": 21}, {"type": "table", "img_path": "lYdjzx3DYu/tmp/173107a8ea0bcaf097a31f249d911b96725df2e95e492bd116514da247f4ce05.jpg", "table_caption": [], "table_footnote": [], "page_idx": 21}, {"type": "text", "text": "Table 16: Sparsity (ratio of non-zero items) of the masks and the values of the rescalers when merging ViTs on 8 vision tasks and RoBERTa models on 8 language tasks. ", "page_idx": 21}, {"type": "table", "img_path": "lYdjzx3DYu/tmp/f1581acaa77dec0c2f3e984a9528732205cfa1d6ca8152bc8d3df0d177c93ab1.jpg", "table_caption": [], "table_footnote": [], "page_idx": 21}, {"type": "text", "text": "D.6 Sparsity of masks and values of rescalers. ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "We show the sparsity of the masks and the values of the rescalers when merging eight ViTs and eight RoBERTa models in Tab. 16. ", "page_idx": 21}, {"type": "text", "text": "E More visualization results ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "In Section 3, we showed some visualization results using t-SNE [69] and Grad-CAM [61]. Here we provide more visualization results of both existing merging methods and EMR-MERGING. t-SNE and Grad-CAM visualization results are shown in Fig. 8 and Fig. 9, respectively. ", "page_idx": 21}, {"type": "text", "text": "F Configuration of Fig. 4 and Fig. 7 ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "In Fig. 4 and Fig. 7, we hope to compare the sign conflicts, L2 distance, and cosine similarity of the merged model weights and individual model weights. To calculate the sign conflicts, we element-wisely compare the merged model weights to each individual model weights and record the ratio of the elements whose signs confilct. We report the average value of the sign confilcts between the merged model and each individual model. To calculate the L2 distance or cosine similarity, we first flatten the merged model weights and each individual model weights as 1-dimension vectors. Then we calculate the L2 distance or cosine similarity between the merged model and each individual model and report the average value. ", "page_idx": 22}, {"type": "text", "text": "G Limitations and future works ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Despite the convincing results, the proposed method suffers from several limitations. On the one hand, compared to existing methods, EMR-MERGING requires a little additional memory to store the light-weight task-specific modulators. On the other hand, as a common limitation of task vector-based methods, EMR-MERGING cannot be generalized to models trained from-scratch because the task vector is based on the pretrain-finetune paradigm. ", "page_idx": 22}, {"type": "text", "text": "Further improving the performance of the merged model and generalizing model merging to models trained from-scratch or even models with different structures are significant directions for future work. Additionally, combining model merging with low bit-width quantization has broad application prospects and is also a potential future work. ", "page_idx": 22}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: The main claims made in both abstract and Section 1 accurately reflect the paper’s contributions and scope. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 23}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Justification: Please check Appendix G. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 23}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: The full set of assumptions and a complete (and correct) proof are detailed in Appendix B. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 24}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 24}, {"type": "text", "text": "Justification: We disclose the information in Section 4 and we provide the code and data for the convenience of reproduction. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 24}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "Justification: We provide the code for reproduction. Please check Abstract. Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 25}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "Justification: We specify them in Section 4 and in our released code. Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 25}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 25}, {"type": "text", "text": "Answer: [No] ", "page_idx": 25}, {"type": "text", "text": "Justification: Error bars are not reported. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 25}, {"type": "text", "text": "", "page_idx": 26}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 26}, {"type": "text", "text": "Answer: [No] ", "page_idx": 26}, {"type": "text", "text": "Justification: The required computer resources are decided by the structure of the models to be merged. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 26}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 26}, {"type": "text", "text": "Justification: The research is conducted with the NeurIPS Code of Ethics. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 26}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 26}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 26}, {"type": "text", "text": "Justification: Not applicable to societal impacts. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed.   \n• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 26}, {"type": "text", "text": "", "page_idx": 27}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 27}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 27}, {"type": "text", "text": "Justification: The paper poses no such risks. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 27}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 27}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 27}, {"type": "text", "text": "Justification: We cite the original papers or websites that produced the code package or dataset. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided. ", "page_idx": 27}, {"type": "text", "text": "• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 28}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 28}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 28}, {"type": "text", "text": "Justification: The paper does not release new assets. ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 28}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 28}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 28}, {"type": "text", "text": "Justification: The paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 28}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 28}, {"type": "text", "text": "Answer: [NA] ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Justification: The paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 28}]