[{"figure_path": "7nbAots3f8/figures/figures_2_1.jpg", "caption": "Figure 1: Pipeline. First, we train a UDF prediction network Uə on a synthetic dataset, which contains a series of local point cloud patches that are independent of specific shapes. Given a global point cloud P, we then extract a local patch P assigned to each query point q within a specified radius, and obtain the corresponding UDF values Uô (P, q). Finally, we extract the mesh corresponding to the input point cloud by incorporating the DCUDF[32] framework.", "description": "The figure illustrates the overall pipeline of the proposed Losf-UDF method.  It starts by training a UDF prediction network on a synthetic dataset of local point cloud patches.  Then, given a global point cloud, the method extracts a local patch around each query point and predicts the unsigned distance field (UDF) value.  Finally, mesh extraction is performed using the DCUDF framework.", "section": "3 Method"}, {"figure_path": "7nbAots3f8/figures/figures_3_1.jpg", "caption": "Figure 2: Local geometries. (a) For points on a geometry that are differentiable, the local shape at these points can be approximated by quadratic surfaces. (b) For points that are non-differentiable, we can also construct locally approximated surfaces using functions.", "description": "This figure shows how the local geometry of a 3D surface can be approximated by different mathematical functions, depending on the differentiability of the points on the surface.  (a) shows that for smooth, differentiable surfaces, the local geometry can be well approximated using quadratic functions (planar, parabolic, elliptic, hyperbolic). (b) illustrates that for points on non-differentiable surfaces (such as creases, corners, cusps and V-saddles), other functions are required to approximate the local geometry. This distinction is crucial for the method described in the paper for generating a synthetic dataset for training.", "section": "3.1 Local shape functions"}, {"figure_path": "7nbAots3f8/figures/figures_3_2.jpg", "caption": "Figure 3: Synthetic dataset for training. By manipulating functional parameters, we can readily create various smooth and sharp surfaces, subsequently acquiring pairs of point cloud patches and query points via sampling.", "description": "This figure shows examples of the synthetic dataset used to train the LoSF-UDF model.  The dataset consists of point cloud patches generated using mathematical functions that represent a range of smooth and sharp surface features (planar, parabolic, hyperbolic, ellipsoidal, creases, cusps, corners, v-saddles). Each patch is accompanied by query points, and their corresponding unsigned distance field (UDF) values are calculated.  By varying parameters in the generating functions, a diverse range of surface types is obtained for training, making the network robust to different shape characteristics.", "section": "3.1 Local shape functions"}, {"figure_path": "7nbAots3f8/figures/figures_4_1.jpg", "caption": "Figure 4: Network architecture of LoSF-UDF.", "description": "The figure illustrates the network architecture of LoSF-UDF, a novel neural framework for reconstructing surfaces from 3D point clouds. The network consists of two PointNets that process the local point cloud patch (P) and vectors pointing from the patch points to the query point (V). A cross-attention module combines features from these two PointNets to capture local geometric information. A series of fully connected layers then predict the unsigned distance field (UDF) value at the query point. A denoising module refines the distance estimations by adding displacements (Δd).", "section": "3.2.1 Network architecture"}, {"figure_path": "7nbAots3f8/figures/figures_5_1.jpg", "caption": "Figure 5: Visual comparisons on the synthetic dataset. First three rows: uniformly sampled points. Meddle three rows: point clouds with 0.25% added noise. Last three rows: point clouds with 10% outliers. All point clouds here have 48K points, except for the Bunny model, which has 100K points. We refer readers to the appendix for more visual results.", "description": "This figure compares the performance of different methods (CAP-UDF, LevelSetUDF, GeoUDF, DUDF, and the proposed LoSF-UDF) on synthetic datasets. It shows the reconstruction results under three conditions: noise-free, with 0.25% added noise, and with 10% outliers. The results demonstrate the robustness of LoSF-UDF against noise and outliers.  The ground truth is also presented for comparison.", "section": "4.2 Experimental results"}, {"figure_path": "7nbAots3f8/figures/figures_7_1.jpg", "caption": "Figure 5: Visual comparisons on the synthetic dataset. First three rows: uniformly sampled points. Meddle three rows: point clouds with 0.25% added noise. Last three rows: point clouds with 10% outliers. All point clouds here have 48K points, except for the Bunny model, which has 100K points. We refer readers to the appendix for more visual results.", "description": "This figure compares the 3D surface reconstruction results of different methods (CAP-UDF, LevelSetUDF, GeoUDF, DUDF, and the proposed LoSF-UDF) on synthetic datasets under various conditions: clean data, data with 0.25% added noise, and data with 10% outliers.  The results showcase the performance of each method in handling noise and outliers. The ground truth (GT) is also provided for comparison.", "section": "4.2 Experimental results"}, {"figure_path": "7nbAots3f8/figures/figures_8_1.jpg", "caption": "Figure 6: Reconstructed surfaces from real-world scanned point clouds.", "description": "This figure shows the 3D reconstruction results obtained using the proposed Losf-UDF method on real-world scanned point clouds. The results demonstrate the method's capability to reconstruct complex geometries from real-world data, showcasing its applicability in practical settings.", "section": "4.2 Experimental results"}, {"figure_path": "7nbAots3f8/figures/figures_8_2.jpg", "caption": "Figure 7: Comparison of different radii for extracting patches from the point cloud on reconstruction results.", "description": "This figure shows the effect of different patch radii on the 3D surface reconstruction results.  The ground truth (GT) is shown alongside reconstructions using radii of 0.08, 0.10, 0.20, and 0.30.  Smaller radii may lead to incomplete reconstructions, while larger radii can smooth out details and lead to less accurate results. The optimal radius for balancing detail preservation and reconstruction accuracy needs to be determined experimentally.", "section": "4.3 Analysis & ablation studies"}, {"figure_path": "7nbAots3f8/figures/figures_8_3.jpg", "caption": "Figure 5: Visual comparisons on the synthetic dataset. First three rows: uniformly sampled points. Meddle three rows: point clouds with 0.25% added noise. Last three rows: point clouds with 10% outliers. All point clouds here have 48K points, except for the Bunny model, which has 100K points. We refer readers to the appendix for more visual results.", "description": "This figure compares the 3D surface reconstruction results from different methods on synthetic datasets under different noise conditions.  The top rows show the results using clean data, the middle rows use data with 0.25% added noise, and the bottom rows show the results with 10% outliers in the data. The results for several methods (CAP-UDF, LevelSetUDF, GeoUDF, DUDF, and the proposed method) are shown, along with ground truth (GT).  The figure highlights the robustness of the proposed method to noise and outliers.", "section": "4.2 Experimental results"}, {"figure_path": "7nbAots3f8/figures/figures_19_1.jpg", "caption": "Figure 9: Our model demonstrates robustness to more outliers.", "description": "This figure shows the robustness of the proposed method to outliers in point cloud data.  The leftmost image shows the ground truth model. Subsequent images show reconstructions from point clouds with increasing percentages of outliers (10%, 25%, 50%), and finally a point cloud with both 10% outliers and 10% noise.  The results demonstrate the method's ability to produce high-quality surface reconstructions even with significant levels of noise and outliers present in the input data.", "section": "A.2 Robustness to outliers"}, {"figure_path": "7nbAots3f8/figures/figures_20_1.jpg", "caption": "Figure 5: Visual comparisons on the synthetic dataset. First three rows: uniformly sampled points. Meddle three rows: point clouds with 0.25% added noise. Last three rows: point clouds with 10% outliers. All point clouds here have 48K points, except for the Bunny model, which has 100K points. We refer readers to the appendix for more visual results.", "description": "This figure compares the performance of different methods for 3D surface reconstruction on synthetic data.  It demonstrates the effect of noise and outliers on the quality of the reconstruction for each method. The first three rows show results with noise-free data, the middle rows show results with 0.25% added noise, and the last three rows show results with 10% outliers.  The ground truth (GT) is shown for comparison.", "section": "4.2 Experimental results"}, {"figure_path": "7nbAots3f8/figures/figures_21_1.jpg", "caption": "Figure 5: Visual comparisons on the synthetic dataset. First three rows: uniformly sampled points. Meddle three rows: point clouds with 0.25% added noise. Last three rows: point clouds with 10% outliers. All point clouds here have 48K points, except for the Bunny model, which has 100K points. We refer readers to the appendix for more visual results.", "description": "This figure shows a visual comparison of different methods for 3D surface reconstruction using point clouds with different levels of noise and outliers.  The top three rows show reconstructions from clean point clouds, the middle three rows show reconstructions from point clouds with 0.25% added noise, and the bottom three rows show reconstructions from point clouds with 10% outliers.  The results demonstrate the robustness of the proposed method to noise and outliers.", "section": "4.2 Experimental results"}]