[{"figure_path": "s1MoH2pACa/figures/figures_6_1.jpg", "caption": "Figure 1: A visual comparison of ensemble on an image from Manga109 [48] for the task of super-resolution. “HR & LR” means high-resolution and bicubic-upscaled low-resolution images. The second line of (c)-(g) are error maps. Please zoom in for better visual quality.", "description": "This figure compares different super-resolution methods on a sample image from the Manga109 dataset.  It shows the original high-resolution (HR) image, a low-resolution (LR) bicubic upscaled version, and the results from SwinIR, HGBT (Histogram Gradient Boosting), average ensemble, ZZPM (a state-of-the-art method from the NTIRE 2023 competition), and the proposed EnsIR method. The bottom row displays error maps for visual comparison of the quality of results.  EnsIR produces the visually best results according to this example.", "section": "4.2 Qualitative Results"}, {"figure_path": "s1MoH2pACa/figures/figures_8_1.jpg", "caption": "Figure 4: A sample of weight visualizations on HIDE [60]. Base models are DGUNet [50], MPRNet [82], and Restormer [81]. The first column shows the base model predictions and ground-truth. The second column shows the ensemble weights and result of the averaging strategy. The third column shows the ensemble weights and result of ZZPM [92]. The last column shows the ensemble weights and result of our method.", "description": "This figure shows a comparison of ensemble weight visualizations using different methods on an image from the HIDE dataset.  The figure includes ground truth, results from three base models (DGUNet, MPRNet, Restormer), and the results of averaging, ZZPM, and the proposed EnsIR method.  Each visualization section shows the weights assigned to each base model's prediction for each region of the image, offering a visual representation of how the different methods weight the contributions of the base models.", "section": "B More Visualizations"}, {"figure_path": "s1MoH2pACa/figures/figures_8_2.jpg", "caption": "Figure 6: A group of distribution visualizations on HIDE [60]. The bin sets of the first row is (B₁ = [0, 32), B₂ = [0, 32), B₃ = [32, 64)). The bin sets of the second row is (B₁ = [64, 96), B₂ = [32, 64), B₃ = [96, 128)). The bin sets of the third row is (B₁ = [64,96), B₂ = [128,160), B₃ = [128, 160)). The bin sets of the last row is (B₁ = [64,96), B₂ = [64,96), B₃ = [64,96)). Base models are DGUNet [50], MPRNet [82], and Restormer [81].", "description": "This figure shows the distribution of pixel values within specific ranges (bins) for different image restoration models on the HIDE dataset.  It demonstrates the distribution of ground truth and model predictions for each bin, illustrating the underlying assumption of Gaussian distribution for range-wise ensemble weights in the proposed EnsIR algorithm.", "section": "More Visualizations"}, {"figure_path": "s1MoH2pACa/figures/figures_18_1.jpg", "caption": "Figure 4: A sample of weight visualizations on HIDE [60]. Base models are DGUNet [50], MPRNet [82], and Restormer [81]. The first column shows the base model predictions and ground-truth. The second column shows the ensemble weights and result of the averaging strategy. The third column shows the ensemble weights and result of ZZPM [92]. The last column shows the ensemble weights and result of our method.", "description": "This figure displays a comparison of ensemble weight maps for different methods on a sample image from the HIDE dataset for image deblurring.  It demonstrates the weight distributions assigned by various methods including averaging, ZZPM, and the proposed EnsIR algorithm. The base models used are DGUNet, MPRNet, and Restormer. The figure shows how EnsIR assigns more detailed weights, preserving textures better than the other methods.", "section": "More Visualizations"}, {"figure_path": "s1MoH2pACa/figures/figures_19_1.jpg", "caption": "Figure 4: A sample of weight visualizations on HIDE [60]. Base models are DGUNet [50], MPRNet [82], and Restormer [81]. The first column shows the base model predictions and ground-truth. The second column shows the ensemble weights and result of the averaging strategy. The third column shows the ensemble weights and result of ZZPM [92]. The last column shows the ensemble weights and result of our method.", "description": "This figure shows a comparison of ensemble weight maps for different methods on a sample image from the HIDE dataset.  Four base models (DGUNet, MPRNet, Restormer) are used, along with averaging, ZZPM, and the proposed EnsIR method.  The figure demonstrates how the proposed EnsIR learns more detailed and nuanced weights compared to simpler averaging or regression-based approaches.  Each column represents a different method, showing the base model predictions, ground truth, and the resulting ensemble weight maps.", "section": "More Visualizations"}, {"figure_path": "s1MoH2pACa/figures/figures_20_1.jpg", "caption": "Figure 6: A group of distribution visualizations on HIDE [60]. The bin sets of the first row is (B₁ = [0, 32), B₂ = [0, 32), B₃ = [32, 64)). The bin sets of the second row is (B₁ = [64, 96), B₂ = [32, 64), В₃ = [96, 128)). The bin sets of the third row is (B₁ = [64,96), B₂ = [128,160), B3 = [128, 160)). The bin sets of the last row is (B₁ = [64,96), B2 = [64,96), В3 = [64,96)). Base models are DGUNet [50], MPRNet [82], and Restormer [81].", "description": "This figure shows the distribution of pixel values within different bin sets for both the reference and test sets.  It visually demonstrates the Gaussian-like distribution assumption used in the proposed ensemble method (EnsIR).  The different rows represent different combinations of bin ranges selected for analysis. Each bar shows the frequency of pixels within a specific range for different base models and the ground truth.  This visualization helps in understanding how the model determines the weights for the ensemble.", "section": "More Visualizations"}, {"figure_path": "s1MoH2pACa/figures/figures_21_1.jpg", "caption": "Figure 7. A visual comparison of ensemble on an image from Set14 [83] for the task of super-resolution. Please zoom in for better visual quality.", "description": "This figure compares different super-resolution methods on a sample image from the Set14 benchmark dataset.  The first image shows the original high-resolution image. The next images show the low-resolution image upscaled using bicubic interpolation, and then results from several different super-resolution models (SwinIR, SRFormer, HGBT, averaging, ZZPM, and the proposed EnsIR method).  The caption notes that zooming in will improve the visual comparison, implying subtle differences are present between the methods.", "section": "4.2.3 Qualitative Results"}, {"figure_path": "s1MoH2pACa/figures/figures_21_2.jpg", "caption": "Figure 8: A visual comparison of ensemble on an image from Urban100 [30] for the task of super-resolution. Please zoom in for better visual quality.", "description": "This figure compares different super-resolution methods on a single image from the Urban100 dataset.  It shows the original high-resolution (HR) image, the bicubic upscaled low-resolution image, results from SwinIR, SRFormer, HGBT, average ensemble, ZZPM's method and the proposed EnsIR method.  The PSNR/SSIM scores are provided for each method, allowing for a quantitative comparison of their performance. The visual differences between the methods, particularly in finer details, are highlighted to showcase the qualitative improvement achieved by the proposed method.", "section": "4.2.3 Qualitative Results"}, {"figure_path": "s1MoH2pACa/figures/figures_21_3.jpg", "caption": "Figure 9: A visual comparison of ensemble on an image from Urban100 [30] for the task of super-resolution. Please zoom in for better visual quality.", "description": "This figure compares the results of different super-resolution methods on a sample image from the Urban100 dataset.  It shows the original high-resolution (HR) image, the bicubic upsampled low-resolution image, results from SwinIR, MambaIR, HGBT, averaging, ZZPM, and the proposed EnsIR method.  The PSNR and SSIM values are provided for quantitative comparison, highlighting the improved performance of EnsIR.", "section": "4.2.3 Qualitative Results"}, {"figure_path": "s1MoH2pACa/figures/figures_21_4.jpg", "caption": "Figure 10: A visual comparison of ensemble on an image from Urban100 [30] for the task of super-resolution. Please zoom in for better visual quality.", "description": "This figure compares different super-resolution methods on a specific image from the Urban100 dataset.  It shows the original high-resolution image, a bicubic upscaled low-resolution image, results from SwinIR, SRFormer, HGBT, a simple averaging ensemble, the ZZPM method, and the proposed EnsIR method.  The PSNR and SSIM values are provided for quantitative comparison, highlighting the superior performance of the EnsIR method.", "section": "4.2.3 Qualitative Results"}, {"figure_path": "s1MoH2pACa/figures/figures_22_1.jpg", "caption": "Figure 11: A visual comparison of ensemble on an image from HIDE [60] for the task of image deblurring. Please zoom in for better visual quality.", "description": "This figure shows a visual comparison of different ensemble methods on a blurry image from the HIDE dataset for image deblurring. The methods compared include: a blurry image, MPRNet, HGBT, average ensemble, ZZPM, and the proposed EnsIR method with bin widths of 64 and 32.  The results are presented in terms of PSNR and SSIM values, along with visual comparisons of the deblurred images. The figure aims to highlight the improved performance of the proposed EnsIR method, especially in preserving fine details and textures compared to other techniques.", "section": "4.2.3 Qualitative Results"}, {"figure_path": "s1MoH2pACa/figures/figures_22_2.jpg", "caption": "Figure 12: A visual comparison of ensemble on an image from RealBlur-J [58] for the task of image deblurring. Please zoom in for better visual quality.", "description": "This figure compares different ensemble methods on a blurry image from the RealBlur-J dataset.  The methods compared include the baseline HGBT, averaging, ZZPM, and the proposed EnsIR method. The figure shows the original blurry image, the ground truth, results of the individual base models used in the ensemble (MPRNet and Restormer), the results of each ensemble method, and the corresponding PSNR/SSIM values.  The visual comparison highlights that the proposed EnsIR method outperforms other methods in terms of both quantitative metrics and visual quality.", "section": "4.2.3 Qualitative Results"}, {"figure_path": "s1MoH2pACa/figures/figures_22_3.jpg", "caption": "Figure 13: A visual comparison of ensemble on an image from RealBlur-J [58] for the task of image deblurring. Please zoom in for better visual quality.", "description": "This figure shows a visual comparison of different ensemble methods on a blurry image from the RealBlur-J dataset.  The image is deblurred using several base models (MPRNet, Restormer, HGBT), as well as averaging, ZZPM, and the proposed EnsIR method.  The results demonstrate the effectiveness of EnsIR in producing sharper and higher-quality deblurred images compared to other methods.", "section": "4.2.3 Qualitative Results"}, {"figure_path": "s1MoH2pACa/figures/figures_22_4.jpg", "caption": "Figure 14: A visual comparison of ensemble on an image from Rain100H [74] for the task of image deraining. Please zoom in for better visual quality.", "description": "This figure shows a visual comparison of different ensemble methods on a rainy image from the Rain100H dataset.  The image is first shown in its original, rainy state. It then shows the ground truth (Clean), results from applying individual deraining models (MPRNet, MAXIM), results from the HGBT method, the average ensemble, ZZPM's ensemble, and finally the results from EnsIR (the proposed method) with a bin width of 32. The PSNR/SSIM values for each method are given below the images.  The figure highlights the improvement in deraining quality achieved by the proposed EnsIR method compared to other ensemble techniques.", "section": "4.2.3 Qualitative Results"}, {"figure_path": "s1MoH2pACa/figures/figures_23_1.jpg", "caption": "Figure 15: A visual comparison of ensemble on an image from Rain100L [74] for the task of image deraining. Please zoom in for better visual quality.", "description": "This figure shows a visual comparison of different ensemble methods on a single image from the Rain100L dataset for image deraining.  The top row displays the original clean image, the rainy image, and the results from three individual deraining models (MPRNet, Restormer, and HGBT). The bottom row shows the results of the averaging ensemble method, the ZZPM method, and the proposed EnsIR method.  The PSNR and SSIM values are provided for quantitative comparison.  The green boxes highlight regions where visual differences are more apparent. Overall, the figure demonstrates the visual improvements achieved by the proposed ensemble method.", "section": "4.2.3 Qualitative Results"}, {"figure_path": "s1MoH2pACa/figures/figures_23_2.jpg", "caption": "Figure 16: A visual comparison of ensemble on an image from Rain100L [74] for the task of image deraining. Please zoom in for better visual quality.", "description": "This figure compares different ensemble methods on a single image from the Rain100L dataset for image deraining. The image shows a woman under an umbrella, and the results highlight differences in how each method handles rain streaks and overall image quality.  The methods include a baseline of using only the MPRNet and Restormer models, the HGBT algorithm, simple averaging, the ZZPM method, and the authors' proposed EnsIR method. The results show that EnsIR produces a visually superior result with enhanced details and reduced artifacts compared to other approaches.", "section": "4.2.3 Qualitative Results"}, {"figure_path": "s1MoH2pACa/figures/figures_23_3.jpg", "caption": "Figure 17: A visual comparison of ensemble on an image from Test1200 [86] for the task of image deraining. Please zoom in for better visual quality.", "description": "This figure shows a visual comparison of different image deraining methods on a specific image from the Test1200 dataset.  The methods compared include the base models MAXIM and Restormer, the ensemble methods HGBT, averaging, ZZPM, and the proposed EnsIR method.  The results are presented in terms of PSNR and SSIM values,  and visually, showing the derained image produced by each method. The goal is to showcase the performance improvement achieved by EnsIR compared to other baselines and other ensemble methods.", "section": "4.2.3 Qualitative Results"}, {"figure_path": "s1MoH2pACa/figures/figures_23_4.jpg", "caption": "Figure 18: A visual comparison of ensemble on an image from Test2800 [86] for the task of image deraining. Please zoom in for better visual quality.", "description": "This figure compares the visual results of different ensemble methods on a single image from the Test2800 dataset for image deraining.  It shows the original clean image, the rainy image, and the results of MPRNet, MAXIM, HGBT, averaging, ZZPM, and the proposed EnsIR method. The caption highlights that zooming in will reveal more details of the visual differences in image quality.", "section": "4.2.3 Qualitative Results"}]