[{"figure_path": "QsxldAFMFx/tables/tables_5_1.jpg", "caption": "Table 1: Stylometry accuracy results. Seen few-shot players are a subset of the fine-tuning player set, unlike unseen players. Numbers for McIlroy-Young et al. [2022] and McIlroy-Young et al. [2021] are borrowed from their respective papers.", "description": "This table compares the stylometry accuracy (i.e., the ability to identify which player played a given set of games) of the proposed method (MHR-Maia) against two state-of-the-art baselines (McIlroy-Young et al. [2022] and McIlroy-Young et al. [2021]). The comparison is done for two different scenarios: \n\n1.  **Seen few-shot players:**  The query set of games is from players already included in the model's training data. In this scenario, the MHR-Maia model achieves 99.8% accuracy with 100 query games.\n2.  **Unseen few-shot players:** The query set is from players not used during the model's training phase. Here, MHR-Maia achieves 87.6% accuracy, outperforming the baseline method in the number of unseen players.", "section": "5.1 Behavioral Stylometry"}, {"figure_path": "QsxldAFMFx/tables/tables_14_1.jpg", "caption": "Table 1: Stylometry accuracy results. Seen few-shot players are a subset of the fine-tuning player set, unlike unseen players. Numbers for McIlroy-Young et al. [2022] and McIlroy-Young et al. [2021] are borrowed from their respective papers.", "description": "This table compares the stylometry accuracy (the ability to identify which player produced a given set of games) of different methods, including the proposed method (MHR-Maia) and two previous methods (McIlroy-Young et al. [2022] and McIlroy-Young et al. [2021]). It shows the accuracy for both \"seen\" (players included in the training data) and \"unseen\" (players not included in the training data) few-shot players, highlighting the scalability and performance of the proposed method. The accuracy is measured as the percentage of correctly identified players.", "section": "5.1 Behavioral Stylometry"}]