[{"figure_path": "fpxRpPbF1t/figures/figures_1_1.jpg", "caption": "Figure 1: System overview. The DMSP model encodes the physical properties of a string (e.g., tension, stiffness, damping, and initial conditions) to estimate the displacement of the string plucked at pitch  at a given time  ∈ [0,∞) and position  ∈ Ω. By concatenating the DMSP outputs over the domain  (x, t) ∈ Ω × [0, ∞), the simulated motion of the string can be visualized. Reading the outputs at a particular position x allows hearing the synthesized string sound, akin to listening with a stethoscope at the pickup position.", "description": "This figure illustrates the overall architecture of the Differentiable Modal Synthesis for Physical Modeling (DMSP) system. It shows how the model takes physical properties (tension, stiffness, damping, initial conditions) and control parameters (pitch, time, pickup position) as inputs and produces both a visual representation of string motion (displacement over time and space) and the corresponding synthesized sound.", "section": "3 Differentiable Modal Synthesis for Physical Modeling (DMSP)"}, {"figure_path": "fpxRpPbF1t/figures/figures_2_1.jpg", "caption": "Figure 2: The planar string system.", "description": "This figure shows a schematic representation of a planar string system.  The string's transverse displacement,  u(x), and longitudinal displacement, ζ(x), are shown for a section of the string around point x. The string is shown as a series of interconnected mass points, indicating the discretization used in the numerical modeling of the string's vibration. The arrows illustrate the directions of the transverse (u(x)) and longitudinal (ζ(x)) displacements.", "section": "2.1 Physical Modeling of Musical String Instrument"}, {"figure_path": "fpxRpPbF1t/figures/figures_4_1.jpg", "caption": "Figure 3: Network architecture. DMSP synthesizes a pitch skeleton with an inharmonic structure, drawing upon overtones derived from the modes of the string. The modes can either be derived directly using the modal decomposition (DMSP-Hybrid, the hybrid of DMSP and Modal), or using the neural network trained to estimate the modes (DMSP, the fully-neural-network method). Yet, relying solely on modal frequencies and corresponding shape functions delineates a linear solution, which falls short of capturing the nuances of nonlinear string motion. To address this, DMSP introduces FM and AM blocks to modulate the modes of the linear solution. This modulation process enables DMSP to estimate the pitch skeleton of the nonlinear solution. Consequently, the output waveform is synthesized through the spectral modeling pipeline, incorporating both (in)harmonic components and the filtered noise.", "description": "This figure shows the architecture of the Differentiable Modal Synthesis for Physical Modeling (DMSP) model.  The model takes physical properties of a string (initial condition, tension, stiffness, damping, and pitch) as input and uses a parameter encoder and a mode estimator to synthesize the sound.  Amplitude and frequency modulation are applied to create an inharmonic pitch skeleton, making the sound more realistic.  Both a hybrid model (using modal decomposition) and a fully neural network model are shown. The model produces an output waveform through a spectral modelling pipeline.", "section": "3 Differentiable Modal Synthesis for Physical Modeling (DMSP)"}, {"figure_path": "fpxRpPbF1t/figures/figures_7_1.jpg", "caption": "Figure 5: Objective scores over the change of physical parameters.", "description": "This figure visualizes how the objective scores (SI-SDR, SDR, MSS, and Pitch) change with respect to variations in the physical parameters (x, κ, α, pa, and px).  Each subplot represents a specific parameter, and the scores for both the Modal synthesis model and the DMSP model are shown as teal and pink dots, respectively. This allows for a direct comparison of model performance under differing physical conditions.", "section": "4.2 Results"}, {"figure_path": "fpxRpPbF1t/figures/figures_8_1.jpg", "caption": "Figure 6: Spectrogram of the synthesized samples on the test set.", "description": "This figure compares spectrograms generated by different models (Modal, DDSPish-XFM, DDSPish, DMSP, DMSP-Hybrid) against the ground truth (FDTD) for the test set.  Each spectrogram visually represents the frequency content of the synthesized audio over time.  The color intensity corresponds to the magnitude of the spectral components. The visual differences highlight how well each model captures the complex characteristics of a real string's sound, including elements like pitch glide and phantom partials.", "section": "4.2 Results"}, {"figure_path": "fpxRpPbF1t/figures/figures_8_2.jpg", "caption": "Figure 7: Spectrograms and state samples of the synthesized samples on the test set. For the spectrograms shown in the first column, the intensity of the frequency (vertical axis) component for time (horizontal axis) is expressed as brightness, and for the states shown in the second column, the displacement (vertical axis) for space (horizontal axis).", "description": "This figure compares the spectrograms and displacement in space and time for different models, including the ground truth (FDTD). The spectrograms visualize the frequency content over time, while the displacement plots show the string's movement in space and time. This provides a visual comparison of the models' ability to capture both the sound and motion characteristics of a plucked string.", "section": "4.2 Results"}, {"figure_path": "fpxRpPbF1t/figures/figures_9_1.jpg", "caption": "Figure 8: Simulated string state visualization.", "description": "This figure visualizes the simulated string displacement over time and space for different methods (FDTD, DMSP, Modal).  The top rows show the displacement and spectrogram for each method.  The bottom rows show the error between each method and the FDTD ground truth. The visualizations allow for a qualitative comparison of the accuracy of the different methods in simulating both the motion and sound of the string.", "section": "4.2 Results"}, {"figure_path": "fpxRpPbF1t/figures/figures_17_1.jpg", "caption": "Figure 3: Network architecture. DMSP synthesizes a pitch skeleton with an inharmonic structure, drawing upon overtones derived from the modes of the string. The modes can either be derived directly using the modal decomposition (DMSP-Hybrid, the hybrid of DMSP and Modal), or using the neural network trained to estimate the modes (DMSP, the fully-neural-network method). Yet, relying solely on modal frequencies and corresponding shape functions delineates a linear solution, which falls short of capturing the nuances of nonlinear string motion. To address this, DMSP introduces FM and AM blocks to modulate the modes of the linear solution. This modulation process enables DMSP to estimate the pitch skeleton of the nonlinear solution. Consequently, the output waveform is synthesized through the spectral modeling pipeline, incorporating both (in)harmonic components and the filtered noise.", "description": "This figure shows the architecture of the Differentiable Modal Synthesis for Physical Modeling (DMSP) model.  The model takes physical properties of a string (initial conditions, tension, stiffness, damping, and pitch) as input. It uses a mode estimator to determine the modes of vibration of the string, which are then modulated by amplitude and frequency modulation (AM/FM) blocks to account for non-linear behavior.  The output is a synthesized waveform that includes harmonic and inharmonic components and noise.", "section": "3 Differentiable Modal Synthesis for Physical Modeling (DMSP)"}]