[{"figure_path": "hFTye9Ge40/tables/tables_9_1.jpg", "caption": "Table 1: Comparison of two top-two algorithms and Algorithm 1.", "description": "This table presents a comparison of the average and maximum stopping times, as well as the error rate, for three different best arm identification algorithms: Algorithm 1 (the proposed algorithm in the paper), TTTS (Top-Two Thompson Sampling), and TTUCB (Top-Two Upper Confidence Bound).  The results demonstrate that Algorithm 1 significantly outperforms the other two frequentist algorithms, especially in terms of the maximum stopping time.", "section": "Simulation"}, {"figure_path": "hFTye9Ge40/tables/tables_9_2.jpg", "caption": "Table 2: Comparison of Algorithm 1 and the no-elimination version of it.", "description": "This table compares the performance of Algorithm 1 (Successive Elimination with Early Stopping) and its modification without the elimination process (NoElim).  The comparison focuses on the average (AVG) and maximum (MAX) stopping times, and the error rate (ERROR) of each algorithm.  The error rate represents the percentage of times the algorithm fails to correctly identify the best arm.  The results demonstrate the effectiveness of the elimination process in Algorithm 1, resulting in significantly reduced stopping times with comparable error rates.", "section": "Simulation"}, {"figure_path": "hFTye9Ge40/tables/tables_13_1.jpg", "caption": "Table 1: Comparison of two top-two algorithms and Algorithm 1.", "description": "This table compares the performance of Algorithm 1 (the proposed algorithm) against two existing top-two algorithms (TTTS and TTUCB) in a Bayesian setting for best arm identification.  The comparison focuses on the average and maximum stopping times, as well as the error rate (misidentification). The results demonstrate that the traditional frequentist approaches (TTTS and TTUCB) have significantly larger stopping times, especially the maximum stopping times, compared to Algorithm 1. This highlights the advantage of the proposed Bayesian approach for this problem.", "section": "Simulation"}, {"figure_path": "hFTye9Ge40/tables/tables_32_1.jpg", "caption": "Table 1: Comparison of two top-two algorithms and Algorithm 1.", "description": "This table compares the performance of Algorithm 1 (the proposed algorithm) against two existing top-two algorithms (TTTS and TTUCB) in terms of average stopping time, maximum stopping time, and error rate.  The results demonstrate that Algorithm 1 is significantly more efficient in terms of the number of samples required to achieve the desired confidence level. The high maximum stopping times for TTTS and TTUCB highlight their inefficiency in the Bayesian setting.", "section": "6 Simulation"}, {"figure_path": "hFTye9Ge40/tables/tables_33_1.jpg", "caption": "Table 8: Multiple arms.", "description": "This table compares the performance of Algorithm 1 and TTUCB in a Bayesian setting with 10 arms.  The average and maximum stopping times, error rate, and computation time are shown. Note that TTUCB's maximum stopping time is capped at 10<sup>8</sup> due to time constraints.", "section": "6 Simulation"}]