{"importance": "This paper is important because it introduces a novel and effective approach to improve the fidelity of large restoration models (LRMs) without requiring additional training.  **This addresses a significant challenge in image restoration** where LRMs often produce unrealistic details (hallucination), especially with severely degraded inputs. The proposed method, ReFIR, is adaptable to various LRMs, making it widely applicable. This work also offers insights into the internal mechanisms of LRMs and opens up new avenues for future research in improving LRM performance and addressing the hallucination issue.", "summary": "ReFIR enhances Large Restoration Models' accuracy by incorporating retrieved images as external knowledge, mitigating hallucination without retraining.", "takeaways": ["ReFIR improves the fidelity of large restoration models by using retrieved images as additional external knowledge.", "ReFIR is a training-free method applicable to various large restoration models, addressing the hallucination challenge.", "The study offers insights into the internal mechanisms of LRMs, paving the way for advancements in image restoration."], "tldr": "Large Restoration Models (LRMs) have significantly improved image restoration. However, they often suffer from \"hallucination,\" generating incorrect details, particularly with severe degradation. This is due to LRMs' heavy reliance on limited internal knowledge. Existing solutions, such as increasing model size, can be computationally expensive. \n\nThis paper introduces ReFIR, a novel retrieval-augmented framework. ReFIR leverages retrieved high-quality images as external knowledge to enhance LRMs.  It uses a nearest-neighbor lookup to find relevant reference images and injects their textures into the LRM's detail restoration stage. **ReFIR is training-free and adaptable to different LRMs, effectively mitigating hallucination and significantly improving both fidelity and realism of restoration results.**", "affiliation": "Tsinghua University", "categories": {"main_category": "Computer Vision", "sub_category": "Image Generation"}, "podcast_path": "iFKmFUxQDh/podcast.wav"}