[{"figure_path": "lKnl4CLhhS/tables/tables_3_1.jpg", "caption": "Table 1: Summary of Complexity Results", "description": "This table summarizes the time complexity of three different methods for reconstructing answers to marginal queries: GReM-MLE, EMP, and one round of GReM-LNN.  The running time for each method is expressed using Big O notation and depends on the size of the marginal workload W, the set of measured residuals S, and the number of attributes in each marginal query.", "section": "4 Computational Complexity"}, {"figure_path": "lKnl4CLhhS/tables/tables_4_1.jpg", "caption": "Table 1: Summary of Complexity Results", "description": "This table summarizes the time complexity of three different methods for reconstructing answers to marginal queries: GReM-MLE, EMP, and one round of GReM-LNN.  The complexity is expressed in Big O notation and depends on the size of the marginal workload (W), the set of measured residuals (S), and the size of the measured residuals (z). The table shows that the running time of all three methods is nearly linear in the size of the data domain.", "section": "4 Computational Complexity"}, {"figure_path": "lKnl4CLhhS/tables/tables_4_2.jpg", "caption": "Table 1: Summary of Complexity Results", "description": "This table summarizes the time complexity of three different marginal reconstruction methods: GReM-MLE, EMP, and one round of GReM-LNN.  The complexity is expressed in Big O notation and depends on the size of the marginal workload (W), the set of measured residuals (S), and the size of the measured residuals for each attribute subset (n). The table shows that the time complexity of all three methods is almost linear with respect to the size of the domain, which is a significant improvement over existing methods.", "section": "4 Applications of ReM under Gaussian Noise"}, {"figure_path": "lKnl4CLhhS/tables/tables_7_1.jpg", "caption": "Table 1: Summary of Complexity Results", "description": "This table summarizes the time complexity of three different methods for reconstructing answers to marginal queries: GReM-MLE, EMP, and one round of GReM-LNN. The time complexity is expressed in big O notation and depends on the size of the marginal workload W and the number of residuals in the measurement sets S or Q.  The table shows that all three methods have a similar time complexity, which is nearly linear in the size of the data domain.", "section": "4 Computational Complexity"}, {"figure_path": "lKnl4CLhhS/tables/tables_26_1.jpg", "caption": "Table 2: Completion results of running Private-PGM by setting for the Scalable MWEM experiment. Failure is broken down by exceeding the 24H time limit or exceeding the available memory (20GB).", "description": "This table shows the results of running the Private-PGM algorithm within the Scalable MWEM experiment across different datasets and numbers of rounds.  It details the number of trials that completed successfully, exceeded the 24-hour time limit, or ran out of memory (20GB).", "section": "5.2 Scalable MWEM Results"}]