[{"figure_path": "164QnJsYjF/tables/tables_5_1.jpg", "caption": "Figure 3: DrDAM produces better approximations to the energies and gradients of MrDAM when the queries are closer to the stored patterns. Approximation quality improves with larger feature dimension Y, but decreases with higher β and higher pattern dimension D. Approximation error is computed on 500 stored binary patterns normalized between {0, 1}. The Mean Approximation Errors (MAE, eq. (14)) is taken over 500 queries initialized: at stored patterns (i.e., queries equal the stored patterns), near stored patterns (i.e., queries equal the stored patterns where 10% of the bits have been flipped), and randomly (i.e., queries are random and far from stored patterns). Error bars represent the standard error of the mean but are visible only at poor approximations. Red horizontal lines represent the expected error of random energies and gradients. The theoretical error upper bounds of eq. (13) (dark curves on the gradient errors in the right plot only) show a tight fit to empirical results at low β and D and are only shown if predictions are “better than random”. The shaded area shows the difference between the theoretical bound and the empirical results.", "description": "This figure shows the approximation errors of DrDAM compared to MrDAM for energy and gradients under different conditions. The approximation error is evaluated on queries initialized at stored patterns, near stored patterns, and randomly. The results demonstrate that DrDAM performs better when queries are closer to the stored patterns. The approximation quality also improves with a larger feature dimension (Y) but decreases with higher inverse temperature (β) and pattern dimension (D). The figure includes error bars and a comparison to the expected error of random energies and gradients, along with theoretical error bounds.", "section": "4 Empirical evaluation"}, {"figure_path": "164QnJsYjF/tables/tables_14_1.jpg", "caption": "Figure 3: DrDAM produces better approximations to the energies and gradients of MrDAM when the queries are closer to the stored patterns. Approximation quality improves with larger feature dimension Y, but decreases with higher β and higher pattern dimension D. Approximation error is computed on 500 stored binary patterns normalized between {0, 1}. The Mean Approximation Errors (MAE, eq. (14)) is taken over 500 queries initialized: at stored patterns (i.e., queries equal the stored patterns), near stored patterns (i.e., queries equal the stored patterns where 10% of the bits have been flipped), and randomly (i.e., queries are random and far from stored patterns). Error bars represent the standard error of the mean but are visible only at poor approximations. Red horizontal lines represent the expected error of random energies and gradients. The theoretical error upper bounds of eq. (13) (dark curves on the gradient errors in the right plot only) show a tight fit to empirical results at low β and D and are only shown if predictions are “better than random”. The shaded area shows the difference between the theoretical bound and the empirical results.", "description": "This figure evaluates the accuracy of DrDAM's approximation of MrDAM's energy and gradient for various query types (at stored patterns, near stored patterns, and random queries), feature dimensions (Y), inverse temperatures (β), and pattern dimensions (D).  It demonstrates that DrDAM's accuracy improves as queries get closer to stored patterns and feature dimension increases, but deteriorates with higher inverse temperatures and higher pattern dimensions. The figure also includes the mean approximation error, error bars, and theoretical error upper bounds for comparison. Red horizontal lines indicate the expected error if energy and gradients were randomly guessed.", "section": "4.1 (D1) How accurate are the energies and gradients of DrDAM?"}]