[{"figure_path": "fkbMlfDBxm/tables/tables_5_1.jpg", "caption": "Table 1: Comparison with OOD generalization methods on the PACS, Office-Home, and VLCS. Note that the results reported in this table do not involve any test-time adaptation strategies. Results are averaged over 3 random seeds. ±x denotes the rounded standard error.", "description": "This table presents a comparison of the proposed REMA model against various state-of-the-art OOD generalization methods across three benchmark datasets: PACS, Office-Home, and VLCS.  The table highlights the average classification accuracy achieved by each method on each dataset, providing a quantitative assessment of REMA's performance relative to existing approaches.  Importantly, the results shown here exclude any test-time adaptation techniques, focusing solely on the generalization capabilities of the models.", "section": "4.2 Main Results"}, {"figure_path": "fkbMlfDBxm/tables/tables_6_1.jpg", "caption": "Table 2: Comparisons with the state-of-the-art methods with average error rate (%) on image corruption benchmarks. Testing is conducted on the highest level of image corruption. All methods use ResNet-50 backbone. ↓ means lower is better.", "description": "This table presents a comparison of the proposed REMA method against several state-of-the-art test-time adaptation methods.  The comparison is based on the average error rate (%) achieved on three image corruption benchmark datasets (CIFAR-10C, CIFAR-100C, and ImageNet-C).  A lower error rate indicates better performance. All methods used a ResNet-50 backbone for fair comparison. The testing was performed at the highest level of image corruption for each dataset.", "section": "4.2 Main Results"}, {"figure_path": "fkbMlfDBxm/tables/tables_7_1.jpg", "caption": "Table 4: Ablation of REMA (%)", "description": "This table presents the ablation study results for the REMA framework. It shows the impact of using the Selective Slot-based Reconstruction (SSR) and High-Order Relational Reasoning (HORR) modules individually and together on the performance of the model across three benchmark datasets: VLCS, PACS, and Office-Home. The results demonstrate that both modules contribute to improved generalization performance, and that combining them yields the best overall results.", "section": "4.3 Ablation Studies"}]