[{"figure_path": "nA4Q983a1v/tables/tables_3_1.jpg", "caption": "Figure 4: We compare TBB (ours) to SBB across POPGym tasks and memory models, reporting the mean and 95% bootstrapped confidence interval of the evaluation return over ten seeds. We find that TBB significantly improves sample efficiency.", "description": "This figure compares the performance of Tape-Based Batching (TBB) and Segment-Based Batching (SBB) across various tasks and memory models within the POPGym benchmark.  The results show the mean evaluation return and 95% bootstrapped confidence intervals across ten different seeds for each configuration. The key finding is that TBB significantly improves sample efficiency compared to SBB.", "section": "5 Experiments and Discussion"}, {"figure_path": "nA4Q983a1v/tables/tables_8_1.jpg", "caption": "Figure 5: (Left) We compare how long it takes to compute the discounted return using our memoroid, compared to the standard way of iterating through a batch. Computing the discounted return is orders of magnitude faster when using our memoroid implementation. (Right) we compare the total time to train a policy on Repeat First. For both experiments, we evaluate ten random seeds on a RTX 2080Ti GPU.", "description": "This figure shows the results of two experiments evaluating the wall-clock efficiency of the proposed memoroid-based approach and the Tape-Based Batching (TBB) method.  The left panel demonstrates the significant speedup achieved by the memoroid in computing discounted returns compared to the standard iterative method. The right panel compares the total training time for TBB against Segment-Based Batching (SBB) with various segment lengths on the Repeat First task.  The results highlight the efficiency gains offered by the memoroid and TBB.", "section": "Experiments and Discussion"}, {"figure_path": "nA4Q983a1v/tables/tables_21_1.jpg", "caption": "Figure 4: We compare TBB (ours) to SBB across POPGym tasks and memory models, reporting the mean and 95% bootstrapped confidence interval of the evaluation return over ten seeds. We find that TBB significantly improves sample efficiency. See Appendix A for more experiments.", "description": "This table compares the performance of Tape-Based Batching (TBB) and Segment-Based Batching (SBB) across different tasks and memory models in the POPGym benchmark.  The results show the mean and 95% confidence intervals of the evaluation return, calculated over ten different random seeds for each configuration.  The key finding is that TBB significantly improves sample efficiency compared to SBB.", "section": "Experiments and Discussion"}, {"figure_path": "nA4Q983a1v/tables/tables_23_1.jpg", "caption": "Figure 4: We compare TBB (ours) to SBB across POPGym tasks and memory models, reporting the mean and 95% bootstrapped confidence interval of the evaluation return over ten seeds. We find that TBB significantly improves sample efficiency.", "description": "This figure compares the performance of Tape-Based Batching (TBB) and Segment-Based Batching (SBB) across various tasks and memory models within the POPGym benchmark. The results show the mean and 95% bootstrapped confidence intervals of the evaluation return over ten seeds.  A key finding is that TBB demonstrates significantly better sample efficiency than SBB.", "section": "5 Experiments and Discussion"}]