[{"type": "text", "text": "CLODE: Continuous Exposure Learning for Low-light Image Enhancement using Neural ODEs ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Anonymous Author(s)   \nAffiliation   \nAddress   \nemail ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "1 Low-light image enhancement poses a significant challenge due to the limited   \n2 information captured by image sensors in low-light environments. Despite recent   \n3 improvements in deep learning models, the lack of paired training datasets remains   \n4 a significant obstacle. Therefore, unsupervised methods have emerged as a promis  \n5 ing solution. In this work, we focus on the strength of curve-adjustment-based   \n6 approaches to tackle unsupervised methods. The majority of existing unsupervised   \n7 curve-adjustment approaches iteratively estimate higher order curve parameters   \n8 to enhance the exposure of images while efficiently preserving the details of the   \n9 images. However, the convergence of the enhancement procedure cannot be guar  \n0 anteed, leading to sensitivity to the number of iterations and limited performance.   \n11 To address this problem, we consider the iterative curve-adjustment update process   \n12 as a dynamic system and formulate it as a Neural Ordinary Differential Equations   \n13 (NODE) for the first time, and this allows us to learn a continuous dynamics of   \n14 the latent image. The strategy of utilizing NODE to leverage continuous dynamics   \n15 in iterative methods enhances unsupervised learning and aids in achieving better   \n16 convergence compared to discrete-space approaches. Consequently, we achieve   \n17 state-of-the-art performance in unsupervised low-light image enhancement across   \n18 various benchmark datasets. ", "page_idx": 0}, {"type": "text", "text": "19 1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "20 Images taken in various low-light environments suffer from insufficient light, leading to the capture   \n21 of limited information by the camera’s image sensor. Therefore, many studies have been conducted   \n22 to improve the quality of the low-light images and achieve images with optimal exposure levels.   \n23 In particular, recent supervision-based deep learning approaches [1, 2, 3] have shown remarkable   \n24 performance in enhancing low-light images. However, the process of collecting pairs of low-light   \n25 scenes and their corresponding ground-truth images for supervised learning is time consuming and   \n26 resource intensive. As a result, unsupervised approaches that rely solely on low-light images have   \n27 been proposed to address this problem.   \n28 Among many unsupervised low-light image enhancement approaches, curve-adjustment-based meth  \n29 ods, conventionally used in photo editing software (e.g., Photoshop), have received much attention.   \n30 After the introduction of first learning-based curve-adjustment work by Yuan and Sun [7], iter  \n31 ative curve-adjustment-based methods have been explored in various subsequent studies. These   \n32 unsupervised methods achieve enhancement without using the ground-truth images by fitting the   \n33 brightness values of pixels in the input image to specific curves. In addition, it is advantageous to   \n34 preserve local structural information adaptively by allowing efficient pixel-by-pixel computations.   \n35 For example, ZeroDCE [6, 8] introduced a fast and lightweight neural network to predict pixel-wise   \n36 curve parameter maps within a fixed iteration step. In addition, ReLLIE [9] produced more accurate   \n37 image enhancement results by using reinforcement learning to predict the curve parameter map at   \n38 each iteration step, with users able to adjust the number of iterations.   \n39 In general, these curve-adjustment-based methods, which have fewer parameters, offer the advantage   \n40 of fast and efficient training and also demonstrate the effectiveness of using higher-order curves   \n41 for low-light image adjustment. However, conventional iterative approaches in discrete-space with   \n42 fixed update steps do not arrive at the optimal solution and cannot guarantee convergence of the   \n43 optimization. Therefore, we alleviate this problem in the discrete-space updating process of existing   \n44 methods. In doing so, we bring out the strengths of curve fitting methods by reformulating the   \n45 iterative update formula into ordinary differential equations, which allows the iterative approach to be   \n46 transformed from discrete-space to continuous-space and find input-specific higher-order curves until   \n47 convergence within a specified tolerance. To be specific, we present the Neural Ordinary Differential   \n48 Equations (NODE) model for the low-light enhancement task for the first time. By solving the   \n49 NODE problem using conventional ODE solvers, we obtain better approximate solutions to the   \n50 curve-adjustment problem, producing more accurate results than conventional results from iterative   \n5 updates in discrete-space by exploring the continuous exposure dynamics. In this work, we introduce   \n52 Continuous exposure learning for Low-light image enhancement using neural Ordinary Differential   \n53 Equations (CLODE), which is the first dynamic system for low-light image enhancement. Our main   \n54 contributions can be summarized as follows:   \n55 • CLODE is the first approach to formulate the higher-order curve estimation problem as a   \n56 NODE problem, enabling effective and accurate solutions with standard ODE solvers.   \n57 • By transforming the discrete update formula into NODE, which is solvable in continuous  \n58 space, we significantly enhance the unsupervised low-light image enhancement results across   \n59 various benchmark datasets as shown in Fig. 1. This effectively bridges the performance   \n60 gap between supervised and unsupervised approaches.   \n61 • CLODE also offers user controllability without altering the network architecture, enabling   \n62 users to manually adjust the desired level of exposure as needed. ", "page_idx": 0}, {"type": "text", "text": "", "page_idx": 0}, {"type": "image", "img_path": "5p57uCUH8k/tmp/9a3ca0707ba510e7ffed907e287871545b5dbc07ceb273a1d957d243483b6eee.jpg", "img_caption": ["Figure 1: (a) Quantitative Evaluation: The average PSNR values on the LSRW [4] and LOL [5], together with the respective parameter numbers for each model. (b) Visual Comparisons with ZeroDCE [6] (unsupervised), RetinexFormer [2] (supervised) and proposed CLODE (unsupervised). "], "img_footnote": [], "page_idx": 1}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "63 2 Related works ", "text_level": 1, "page_idx": 1}, {"type": "text", "text": "64 2.1 Unsupervised Low-light Image Enhancement ", "text_level": 1, "page_idx": 1}, {"type": "text", "text": "65 Obtaining well-exposed ground-truth images paired with corresponding low-light images is inherently   \n66 challenging, which limits the use of supervised learning in low-light image enhancement. To address   \n67 this limitation, many unsupervised methods have been developed to tackle the problem. First, there   \n68 are some approaches [10, 11, 12, 13] that utilize the principles of retinex-theory. Among them,   \n69 PairLIE [13] utilizes retinex-theory to identify the reflectance and illumination, and employs gamma   \n70 correction with user-defined gamma values to enhance the illumination. In addition, UDCN [14] and   \n71 HEP [15] use histogram equalization results as a reference for exposure enhancement. Moreover,   \n72 recent approaches using GANs have shown remarkable improvements by additionally utilizing   \n73 unpaired images of normal exposed [16, 17]. Lastly, there are curve-adjustment-based methods [6, 8,   \n74 18, 9] that transform images through tone mapping. These methods have advanced the curve-fitting   \n75 techniques from traditional editing tools into deep learning-based approaches, enhancing images by   \n76 predicting the fitting curves pixel-by-pixel. By repeating the pixel-wise curve fitting and exposure   \n77 enhancement for a fixed number of iterations in discrete-space, these approaches aim to handle locally   \n78 varying exposure levels (i.e., single image with both underexposed and overexposed areas) in an   \n79 unsupervised manner. Our CLODE also follows this unsupervised curve-adjustment-based method   \n80 and reformulates the curve-fitting problem into a neural ordinary differential equation (NODE). By   \n81 solving the NODE problem using conventional ODE solvers, we increase the accuracy of curve ftiting   \n82 and thus significantly improve the performance of low-light image enhancement. ", "page_idx": 1}, {"type": "text", "text": "", "page_idx": 2}, {"type": "text", "text": "83 2.2 Neural Ordinary Differential Equations ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "84 An ordinary differential equation (ODE) is a fundamental concept in mathematics that describes how   \n85 a function changes with respect to a single variable. It captures the relationship between a function   \n86 and its derivatives, providing a powerful tool for modeling dynamic systems, such as Newton’s   \n87 Second Law of Motion. To effectively apply the strength of ordinary differential equations to the   \n88 deep learning model, the concept of neural ordinary differential equations (NODE) is introduced   \n89 in [19]. The use of NODE facilitates model definition and evaluation, highlighting its effectiveness in   \n90 parameter efficiency, adaptive computation, and modeling continuous data. In order to effectively   \n91 capture more complicated functions, the Augmented Neural ODE (ANODE) [20] has been introduced.   \n92 Furthermore, for seamless continuous time-series modeling, Latent ODE [21] is proposed and recently,   \n93 ClimODE [22] proposed a continuous-time NODE models for numerical weather prediction. To be   \n94 specific, in the field of computer vision, the Vid-ODE approach [23] has been introduced to generate   \n95 continuous-time videos. NODEO [24] has presented a versatile architecture tailored for deformable   \n96 image registration, and a temporal deformation model using the capabilities of NODE has been   \n97 developed in [25] to address the challenges associated with future prediction tasks in the context   \n98 of 4D reconstruction. With advantages like continuous-space modeling, adaptive computation, and   \n99 memory efficiency, NODE [19] is utilized in various deep learning tasks. However, it has not been   \n100 extensively explored in the field of image restoration. While NODE-SR [26] has been introduced to   \n101 address the arbitrary scale super-resolution problem, our methodology marks the first application in   \n102 image exposure enhancement. In contrast to NODE-SR [26], which learns the continuous variation of   \n103 the scaling factor for the arbitrary scale super-resolution problem, our CLODE learns the continuous   \n104 variation of image exposure through curve-adjustment. ", "page_idx": 2}, {"type": "text", "text": "105 3 Proposed Method ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "106 3.1 Preliminary ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "107 In photo editing applications, the curve-adjustment method is often used to adjust the tone of   \n108 input images and provides effective exposure control. While this method is useful for pixel-wise   \n109 manipulation, it is not well suited for images that contain areas of extreme over- or under-exposure.   \n110 Additionally, a notable drawback of this approach is its reliance on manual adjustments (e.g., the   \n111 number of updates) by the user for each input image. This can be time-consuming and potentially less   \n112 accurate in certain scenarios. To address this problem, Yuan and Sun [7] have proposed a solution   \n113 that aims to mitigate the limitations of manual adjustments. They introduced an automated approach   \n114 that involves estimating an image-specific $S_{}$ -shaped nonlinear tone curve (referred to as an $S_{}$ -curve)   \n115 tailored to each input image. Specifically, for a given low-light image $I_{0}$ , where each pixel value is in   \n116 the range [0, 1], the $S_{}$ -curve formula for the enhanced image $I_{0}^{'}$ can be represented as follows: ", "page_idx": 2}, {"type": "equation", "text": "$$\nI_{0}^{'}=I_{0}+\\phi_{s}\\cdot P_{\\Delta}(I_{0})-\\phi_{h}\\cdot P_{\\Delta}(1-I_{0}),\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "117 where $\\phi_{s}$ and $\\phi_{h}$ represent parameters for the amount of shadow and highlight, respectively. The   \n118 function $P_{\\Delta}$ serves as an increasing function for the adjustment that manipulates the intensity of   \n119 individual pixels within the input of the function.   \n120 While Eq.1 allows for adjusting the brightness of an entire image using a single global curve parameter,   \n121 existing iterative curve-adjustments approaches [6, 8, 9, 27] operate on a pixel-wise basis of the input   \n122 images. Furthermore, they introduce the necessity of higher-order curves, which enhances images by   \n123 ftiting higher-order curves for fixed iteration steps while using a deep learning model to predict curve   \n124 parameters on a pixel-by-pixel basis. Specifically the update formula enhances an image $I_{n}$ at the   \n125 $n$ -th step to an image $I_{n+1}$ at the next step as follows: ", "page_idx": 2}, {"type": "text", "text": "", "page_idx": 2}, {"type": "equation", "text": "$$\nI_{n+1}=I_{n}+\\mathcal{A}_{n}\\otimes I_{n}\\otimes(1-I_{n}),\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "126 where $\\mathcal{A}_{n}\\,\\in\\,\\mathbb{R}^{C\\times H\\times W}$ represents a pixel-wise varying curve parameter map and $C,H$ , and $W$   \n127 represent the number of channels, height, and width of the image $I_{n}$ , and $\\otimes$ operation denotes element  \n128 wise multiplication. Note that, the elements of $A_{n}$ corresponding to the curve parameters at each   \n129 pixel location are in the range $[-1,1]$ and determine the quadratic curve for the pixel-wise exposure   \n130 adjustment during the enhancement process. Conventional curve-adjustment methods [6, 8, 9, 18]   \n131 iteratively follow this process for $N$ times, fitting an appropriate higher-order curve to produce   \n132 the final well-exposed output image. On the contrary, our CLODE performs curve adjustment for   \n133 image enhancement by reformulating Eq. 2 as an ordinary differential equation. This approach   \n134 facilitates memory-efficient training and yields more accurate results through adaptive computation   \n135 using modern ODE solvers. ", "page_idx": 2}, {"type": "image", "img_path": "5p57uCUH8k/tmp/df7523952432ccfec2210092393d9636ea7dda95ab60a0a92cbdcbac393f6262.jpg", "img_caption": ["Figure 2: (a) Illustration of continuous update procedure of CLODE. Optimal iterative update can be achieved through the ODE equation. (b) Illustration of our ODEfunc $f_{\\theta}$ . ODEfunc contains the Noise Removal $(g)$ , Curve Parameter Estimation $(h)$ module, and Eq. 9 to obtain the derivative value. Please refer to Appendix A.1.2 for more details. "], "img_footnote": [], "page_idx": 3}, {"type": "text", "text": "", "page_idx": 3}, {"type": "text", "text": "136 3.2 Continuous Exposure Learning for Low-light Image Enhancement using Neural ODEs ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "137 Although conventional curve-adjustment-based iterative methods offer advantages in terms of   \n138 lightweight network architecture and local robustness, these approaches cannot guarantee con  \n139 vergence of the update process. ZeroDCE [6] empirically determines the iteration number $N$ and   \n140 enhances low-light images by iterating the curve-adjustment formula 8 $(=N)$ times. While ReL  \n141 LIE [9] provides users with optional flexibility, it requires manual selection of the value of $N$ for   \n142 each input image to further improve image quality. To tackle this challenge in optimization, we   \n143 reformulate the curve-adjustment-based formula outlined in Eq. 2 as a Neural Ordinary Differential   \n144 Equations (NODE). Then, we can solve the NODE with conventional ODE solvers (e.g., Euler, RK4,   \n145 dopri5) which guarantees the convergence of loss within tolerances. Specifically, we reformulate   \n146 the original curve-adjustment-based formula by introducing a continuous state $t$ instead of using the   \n147 discrete state $n$ as follows:   \n(3) ", "page_idx": 3}, {"type": "equation", "text": "$$\nI_{t+1}=I_{t}+f_{\\theta}(I_{t},t),\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "148 where $f_{\\theta}$ is a neural network with trainable parameters $\\theta$ that satisfies $f_{\\theta}(I_{t},t)=A_{t}\\otimes I_{t}\\otimes(1-I_{t})$ .   \n149 Then, we can parameterize the derivative of the enhanced image during the update using the network   \n150 $f_{\\theta}$ if the continuous update step is very small, and it is given by, ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\frac{d I_{t}}{d t}=f_{\\theta}(I_{t},t).\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "151 By transforming the original curve ftiting problem into a NODE problem with an initial condition $I_{0}$ ,   \n152 we can estimate not only the derivative value of each state but also recover the enhanced image by   \n153 solving the problem, and the initial value problem is given by, ", "page_idx": 3}, {"type": "equation", "text": "$$\nI_{T}=I_{0}+\\int_{0}^{T}f_{\\theta}(I_{t},t)d t,\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "154 where $I_{T}$ denotes the well-exposed image at the final state $T$ . Finally, the low-light image enhance  \n155 ment process to output $I_{T}$ is accomplished by using the ODE solver as: ", "page_idx": 3}, {"type": "equation", "text": "$$\nI_{T}=\\mathbf{ODE_{-}S o l v e r}(I_{0},[0,T],f_{\\theta}),\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "156 where ODE_Solver denotes a conventional algorithm for solving the ordinary differential equations.   \n157 In our experiments, CLODE adopts the well-known dopri5 (Dormand-Prince 5th order Runge-Kutta)   \n158 as an adaptive ODE solver, that determines an input-specific number of iterations for each input and   \n159 dynamically adjusts the step size. Using the adaptive solver, we can adaptively compute the optimal   \n160 state for different exposure levels, thereby enabling a more accurate approximation of the solution.   \n161 This is in contrast to conventional methods, which use the same fixed number of iterations for all   \n162 input images and cannot guarantee optimality and convergence. To the best of our knowledge, our   \n163 approach is the first to define the low-light image enhancement problem as a novel NODE problem   \n164 with an initial condition.   \n166 We can solve the NODE problem in Eq. 5 by integrating $f_{\\theta}$ over the time interval $[0,T]$ with the given   \n167 initial value $I_{0}$ (e.g., a low-light image). In practice, conventional ODE solvers are used to address   \n168 this problem, iteratively enhancing the low-light images using Eq. 3. In Fig. 2(a), we illustrate the   \n169 continuous update procedure of our CLODE approach. Notably, the ODE function (ODEfunc) $f_{\\theta}$   \n170 computes continuous dynamics of the latent image and is a key element in the update procedure. The   \n171 detailed configuration of our ODEfunc $f_{\\theta}$ is shown in Fig. 2(b). To be specific, our ODEfunc includes   \n172 Noise Removal $(g)$ and the Curve Parameter Estimation $(h)$ modules with trainable parameters, and   \n173 outputs ddItt , the continuous dynamics of $I_{t}$ . Please refer to Appendix A.1.2 for more details.   \n174 Noise Removal In the ODEfunc, we first employ a pre-processing step to eliminate the artifacts   \n175 from $I_{t}$ and generate the denoised image ${\\tilde{I}}_{t}$ in order to produce more accurate curve adjustment   \n176 parameters $A_{t}$ . To minimize computational costs within the $f_{\\theta}$ , we employ a simple and lightweight   \n177 three-layer convolutional neural network $g$ as our Noise Removal module, expressed as follows: ", "page_idx": 3}, {"type": "text", "text": "", "page_idx": 4}, {"type": "text", "text": "", "page_idx": 4}, {"type": "equation", "text": "$$\n{\\tilde{I}}_{t}=g(I_{t}).\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "178 The refined image ${\\tilde{I}}_{t}$ is then used as the input to the subsequent Curve Parameter Estimation stage. ", "page_idx": 4}, {"type": "text", "text": "179 Curve Parameter Estimation Inspired by [7, 28], to enhance both under- and over- exposed   \n180 areas, we not only use the denoised image ${\\tilde{I}}_{t}$ and its inverted version $\\left(1-\\tilde{I}_{t}\\right)$ as inputs to the Curve   \n181 Parameter Estimation module. The formulation is given by: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\mathcal{A}_{t}=h(\\tilde{I_{t}},\\tilde{1}-\\tilde{I_{t}}),}\\end{array}\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "182 where $A_{t}$ represents the curve parameter map at $t$ , and $h$ represents the Curve Parameter Estimation   \n183 module. For efficacy, this module is also a lightweight convolutional neural network. In particular,   \n184 we apply layer normalization [29] to all intermediate features. Notably, the use of layer normalization   \n185 enables CLODE to handle the diverse exposure ranges of input images. Furthermore, all convolutional   \n186 layers within the Curve Parameter Estimation module $h$ take the continuous state $t$ as a conditional   \n187 input, allowing for time-varying outputs during the integration interval $[0,T]$ as in [19].   \n188 Continuous Dynamics Lastly, the derivative value of the one-step state at $t$ is computed in our   \n189 ODEfunc, and it is expressed as follows: ", "page_idx": 4}, {"type": "text", "text": "", "page_idx": 4}, {"type": "equation", "text": "$$\n\\frac{d I_{t}}{d t}={\\cal A}_{t}\\otimes I_{t}\\otimes(1-I_{t}).\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "190 Notably, unlike conventional curve-adjustment-based update formulas that discretize update steps,   \n191 our continuous dynamics allows the desired level of accuracy and produces more accurate solutions. ", "page_idx": 4}, {"type": "text", "text": "192 3.3 Inference Process of CLODE ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "193 Inference Process Given a low-light input image $I_{0}$ , CLODE undergoes successive image enhance  \n194 ment through $f_{\\theta}$ until convergence within the specified tolerance of the ODE solvers, resulting in a   \n195 well-exposed image $I_{T}$ . Note that, the output image $I_{T}$ may contain some noise that is amplified   \n196 during the image enhancement process. Therefore, we use the noise-free image ${\\tilde{I}}_{T}$ as our final   \n197 outcome by applying the Noise Removal module $g$ .   \n198 User Controllable Design CLODE learns the low-light exposure adjustment mechanism in the   \n199 continuous-space, and is trained to output $I_{T}$ by integrating the states from 0 to $T$ in Eq. 5 using a   \n200 fixed $T$ . However, as shown in Fig. 3, users can manually adjust the integration interval by changing   \n201 the final state value $T$ at the test stage, allowing them to output images with the preferred exposure   \n202 level and even produce images darker than the input. In practice, by controlling the final state from   \n203 $-(T+\\Delta t)$ to $(T+\\Delta t)$ , the exposure level of the output image can be easily controlled to provide a   \n204 more user-friendly exposure level.   \n206 To address the challenge posed by the lack of ground truth, we use five zero-reference loss functions   \n207 for unsupervised training.   \n208 Spatial Consistency Loss While the given low-light input image $I_{0}$ is enhanced during the update   \n209 procedure, maintaining spatial consistency in the pixel brightness order is crucial for preserving   \n210 image details. Specifically, we measure the difference in spatial consistency between the input image   \n211 $I_{0}$ and our prediction $I_{T}$ by comparing the differences in neighboring pixel values. Similar to [6],   \n212 we compute the spatial consistency after applying 4-by-4 average pooling to both $I_{0}$ and $I_{T}$ , and the   \n213 spatial consistency loss $\\mathcal{L}_{s p a}$ is expressed as: ", "page_idx": 4}, {"type": "text", "text": "", "page_idx": 4}, {"type": "image", "img_path": "5p57uCUH8k/tmp/eaf0d7916aec65549de2ee08ca70e7b92eeeea29d61ef6b2bc7f721032502193.jpg", "img_caption": ["Figure 3: Illustration of User Controllable Design. By manually changing the integration interval from $-(T+\\Delta t)$ to $+(T+\\Delta t)$ , ours can produce results with different exposure levels. "], "img_footnote": [], "page_idx": 4}, {"type": "text", "text": "", "page_idx": 5}, {"type": "text", "text": "", "page_idx": 5}, {"type": "equation", "text": "$$\n\\mathcal{L}_{s p a}=\\frac{1}{K}\\sum_{i=1}^{K}\\sum_{j\\in\\Omega(i)}\\big(|m_{4}(I_{T})_{i}-m_{4}(I_{T})_{j}|-|m_{4}(I_{0})_{i}-m_{4}(I_{0})_{j}|\\big)^{2}.\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "214 The 4-by-4 average pooling operation is denoted as $m_{4}(\\cdot)$ and $\\Omega(i)$ includes neighboring pixels in   \n215 four directions (left, right, top, bottom) centered at position $i$ . The normalization factor $K$ denotes the   \n216 number of pixels in the reduced image after the pooling operation, and $K$ is given by $\\textstyle{\\frac{H}{4}}\\,\\times\\,{\\frac{W}{4}}\\,\\times\\,C$ .   \n217 Exposure Loss To enforce a consistent exposure level across pixels, conventional unsupervised   \n218 methods incorporate exposure guidance into the loss function [6]. Similarly, we introduce a desired   \n219 exposure level parameter $\\mathrm{E}$ and define the exposure loss $\\mathcal{L}_{e x p}$ as: ", "page_idx": 5}, {"type": "text", "text": "", "page_idx": 5}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\mathcal{L}_{e x p}=||m_{16}(I_{T})-\\mathrm{E}||_{2}^{2}.}\\end{array}\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "220 In our experiments, we set the exposure level $\\mathrm{E}$ to 0.6, which corresponds to the gray level in the   \n221 RGB color space. To maintain the overall exposure level in the results, we minimize the difference   \n222 between the pixel values of the predicted image $I_{T}$ and the desired exposure level $\\mathrm{E}$ after performing   \n223 a 16-by-16 average pooling operation $m_{16}(\\cdot)$ on the output image $I_{T}$ .   \n224 Color Constancy Loss In conventional zero-reference methods, two main approaches are used to   \n225 enforce spatial color constancy: one based on the retinex-theory, and the other based on the Gray  \n226 World hypothesis in [30]. In this work, the color constancy loss $\\mathcal{L}_{c o l}$ is based on the Gray-World   \n227 hypothesis as in [6, 15], and the formulation is given by, ", "page_idx": 5}, {"type": "text", "text": "", "page_idx": 5}, {"type": "equation", "text": "$$\n\\mathcal{L}_{c o l}=\\left(R-B\\right)^{2}+\\left(R-G\\right)^{2}+(G-B)^{2},\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "228 where $R,G$ , and $B$ are the mean pixel values of the red, green, and blue channels in the predicted   \n229 image $I_{T}$ , respectively. We minimize the color constancy loss $\\mathcal{L}_{c o l}$ to correct the potential color   \n230 deviations in the enhanced image.   \n231 Parameter Regularization Loss To prevent rapid changes of pixel values in nearby regions, we   \n232 employ the spatial regularization to enforce smoothness among neighboring curve parameter values   \n233 in $\\boldsymbol{A}_{t}$ , and the formulation is given by, ", "page_idx": 5}, {"type": "text", "text": "", "page_idx": 5}, {"type": "equation", "text": "$$\n\\mathcal{L}_{p a r a m}=(|\\bar{\\nabla_{x}}A_{0}|+|\\bar{\\nabla_{y}}A_{0}|)^{2}+\\ldots+(|\\nabla_{x}A_{T-1}|+|\\nabla_{y}A_{T-1}|)^{2},\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "234 where the linear operations $\\nabla_{x}$ and $\\nabla_{y}$ compute the horizontal and vertical gradients from the   \n235 parameter map $\\boldsymbol{A}_{t}$ , respectively. For better understanding, we represent $T-1$ as the stage before the   \n236 final enhancement. We employ the parameter regularization loss at each update step (e.g., red points   \n237 in Fig. 2 (a)) and accumulate the loss while solving the NODE problem.   \n238 Noise Removal Loss To estimate a spatially smooth $A_{t}$ regardless of the noise in the image $I_{t}$ , we   \n239 use the Noise Removal module $(g)$ to remove the noise. To train the Noise Removal module, we   \n240 utilize a self-supervision-based loss $\\mathcal{L}_{n o i s e}$ that follows the Noise2Noise approaches [31, 32, 33].   \n241 Specifically, we employ the loss introduced in Zeroshot-N2N [33]. Our $\\mathcal{L}_{n o i s e}$ has two components   \n242 at state $t$ : the residual loss $\\mathcal{L}_{r e s}^{t}$ and the consistency loss $\\mathcal{L}_{c o n s}^{t}$ . We minimize these losses using two   \n243 different down-samplers; $D_{1}$ and $D_{2}$ . Notably, $D_{1}$ and $D_{2}$ represent fixed 2D convolutional kernels:   \n244 $\\left[0.5\\begin{array}{c c}{{0}}&{{0}}\\\\ {{0}}&{{0.5}}\\end{array}\\right]\\mathrm{{and}~}\\left[\\begin{array}{c c}{{\\dot{0}}}&{{0.5}}\\\\ {{0.5}}&{{0}}\\end{array}\\right]$ , respectively. Notably, these kernels are used for downsampling through   \n245 convolutions with a stride of two. First, our $\\mathcal{L}_{r e s}^{t}$ fits the noise within $I_{t}$ through a symmetric loss   \n246 function similar to the approach in [34] and it yields: ", "page_idx": 5}, {"type": "text", "text": "", "page_idx": 5}, {"type": "equation", "text": "$$\n\\mathcal{L}_{r e s}^{t}=\\frac{1}{2}(||D_{1}(I_{t})-g(D_{1}(I_{t}))-D_{2}(I_{t})||_{2}^{2}+||D_{2}(I_{t})-g(D_{2}(I_{t}))-D_{1}(I_{t})||_{2}^{2}).\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "247 Next, as in [33], $\\mathcal{L}_{c o n s}^{t}$ ensures spatial consistency by maintaining similarity in noise distributions,   \n248 even if the order of denoising and downsampling is altered. Specifically, $\\mathcal{L}_{c o n s}^{t}$ also adopts a   \n249 symmetric loss and is defined as at each update step (e.g., red points in Fig. 2 (a)): ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\operatorname{\\hat{\\mathbf{\\xi}}}_{c o n s}^{t}=\\frac{1}{2}(||D_{1}(I_{t})-g(D_{1}(I_{t}))-D_{1}(I_{t}-g(I_{t}))||_{2}^{2}+||D_{2}(I_{t})-g(D_{2}(I_{t}))-D_{2}(I_{t}-g(I_{t}))||_{2}^{2}).\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "250 Therefore, our final noise removal loss $\\mathcal{L}_{n o i s e}$ can be represented accumulating during the update   \n251 procedure as: ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\mathcal{L}_{n o i s e}=(\\mathcal{L}_{r e s}^{0}+\\mathcal{L}_{c o n s}^{0})+\\ldots+(\\mathcal{L}_{r e s}^{T-1}+\\mathcal{L}_{c o n s}^{T-1}).}\\end{array}\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "252 As with Eq. 13, we represent $T-1$ as the stage before the final enhancement. A more detailed   \n253 description of the noise removal loss is provided in Appendix A.4. ", "page_idx": 6}, {"type": "text", "text": "254 Final Objective Function The final objective function to optimize is given as follows: ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\mathcal{L}_{t o t a l}=w_{s p a}\\cdot\\mathcal{L}_{s p a}+w_{e x p}\\cdot\\mathcal{L}_{e x p}+w_{c o l}\\cdot\\mathcal{L}_{c o l}+w_{p a r a m}\\cdot\\mathcal{L}_{p a r a m}+w_{n o i s e}\\cdot\\mathcal{L}_{n o i s e},\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "255 where $w_{s p a}$ , $w_{e x p}$ , $w_{c o l}$ , $w_{p a r a m}$ , and $w_{n o i s e}$ are hyper-parameters used to control the relative   \n256 significance of each associated loss during the training process. ", "page_idx": 6}, {"type": "text", "text": "257 4 Experiments ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "258 4.1 Implementation Details ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "259 Please refer to Appendix A.1 for more implementation details and training scheme. The code will be   \n260 available upon acceptance. ", "page_idx": 6}, {"type": "text", "text": "261 4.2 Experimental Setup ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "262 In this work, we use the LOL [5] and SICE [35] Part1 datasets for training. The results of low-light   \n263 image enhancement are evaluated on the LOL and LSRW [4] benchmark datasets. In addition,   \n264 the SICE [35] Part2 dataset is used as a benchmark dataset for evaluation under various exposure   \n265 conditions. SICE Part2 contains 229 image sequences with different exposure levels, and we use   \n266 the entire sequences as the evaluation dataset. By default, each comparison model uses its official   \n267 network weights. In cases where the official code is available but weights are not provided, the   \n268 models are retrained using the official code and settings, except for ReLLIE [9]. We present the   \n269 performance of ReLLIE on the LOL dataset as reported in their original manuscript. ", "page_idx": 6}, {"type": "text", "text": "270 4.3 Quantitative Comparisons ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "271 First, we quantitatively compare the performance of low-light image enhancement on different   \n272 datasets. Notably, in the experimental results, CLODE represents our proposed method without   \n273 requiring additional user input (by default), while $\\mathrm{CLODE\\dagger}$ represents the result of adjusting the final   \n274 state $T$ to the user’s preferred level, as introduced in Sec. 3.3.   \n275 In Table 1, we compare the low-light image enhancement performance on the LSRW [4] and LOL [5]   \n276 benchmark datasets in terms of peak signal-to-noise ratio (PSNR) and structural similarity (SSIM).   \n277 The term \"GT Mean\" refers to the evaluation method used by KinD [36] and LLFlow [1], which   \n278 matches the average value of the output pixels to that of the ground truth pixels. CLODE and CLODE†   \n279 outperform other unsupervised learning methods. Notably, $\\mathrm{CLODE}\\dagger$ even surpasses the PSNR of   \n280 state-of-the-art supervised learning methods by $0.73\\;\\mathrm{dB}$ , when averaging the results from the LSRW   \n281 and LOL datasets in the rightmost columns, without using GT Mean. Moreover, two notable points   \n282 can be highlighted in Table 1. First, the effectiveness of using NODE to compute accurate higher   \n283 order curves is evident, as demonstrated by its superiority over curve-adjustment-based methods;   \n284 ZeroDCE [6] and ReLLIE [9]. Second, unlike other models trained on the same training dataset   \n285 (LOL), our model shows robust performance on both the LSRW and LOL test datasets, indicating   \n286 that our model generalizes better than conventional approaches.   \n287 In Table 2, we demonstrate the robustness under various exposure conditions including both under  \n288 and over- exposures, and evaluate the performance on SICE Part2 [35]. The results show that CLODE   \n289 exhibits robust performance compared to other models, even under various exposure conditions. It   \n290 outperforms other unsupervised learning methods, and even when compared to supervised learning   \n291 methods, $\\mathrm{CLODE\\dagger}$ and CLODE achieve the best and second best results, respectively. Despite being   \n292 an unsupervised method, CLODE narrows the performance gap with state-of-the-art supervised   \n293 methods. Additionally, it operates robustly under challenging conditions such as various exposure   \n294 conditions in SICE Part2, surpassing supervised approaches. These strengths distinguish CLODE   \n295 from other unsupervised learning methods. ", "page_idx": 6}, {"type": "text", "text": "", "page_idx": 6}, {"type": "text", "text": "", "page_idx": 6}, {"type": "table", "img_path": "5p57uCUH8k/tmp/bf9f9314fd0d042f4db276fc00da8c545cf2937723ea1f03a97bf6f63d5492c5.jpg", "table_caption": ["Table 1: Quantitative results on LSRW [4] and LOL [5] datasets. For a fair comparison, we re-trained some models on LOL and marked them with \\*. Among the unsupervised approaches, the best score is displayed in red, the second best in blue, and the third best in black. For more comparison results in terms of non-reference metrics, please refer to Appendix A.4.3. "], "table_footnote": [], "page_idx": 7}, {"type": "table", "img_path": "5p57uCUH8k/tmp/f7fad96385e80da6dd57cd7b115cd68a697224ed333ef52b2e23bcdfacda7bc0.jpg", "table_caption": ["Table 2: Quantitative results on SICE [35] Part2. For a fair comparison, we re-trained some models on SICE Part 1 and marked them with \\*. Within the unsupervised approaches, the best score is displayed in red, the second in blue and the third in black. "], "table_footnote": [], "page_idx": 7}, {"type": "text", "text": "", "page_idx": 7}, {"type": "image", "img_path": "5p57uCUH8k/tmp/9afb8211ede252bbd34fa12c008ab8017fd638a539565bf526c45611990220b9.jpg", "img_caption": ["Figure 4: Visual comparisons. From top to bottom: LOL [5], under- and over-exposed image of the SICE [35] Part2. For more visual results, please refer to Fig. 10 in the Appendix. "], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "296 4.4 Perceptual and Visual Comparisons ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "297 In Table 2, we also provide a perceptual comparison of the results with other methods. The evaluation   \n298 is conducted on SICE Part2, which includes a combination of underexposed and overexposed images.   \n299 To measure the perceptual quality, we adopt Learned Perceptual Image Patch Similarity (LPIPS) [43],   \n300 and non-reference metrics; natural image quality evaluator (NIQE) [44], blind/referenceless image   \n301 spatial quality evaluator (BRISQUE) [45], perception index (PI) [46], and Entropy [47]. In these   \n302 four aspects, both CLODE and CLODE† show outstanding performance compared to existing   \n303 unsupervised methods. The visual results are compared in Fig. 4. CLODE shows robust and natural   \n304 image enhancement results compared to other comparison methods, regardless of the exposure   \n305 conditions of the input image. ", "page_idx": 7}, {"type": "table", "img_path": "5p57uCUH8k/tmp/4b99b8d0679f708f0b2909192be852403e27ae0622e495039fd88f80bc0bc967.jpg", "table_caption": ["Table 3: Comparative experiments according to using NODE on LSRW [4]/LOL [5].The \"Discrete\" refers to performing curve adjustment in discrete steps, similar to the conventional methods [6, 9], and \"Continuous\" refers to the reformulation of NODE. "], "table_footnote": [], "page_idx": 8}, {"type": "image", "img_path": "5p57uCUH8k/tmp/d9a27342cc2c055f5c4353b71e91353498c66548fd05fa9788b6329d78d7bad9.jpg", "img_caption": ["Figure 5: Trajectories of improvement for (e1) and (f1) in Table 3. PCA dimension reduction is used to visualize the trajectories. "], "img_footnote": [], "page_idx": 8}, {"type": "text", "text": "306 4.5 Ablation Study ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "307 Effectiveness of NODE To validate the impact of NODE, we adjust the curves using the architecture   \n308 of CLODE in both discrete (w/o NODE) and continuous (w/ NODE) spaces, and we compare the   \n309 results in Table 3. In the discrete setting, similar to [6], curve parameters for fixed update steps [1, 5,   \n310 10, 20, 30] are estimated in parallel ((a1) - (e1)). In the continuous setting, however, curve parameters   \n311 are estimated sequentially for non-fixed adaptive steps, up to a maximum of 30 steps ((f1)). Results   \n312 in Table 3 demonstrate that the curve parameters produced during the sequential continuous update   \n313 procedure are more accurate and verify superior performance of the proposed method over the update   \n314 procedure in the conventional discrete setting. In addition, in Fig. 5, we visualize the trajectories   \n315 of improvement by plotting PCA dimension reduction results of latent images during updates. We   \n316 observe that when curve adjustments are made in continuous space by (f1), the trajectories converge   \n317 more accurately at the final states compared to (e1). This demonstrates that using NODE to find the   \n318 optimal state certainly contributes to image enhancement.   \n319 Effect of the Modules In Table 4, we conduct ablation experiments on the modules used in   \n320 ODEfunc $f_{\\theta}$ . We verify the effects of the Noise Removal module $g$ and the layer normalization   \n321 (LN) in the Curve Parameter Estimation module $h$ . Each module shows performance improvements   \n322 compared to the baseline (a2). In particular, our final model (d2) achieves the largest performance   \n323 gain in terms of PSNR/SSIM. Furthermore, case (c2), which includes layer normalization, has about   \n324 a 4dB gain in PSNR compared to (a2), which does not include layer normalization. This shows   \n325 that during the image enhancement process in NODE, it is essential to use layer normalization to   \n326 normalize each state. The visual results can be seen in Fig. 8 of the Appendix. ", "page_idx": 8}, {"type": "table", "img_path": "5p57uCUH8k/tmp/36458401406df689afa46adec04f8bd2faae8b569550361c31642df88003cf42.jpg", "table_caption": ["Table 5: Execution time and performance. "], "table_footnote": [], "page_idx": 8}, {"type": "table", "img_path": "5p57uCUH8k/tmp/919024d7dbadef4ea9a6a96e5bad699800d5c43df1c5b725fd59575e96908fc0.jpg", "table_caption": ["Table 4: Impact of the modules in $f_{\\theta}$ . Noise Removal and the layer normalization (LN) significantly improve performance. "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "", "page_idx": 8}, {"type": "text", "text": "327 5 Limitations ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "328 Table 5 shows the performance of PSNR/SSIM, number of parameters, and execution time measured   \n329 in LSRW [4] using an NVIDIA RTX 4090. CLODE shows the advantage in model size compared to   \n330 supervised methods. The iterative ODE solving process of CLODE takes longer than lightweight   \n331 unsupervised models, but it exhibits faster speed and performance comparable to supervised meth  \n332 ods. Additionally, a smaller version, CLODE-S in Appendix A.1.2 shows promising enhancement   \n333 performance with competitive inference time comparable to those of unsupervised models. ", "page_idx": 8}, {"type": "text", "text": "334 6 Conclusions ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "335 In this work, we address the unsupervised low-light image enhancement problem by formulating   \n336 it as a NODE problem. We introduce a novel iterative curve-adjustment approach with NODE,   \n337 transforming discrete iterative problems into continuous ones. CLODE exhibits superior convergence   \n338 compared to other unsupervised iterative methods, especially in diverse low-light and multi-exposure   \n339 scenarios. In conclusion, our method effectively narrows the performance gap between unsupervised   \n340 and supervised methods across various datasets. ", "page_idx": 8}, {"type": "text", "text": "341 References ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "342 [1] Yufei Wang, Renjie Wan, Wenhan Yang, Haoliang Li, Lap-Pui Chau, and Alex Kot. Low-light   \n343 image enhancement with normalizing flow. In AAAI, volume 36, 2022.   \n344 [2] Yuanhao Cai, Hao Bian, Jing Lin, Haoqian Wang, Radu Timofte, and Yulun Zhang. Retinex  \n345 former: One-stage retinex-based transformer for low-light image enhancement. 2023.   \n346 [3] Jinhui Hou, Zhiyu Zhu, Junhui Hou, Hui Liu, Huanqiang Zeng, and Hui Yuan. Global structure  \n347 aware diffusion process for low-light image enhancement. NeurIPS, 2023.   \n348 [4] Jiang Hai, Zhu Xuan, Ren Yang, Yutong Hao, Fengzhu Zou, Fang Lin, and Songchen Han.   \n349 R2rnet: Low-light image enhancement via real-low to real-normal network. Journal of Visual   \n350 Communication and Image Representation, 90, 2023.   \n351 [5] Wenhan Yang Jiaying Liu Chen Wei, Wenjing Wang. Deep retinex decomposition for low-light   \n352 enhancement. In BMVC, 2018.   \n353 [6] Chunle Guo, Chongyi Li, Jichang Guo, Chen Change Loy, Junhui Hou, Sam Kwong, and   \n354 Runmin Cong. Zero-reference deep curve estimation for low-light image enhancement. In   \n355 CVPR, 2020.   \n356 [7] Lu Yuan and Jian Sun. Automatic exposure correction of consumer photographs. In ECCV.   \n357 Springer, 2012.   \n358 [8] Chongyi Li, Chunle Guo, and Chen Change Loy. Learning to enhance low-light image via   \n359 zero-reference deep curve estimation. IEEE Transactions on Pattern Analysis and Machine   \n360 Intelligence, 44, 2021.   \n361 [9] Rongkai Zhang, Lanqing Guo, Siyu Huang, and Bihan Wen. Rellie: Deep reinforcement   \n362 learning for customized low-light image enhancement. In ACMMM, 2021.   \n363 [10] Risheng Liu, Long Ma, Jiaao Zhang, Xin Fan, and Zhongxuan Luo. Retinex-inspired unrolling   \n364 with cooperative prior architecture search for low-light image enhancement. In CVPR, 2021.   \n365 [11] Long Ma, Tengyu Ma, Risheng Liu, Xin Fan, and Zhongxuan Luo. Toward fast, flexible, and   \n366 robust low-light image enhancement. In CVPR, 2022.   \n367 [12] Zunjin Zhao, Bangshu Xiong, Lei Wang, Qiaofeng Ou, Lei Yu, and Fa Kuang. Retinexdip: A   \n368 unified deep framework for low-light image enhancement. IEEE Transactions on Circuits and   \n369 Systems for Video Technology, 32, 2021.   \n370 [13] Zhenqi Fu, Yan Yang, Xiaotong Tu, Yue Huang, Xinghao Ding, and Kai-Kuang Ma. Learning a   \n371 simple low-light image enhancer from paired low-light instances. In CVPR, 2023.   \n372 [14] Qiuping Jiang, Yudong Mao, Runmin Cong, Wenqi Ren, Chao Huang, and Feng Shao. Un  \n373 supervised decomposition and correction network for low-light image enhancement. IEEE   \n374 Transactions on Intelligent Transportation Systems, 23(10), 2022.   \n375 [15] Feng Zhang, Yuanjie Shao, Yishi Sun, Kai Zhu, Changxin Gao, and Nong Sang. Unsupervised   \n376 low-light image enhancement via histogram equalization prior. arXiv preprint arXiv:2112.01766,   \n377 2021.   \n378 [16] Yifan Jiang, Xinyu Gong, Ding Liu, Yu Cheng, Chen Fang, Xiaohui Shen, Jianchao Yang, Pan   \n379 Zhou, and Zhangyang Wang. Enlightengan: Deep light enhancement without paired supervision.   \n380 IEEE Transactions on image processing, 30, 2021.   \n381 [17] Yeying Jin, Wenhan Yang, and Robby T Tan. Unsupervised night image enhancement: When   \n382 layer decomposition meets light-effects suppression. In ECCV, 2022.   \n383 [18] Chongyi Li, Chunle Guo, Ruicheng Feng, Shangchen Zhou, and Chen Change Loy. Cudi: Curve   \n384 distillation for efficient and controllable exposure adjustment. arXiv preprint arXiv:2207.14273,   \n385 2022.   \n386 [19] Ricky TQ Chen, Yulia Rubanova, Jesse Bettencourt, and David K Duvenaud. Neural ordinary   \n387 differential equations. NeurIPS, 31, 2018.   \n388 [20] Emilien Dupont, Arnaud Doucet, and Yee Whye Teh. Augmented neural odes. NeuraIPS, 32,   \n389 2019.   \n390 [21] Yulia Rubanova, Ricky TQ Chen, and David K Duvenaud. Latent ordinary differential equations   \n391 for irregularly-sampled time series. NeuraIPS, 32, 2019.   \n392 [22] Yogesh Verma, Markus Heinonen, and Vikas Garg. Climode: Climate forecasting with physics  \n393 informed neural odes. In ICLR, 2023.   \n394 [23] Sunghyun Park, Kangyeol Kim, Junsoo Lee, Jaegul Choo, Joonseok Lee, Sookyung Kim, and   \n395 Edward Choi. Vid-ode: Continuous-time video generation with neural ordinary differential   \n396 equation. In AAAI, volume 35, 2021.   \n397 [24] Yifan Wu, Tom Z Jiahao, Jiancong Wang, Paul A Yushkevich, M Ani Hsieh, and James C Gee.   \n398 Nodeo: A neural ordinary differential equation based optimization framework for deformable   \n399 image registration. In CVPR, 2022.   \n400 [25] Boyan Jiang, Yinda Zhang, Xingkui Wei, Xiangyang Xue, and Yanwei Fu. Learning composi  \n401 tional representation for 4d captures with neural ode. In CVPR, 2021.   \n402 [26] Seobin Park and Tae Hyun Kim. Progressive image super-resolution via neural differential   \n403 equation. In ICASSP, 2022.   \n404 [27] Jiancheng Huang, Yifan Liu, and Shifeng Chen. Bootstrap diffusion model curve estimation for   \n405 high resolution low-light image enhancement. In PRICAI. Springer, 2023.   \n406 [28] Haoyuan Wang, Ke Xu, and Rynson WH Lau. Local color distributions prior for image   \n407 enhancement. In ECCV. Springer, 2022.   \n408 [29] Jimmy Lei Ba, Jamie Ryan Kiros, and Geoffrey E Hinton. Layer normalization. arXiv preprint   \n409 arXiv:1607.06450, 2016.   \n410 [30] Gershon Buchsbaum. A spatial processor model for object colour perception. Journal of the   \n411 Franklin institute, 310, 1980.   \n412 [31] Jaakko Lehtinen, Jacob Munkberg, Jon Hasselgren, Samuli Laine, Tero Karras, Miika Aittala,   \n413 and Timo Aila. Noise2Noise: Learning image restoration without clean data. In ICML, 2018.   \n414 [32] Tao Huang, Songjiang Li, Xu Jia, Huchuan Lu, and Jianzhuang Liu. Neighbor2neighbor:   \n415 Self-supervised denoising from single noisy images. In CVPR, 2021.   \n416 [33] Youssef Mansour and Reinhard Heckel. Zero-shot noise2noise: Efficient image denoising   \n417 without any data. In CVPR, 2023.   \n418 [34] Xinlei Chen and Kaiming He. Exploring simple siamese representation learning. In CVPR,   \n419 2021.   \n420 [35] Jianrui Cai, Shuhang Gu, and Lei Zhang. Learning a deep single image contrast enhancer from   \n421 multi-exposure images. IEEE Transactions on Image Processing, 27, 2018.   \n422 [36] Yonghua Zhang, Jiawan Zhang, and Xiaojie Guo. Kindling the darkness: A practical low-light   \n423 image enhancer. In ACMMM, 2019.   \n424 [37] Wenhui Wu, Jian Weng, Pingping Zhang, Xu Wang, Wenhan Yang, and Jianmin Jiang. Uretinex  \n425 net: Retinex-based deep unfolding network for low-light image enhancement. In CVPR, 2022.   \n426 [38] Wenhan Yang, Shiqi Wang, Yuming Fang, Yue Wang, and Jiaying Liu. Band representation  \n427 based semi-supervised low-light image enhancement: Bridging the gap between signal fidelity   \n428 and perceptual quality. IEEE Transactions on image processing, 2021.   \n429 [39] Vladimir Bychkovsky, Sylvain Paris, Eric Chan, and Frédo Durand. Learning photographic   \n430 global tonal adjustment with a database of input / output image pairs. In CVPR, 2011.   \n431 [40] Wenhan Yang, Ye Yuan, Wenqi Ren, Jiaying Liu, Walter J Scheirer, Zhangyang Wang, Taiheng   \n432 Zhang, Qiaoyong Zhong, Di Xie, Shiliang Pu, et al. Advancing image understanding in poor   \n433 visibility environments: A collective benchmark study. IEEE Transactions on image processing,   \n434 29, 2020.   \n435 [41] Jie Huang, Man Zhou, Yajing Liu, Mingde Yao, Feng Zhao, and Zhiwei Xiong. Exposure  \n436 consistency representation learning for exposure correction. In ACMMM, 2022.   \n437 [42] Jie Huang, Yajing Liu, Feng Zhao, Keyu Yan, Jinghao Zhang, Yukun Huang, Man Zhou,   \n438 and Zhiwei Xiong. Deep fourier-based exposure correction network with spatial-frequency   \n439 interaction. In ECCV, 2022.   \n440 [43] Richard Zhang, Phillip Isola, Alexei A Efros, Eli Shechtman, and Oliver Wang. The unrea  \n441 sonable effectiveness of deep features as a perceptual metric. In Proceedings of the IEEE   \n442 conference on computer vision and pattern recognition, pages 586–595, 2018.   \n443 [44] Anish Mittal, Rajiv Soundararajan, and Alan C Bovik. Making a “completely blind” image   \n444 quality analyzer. IEEE Signal processing letters, 20, 2012.   \n445 [45] Anish Mittal, Anush Krishna Moorthy, and Alan Conrad Bovik. No-reference image quality   \n446 assessment in the spatial domain. IEEE Transactions on image processing, 21, 2012.   \n447 [46] Yochai Blau, Roey Mechrez, Radu Timofte, Tomer Michaeli, and Lihi Zelnik-Manor. The 2018   \n448 pirm challenge on perceptual image super-resolution. In ECCVW, 2018.   \n449 [47] Xiaoqiao Chen, Qingyi Zhang, Manhui Lin, Guangyi Yang, and Chu He. No-reference color   \n450 image quality assessment: From entropy to perceptual quality. EURASIP Journal on Image and   \n451 Video Processing, 2019.   \n452 [48] Ricky T. Q. Chen. torchdiffeq, 2018.   \n453 [49] Mahmoud Afif,i Konstantinos G Derpanis, Bjorn Ommer, and Michael S Brown. Learning   \n454 multi-scale photo exposure correction. In CVPR, 2021. ", "page_idx": 9}, {"type": "text", "text": "", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "456 A.1 Implement Details ", "text_level": 1, "page_idx": 12}, {"type": "text", "text": "457 The training set of images is resized to $128\\mathrm{x}128$ , we employ the Pytorch framework on NVIDIA   \n458 A6000 GPU with a batch size of 8. The ADAM optimizer is used with default parameters and a fixed   \n459 learning rate of $1e^{-5}$ to optimize the parameters of our network. The weights for the loss function   \n460 $w_{c o l}$ , wparam, $w_{s p a}$ , $w_{e x p}$ and $w_{n o i s e}$ are set to 20, 200, 1, 10 and 1 respectively, to balance the scale   \n461 of losses. Furthermore, we adopt torchdiffeq [48] for Neural ODEs implementation. The training   \n462 process is conducted for 100 epochs. ", "page_idx": 12}, {"type": "text", "text": "463 A.1.1 Implementation details of NODE ", "text_level": 1, "page_idx": 12}, {"type": "text", "text": "464 We utilize the adaptive ODE solver, dopri5 (Dormand-Prince Runge-Kutta of Order 5) for our work.   \n465 The maximum allowed step for the adaptive solver is set to 30. The relative and absolute tolerances   \n466 for the error rate calculation are set uniformly to $1e^{-5}$ . The adaptive solver uses the error rate to   \n467 determine the steps. Also, the adaptive solver estimates an error rate for the current step $t$ , and if   \n468 the error exceeds the allowable tolerances, the step is re-done with a smaller step size. This process   \n469 continues until the error becomes smaller than the provided tolerance. The error rate $\\Gamma_{t}$ at the $t$ -th   \n470 step is computed as follows: ", "page_idx": 12}, {"type": "equation", "text": "$$\n\\Gamma_{t}=a t o l\\times r t o l\\times n o r m(I_{t}),\n$$", "text_format": "latex", "page_idx": 12}, {"type": "text", "text": "471 where atol is absolute tolerance, and rtol is relative tolerate, and the norm being used is a mixed   \n472 L-infinity/RMS norm. We set both atol and rtol to 1e-5. ", "page_idx": 12}, {"type": "text", "text": "473 A.1.2 Details of the CLODE architecture ", "text_level": 1, "page_idx": 12}, {"type": "text", "text": "474 This section presents the architectural details of the CLODE network architecture, with a particular   \n475 focus on the ODEfunc module. The Noise Removal module $g$ employs a simple and lightweight   \n476 three-layer convolutional network. In Curve Parameter Estimation module $h$ , a shallow network   \n477 with two branches is utilized, wherein fliters of varying sizes are employed at each branch to capture   \n478 image features across different filter scales. We also provide architectural details of CLODE-S as   \n479 mentioned in Sec. 5 of the main manuscript. This version omits the Noise Removal module for speed   \nand uses a 2-layer network with 1x1 convolutions. ", "page_idx": 12}, {"type": "image", "img_path": "5p57uCUH8k/tmp/452104dd1532f5d83ede686e7aa29f4be6cf8f59588339e09e51cbce9dfc8ca3.jpg", "img_caption": [], "img_footnote": [], "page_idx": 12}, {"type": "text", "text": "Figure 6: Illustration of architecture details of (a) modules of ODEfunc in CLODE and (b) ODEfunc of CLODE-S. ", "page_idx": 12}, {"type": "text", "text": "480 ", "page_idx": 12}, {"type": "text", "text": "481 A.2 Impact of Each Loss Functions ", "text_level": 1, "page_idx": 12}, {"type": "text", "text": "482 CLODE combines five non-reference loss functions to train NODE, producing optimal improvements.   \n483 We present ablation experiments for each loss function, and the results are presented in Table 6 and   \n484 Fig. 7. The results of each image ablation experiment demonstrate that appropriate improvement   \n485 results can only be obtained when using CLODE with all loss functions. The characteristics of the   \n486 loss function as observed in each ablation are as follows: ((a3) w/o $\\mathcal{L}_{e x p.}$ ): Brightness improvement   \n487 is not achieved in low-exposure enhancement. ((b3) w/o $\\mathcal{L}_{c o l.}$ ): Severe color distortion occurs in   \n488 over-exposure enhancement, damaging structural details. ((c3) w/o $\\mathcal{L}_{p a r a m})$ : Structural distortion   \n489 occurs, creating artifacts. ((d3) w/o $\\mathcal{L}_{s p a}$ ): While showing better results than other experiments, it   \n490 occurs loss of structural details compared to (e3). ((e3) w/o $\\mathcal{L}_{N o i s e})$ : Compared to the proposed   \n491 version (f3), it produces improved results with noise present. ", "page_idx": 12}, {"type": "image", "img_path": "5p57uCUH8k/tmp/3c6658a8e617745221bca10aa4bd506a59b8bea9a723ef28ae60ab99f3796791.jpg", "img_caption": ["Figure 7: Visual results for the ablation study of each loss function. CLODE combines five nonreference loss functions in training for producing optimal enhancement results. "], "img_footnote": [], "page_idx": 13}, {"type": "table", "img_path": "5p57uCUH8k/tmp/7005da48259119a4886d5a8496c1d731ce4a82d8fa671eb469b299162ce8ef4c.jpg", "table_caption": ["Table 6: Ablation study on each non-reference losses. The experiment is evaluated on LOL [5]. "], "table_footnote": [], "page_idx": 13}, {"type": "text", "text": "", "page_idx": 13}, {"type": "text", "text": "492 A.3 Visualization of curve parameter map $\\boldsymbol{\\mathcal{A}}$ ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "493 We provide visual comparison results for the module ablation experiments in Sec. 4.5 of the main   \n494 manuscript. In the visual results without noise removal module (c2), we can observe the noise in   \n495 $\\boldsymbol{\\mathcal{A}}$ . The enhanced result of (c2) using $\\boldsymbol{\\mathcal{A}}$ with noise shows overall color discrepancy compared to   \n496 the ground-truth, in contrast to the enhanced result of (d2) where the noise removal module are   \n497 applied. The enhanced result of (d2) shows robust color similarity with the ground-truth image. We   \n498 can confirm that removing noise for $\\boldsymbol{\\mathcal{A}}$ is important for curve-adjustment-based method. ", "page_idx": 13}, {"type": "image", "img_path": "5p57uCUH8k/tmp/66e9f5cda54e892922b643284b490ffaefd7d84957069298dac56453a6c9ed17.jpg", "img_caption": ["Figure 8: A visual comparison of the results for (c2) and (d2) from Table 4 in the main manuscript. The enhanced result (d2) using $\\boldsymbol{\\mathcal{A}}$ with noise removal module demonstrates improvement more similar to the ground-truth. "], "img_footnote": [], "page_idx": 13}, {"type": "text", "text": "499 A.4 Background of Noise Removal Loss ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "500 In Sec.3.4 we provide information about the zero-reference loss functions that we used. Unlike the   \n501 others, the Noise Removal Loss $(\\mathcal{L}_{n o i s e})$ requires more explanation due to its unfamiliarity in the   \n502 field of low-light enhancement, so we provide additional explanation for it. ", "page_idx": 14}, {"type": "text", "text": "503 A.4.1 Noise2Noise background ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "504 In supervised denoising studies, neural networks are aimed at denoising the noisy image $\\mathbf{y}$ to the   \n505 clean image x. Since the noisy $\\mathbf{y}$ is an addition of the clean image $\\mathbf{X}$ and the noise e, the network is   \n506 trained to map the noise e which is called Noise2Clean (N2C) method. If the network parameter is   \n507 $\\phi_{N2C}$ , the object function of the supervised denoising method with the network $g_{\\phi}$ can be written as: ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\phi_{N2C}=\\underset{\\phi}{\\arg\\operatorname*{min}}\\,\\mathbb{E}\\Big[||g_{\\phi}(\\mathbf{y})-\\mathbf{x}||_{2}^{2}\\Big].\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "508 Denoising networks can also be trained to output the noisy image ${\\bf y}_{2}$ from the noisy input image ${\\bf y}_{1}$   \n509 that comes from the same clean image $\\mathbf{X}$ . This noise-to-noise manner can be achieved by assuming   \n510 that the noise has a mean of zero as introduced in Noise2Noise (N2N) [31]. This is the objective   \n511 function for the N2N network parameter $\\phi_{N2N}$ : ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\phi_{N2N}=\\underset{\\phi}{\\arg\\operatorname*{min}}\\,\\mathbb{E}\\bigl[||g_{\\phi}(\\mathbf{y}_{2})-\\mathbf{y}_{1}||_{2}^{2}\\bigr].\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "512 The N2N manner shows close performance compare to N2C manner with sufficient training data since   \n513 the objective functions of N2C and N2N are aimed on the same network parameter. If ${\\bf y}_{a}={\\bf x}+{\\bf e}_{a}$ ,   \n514 $\\mathbf{y}_{b}=\\mathbf{x}+\\mathbf{e}_{b}$ , and the mean value of ${\\bf e}_{a}$ and $\\mathbf{e}_{b}$ are zero, the proof is as follows: ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\partial\\mathcal{N}_{2}z=\\arg\\operatorname*{in}\\mathbb{E}\\left[\\|g_{\\phi}(\\mathbf{y}_{2})-\\mathbf{x}\\|_{2}^{2}\\right]}\\\\ &{\\qquad=\\arg\\operatorname*{in}\\mathbb{E}\\left[\\|g_{\\phi}(\\mathbf{y}_{2})\\|_{2}^{2}-2\\mathbf{x}^{\\mathsf{T}}g_{\\phi}(\\mathbf{y}_{2})+\\|\\mathbf{x}\\|_{2}^{2}\\right]}\\\\ &{\\qquad=\\arg\\operatorname*{in}\\mathbb{E}\\left[\\|g_{\\phi}(\\mathbf{y}_{2})\\|_{2}^{2}-2\\mathbf{x}^{\\mathsf{T}}g_{\\phi}(\\mathbf{y}_{2})\\right]}\\\\ &{\\qquad\\phi=\\arg\\operatorname*{in}\\mathbb{E}\\left[\\|g_{\\phi}(\\mathbf{y}_{2})-\\mathbf{y}_{1}\\|_{2}^{2}\\right]}\\\\ &{\\partial\\mathcal{N}_{2}x=\\arg\\operatorname*{in}\\mathbb{E}\\left[\\|g_{\\phi}(\\mathbf{y}_{2})-\\mathbf{y}_{1}\\|_{2}^{2}\\right]}\\\\ &{\\qquad=\\arg\\operatorname*{in}\\mathbb{E}\\left[\\|g_{\\phi}(\\mathbf{y}_{2})-(\\mathbf{x}+\\mathbf{e}_{1})\\|_{2}^{2}\\right]}\\\\ &{\\qquad=\\arg\\operatorname*{in}\\mathbb{E}\\left[\\|g_{\\phi}(\\mathbf{y}_{2})\\|_{2}^{2}-2\\mathbf{x}^{\\mathsf{T}}g_{\\phi}(\\mathbf{y}_{2})-2\\mathbf{e}_{2}^{\\mathsf{T}}g_{\\phi}(\\mathbf{y}_{2})+\\|\\mathbf{x}+\\mathbf{e}_{1}\\|_{2}^{2}}\\\\ &{\\qquad=\\arg\\operatorname*{in}\\mathbb{E}\\left[\\|g_{\\phi}(\\mathbf{y}_{2})\\|_{2}^{2}-2\\mathbf{x}^{\\mathsf{T}}g_{\\phi}(\\mathbf{y}_{2})-2\\mathbf{e}_{2}^{\\mathsf{T}}g_{\\phi}(\\mathbf{y}_{2})\\right]}\\\\ &{\\qquad=\\arg\\operatorname*{in}\\mathbb{E}\\left[\\|g_{\\phi}(\\mathbf{y}_{2})\\|_{2}^{2}-2\\mathbf{x}^{\\mathsf{T}}g_{\\phi}(\\mathbf{y}_{2})\\right].}\\end{array}\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "515 By Eq. 21 we can confirm that the object of $\\phi_{N2C}$ and $\\phi_{N2N}$ is the identical one. ", "page_idx": 14}, {"type": "text", "text": "516 A.4.2 Zeroshot Noise2Noise method ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "517 In spite of N2N approaches, it is hard to obtain two different noisy images from the same clean   \n518 scene. To address this hurdle, the Neighbor2Neighbor [32] method is proposed. This allows a pair   \n519 of noisy images to be augmented from a single noisy image coming from the same clean image. In   \n520 Zeroshot-N2N [33], which is adopted in our proposed method, Neighbor2Neighbor is achieved by   \n521 using two different 2D convolutional kernels $D_{1}$ and $D_{2}$ ) on noisy images. If the noisy image is $\\mathbf{y}$ , a   \n522 pair of down-sampled images $\\mathbf{y}_{1},\\mathbf{y}_{2}$ can be represented as: ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\mathbf{y}_{1}=D_{1}(\\mathbf{y}),\\mathbf{y}_{2}=D_{2}(\\mathbf{y}).\n$$", "text_format": "latex", "page_idx": 14}, {"type": "text", "text": "523 For a noisy image $\\mathbf{y}$ with a size of $H\\times W\\times C$ , the size of ${\\bf y}_{1}$ and ${\\bf y}_{2}$ is ${\\frac{H}{2}}\\ \\times\\ {\\frac{W}{2}}\\ \\times\\ C$ . With   \n524 downsampled images ${\\bf y}_{1}$ and ${\\bf y}_{2}$ , the loss optimizes $g_{\\phi}$ to fit the noise as: ", "page_idx": 14}, {"type": "equation", "text": "$$\n\\underset{\\phi}{\\operatorname{arg\\,min}}\\,||g_{\\phi}(\\mathbf{y}_{1})-\\mathbf{y}_{2}||_{2}^{2}.\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "525 Zeroshot-N2N [33] emphasizes that residual learning, a symmetry loss, and an additional coherence  \n526 enhancing term are critical for good performance. Zeroshot-N2N proposes two different loss functions,   \n527 the residual loss $\\mathcal{L}_{r e s}$ and the consistency loss $\\mathcal{L}_{c o n s}$ . First, the residual loss optimizes the network   \n528 $g_{\\phi}$ to fit the noise instead of image. The loss then becomes as: ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\underset{\\phi}{\\operatorname{arg\\,min}}\\;||\\mathbf{y}_{1}-g_{\\phi}(\\mathbf{y}_{1})-\\mathbf{y}_{2}||_{2}^{2}.\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "529 To fit the noise in ${\\bf y}_{1}$ and ${\\bf y}_{2}$ both, a symmetric loss [34] is applied as: ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\mathcal{L}_{r e s}(\\phi)=\\frac{1}{2}\\big(||\\mathbf{y}_{1}-g_{\\phi}(\\mathbf{y}_{1})-\\mathbf{y}_{2}||_{2}^{2}+||\\mathbf{y}_{2}-g_{\\phi}(\\mathbf{y}_{2})-\\mathbf{y}_{1}||_{2}^{2}\\big).\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "530 Second, the method constrain consistency by making denoised output of the downsampled image and   \n531 downsampled result of the denoised image like: ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\underset{\\phi}{\\arg\\operatorname*{min}}\\,||\\mathbf{y}_{1}-g_{\\phi}(\\mathbf{y}_{1})-D_{1}(\\mathbf{y}_{1}-g_{\\phi}(\\mathbf{y}_{1}))||_{2}^{2}.\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "532 Same as Eq. 25, with the adoption of a symmetric manner, the consistency loss is represented as: ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\mathcal{L}_{c o n s}(\\phi)=\\frac{1}{2}\\big(||\\mathbf{y}_{1}-g_{\\phi}(\\mathbf{y}_{1})-D_{1}(\\mathbf{y}_{1}-g_{\\phi}(\\mathbf{y}_{1}))||_{2}^{2}+||\\mathbf{y}_{2}-g_{\\phi}(\\mathbf{y}_{2})-D_{2}(\\mathbf{y}_{2}-g_{\\phi}(\\mathbf{y}_{2}))||_{2}^{2}\\big).\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "533 The noise removal loss function $\\mathcal{L}_{n o i s e}$ in Zeroshot-N2N becomes the sum of Eq. 25 and Eq. 27,   \n534 expressed as: ", "page_idx": 15}, {"type": "equation", "text": "$$\n\\mathcal{L}_{n o i s e}=\\mathcal{L}_{r e s}+\\mathcal{L}_{c o n s}.\n$$", "text_format": "latex", "page_idx": 15}, {"type": "text", "text": "535 A.4.3 More Quantitative Results ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "536 We present the comparison results for non-reference metrics, which we did not include in Table 1.   \n537 Table 7 demonstrates that CLODE outperforms other unsupervised methods in terms of perceptual   \n538 quality. Notably, it demonstrates competitive results in terms of BRISQUE and PI, even when   \n539 compared to state-of-the-art supervised methods. ", "page_idx": 15}, {"type": "text", "text": "Table 7: Comparison results on LSRW [4] and LOL [5] in terms of NIQE [44], BRISQUE [45], PI [46] and Entropy [47]. Within the unsupervised approaches, the best score is displayed in Red. LLNODE performs better than all other methods, including supervised methods, in terms of PI (Perceptual Index). ", "page_idx": 15}, {"type": "table", "img_path": "5p57uCUH8k/tmp/274c47fd91e2e528654d4c11f89ba6c011282c718070900583bf68a66708a531.jpg", "table_caption": [], "table_footnote": [], "page_idx": 15}, {"type": "text", "text": "540 A.4.4 Comparison with other iterative methods ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "541 Fig. 9 shows the changes in performance over steps of each curve-adjustment-based method. Each   \n542 comparison method is retrained for 10 steps in the official code provided by the author. To fix the   \n543 number of steps in CLODE to 10, we replace CLODE’s ODE solver with the Euler method, and   \n544 referred to it as CLODE-Euler. The results show that even within the same number of steps, CLODE  \n545 Euler performs better than other curve adjustment-based methods. Furthermore, the proposed version,   \n546 CLODE, demonstrates higher performance compared to other methods in most iterative steps.   \n547 In case of ReLLIE [9], it exhibits a decline in performance after 7 steps, emphasizing the need   \n548 for careful selection of the number of iterative steps itself to achieve optimal result, this makes the   \n549 method impractical to use. ", "page_idx": 15}, {"type": "text", "text": "", "page_idx": 16}, {"type": "text", "text": "", "page_idx": 16}, {"type": "image", "img_path": "5p57uCUH8k/tmp/e6df7bc8090a3cb21ae8779619b05cad1659d9b7b0d5d1287f55aabdf6005fe1.jpg", "img_caption": [], "img_footnote": [], "page_idx": 16}, {"type": "text", "text": "Figure 9: Changes in PSNR (Peak Signal-to-Noise Ratio) over steps of CLODE, CLODE-Euler, ReLLIE [9], $\\mathrm{ZeroDCE+}$ [8], and ZeroDCE [6]. As CLODE employs a continuous adaptive step according to the input image, we represent the steps by scaling them from 0 to 1. CLODE demonstrates superior performance compared to other methods at almost every step. ", "page_idx": 16}, {"type": "text", "text": "550 A.5 More visual results ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "551 We show additional results for CLODE enhancement that we did not show in the main manuscript   \n552 due to lack of space. We present additional visual comparison results for PairLIE [13] and Night  \n553 Enhancement [17], which demonstrated the best quantitative performance among the unsupervised   \n554 methods in Table 1 of the main manuscript, except for our proposed method (CLODE), in Fig. 10.   \n555 CLODE shows the most robust enhancement results across various image exposure conditions.   \n556 Fig. 11, Fig. 12, Fig. 13 and Fig. 14 show the results for CLODE and $\\mathrm{CLODE}\\dagger$ on LOL [5] and   \n557 SICE [35] validation dataset. Additionally, Fig. 15 shows the visual results with different exposures   \n558 for photos extracted from MSEC [49] and the internet (Filckr: CC BY-NC 2.0). ", "page_idx": 16}, {"type": "text", "text": "", "page_idx": 16}, {"type": "image", "img_path": "5p57uCUH8k/tmp/d2cee0be19195ac26e7576b11ec749975e027245dd0a7da4f24fd524a6f656e4.jpg", "img_caption": ["Figure 10: Comparative visualization results with (a) PairLIE [13] and (b) night-enhancement [17] on LOL [5] and SICE [35]. Images are taken from LSRW [4] and SICE [35] Part2. "], "img_footnote": [], "page_idx": 16}, {"type": "image", "img_path": "5p57uCUH8k/tmp/f087cd5f00079518b20b1594e41f3153107122e4a5d04f3fd869bdc827f10965.jpg", "img_caption": ["Figure 11: Visualization results on LOL [5]. While CLODE demonstrates superior enhancement results, user control with $\\mathrm{CLODE}\\dagger$ produces images that more closely resemble the ground-truth image. "], "img_footnote": [], "page_idx": 17}, {"type": "image", "img_path": "5p57uCUH8k/tmp/cb89dc5386096edca45f91b4c350cb680e4a27c69cd5ccfe5b549e2e5bce2c18.jpg", "img_caption": ["Figure 12: Visualization results on LOL [5] and SICE [35]. While CLODE demonstrates superior enhancement results, user control with $\\mathrm{CLODE}\\dagger$ produces images that more closely resemble the ground-truth image. "], "img_footnote": [], "page_idx": 18}, {"type": "image", "img_path": "5p57uCUH8k/tmp/6c745257cb4dc0e2d39f7d0615843bf04cf2e4b29424efdaadfb3374dafe653f.jpg", "img_caption": ["Figure 13: Visualization results on SICE [35]. While CLODE demonstrates superior enhancement results, user control with $\\mathrm{CLODE}\\dagger$ produces images that more closely resemble the ground-truth image. "], "img_footnote": [], "page_idx": 19}, {"type": "image", "img_path": "5p57uCUH8k/tmp/0eaa6d53488a9f61f9332c8afc466247cbc684fba956786a7a7de7bdfd84f984.jpg", "img_caption": ["Figure 14: Visualization results on SICE [35]. While CLODE demonstrates superior enhancement results, user control with $\\mathrm{CLODE}\\dagger$ produces images that more closely resemble the ground-truth image. "], "img_footnote": [], "page_idx": 20}, {"type": "image", "img_path": "5p57uCUH8k/tmp/ae05720cb746f3a7d31c2a75d821d6d15bf5c1330d71dbb032f9e2cb18a6d4e9.jpg", "img_caption": ["Figure 15: Visualization results on MSEC [49] and extracted from internet (Flickr by julochka). Even with diverse inputs of various exposures, CLODE show robust result in an unsupervised manner. "], "img_footnote": [], "page_idx": 21}, {"type": "text", "text": "559 NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "61 Question: Do the main claims made in the abstract and introduction accurately reflect the   \n62 paper’s contributions and scope? ", "page_idx": 22}, {"type": "text", "text": "Justification: We presented the contributions and effects of our method in the abstract and introduction, and demonstrated them through experiments. ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 22}, {"type": "text", "text": "576 2. Limitations ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? Answer: [Yes] ", "page_idx": 22}, {"type": "text", "text": "Justification: There is a \"Limitation\" section containing information about the execution speed of our method. ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 22}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 22}, {"type": "text", "text": "Justification: Our paper reports the theoretical approaches of the NODE reformulation process for curve adjustment equations. ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 23}, {"type": "text", "text": "625 4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "626 Question: Does the paper fully disclose all the information needed to reproduce the main ex  \n627 perimental results of the paper to the extent that it affects the main claims and/or conclusions   \n628 of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: Our paper includes main experimental results as well as ablation experiment results. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 23}, {"type": "text", "text": "664 5. Open access to data and code ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "665 Question: Does the paper provide open access to the data and code, with sufficient instruc  \n666 tions to faithfully reproduce the main experimental results, as described in supplemental   \n667 material?   \n668 Answer: [Yes]   \n669 Justification: In our paper, we include the rationale behind NODE reformulation along   \n670 with the workflow, and provide the network architecture in the appendix. This ensures   \n671 reproducibility, and we will also provide the code upon acceptance.   \n672 Guidelines:   \n673 • The answer NA means that paper does not include experiments requiring code.   \n674 • Please see the NeurIPS code and data submission guidelines (https://nips.cc/   \n675 public/guides/CodeSubmissionPolicy) for more details.   \n676 • While we encourage the release of code and data, we understand that this might not be   \n677 possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not   \n678 including code, unless this is central to the contribution (e.g., for a new open-source   \n679 benchmark).   \n680 • The instructions should contain the exact command and environment needed to run to   \n681 reproduce the results. See the NeurIPS code and data submission guidelines (https:   \n682 //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n683 • The authors should provide instructions on data access and preparation, including how   \n684 to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n685 • The authors should provide scripts to reproduce all experimental results for the new   \n686 proposed method and baselines. If only a subset of experiments are reproducible, they   \n687 should state which ones are omitted from the script and why.   \n688 • At submission time, to preserve anonymity, the authors should release anonymized   \n689 versions (if applicable).   \n690 • Providing as much information as possible in supplemental material (appended to the   \n691 paper) is recommended, but including URLs to data and code is permitted.   \n692 6. Experimental Setting/Details   \n693 Question: Does the paper specify all the training and test details (e.g., data splits, hyper  \n694 parameters, how they were chosen, type of optimizer, etc.) necessary to understand the   \n695 results?   \n696 Answer: [Yes]   \n697 Justification: We included details about the dataset used for training in the main manuscript,   \n698 while other hyperparameters, weights, etc., are documented in the appendix.   \n699 Guidelines:   \n700 • The answer NA means that the paper does not include experiments.   \n701 • The experimental setting should be presented in the core of the paper to a level of detail   \n702 that is necessary to appreciate the results and make sense of them.   \n703 • The full details can be provided either with the code, in appendix, or as supplemental   \n704 material.   \n705 7. Experiment Statistical Significance   \n706 Question: Does the paper report error bars suitably and correctly defined or other appropriate   \n707 information about the statistical significance of the experiments?   \n708 Answer: [Yes]   \n709 Justification: We provide detailed information on low-light performance validation, the   \n710 impact of main contributions, and performance validation through ablation studies.   \n711 Guidelines:   \n712 • The answer NA means that the paper does not include experiments.   \n713 • The authors should answer \"Yes\" if the results are accompanied by error bars, confi  \n714 dence intervals, or statistical significance tests, at least for the experiments that support   \n715 the main claims of the paper.   \n16 • The factors of variability that the error bars are capturing should be clearly stated (for   \n17 example, train/test split, initialization, random drawing of some parameter, or overall   \n18 run with given experimental conditions).   \n19 • The method for calculating the error bars should be explained (closed form formula,   \n20 call to a library function, bootstrap, etc.)   \n21 • The assumptions made should be given (e.g., Normally distributed errors).   \n22 • It should be clear whether the error bar is the standard deviation or the standard error   \n23 of the mean.   \n24 • It is OK to report 1-sigma error bars, but one should state it. The authors should   \n25 preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis   \n26 of Normality of errors is not verified.   \n27 • For asymmetric distributions, the authors should be careful not to show in tables or   \n28 figures symmetric error bars that would yield results that are out of range (e.g. negative   \n29 error rates).   \n30 • If error bars are reported in tables or plots, The authors should explain in the text how   \n31 they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 24}, {"type": "text", "text": "", "page_idx": 25}, {"type": "text", "text": "732 8. Experiments Compute Resources ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "733 Question: For each experiment, does the paper provide sufficient information on the com  \n734 puter resources (type of compute workers, memory, time of execution) needed to reproduce   \n735 the experiments?   \n36 Answer: [Yes]   \n737 Justification: We provide information about the GPU resources used and the execution time.   \n38 Guidelines: ", "page_idx": 25}, {"type": "text", "text": "", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 25}, {"type": "text", "text": "747 9. Code Of Ethics ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "748 Question: Does the research conducted in the paper conform, in every respect, with the   \n749 NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines?   \n750 Answer: [Yes]   \n751 Justification: We have reviewed the ethical guidelines (Code of Ethics) and ensured compli  \n752 ance.   \n753 Guidelines:   \n754 • The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n755 • If the authors answer No, they should explain the special circumstances that require a   \n756 deviation from the Code of Ethics.   \n757 • The authors should make sure to preserve anonymity (e.g., if there is a special consid  \n758 eration due to laws or regulations in their jurisdiction). ", "page_idx": 25}, {"type": "text", "text": "", "page_idx": 25}, {"type": "text", "text": "", "page_idx": 25}, {"type": "text", "text": "759 10. Broader Impacts ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "766 • If the authors answer NA or No, they should explain why their work has no societal   \n767 impact or why the paper does not address societal impact.   \n768 • Examples of negative societal impacts include potential malicious or unintended uses   \n769 (e.g., disinformation, generating fake profiles, surveillance), fairness considerations   \n770 (e.g., deployment of technologies that could make decisions that unfairly impact specific   \n771 groups), privacy considerations, and security considerations.   \n772 • The conference expects that many papers will be foundational research and not tied   \n773 to particular applications, let alone deployments. However, if there is a direct path to   \n774 any negative applications, the authors should point it out. For example, it is legitimate   \n775 to point out that an improvement in the quality of generative models could be used to   \n776 generate deepfakes for disinformation. On the other hand, it is not needed to point out   \n777 that a generic algorithm for optimizing neural networks could enable people to train   \n778 models that generate Deepfakes faster.   \n779 • The authors should consider possible harms that could arise when the technology is   \n780 being used as intended and functioning correctly, harms that could arise when the   \n781 technology is being used as intended but gives incorrect results, and harms following   \n782 from (intentional or unintentional) misuse of the technology.   \n783 • If there are negative societal impacts, the authors could also discuss possible mitigation   \n784 strategies (e.g., gated release of models, providing defenses in addition to attacks,   \n785 mechanisms for monitoring misuse, mechanisms to monitor how a system learns from   \n786 feedback over time, improving the efficiency and accessibility of ML).   \n787 11. Safeguards   \n788 Question: Does the paper describe safeguards that have been put in place for responsible   \n789 release of data or models that have a high risk for misuse (e.g., pretrained language models,   \n790 image generators, or scraped datasets)?   \n791 Answer: [NA]   \n792 Justification: Our proposed model does not include a high risk for misuse.   \n793 Guidelines:   \n794 • The answer NA means that the paper poses no such risks.   \n795 • Released models that have a high risk for misuse or dual-use should be released with   \n796 necessary safeguards to allow for controlled use of the model, for example by requiring   \n797 that users adhere to usage guidelines or restrictions to access the model or implementing   \n798 safety filters.   \n799 • Datasets that have been scraped from the Internet could pose safety risks. The authors   \n800 should describe how they avoided releasing unsafe images.   \n801 • We recognize that providing effective safeguards is challenging, and many papers do   \n802 not require this, but we encourage authors to take this into account and make a best   \n803 faith effort.   \n804 12. Licenses for existing assets   \n805 Question: Are the creators or original owners of assets (e.g., code, data, models), used in   \n806 the paper, properly credited and are the license and terms of use explicitly mentioned and   \n807 properly respected?   \n808 Answer: [Yes]   \n809 Justification: We will accurately specify the original owner’s license and share the code   \n810 upon acceptance. Additionally, the source and the original owner’s name for the single   \n811 image used in the appendix have been indicated on the image.   \n812 Guidelines:   \n813 • The answer NA means that the paper does not use existing assets.   \n814 • The authors should cite the original paper that produced the code package or dataset.   \n815 • The authors should state which version of the asset is used and, if possible, include a   \n816 URL.   \n817 • The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n818 • For scraped data from a particular source (e.g., website), the copyright and terms of   \n819 service of that source should be provided.   \n820 • If assets are released, the license, copyright information, and terms of use in the   \n821 package should be provided. For popular datasets, paperswithcode.com/datasets   \n822 has curated licenses for some datasets. Their licensing guide can help determine the   \n823 license of a dataset.   \n824 • For existing datasets that are re-packaged, both the original license and the license of   \n825 the derived asset (if it has changed) should be provided.   \n826 • If this information is not available online, the authors are encouraged to reach out to   \n827 the asset’s creators.   \n828 13. New Assets   \n829 Question: Are new assets introduced in the paper well documented and is the documentation   \n830 provided alongside the assets?   \n831 Answer: [NA]   \n832 Justification: We do not introduce new assets in this paper.   \n833 Guidelines:   \n834 • The answer NA means that the paper does not release new assets.   \n835 • Researchers should communicate the details of the dataset/code/model as part of their   \n836 submissions via structured templates. This includes details about training, license,   \n837 limitations, etc.   \n838 • The paper should discuss whether and how consent was obtained from people whose   \n839 asset is used.   \n840 • At submission time, remember to anonymize your assets (if applicable). You can either   \n841 create an anonymized URL or include an anonymized zip file.   \n842 14. Crowdsourcing and Research with Human Subjects   \n843 Question: For crowdsourcing experiments and research with human subjects, does the paper   \n844 include the full text of instructions given to participants and screenshots, if applicable, as   \n845 well as details about compensation (if any)?   \n846 Answer: [NA]   \n847 Justification: Our paper does not involve crowdsourcing nor research with human subjects.   \n848 Guidelines:   \n849 • The answer NA means that the paper does not involve crowdsourcing nor research with   \n850 human subjects.   \n851 • Including this information in the supplemental material is fine, but if the main contribu  \n852 tion of the paper involves human subjects, then as much detail as possible should be   \n853 included in the main paper.   \n854 • According to the NeurIPS Code of Ethics, workers involved in data collection, curation,   \n855 or other labor should be paid at least the minimum wage in the country of the data   \n856 collector.   \n857 15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human   \n858 Subjects   \n859 Question: Does the paper describe potential risks incurred by study participants, whether   \n860 such risks were disclosed to the subjects, and whether Institutional Review Board (IRB)   \n861 approvals (or an equivalent approval/review based on the requirements of your country or   \n862 institution) were obtained?   \n863 Answer: [NA]   \n864 Justification: Our paper does not involve crowdsourcing nor research with human subjects.   \n865 Guidelines:   \n866 • The answer NA means that the paper does not involve crowdsourcing nor research with   \n867 human subjects. ", "page_idx": 26}, {"type": "text", "text": "", "page_idx": 27}, {"type": "text", "text": "• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 28}]