[{"figure_path": "AhlaBDHMQh/figures/figures_2_1.jpg", "caption": "Figure 1: Data generating process: shaded nodes denote observed variables. Empty nodes denote latent variables.", "description": "This figure shows a graphical representation of the generative model used in the paper. The model consists of three latent variables: Zx, Ztx, and Zt, representing the effects of covariates, the interaction between covariates and treatments, and the effects of treatments, respectively. These latent variables are combined through a deterministic function g to generate the observed gene expression outcome y. The figure highlights that x and t are observed variables while Zx, Ztx, and Zt are latent variables.", "section": "3.1 Generative Model"}, {"figure_path": "AhlaBDHMQh/figures/figures_5_1.jpg", "caption": "Figure 2: The illustration of FCR models. (a) is the component for p(zx | x), p(zt | t) and p(ztx | t, x) (b) is the component to estimate q(Zx | x, y), q(zt | t, y) and q(ztx | t, x, y). Note that 0 indicates t = 0 representing the control samples. (c) computational diagrams to estimate the Kullback-Leibler divergences, causal structure regularization and permutation discriminators.", "description": "This figure illustrates the architecture of the Factorized Causal Representation (FCR) model. Panel (a) shows the generative model, which consists of three components: Zx (covariate-specific), Zt (treatment-specific), and Ztx (interaction-specific).  Panel (b) depicts the inference network, used to approximate the posterior distributions of these three latent variables given the observed gene expression data. Panel (c) provides a schematic of the three regularizers used in the FCR model to ensure disentanglement and identifiability of the latent variables. These regularizers are based on Kullback-Leibler divergence, causal structure regularization, and permutation discrimination.", "section": "5.1 Model Specification and Variational Inference"}, {"figure_path": "AhlaBDHMQh/figures/figures_7_1.jpg", "caption": "Figure 3: Clustering results for the sciPlex dataset. Normalized Mutual Information (NMI) values for clustering based on: (a) covariates x; (b) combined covariates and treatments [x; t]; (c) treatments t.", "description": "This figure presents the results of a clustering analysis performed on the sciPlex dataset using three different sets of features: covariates (x), combined covariates and treatments (x; t), and treatments (t).  The performance of different methods (SVAE, CPA, VCI, factorVAE, betaVAE, iVAE, and SCVI) is compared using the Normalized Mutual Information (NMI) metric. Higher NMI values indicate better performance. The figure aims to show the effectiveness of the FCR method in disentangling the effects of covariates and treatments on cell responses.", "section": "6.1 Clustering Analysis on Covariates, Treatments, and Combined Features"}, {"figure_path": "AhlaBDHMQh/figures/figures_8_1.jpg", "caption": "Figure 4: Statistical Conditional Independence Testing Results (a) p-values for the conditional independence test of zx || t | x. The red dashed line indicates the 0.05 level. (b) p-values for the conditional independence test of zł || x | t. (c) p-values for the conditional independence tests ZxZtxx and zł Ztxt | t. (d) HSIC values for assessment of marginal independence of zx with x, t and random numbers (R); as well as zł with x, t and random numbers (R).", "description": "This figure presents statistical testing results to validate the disentanglement of latent representations learned by FCR and other baselines.  Panel (a) and (b) show p-values from conditional independence tests, assessing whether treatment and covariate representations are conditionally independent given covariates and treatments, respectively. Panel (c) shows similar tests evaluating conditional independence between interaction and treatment/covariate representations.  Finally, Panel (d) shows Hilbert-Schmidt Independence Criterion (HSIC) values to evaluate marginal independence between latent variables and covariates/treatments, using random variables as a control.  Lower p-values indicate a stronger dependence, while higher HSIC values indicate stronger association.  The results support that FCR successfully disentangles latent factors.", "section": "6.2 Statistical Conditional Independence Testing"}, {"figure_path": "AhlaBDHMQh/figures/figures_30_1.jpg", "caption": "Figure 5: The clustering results. (a) For the multiPlex-Tram dataset, the first column shows the NMI value for clustering on x, the second column shows the NMI value for clustering on xt, and the third column shows the NMI value for clustering on t.(b) For the multiPlex-5 dataset, the first column presents the NMI value for clustering on x, the second column shows the NMI value for clustering on xt, and the third column shows the NMI value for clustering on t. (c) For the multiPlex-9 dataset, the first column displays the NMI value for clustering on x, the second column shows the NMI value for clustering on xt, and the third column shows the NMI value for clustering on t.", "description": "This figure displays box plots of the Normalized Mutual Information (NMI) values for clustering experiments on three datasets: multiPlex-Tram, multiPlex-5, and multiPlex-9.  Each dataset is analyzed using three different feature sets: covariates (x), combined covariates and treatments (xt), and treatments (t).  The NMI values quantify how well the clustering results based on different latent representations align with the ground truth labels for covariates, treatments, or both. High NMI values indicate a good match between predicted clusters and true labels.", "section": "6.1 Clustering Analysis on Covariates, Treatments, and Combined Features"}, {"figure_path": "AhlaBDHMQh/figures/figures_31_1.jpg", "caption": "Figure 3: Clustering results for the sciPlex dataset. Normalized Mutual Information (NMI) values for clustering based on: (a) covariates x; (b) combined covariates and treatments [x; t]; (c) treatments t.", "description": "This figure displays the performance of different methods in clustering single-cell data based on covariates (cell information), treatments (drug dosages), and the combination of both.  The Normalized Mutual Information (NMI) score is used to measure the quality of the clustering, with higher scores indicating better agreement between the predicted clusters and true labels. The figure shows that FCR outperforms other methods across different clustering scenarios, suggesting its effectiveness in disentangling the effects of treatments and covariates in single-cell data.", "section": "6.1 Clustering Analysis on Covariates, Treatments, and Combined Features"}, {"figure_path": "AhlaBDHMQh/figures/figures_32_1.jpg", "caption": "Figure 9: (a) UMAP visualization of the sciPlex dataset. The first row distinguishes the data by cell type, while the second row distinguishes by treatment time, with brighter colors indicating longer treatment durations. (b) UMAP visualization of the multiPlex-tram dataset. The first row distinguishes by cell type, and the second row distinguishes by treatment time, with brighter colors representing longer treatment durations.", "description": "This figure displays the UMAP visualizations of two single-cell datasets. The sciPlex dataset shows clear separation of different cell types and treatment durations; the multiPlex-tram dataset also shows a clear separation of cell types and treatment durations, with brighter colors representing longer durations.  These visualizations demonstrate the ability of the FCR model to disentangle different factors in the single-cell data.", "section": "F.7 Visualization"}, {"figure_path": "AhlaBDHMQh/figures/figures_32_2.jpg", "caption": "Figure 3: Clustering results for the sciPlex dataset. Normalized Mutual Information (NMI) values for clustering based on: (a) covariates x; (b) combined covariates and treatments [x; t]; (c) treatments t.", "description": "This figure displays the performance of different methods in clustering single-cell data based on three different features: covariates only, covariates and treatments combined, and treatments only.  The Normalized Mutual Information (NMI) score is used to measure the quality of the clustering, with higher NMI values indicating better agreement between the clustering results and the true labels.  The figure shows that FCR (the proposed method) outperforms other methods in all three scenarios, demonstrating its ability to capture the complex relationships between covariates, treatments, and cellular responses.", "section": "6.1 Clustering Analysis on Covariates, Treatments, and Combined Features"}, {"figure_path": "AhlaBDHMQh/figures/figures_33_1.jpg", "caption": "Figure 9: (a) UMAP visualization of the sciPlex dataset. The first row distinguishes the data by cell type, while the second row distinguishes by treatment time, with brighter colors indicating longer treatment durations. (b) UMAP visualization of the multiPlex-tram dataset. The first row distinguishes by cell type, and the second row distinguishes by treatment time, with brighter colors representing longer treatment durations.", "description": "This figure displays the UMAP visualizations of the latent representations (Zx, Ztx, Zt) learned by the FCR model for two single-cell datasets: sciPlex and multiPlex-tram.  The sciPlex visualizations show clear separation of cell types in the top row and treatment time in the bottom row.  Similarly, the multiPlex-tram visualizations distinguish cell types and treatment times. Brighter colors represent longer treatment durations in both datasets. The visualizations demonstrate that the FCR model effectively disentangles the different factors influencing cellular responses.", "section": "F.7 Visualization"}, {"figure_path": "AhlaBDHMQh/figures/figures_33_2.jpg", "caption": "Figure 9: (a) UMAP visualization of the sciPlex dataset. The first row distinguishes the data by cell type, while the second row distinguishes by treatment time, with brighter colors indicating longer treatment durations. (b) UMAP visualization of the multiPlex-tram dataset. The first row distinguishes by cell type, and the second row distinguishes by treatment time, with brighter colors representing longer treatment durations.", "description": "This figure shows the UMAP visualizations of the latent representations (Zx, Ztx, Zt) learned by FCR from the sciPlex and multiPlex-tram datasets.  The visualizations reveal how well FCR disentangles the data based on cell type and treatment time. Brighter colors in the second rows indicate longer treatment durations.  These plots help to demonstrate the effectiveness of the FCR model in learning interpretable and disentangled representations of single-cell perturbation data.", "section": "F.7 Visualization"}]