[{"figure_path": "kWMVzIdCEn/tables/tables_6_1.jpg", "caption": "Table 1: Overall Results on ProteinGym. Models are categorized into two groups based on their reliance on MSA inputs. The types of input information and the number of trainable parameters are listed for each model. The best models within each category are highlighted in red.", "description": "This table presents the overall performance of various protein fitness prediction models on the ProteinGym benchmark.  Models are grouped by their use of Multiple Sequence Alignments (MSAs).  For each model, the table shows the Spearman correlation, AUC, MCC, NDCG, and Recall metrics.  The number of trainable parameters and the types of input data (sequence, structure, surface, MSA) used by each model are also listed. The best-performing models in each group are highlighted in red.", "section": "4.2 Benchmark Result"}, {"figure_path": "kWMVzIdCEn/tables/tables_14_1.jpg", "caption": "Table 2: Average Spearman and Std. Error of Difference to Best Score. The best performing model is S3F-MSA, highlighted in red. A Spearman is the difference between the baseline models and the S3F-MSA. We followed the ProteinGym benchmarks to compute the std. error of difference to best score. In this table, it is the bootstrapped std. error of the differences between the Spearman of each model and the Spearman of S3F-MSA.", "description": "This table presents the average Spearman's rank correlation coefficients and their standard errors for various models on a protein fitness prediction task.  It compares different models' performances against the best-performing model (S3F-MSA), showing the differences and statistical significance.", "section": "4.2 Benchmark Result"}, {"figure_path": "kWMVzIdCEn/tables/tables_15_1.jpg", "caption": "Table 2: Average Spearman and Std. Error of Difference to Best Score. The best performing model is S3F-MSA, highlighted in red. A Spearman is the difference between the baseline models and the S3F-MSA. We followed the ProteinGym benchmarks to compute the std. error of difference to best score. In this table, it is the bootstrapped std. error of the differences between the Spearman of each model and the Spearman of S3F-MSA.", "description": "This table presents the average Spearman correlation and standard error of the difference from the best-performing model (S3F-MSA) for various protein fitness prediction models.  It compares the performance of different models against the top-performing model to highlight relative performance differences.", "section": "4.2 Benchmark Result"}]