[{"figure_path": "v6W55lCkhN/tables/tables_6_1.jpg", "caption": "Table 1: Daywise MAPE comparison of our time-series transformer and other baseline methods.", "description": "This table compares the Mean Absolute Percentage Error (MAPE) of the proposed time-series transformer model against three other baseline methods (STCF [11], DACF [56], and CC [55]) for forecasting carbon intensity.  The comparison is done for one-day, two-day, and three-day ahead forecasts across three different geographical regions (CISO, DE, and PJM). Lower MAPE values indicate better forecasting accuracy.", "section": "4.1 Time-series Transformer for Carbon Forcasting"}, {"figure_path": "v6W55lCkhN/tables/tables_7_1.jpg", "caption": "Table 2: Search Results on CIFAR-10 using the NasNet search space. The two optimization objectives we are searching for are #params and accuracy.", "description": "This table presents the results of the CIFAR-10 image classification task using the NasNet search space, focusing on two optimization objectives: minimizing the number of parameters and maximizing accuracy. It compares CE-NAS against various state-of-the-art (SOTA) NAS methods categorized as vanilla and one-shot methods.  The results are presented in terms of test error, the number of parameters (in millions), the search and training costs (in GPU hours), the CO2 emissions (in lbs), and the type of NAS method used. CE-Net-P1 and CE-Net-P2 represent the results obtained by CE-NAS.", "section": "4.3 Open-Domain NAS Tasks"}, {"figure_path": "v6W55lCkhN/tables/tables_8_1.jpg", "caption": "Table 3: Search Results on ImageNet. The two optimization objectives we are searching for are TensorRT Latency with FP16 in NVIDIA V100 and accuracy.", "description": "This table presents the results of the ImageNet experiments, comparing the performance of CE-NAS against other state-of-the-art NAS algorithms.  The key metrics shown are top-1 error rate, TensorRT latency (using FP16 on an NVIDIA V100 GPU), the total search and training cost in GPU hours, the CO2 emissions in pounds, and the NAS method used (vanilla, one-shot, or hybrid). The table highlights that CE-NAS achieves state-of-the-art performance with comparable or lower carbon emissions.", "section": "4.3 Open-Domain NAS Tasks"}, {"figure_path": "v6W55lCkhN/tables/tables_17_1.jpg", "caption": "Table 4: Comparison of energy-efficient NAS evaluation methods. Eval. cost refers to the cost of obtaining the evaluation results. Init. cost describes additional dataset preparation and the time required for training the model (e.g., supernet or predictor). Accuracy measures the rank correlation between the evaluation method and the actual rank. Predictor-based methods require Extra data as a training set to construct the prediction model.", "description": "This table compares different energy-efficient neural architecture search (NAS) evaluation methods. It assesses their evaluation cost, initialization cost, accuracy, and whether they require extra data for training.  The methods include zero-shot proxy, one-shot, predictor, low-fidelity, and gradient proxy approaches.", "section": "A Background Knowledge"}, {"figure_path": "v6W55lCkhN/tables/tables_24_1.jpg", "caption": "Table 5: Search efficiency under carbon emission constraints in terms of Hypervolume. We use the transformer-based carbon predictor in sec. 3.5.2 to forecast the carbon trace and use the actual carbon trace as the baseline. We ran each method ten times and made the average.", "description": "This table compares the performance of different NAS methods (CE-NAS, Vanilla LaMOO, One-shot LaMOO, and Heuristic) in terms of hypervolume under various carbon emission constraints (5000g, 10000g, 30000g, 50000g).  It shows the average hypervolume achieved by each method under each constraint, comparing predictions made using a carbon intensity predictor with actual carbon traces from the dataset.  The goal is to evaluate the search efficiency of each NAS method under different carbon budgets.", "section": "4.2 NAS Benchmarks and Baselines"}, {"figure_path": "v6W55lCkhN/tables/tables_24_2.jpg", "caption": "Table 6: Search efficiency under carbon emission constraints in terms of Hypervolume. We use the continuous action space of the reinforcement learning method introduced in sec. 3.5.1. We ran each method ten times and made the average.", "description": "This table compares the performance of the CE-NAS framework using discrete and continuous action spaces under different carbon emission constraints.  The hypervolume, a metric reflecting the quality of the search results, is reported for each condition.  The results show a comparison of search efficiency when using different action spaces.", "section": "F Ablation Studies"}]