[{"type": "text", "text": "PowerPM: Foundation Model for Power Systems ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Shihao Tu∗ Zhejiang University shihao.tu@zju.edu.cn ", "page_idx": 0}, {"type": "text", "text": "Yupeng Zhang∗ Zhejiang University yuppzhang@zju.edu.cn ", "page_idx": 0}, {"type": "text", "text": "Jing Zhang Renmin University of China zhang-jing@ruc.edu.cn ", "page_idx": 0}, {"type": "text", "text": "Zhendong Fu Zhejiang University zhendongfu@zju.edu.cn ", "page_idx": 0}, {"type": "text", "text": "Yin Zhang Zhejiang University yinzh@zju.edu.cn ", "page_idx": 0}, {"type": "text", "text": "Yang Yang† Zhejiang University yangya@zju.edu.cn ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "The proliferation of abundant electricity time series (ETS) data presents numerous opportunities for various applications within power systems, including demand-side management, grid stability, and consumer behavior analysis. Deep learning models have advanced ETS modeling by effectively capturing sequence dependence. However, learning a generic representation of ETS data for various applications is challenging due to the inherently complex hierarchical structure of ETS data. Moreover, ETS data exhibits intricate temporal dependencies and is susceptible to the influence of exogenous variables. Furthermore, different instances exhibit diverse electricity consumption behavior. In this paper, we propose a foundation model PowerPM for ETS data, providing a large-scale, off-the-shelf model for power systems. PowerPM consists of a temporal encoder and a hierarchical encoder. The temporal encoder captures temporal dependencies within ETS data, taking into account exogenous variables. The hierarchical encoder models correlations between different levels of hierarchy. Furthermore, PowerPM leverages a novel self-supervised pre-training framework consisting of masked ETS modeling and dual-view contrastive learning. This framework enables PowerPM to capture temporal dependency within ETS windows and aware the discrepancy across ETS windows, providing two different perspectives to learn generic representation. Our experiments span five real-world scenario datasets, including both private and public data. Through pre-training on massive ETS data, PowerPM achieves SOTA performance on diverse downstream tasks within the private dataset. Notably, when transferred to public datasets, PowerPM retains its edge, showcasing its remarkable generalization ability across various tasks and domains. Moreover, ablation studies and few-shot experiments further substantiate the effectiveness of our model. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "The volume of Electricity Time Series (ETS) data has recently increased rapidly due to the emergence of advanced power systems known as smart grids [10]. This abundance of data has paved the way for diverse applications in power systems, including demand-side management [22], grid stability [2] and consumer behavior analysis [49], etc. Meanwhile, these applications have spawned various tasks, as shown in Fig. 1(d). These include load forecasting [27, 4], clock anomaly detection [46], electricity theft [15] and and the detection of elderly individuals living alone [45]. ", "page_idx": 0}, {"type": "image", "img_path": "JInTfcxH3Q/tmp/d04ae4408fc62a77fc4f3efca14f886f823d57c917ab46753b1a30a0741ce6ce.jpg", "img_caption": ["Figure 1: (a) The hierarchical structure of ETS data. (b) The temporal dependency within ETS data and the influence of exogenous variables. (c) Different electricity consumption behaviors exist across time and instances. (d) Various tasks in power systems. "], "img_footnote": [], "page_idx": 1}, {"type": "text", "text": "As society progresses towards modernization, electricity consumption is rapidly increasing, presenting opportunities and challenges for the development and application of smart grids. On one hand, the substantial economic benefits that accompany this significant electricity usage are considerable. On the other hand, unreasonable electricity planning can have a detrimental impact on the environment[30]. Therefore, given the large volume of data and the variety of tasks, there is an urgent need to study effective ETS data modeling methods for these tasks, so as to improve economic efficiency while adhering to low-carbon principles. ", "page_idx": 1}, {"type": "text", "text": "Recently, numerous research studies on pre-training approaches for ETS data have emerged. These approaches adopt the “pre-training then fine-tuning” paradigm to deal with the dilemma of limited annotation data, and the pre-trained model to easily adapt to new tasks, such as PatchTST [21], TS2Vec [42], CoST [37], etc. However, these pre-training methods only utilize small-scale of data with a small number of instances (e.g. users), resulting in poor performance on downstream tasks. As the same time, many researcher begin to apply Large Language Models (LLMs) to assist time series modeling by using pre-trained LLM to encode time series [51] or incorporating additional descriptions related to the time series [17, 20]. Nevertheless, these models have limited ability in the power system scenario due to insufficient pre-training data of power systems and the lack of sufficient domain-specific knowledge. Additionally, none of these models are tailored for the scenario of power systems, so they neglect the unique characteristics of ETS data. Consequently, there remains a significant research gap in existing power systems literature regarding the modeling of ETS data using a foundation model. ", "page_idx": 1}, {"type": "text", "text": "In our scenario, the ETS data contains numerous instances and naturally exhibits a complex hierarchy [41, 23]. As depicted in Fig. 1(a), a city ETS can be disaggregated into district ETS accroding to the administrative divisions, which can further be disaggregated into user ETS in this district. For the complex hierarchy of ETS data, modeling ETS data entails the consideration of several challenges: ", "page_idx": 1}, {"type": "text", "text": "(1) Hierarchical Dependency Modeling. The hierarchy of ETS data facilitates information interaction across different granularities. Fine-grained ETS provides detailed insights into individual electricity usage, while coarse-grained ETS for districts and cities captures broader factors and indicates overall trends. For example, user-level data reflects user-specific behaviors and city-level data encompasses demographics and policy effects [29, 35]. Integrating these levels of granularity to provide both macro and micro perspectives is a complex task that requires sophisticated modeling. ", "page_idx": 1}, {"type": "text", "text": "(2) Temporal Dependencies within ETS Window. An ETS window refers to a piece of electricity time series over a period of time. The temporal dependencies within an ETS window refer to the correlations and dependencies between observations at different timestamps. As shown in Fig. 1(b), the city-level ETS exhibits daily and weekly dependency. Moreover, the temporal dependencies are often influenced by exogenous variables, such as weather, temperature, and seasonal effects. Integrating these factors into the model is challenging because their impact may interact with the temporal dynamics in complex ways. Accurately capturing the temporal dependencies with the impact of exogenous variables is a key challenge in modeling ETS data. ", "page_idx": 1}, {"type": "text", "text": "(3) Discrepancy across ETS Windows. The patterns observed in ETS windows can vary significantly across different instances and different timestamps. For instance, as shown in Fig. 1(c), residential electricity consumption (User A) reaches its peak in the mornings and evenings, used for lighting, appliances, and heating. However, electricity usage typically declines during the day because residents are generally absent, being engaged in work or education activities outside the home. Moreover, industries (User B) have high power demand during specific daytime periods for machinery and production lines, with lower load requirements during nighttime and weekends. These variations in behavior highlight the challenge of achieving consistency across ETS windows in personalized modeling. ", "page_idx": 1}, {"type": "image", "img_path": "JInTfcxH3Q/tmp/cbe1e1d457e8ffa47e145c0a7d19d1b2222cd9b148018b154e536ffb3b6f3661.jpg", "img_caption": ["Figure 2: Performance comparison of our model and other baseline models on all downstream tasks in our scenario. Model performances are plotted on 3 radar subfigures for clarity with the same coordinate range. "], "img_footnote": [], "page_idx": 2}, {"type": "text", "text": "", "page_idx": 2}, {"type": "text", "text": "To address these challenges, we propose a foundation model for power systems named Power Pretrained Model (PowerPM), as illustrated in Figure 3. PowerPM contains about 250M parameters and is pre-trained on large-scale hierarchical ETS data with 987.42GB. Specifically, we employ the “pretraining then fine-tuning” paradigm to learn generic representations by pre-training on hierarchical ETS data and to unify various tasks by fine-tuning on downstream data. During pre-training stage, we propose a novel self-supervised pre-training framework consisting of masked ETS modeling and dual-view contrastive learning, which enables PowerPM to capture temporal dependency within ETS windows and aware the discrepancy across ETS windows, so as to provide two different perspectives to learn universal representations. PowerPM mainly consists of two modules, namely, temporal encoder and hierarchical encoder. The temporal encoder employs Transformer encoders to capture the temporal dependency in ETS data, and incorporates exogenous variables to make the modeling process more robust. Moreover, to model hierarchical dependency, hierarchical encoder utilizes R-GCN [25] to propagate information about the correlation between hierarchy. According to the message that passes through the hierarchies, the micro and macro information can effectively assist in modeling the ETS data. In summary, the main contributions of our work include: ", "page_idx": 2}, {"type": "text", "text": "1. We propose a foundation model for power systems named PowerPM, which is pre-trained on large-scale ETS data and provide an off-the-shelf model for power systems.   \n2. To the best of our knowledge, PowerPM is the first to date that considers temporal dependency and hierarchical dependency simultaneously. In addition, we present a novel self-supervised pre-training framework that combines masked ETS modeling and dual-view contrastive learning, enhancing the model’s ability to learn temporal dependencies within ETS windows and aware the discrepancy across ETS windows.   \n3. Extensive experiments show that PowerPM generalizes well to 44 downstream tasks. Fig. 2 summarizes the results of all the downstream tasks, showing its great potential in ETS data modeling. Moreover, when transferred to the public dataset, PowerPM maintains its superiority, showcasing its remarkable generalization ability across various tasks and domains. Further analysis illustrates the effectiveness of PowerPM as well. ", "page_idx": 2}, {"type": "text", "text": "2 Methodology ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Overview. As shown in the middle part of Fig. 3: Firstly, the hierarchical graph $\\mathcal{G}$ is constructed according to the naturally existing hierarchical relationship of ETS data. The ETS windows in $\\mathcal{G}$ and its corresponding exogenous variables are denoted as $\\{x_{i}\\}_{i=1}^{N}$ and $\\{o_{i}\\}_{i=1}^{N}$ , where $N$ is the number of instances, $\\pmb{x}_{i}\\in\\mathbb{R}^{T_{w}}$ , $o_{i}\\in\\mathbb{R}^{T_{w}\\times K}$ , and each instance ETS window spans $T_{w}$ time points starting at $T_{a}$ and ending at $T_{b}$ . Each time point has $K$ kinds of exogenous variables. Our objective is to perform pre-training on an encoder $f(\\cdot)$ to encode each window into a latent representation $\\mathbf{z}_{i}\\,\\in\\,\\mathbb{R}^{N\\times d}$ , where $d$ indicates the dimension of the latent representation. More specific, PowerPM consists of an exogenous variable enhanced temporal encoder $f_{T}(\\cdot)$ and a hierarchical encoder $f_{H}(\\cdot)$ , with the process: $\\begin{array}{r}{\\mathbf{z}_{i}=f(\\pmb{x}_{i},\\pmb{o}_{i},\\mathcal{G})=f_{H}(f_{T}(\\pmb{x}_{i},\\pmb{o}_{i}),\\mathcal{G})}\\end{array}$ . In addition, a novel self-supervised strategy which combines masked ETS modeling and dual-view contrastive learning is used for pre-training PowerPM. Next, we will detail the techniques in both model architecture and pre-training strategy. ", "page_idx": 2}, {"type": "image", "img_path": "JInTfcxH3Q/tmp/d7b0427f4990d7055b9391b62c7b19652a4cc79a958d98bc2da7a474770db5af.jpg", "img_caption": ["Figure 3: The pre-training framework of PowerPM. For simplicity, we take the windows of each instance in the same time range for illustration, and the window process at other times is the same. "], "img_footnote": [], "page_idx": 3}, {"type": "text", "text": "", "page_idx": 3}, {"type": "text", "text": "2.1 Hierarchical Graph Construction ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "The data of cities, districts, and users in ETS data naturally form a hierarchical relationship, based on which we can construct a hierarchical graph. However, the imbalance in the number of users and districts means there will be multitude of edges between user nodes and district nodes, which significantly increases the complexity of graph modeling. To address this, we employ a clustering strategy to create intermediary nodes, which is a common approach to implement graph sparsification [13] and a user group policy in the power systems [36, 44, 12]. As depicted in Fig. 3 (c), we use clustering method to categorize users into several clusters, the detailed process can be found in App. B.1. The cities are bidirectionally connected to districts, and these user clusters are also bidirectionally connected to districts but are unidirectionally connected to districts. By sparsifying the edges, we enhance the efficiency of graph modeling. Mathematically, we represent the hierarchy as a directed graph $\\mathcal{G}=(\\mathcal{V},\\mathcal{E},\\mathcal{R})$ , where $\\nu$ is the set of nodes, each node corresponds to an instance, $\\mathcal{E}$ is the set of directed edges, and $\\mathcal{R}$ is the set of type of edges (e.g. user cluster $\\rightarrow$ district, district $\\rightarrow$ user, etc.). ", "page_idx": 3}, {"type": "text", "text": "2.2 Temporal Encoder with Exogenous Variables ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Patching. In the $\\mathcal{G}$ , each node’s feature $\\pmb{x}_{i}$ is a window of ETS data corresponding to instance $i$ . Due to the semantic sparsity of time series, we patch each window $\\pmb{x}_{i}$ into $N_{p}$ segments, each of length $P$ , resulting in $\\mathbf{p}_{i}\\in\\mathbb{R}^{N_{p}\\times P}$ , where $\\begin{array}{r}{N_{p}=\\lceil\\frac{T_{w}-P}{S}\\rceil+1}\\end{array}$ , and this method proved its validity in many works [21, 17, 20]. Subsequently, a linear projection is applied to each segment to obtain the window representation hi ∈RNp×d. ", "page_idx": 3}, {"type": "text", "text": "Exogenous Variables Encoding. To efficiently interact with exogenous variables, we model these variables using learnable embeddings $\\mathbf{E}\\in\\overset{\\cdot}{\\mathbb{R}}^{(\\sum_{k=0}^{K-1}M_{k})\\times d}$ , where $K$ indicates the number of exogenous variables (e.g. weather type and temperature), $M_{k}$ represents the number of value types of the $k$ -th exogenous variable (e.g. sunny and rainy in weather type variable). The exogenous variables $\\pmb{o}_{i}^{(k)}\\,\\in\\,\\mathbb{R}^{N_{p}\\times P}$ corresponding to $\\mathbf{p}_{i}$ of the $k$ -th exogenous variable are used to obtain representations of the exogenous variables from $\\mathbf{E}$ , indexing out ${\\bf e}_{i}^{(k)}\\,\\in\\,\\mathbb{R}^{N_{p}\\times d}$ , as illustrated in ", "page_idx": 3}, {"type": "text", "text": "Fig. 3 (b). Subsequently, we derive a representation $\\mathbf{u}_{i}\\ \\in\\ \\mathbb{R}^{N_{p}\\times d}$ that considers the window’s exogenous variable influence: $\\begin{array}{r}{\\mathbf{u}_{i}=\\mathbf{h}_{i}+\\bar{\\sum}_{k=0}^{K-1}\\,\\mathbf{e}_{i}^{(k)}}\\end{array}$ . ", "page_idx": 4}, {"type": "text", "text": "Temporal Encoder. To model the complex temporal dependency and interaction with exogenous variables, we use the vanilla Transformer encoder [34] to encode $\\mathbf{u}_{i}$ , resulting in an augmented temporal representation $\\hat{\\mathbf{z}}_{i}\\in\\mathbb{R}^{N_{p}\\times d}$ . ", "page_idx": 4}, {"type": "text", "text": "2.3 Hierarchical Encoder ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "To model the complex correlation across different hierarchies, we employ Graph Neural Networks (GNNs). GNNs have recently become increasingly popular for modeling relationships within time series data, which enhances temporal representation [7, 26, 40]. In addition, considering that the correlation relationships of different edges are distinct, we adopt R-GCN [25] to integrate information across various hierarchies and instances, as depicted in Fig 3 (a). Specifically, we use R-GCN to update the representation $\\hat{\\bf z}$ by considering its neighboring nodes in $\\mathcal{G}$ , with the final node representation denoted as $\\mathbf{z}_{i}\\in\\mathbb{R}^{N_{p}\\times\\dot{d}}$ . Moreover, we use $\\mathbf{z}_{i}$ to perform self-supervised pre-training. ", "page_idx": 4}, {"type": "text", "text": "2.4 Self-supervised Pre-training ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "2.4.1 Masked ETS Modeling ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "To model temporal dependency within an ETS window, we have adopted the widely utilized masked reconstruction strategy. Nevertheless, existing random masking methods may face a significant challenge: they reconstruct the missing part based on the known surrounding part [21, 8], without considering the prediction of future parts relying solely on the past part. This approach not only diminishes the difficulty of the pre-training stage but also lacks consistency across pre-training task and forecasting task. ", "page_idx": 4}, {"type": "text", "text": "To address this issue, we propose a novel masking approach that combines random and casual masking, as shown in Fig. 3 (d) (left). Specifically, we randomly select one of the masking approaches for a given patched window $\\mathbf{p}_{i}$ , resulting in masked $\\mathbf{p}_{i}$ . This approach not only retains the beneftis of the random masking strategy but also ensures that the model learns to predict future parts based solely on past information, thereby it can more comprehensively capture the temporal dependencies within $\\mathbf{p}_{i}\\,=\\,\\left\\{\\!\\!\\begin{array}{l l}{\\mathbf{Mask}_{r}(\\mathbf{p}_{i})}\\\\ {\\mathbf{Mask}_{c}(\\mathbf{p}_{i})}\\end{array}\\!\\!\\right.$ if $\\alpha<0.5$ a window. Mathematically, this can be formulated as: masked   \notherwise where $\\mathbf{Mask}_{r}$ and $\\mathbf{Mask}_{c}$ denote the random and causal masking, respectively, and $\\alpha\\in[0,1]$ is a uniformly distributed variable. Specifically, after the $\\pmb{x}_{i}$ is inputted into PowerPM for masked ETS modeling, we will obtain a reconstructed $\\hat{\\pmb{x}}_{i}$ . The corresponding reconstruction loss is: $\\mathcal{L}_{M S E}=$ $\\textstyle{\\frac{1}{N}}\\sum_{i=1}^{N}(\\pmb{x}_{i}-\\hat{\\pmb{x}_{i}})^{2}$ . ", "page_idx": 4}, {"type": "text", "text": "2.4.2 Dual-view Contrastive Learning ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "The objective of contrastive learning is to learn representations by bringing positive pairs closer and pushing negative pairs farther apart in the latent space [5, 6]. Motivated by this, to make PowerPM aware of the discrepancy across ETS windows, we employ dual-view contrastive learning (DVCL) to discern subtle differences in electricity usage behavior. ", "page_idx": 4}, {"type": "text", "text": "Positive and Negative Sample Pairs. These pairs are determined from two views: one is temporal view, which is based on the time difference between the two windows. Another is the instance view, which depends on whether two windows belong to the same instance. For the same instance, the closer the time difference between two windows, the closer their representations are likely to be. This idea is also presented in [31, 42]. Conversely, windows from different instances or the same instance with a larger time difference are likely to have more distinct representations. Overall, we consider adjacent windows from the same instance as positive samples, while windows from different instances or non-adjacent windows from the same instance are negative samples. As depicted in Fig. 3 (d) $(r i g h t)$ , for the district node $V$ in $\\mathcal{G}$ , the original start timestamp about this window is $T_{a}$ . After shifting several time steps $\\delta$ on, we obtain another window $V^{+}$ starting at $T_{a}+\\delta$ , which serves as a positive sample. Meanwhile, we select windows from other nodes in $\\mathcal{G}$ , such as city $P$ , starting at $T_{a}$ , as well as windows from the same node $V$ but starting at $T_{c}$ , where $|T_{c}-T_{a}|\\gg\\delta$ . These windows serve as instance and temporal negative samples, respectively, and are denoted as $P^{-}$ and $V^{-}$ . ", "page_idx": 4}, {"type": "text", "text": "Mathematically, given an ETS window $\\pmb{x}_{i}$ , we obtain a positive sample $\\pmb{x}_{i}^{+}$ by shifting it by $\\delta$ time steps. The other samples in this batch serve as negative samples, totaling $B\\,-\\,1$ negative samples, where $B$ is the batch size during pre-training. The DVCL loss is: $\\mathcal{L}_{D V C L}\\ =$ $\\begin{array}{r}{-\\sum_{i=1}^{N}\\log\\frac{\\exp\\left(\\sin\\left(f\\left(\\mathbf{x}_{i}\\right),f\\left(\\mathbf{x}_{i}^{+}\\right)\\right)/\\tau\\right)}{\\sum_{m=1}^{B}\\mathbf{I}\\cdot\\exp\\left(\\sin\\left(f\\left(\\mathbf{x}_{i}\\right),f\\left(\\mathbf{x}_{m}\\right)\\right)/\\tau\\right)}}\\end{array}$ and $\\dim(\\cdot)$ is cosine similarity function. , where I is the boolean vector to select the negative pairs ", "page_idx": 5}, {"type": "text", "text": "3 Experiments ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "3.1 Experiment Setup ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "Pre-training Dataset. PowerPM is pre-trained on a mount of ETS data, a private dataset from the real scenario1. This pre-training dataset encompasses ETS data of cities, districts, and users, covering over 3 years records. The ETS data is collected at a frequency of one data point every 15 minutes. More details are in App. A ", "page_idx": 5}, {"type": "text", "text": "Downstream Dataset. To evaluate the performance of PowerPM, we conduct comprehensive experiments on eleven downstream private and public datasets. And seven private datasets are also collected from real scenario. These datasets have different labels for different tasks. Among them, the solar generation dataset does not have a hierarchical structure due to its particularity. Four public datasets are obtained from CSISO 2, $\\mathrm{ISONE}^{3}$ , NYISO 4, and PJM 5, and they all exhibit a hierarchical structure. Further details can be found in Appendix A. ", "page_idx": 5}, {"type": "text", "text": "Settings. For the model configurations, the temporal encoder contains a 26-layer Transformer encoder with model dimension 1024, inner dimension (FFN) 2048 and 16 attention heads, and the hierarchical encoder contains 2-layer R-GCN. PowerPM contains about 250M parameters. During pre-training, the $40\\%$ segments in each input window are masked in the form of random mask and casual mask, the user cluster numbers is set to 12. See further details in App. B.1 ", "page_idx": 5}, {"type": "text", "text": "Baselines. We compare with 8 state-of-the-art methods: Large Language Model (LLM) enhanced models: GPT4TS [51], Time-LLM [17], UniTime [20]; pre-train models: PatchTST [21], CoST [37], TS2Vec [42]; supervised models: DLinear [43], TimesNet [38]. More implementation details are provided in App. B.2. ", "page_idx": 5}, {"type": "text", "text": "Evaluation Metrics. For forecasting and imputation tasks, we use mean squared error (MSE): $\\begin{array}{r}{\\frac{1}{n}\\sum_{i=1}^{n}\\left(\\pmb{y}-\\hat{\\pmb{y}}\\right)^{2}}\\end{array}$ and mean absolute error (MAE): $\\textstyle{\\frac{1}{n}}\\sum_{i=1}^{n}|y-{\\hat{y}}|$ as the evaluation metric. For classification tasks, we use accuracy as the metric. The metric of the anomaly detection task includes precision, recall, $F0.5$ , and $F1$ scores. The $F\\beta$ is a metric defined as the weighted harmonic mean of precision and recall, with the following equation: $\\begin{array}{r}{F\\beta=\\frac{\\left(1+\\beta^{2}\\right)\\times p r e c i s i o n\\times r e c a l l}{\\beta^{2}\\times p r e c i s i o n+r e c a l l}}\\end{array}$ . We use $F0.5$ for anomaly detection, since precision is more important than recall in power systems scenario [15]. ", "page_idx": 5}, {"type": "text", "text": "3.2 Downstream Tasks ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "Demand-side Management. Demand-side management aims to optimize and balance the power system by managing and adjusting the electricity demand of end-users. We develop tasks to predict load at different levels (such as cities and users) and tasks to forecast solar generation. With demandside management, we can better plan and schedule power resources, improve energy efficiency, promote the development of renewable energy, and achieve sustainable energy management. ", "page_idx": 5}, {"type": "text", "text": "Grid Stability. To ensure the stability of the power grid, we have implemented a series of tasks, including electricity theft detection, load imputation, and clock anomaly detection, to address the impact of potential appliance failures within the grid and external electricity theft on the quality of power data and grid operations. Internal appliance malfunctions within the grid such as clock anomalies or the inability to record electricity usage accurately decrease the accuracy of power data, making it challenging for power dispatch and management. Additionally, external electricity theft can cause economic losses and pose a threat to the stable operation and reliability of the power grid, potentially causing power outages and other adverse effects. ", "page_idx": 5}, {"type": "text", "text": "", "page_idx": 6}, {"type": "text", "text": "Consumer Behavior Analysis. To provide users with more assistance, we have implemented tasks such as detection of elderly living alone, high-power appliance detection, gender classification, age classification, and family structure classification. Additionally, we can provide more flexible power scheduling plans for special groups, so as to optimize power dispatch. We also aim to understand the energy usage differences among different genders and age groups and provide personalized energy management recommendations and services for different users. ", "page_idx": 6}, {"type": "table", "img_path": "JInTfcxH3Q/tmp/5d4833799695c7882503d9fbe3f2451c1997e850719be6883d3bea13d8b602a7.jpg", "table_caption": ["Table 1: Performance comparison on private dataset. The result of MAE metric refer to Tab. 6 "], "table_footnote": [], "page_idx": 6}, {"type": "text", "text": "3.3 Main Results ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "Overview. As a foundation model for power systems, PowerPM achieves SOTA performance on various tasks when compared to other baseline models, highlighting its ability to generalize effectively across a wide range of tasks. We derive more detailed comparisons of each task in the following paragraphs, and in all tables we mark the best results in bold, the second-best in underlined, and the third-best in ∗asterisk in each column. ", "page_idx": 6}, {"type": "text", "text": "Demand-side Management. The forecasting results for load and solar generation are presented in Tab. 1 (upper part). The results cover various forecast horizons, including 4 (1 hour), 96 (1 day), 288 (3 days), and 672 (1 week). The choice of these forecast horizons holds physical significance as it aligns with real-world scenarios. The results demonstrate that not only PowerPM achieves near SOTA performance, but also Powe $\\mathbf{\\cdotPM}_{f r e e z e}$ surpasses most baseline models. This highlights the superiority of PowerPM in modeling temporal dependencies and capturing the impact of exogenous variables through the use of a temporal encoder and a novel masked ETS modeling approach. Furthermore, PowerPM attains near SOTA performance at different hierarchical levels, particularly at the macro level (district and city), highlighting the importance of modeling the hierarchical correlation within ETS data in PowerPM. Notably, among the baselines, none of the baselines capture the hierarchical correlation of ETS data, resulting in a performance decrease in comparison to PowerPM. ", "page_idx": 6}, {"type": "text", "text": "", "page_idx": 7}, {"type": "text", "text": "Grid Stability. To assess the efficacy of PowerPM in grid stability application, we conduct comprehensive experiments encompassing load imputation across various masked ratios $(12.5\\%$ , $2\\bar{5}\\%$ , $37.5\\%$ , $50\\bar{\\%}$ ), anomaly detection (including electricity theft and clock anomaly detection), encompassing a total of 18 tasks. The results, detailed in Tab. 1 (middle part), illustrate PowerPM’s consistent superiority over all baselines, with the $\\mathrm{PowerPM}_{f r e e z e}$ variant also surpassing the majority of baselines. Notably, in imputation tasks, PowerPM demonstrates marked superiority over other pre-trained models (such as PatchTST and CoST), underscoring the advantages of hierarchical modeling in ETS data. Furthermore, in anomaly detection tasks, as shown in Tab. 1 (middle part), our model consistently achieves near-optimal results. While GPT4TS records the highest F0.5 score among the baseline methods, attributed to its generation of GPT-2, PowerPM further enhances the F0.5 score over GPT4TS. This improvement stems from our temporal encoder’s broader receptive field and the hierarchical encoder’s capacity to capture hierarchical correlations across all levels, which are both pivotal for modeling ETS data. ", "page_idx": 7}, {"type": "text", "text": "Consumer Behavior Analysis. We explore two anomaly detection tasks: elderly living alone and high-power appliance detection, and three classification tasks: gender, age, and family structure classification. The results in Tab. 1 (bottom part) demonstrate PowerPM’s SOTA performance, illustrating its capacity for deep semantic insight and contextual awareness. Furthermore, PowerPMfreeze sustains high performance, highlighting the model’s innate ability to extract and generalize features. ", "page_idx": 7}, {"type": "table", "img_path": "JInTfcxH3Q/tmp/1d052893d028d51b81cfecf529cd14d35e2056477464babb2a4bd4cf27570790.jpg", "table_caption": ["Table 2: Performance comparison on 4 public dataset. "], "table_footnote": [], "page_idx": 7}, {"type": "text", "text": "3.4 Model Analysis ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "Generalization Ability Analysis. To further verify the generalization ability of PowerPM on more datasets from other domains, we evaluate PowerPM on 4 public datasets mentioned above. The results in Tab. 2 demonstrate that PowerPM outperforms nearly all SOTA methods and PowerPMfreeze surpasses most SOTA methods, highlighting the generalization superiority of PowerPM. ", "page_idx": 7}, {"type": "text", "text": "Ablation Study. To assess the effectiveness of each component in our model, we conduct several ablation experiments. Specifically, we remove the following components from our model to examine their effects on performance: the hierarchical encoder (PowerPM-H), the dual-view contrastive learning strategy (PowerPMC), and the exogenous variables encoding module (PowerPM-E). Furthermore, we replace the masked ETS modeling module with vanilla random masking (PowerPM-M). We categorize 44 tasks into four traditional time series tasks: forecasting, missing value imputation, anomaly detection, and classification. The evaluation metrics are Mean Squared Error (MSE) for forecasting and missing value imputation, F0.5 score is for anomaly detection, and accuracy (Acc.) for classification. The performance is averaged to provide a comprehensive assessment. ", "page_idx": 8}, {"type": "text", "text": "The results of the ablation study are in Fig. 4 (a). The results indicate that PowerPM outperforms its vari", "page_idx": 8}, {"type": "image", "img_path": "JInTfcxH3Q/tmp/857767cfa2a3aae1d3a4f91fe8ca6c568a346ce224c6c3bbe61db389114a3e75.jpg", "img_caption": ["Figure 4: Model Analysis: Ablation Study, Few-shot Learning, and Model Scale Evaluation "], "img_footnote": [], "page_idx": 8}, {"type": "text", "text": "ants, providing evidence for the contribution of each component. Among them, PowerPM-H exhibits the most substantial decrease in performance compared to the full PowerPM, emphasizing the significance of interactions between micro- and macro-levels when modeling hierarchical ETS data. The observed performance degradation of PowerPM-M, particularly in forecasting tasks, shows that causal masking can capture more complex temporal dependency. Moreover, the declined performance of PowerPM-C, particularly in anomaly detection and classification tasks, suggests that dual-view contrastive learning is effective in capturing subtle discrepancies between instances. Furthermore, PowerPM-E also presents performance degradation. This emphasizes the effectiveness of the exogenous variables encoding module in capturing the impact of exogenous factors. For detailed results of 44 tasks, please refer to App. 7. ", "page_idx": 8}, {"type": "text", "text": "Few-shot Learning. In power systems, collecting abundant ETS data for downstream tasks is a significant investment. To demonstrate the practical application value of our work, we conduct a performance comparison between PowerPM and baseline models, considering the limited availability of ETS data. Specifically, models are fine-tuned on $10\\%$ , $30\\%$ and $60\\%$ of the downstream dataset, respectively. Similar to an ablation study, we group our results by task type, which can be seen in Fig. 4 (b). The performance of PowerPM exhibits a slight decrease when there is a significant reduction in the proportion of fine-tuning data. This observation serves as evidence of the effectiveness of our novel pre-training strategy. Additionally, it highlights that the PowerPM adeptly captures temporal dependencies and hierarchical correlations present in the ETS data during pre-training, enabling easier adaptation to downstream tasks. More detailed results can be referred in App. 8. ", "page_idx": 8}, {"type": "text", "text": "Model Scale Evaluation. To explore the impact of model size on performance, we design three variants of PowerPM (about $250M$ ) with smaller sizes: PowerPM-Tiny (about $30M$ ), PowerPMSmall (about $70M,$ ), PowerPM-Medium (about $120M$ ), and pre-train them on the same datasets. For the pre-training details, please refer to App. B.1. After pre-training, we evaluate these variants on all downstream tasks and present the results by task type like the ablation study. As shown in Fig. 4 (c), as the size of the model increases, we observe an overall improvement of the performance on all downstream tasks. Specifically, PowerPM outperforms the other variants in all metrics. In addition, larger models exhibit almost a decrease in standard deviation, indicating a more stable performance. ", "page_idx": 8}, {"type": "text", "text": "Therefore, the utilization of a larger model with higher capacity and large ETS data enables better generalization across a wide range of downstream tasks. ", "page_idx": 9}, {"type": "text", "text": "4 Related Work ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "Self-supervised Pre-training Model. Large-scale model based on self-supervised pre-training has become more significant in both industrial and academic domains due to the versatility and impressive performance. It initially developed in the fields of computer vision [14] and natural language processing [8, 11]. Self-supervised pre-training in time series is typically classified into two paradigms: contrastive learning and mask modeling. The objective of contrastive learning is to learn representation by pushing positive pairs closer and pull negative pairs away in the embedding space [16]. TS2Vec [42] proposes contextual consistency for positive pair selection. Then, CoST [37] extracts the trend and seasonal feature representations, and takes advantage of both time and frequency domain contrastive loss to encourage discriminative seasonal representation. And TF-C [47] applies time-frequency consistency for embedding time-based and frequency-based neighbors. In mask modeling, to extract the contextual semantic information, PatchTST [21] masks at the series-level. ", "page_idx": 9}, {"type": "text", "text": "Supervised Learning Model. Since the self-attention mechanism in Transformer [33] showed the great ability to seize global dependencies between input and output, recently many variants have been proposed to tackle power system tasks. LogTrans [19], Informer [48] reduce the complexity by optimizing the vanilla self-attention mechanism. Autoformer [39] leverages auto-correlation mechanism to achieve series-wise representation aggregation. FEDformer [50] incorporates frequency-domain information to enhances prediction performance while reducing complexity to linear levels. Besides, DLinear [43] questions the effectiveness of transformers as it outperforms most Transformer-based SOTAs, with a simple linear model. TimesNet [38] has treated time series as a $2D$ signal and utilized a convolution-based inception net backbone to function as a comprehensive time series model. ", "page_idx": 9}, {"type": "text", "text": "Large Language Models Enhanced Model. Recently, the advancement of Large Language Models (LLMs) has opened up new horizons in time series modeling. Many LLMs, such as llama [32], GPT3 [11], GPT-4 [1], ChatGLM [9] have the capability to capture complex dependencies and understand varied textual data, yielding sensible reasonable generation results. Therefore, many reserachers begin to apply LLMs to assist time series modeling. Time-LLM [17] and TEXT [28] employ reprogrammed input time series with text prototype embedding and incorporate textual prompts for time series. GPT4TS [51] and UniTime [20] apply fine-tuning to selected components of LLMs to improve performance in time series analysis tasks. TEMPO [3] incorporates the decomposition of time series and retrieval-based prompt design for non-stationary time series data. ", "page_idx": 9}, {"type": "text", "text": "However, despite numerous methods for self-supervised and supervised time series, the research on foundation models specifically designed for power systems remains relatively sparse. And LLMs are limited in power systems scenario, lacking enough textual descriptions for domain knowledge. ", "page_idx": 9}, {"type": "text", "text": "5 Conclusion ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "This paper introduces the PowerPM, a foundational model designed to model ETS data within power systems. PowerPM consists of a temporal encoder and a hierarchical encoder. Furthermore, PowerPM leverages a novel self-supervised pre-training framework consisting of masked ETS modeling and dual-view contrastive learning. Our experiments involve two real-world scenario datasets, comprising private and public data. Through pre-training on massive ETS data, PowerPM achieves SOTA performance on diverse downstream tasks within the private dataset. Moreover, when transferred to the public dataset, PowerPM maintains its superiority, showcasing its remarkable generalization ability across various tasks and domains. Further analysis shows the effectiveness of a foundation model in the field of power system. Also, PowerPM is an off-the-shelf model with its code and weights. This feature greatly mitigates the challenges associated with sample and label efficiency, allowing it to be directly integrated into various power system applications. ", "page_idx": 9}, {"type": "text", "text": "Acknowledgments ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "This work was partially supported by National Natural Science Foundation of China (No. 62322606, No. 62441605). ", "page_idx": 10}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "[1] Josh Achiam, Steven Adler, Sandhini Agarwal, Lama Ahmad, Ilge Akkaya, Florencia Leoni Aleman, Diogo Almeida, Janko Altenschmidt, Sam Altman, Shyamal Anadkat, et al. Gpt-4 technical report. arXiv preprint arXiv:2303.08774, 2023.   \n[2] Vadim Arzamasov, Klemens Böhm, and Patrick Jochem. Towards concise models of grid stability. In 2018 IEEE international conference on communications, control, and computing technologies for smart grids (SmartGridComm), pages 1–6. IEEE, 2018.   \n[3] Defu Cao, Furong Jia, Sercan O Arik, Tomas Pfister, Yixiang Zheng, Wen Ye, and Yan Liu. Tempo: Prompt-based generative pre-trained transformer for time series forecasting. arXiv preprint arXiv:2310.04948, 2023.   \n[4] Widyaning Chandramitasari, Bobby Kurniawan, and Shigeru Fujimura. Building deep neural network model for short term electricity consumption forecasting. In 2018 International Symposium on Advanced Intelligent Informatics (SAIN), pages 43–48. IEEE, 2018.   \n[5] Ting Chen, Simon Kornblith, Mohammad Norouzi, and Geoffrey Hinton. A simple framework for contrastive learning of visual representations. In ICML, 2020.   \n[6] Xinlei Chen and Kaiming He. Exploring simple siamese representation learning. In Proceedings of the IEEE/CVF conference on computer vision and pattern recognition, pages 15750–15758, 2021.   \n[7] Yue Cui, Kai Zheng, Dingshan Cui, Jiandong Xie, Liwei Deng, Feiteng Huang, and Xiaofang Zhou. Metro: A generic graph neural network framework for multivariate time series forecasting. Proc. VLDB Endow., 2021.   \n[8] Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding. NAACL, 2018.   \n[9] Zhengxiao Du, Yujie Qian, Xiao Liu, Ming Ding, Jiezhong Qiu, Zhilin Yang, and Jie Tang. Glm: General language model pretraining with autoregressive blank infilling. arXiv preprint arXiv:2103.10360, 2021.   \n[10] Xi Fang, Satyajayant Misra, Guoliang Xue, and Dejun Yang. Smart grid—the new and improved power grid: A survey. IEEE communications surveys & tutorials, 14(4):944–980, 2011.   \n[11] Tianyu Gao, Adam Fisch, and Danqi Chen. Making pre-trained language models better few-shot learners. IJCNLP, 2020.   \n[12] Benjamin Goehry, Yannig Goude, Pascal Massart, and Jean-Michel Poggi. Aggregation of multi-scale experts for bottom-up load forecasting. IEEE Transactions on Smart Grid, 2020.   \n[13] Mohammad Hashemi, Shengbo Gong, Juntong Ni, Wenqi Fan, B. Aditya Prakash, and Wei Jin. A comprehensive survey on graph reduction: Sparsification, coarsening, and condensation, 2024.   \n[14] Kaiming He, Xinlei Chen, Saining Xie, Yanghao Li, Piotr Dollár, and Ross Girshick. Masked autoencoders are scalable vision learners. CVPR, 2022.   \n[15] Wenjie Hu, Yang Yang, Jianbo Wang, Xuanwen Huang, and Ziqiang Cheng. Understanding electricity-theft behavior via multi-source data. In Proceedings of The Web Conference 2020, pages 2264–2274, 2020.   \n[16] Ashish Jaiswal, Ashwin Ramesh Babu, Mohammad Zaki Zadeh, Debapriya Banerjee, and Fillia Makedon. A survey on contrastive self-supervised learning. Technologies, 9(1):2, 2020.   \n[17] Ming Jin, Shiyu Wang, Lintao Ma, Zhixuan Chu, James Y Zhang, Xiaoming Shi, Pin-Yu Chen, Yuxuan Liang, Yuan-Fang Li, Shirui Pan, et al. Time-llm: Time series forecasting by reprogramming large language models. arXiv preprint arXiv:2310.01728, 2023.   \n[18] Diederik P. Kingma and Jimmy Ba. Adam: A method for stochastic optimization. In ICLR (Poster), 2015.   \n[19] Shiyang Li, Xiaoyong Jin, Yao Xuan, Xiyou Zhou, Wenhu Chen, Yu-Xiang Wang, and Xifeng Yan. Enhancing the locality and breaking the memory bottleneck of transformer on time series forecasting. Advances in neural information processing systems, 32, 2019.   \n[20] Xu Liu, Junfeng Hu, Yuan Li, Shizhe Diao, Yuxuan Liang, Bryan Hooi, and Roger Zimmermann. Unitime: A language-empowered unified model for cross-domain time series forecasting. In Proceedings of the ACM Web Conference 2024, 2024.   \n[21] Yuqi Nie, Nam H Nguyen, Phanwadee Sinthong, and Jayant Kalagnanam. A time series is worth 64 words: Long-term forecasting with transformers. ICLR, 2023.   \n[22] Peter Palensky and Dietmar Dietrich. Demand side management: Demand response, intelligent energy systems, and smart loads. IEEE transactions on industrial informatics, 7(3):381–388, 2011.   \n[23] Yue Pang, Bo Yao, Xiangdong Zhou, Yong Zhang, Yiming Xu, and Zijing Tan. Hierarchical electricity time series forecasting for integrating consumption patterns analysis and aggregation consistency. In IJCAI, pages 3506–3512, 2018.   \n[24] Adam Paszke, S. Gross, Francisco Massa, A. Lerer, James Bradbury, Gregory Chanan, Trevor Killeen, Z. Lin, N. Gimelshein, L. Antiga, Alban Desmaison, Andreas Köpf, Edward Yang, Zach DeVito, Martin Raison, Alykhan Tejani, Sasank Chilamkurthy, Benoit Steiner, Lu Fang, Junjie Bai, and Soumith Chintala. Pytorch: An imperative style, high-performance deep learning library. In NeurIPS, 2019.   \n[25] Michael Schlichtkrull, Thomas N Kipf, Peter Bloem, Rianne Van Den Berg, Ivan Titov, and Max Welling. Modeling relational data with graph convolutional networks. In The Semantic Web: 15th International Conference, ESWC 2018, Heraklion, Crete, Greece, June 3–7, 2018, Proceedings 15, pages 593–607. Springer, 2018.   \n[26] Chao Shang, Jie Chen, and Jinbo Bi. Discrete graph structure learning for forecasting multiple time series. In International Conference on Learning Representations, 2021.   \n[27] Arunesh Kumar Singh, S Khatoon, Md Muazzam, DK Chaturvedi, et al. Load forecasting techniques and methodologies: A review. In 2012 2nd International Conference on Power, Control and Embedded Systems, pages 1–10. IEEE, 2012.   \n[28] Chenxi Sun, Yaliang Li, Hongyan Li, and Shenda Hong. Test: Text prototype aligned embedding to activate llm’s ability for time series. arXiv preprint arXiv:2308.08241, 2023.   \n[29] Xiaorong Sun, Peter B. Luh, Kwok W. Cheung, Wei Guan, Laurent D. Michel, S. S. Venkata, and Melanie T. Miller. An efficient approach to short-term load forecasting at the distribution level. IEEE Transactions on Power Systems, 2016.   \n[30] Yuechuan Tao, Jing Qiu, Shuying Lai, Junhua Zhao, and Yusheng Xue. Carbon-oriented electricity network planning and transformation. IEEE Transactions on Power Systems, 36(2):1034– 1048, 2020.   \n[31] Sana Tonekaboni, Danny Eytan, and Anna Goldenberg. Unsupervised representation learning for time series with temporal neighborhood coding. In International Conference on Learning Representations, 2021.   \n[32] Hugo Touvron, Thibaut Lavril, Gautier Izacard, Xavier Martinet, Marie-Anne Lachaux, Timothée Lacroix, Baptiste Rozière, Naman Goyal, Eric Hambro, Faisal Azhar, et al. Llama: Open and efficient foundation language models. arXiv preprint arXiv:2302.13971, 2023.   \n[33] Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz Kaiser, and Illia Polosukhin. Attention is all you need. Advances in neural information processing systems, 30, 2017.   \n[34] Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Ł ukasz Kaiser, and Illia Polosukhin. Attention is All you Need. In Advances in Neural Information Processing Systems, 2017.   \n[35] Hong Wang, Khalid A. Alattas, Ardashir Mohammadzadeh, Mohammad Hosein Sabzalian, Ayman A. Aly, and Amir Mosavi. Comprehensive review of load forecasting with emphasis on intelligent computing approaches. Energy Reports, 8, 2022.   \n[36] Yi Wang, Qixin Chen, Mingyang Sun, Chongqing Kang, and Qing Xia. An ensemble forecasting method for the aggregated load with subprofiles. IEEE Transactions on Smart Grid, 2018.   \n[37] Gerald Woo, Chenghao Liu, Doyen Sahoo, Akshat Kumar, and Steven Hoi. Cost: Contrastive learning of disentangled seasonal-trend representations for time series forecasting. ICLR, 2022.   \n[38] Haixu Wu, Tengge Hu, Yong Liu, Hang Zhou, Jianmin Wang, and Mingsheng Long. Timesnet: Temporal 2d-variation modeling for general time series analysis. In The Eleventh International Conference on Learning Representations, 2022.   \n[39] Haixu Wu, Jiehui Xu, Jianmin Wang, and Mingsheng Long. Autoformer: Decomposition transformers with auto-correlation for long-term series forecasting. NeurIPS, 2021.   \n[40] Zonghan Wu, Shirui Pan, Guodong Long, Jing Jiang, Xiaojun Chang, and Chengqi Zhang. Connecting the dots: Multivariate time series forecasting with graph neural networks. In Proceedings of the 26th ACM SIGKDD international conference on knowledge discovery & data mining, pages 753–763, 2020.   \n[41] Dazhi Yang, Gary SW Goh, Siwei Jiang, Allan N Zhang, and Orkan Akcan. Forecast upc-level fmcg demand, part ii: Hierarchical reconciliation. In 2015 ieee international conference on big data (big data), pages 2113–2121. IEEE, 2015.   \n[42] Zhihan Yue, Yujing Wang, Juanyong Duan, Tianmeng Yang, Congrui Huang, Yunhai Tong, and Bixiong Xu. TS2Vec: Towards Universal Representation of Time Series. AAAI, 2022.   \n[43] Ailing Zeng, Muxi Chen, Lei Zhang, and Qiang Xu. Are transformers effective for time series forecasting? In Proceedings of the AAAI conference on artificial intelligence, volume 37, pages 11121–11128, 2023.   \n[44] Chi Zhang and Ran Li. A novel closed-loop clustering algorithm for hierarchical load forecasting. IEEE Transactions on Smart Grid, 2021.   \n[45] Hao Zhang, Fan Zhang, Yu Zhang, Hui Cheng, Ruotian Gao, Zongpeng Li, Jiakui Zhao, and Mingzhu Zhang. An elderly living-alone guardianship model based on wavelet transform. In 2022 4th International Conference on Power and Energy Technology (ICPET), pages 1249–1253. IEEE, 2022.   \n[46] Huaying Zhang, Qing Wang, Yan Li, Jingwen Ai, Xunyong Hu, Wenhai Zhang, and Dehai Zhang. Clock anomaly detection method of power quality monitoring device based on voltage sag. In 2021 IEEE 2nd China International Youth Conference on Electrical Engineering (CIYCEE), pages 1–6. IEEE, 2021.   \n[47] Xiang Zhang, Ziyuan Zhao, Theodoros Tsiligkaridis, and Marinka Zitnik. Self-supervised contrastive pre-training for time series via time-frequency consistency. NeurIPS, 2022.   \n[48] Haoyi Zhou, Shanghang Zhang, Jieqi Peng, Shuai Zhang, Jianxin Li, Hui Xiong, and Wancai Zhang. Informer: Beyond efficient transformer for long sequence time-series forecasting. In Proceedings of the AAAI conference on artificial intelligence, volume 35, pages 11106–11115, 2021.   \n[49] Kaile Zhou and Shanlin Yang. Understanding household energy consumption behavior: The contribution of energy big data analytics. Renewable and Sustainable Energy Reviews, 56:810– 819, 2016.   \n[50] Tian Zhou, Ziqing Ma, Qingsong Wen, Xue Wang, Liang Sun, and Rong Jin. Fedformer: Frequency enhanced decomposed transformer for long-term series forecasting. In ICML, 2022.   \n[51] Tian Zhou, Peisong Niu, Liang Sun, Rong Jin, et al. One fits all: Power general time series analysis by pretrained lm. Advances in neural information processing systems, 36, 2024. ", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "", "page_idx": 13}, {"type": "table", "img_path": "JInTfcxH3Q/tmp/b5cfb9bde4b9c48a481cac61b2a2439239ed352919dc307aaeee4f4bf554a0f1.jpg", "table_caption": ["Table 3: Private dataset description "], "table_footnote": [], "page_idx": 14}, {"type": "text", "text": "A Dataset Description ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "We conduct experiments on 5 real-world hierarchical electricity time series datasets, one of which was collected from the real scenario. The other four are collected from CSISO 6, $\\mathrm{ISONE^{7}}$ , NYISO 8, and PJM 9. Our experiments include four typical time series analysis tasks on these datasets to evaluate the effect of our approach in both in-domain and cross-domain settings: prediction, missing value imputation, anomaly detection, and classification, which include different sampling frequencies (5 minutes, 15 minutes, 1 hour, 1 day). Moreover, it covers a variety of application scenarios in power systems (load forecasting, solar generation forecasting, electricity theft detection and consumer analysis, etc.). Tab. 3 and Tab. 4 summarize the detailed descriptions of these datasets. ", "page_idx": 14}, {"type": "text", "text": "A.1 Private Dataset ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Private dataset is collected from the load data in the real scenario, covering the period about 6 years. Following data preprocessing, we extract a subset of the data. In order to effectively support our research objectives, we divide the dataset into 9 distinct sub-datasets. One biggest of these sub-datasets is served as the pre-training dataset, while the remaining 7 sub-datasets are utilized as downstream datasets for downstream tasks. These downstream datasets are partitioned into train, validation, and test sets according to a $6:2:2$ ratio, ensuring that the training set contain data from the earlier time period. Further details are provided below: ", "page_idx": 14}, {"type": "table", "img_path": "JInTfcxH3Q/tmp/ddd002f04ba2cc2831ac21218cf434fb1fe054c04358480d83bece69b18401d8.jpg", "table_caption": ["Table 4: Public dataset description "], "table_footnote": [], "page_idx": 15}, {"type": "text", "text": "Pre-training Dataset. The pre-training dataset is derived from a subset of the private dataset, encompassing the period about 4 years.. It consists of unlabeled data recorded at a frequency of one data point every 15 minutes. The dataset is structured hierarchically, including information at the user, district, and city levels. ", "page_idx": 15}, {"type": "text", "text": "Load Forecasting and Missing Value Imputation Dataset. This dataset is extracted from a portion of the private dataset about 1 years. The dataset includes hierarchical information at the user, district, and city levels, with data points recorded every 15 minutes. For the missing value imputation task, the dataset is structured to output 672 data points. As for the forecasting task, there are four different prediction horizons: one hour (4 data points), one day (96 data points), three days (288 data points), and seven days (672 data points). ", "page_idx": 15}, {"type": "text", "text": "Solar Generation Forecasting Dataset. The dataset is collected from many distributed photovoltaic power stations. The dataset has not a hierarchical structure, and data points are recorded at a frequency of one point every 15 minutes. It includes four different prediction horizons: one hour, one day, three days, and seven days. ", "page_idx": 15}, {"type": "text", "text": "Electricity Theft Detection Dataset. This dataset comprises the daily electricity consumption records (in K·Wh) of users in 1 year. For each user, the dataset includes the daily aggregate electricity usage. Within the dataset, certain users (referred to as electricity thieves) engage in unauthorized activities involving the electricity meter in order to reduce costs. ", "page_idx": 15}, {"type": "text", "text": "Clock Anomaly Dataset. This dataset comprises millions of clock error series, each representing the time deviation, compared to the standard time, and communication delay of various watt-hour meters on a weekly basis. The dataset covers the period about 8 months. ", "page_idx": 15}, {"type": "text", "text": "Elderly Living Alone Dataset. This dataset includes the daily electricity consumption records (in K·Wh) of village users. Additionally, employees conduct extensive on-site investigations specifically targeting these users, from which we obtain labels indicating whether each user is an elderly individual living alone or not. ", "page_idx": 15}, {"type": "text", "text": "High-power Appliance Detection Dataset. This dataset consists of the daily electricity consumption records (in K·Wh) of village users. Similar to the previous dataset, on-site investigations are conducted by same method, enabling us to collect labels indicating whether each user possesses high-power appliances. ", "page_idx": 15}, {"type": "text", "text": "Consumer Analysis Dataset. This dataset contains the daily electricity consumption records (in K·Wh) of village users. Additionally, employees conducted extensive on-site investigations targeting these users, collecting statistics related to the gender of the gender of user who lives alone, the age of the resident elderly, and family structure. The gender labels of user who lives alone are: male and female, totaling two classes; the age labels for residents are: $60\\sim70\\$ years old, $70\\sim80$ years old, $80\\sim90$ years old, and over 90 years old, totaling four classes; the family structure labels are: 1 people, $2\\sim3$ people, $4\\sim5$ people, and more than 6 people, totaling four classes. ", "page_idx": 15}, {"type": "text", "text": "A.2 Public Datasets ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Four public datasets as cross-domain datasets are selected to validate the generalization ability of our model. These four datasets are named CSISO, ISONE, NYISO, and PJM, which cover 3 types different hierarchical relationships: state-area, region-state, state-city. ", "page_idx": 16}, {"type": "text", "text": "CAISO. It is sampled from California, including 34 areas loads and an aggregated load for the state, recorded every hour from April 25, 2023, to April 23, 2024. The prediction horizons include half a day (12 points), one day (24 points), and seven days (168 points). ", "page_idx": 16}, {"type": "text", "text": "ISONE. It is sampled from New England, consisting of 6 states loads and an aggregated load for the region, recorded every hour from October 1, 2023, to April 1, 2024. The prediction horizons include half a day (12 points), one day (24 points), and seven days (168 points). ", "page_idx": 16}, {"type": "text", "text": "NYISO. It is sampled from California, containing 11 areas loads and an aggregated load for the state, recorded every 5 minutes from March 1, 2023, to March 31, 2024. The prediction horizons include one hour (12 points), half a day (144 points), and one day (288 points). ", "page_idx": 16}, {"type": "text", "text": "PJM. It is sampled from 3 states: Florida, Ohio, Washington, which includes 22 cities loads and there 3 state loads, recorded every hour from March 28, 2023, to April 26, 2024. The prediction horizons include one hour (12 points), half a day (144 points), and one day (288 points). ", "page_idx": 16}, {"type": "text", "text": "A.3 Exogenous Variables", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "We obtained weather and temperature records for all area levels in both the private and public datasets. The weather information from the private dataset is obtained from the Weather Radar10. Additionally, the weather information from the public datasets is obtained from the NSF NCAR Research Data Archive11. Both sources cover the same timespan as mentioned above, respectively. These records include the maximum and minimum temperatures (in $^\\circ C$ for private dataset and $^{\\circ}\\mathrm{F}$ for public datasets) for each hour in each city. ", "page_idx": 16}, {"type": "text", "text": "B PowerPM and Baseline Implementation Details ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "B.1 PowerPM Implementation ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "The pre-training stage of the experiment is implemented in PyTorch [24] and conducted on a Linux system with 2 CPUs (AMD EPYC 9654 96-Core Processor) and 8 GPUs (NVIDIA Tesla $A800\\;80G)$ for about 8 days. And the downstream task experiment is repeated five times. We select 512 samples as a batch, and every batch contains about $174k$ patches, which we set patch len to 48 , stride to 24. To speed up the model training, we stop the gradient update of the background nodes in the hierarchical graph. We optimize with Adam [18], updating the model parameters every 4 steps, and the model trains for $1310k$ updates in total. A reduce learning rate on plateau scheduler is utilized to adjust learning rate during pre-training. Specifically, we set the basic learning rate as $1e-6$ and the maximum learning rate as $2e-5$ , and the learning rate updates for every $10k$ updates. In addition, we trained three additional variants of PowerPM with different parameter counts to meet the needs of different users or situations. Detailed model hyperparameters can be found in Tab. 5. ", "page_idx": 16}, {"type": "text", "text": "Full Fine-tuning. In the F-FT (Full Fine-tuning) setup, for different tasks, we introduce different head $H$ on the top of pre-trained encoder $f(.)$ , where both the parameters of the encoder $f(.)$ and the head $H$ are trainable. For forecasting and imputation tasks, we use a prediction $H_{l}$ head to map prediction points or reconstruction points from $\\mathbf{z}_{i}$ . In this setup, we fine-tune both the head $H$ and the encoder $f(.)$ . We utilize $100\\%$ , $60\\%$ , $30\\%$ and $10\\%$ training data for fine-tuning. we utilize a one-layer fully connected network to implement prediction $H_{l}$ and logistic regression from the Sklearn library to implement the classifier $H_{c}$ . The learning rates are specifically set to $4e-4$ and $3e-5$ for public and private datasets. ", "page_idx": 16}, {"type": "text", "text": "Partial Fine-tuning. In the P-FT (Partial Fine-tuning) setup, for different tasks, we also introduce different head $H$ on the top of pre-trained encoder $f(.)$ . For forecasting and imputation tasks, we use a prediction $H_{l}$ head to map prediction points or reconstruction points from $\\mathbf{z}_{i}$ . And for anomaly detection and classfication tasks, a classifier $H_{c}$ on top of the pre-trained encoder $f(.)$ . During the whole finetune process, we keep the parameters of $f(.)$ fixed. Only the head is fine-tuned in this setup. we utilize a one-layer fully connected network to implement prediction $H_{l}$ and logistic regression from the Sklearn library to implement the classifier $H_{c}$ . The learning rates are specifically set to $4e-4$ and $3e-5$ for public and private datasets. ", "page_idx": 16}, {"type": "text", "text": "", "page_idx": 17}, {"type": "text", "text": "B.2 Baselines Implementation ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "We compare with 8 state-of-the-art methods: including Large Language Model (LLM) enhanced models: GPT4TS [51], Time-LLM [17], UniTime [20]; pre-train models: PatchTST [21], CoST [37], TS2Vec [42]; supervised models: DLinear [43], TimesNet [38]. To make a fair and comprehensive comparison, we reproduce all models with official implementation, and use different output head for different downstream tasks. Due to the large scale of the ETS dataset, we increase the number of training epoch and reduce the learning rate in order to make the parameters of the model fully learned. ", "page_idx": 17}, {"type": "text", "text": "GPT4TS [51] combines the LLM with Transformer, which use frozen pre-trained GPT-2 for general time series analysis. To implement GPT4TS, we utilized their open-source code, available at https://github.com/DAMO-DI-ML/NeurIPS2023-One-Fits-All. We use the 6 layers of GPT-2, which is proved to have the optimal performance in original paper and the total size of GPT4TS is about 105.15M, and the trainable parameters are $24.04M$ (GPT-2 is frozen). We set the number of train epochs to 50, the learning rate to 0.0005, and the batch size to 256. ", "page_idx": 17}, {"type": "text", "text": "Time-LLM [17] frezees the LLM as the backbone, and align time series to text with patch reprogramming. It also designs Prompt-as-Prefix including dataset context, task instruction and input statistics to enrich the input context to direct the transformation of reprogrammed input. We utilized their open-source code, available at https://github.com/KimMeen/Time-LLM to implement Time-LLM. We set the llama-7b with 32 layers as the backbone, which is the most effective recorded in [17] and the total size of Time-LLM is about $7.28B$ , and the trainable parameters are $58.55M$ (llama-7b is frozen). To align the dataset context input to our datasets, we constuct different natural language prompt summarized in App. A for private and public datasets, and we set the number of train epochs to 50, the learning rate to 0.005, and the batch size to 256. ", "page_idx": 17}, {"type": "text", "text": "UniTime [20] leverages LLM to handle time series forecasting across time series domains, which exhibit significant differences in temporal patterns and distribution. The same as dataset context in Time-LLM, UniTime also designs human-crafted instructions to furnish the model with explicit domain identification information. To implement UniTime, we utilized their open-source code, available at https://github.com/liuxu77/UniTime. We implement the backbone LLM with GPT2-small like original paper, and the total size of UniTime is about $108.54M$ without freeze any parameters. We use the same natural language prompt in Time-LLM as the human-crafted instructions for different datasets, and we set the number of train epochs to 50, the learning rate to 0.0005, the weight decay to 0.0001, and the batch size to 256. ", "page_idx": 17}, {"type": "text", "text": "TS2Vec [42] performs contextual consistency using overlapping subseries and a hierarchical loss function to capture data consistency at the observation and sample levels. We utilize the open-source code available at https://github.com/zhihanyue/ts2vec. Specifically, we set the number of epochs for pre-training to 100, the learning rate to 0.0005, and the batch size to 512. Due to the large scale and complex semantics of the pre-trained ETS data, we adjust the representation dimension to 640, matching the ETS data characteristics. We adopt the default settings provided by the TS2Vec implementation for other settings during pre-training. ", "page_idx": 17}, {"type": "text", "text": "CoST [37] comprises both time domain and frequency domain contrastive losses to learn discriminative trend and seasonal representations. We utilize the open-source code available at https://github.com/salesforce/CoST to implement CoST. Specifically, we set the number of epochs for pre-training to 100, the learning rate to 0.0005, representation dimension to 640, and the batch size to 256. We adopt the default settings provided by the CoST implementation for other settings during pre-training. ", "page_idx": 17}, {"type": "text", "text": "PatchTST [21] changes the input sequence as a series of patch windows, focus the subseries-level attention to capture local semantic information while minimizing memory consumption. We utilize the open-source code available at https://github.com/yuqinie98/PatchTST. For hyperparameters of PatchTST, We set the patch len to 32 and stride to 16, the number of epochs for pre-training to 100, the learning rate to 0.0005, and the batch size to 512. We adopt the default settings provided by the PatchTST implementation for other settings during pre-training. ", "page_idx": 17}, {"type": "text", "text": "", "page_idx": 18}, {"type": "text", "text": "TimeNet [38] is a CNN based time series model which extends the analysis of temporal variations into the $2D$ space. It designs TimesBlock with an inception block to extract complex temporal patterns, leading to multiple time series tasks. To implement TimesNet, we utilized their open-source code, available at https://github.com/thuml/Time-Series-Library. Specifically, we set the number of epochs for training to 50, the learning rate to 0.0005, and the batch size to 128. We adopt the default settings provided by the TimesNet implementation for other settings for forecasting, imputation classfication anomaly detection . ", "page_idx": 18}, {"type": "text", "text": "DLinear [43] decomposes the time series into a trend sequence and a seasonal sequence, then model these two sequences using two simple MLPs. To implement DLinear, we utilized their open-source code, available at https://github.com/cure-lab/LTSF-Linear. Specifically, we set the number of epochs for training to 50, the learning rate to 0.0005, and the batch size to 512. We adopt the default settings provided by the DLinear implementation for other settings. ", "page_idx": 18}, {"type": "text", "text": "B.3 Cluster Method ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "We use K-means algorithm to cluster users. Firstly, we get fliter out user ETS by labels, and normalize the time series data, represented as an $N\\times M$ matrix, to ensure that differences in scale do not affect the clustering results. Next, we use DTW as the distance metric to cope with time shifts and different rate variations in ETS data and randomly initialize a cluster centers. By calculating the distance from each time series to each cluster center, it is assigned to the nearest cluster center, and the cluster center is recalculated according to the assignment result,and the process is iterated until the cluster center is stable. We experimented 10 times with different $K$ , and used elbow method to select the optimal number of clusters, and finally determined 12. ", "page_idx": 18}, {"type": "text", "text": "C Full Results ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Due to the limited length of the text, we summarize all the experiments in the main text into two parts: the main experiment and the analytical experiment. We categorize and index them in Table 6, 7, 8. ", "page_idx": 18}, {"type": "text", "text": "D Limitations ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "PowerPM is designed for electricity time series modeling, containing about 250M parameters. As a foundation model, although we have provided relatively comprehensive results to verify the model’s effectiveness, the model still exsits limitations. In fact, there are various kinds of ETS in the power systems, which contain not only the electricity consumption data generated by human activities, but also the sequence generated by system operation and sensor detection. In this paper, PowerPM only pre-train on load data. In the future, by increasing model parameters and improving model architecture, we will use more kinds of ETS data for training, so that it can capture more complicated ETS semantic information, understand more complex power system operation rules, and provide more complete help for power systems. ", "page_idx": 18}, {"type": "text", "text": "E Social Impacts ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "This paper presents PowerPM as a foundation model for power systems and has been deployed in the real scenario. It focus on demand-side management, grid stability and consumer behavior analysis, providing the possibility to understand and analyze electricity time series. There is no potential ethical risk or negative social impact. ", "page_idx": 18}, {"type": "table", "img_path": "JInTfcxH3Q/tmp/df9b2eeaf604c5b90a6e7e53b7a8b187711e520a9698e513f32c93dac4a7ba1f.jpg", "table_caption": ["Table 5: The model hyperparameters of PowerPM with different model size. "], "table_footnote": [], "page_idx": 19}, {"type": "table", "img_path": "JInTfcxH3Q/tmp/5070b36f9d3135132a12e955db183b390d050c8bd43f294aa4704cc54a27e91d.jpg", "table_caption": ["Table 6: Additional performance comparison on private dataset in terms of MAE metric. Forecasting tasks involve varying forecasting lengths of $\\{4,96,288,672\\}$ time points and imputation tasks involve varying mask ratio $\\left\\{0.125,0.25,0.375,0.5\\right\\}$ . The length of the input window is 672. "], "table_footnote": [], "page_idx": 19}, {"type": "table", "img_path": "JInTfcxH3Q/tmp/a99d94de6bc8bf5460b3a7de676026b8aacc67fa4407cd154123e45e49f2fcf6.jpg", "table_caption": ["Table 7: Detailed performance of ablation study. Forecasting tasks involve varying forecasting lengths of $\\{4,96,288,672\\}$ time points, imputation tasks involve varying mask ratio $\\left\\{0.125,0.25,0.375,\\dot{0}.5\\right\\}$ . The length of the input window is 672. "], "table_footnote": [], "page_idx": 20}, {"type": "text", "text": "Table 8: Complete results of few-shot learning performance comparison. Models are fine-tuned on $\\{10\\%$ , $30\\bar{\\%}$ and $60\\%\\}$ of the downstream dataset. Forecasting tasks involve varying forecasting lengths of $\\{4,96,288,672\\}$ time points and imputation tasks involve varying mask ratio $\\{0.125,0.25,0.375,0.5\\}$ . The length of the input window is 672. We average the result for each task. ", "page_idx": 21}, {"type": "table", "img_path": "JInTfcxH3Q/tmp/fe2ea08f5834dae3d7d0d2bc8a9a83f175937f90cf5fd511a2ca13134b9237bd.jpg", "table_caption": [], "table_footnote": [], "page_idx": 21}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 22}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 22}, {"type": "text", "text": "Justification: In this paper, abstract and introduction accurately reflect the paper’s contributions and scope. ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 22}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 22}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Justification: The limitations of the work are discussed in Appendix D ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 22}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 22}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 22}, {"type": "text", "text": "Justification: The paper does not include theoretical results. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 23}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: The private dataset so one may cannot reproduce the experiments on the private dataset. However, we also use another two public datasets, and the code of our work is fully provided too, which could help you understand our work. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 23}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 24}, {"type": "text", "text": "Justification: The private dataset so one may cannot reproduce the experiments on the private dataset. However, we also use another four public datasets, and the code of our work is fully provided too, which could help you understand our work. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 24}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Justification: We give a detailed description of our experiment setting in Appendix B.1. Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 24}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Justification: The overall standard derivation is shown in the figure 4. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "page_idx": 24}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 24}, {"type": "text", "text": "", "page_idx": 25}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "Justification: We provide information about Experiments Compute Resources such as CPU, GPU, etc. in the Appendix B. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 25}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "Justification: All authors reviewed and conducted the NeurIPS Code of Ethics. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 25}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "Justification: Our potential positive societal impacts is discussed in Appendix E. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed. • If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact. ", "page_idx": 25}, {"type": "text", "text": "• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 26}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 26}, {"type": "text", "text": "Answer: [No] ", "page_idx": 26}, {"type": "text", "text": "Justification: This paper poses no such risks. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 26}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Justification: All the existing assets are properly referenced. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 26}, {"type": "text", "text": "", "page_idx": 27}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 27}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 27}, {"type": "text", "text": "Justification: Our code is provided as a supplement. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 27}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 27}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 27}, {"type": "text", "text": "Justification: This paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 27}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 27}, {"type": "text", "text": "Answer: [No] ", "page_idx": 27}, {"type": "text", "text": "Justification: This paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 27}]