[{"figure_path": "rbtnRsiXSN/figures/figures_1_1.jpg", "caption": "Figure 1: The primary distinction between previous methods and ours lies in the representation of future trajectories. Previous methods, as depicted in (a), use only one mode query for each trajectory. Our approach, illustrated in (c), utilizes decoupled mode queries, as shown in (a), and state queries, as shown in (b), to represent the multi-modal trajectories.", "description": "This figure illustrates the core idea of the DeMo framework.  Panel (a) shows the traditional one-query-one-trajectory approach where a single query attempts to predict all future possibilities of motion. Panel (b) introduces the concept of state queries, which track the agent's dynamic states over time separately.  Finally, panel (c) combines both mode queries (directional intentions) and state queries, providing a more detailed and accurate representation of future trajectories. This decoupling is the key innovation of the DeMo approach.", "section": "1 Introduction"}, {"figure_path": "rbtnRsiXSN/figures/figures_2_1.jpg", "caption": "Figure 2: Overview of our DeMo framework: The HD maps and agents are first processed by the encoder to obtain the scene context. The decoding pipeline includes: (a) the Mode Localization Module, which processes mode queries by interacting with the scene context from the encoder and among themselves; (b) the State Consistency Module, which processes state queries; and (c) the Hybrid Coupling Module, which combines these queries to generate the final output. The feature dimension is illustrated using a single-agent setting, where B represents the batch size.", "description": "This figure provides a detailed overview of the DeMo framework. It shows how HD maps and agents are initially processed by an encoder to extract scene context.  The decoding process is then broken down into three modules: the Mode Localization Module processes mode queries (directional intentions), the State Consistency Module processes state queries (dynamic states), and the Hybrid Coupling Module combines the outputs of the previous two modules to generate the final trajectory predictions.  The illustration uses a single-agent scenario for clarity, showing the flow of data and the feature dimensions at each step.", "section": "3 Methodology"}, {"figure_path": "rbtnRsiXSN/figures/figures_9_1.jpg", "caption": "Figure 3: Qualitative results on the Argoverse 2 single-agent validation set. Panel (a) illustrates the results of the baseline model without decoupled queries; Panel (b) illustrates the results of our DeMo, which employs decoupled queries; and Panel (c) represents the ground truth.", "description": "This figure provides a qualitative comparison of the baseline model and the proposed DeMo model for single-agent motion forecasting on the Argoverse 2 validation set. It showcases three different scenarios where the models' predictions are compared with the ground truth. The baseline model lacks the decoupled query paradigm of DeMo. The results show that DeMo, with its decoupled queries, yields more accurate and realistic trajectory predictions compared to the baseline model.", "section": "4 Experiments"}, {"figure_path": "rbtnRsiXSN/figures/figures_17_1.jpg", "caption": "Figure 3: Qualitative results on the Argoverse 2 single-agent validation set. Panel (a) illustrates the results of the baseline model without decoupled queries; Panel (b) illustrates the results of our DeMo, which employs decoupled queries; and Panel (c) represents the ground truth.", "description": "This figure shows a qualitative comparison of trajectory prediction results between the baseline model (without decoupled queries) and DeMo (with decoupled queries) on the Argoverse 2 dataset.  It provides a visual representation of the improved accuracy achieved by DeMo. Each row presents a different scenario, with ground truth trajectories shown in (c), the baseline model's predictions in (a), and DeMo's predictions in (b).", "section": "4 Experiments"}, {"figure_path": "rbtnRsiXSN/figures/figures_18_1.jpg", "caption": "Figure 3: Qualitative results on the Argoverse 2 single-agent validation set. Panel (a) illustrates the results of the baseline model without decoupled queries; Panel (b) illustrates the results of our DeMo, which employs decoupled queries; and Panel (c) represents the ground truth.", "description": "This figure compares the qualitative results of the baseline model and DeMo on the Argoverse 2 single-agent validation set.  It shows six examples of trajectories. For each example, there are three panels: (a) shows the predictions from the baseline model that uses a single query to predict trajectories; (b) shows the predictions from DeMo that uses decoupled mode queries and state queries; (c) shows the ground truth trajectories. The figure visually demonstrates that DeMo is superior in prediction accuracy, particularly when the agents' movements are complex or involve changes in direction.", "section": "4 Experiments"}]