[{"figure_path": "n5lLSskwtu/tables/tables_7_1.jpg", "caption": "Table 1: The relationship between average uncertainty scores, label cardinality, and rare labels", "description": "This table presents a statistical analysis of the relationship between three key aspects of the data: average uncertainty scores (from the weight coefficient and label prediction branches of the EMM model), label cardinality (the number of labels associated with each data instance), and the presence of rare labels (specifically, label L1). It quantifies how these factors correlate with each other. For instance, it shows that data instances with a lower number of labels tend to have higher average uncertainty scores, and those containing rare labels also have significantly higher uncertainty scores.", "section": "4.1 Synthetic Data Experiments"}, {"figure_path": "n5lLSskwtu/tables/tables_13_1.jpg", "caption": "Table 1: The relationship between average uncertainty scores, label cardinality, and rare labels", "description": "This table presents a statistical analysis of the correlation between three key aspects of the data samples: average uncertainty scores (Απκ(x) and Aŷ(x)), label cardinality (number of labels assigned to a sample), and the presence of rare labels (YL1 = 1 indicating the presence of a rare label, and YL1 = 0 indicating its absence).  The table shows the average uncertainty scores for different combinations of label cardinality and the presence/absence of rare labels, providing insights into how these factors influence uncertainty estimations. This analysis helps to understand the model's behavior with respect to rare labels and how effectively it captures uncertainty in various scenarios.", "section": "4.1 Synthetic Data Experiments"}, {"figure_path": "n5lLSskwtu/tables/tables_15_1.jpg", "caption": "Table 3: Performance metrics of EMM across datasets", "description": "This table presents the performance of the Evidential Mixture Machines (EMM) model on four real-world multi-label datasets: Delicious, Corel5k, BibTex, and NUS-WIDE. The performance is measured using two metrics: micro-AUC and macro-AUC.  Micro-AUC calculates the average AUC across all labels, while macro-AUC calculates the average AUC for each label and then averages these values. Higher values indicate better performance. The table summarizes the model's performance on each dataset, showcasing its ability to achieve high accuracy and handle diverse, complex label spaces.", "section": "4.2 Real Data Experiments"}, {"figure_path": "n5lLSskwtu/tables/tables_15_2.jpg", "caption": "Table 3: Performance metrics of EMM across datasets", "description": "This table presents the micro-AUC and macro-AUC scores achieved by the Evidential Mixture Machines (EMM) model on four real-world multi-label datasets: Delicious, Corel5k, BibTex, and NUS-WIDE.  Micro-AUC and macro-AUC are common evaluation metrics for multi-label classification, measuring the model's overall performance across all labels.  The results show the performance of EMM on each dataset, allowing for a comparison of its effectiveness across different data characteristics and label distributions.", "section": "4.2 Real Data Experiments"}, {"figure_path": "n5lLSskwtu/tables/tables_16_1.jpg", "caption": "Table 5: The relationship between average uncertainty scores, label cardinality, and rare labels", "description": "This table shows the correlation between the average uncertainty scores (Απκ (x) and Aŷ (x)), label cardinality (number of labels per instance), and the presence of rare labels (YL1=1 or YL1=0).  It helps analyze how the uncertainty scores relate to the number of labels in an instance and whether a rare label is present, providing insights into the model's behavior for different data characteristics. Higher average uncertainty scores are observed for samples with fewer labels and those containing rare labels.", "section": "4.1 Synthetic Data Experiments"}, {"figure_path": "n5lLSskwtu/tables/tables_17_1.jpg", "caption": "Table 1: The relationship between average uncertainty scores, label cardinality, and rare labels", "description": "This table shows the correlation between three uncertainty metrics (average  Απκ (x), average Aŷ (x)), the number of labels in a sample (label cardinality), and the presence of rare labels.  It helps to understand how uncertainty is related to the characteristics of samples, particularly regarding the presence of rare labels.", "section": "4.1 Synthetic Data Experiments"}]