[{"figure_path": "Vw1V9AgPXW/figures/figures_3_1.jpg", "caption": "Figure 1: (a) Overall framework of our Satformer. (b) Details of a Satformer block. (c) Satellite network traffic data generation. (d) Details of a graph embedding module. (e) Details of an ASSIT block.", "description": "This figure provides a comprehensive overview of the Satformer architecture, detailing its various components and how they interact.  Panel (a) shows the overall encoder-decoder structure with multiple spatio-temporal modules.  Panel (b) zooms into a single Satformer block, highlighting its internal components (Graph Embedding Module, ASSIT block, MLP). Panel (c) illustrates the generation of satellite network traffic data. Panels (d) and (e) provide detailed diagrams of the graph embedding module and the adaptive sparse spatio-temporal attention (ASSIT) block, respectively.", "section": "3.2 Satformer Overview"}, {"figure_path": "Vw1V9AgPXW/figures/figures_5_1.jpg", "caption": "Figure 2: Left Details of transfer module. (a) Attention weight. (b) Attention score.", "description": "This figure shows the details of the transfer module in the Satformer architecture. The transfer module is responsible for transferring information from the encoder to the decoder. The left side shows the overall architecture of the transfer module, while the right side shows the details of how the attention weights and scores are calculated. The attention weights are calculated using a linear transformation of the query and key vectors, followed by a scaled dot-product attention mechanism. The attention scores are calculated using a softmax function. The final output of the transfer module is a linear transformation of the value vectors, weighted by the attention scores.", "section": "3.4 Transfer Module"}, {"figure_path": "Vw1V9AgPXW/figures/figures_13_1.jpg", "caption": "Figure 3: Traffic generation framework.", "description": "This figure illustrates the process of generating synthetic satellite network traffic data.  It starts with spatial information (coordinates of over 1000 ground stations from the Standard Object Database in the Satellite Tool Kit), then incorporates visibility analysis between ground stations and LEO satellites to determine access selection. Temporal dynamics are added by modeling traffic matrix sequences between ground stations based on gravity distribution and varying traffic loads across different time zones. The output is a sequence of inter-satellite traffic matrices reflecting the simulated network traffic patterns.", "section": "3.3 Spatio-Temporal Module"}, {"figure_path": "Vw1V9AgPXW/figures/figures_13_2.jpg", "caption": "Figure 4: (a) Global distribution of satellite ground stations. (b) Normalized one-day traffic variation for ground station", "description": "This figure shows the global distribution of ground stations used for satellite communication and the normalized one-day traffic variation for a typical ground station.  Panel (a) is a world map illustrating the uneven distribution of ground stations, with higher concentrations in certain regions and sparsity in others, reflecting geographical and economic factors influencing the placement of ground stations. Panel (b) displays a graph of the normalized network traffic over a 24-hour period.  This highlights the diurnal traffic variation pattern, influenced by the varying time zones and usage patterns across the globe, as traffic is highest at around midday and dips overnight.", "section": "4.1 Experimental Settings"}, {"figure_path": "Vw1V9AgPXW/figures/figures_14_1.jpg", "caption": "Figure 1: (a) Overall framework of our Satformer. (b) Details of a Satformer block. (c) Satellite network traffic data generation. (d) Details of a graph embedding module. (e) Details of an ASSIT block.", "description": "This figure shows the architecture of the Satformer model, including its encoder-decoder structure, the components of a Satformer block (graph embedding, ASSIT, and MLP modules), an example of satellite network traffic data, and detailed diagrams of the graph embedding and ASSIT modules.", "section": "3.2 Satformer Overview"}, {"figure_path": "Vw1V9AgPXW/figures/figures_18_1.jpg", "caption": "Figure 1: (a) Overall framework of our Satformer. (b) Details of a Satformer block. (c) Satellite network traffic data generation. (d) Details of a graph embedding module. (e) Details of an ASSIT block.", "description": "This figure provides a comprehensive overview of the Satformer architecture.  (a) shows the overall encoder-decoder structure, with multiple spatio-temporal modules. (b) zooms into a single Satformer block, highlighting its components: graph embedding module and ASSIT block, which includes multi-head self-attention and sparsity threshold. (c) illustrates how satellite traffic data is generated using the simulation of a constellation, focusing on the dynamic topology and incomplete data. (d) and (e) provide detailed views of the graph embedding module and ASSIT block respectively.", "section": "3.2 Satformer Overview"}, {"figure_path": "Vw1V9AgPXW/figures/figures_18_2.jpg", "caption": "Figure 7: Analysis of robustness", "description": "This figure displays the robustness analysis of the Satformer model and six baseline models across three datasets (Iridium, Telesat, and Starlink). The NMAE and NRMSE metrics are plotted against the number of time slices, which varies from 500 to 1500. The results demonstrate that Satformer consistently outperforms the baseline models in terms of both accuracy and robustness, maintaining low error rates even as the size of the dataset increases.", "section": "E Robustness Analysis"}, {"figure_path": "Vw1V9AgPXW/figures/figures_19_1.jpg", "caption": "Figure 1: (a) Overall framework of our Satformer. (b) Details of a Satformer block. (c) Satellite network traffic data generation. (d) Details of a graph embedding module. (e) Details of an ASSIT block.", "description": "This figure presents the overall architecture of the Satformer model, showing its encoder-decoder structure with multiple spatio-temporal modules.  Each module includes a graph embedding module and a Satformer block. The Satformer block incorporates an adaptive sparse spatio-temporal attention mechanism (ASSIT). The figure also illustrates how the traffic data is generated from the satellite network and the internal workings of the graph embedding and ASSIT modules. ", "section": "3.2 Satformer Overview"}, {"figure_path": "Vw1V9AgPXW/figures/figures_21_1.jpg", "caption": "Figure 1: (a) Overall framework of our Satformer. (b) Details of a Satformer block. (c) Satellite network traffic data generation. (d) Details of a graph embedding module. (e) Details of an ASSIT block.", "description": "This figure shows the architecture of the Satformer model, including the overall framework, details of the Satformer block, satellite network traffic data generation, and the graph embedding and ASSIT modules.  (a) illustrates the encoder-decoder structure with spatio-temporal modules. (b) details the internal structure of a single spatio-temporal module. (c) shows the data generation process using a simulated LEO mega-constellation. (d) and (e) provide a visual representation of the graph embedding module and adaptive sparse spatio-temporal attention (ASSIT) block, respectively.", "section": "3.2 Satformer Overview"}]