[{"figure_path": "ntF7D8tAlQ/figures/figures_8_1.jpg", "caption": "Figure 1: Risk curves for Huber and Pseudo-Huber regression with GD and SGD algorithms for the scenario (n,p) = (10000, 5000). Upper row: Huber regression, Lower row: Pseudo-Huber regression. Left column: GD, Right column: SGD.", "description": "This figure displays the risk curves for Huber and Pseudo-Huber regression using Gradient Descent (GD) and Stochastic Gradient Descent (SGD) methods.  The scenario uses a sample size (n) of 10000 and a feature dimension (p) of 5000. The top row shows results for Huber regression, while the bottom row shows results for Pseudo-Huber regression.  The left column presents the results for the GD algorithm, and the right column for SGD. Each curve shows the actual risk (||∑^1/2(b̂_t - b*)||^2), and the two estimates (r̂_t - ||ε||^2/n and r̃_t - ||ε||^2/n) with their 2 standard error bars. The graph helps in visually comparing the performance of different algorithms and evaluating the accuracy of the proposed risk estimates.", "section": "4 Simulation"}, {"figure_path": "ntF7D8tAlQ/figures/figures_8_2.jpg", "caption": "Figure 1: Risk curves for Huber and Pseudo-Huber regression with GD and SGD algorithms for the scenario (n,p) = (10000, 5000). Upper row: Huber regression, Lower row: Pseudo-Huber regression. Left column: GD, Right column: SGD.", "description": "This figure displays the risk curves for Huber and Pseudo-Huber regression using Gradient Descent (GD) and Stochastic Gradient Descent (SGD) methods.  The experiment was conducted with a sample size (n) of 10,000 and feature dimension (p) of 5,000. The top row shows results for Huber regression, while the bottom row shows results for Pseudo-Huber regression.  The left column shows results for GD, and the right column shows results for SGD. For each combination of regression type and optimization algorithm, the figure plots the actual risk (||∑<sup>1/2</sup>(b<sup>t</sup> - b*)||<sup>2</sup>), along with two estimates of this risk:  \nî<sup>t</sup> - ||ε||<sup>2</sup>/n and \nř<sup>t</sup> - ||ε||<sup>2</sup>/n, as well as their corresponding 2-standard-error bars. This visualization allows for comparison of the performance of different algorithms and the accuracy of the risk estimation methods.", "section": "4 Simulation"}, {"figure_path": "ntF7D8tAlQ/figures/figures_9_1.jpg", "caption": "Figure 1: Risk curves for Huber and Pseudo-Huber regression with GD and SGD algorithms for the scenario (n,p) = (10000, 5000). Upper row: Huber regression, Lower row: Pseudo-Huber regression. Left column: GD, Right column: SGD.", "description": "This figure displays the risk curves for Huber and Pseudo-Huber regression using Gradient Descent (GD) and Stochastic Gradient Descent (SGD) algorithms.  The results are shown for two scenarios:  (n, p) = (10000, 5000). Each plot shows the actual risk (||∑<sup>1/2</sup>(b<sub>t</sub> - b*)||<sup>2</sup>), along with two consistent estimates (î<sub>t</sub> and r̃<sub>t</sub>). The plots illustrate how the proposed estimates track the actual generalization error across different iterations of the algorithms and different regression types.  The shaded region represents the 2 standard error bars.", "section": "4 Simulation"}, {"figure_path": "ntF7D8tAlQ/figures/figures_9_2.jpg", "caption": "Figure 1: Risk curves for Huber and Pseudo-Huber regression with GD and SGD algorithms for the scenario (n,p) = (10000, 5000). Upper row: Huber regression, Lower row: Pseudo-Huber regression. Left column: GD, Right column: SGD.", "description": "This figure displays the risk curves for Huber and Pseudo-Huber regression models using Gradient Descent (GD) and Stochastic Gradient Descent (SGD) algorithms.  The simulations were run with a sample size of 10,000 and 5,000 features. The plots show the actual risk (||∑¹/²(b<sub>t</sub> - b*)||²), and two proposed estimates (r̂<sub>t</sub> - ||ε||²/n and r̃<sub>t</sub> - ||ε||²/n) of the risk. The estimates closely track the actual risk, indicating their effectiveness in estimating generalization performance at different iterations of the algorithms.", "section": "4 Simulation"}, {"figure_path": "ntF7D8tAlQ/figures/figures_12_1.jpg", "caption": "Figure 4: Risk curves for SGD applied to Huber and pseudo-Huber regression with (n,p,T) = (4000, 1000, 20), |It| = n/10 and ηt = 0.2 for all t.", "description": "This figure compares the performance of three risk estimators for SGD in Huber and pseudo-Huber regression.  The estimators are: the actual risk, ||Σ^{1/2}(b_t - b^*)||^2, and two proposed estimators, \n\n\\hat{r}_t - ||ε||^2/n and \\tilde{r}_t - ||ε||^2/n.\n\nThe plot shows the risk curves over 20 iterations.  The figure demonstrates that the proposed estimators accurately track the true risk, even when using a constant step size.", "section": "4 Simulation"}, {"figure_path": "ntF7D8tAlQ/figures/figures_12_2.jpg", "caption": "Figure 1: Risk curves for Huber and Pseudo-Huber regression with GD and SGD algorithms for the scenario (n,p) = (10000, 5000). Upper row: Huber regression, Lower row: Pseudo-Huber regression. Left column: GD, Right column: SGD.", "description": "This figure compares the performance of the proposed risk estimators (î<sub>t</sub> and r̃<sub>t</sub>) with the true risk (||Σ<sup>1/2</sup>(b̂<sub>t</sub> - b*)||<sup>2</sup>) along the trajectory of Gradient Descent (GD) and Stochastic Gradient Descent (SGD) algorithms applied to both Huber and Pseudo-Huber regression problems.  The top row shows the results for Huber regression, while the bottom row is for Pseudo-Huber regression. The left column presents results for the GD algorithm, and the right column presents those for the SGD algorithm.  Each plot shows the true risk and the proposed estimators with error bars to illustrate the accuracy of the estimators.", "section": "4 Simulation"}, {"figure_path": "ntF7D8tAlQ/figures/figures_12_3.jpg", "caption": "Figure 4: Risk curves for SGD applied to Huber and pseudo-Huber regression with (n,p,T) = (4000,1000,20), |It| = n/10 and ηt = 0.2 for all t.", "description": "This figure compares the performance of three risk estimators for SGD in Huber and pseudo-Huber regression.  The estimators are: the actual risk ||Σ<sup>1/2</sup>(b̂<sup>t</sup> - b*)||<sup>2</sup>, the proposed estimator r̂<sub>t</sub> which is computationally efficient and does not require knowledge of Σ, the proposed estimator ˜r<sub>t</sub> which requires knowledge of Σ, and the estimator r̃<sup>sub</sup><sub>t</sub> obtained by directly generalizing the method from [5], which is suboptimal. The plot shows the risk curves for both Huber and pseudo-Huber regression along the iterations of the SGD algorithm.  The results clearly indicate the superiority of the proposed estimators (r̂<sub>t</sub> and ˜r<sub>t</sub>) over the suboptimal method r̃<sup>sub</sup><sub>t</sub>, demonstrating their effectiveness in accurately tracking the true risk.", "section": "4 Simulation"}, {"figure_path": "ntF7D8tAlQ/figures/figures_12_4.jpg", "caption": "Figure 4: Risk curves for SGD applied to Huber and pseudo-Huber regression with (n,p,T) = (4000, 1000, 20), |It| = n/10 and nt = 0.2 for all t.", "description": "This figure compares the performance of three risk estimators: the proposed estimators \n`r̂t` and `r̃t` and the estimator `r̂sub` obtained by directly generalizing the approach in [5]. The plot shows that `r̂t` and `r̃t` more accurately estimate the true risk than `r̂sub` especially when the number of iterations increases.", "section": "4 Simulation"}]