[{"figure_path": "2squ766Iq4/figures/figures_1_1.jpg", "caption": "Figure 1: Illustration of extrapolation and our theoretical conditions. The horizontal axis represents the changing variable s, ranging from the source support to out-of-support regions. The vertical axis represents the observed data x living on the manifolds indexed by different values of the invariant variable c. Figure (a) demonstrates that given a point out of support it is unclear which class manifolds it belongs to. Figure (b) illustrates the dense shift condition (Theorem 4.2) where s potentially changes all pixels in the images, such as the camera angle in the example. In this case, we can identify the invariant variable c under a moderate amount of shift until the shift becomes excessive. For instance, the back view of the cat in the figure could be confused with other animals. Figure (c) illustrates the sparse shift condition (Theorem 4.4) where s influences a limited number of pixels, such as the background in the example. In contrast to the dense shift, we can identify c under the sparse shift regardless of its severity. In the figure, there is no ambiguity of the class “cow” even though the background has changed to the moon.", "description": "This figure illustrates the concept of extrapolation and the theoretical conditions for its success under different shift types.  Panel (a) shows the extrapolation problem: a target sample lies outside the source support region, making classification ambiguous. Panel (b) shows the 'dense shift' scenario, where the changing variable affects all image features (e.g., camera angle). Here, extrapolation is possible with moderate shifts, but fails with extreme ones due to ambiguity. Panel (c) shows the 'sparse shift' scenario, where changes are confined to a limited subset of features (e.g., background).  Extrapolation is robust to severe changes in this case. The figure visually explains Theorems 4.2 and 4.4, linking shift properties to extrapolation success.", "section": "1 Introduction"}, {"figure_path": "2squ766Iq4/figures/figures_1_2.jpg", "caption": "Figure 1: Illustration of extrapolation and our theoretical conditions. The horizontal axis represents the changing variable s, ranging from the source support to out-of-support regions. The vertical axis represents the observed data x living on the manifolds indexed by different values of the invariant variable c. Figure (a) demonstrates that given a point out of support it is unclear which class manifolds it belongs to. Figure (b) illustrates the dense shift condition (Theorem 4.2) where s potentially changes all pixels in the images, such as the camera angle in the example. In this case, we can identify the invariant variable c under a moderate amount of shift until the shift becomes excessive. For instance, the back view of the cat in the figure could be confused with other animals. Figure (c) illustrates the sparse shift condition (Theorem 4.4) where s influences a limited number of pixels, such as the background in the example. In contrast to the dense shift, we can identify c under the sparse shift regardless of its severity. In the figure, there is no ambiguity of the class “cow” even though the background has changed to the moon.", "description": "This figure illustrates the concept of extrapolation and the theoretical conditions proposed in the paper.  It shows how changes in the changing variable (s) affect the observed data (x) which lie on manifolds indexed by the invariant variable (c). Panel (a) depicts the challenge of extrapolation: given an out-of-support sample, it's difficult to determine the correct class manifold. Panel (b) shows that with dense shifts (affecting all image pixels), identifying the invariant variable is possible only with moderate shifts.  Panel (c) illustrates that with sparse shifts (affecting only a few pixels), the invariant variable can be identified even with large shifts.", "section": "1 Introduction"}, {"figure_path": "2squ766Iq4/figures/figures_3_1.jpg", "caption": "Figure 2: The data-generating process. The invariant latent variable c and the changing latent variable s jointly generate the observed variable x. The dashed line indicates potential statistical dependence.", "description": "This figure illustrates the causal model used in the paper to represent the data generation process.  The latent variable  `c` represents invariant information shared between the source and target distributions. The latent variable `s` represents the changing factor that distinguishes the source and target data.  The variable x is the observed data, and y is the label. The arrows represent causal relationships, indicating that `c` causally influences both `x` and `y`, while `s` only influences `x`. The dashed line between `c` and `s` suggests a potential statistical dependence, but not necessarily a causal relationship.", "section": "3 Extrapolation and Latent-Variable Identification"}, {"figure_path": "2squ766Iq4/figures/figures_9_1.jpg", "caption": "Figure 3: TTA classification errors under different levels of shift severity levels and scopes.", "description": "This figure shows the classification error rates obtained by the TENT method under different levels of noise (severity) and different sizes of corrupted regions (scope) in CIFAR-10 images.  The x-axis represents the size of the corrupted region (block size), and the y-axis represents the classification error. Each line represents a different noise level, ranging from Level 1 (least severe) to Level 10 (most severe).  The results demonstrate that the error rate increases with both increasing noise level and increasing block size.  In particular, for larger block sizes (dense shifts), the error rate significantly increases with severity, while for smaller block sizes (sparse shifts), the error rate remains relatively constant across severity levels.  This illustrates the trade-off between the shift scope and severity as described in the paper.", "section": "6.3 Shift Scope and Severity"}]