[{"figure_path": "PhLlE8UOEv/tables/tables_21_1.jpg", "caption": "Table 1: Sliced Wasserstein distance for Gaussian mixture prior for degenerate case", "description": "The table presents the results of applying the proposed tilted transport method to a Gaussian mixture model with varying dimensionality (d) and reduced observation dimensionality (d'). The results are compared against those obtained using Langevin dynamics and the HMC sampler, demonstrating the improved sampling performance of the proposed method. Specifically, the table shows the sliced Wasserstein distances between the samples generated by each method and the true posterior distribution. The results showcase the effectiveness of the proposed tilted transport approach in efficiently sampling the posterior distribution, even in high-dimensional settings.", "section": "E Numerical Experiments"}, {"figure_path": "PhLlE8UOEv/tables/tables_23_1.jpg", "caption": "Table 1: Sliced Wasserstein distance for Gaussian mixture prior for degenerate case", "description": "This table presents the results of a Gaussian mixture model experiment comparing the performance of Langevin dynamics and the proposed tilted transport method in posterior sampling. It showcases the sliced Wasserstein distance, a metric evaluating the similarity between the generated samples and the true posterior distribution.  The table includes results for different dimensionality (d), and scenarios with reduced observation dimensions (d'=0.9d and d'=1). The results show that the tilted transport method consistently outperforms Langevin dynamics, especially when the observation dimensionality is significantly reduced.", "section": "E Numerical Experiments"}, {"figure_path": "PhLlE8UOEv/tables/tables_23_2.jpg", "caption": "Table 2: Performance for tasks on FFHQ Dataset.", "description": "This table presents the performance comparison between the DMPS method and the DMPS method boosted by tilted transport on four image processing tasks (denoising, inpainting, super-resolution, and deblurring) using the Flickr-Faces-HQ (FFHQ) dataset.  The metrics used for comparison are Peak Signal-to-Noise Ratio (PSNR), Structural Similarity Index (SSIM), and Learned Perceptual Image Patch Similarity (LPIPS). Higher PSNR and SSIM values and lower LPIPS values indicate better image quality.", "section": "E.2 Imaging Problems"}]