[{"figure_path": "oLcPadFrY3/tables/tables_7_1.jpg", "caption": "Table 1: Comparison between AdaPKCs and PeakConv. The best and secondary results are marked with bold and underline, correspondingly. Frame rate is calculated on a workstation with an Intel(R) Xeon(R) Platinum 8255C CPU and a Tesla V100-SXM2 GPU.", "description": "This table compares the performance of AdaPKC and its two variants (AdaPKC<sup>s</sup> and AdaPKC<sup>θ</sup>) against the original PeakConv method.  The comparison includes model parameters, frames per second (FPS), and the mean Intersection over Union (mIoU) and Dice scores for both Range-Doppler (RD) and Range-Angle (RA) views.  The results highlight the improved performance of AdaPKC compared to PeakConv, particularly in the RA view.", "section": "4.2 Investigation of AdaPKC Mechanism"}, {"figure_path": "oLcPadFrY3/tables/tables_8_1.jpg", "caption": "Table 2: The effectiveness of manual PRF adjustment in PKC.  bG represents guard bandwidth in range dimension.", "description": "This table presents the results of an experiment evaluating the impact of manually adjusting the PeakConv (PKC) receptive field (PRF) on radar semantic segmentation performance.  Different guard bandwidth values in the range dimension (bG) were tested while keeping the angle and Doppler guard bandwidths fixed at 1. The results demonstrate that manually adjusting the PRF can improve the performance compared to a fixed PRF but is less effective than the proposed adaptive method, AdaPKC.", "section": "4.2 Investigation of AdaPKC Mechanism"}, {"figure_path": "oLcPadFrY3/tables/tables_8_2.jpg", "caption": "Table 1: Comparison between AdaPKCs and PeakConv. The best and secondary results are marked with bold and underline, correspondingly. Frame rate is calculated on a workstation with an Intel(R) Xeon(R) Platinum 8255C CPU and a Tesla V100-SXM2 GPU.", "description": "This table compares the performance of AdaPKC and AdaPKC<sup>θ</sup> against the original PeakConv model.  It shows that both AdaPKC versions significantly improve upon PeakConv, particularly in the RA view, while maintaining comparable computational costs and inference speed. The results highlight AdaPKC's effectiveness in handling situations with ambiguous frequency responses.", "section": "4.2 Investigation of AdaPKC Mechanism"}, {"figure_path": "oLcPadFrY3/tables/tables_8_3.jpg", "caption": "Table 1: Comparison between AdaPKCs and PeakConv. The best and secondary results are marked with bold and underline, correspondingly. Frame rate is calculated on a workstation with an Intel(R) Xeon(R) Platinum 8255C CPU and a Tesla V100-SXM2 GPU.", "description": "This table compares the performance of AdaPKC and AdaPKC⁰ with PeakConv, showing the model parameters, frames per second, and mean IoU and Dice scores for both RD and RA views.  The superior performance of AdaPKC and AdaPKC⁰, particularly in the RA view, is highlighted.", "section": "4.2 Investigation of AdaPKC Mechanism"}, {"figure_path": "oLcPadFrY3/tables/tables_8_4.jpg", "caption": "Table 1: Comparison between AdaPKCs and PeakConv. The best and secondary results are marked with bold and underline, correspondingly. Frame rate is calculated on a workstation with an Intel(R) Xeon(R) Platinum 8255C CPU and a Tesla V100-SXM2 GPU.", "description": "This table compares the performance of AdaPKC and AdaPKC<sup>0</sup> with PeakConv in terms of mIoU, mDice, GMACs, and FPS on the CARRADA dataset.  It highlights the improved performance of AdaPKC models, especially in the RA view, with minimal increase in computational cost and speed.", "section": "4.2 Investigation of AdaPKC Mechanism"}, {"figure_path": "oLcPadFrY3/tables/tables_8_5.jpg", "caption": "Table 6: RSS performance comparison on KuRALS. Detailed results by category are presented in Appendix F.4.", "description": "This table compares the performance of different models on the KuRALS dataset for radar semantic segmentation.  It shows the model parameters, frames used, mean Intersection over Union (mIoU), and mean Dice score (mDice) for various models, including baselines and models using AdaPKC. The results demonstrate the improved performance of AdaPKC-based models in this specific application scenario.", "section": "4.4 RSS Performance on KuRALS"}, {"figure_path": "oLcPadFrY3/tables/tables_17_1.jpg", "caption": "Table 1: Comparison between AdaPKCs and PeakConv. The best and secondary results are marked with bold and underline, correspondingly. Frame rate is calculated on a workstation with an Intel(R) Xeon(R) Platinum 8255C CPU and a Tesla V100-SXM2 GPU.", "description": "This table compares the performance of AdaPKC and AdaPKC<sup>o</sup> with PeakConv on a workstation with an Intel(R) Xeon(R) Platinum 8255C CPU and a Tesla V100-SXM2 GPU.  The best and second-best results for mIoU and mDice are highlighted for both RD and RA views.  The number of parameters, frame rate, and GMACs are also provided for each model.", "section": "4.2 Investigation of AdaPKC Mechanism"}, {"figure_path": "oLcPadFrY3/tables/tables_17_2.jpg", "caption": "Table 1: Comparison between AdaPKCs and PeakConv. The best and secondary results are marked with bold and underline, correspondingly. Frame rate is calculated on a workstation with an Intel(R) Xeon(R) Platinum 8255C CPU and a Tesla V100-SXM2 GPU.", "description": "This table compares the performance of AdaPKC and AdaPKC<sup>o</sup> against the baseline PeakConv model.  It shows that both AdaPKC versions significantly improve upon PeakConv in terms of mIoU and mDice, especially in the RA view. The table also provides the number of parameters, frames per second (FPS), and GMACS (giga-multiply-accumulate operations per second) for each model, giving a comprehensive performance comparison.", "section": "4.2 Investigation of AdaPKC Mechanism"}, {"figure_path": "oLcPadFrY3/tables/tables_18_1.jpg", "caption": "Table 2: The effectiveness of manual PRF adjustment in PKC.  bf represents guard bandwidth in range dimension.", "description": "This table presents the results of an experiment evaluating the impact of manually adjusting the Peak Receptive Field (PRF) in the PeakConv (PKC) method on radar semantic segmentation performance. It shows the mean Intersection over Union (mIoU) and mean Dice coefficient (mDice) for the RD and RA views with different guard bandwidth settings in the range dimension. The results demonstrate that manually adjusting the PRF can improve performance, but highlights the challenge and limitations of this manual approach.", "section": "4.2 Investigation of AdaPKC Mechanism"}, {"figure_path": "oLcPadFrY3/tables/tables_19_1.jpg", "caption": "Table 1: Comparison between AdaPKCs and PeakConv. The best and secondary results are marked with bold and underline, correspondingly. Frame rate is calculated on a workstation with an Intel(R) Xeon(R) Platinum 8255C CPU and a Tesla V100-SXM2 GPU.", "description": "This table compares the performance of AdaPKC and PeakConv models in terms of mIoU, mDice, GMACs, and FPS for both RD and RA views.  It highlights the improvement achieved by AdaPKC over PeakConv in terms of accuracy (mIoU and mDice) while maintaining a relatively similar computational cost (GMACS) and frames per second (FPS).  The results showcase AdaPKC's effectiveness in radar semantic segmentation.", "section": "4.2 Investigation of AdaPKC Mechanism"}, {"figure_path": "oLcPadFrY3/tables/tables_20_1.jpg", "caption": "Table 1: Comparison between AdaPKCs and PeakConv. The best and secondary results are marked with bold and underline, correspondingly. Frame rate is calculated on a workstation with an Intel(R) Xeon(R) Platinum 8255C CPU and a Tesla V100-SXM2 GPU.", "description": "This table compares the performance of AdaPKC and AdaPKC<sup>o</sup> with PeakConv on a workstation.  It shows the number of parameters, frame rate (FPS), and mIoU/mDice scores for RD and RA views.  The best and second-best results are highlighted.", "section": "4.2 Investigation of AdaPKC Mechanism"}, {"figure_path": "oLcPadFrY3/tables/tables_22_1.jpg", "caption": "Table 1: Comparison between AdaPKCs and PeakConv. The best and secondary results are marked with bold and underline, correspondingly. Frame rate is calculated on a workstation with an Intel(R) Xeon(R) Platinum 8255C CPU and a Tesla V100-SXM2 GPU.", "description": "This table compares the performance of AdaPKC and AdaPKC<sup>o</sup> with PeakConv on a workstation with an Intel(R) Xeon(R) Platinum 8255C CPU and a Tesla V100-SXM2 GPU.  The results show the number of parameters, frames per second (FPS), mean IoU (mIoU), and mean Dice coefficient (mDice) for each method in both RD and RA views.", "section": "4.2 Investigation of AdaPKC Mechanism"}]