[{"figure_path": "Nb5xlelV0C/tables/tables_7_1.jpg", "caption": "Table 1: Quantitative results of conditional interpolation. Quantitative results where the best performance is marked as (*) and the worst is marked as red. (a) Performance on CIFAR-10 and LAION-Aesthetics. AID-O and AID-I both show significant improvement over the Text Embedding Interpolation (TEI). Though Denoising Interpolation (DI) achieves relatively high fidelity, there is a trade-off with very bad performance on consistency (0.4295). AID-O boosts the performance in terms of consistency and fidelity while AID-I boosts the performance of smoothness; (b) Ablation studies on AID-O's components, showcase that the Beta prior enhances smoothness, attention interpolation heightens consistency, and self-attention fusion significantly elevates fidelity.", "description": "This table presents a quantitative comparison of different conditional interpolation methods on two datasets: CIFAR-10 and LAION-Aesthetics.  The methods compared are Text Embedding Interpolation (TEI), Denoising Interpolation (DI), AID-O, and AID-I. The table shows the smoothness, consistency, and fidelity for each method on each dataset.  Part (b) shows the results of ablation studies on AID-O, demonstrating the impact of different components of the method on the overall performance.", "section": "5.1 Conditional Interpolation"}, {"figure_path": "Nb5xlelV0C/tables/tables_8_1.jpg", "caption": "Table 1: Quantitative results of conditional interpolation. Quantitative results where the best performance is marked as (*) and the worst is marked as red. (a) Performance on CIFAR-10 and LAION-Aesthetics. AID-O and AID-I both show significant improvement over the Text Embedding Interpolation (TEI). Though Denoising Interpolation (DI) achieves relatively high fidelity, there is a trade-off with very bad performance on consistency (0.4295). AID-O boosts the performance in terms of consistency and fidelity while AID-I boosts the performance of smoothness; (b) Ablation studies on AID-O's components, showcase that the Beta prior enhances smoothness, attention interpolation heightens consistency, and self-attention fusion significantly elevates fidelity.", "description": "This table presents a quantitative evaluation of different conditional interpolation methods.  Part (a) compares AID-O, AID-I, Text Embedding Interpolation (TEI), and Denoising Interpolation (DI) across two datasets (CIFAR-10 and LAION-Aesthetics), measuring smoothness, consistency, and fidelity.  Part (b) shows an ablation study on AID-O, analyzing the impact of its key components (Beta prior, attention interpolation, and self-attention fusion) on the evaluation metrics.", "section": "5.1 Conditional Interpolation"}]