[{"figure_path": "Y79L45D5ts/tables/tables_7_1.jpg", "caption": "Table 1: Summary of different properties of reference molecules and molecules generated by baselines and our methods under the dual-target setting. (↑) / (↓) denotes a larger / smaller number is better. Top 2 results are highlighted with bold text and underlined text, respectively.", "description": "This table compares the performance of different methods for dual-target drug design.  It shows various properties of reference molecules and those generated by different methods, including binding affinity to each target (P-1 Vina Dock, P-2 Vina Dock, Max Vina Dock), the percentage of molecules with higher binding affinity than the reference (Dual High Aff.), and other properties like drug-likeness (QED), synthesizability (SA), and diversity.  Higher values are generally better for most metrics except for Vina Dock scores.", "section": "4.2 Main Results"}, {"figure_path": "Y79L45D5ts/tables/tables_8_1.jpg", "caption": "Table 1: Summary of different properties of reference molecules and molecules generated by baselines and our methods under the dual-target setting. (↑) / (↓) denotes a larger / smaller number is better. Top 2 results are highlighted with bold text and underlined text, respectively.", "description": "This table summarizes the performance of different methods (including baselines and the proposed methods) for dual-target drug design.  It compares various properties of the generated molecules against reference molecules, including binding affinities to the primary and secondary targets (P-1 Vina Dock, P-2 Vina Dock, Max Vina Dock), the percentage of molecules achieving higher binding affinity than the references in both targets (Dual High Aff.),  and measures of drug-likeness (QED, SA, and Diversity).  Higher values are better for QED, SA, Dual High Aff, and Diversity, while lower values are better for docking scores.  The table helps to assess the effectiveness of different methods in generating molecules suitable for dual-target drug design.", "section": "4.2 Main Results"}, {"figure_path": "Y79L45D5ts/tables/tables_8_2.jpg", "caption": "Table 1: Summary of different properties of reference molecules and molecules generated by baselines and our methods under the dual-target setting. (↑) / (↓) denotes a larger / smaller number is better. Top 2 results are highlighted with bold text and underlined text, respectively.", "description": "This table summarizes the performance of various methods (baselines and the proposed methods) in dual-target drug design. It compares several key properties of the generated molecules against those of reference molecules, including binding affinity to each target (P-1 Vina Dock, P-2 Vina Dock), the highest binding affinity across both targets (Max Vina Dock), the percentage of generated molecules exceeding reference molecule affinity on both targets (Dual High Aff.), drug-likeness (QED), synthesizability (SA), and molecular diversity.  Higher scores generally indicate better performance, with the direction specified by the arrows (↑ or ↓).", "section": "4.2 Main Results"}, {"figure_path": "Y79L45D5ts/tables/tables_15_1.jpg", "caption": "Table 4: Summary of different properties of reference molecules and molecules generated by baselines under the single-target setting. (↑) / (↓) denotes a larger / smaller number is better. Considering outliers significantly affect the mean, we ignore some abnormal values of Vina Score and Vina Min.", "description": "This table presents the performance comparison of reference molecules and molecules generated by two baseline methods (Pocket2Mol and TargetDiff) under the single-target drug design setting.  The metrics evaluated include Vina Score (binding affinity), Vina Min (minimum energy after minimization), Vina Dock (highest binding affinity after re-docking), High Affinity (proportion of molecules with higher affinity than the reference molecule), QED (drug-likeness score), SA (synthesizability score), and Diversity. The table highlights the performance differences between the baseline models and the reference molecules in terms of these relevant properties.", "section": "4.2 Main Results"}]