[{"figure_path": "HmMSBhMAw4/tables/tables_2_1.jpg", "caption": "Table 1: Performance of converged periodic policies.", "description": "This table presents the performance of periodic policies with different periods (L).  The optimal performance J*L for each period L is shown.  The performance was obtained by conducting a brute-force search over all deterministic periodic policies with a period up to 10 in a specific example POMDP. It highlights how the performance of periodic policies can outperform stationary policies in certain partially observable Markov decision processes (POMDPs) and illustrates the relationship between period length and performance.", "section": "Comparison of converged policies"}, {"figure_path": "HmMSBhMAw4/tables/tables_6_1.jpg", "caption": "Table 1: Performance of converged periodic policies.", "description": "This table presents the performance of periodic policies obtained by using three different behavioral policies (µ1, µ2, µ3) in PASQL.  The optimal performance (J*2) achievable by a period-2 policy is also shown for comparison. The results demonstrate the impact of the behavioral policy on the performance of the resulting periodic policy.  Policy µ1 achieves the optimal performance, while µ2 and µ3 show significantly lower performance.", "section": "Comparison of converged policies"}, {"figure_path": "HmMSBhMAw4/tables/tables_6_2.jpg", "caption": "Table 2: Performance of converged stationary policies.", "description": "This table presents the performance comparison between the optimal stationary policy and the greedy policies obtained from ASQL under different behavioral policies.  The optimal performance is calculated by a brute-force search across all possible stationary deterministic agent-state policies. The performance of the greedy policies from ASQL are calculated via policy evaluation over all the states and agent states.", "section": "Comparison of converged policies"}, {"figure_path": "HmMSBhMAw4/tables/tables_30_1.jpg", "caption": "Table 1: Performance of converged periodic policies.", "description": "This table presents the performance of converged periodic policies (PASQL) with period L=2 and three different behavioral policies (μ₁, μ₂, μ₃).  It compares the performance (J) of these policies to the optimal performance (J*) achievable by a period-2 deterministic agent-state policy found through a brute-force search. The results show the impact of the behavioral policy on the performance of the learned periodic policy.", "section": "3 Numerical experiments"}]