{"importance": "This paper is crucial because **it bridges the gap between contextual linear optimization (CLO) theory and practical application** by addressing the realistic scenario of bandit feedback.  It offers **novel algorithms, theoretical guarantees, and practical insights**, pushing the boundaries of CLO research and enabling more effective decision-making in various real-world settings with limited data.", "summary": "This paper introduces induced empirical risk minimization for contextual linear optimization with bandit feedback, providing theoretical guarantees and computationally tractable solutions for improved decision-making.", "takeaways": ["A new class of offline learning algorithms for contextual linear optimization (CLO) with bandit feedback is proposed, termed induced empirical risk minimization (IERM).", "A fast-rate regret bound for IERM is proven, accommodating misspecified model classes and flexible optimization choices.", "Computationally tractable surrogate losses for IERM are developed, enhancing practical applicability in real-world scenarios."], "tldr": "Many real-world applications of contextual linear optimization (CLO) face the challenge of bandit feedback, where only the cost of the chosen decision is observed, not the costs of other potential choices. This limitation significantly hinders the application of existing CLO algorithms, which assume full cost observation for all potential decisions.  This makes the accurate prediction of costs and optimization of policies challenging and creates a need for new methods and theories. \nThis research addresses this challenge by proposing induced empirical risk minimization (IERM), a novel offline learning framework for CLO with bandit feedback. The core contribution of the paper is a fast-rate regret bound for IERM, demonstrating that even with partially observed data and potentially misspecified models, the algorithms can still achieve near-optimal performance.  Furthermore, computationally tractable surrogate losses are introduced to simplify the implementation of IERM, thereby making it more suitable for real-world deployment. The effectiveness of the IERM framework is numerically validated through a simulation study, demonstrating its practical utility in improving decision-making in settings with limited data availability.", "affiliation": "Tsinghua University", "categories": {"main_category": "AI Theory", "sub_category": "Optimization"}, "podcast_path": "lOdBHkqzRH/podcast.wav"}