[{"figure_path": "JxlQ2pbyzS/figures/figures_0_1.jpg", "caption": "Figure 1: An example of human learning, where learners individually select questions to practice. Each question tests at least one knowledge concept.", "description": "This figure illustrates a scenario of human learning where three learners (Bob, Alice, and Nancy) are working on questions related to different knowledge concepts (Function, Derivative, Number, Cube, Cone). The table shows each learner's correct/incorrect responses for a set of questions.  Each question assesses at least one concept.  The figure highlights the idea that learners with similar implicit knowledge states (understanding of concepts) exhibit similar performance on similar questions, which is a key idea that motivates the collaborative learner modeling approach discussed in the paper.", "section": "1 Introduction"}, {"figure_path": "JxlQ2pbyzS/figures/figures_3_1.jpg", "caption": "Figure 2: The overall framework of Coral.", "description": "This figure presents a comprehensive overview of the Coral model's architecture. It illustrates the three main stages: Disentangled Cognitive Representation Encoding, Collaborative Representation Learning, and Decoding and Reconstruction. The Disentangled Cognitive Representation Encoding stage focuses on extracting individual learner features from their practice records. The Collaborative Representation Learning stage involves constructing a graph to model connections between learners, using this graph to learn collaborative representations, and combining those with the individual learner features. Finally, the Decoding and Reconstruction stage utilizes these combined representations to predict learner performance and reconstruct the practice data. The figure effectively visualizes the flow of information and the interplay between individual and collaborative learning signals in the Coral model.", "section": "3 Coral"}, {"figure_path": "JxlQ2pbyzS/figures/figures_9_1.jpg", "caption": "Figure 3: (a) Performance in sparse scenarios. (b) Performance under cold-start scenarios. (c) Performance with different values of K. (d) Disentanglement level and its correlation with performance.", "description": "This figure presents four subfigures illustrating the performance of the Coral model under various conditions. Subfigure (a) compares the performance of Coral and other baseline models in scenarios with different levels of sparsity in the data. Subfigure (b) shows the results when the model is trained only on the data for questions that learners had not seen before in the training set, simulating a cold-start scenario. Subfigure (c) shows how the model's performance varies as the number of neighbors (K) used in the collaborative graph construction is changed. Finally, subfigure (d) displays the relationship between the level of disentanglement in the learned representations and the model's performance during the training process.", "section": "4 Experiments"}, {"figure_path": "JxlQ2pbyzS/figures/figures_9_2.jpg", "caption": "Figure 4: (a) Selected neighbors of the target learner at different steps. (b) t-SNE visualizations of learner representations colored based on knowledge concepts.", "description": "This figure visualizes the results of the collaborative graph learning in Coral. (a) shows the iterative neighbor selection process for two randomly selected learners (in red).  Each step's newly added neighbors are color-coded, illustrating how Coral progressively builds a neighborhood based on cognitive similarity.  (b) uses t-SNE to project the disentangled cognitive representations of learners onto a 2D plane, where each point represents a learner and the color corresponds to a knowledge concept. This visualization demonstrates the disentanglement of knowledge concepts in the learned representations.", "section": "3.3 Collaborative Representation Learning"}, {"figure_path": "JxlQ2pbyzS/figures/figures_9_3.jpg", "caption": "Figure 2: The overall framework of Coral.", "description": "This figure presents the overall architecture of the Coral model, illustrating the three main components: Disentangled Cognitive Representation Encoding, Collaborative Representation Learning, and Decoding and Reconstruction.  The Disentangled Cognitive Representation Encoding block takes practice data as input and generates initial disentangled cognitive representations for each learner. This information is then fed into the Collaborative Representation Learning block, which constructs a context-aware collaborative graph of learners based on their cognitive similarities and extracts collaborative information.  Finally, the Decoding and Reconstruction block merges the initial cognitive states and collaborative states to achieve co-disentanglement, reconstructing the practice performance and yielding the final cognitive diagnosis.", "section": "3 Coral"}, {"figure_path": "JxlQ2pbyzS/figures/figures_20_1.jpg", "caption": "Figure 6: The prediction performance of the improved model is illustrated, with the orange bar representing the performance of the original Coral, which achieves the highest F1 score.", "description": "This figure displays the results of experiments conducted to evaluate the efficiency improvements of the Coral model. Three optimization strategies were tested: Coral with n-sample (reducing the number of learners considered in each iteration), Coral with m-selections (increasing the number of neighbors selected per iteration), and Coral with full-kit (a combination of the previous two). The x-axis represents the different configurations of these optimization strategies, and the y-axis shows the F1-score achieved. The orange bar represents the performance of the original Coral model, serving as a baseline for comparison. The results show that while the optimization strategies enhance efficiency, they also impact performance, indicating a trade-off between computational cost and accuracy.", "section": "D.2 Efficiency Improvement"}]