[{"figure_path": "IHjoPnNZb9/tables/tables_7_1.jpg", "caption": "Table 1: Comparison on ADE20K validation set. We compare our DEPICT with Segmenter and MaskFormer. The best-performing result of DEPICT is highlighted.", "description": "This table presents a comparison of the performance of the proposed DEPICT model against two state-of-the-art models, Segmenter and MaskFormer, on the ADE20K validation set.  The comparison is based on the mean Intersection over Union (mIoU), the number of parameters, and the number of floating-point operations (FLOPs). Different variants of each model, using various Vision Transformers (ViT) backbones and resolutions are included in the comparison.  The table highlights the best performing DEPICT variant for each backbone and resolution.", "section": "4.1 Segmentation Performance"}, {"figure_path": "IHjoPnNZb9/tables/tables_7_2.jpg", "caption": "Table 2: Comparison on the validation sets of Cityscapes and Pascal Context. All are based on ViT-L.", "description": "This table compares the performance of Segmenter and DEPICT-SA on the validation sets of the Cityscapes and Pascal Context datasets.  Both models use the ViT-L backbone.  The metrics reported are mean Intersection over Union (mIoU) for single-scale (ss) and multi-scale (ms) inference, the number of parameters (#params), and floating point operations (FLOPs).  DEPICT-SA achieves comparable performance to Segmenter with significantly fewer parameters and FLOPs.", "section": "4.1 Segmentation Performance"}, {"figure_path": "IHjoPnNZb9/tables/tables_15_1.jpg", "caption": "Table 1: Comparison on ADE20K validation set. We compare our DEPICT with Segmenter and MaskFormer. The best-performing result of DEPICT is highlighted.", "description": "This table compares the performance of the proposed DEPICT model with two state-of-the-art models, Segmenter and MaskFormer, on the ADE20K validation dataset.  The comparison includes metrics such as mean Intersection over Union (mIoU), the number of parameters, and FLOPs (floating point operations) for different model variants (ViT-T, ViT-S, ViT-B, ViT-L).  The best results achieved by DEPICT are highlighted.", "section": "4.1 Segmentation Performance"}]