[{"figure_path": "yW3tlSwusb/figures/figures_22_1.jpg", "caption": "Figure 1: Construction of clustering instances showing the need for interpolating linkage heuristics. We give concrete instances and target clusterings where each of two-point based linkage procedures, i.e. single, complete and median linkage, dominates the other two.", "description": "This figure shows three different clustering instances (S1, C1), (S2, C2), and (S3, C3), each with a different distribution of points and target clustering. The purpose is to demonstrate that different linkage-based clustering algorithms (single, complete, and median linkage) perform differently depending on the distribution of points, highlighting the need to interpolate or adapt the linkage procedures based on the data to optimize clustering performance.", "section": "Linkage-based clustering"}, {"figure_path": "yW3tlSwusb/figures/figures_23_1.jpg", "caption": "Figure 2: The first three levels of an example execution tree of a clustering instance on four points, with a two-parameter algorithm (P = Δ2). Successive partitions P0, P1, P2 are shown at merge levels 0, 1, and 2, respectively, and the nested shapes show cluster merges.", "description": "This figure shows an example of an execution tree for a clustering algorithm with two parameters.  Each node represents a partition of the parameter space (the set of possible algorithm parameter values). The tree's depth corresponds to the number of merge steps in the hierarchical clustering process. Each level in the tree refines the partition from the level above it, showing how the parameter space is divided into regions where the algorithm produces identical clusterings. The nested shapes within each node visualize the regions of the parameter space (polygons in this 2-parameter example) where the sequence of merges remains the same. The figure illustrates how the execution tree approach breaks down the problem of finding optimal algorithm parameters.", "section": "Linkage-based clustering"}]