[{"figure_path": "PSMBefUZa2/tables/tables_6_1.jpg", "caption": "Table 1: Performance of RLGSSL and state-of-the-art SSL algorithms with the CNN-13 network. We report the average test errors and the standard deviations of 5 trials.", "description": "This table presents a comparison of the proposed RLGSSL method against several state-of-the-art semi-supervised learning (SSL) algorithms.  The comparison is based on the average test error and standard deviation across 5 trials using the CNN-13 network architecture. Different datasets (CIFAR-10 and CIFAR-100) are used with varying numbers of labeled samples to evaluate the performance of each algorithm.  The results show that the RLGSSL consistently outperforms other methods across all settings.", "section": "4 Experiments"}, {"figure_path": "PSMBefUZa2/tables/tables_7_1.jpg", "caption": "Table 2: Performance of RLGSSL and state-of-the-art SSL algorithms with the CNN-13 network. We report the average test errors and the standard deviations of 5 trials.", "description": "This table shows the performance comparison between the proposed RLGSSL method and other state-of-the-art semi-supervised learning (SSL) algorithms on the SVHN dataset.  The CNN-13 network architecture was used. The results are presented as average test errors and their standard deviations, calculated across 5 independent trials. The table is organized to show the performance for two different numbers of labeled training samples (500 and 1000).", "section": "4.2 Comparison Results"}, {"figure_path": "PSMBefUZa2/tables/tables_7_2.jpg", "caption": "Table 1: Performance of RLGSSL and state-of-the-art SSL algorithms with the CNN-13 network. We report the average test errors and the standard deviations of 5 trials.", "description": "This table presents a comparison of the proposed RLGSSL method against various state-of-the-art semi-supervised learning (SSL) algorithms.  The comparison is performed using the CNN-13 network architecture across three benchmark datasets (CIFAR-10, CIFAR-100, and SVHN). The table shows the average test error and standard deviation obtained by each method for different numbers of labeled training samples, providing a comprehensive assessment of the performance of each model relative to RLGSSL.  The results demonstrate the superior performance of RLGSSL across various scenarios.", "section": "4 Experiments"}, {"figure_path": "PSMBefUZa2/tables/tables_8_1.jpg", "caption": "Table 4: Comparison results in terms of mean test error and standard deviation using WRN-37-2 as the backbone on STL-10.", "description": "This table presents the comparison results of various SSL methods on the STL-10 dataset, using WRN-37-2 as the backbone network.  It shows the mean test error and standard deviation for different SSL methods, including RLGSSL (the proposed method),  with a fixed number of 1,000 labeled samples. The results demonstrate the effectiveness of RLGSSL compared to other state-of-the-art methods.", "section": "4.2 Comparison Results"}]