[{"figure_path": "cIBSsXowMr/tables/tables_7_1.jpg", "caption": "Table 1: Average Accuracy (%) on Eight Datasets and Five Applications for UDA.", "description": "This table presents the average accuracy achieved by different domain adaptation methods across eight datasets and five applications.  The methods compared include several state-of-the-art unsupervised domain adaptation (UDA) techniques for time series, as well as some general UDA methods.  The results show the performance of each method on various time series classification tasks, providing a comprehensive comparison of their effectiveness.", "section": "5 Experiments"}, {"figure_path": "cIBSsXowMr/tables/tables_7_2.jpg", "caption": "Table 1: Average Accuracy (%) on Eight Datasets and Five Applications for UDA.", "description": "This table presents the average accuracy achieved by different unsupervised domain adaptation (UDA) methods across eight datasets and five applications.  It compares the performance of the proposed ACON method against several baselines, including source-only, CDAN, DeepCoral, AdaMatch, HoMM, DIRT-T, CLUDA, AdvSKM, CODATS, and RAINCOAT. The results show the average accuracy across various datasets and tasks, highlighting the superior performance of ACON in most cases.", "section": "5 Experiments"}, {"figure_path": "cIBSsXowMr/tables/tables_7_3.jpg", "caption": "Table 1: Average Accuracy (%) on Eight Datasets and Five Applications for UDA.", "description": "This table presents the average accuracy achieved by different unsupervised domain adaptation (UDA) methods across eight different datasets and five applications.  The methods include various state-of-the-art techniques and a proposed method (Ours).  The table shows the performance of each method on each dataset for each task, allowing for a comparison of their effectiveness across different scenarios.  The \"Improve(%) row shows the percentage improvement of the proposed method over the best baseline.", "section": "5 Experiments"}, {"figure_path": "cIBSsXowMr/tables/tables_8_1.jpg", "caption": "Table 4: Ablation studies: Average Accuracy (%) on UCIHAR, HHAR-P and WISDM.", "description": "This table presents the results of ablation studies conducted on three datasets: UCIHAR, HHAR-P, and WISDM.  The purpose is to evaluate the individual contribution of each component of the proposed ACON model. Each row represents a different configuration of the model, indicating which components (multi-period frequency feature learning, temporal-frequency domain mutual learning, and domain adversarial learning) were included. The table shows the average accuracy achieved by each configuration across 10 source-target domain pairs for each dataset.", "section": "5.3 Analysis"}, {"figure_path": "cIBSsXowMr/tables/tables_12_1.jpg", "caption": "Table 5: Summary of datasets.", "description": "This table presents a summary of the eight datasets used in the paper's experiments.  For each dataset, it lists the number of subjects, channels, the length of each time series sample, the number of classes, the total number of samples, and the task (GR: Gesture Recognition, FD: Machine Fault Diagnosis, MIC: Motor Imagery Classification, SSC: Sleep Stage Classification, HAR: Human Activity Recognition) associated with the dataset.", "section": "5.1 Setup"}, {"figure_path": "cIBSsXowMr/tables/tables_12_2.jpg", "caption": "Table 6: Key hyperparameters for ACON.", "description": "This table shows the key hyperparameters used for the Adversarial CO-learning Networks (ACON) model across eight different datasets.  The hyperparameters include the number of epochs for training, the batch size, and the learning rate. Each dataset has a specific set of hyperparameters optimized for its characteristics.", "section": "5.1 Setup"}, {"figure_path": "cIBSsXowMr/tables/tables_13_1.jpg", "caption": "Table 7: Classification Accuracy (%) in the source domain: Temporal domain vs. Frequency domain.", "description": "This table presents the classification accuracy results obtained using only the source domain data for both temporal and frequency features, across five different datasets (UCIHAR, HHAR-P, WISDM, CAP, FD).  It demonstrates the discriminative power of frequency features compared to temporal features within the same domain.", "section": "3.2 Discriminability of frequency feature"}, {"figure_path": "cIBSsXowMr/tables/tables_13_2.jpg", "caption": "Table 8: Classification Accuracy (%) in the target domain: Temporal domain vs. Frequency domain.", "description": "This table presents the classification accuracy results on the target domain for four different methods: Source-only-T, Source-only-F, DANN-T, and DANN-F.  Source-only-T and Source-only-F represent models trained only on the source domain's temporal and frequency features respectively, without domain adaptation. DANN-T and DANN-F employ domain adversarial learning on the temporal and frequency domains respectively, aiming to learn domain-invariant features.  The results across various datasets (UCIHAR, HHAR-P, WISDM, CAP, and FD) illustrate the relative effectiveness of utilizing temporal versus frequency features, and the impact of adversarial domain adaptation on each feature type.", "section": "3.3 Transferability of temporal feature"}, {"figure_path": "cIBSsXowMr/tables/tables_14_1.jpg", "caption": "Table 9: Ablation study on different modules: Average Accuracy (%) on UCIHAR, HHAR-P and WISDM.", "description": "This table presents the ablation study results on three datasets (UCIHAR, HHAR-P, and WISDM) to evaluate the effectiveness of each module in the ACON model.  The rows represent different configurations of the model, showing which modules (multi-period frequency feature learning, temporal-frequency domain mutual learning, and domain adversarial learning) are enabled or disabled. The columns represent the datasets and the average accuracy across the datasets. This helps to understand the individual and combined contributions of each component to the model's overall performance.", "section": "5.3 Analysis"}, {"figure_path": "cIBSsXowMr/tables/tables_14_2.jpg", "caption": "Table 9: Ablation study on different modules: Average Accuracy (%) on UCIHAR, HHAR-P and WISDM.", "description": "This table presents the ablation study results on three datasets (UCIHAR, HHAR-P, and WISDM) to evaluate the effectiveness of different modules in the proposed ACON model.  Each row represents a variation of the ACON model with one or more modules removed or altered.  The columns show different combinations of modules included in each model variation, resulting in different accuracies on each of the three datasets. The results demonstrate the contributions of each module (multi-period frequency feature learning, temporal-frequency domain mutual learning, and domain adversarial learning in temporal-frequency correlation subspace) to the overall performance.", "section": "5.3 Analysis"}, {"figure_path": "cIBSsXowMr/tables/tables_15_1.jpg", "caption": "Table 1: Average Accuracy (%) on Eight Datasets and Five Applications for UDA.", "description": "This table presents the average accuracy achieved by different unsupervised domain adaptation (UDA) methods across eight datasets and five applications.  The methods include several state-of-the-art baselines as well as the proposed ACON method. The datasets represent a range of time series classification tasks, including gesture recognition (GR), motor imagery classification (MIC), sleep stage classification (SSC), human activity recognition (HAR), and machine fault diagnosis (MFD). Each dataset has various source-target domain pairs, and the results are averaged for each task.", "section": "5 Experiments"}, {"figure_path": "cIBSsXowMr/tables/tables_16_1.jpg", "caption": "Table 1: Average Accuracy (%) on Eight Datasets and Five Applications for UDA.", "description": "This table presents the average accuracy achieved by different unsupervised domain adaptation (UDA) methods across eight different datasets and five common applications.  The 'Source-only' row shows the performance of a model trained only on the source domain without domain adaptation, providing a baseline.  Other rows represent various UDA methods, including those specifically designed for time-series data, and the 'Ours' row indicates the performance of the proposed ACON method. The table allows for comparison of the effectiveness of different UDA techniques across diverse datasets and tasks.  Improvement percentages compared to the baseline are also given.", "section": "5 Experiments"}, {"figure_path": "cIBSsXowMr/tables/tables_16_2.jpg", "caption": "Table 1: Average Accuracy (%) on Eight Datasets and Five Applications for UDA.", "description": "This table presents the average accuracy achieved by various Unsupervised Domain Adaptation (UDA) methods and a proposed method (ACON) across eight different datasets and five application tasks.  The results showcase the performance of ACON in comparison to existing state-of-the-art UDA techniques.", "section": "5 Experiments"}, {"figure_path": "cIBSsXowMr/tables/tables_16_3.jpg", "caption": "Table 1: Average Accuracy (%) on Eight Datasets and Five Applications for UDA.", "description": "This table presents the average accuracy achieved by the proposed ACON model and several baseline methods across eight different time series datasets and five common applications (gesture recognition, sleep stage classification, motor imagery classification, human activity recognition, and machine fault diagnosis).  It demonstrates the superior performance of ACON in unsupervised domain adaptation (UDA) tasks by comparing its accuracy against other state-of-the-art UDA and general domain adaptation methods.", "section": "5 Experiments"}, {"figure_path": "cIBSsXowMr/tables/tables_16_4.jpg", "caption": "Table 1: Average Accuracy (%) on Eight Datasets and Five Applications for UDA.", "description": "This table presents the average accuracy achieved by different unsupervised domain adaptation (UDA) methods across eight datasets and five application tasks.  The \"Source-only\" row shows the performance of a model trained only on the source domain without domain adaptation. The other rows represent various UDA approaches, including the proposed ACON method. The table compares the performance of different methods across different datasets and tasks, highlighting the effectiveness of the ACON method in improving accuracy on various time-series classification tasks.", "section": "5 Experiments"}, {"figure_path": "cIBSsXowMr/tables/tables_17_1.jpg", "caption": "Table 1: Average Accuracy (%) on Eight Datasets and Five Applications for UDA.", "description": "This table presents the average accuracy achieved by different unsupervised domain adaptation (UDA) methods across eight datasets and five applications.  The methods compared include several state-of-the-art baselines for UDA in time series, as well as some general UDA methods.  The results show the performance of each method on various tasks like gesture recognition, sleep stage classification, and human activity recognition.  The 'Source-only' row indicates the accuracy achieved without using any domain adaptation techniques, providing a baseline for comparison. The table highlights the superior performance of the proposed ACON method across most datasets and applications.", "section": "5 Experiments"}, {"figure_path": "cIBSsXowMr/tables/tables_17_2.jpg", "caption": "Table 17: Average Macro-F1 Score on Eight Datasets and Five Applications for UDA.", "description": "This table shows the average macro-F1 scores achieved by different domain adaptation methods across eight datasets and five applications.  It provides a comprehensive comparison of the performance of various methods (Source-only, CDAN, DeepCoral, AdaMatch, HoMM, DIRT-T, CLUDA, AdvSKM, CODATS, RAINCOAT, and the authors' proposed ACON method) on different tasks such as Gesture Recognition (GR), Motor Imagery Classification (MIC), Sleep Stage Classification (SSC), Human Activity Recognition (HAR), and Machine Fault Diagnosis (MFD).  The results are presented for several datasets: EMG, FD, PCL, UCIHAR, HHAR-P, WISDM, HHAR-D, and CAP. The macro-F1 score is a useful metric for evaluating the performance of a classification model, particularly when dealing with imbalanced datasets.", "section": "5.2 Results"}, {"figure_path": "cIBSsXowMr/tables/tables_17_3.jpg", "caption": "Table 1: Average Accuracy (%) on Eight Datasets and Five Applications for UDA.", "description": "This table presents the average accuracy achieved by different unsupervised domain adaptation (UDA) methods across eight time series datasets and five applications.  The datasets represent various tasks like gesture recognition, sleep stage classification, human activity recognition, motor imagery classification, and machine fault diagnosis.  The table compares the proposed ACON method against several state-of-the-art baselines, both general-purpose domain adaptation methods and methods specifically designed for time series data.  The results demonstrate the superior performance of the ACON method in most scenarios.", "section": "5 Experiments"}, {"figure_path": "cIBSsXowMr/tables/tables_17_4.jpg", "caption": "Table 1: Average Accuracy (%) on Eight Datasets and Five Applications for UDA.", "description": "This table presents the average accuracy achieved by various unsupervised domain adaptation (UDA) methods across eight different time series datasets and five distinct applications.  The methods are compared against a baseline (Source-only) that doesn't utilize domain adaptation techniques. The five applications include gesture recognition (GR), motor imagery classification (MIC), human activity recognition (HAR), sleep stage classification (SSC), and machine fault diagnosis (MFD).  The results highlight the performance improvement achieved by incorporating domain adaptation techniques, particularly the proposed ACON method. ", "section": "5 Experiments"}, {"figure_path": "cIBSsXowMr/tables/tables_18_1.jpg", "caption": "Table 1: Average Accuracy (%) on Eight Datasets and Five Applications for UDA.", "description": "This table presents the average accuracy achieved by different Unsupervised Domain Adaptation (UDA) methods across eight diverse time series datasets and five common applications.  It compares the performance of ACON against several state-of-the-art baselines and general UDA methods, highlighting the superior performance of ACON in various time series classification tasks.", "section": "5 Experiments"}, {"figure_path": "cIBSsXowMr/tables/tables_18_2.jpg", "caption": "Table 17: Average Macro-F1 Score on Eight Datasets and Five Applications for UDA.", "description": "This table shows the average Macro-F1 scores achieved by different domain adaptation methods (including the proposed ACON) across eight benchmark time series datasets and five common applications.  The results provide a comprehensive evaluation of the methods' performance in various real-world scenarios, comparing the proposed ACON against state-of-the-art baselines.", "section": "5.2 Results"}, {"figure_path": "cIBSsXowMr/tables/tables_18_3.jpg", "caption": "Table 3: Accuracy (%) on HHAR-P for unsupervised domain adaptation.", "description": "This table presents the accuracy results of different domain adaptation methods on the HHAR-P dataset.  The rows represent different methods (Source-only, CDAN, DeepCoral, AdaMatch, HoMM, DIRT-T, CLUDA, AdvSKM, CODATS, RAINCOAT, and the proposed ACON method), and the columns represent different source-target domain pairs (0-2, 1-6, 2-4, 4-0, 4-5, 5-1, 5-2, 7-2, 7-5, 8-4). The \"Avg\" column shows the average accuracy across all domain pairs for each method.  The table demonstrates the performance of ACON compared to other state-of-the-art domain adaptation methods for time series data.", "section": "5 Experiments"}, {"figure_path": "cIBSsXowMr/tables/tables_18_4.jpg", "caption": "Table 25: Macro-F1 Score on HHAR-D for unsupervised domain adaptation.", "description": "This table presents the Macro-F1 scores achieved by different domain adaptation methods on the HHAR-D dataset for unsupervised domain adaptation.  The rows represent different methods (Source-only, CDAN, DeepCoral, AdaMatch, HOMM, DIRT-T, CLUDA, AdvSKM, CODATS, RAINCOAT, and the proposed ACON method). The columns represent the Macro-F1 scores for various source-target domain pairs.  The average Macro-F1 score across all domain pairs is provided in the final column.  This table allows for a comparison of the performance of various methods on a specific dataset and task.", "section": "5.2 Results"}, {"figure_path": "cIBSsXowMr/tables/tables_19_1.jpg", "caption": "Table 1: Average Accuracy (%) on Eight Datasets and Five Applications for UDA.", "description": "This table presents the average accuracy achieved by different unsupervised domain adaptation (UDA) methods across eight diverse time series datasets and five distinct applications.  The 'Source-only' row shows the performance of a model trained only on the source domain data, providing a baseline for comparison.  The remaining rows display the performance of various UDA methods, including the proposed ACON model.  The final row, 'Improve(%)', indicates the percentage improvement of the proposed ACON method over the best performing baseline method.", "section": "5 Experiments"}]