[{"figure_path": "b7hmPlOqr8/tables/tables_7_1.jpg", "caption": "Table 1: Performance comparison between the proposed FADA and existing DGSS methods. C: CityScapes [16]; B: BDD-100K [76]; M: Mapillary [51]; S: SYNTHIA [64]; G: GTA5 [63]. '-': results were not reported and official source code is not available; '*': only reported one decimal official results; '†': re-implementation with official source code under all default settings. Evaluation metric is mIoU in %. Top three results are highlighted as best, second and third, respectively.", "description": "This table presents a comparison of the proposed Frequency-Adapted Domain Generalized Semantic Segmentation (FADA) method against several existing state-of-the-art Domain Generalized Semantic Segmentation (DGSS) methods across five benchmark datasets (Cityscapes, BDD100K, Mapillary, SYNTHIA, GTA5).  The results are shown for three different experimental settings, indicating which dataset is used as the source domain for training and the remaining four as target domains. The mean Intersection over Union (mIoU) metric is used to evaluate the performance.  The table highlights the top three performing methods for each setting, indicating the superiority of the proposed FADA method.", "section": "5.2 Comparison with State-of-the-art DGSS Methods"}, {"figure_path": "b7hmPlOqr8/tables/tables_7_2.jpg", "caption": "Table 1: Performance comparison between the proposed FADA and existing DGSS methods. C: CityScapes [16]; B: BDD-100K [76]; M: Mapillary [51]; S: SYNTHIA [64]; G: GTA5 [63]. '-': results were not reported and official source code is not available; '*': only reported one decimal official results; '†': re-implementation with official source code under all default settings. Evaluation metric is mIoU in %. Top three results are highlighted as best, second and third, respectively.", "description": "This table compares the performance of the proposed Frequency-Adapted Domain Generalization Semantic Segmentation model (FADA) against several state-of-the-art methods on five benchmark datasets.  Different source domains are used with the remaining four serving as unseen target domains for evaluation.  The results are presented in terms of mean Intersection over Union (mIoU), a common metric for evaluating semantic segmentation accuracy.  The table also indicates which methods were re-implemented and which results were taken from the original papers.", "section": "5.2 Comparison with State-of-the-art DGSS Methods"}, {"figure_path": "b7hmPlOqr8/tables/tables_7_3.jpg", "caption": "Table 1: Performance comparison between the proposed FADA and existing DGSS methods. C: CityScapes [16]; B: BDD-100K [76]; M: Mapillary [51]; S: SYNTHIA [64]; G: GTA5 [63]. '-': results were not reported and official source code is not available; '*': only reported one decimal official results; '†': re-implementation with official source code under all default settings. Evaluation metric is mIoU in %. Top three results are highlighted as best, second and third, respectively.", "description": "This table compares the performance of the proposed Frequency-Adapted Domain Generalized Semantic Segmentation model (FADA) against other state-of-the-art methods across various source and target domain settings.  It shows the mean Intersection over Union (mIoU) for each setting, highlighting the top three performing methods.  The table also notes which methods had incomplete results or were re-implemented by the authors.", "section": "5.2 Comparison with State-of-the-art DGSS Methods"}, {"figure_path": "b7hmPlOqr8/tables/tables_7_4.jpg", "caption": "Table 1: Performance comparison between the proposed FADA and existing DGSS methods. C: CityScapes [16]; B: BDD-100K [76]; M: Mapillary [51]; S: SYNTHIA [64]; G: GTA5 [63]. '-': results were not reported and official source code is not available; '*': only reported one decimal official results; '†': re-implementation with official source code under all default settings. Evaluation metric is mIoU in %. Top three results are highlighted as best, second and third, respectively.", "description": "This table compares the performance of the proposed Frequency-Adapted (FADA) learning scheme against several state-of-the-art Domain Generalized Semantic Segmentation (DGSS) methods across different source and target domains.  The results are evaluated using the mean Intersection over Union (mIoU) metric, showing the superiority of FADA in various settings.", "section": "5.2 Comparison with State-of-the-art DGSS Methods"}, {"figure_path": "b7hmPlOqr8/tables/tables_16_1.jpg", "caption": "Table 6: Ablation study on the positions of the frequency adapters. GTA5 as the source domain. CityScapes, BDD and Mappilary are unseen target domains. Evaluation metric is mIoU in %. Top three results are highlighted as best, second and third, respectively.", "description": "This table presents an ablation study to analyze the impact of the position of frequency adapters in the proposed FADA model.  The experiment uses GTA5 as the source domain and CityScapes, BDD, and Mapillary as unseen target domains.  The mean Intersection over Union (mIoU) metric is used to evaluate performance. The table compares the full model, the frozen VFM baseline, REIN [69], and three variants of FADA with the frequency adapter placed in different layer positions (shallow, deep, and all layers).", "section": "5.3 Ablation Studies"}, {"figure_path": "b7hmPlOqr8/tables/tables_17_1.jpg", "caption": "Table 1: Performance comparison between the proposed FADA and existing DGSS methods. C: CityScapes [16]; B: BDD-100K [76]; M: Mapillary [51]; S: SYNTHIA [64]; G: GTA5 [63]. '-': results were not reported and official source code is not available; '*': only reported one decimal official results; '†': re-implementation with official source code under all default settings. Evaluation metric is mIoU in %. Top three results are highlighted as best, second and third, respectively.", "description": "This table compares the performance of the proposed Frequency-Adapted (FADA) method against various state-of-the-art Domain Generalized Semantic Segmentation (DGSS) methods across five datasets (Cityscapes, BDD100k, Mapillary, SYNTHIA, GTA5). The comparison is done under different experimental settings, each using one dataset as the source domain and the remaining four as target domains. The table displays the mean Intersection over Union (mIoU) scores and highlights the best performing methods for each setting.", "section": "5.2 Comparison with State-of-the-art DGSS Methods"}]