{"importance": "This paper is crucial because it significantly **reduces the labeling burden** in 3D referring segmentation, a computationally expensive and time-consuming task.  Its **single-stage approach** and use of **binary masks** make it highly efficient, paving the way for more scalable and practical applications. This approach presents a **novel solution** that will be relevant to many researchers working in computer vision, particularly those using point cloud data.  The superior performance achieved also **opens up new avenues** for efficient 3D scene understanding.", "summary": "LESS achieves state-of-the-art Referring 3D Segmentation using only binary masks, significantly reducing labeling effort and improving efficiency with a novel single-stage pipeline.", "takeaways": ["LESS achieves state-of-the-art results in 3D referring segmentation using significantly less labeling effort than previous methods.", "The single-stage approach of LESS is more efficient than prior two-stage methods, reducing both computational cost and complexity.", "LESS introduces a novel Point-Word Cross-Modal Alignment module for improved multi-modal feature alignment and area regularization to reduce background interference in 3D point clouds."], "tldr": "Referring 3D Segmentation, identifying objects in 3D point clouds using textual descriptions, is typically done in two stages: initial instance segmentation, followed by matching with the text query.  This approach is time-consuming and requires extensive annotation.  Existing methods struggle with noisy point clouds and the complexities of linguistic understanding in 3D scenes.\nThis paper proposes a novel single-stage method called LESS that directly performs referring 3D segmentation using only binary masks for supervision.  LESS uses a Point-Word Cross-Modal Alignment module, a Query Mask Predictor module, and a Query-Sentence Alignment module to align visual and linguistic information.  **Area regularization** and **point-to-point contrastive losses** are used to improve accuracy and reduce background noise. The method outperforms existing two-stage approaches on the ScanRefer dataset, demonstrating improved accuracy and significant efficiency gains.", "affiliation": "College of Computer Science and Software Engineering, Shenzhen University", "categories": {"main_category": "Natural Language Processing", "sub_category": "Vision-Language Models"}, "podcast_path": "hRqaot0NZF/podcast.wav"}