[{"figure_path": "kVuw8vzsqZ/figures/figures_6_1.jpg", "caption": "Figure 1: DelayPredict vs. SkipPredict and SPRPT in the external cost model with exponential service times and exponential predictor as described in Section 5 (a) cost vs. arrival rate with c₁ = 0.5, c₂ = 4, T = L = 1 (b) cost vs. arrival rate with c₁ = 3.5, c₂ = 4, T = L = 1 (c) cost vs. threshold (T for SkipPredict and L for DelayPredict), c₁ = 0.5, c₂ = 2, λ = 0.9.", "description": "This figure compares the performance of three scheduling policies: SkipPredict, SPRPT, and DelayPredict under the external cost model with exponentially distributed service times and an exponential predictor.  It shows cost versus arrival rate (λ) for two different cost scenarios (large and small cost gaps between cheap and expensive predictions) and cost versus the threshold (T or L) for a specific arrival rate (λ = 0.9).  The figure helps illustrate how the choice of scheduling policy and the cost of predictions impact the overall cost of the queueing system.", "section": "4.2 Skip Predict Models Comparison"}, {"figure_path": "kVuw8vzsqZ/figures/figures_8_1.jpg", "caption": "Figure 2: Cost in the server time model and in the external model using real-world datasets (a-f) vs. λ (with T = 4) (g-h) vs. T with Trinity dataset (with λ = 0.6). The default costs for the external model are c₁ = 0.5, c₂ = 20, and in the server time are c₁ = 0.05, c₂ = 0.5.", "description": "This figure compares the cost of different scheduling policies (SPRPT, FCFS, 1bit, SkipPredict) across two cost models (external cost and server time cost) using real-world datasets (TwoSigma, Google, Trinity).  Subplots (a) through (f) show the cost versus the arrival rate (λ) for each dataset and cost model, with T (threshold) fixed at 4. Subplots (g) and (h) specifically focus on the Trinity dataset and illustrate the relationship between cost and the threshold T, with the arrival rate (λ) set to 0.6. Different colors represent different scheduling policies.  The default prediction costs (c1 and c2) are specified for both models.", "section": "Experimental Results"}, {"figure_path": "kVuw8vzsqZ/figures/figures_8_2.jpg", "caption": "Figure 1: DelayPredict vs. SkipPredict and SPRPT in the external cost model with exponential service times and exponential predictor as described in Section 5 (a) cost vs. arrival rate with c₁ = 0.5, C₂ = 4, T = L = 1 (b) cost vs. arrival rate with c₁ = 3.5, C₂ = 4, T = L = 1 (c) cost vs. threshold (T for SkipPredict and L for DelayPredict), c₁ = 0.5, C₂ = 2, λ = 0.9.", "description": "This figure compares the performance of three scheduling policies: SkipPredict, DelayPredict, and SPRPT, under the external cost model with exponential service times.  The x-axis and y-axis represent the arrival rate (λ) and cost, respectively. The three subfigures show the cost-effectiveness of the policies under different parameter settings. (a) shows the effect of arrival rate on cost when there is a large difference between the cost of cheap and expensive predictions. (b) shows the impact of arrival rate on cost when the difference is small. (c) demonstrates how the choice of the threshold (T for SkipPredict and L for DelayPredict) affects the overall cost.  The results illustrate that the choice of policy significantly impacts cost-effectiveness depending on the system parameters and the cost differential between prediction types.", "section": "4.2 Skip Predict Models Comparison"}, {"figure_path": "kVuw8vzsqZ/figures/figures_9_1.jpg", "caption": "Figure 4: DelayPredict vs. SkipPredict and SPRPT in the external cost model with exponential service times and exponential predictor as described in Section 5 (a) cost vs. arrival rate with c₁ = 0.5, c₂ = 4, T = L = 1 (b) cost vs. arrival rate with c₁ = 3.5, c₂ = 4, T = L = 1 (c) cost vs. threshold (T for SkipPredict and L for DelayPredict), c₁ = 0.5, c₂ = 2, λ = 0.9.", "description": "This figure compares the performance of three scheduling policies: DelayPredict, SkipPredict, and SPRPT, under the external cost model with exponential service times and an exponential predictor.  The comparison is shown across different arrival rates (λ) and threshold values (T for SkipPredict, L for DelayPredict). Subfigures (a) and (b) illustrate the cost versus arrival rate with different cost gaps between cheap and expensive predictions (c₁ and c₂), while subfigure (c) depicts how the cost varies with the threshold. The figure shows that the optimal policy depends on the cost of predictions and the system load.", "section": "4.2 Skip Predict Models Comparison"}, {"figure_path": "kVuw8vzsqZ/figures/figures_9_2.jpg", "caption": "Figure 5: (a+b) cost in external and service time models in setting where one has to choose accuracy levels by accuracy/cost tradeoff. (c+d) Cost vs. C2 with C1 = 0.5. We use exponential service time.", "description": "This figure displays the cost trade-off analysis of SkipPredict against other scheduling policies (SPRPT, FCFS, and 1bit).  Subfigures (a) and (b) are heatmaps showing the total cost for different combinations of cheap prediction accuracy and expensive prediction accuracy in the external and server cost models, respectively.  Subfigures (c) and (d) are line graphs showing the cost versus the expensive prediction cost (C2) in both models. The plots illustrate how SkipPredict's cost-effectiveness changes depending on the accuracy of predictions and the relative costs of cheap and expensive predictions.  The results highlight that SkipPredict is particularly beneficial when there's a significant cost difference between the two types of predictions.", "section": "4.2 Skip Predict Models Comparison"}, {"figure_path": "kVuw8vzsqZ/figures/figures_12_1.jpg", "caption": "Figure 6: Considering prediction cost in SPRPT algorithm in M/M/1 system. The cost is the sum of mean response time and fixed prediction cost.", "description": "This figure illustrates the impact of prediction costs on the performance of the Shortest Predicted Remaining Processing Time (SPRPT) scheduling algorithm in an M/M/1 queueing system.  The x-axis represents the arrival rate (λ), and the y-axis shows the total cost, which is the sum of the mean response time and a fixed prediction cost (c).  Multiple lines are shown, each representing a different fixed prediction cost (c = 0, 0.5, 1, 2, 8).  The figure demonstrates how the total cost increases with the arrival rate and the prediction cost.", "section": "A Supplementary Figures"}, {"figure_path": "kVuw8vzsqZ/figures/figures_12_2.jpg", "caption": "Figure 7: The SkipPredict algorithm.", "description": "This figure illustrates the SkipPredict algorithm's operation.  It shows a timeline where jobs arrive sequentially. For each job, a 1-bit prediction determines if it's short or long.  SkipPredict then decides whether to skip further prediction (if short) or perform an expensive prediction to obtain an accurate predicted time (if long). The algorithm prioritizes short jobs. The figure visually represents how jobs are categorized and scheduled based on the cheap prediction, and how additional expensive predictions are strategically applied to longer jobs only.", "section": "A Supplementary Figures"}, {"figure_path": "kVuw8vzsqZ/figures/figures_30_1.jpg", "caption": "Figure 4: DelayPredict vs. SkipPredict and SPRPT in the external cost model with exponential service times and exponential predictor as described in Section 5 (a) cost vs. arrival rate with c₁ = 0.5, c₂ = 4, T = L = 1 (b) cost vs. arrival rate with c₁ = 3.5, c₂ = 4, T = L = 1 (c) cost vs. threshold (T for SkipPredict and L for DelayPredict), c₁ = 0.5, c₂ = 2, λ = 0.9.", "description": "This figure compares the performance of three scheduling policies: DelayPredict, SkipPredict, and SPRPT, under the external cost model with exponentially distributed service times and an exponential predictor.  It explores the impact of varying arrival rates (λ) and a cost threshold (T for SkipPredict, L for DelayPredict) on overall cost.  Three subfigures illustrate the cost versus arrival rate with different prediction cost gaps (c1 and c2), and a cost versus threshold comparison.", "section": "4.2 Skip Predict Models Comparison"}, {"figure_path": "kVuw8vzsqZ/figures/figures_30_2.jpg", "caption": "Figure 2: Cost in the server time model and in the external model using real-world datasets (a-f) vs. λ (with T = 4) (g-h) vs. T with Trinity dataset (with λ = 0.6). The default costs for the external model are c₁ = 0.5, c₂ = 20, and in the server time are c₁ = 0.05, c₂ = 0.5.", "description": "This figure compares the performance of different scheduling policies (SPRPT, FCFS, 1bit, and SkipPredict) across two cost models (external and server) using real-world datasets.  Subplots (a) through (f) illustrate cost variation against the arrival rate (λ) while keeping the threshold (T) constant at 4. Subplots (g) and (h) show how cost changes with varying threshold (T) for the Trinity dataset at a fixed arrival rate (λ) of 0.6.  Different line colors represent the different scheduling policies, allowing for a visual comparison of their cost-effectiveness under different conditions and datasets.", "section": "Experimental Results"}, {"figure_path": "kVuw8vzsqZ/figures/figures_31_1.jpg", "caption": "Figure 9: Cost in the external cost and server cost models using exponential predictor for Weibull service time. The default costs for the external model are c₁ = 0.5, c₂ = 2 and for the server cost model are c₁ = 0.01, c₂ = 0.05 (a + d) Cost vs. c₂ when λ = 0.9 and T = 1 (b + e) Cost vs. T when λ = 0.9 (c + f) Cost vs. λ when T = 1.", "description": "This figure presents a comparison of different scheduling policies (SPRPT, FCFS, 1bit, SkipPredict) under two cost models (external and server) when using Weibull distribution for service times and exponential predictor for both cheap and expensive predictions.  The plots show the total cost (response time + prediction cost) against varying prediction cost (c2), threshold (T) and arrival rate (λ).  Each plot shows the performance of the four policies under different conditions. This helps to understand the trade-off between prediction cost and scheduling performance under different parameters and system loads.", "section": "5 Experimental Results"}, {"figure_path": "kVuw8vzsqZ/figures/figures_31_2.jpg", "caption": "Figure 9: Cost in the external cost and server cost models using exponential predictor for Weibull service time. The default costs for the external model are c₁ = 0.5, c₂ = 2 and for the server cost model are c₁ = 0.01, c₂ = 0.05 (a + d) Cost vs. c₂ when λ = 0.9 and T = 1 (b + e) Cost vs. T when λ = 0.9 (c + f) Cost vs. λ when T = 1.", "description": "This figure compares the performance of different scheduling policies (SPRPT, FCFS, 1bit, SkipPredict) under two cost models (external and server) with Weibull distributed service times and exponential prediction models.  It shows how the total cost varies with changes in the expensive prediction cost (c₂), the threshold parameter (T), and the arrival rate (λ).", "section": "Experimental Results"}]