[{"figure_path": "02HWT9c4Lp/tables/tables_6_1.jpg", "caption": "Table 1: Impact of dual-branch network components. \"seg.\" means 3D segmentation subnetwork and \"com.\" means 3D completion subnetwork.", "description": "This table presents an ablation study analyzing the impact of different components of the dual-branch network on the model's performance. It shows the effect of including or excluding the BEV branch, the 3D segmentation subnetwork, and the 3D completion subnetwork (with and without the CVP module) on the final IoU and mIoU scores.", "section": "5.3 Ablation Study of VPNet"}, {"figure_path": "02HWT9c4Lp/tables/tables_7_1.jpg", "caption": "Table 2: Internal studies on random noise (a), branch number (b) and fusion strategy (c) of CVP.", "description": "This table presents the ablation study results for the Confident Voxel Proposal (CVP) module. It explores the impact of different hyperparameters and design choices on the performance of CVP. Specifically, it investigates: (a) the effect of varying the number of channels in the random noise input (noise Cz); (b) the influence of using different numbers of branches (branch Q) in CVP; and (c) the impact of adopting different fusion strategies for combining the outputs of multiple branches in CVP. The results are evaluated using the Intersection over Union (IoU) and mean Intersection over Union (mIoU) metrics.", "section": "5.3 Ablation Study of VPNet"}, {"figure_path": "02HWT9c4Lp/tables/tables_7_2.jpg", "caption": "Table 3: Frames in multi-frame network.", "description": "This table shows the result of experiments using different frame combinations in the multi-frame network. The goal is to find the optimal frame combination that best improves the performance of the model.  The table shows that using frames t/t+2/t+4 yields the best performance, with an IoU of 61.1 and mIoU of 26.8.", "section": "Internal Study of MFKD"}, {"figure_path": "02HWT9c4Lp/tables/tables_7_3.jpg", "caption": "Table 4: Internal studies on stages of MFKD (a) and comparison with other distillation methods (b).", "description": "This table presents an ablation study on the effectiveness of the multi-frame knowledge distillation (MFKD) method used in the paper. Part (a) shows the results of experiments conducted with different configurations of MFKD, specifically varying the use of voxel and super-voxel partition in stage-1 and whether stage-2 is included. The results demonstrate that combining super-voxel partition in stage-1 and including stage-2 improves the performance significantly. Part (b) compares MFKD to other existing knowledge distillation methods, illustrating that MFKD achieves the best overall results.", "section": "5.3 Ablation Study of VPNet"}, {"figure_path": "02HWT9c4Lp/tables/tables_9_1.jpg", "caption": "Table 5. Comparison of VPNet with other works on SemanticKITTI online testing set.", "description": "This table compares the performance of the proposed VPNet model against other state-of-the-art semantic scene completion methods on the SemanticKITTI online testing dataset.  It provides a quantitative evaluation across various metrics (IoU and mIoU) and individual semantic classes (road, sidewalk, parking, etc.). The results illustrate VPNet's performance improvements over existing methods.", "section": "5.4 State-of-the-art Comparison"}, {"figure_path": "02HWT9c4Lp/tables/tables_9_2.jpg", "caption": "Table 6: Comparison of VPNet with other works on SemanticPOSS validation set.", "description": "This table compares the performance of VPNet with other state-of-the-art methods on the SemanticPOSS validation dataset.  It shows the Intersection over Union (IoU) scores for each semantic category and the mean IoU (mIoU) across all categories.  This allows for a direct comparison of VPNet's accuracy in semantic scene completion against existing techniques on this specific dataset.", "section": "5.4 State-of-the-art Comparison"}]