[{"figure_path": "NLUYZ4ZqNq/tables/tables_2_1.jpg", "caption": "Table 1: Sources of Legal Pretraining Data", "description": "This table presents a breakdown of the sources used for the legal pretraining data, indicating the amount of data (in billions of tokens) contributed by each source.  The sources include various legal databases (FreeLaw, EDGAR, MultiLegal Pile, EuroParl), government websites (GovInfo), community-based platforms (Law Stack Exchange), open legal corpora from various jurisdictions (Australia, EU, UK), specialized legal databases (UPSTO), and general web data.  The inclusion of diverse sources aims to create a comprehensive and representative legal corpus for training the language models.", "section": "3 Data Collection and Corpus Construction"}, {"figure_path": "NLUYZ4ZqNq/tables/tables_6_1.jpg", "caption": "Table 1: Sources of Legal Pretraining Data", "description": "This table details the sources and the amount of data (in billions of tokens) used for the pretraining phase of the SaulLM models.  It breaks down the data into various categories of legal sources (e.g., FreeLaw, EDGAR, MultiLegal Pile), other legal corpora, and general-purpose data sources like Wikipedia and GitHub. The inclusion of general data is intended to mitigate catastrophic forgetting and help retain reasoning capabilities.", "section": "3 Data Collection and Corpus Construction"}, {"figure_path": "NLUYZ4ZqNq/tables/tables_6_2.jpg", "caption": "Table 1: Sources of Legal Pretraining Data", "description": "This table shows the different sources of data used for pretraining the SaulLM models, along with the amount of data (in billions of tokens) contributed by each source.  The sources include various legal datasets (FreeLaw, MultiLegal Pile, etc.), general-purpose datasets (Wikipedia, StackExchange, GitHub), and specialized datasets (math datasets, Super Natural Instruction). The table also provides context on the strategic inclusion of data sources to mitigate issues such as catastrophic forgetting and enhance the model's overall capabilities.", "section": "3 Data Collection and Corpus Construction"}]