[{"type": "text", "text": "ReMAP: Neural Model Reprogramming with Network Inversion and Retrieval-Augmented Mapping for Adaptive Motion Forecasting ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Sharmita Dey∗, Sarath Ravindran Nair ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Mobility impairment caused by limb loss, aging, stroke, and other movement deficiencies is a significant challenge faced by millions of individuals worldwide. Advanced assistive technologies, such as prostheses and orthoses, have the potential to greatly improve the quality of life for such individuals. A critical component in the design of these technologies is the accurate forecasting of reference joint motion for impaired limbs, which is hindered by the scarcity of joint locomotion data available for these patients. To address this, we propose ReMAP, a novel model repurposing strategy that leverages deep learning’s reprogramming property, incorporating network inversion principles and retrieval-augmented mapping. Our approach adapts models originally designed for able-bodied individuals to forecast joint motion in limb-impaired patients without altering model parameters. We demonstrate the efficacy of ReMAP through extensive empirical studies on data from below-knee-challenged patients, showcasing significant improvements over traditional transfer learning and fine-tuning methods. These findings have significant implications for advancing assistive technology and mobility for patients with amputations, stroke, or aging. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Physical impairment is a life-altering event that affects millions of individuals worldwide, imposing substantial challenges on their mobility and daily activities. The disability of a limb can lead to significant physical and psychological limitations, impacting the individual’s overall well-being and independence. In recent years, considerable efforts have been made to develop advanced assistive technologies to address these challenges and enhance the quality of life for impaired patients. ", "page_idx": 0}, {"type": "text", "text": "A crucial aspect of designing effective assistive technologies is the accurate prediction of reference joint motion for the impaired limb. Understanding the natural motion of the joints is essential for the development of prosthetic devices that can restore the function of the impaired limb seamlessly. However, obtaining reliable data for impaired patients is a complex task, as their numbers and ability to perform diverse motion conditions are relatively limited compared to able-bodied individuals. This scarcity of data hinders the training of robust models specifically tailored to the unique conditions of each individual. Moreover, each impairment is a unique and individualized event, leading to a wide range of motion patterns and functional variations among such patients. Consequently, creating a single generic model for those patients is not practical, as it would not capture the individual variations and diverse motion conditions that arise from different types of impairments. In contrast, subjectspecific modeling attempts to cater to each patient’s specific needs and characteristics. However, this approach faces significant challenges as well. The limited data availability for individual patients poses a hurdle in developing accurate models, leading to suboptimal performance and generalization issues. ", "page_idx": 0}, {"type": "image", "img_path": "dVqZ0a7LdP/tmp/c8bfeff1a047695b3011ef96aae47ba3658226db4200572372529b301d403957.jpg", "img_caption": ["Figure 1: Simplified architecture of the proposed ReMAP. The corrupt inputs $X_{a m p}$ from the individuals with mobility challenges are mapped to clean inputs $X_{c o r r}$ computed from able-bodied individuals, and the corrected inputs are used to produce the desired motion variables for the individuals with mobility challenges $\\hat{y}_{a m p}$ using a frozen foundation module pretrained for ablebodied subjects. "], "img_footnote": [], "page_idx": 1}, {"type": "text", "text": "", "page_idx": 1}, {"type": "image", "img_path": "dVqZ0a7LdP/tmp/980a5c20b4e18945aad023cffdda34fefef8f4c43c2190c9b004b8af7f5ed694.jpg", "img_caption": ["Figure 2: Illustration of computation of the correction input $X_{c o r r}$ corresponding to the $k$ -th input sample $X_{a m p}^{k}$ of the mobility-impaired individual. The able-bodied input $X_{a b}^{i}$ that produces the most similar output as that of the desired mobility-impaired individual output $y_{a m p}^{k}$ is searched in the input-output space of the trained able-bodied foundation module. Instead of searching based on a single desired motion variable $y_{a m p}^{k}$ , a sequence of values $\\{y_{a m p}^{k-m},...,y_{a m p}^{k},...,y_{a m p}^{k+m}\\}$ (marked by the red region in the lower left curve) is used and the able-bodied input $X_{a b}^{i}$ corresponding to the midpoint of the sequence is considered. Further, a neighborhood of radius $\\epsilon$ is considered around $X_{a b}^{i}$ and the correction input $X_{c o r r}$ is computed as a weighted sum of samples in this neighborhood with weights decreasing (linearly or exponentially) with increasing distance from the center $X_{a b}^{i}$ . "], "img_footnote": [], "page_idx": 1}, {"type": "text", "text": "In this research, we introduce ReMAP, a novel approach for motion generation in impaired individuals using neural model reprogramming. Our strategy addresses the challenges of predicting joint motion with limited data by repurposing well-trained gait prediction models developed on able-bodied data. ReMAP utilizes network inversion principles and retrieval-augmented mapping to adapt models for impaired individuals without requiring retraining or fine-tuning of the pretrained models. ReMAP comprises three key components: (1) a diverse foundation module derived from able-bodied data, (2) a retrieval-augmented template mapping module to identify the most relevant inputs for learning the mapping, and (3) a refurbish module that learns the mapping once the desired inputs are identified. Specifically, we leverage network inversion techniques [1, 2, 3] to generate correction templates for mapping impaired inputs to able-bodied patterns and retrieval-based methods [4, 5, 6, 7] to identify the most relevant inputs for learning this mapping. ", "page_idx": 1}, {"type": "text", "text": "", "page_idx": 2}, {"type": "text", "text": "Furthermore, the adoption of neural model reprogramming provides an additional advantage in terms of cost and resource efficiency. Fine-tuning subject-specific models can be computationally expensive, requiring modifications to a considerable number of parameters in the model. In contrast, model reprogramming optimizes a smaller set of parameters, reducing the computational overhead significantly. Additionally, this technique preserves the model’s original functionality, making it adaptable to various tasks without compromising its initial training. ", "page_idx": 2}, {"type": "text", "text": "We evaluate our method against baselines using transfer learning and conduct extensive ablations on various reprogramming techniques and architectures. Our quantitative results demonstrate the effectiveness of our approach, particularly in very low-data regimes, where it outperforms all tested transfer learning and fine-tuning methods. To the best of our knowledge, this is the first work in the domain of motion regression using neural model reprogramming. Our findings have significant implications for the advancement of assistive technologies, offering the potential to improve mobility and quality of life for limb-impaired patients. ", "page_idx": 2}, {"type": "text", "text": "2 Related Work ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Reprogramming of models. The concept of model reprogramming involves repurposing proficiently trained models for novel tasks through data-level manipulation alone [8]. This underscores the capability of deep models to handle diverse tasks without the need to alter any of their model parameters. The efficiency of this reprogramming approach has been validated in the context of image classification [8, 9], time-series classification [10, 11], spoken command recognition [12], GAN conditioning [13], out-of-distribution detection [14], antibody sequence filling [15] and fraud detection [16]. This research explores the potential of model reprogramming to address the challenges of predicting joint motion in lower-limb-impaired individuals, aiming to enhance the development of assistive technologies. By repurposing well-established gait prediction models trained on able-bodied data, we seek to provide limb-impaired individuals with improved mobility solutions. This approach has the potential to transform the landscape of prosthetic development, offering a higher quality of life for individuals facing mobility challenges. ", "page_idx": 2}, {"type": "text", "text": "Network inversion. Network inversion techniques have been instrumental in optimizing neural network inputs to achieve specified outputs. Initially proposed by Linden and Kindermann [1], this method utilizes gradient-based optimization to iteratively refine inputs until the network outputs the desired result [1, 2, 3]. This approach has been studied and applied in interpretability research, such as visualizing deep convolutional networks to find the input image that maximizes the activation of a particular neuron or layer [17], understanding deep image representations [18, 19, 20], and image synthesis [21]. In our work, we leverage this concept to generate a correction template for mapping inputs, given the characteristics of the desired output motion. ", "page_idx": 2}, {"type": "text", "text": "Retrieval-based methods. Retrieval-based methods rely on retrieving relevant information from a large corpus in response to a query [4, 5, 6, 7]. These methods involve identifying and retrieving relevant documents or passages using techniques like dense retrieval [22] and using this information to inform subsequent processes such as text generation or model training. A notable application of retrieval-based methods is Retrieval-Augmented Generation (RAG), where retrieval provides context that enhances generative processes [23, 24]. We apply retrieval-based methods to identify segments of impaired-limb motion dynamics, to learn a neural reprogramming module. ", "page_idx": 2}, {"type": "text", "text": "Gait motion models. Gait prediction is a challenging problem due to the complex nature of human gait. In recent years, there has been a growing interest in developing gait prediction models using machine learning techniques. Most works focused on developing such models by training explicit models to learn the input-output synergy, especially, for able-bodied subjects [25, 26, 27, ", "page_idx": 2}, {"type": "text", "text": "28, 29, 30, 31], with only a few works on lower-limb-impaired individuals [32, 33, 34]. Directly applying a gait prediction model trained for able-bodied subjects for motion prediction in impaired individuals suffered in performance due to the inherent differences between gait patterns of ablebodied individuals and limb-impaired individuals [34]. This study presents an efficient strategy to adapt a generic gait prediction model for predicting limb joint motion during various locomotion tasks for below-knee impaired individuals, including walking and stair ascent/descent, without requiring model fine-tuning or retraining. Our method integrates retrieval with network inversion techniques [2, 3], mapping impaired inputs to able-bodied patterns to facilitate accurate motion prediction. ", "page_idx": 3}, {"type": "text", "text": "3 Datasets ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Able-bodied dataset. To train the able-bodied motion model, we utilize a comprehensive public dataset [35] that includes kinematic data collected from wearable sensors. These sensors comprise IMUs that measure 3D angular velocities and linear accelerations, as well as goniometers that capture sagittal knee and ankle positions under various motion conditions. The dataset includes recordings from ten individuals performing a range of locomotion activities, such as level ground walking, stair ascent, stair descent, and walking on inclined walkways. The dataset comprises approximately 6.56 million samples across ten individuals, averaging about 656,039 samples per individual. ", "page_idx": 3}, {"type": "text", "text": "Lower-limb impairment motion datasets. Motion data were collected from individuals with below-knee lower-limb impairments/amputations [36] using a ${200}\\,\\mathrm{Hz}$ camera-based motion capture system (Vicon Motion Systems Ltd., UK) equipped with 12 cameras. Retro-reflective markers were placed on their bony landmarks in the torso, pelvis, thigh, shank, and residual foot, with additional markers on the thigh and shank for 3D tracking. Various locomotion tasks were performed, including different walking speeds, stair ascent, and stair descent. Gait event detection software (Vicon Nexus) marked gait cycle boundaries based on marker positions and force thresholds. We processed the marker trajectories and computed joint angles and kinematic data using OpenSim [37], an open-source musculoskeletal modeling platform. The user studies were approved by the Institutional Review Board (IRB) of the University Medical Center Göttingen, Germany. Participants were informed beforehand about the experimental procedure, potential risks, precaution measures, and data protection. Experiments were conducted after obtaining written consent from participants. All ethical protocols regarding information, instructions, and compensation were followed. Details are provided in the appendix A.5. ", "page_idx": 3}, {"type": "text", "text": "Inputs and outputs. We utilized the temporal history of angular velocities from the shank and thigh segments and the angular position of the knee joint on both sides as model inputs. ", "page_idx": 3}, {"type": "equation", "text": "$$\nX_{t}=\\{\\theta_{t-K:t}^{(t h i g h,r)},\\theta_{t-K:t}^{(t h i g h,l)},\\theta_{t-K:t}^{(s h a n k,r)},\\theta_{t-K:t}^{(s h a n k,l)},\\theta_{t-K:t}^{(k n e e,r)},\\theta_{t-K:t}^{(k n e e,l)}\\}\\in\\mathcal{R}^{K\\times D}\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "where $K\\,=\\,20$ is the length of history and $D\\,=\\,6$ is the number of input features. The model predicted the angular position of the ankle joint on the impaired side. Given that direct measurement of ground truth outputs from lower-limb impaired individuals is not feasible due to limb disabilities or loss, we computed the desired ankle motion trajectories for each such individual’s gait cycle based on similar-speed gait cycles of a subset of able-bodied subjects with comparable anthropometric features (mass, age, height). ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\tilde{y}_{a m p}=\\frac{\\sum_{s\\in S_{a n t h r o p o m e t r i c}}\\sum_{n\\in N_{s p e e d}}y_{k}^{s,n}}{|S_{a n t h r o p o m e t r i c}||N_{s p e e d}|}\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "where $S_{a n t h r o p o m e t r i c}$ is the set of subjects with similar anthropometry as the impaired individual (height: $\\pm5\\mathrm{cm}$ , weight: $\\pm5\\mathrm{kg},$ ) and $N_{a p e e d}$ is the set of gait cycles where the able-bodied subjects in walked at similar speeds $\\pm0.1\\mathrm{m/s})$ as that of the impaired individual. The reference timepoint $k$ for computing a matching output for the impaired individual was based on the phase of the gait cycle. ", "page_idx": 3}, {"type": "text", "text": "4 Method ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Our objective is to utilize a well-trained foundation model that has learned a variety of motion scenarios from physically capable individuals to predict the walking patterns of a lower-limb impaired individual’s disabled limbs, all without fine-tuning or altering the model parameters. This involves reprogramming/correcting the inputs acquired from the impaired individuals by refurbishing them so that the foundation model is able to produce the desired motion variables from the limb-impaired individuals’ inputs. Our method integrates retrieval with network inversion techniques, efficiently mapping impaired-individual inputs to able-bodied patterns and facilitating accurate motion prediction. It comprises three components: a foundation module, a versatile multi-task model developed from data sourced from numerous able-bodied subjects; a retrieval-augmented template mapping module, which computes the correction template for the queried impaired individual input; and a refurbish module, designed to map the queried impaired individual input to the computed correction template. The foundation module then predicts the desired motion of the disabled limb from the refurbished impaired individuals’ inputs. Figure 1 summarizes this architecture. Below, we elaborate on each of the components. ", "page_idx": 3}, {"type": "text", "text": "", "page_idx": 4}, {"type": "text", "text": "4.1 Foundation module ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "We train a foundation multi-task module using data from able-bodied individuals $(\\mathcal{X}_{a b},\\mathcal{Y}_{a b})$ , encompassing the different motion conditions. A fundamental difficulty in the realm of multi-task learning is finding a balance between utilizing the common patterns among multiple tasks while still preserving the adaptability needed to address the unique characteristics of each individual task. Our strategy involves constructing a predictive model, denoted as $g(.)$ , which comprises two distinct components: a shared core $g_{s}$ with parameters $\\theta_{s}$ that are shared across all tasks, and subsequently, task-specific layers $g_{t}$ with parameters $\\theta_{t}$ . The holistic forecast for a given input instance $X_{t,k}$ , pertaining to the task $t$ at the time point $k$ , is represented as $g(X_{t,k},t;\\theta_{g}\\stackrel{}{=}\\{\\theta_{s},\\bigcup_{t}\\theta_{t}\\})=g_{t}(g_{s}(\\bar{X_{t,k}};\\theta_{s});\\bar{\\theta}_{t})$ . For the shared core $g_{s}$ , we employ time convolutions [38]. We deplo y lightweight task-specific layers, $g_{t}$ , on top of the shared core, characterized by a two-layer multi-layer perceptron (MLP) with rectified linear unit (ReLU) nonlinearities. We compare architectures with task-specific final layers to a model without such task-specific parameters. In this alternate architecture, the output features $g_{s}(X;\\theta_{s})$ of the shared core for any task are passed through a single prediction head $g_{c}$ to produce the output motion variable. This comparison helps evaluate the efficacy of task-specific adaptations versus a unified approach in predicting motion variables across different tasks. ", "page_idx": 4}, {"type": "text", "text": "4.2 Retrieval-augmented template mapping ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "Once the able-bodied model is trained, we use it to predict the motion variables for the lower-limb mobility-impaired subjects without retraining the model with the affected individual’s data. To achieve this, we map the mobility-impaired individual’s inputs $X_{a m p}$ corresponding to a desired output $y_{a m p}$ to a corrected input $X_{c o r r}$ such that the model gives a similar output as the mobilityimpaired individual’s desired output for this corrected input (Fig. 1). We identify two methods for computing such a correction input $X_{c o r r}$ , namely nearest neighbor search and network inversion. ", "page_idx": 4}, {"type": "text", "text": "Nearest neighbor search. A naive way of mapping the impaired individual’s input to an ablebodied template is to use the able-bodied input $X_{a b}$ for which the model gives the desired impaired individual’s output $\\tilde{y}_{a m p}^{k}$ as the corrected input, that is, ", "page_idx": 4}, {"type": "equation", "text": "$$\nX_{c o r r}^{k}=\\underset{X_{a b}\\in\\mathcal{X}_{a b}}{\\arg\\operatorname*{min}}\\|f(X_{a b})-\\tilde{y}_{a m p}^{k}\\|\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": ", where the desired impaired individual’s output $\\tilde{y}_{a m p}^{k}$ is computed from those able-bodied individuals sharing similar anthropometry (such as height, mass, and age) as that of the impaired individual. ", "page_idx": 4}, {"type": "text", "text": "However, an inherent problem of this approach is the ambiguity in the corrected input when similar values of desired output $y_{a m p}$ occur separated in time. This can lead to entirely different input values being mapped as correction inputs for similar input values of the limb-impaired individuals. For example, in the illustration in Fig. 2, consider we were searching for a $X_{c o r r}$ for $y_{a m p}^{k}=0.6$ at t = 0.6. However, yakmp $y_{a m p}^{k}=0.6$ also occurs around $t=0.2$ for which the correction input might be completely different from the one at $t=0.6$ . ", "page_idx": 4}, {"type": "text", "text": "One way to disentangle this problem would be to consider not a single $y_{a m p}^{k}$ value for computing the correction input, but a sequence of co-occurring values in a time of which the desired output $y_{a m p}^{k}$ is the midpoint (red region in Fig. 2). The algorithm now searches for a sequence of $2m+1$ able-bodied inputs that would produce the desired sequence of mobility-impaired individual outputs $\\{y_{a m p}^{k-m},...,y_{a m p}^{k},...,y_{a m p}^{k+m}\\}$ . This way, it becomes less probable that different able-bodied input sequences correspond to the same mobility-impaired individual output sequences. For example, the desired output $y_{a m p}^{\\dot{k}}$ at $t=0.6$ in Fig. 2 falls in the region of decreasing values of $y_{a m p}$ , whereas the other similar value at around $t=0.2$ lies in the region of increasing $y_{a m p}$ values. These two output values, although similar, would thus have different able-bodied inputs associated with them for correction. The correction input $X_{c o r r}^{k}$ in this case can be computed as ", "page_idx": 4}, {"type": "text", "text": "", "page_idx": 5}, {"type": "equation", "text": "$$\nX_{c o r r}^{k}=\\arg\\operatorname*{min}_{X_{a b}^{i}}\\sum_{j=-m}^{m}\\big\\|f(X_{a b}^{i-j})-\\tilde{y}_{a m p}^{k-j}\\big\\|\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "In the previous approaches, we used a single value of able-bodied input as a correction template for the mobility-impaired individual. However, this approach may be prone to noise and overfitting. To deal with this, we propose an extension of our approach which integrates multiple able-bodied input values to form a correction template for the mobility-impaired individual. This is achieved by defining a $\\epsilon_{}$ -neighborhood (black ellipse in Fig. 1) around the able-bodied input for which the model prediction is closest to the desired mobility-impaired individual output (such an able-bodied input is obtained using either Eqn. 3 or Eqn. 4). The correction template is computed as a weighted sum of the able-bodied inputs within the $\\epsilon$ -neighborhood. If $X_{a b}^{i}$ be the closest able-bodied input around which the $\\epsilon$ -neighborhood is defined, the correction template is given by ", "page_idx": 5}, {"type": "equation", "text": "$$\nX_{c o r r}^{k}=\\sum_{j\\in a r g(\\|X_{a b}-X_{a b}^{i}\\|\\leq\\epsilon)}w_{j}*X_{a b}^{j}.\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $w_{j}$ is the weight associated with each of the able-bodied input $X_{a b}^{j}$ in the $\\epsilon$ -neighborhood. We define two types of weighting – linear and exponential – with the weight $w_{j}$ of an able-bodied input sample $X_{a b}^{j}$ decreasing linearly or exponentially as it moves away from the center $X_{a b}^{i}$ of the $\\epsilon$ -neighborhood. The weighting factor $w_{j}$ is thus given by ", "page_idx": 5}, {"type": "equation", "text": "$$\nw_{j}=\\left\\{\\begin{array}{l l}{1-\\frac{X_{a b}^{j}-X_{a b}^{i}}{\\epsilon}}&{\\mathrm{if~weighting=linear}}\\\\ {e x p\\big(s*\\frac{X_{a b}^{i}-X_{a b}^{j}}{\\epsilon}\\big)}&{\\mathrm{if~weighting=exponential}}\\end{array}\\right.\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $s$ is a scaling factor that determines how fast the weight decreases as the sample $X_{a b}^{j}$ moves away from the center of the $\\epsilon$ -neighborhood. Other types of weighting (for example, uniform weighting of samples in the neighborhood) are also possible, but are out of scope of this work. ", "page_idx": 5}, {"type": "text", "text": "For simplicity, we consider only $n$ closest neighbors within the $\\epsilon$ -neighborhood for computing the correction template $X_{c o r r}$ . Since the inputs are normalized in [0, 1], $\\epsilon$ is set to 0.01. ", "page_idx": 5}, {"type": "text", "text": "Network inversion. One limitation of the nearest neighbor search method detailed above is the requirement to store the complete training data used for training the foundation module, which increases the memory requirements. Although one can devise clever ways to store less data without affecting the accuracy, we propose directly retrieving the correction input $\\mathbf{X}_{c o r r}$ corresponding to the mobility-impaired individual’s desired output, $\\tilde{y}_{a m p}$ from the pretrained foundation module. For the desired mobility-impaired individual output, $y_{a m p}^{k}$ at each time point $k$ , we generate a correction template $X_{c o r r}^{k}$ such that, ", "page_idx": 5}, {"type": "equation", "text": "$$\nX_{c o r r}^{k}=\\arg\\operatorname*{min}_{X}\\left\\|g(X)-\\tilde{y}_{a m p}^{k}\\right\\|_{2}+\\lambda\\left\\|X_{c o r r}^{k}\\right\\|_{2}\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where the $\\lambda$ is the regularization strength. ", "page_idx": 5}, {"type": "text", "text": "This approach draws inspiration from network-inversion techniques introduced by Linden and Kindermann [1] which involves finding a relevant input that produces a specific output from a neural network. This technique, leverages gradient-based optimization to iteratively adjust the input until the desired output is achieved. ", "page_idx": 5}, {"type": "text", "text": "4.3 Refurbish module ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "We perform a data-level adaptation of the mobility-impaired individual inputs by learning a mapping from the corrupted mobility-impaired individual data $X_{a m p}$ (due to compensatory motion, asymmetric gait) to the correction template $X_{c o r r}$ computed from the able-bodied data using the techniques mentioned in the previous section. To achieve this, we train a lightweight refurbish module $\\bar{h}(.)$ characterized by a multi-layer perceptron with three hidden layers of 100 units each. Following three strategies are employed for training the refurbish module. ", "page_idx": 5}, {"type": "text", "text": "", "page_idx": 6}, {"type": "text", "text": "Correction-based mapping. The refurbish module $h(.)$ is trained to map the mobility-impaired individual input $X_{a m p}$ to the corresponding computed correction $X_{c o r r}$ by minimizing the MSE loss between the computed correction $X_{c o r r}$ and refurbish module predicted correction $\\hat{X}_{c o r r}=$ $h(X_{a m p};\\Theta_{h})$ . The loss function is ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\mathcal{L}_{i n p u t}=\\sum_{X_{a m p},X_{c o r r}\\in\\mathcal{X}_{a m p}^{t r a i n}}\\lVert h(X_{a m p};\\Theta_{h})-X_{c o r r}\\rVert\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "where $\\mathcal{X}_{a m p}^{t r a i n}$ is the training dataset consisting of mobility-impaired individual inputs and corresponding correction templates. The correction template may be computed using either nearest neighbor search or network inversion, detailed in the previous section. ", "page_idx": 6}, {"type": "text", "text": "Target-based mapping. In this case, the input to map to is not explicitly determined, instead the refurbish module optimizes its parameters to produce the target directly, given the frozen foundation module. The refurbish module $h(.)$ is trained to minimize the MSE loss between the predictions of the pretrained foundation module $g(.)$ when it is fed with the refurbish module’s outputs and the desired target values of the mobility-impaired individual $y_{a m p}$ . In this strategy, the computed correction templates are completely ignored, and the model is trained solely to reproduce the final desired target. The loss function becomes ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\mathcal{L}_{t a r g e t}=\\sum_{X_{a m p},y_{a m p}\\in\\mathcal{X}_{a m p}^{t r a i n},\\tilde{y}_{a m p}^{t r a i n}}\\lVert g(h(X_{a m p};\\Theta_{h});\\Theta_{g}^{*})-\\tilde{y}_{a m p}\\rVert\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "where $\\tilde{\\mathcal{V}}_{a m p}^{t r a i n}$ is the training dataset consisting of desired outputs for mobility-impaired individuals. The foundation module is pretrained using the data from multiple able-bodied subjects, and its parameters $\\Theta_{g}^{*}$ are kept fixed. Only the parameters $\\Theta_{h}$ of the refurbish module $h(.)$ are varied using this loss function. ", "page_idx": 6}, {"type": "text", "text": "Hybrid. This is a combination of the correction-based and target-based training strategies. The loss function used to train the mapping model $h$ is a weighted combination of the error between the predicted correction $\\hat{X}_{c o r r}=h(X_{a m p})$ for the mobility-impaired individual input $X_{a m p}$ and its computed correction $X_{c o r r}$ and the error between foundation module predictions on mapping model outputs, $\\hat{y}_{a m p}\\,=\\,g(h(X_{a m p}))$ and the desired output values of the mobility-impaired individual $\\tilde{y}_{a m p}$ . Thus, the hybrid loss function is, ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\mathcal{L}_{t o t a l}=\\alpha*\\mathcal{L}_{i n p u t}+\\beta*\\mathcal{L}_{t a r g e t}\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "where $\\alpha$ and $\\beta$ are the factors that influence the effect of input-based loss and target-based loss respectively on the final loss. Based on which correction strategy is used, the hybrid strategy can take two forms – hybrid (neighbor) and hybrid (inversion). ", "page_idx": 6}, {"type": "text", "text": "5 Experiments ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "5.1 Baselines ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "We assess our proposed method’s effectiveness against three baseline approaches: ", "page_idx": 6}, {"type": "text", "text": "Cross-mapping (zero-shot transfer). Here, we directly apply the foundation model $g(.)$ to predict motion variables for mobility-impaired individual subjects, without retraining the foundation module or utilizing the refurbish module to transform mobility-impaired individual inputs into clean data. This is akin to zero-shot transfer, where the pretrained model is used to predict output trajectories from impaired inputs without any training. Since no training was involved, it was not possible to report scores for cross-mapping with different training ratios. ", "page_idx": 6}, {"type": "text", "text": "Direct-mapping. In direct mapping, we used a refurbish module $h(.)$ in front of the pretrained model $g(.)$ . The model learns to directly map the impaired individual’s inputs $X_{a m p}$ to the desired motion variables $\\tilde{y}_{a m p}$ . During learning, the pretrained model is frozen, whereas the refurbish module is tunable. ", "page_idx": 6}, {"type": "image", "img_path": "dVqZ0a7LdP/tmp/ff0c3c69e197575c7e701ec97e0d8fae1ca72489f4758e3b74e167529bea15cf.jpg", "img_caption": ["Figure 3: Effect of foundation model architecture on the performance for different training strategies. (task-shared: model with shared backbone and a common prediction head for all tasks, task-specific: model with shared backbone and task-specific heads) "], "img_footnote": [], "page_idx": 7}, {"type": "image", "img_path": "dVqZ0a7LdP/tmp/5e69aa3c18c9c6da4947b26d692e98cd6a3c9faa94ed78b22785891ebeea5a99.jpg", "img_caption": ["Figure 4: (Left) Effect of weightage $\\beta$ of the target-based loss on the performance of models with task-specific prediction heads trained with hybrid strategy for refurbishing. The weightage $\\alpha$ of inputbased loss is set to be 1. The blue curve on the left $\\arg=1$ , $\\beta=0$ ) represents purely neighbor-based refurbishing. (Right) Effect of sequence length $2m+1$ and number of nearest neighbors $n$ on the performance of models with shared and task-specific prediction heads trained using input-based and hybrid strategies. For hybrid strategy, $\\alpha=1$ and $\\beta=20$ was selected. The combination which gave the best prediction performance in each case is marked with a red square (Please note that there exists multiple combinations which gave similar accuracies). "], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "", "page_idx": 7}, {"type": "text", "text": "Fine-tuning (transfer learning). In finetuning, no refurbish module is used, and the foundation module $g(.)$ pre trained on able-bodied data is finetuned to learn a mapping from impaired individual inputs $X_{a m p}$ to the desired motion variables $\\tilde{y}_{a m p}$ . ", "page_idx": 7}, {"type": "text", "text": "5.2 Ablation results ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "Foundation module architectures. Our initial analysis focused on how the architecture of the foundation module impacts prediction performance across various training strategies. As depicted in Fig. 3, we examined the foundation modules equipped with task-specific and task-shared prediction heads in predicting desired motion variables for mobility-impaired individuals across different tasks. For direct mapping and refurbished inputs with target-based and hybrid correction, models featuring task-specific heads outperformed those with shared prediction heads when the training data was limited. However, as the training dataset size increased, the performance of both models converged to similar levels. Interestingly, a reverse trend emerged when mobility-impaired individual inputs were refurbished with a target-based trained refurbish module. Models with shared prediction heads performed better for the smallest training data sizes, while those with task-specific layers performed better with larger training datasets. In summary, task-specific foundation models consistently demonstrated superior prediction performance when compared to their task-shared counterparts. ", "page_idx": 7}, {"type": "text", "text": "Effect of weightage $\\beta$ of target-based loss . In the hybrid training strategy of the refurbish module, we adopted a loss function that is a weighted sum of the correction-based and target-based loss. We next analyzed how the weights assigned to the loss functions affect the performance of the task-specific foundation modules. We set the weightage for correction-based loss to be 1 and varied the weightage $\\beta$ of the target-based loss. We found that the model performance increases for higher weightage of target-based loss for refurbish model training. However, as the weightage $\\beta$ increases, the prediction performance shows a converging trend (Fig. 4 left). ", "page_idx": 7}, {"type": "image", "img_path": "dVqZ0a7LdP/tmp/0a4ba6cd7b661c9ff247e5dfddcd53f113005f41a4e04d6eab34a291c73665d5.jpg", "img_caption": ["Figure 5: (Left) Performance of models trained with different strategies. For hybrid strategies, $\\alpha=1$ and $\\beta=20$ was selected. For neighbor-based strategies, $m$ and $n$ were selected based on the best-performing values computed in the previous section. (Right) The correction template $X_{c o r r}$ computed using different strategies and the corresponding predictions from the refurbish module. For target-based strategy, no correction template was computed, and the visualization shows the output of the refurbish module in this case. "], "img_footnote": [], "page_idx": 8}, {"type": "table", "img_path": "dVqZ0a7LdP/tmp/37f7edcdcca724a639518e2a190ff3c172216d7a138e1c6b0d9d4730075c6b05.jpg", "table_caption": ["Table 1: Coefficient of determination $(R^{2})$ obtained with different training strategies for a train sample ratio of 0.1 "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "", "page_idx": 8}, {"type": "text", "text": "Effect of sequence length $2m+1$ and number of neighbors $n$ . In the nearest neighbor search dmeestihreodd  fmoort icoonm vpauritianbgle tsh feo rc othrree cmtioobni ltiteym-ipmlaptae $X_{c o r r}$ d, ivwied uparlo $\\{y_{a m p}^{k-m},...,y_{a m p}^{k^{-}},...,y_{a m p}^{k+m}\\}$ s teoq cuoenmcpeu otef the correction template $X_{c o r r}^{k}$ for the -th mobility-impaired individual input $X_{a m p}^{k}$ . Another strategy that we propose is to use a $\\epsilon$ -neighborhood around the able-bodied input sample $X_{a b}^{i}$ that is closest to the input required to produce the desired mobility-impaired individual motion variable $y_{a m p}^{k}$ at time point $k$ . The correction template should be computed as a weighted sum of $n$ nearest neighbors of $X_{a b}^{i}$ within the $\\epsilon$ -neighborhood (where weights decrease linearly or exponentially as the distance from $X_{a b}^{i}$ increases). We investigated the effect of the sequence length $2m+1$ and number of nearest neighbors $n$ used for computing the correction template on the performance of models in predicting the desired motion variables for mobility-impaired individuals across locomotion tasks (Fig. 4 right). Most of the cases evaluated worked better than the basic case of single sample matching and single neighbor $(2m+1=1,n=1)$ ). For models with task-shared prediction heads, better performances were obtained with lower sequence length $2m+1$ and higher number of neighbors $n$ for both correction-based and hybrid methods. For models with task-specific prediction heads, correctionbased correction performed better with larger sequence length and larger number of neighbors lead to better performance for whereas hybrid strategy worked better with a smaller sequence length and larger number of neighbors. Interestingly, hybrid (neighbor) strategy did not require matching a larger sequence of outputs, possibly because it also makes use of target-based correction. Nevertheless, sampling multiple neighbors from the $\\epsilon_{}$ -neighborhood of $X_{a b}^{i}$ was still necessary to improve the prediction performance. A exponentially decreasing weighting performed better for neighbor-based correction strategy, whereas a linearly decreasing weighting worked better for hybrid strategy. For further analyses and comparisons, we use the sequence length, number of neighbors’ and weighting values that gave the best prediction scores with neighbor-based and hybrid (neighbor) computed correction templates. ", "page_idx": 8}, {"type": "text", "text": "Training strategies. Finally, we examined the impact of various training strategies on model performance (Fig. 5 left and Tab. 1). Across all these strategies, we observed a general improvement in prediction scores as the training sample size increased. There was a slight drop in accuracy when using very large training sample sizes, likely due to overfitting. Both the hybrid strategies – hybrid (neighbor) and hybrid (inversion) — which combined correction-based and target-based mapping, consistently delivered accurate predictions across different training sample sizes. Notably, for the smallest amount of training data tested, the hybrid strategy outperformed the direct mapping and fine-tuning approaches. With task-shared prediction heads, hybrid reprogramming showed a slight improvement $\\bar{(\\sim7\\%)}$ over direct mapping, while for task-specific prediction heads, it exhibited a more pronounced improvement $(\\sim16\\%)$ ). These results suggest that our proposed input refurbishing strategy offers an efficient means to adapt a pretrained model for new scenarios, especially when dealing with limited training data. ", "page_idx": 8}, {"type": "text", "text": "", "page_idx": 9}, {"type": "text", "text": "While direct mapping performs well in predicting motion variables for the specific mobility-impaired individual it was trained on, it requires a larger dataset to achieve the same performance level as the model reprogramming approach. Additionally, direct mapping relies on limited data from mobility-impaired individuals, reducing exposure to diverse motion conditions and leading to limited generalization capabilities. This limitation is critical for mobility-impaired individual motion prediction models, as gait patterns may change as mobility-impaired individuals adapt to generated motion. This adaptation could result in improved compensatory motions and gait normalization. In contrast, an able-bodied model trained on a wide array of motion scenarios from various individuals may be more adaptable to evolving mobility-impaired individual gait patterns while accommodating the predicted joint motion required for prosthetic walking. Our approach also outperformed model fine-tuning in the low-data regime, showing an improvement of approximately $\\sim11\\%$ for task-shared models and $\\sim13\\%$ for task-specific models, underlining the effectiveness of the proposed approach over other model repurposing methods like transfer learning. ", "page_idx": 9}, {"type": "text", "text": "Visualization of the computed correction templates $X_{c o r r}$ and corresponding predictions from the refurbish module (Fig. 5 right) shows that, despite the refurbish module being a simple three-layer MLP (chosen for its lightweight and data-efficient properties), it can reconstruct the correction templates with considerable accuracy. Interestingly, the correction templates computed by the neighbor search and network inversion strategies were notably different, despite having the same desired output. This discrepancy arises because neighbor search finds the closest match from available data points, introducing variability based on the dataset, while network inversion uses gradient-based optimization to iteratively minimize error, leading to different solutions. The same variability was observed with target-based mapping, which directly optimizes towards the target output without generating intermediate correction templates. ", "page_idx": 9}, {"type": "text", "text": "Limitations The desired motion variables for mobility-impaired individual subjects were derived from able-bodied individuals with similar anthropometric features and walking speed as that of the mobility-impaired individual subjects. While this approximation may effectively represent the reference joint’s desired motion, its suitability for practical applications such as controlling powered prostheses requires validation. Nevertheless, our approach possesses a generic capability to transform inputs in a way that can generate any desired output from a pretrained model, provided there exists a learnable relationship between the inputs and the desired outputs. ", "page_idx": 9}, {"type": "text", "text": "6 Conclusion and Broader Impact ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "In this study, we proposed ReMAP, a model repurposing strategy that leverages deep learning’s reprogramming property, incorporating network inversion principles and retrieval-augmented mapping. Our approach adapts models originally designed for able-bodied individuals to forecast joint motion in limb-impaired patients without altering model parameters. Our findings indicate that the proposed input refurbishing strategy offers a sample-efficient mechanism for adapting pretrained models to new scenarios. The proposed model reprogramming approach for adaptive motion forecasting has the potential to significantly enhance the quality of life for individuals with mobility impairments. By leveraging well-trained models from able-bodied data, this method can efficiently predict joint motions for mobility-impaired individuals, aiding in the development of more responsive and accurate assistive devices such as prostheses and orthoses. This approach minimizes the need for extensive retraining, making it both cost-effective and accessible for personalized healthcare applications. Furthermore, this technique is versatile and can be applied to other regression problems in domains where data scarcity presents a challenge. ", "page_idx": 9}, {"type": "text", "text": "Acknowledgements ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "The authors express their gratitude to Prof. Dr. Arndt F. Schilling (University Medical Center Göttingen, Georg-August University of Göttingen), Dr. Jennifer Ernst (University Medical Center Göttingen, Georg-August University of Göttingen), Dr. Massimo Sartori (University of Twente), Dr. Thomas Schmalz, Dr. Michael Ernst (Department of Clinical Research & Services, Ottobock SE & Co. KGaA, Germany), Dr. Takashi Yoshida (University Medical Center Göttingen, GeorgAugust University of Göttingen), and Dr.Mahdy Eslamy (Teesside University), for guidance, helping with experimental data collection involving lower-limb impaired subjects, and the writing of the ethics. The lower-limb impaired individuals’ data collection was carried out under grant number INOPRO-16SV7657 supported by the Federal Ministry of Education and Research (BMBF) https: //www.interaktive-technologien.de/projekte/inopro. ", "page_idx": 10}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "[1] Joerg Kindermann and Alexander Linden. Inversion of neural networks by gradient descent. Parallel computing, 14(3):277–286, 1990.   \n[2] Navid Ansari, Hans-Peter Seidel, Nima Vahidi Ferdowsi, and Vahid Babaei. Autoinverse: Uncertainty aware inversion of neural networks. Advances in Neural Information Processing Systems, 35:8675–8686, 2022.   \n[3] Pirzada Suhail, Supratik Chakraborty, and Amit Sethi. Network inversion of binarised neural nets. arXiv preprint arXiv:2402.11995, 2024.   \n[4] Wayne Xin Zhao, Jing Liu, Ruiyang Ren, and Ji-Rong Wen. Dense text retrieval based on pretrained language models: A survey. ACM Transactions on Information Systems, 42(4):1–60, 2024.   \n[5] Jiawei Zhou, Xiaoguang Li, Lifeng Shang, Xin Jiang, Qun Liu, and Lei Chen. Retrievalbased disentangled representation learning with natural language supervision. In The Twelfth International Conference on Learning Representations, 2023.   \n[6] George-Sebastian Pîrtoac˘a, Traian Rebedea, and S, tefan Ru,se,ti. Improving retrieval-based question answering with deep inference models. In 2019 International Joint Conference on Neural Networks (IJCNN), pages 1–8. IEEE, 2019.   \n[7] Kailash A Hambarde and Hugo Proenca. Information retrieval: recent advances and beyond. IEEE Access, 2023.   \n[8] Gamaleldin F Elsayed, Ian Goodfellow, and Jascha Sohl-Dickstein. Adversarial reprogramming of neural networks. arXiv preprint arXiv:1806.11146, 2018. [9] Yun-Yun Tsai, Pin-Yu Chen, and Tsung-Yi Ho. Transfer learning without knowing: Reprogramming black-box machine learning models with scarce data and limited resources. In International Conference on Machine Learning, pages 9614–9624. PMLR, 2020.   \n[10] Karen Hambardzumyan, Hrant Khachatrian, and Jonathan May. Warp: Word-level adversarial reprogramming. arXiv preprint arXiv:2101.00121, 2021.   \n[11] Chao-Han Huck Yang, Yun-Yun Tsai, and Pin-Yu Chen. Voice2series: Reprogramming acoustic models for time series classification. arXiv e-prints, pages arXiv–2106, 2021.   \n[12] Hao Yen, Pin-Jui Ku, Chao-Han Huck Yang, Hu Hu, Sabato Marco Siniscalchi, Pin-Yu Chen, and Yu Tsao. Neural model reprogramming with similarity based mapping for low-resource spoken command classification. In Annual Conference of the International Speech Communication Association, 2023.   \n[13] Tuan Dinh, Daewon Seo, Zhixu Du, Liang Shang, and Kangwook Lee. Improved input reprogramming for gan conditioning. arXiv preprint arXiv:2201.02692, 2022.   \n[14] Qizhou Wang, Feng Liu, Yonggang Zhang, Jing Zhang, Chen Gong, Tongliang Liu, and Bo Han. Watermarking for out-of-distribution detection. Advances in Neural Information Processing Systems, 35:15545–15557, 2022.   \n[15] Igor Melnyk, Vijil Chenthamarakshan, Pin-Yu Chen, Payel Das, Amit Dhurandhar, Inkit Padhi, and Devleena Das. Reprogramming pretrained language models for antibody sequence infliling. In International Conference on Machine Learning, pages 24398–24419. PMLR, 2023.   \n[16] Lingwei Chen, Yujie Fan, and Yanfang Ye. Adversarial reprogramming of pretrained neural networks for fraud detection. In Proceedings of the 30th ACM International Conference on Information & Knowledge Management, pages 2935–2939, 2021.   \n[17] Karen Simonyan, Andrea Vedaldi, and Andrew Zisserman. Deep inside convolutional networks: Visualising image classification models and saliency maps. arXiv preprint arXiv:1312.6034, 2013.   \n[18] Aravindh Mahendran and Andrea Vedaldi. Understanding deep image representations by inverting them. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 5188–5196, 2015.   \n[19] Alexey Dosovitskiy and Thomas Brox. Inverting visual representations with convolutional networks. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 4829–4837, 2016.   \n[20] Anh Nguyen, Jason Yosinski, and Jeff Clune. Multifaceted feature visualization: Uncovering the different types of features learned by each neuron in deep neural networks. arXiv preprint arXiv:1602.03616, 2016.   \n[21] Jun-Yan Zhu, Taesung Park, Phillip Isola, and Alexei A Efros. Unpaired image-to-image translation using cycle-consistent adversarial networks. In Proceedings of the IEEE international conference on computer vision, pages 2223–2232, 2017.   \n[22] Vladimir Karpukhin, Barlas O˘guz, Sewon Min, Patrick Lewis, Ledell Wu, Sergey Edunov, Danqi Chen, and Wen-tau Yih. Dense passage retrieval for open-domain question answering. arXiv preprint arXiv:2004.04906, 2020.   \n[23] Patrick Lewis, Ethan Perez, Aleksandra Piktus, Fabio Petroni, Vladimir Karpukhin, Naman Goyal, Heinrich Küttler, Mike Lewis, Wen-tau Yih, Tim Rocktäschel, et al. Retrieval-augmented generation for knowledge-intensive nlp tasks. Advances in Neural Information Processing Systems, 33:9459–9474, 2020.   \n[24] Gautier Izacard and Edouard Grave. Leveraging passage retrieval with generative models for open domain question answering. arXiv preprint arXiv:2007.01282, 2020.   \n[25] Erwin Aertbeliën and Joris De Schutter. Learning a predictive model of human gait for the control of a lower-limb exoskeleton. In 5th IEEE RAS/EMBS International Conference on Biomedical Robotics and Biomechatronics, pages 520–525. IEEE, 2014.   \n[26] Fabian Horst, Sebastian Lapuschkin, Wojciech Samek, Klaus-Robert Müller, and Wolfgang I Schöllhorn. Explaining the unique nature of individual gait patterns with deep learning. Scientific reports, 9(1):2391, 2019.   \n[27] Sharmita Dey, Sabri Boughorbel, and Arndt F Schilling. Learning a shared model for motorized prosthetic joints to predict ankle-joint motion. arXiv preprint arXiv:2111.07419, 2021.   \n[28] Erika V Zabre-Gonzalez, Lara Riem, Philip A Voglewede, Barbara Silver-Thorn, Sara R Koehler-McNicholas, and Scott A Beardsley. Continuous myoelectric prediction of future ankle angle and moment across ambulation conditions and their transitions. Frontiers in Neuroscience, 15:709422, 2021.   \n[29] Zachary Choffin, Nathan Jeong, Michael Callihan, Edward Sazonov, and Seongcheol Jeong. Lower body joint angle prediction using machine learning and applied biomechanical inverse dynamics. Sensors, 23(1):228, 2022.   \n[30] Sharmita Dey and Arndt F Schilling. A function approximator model for robust online foot angle trajectory prediction using a single imu sensor: Implication for controlling active prosthetic feet. IEEE Transactions on Industrial Informatics, 19(2):1467–1475, 2022.   \n[31] Sharmita Dey, Mahdy Eslamy, Takashi Yoshida, Michael Ernst, Thomas Schmalz, and ArndtF Schilling. A support vector regression approach for continuous prediction of ankle angle and moment during walking: An implication for developing a control strategy for active ankle prostheses. In 2019 IEEE 16th International Conference on Rehabilitation Robotics (ICORR), pages 727–733. IEEE, 2019.   \n[32] Feng-Yan Liang, Fei Gao, Junyi Cao, Sheung-Wai Law, and Wei-Hsin Liao. Gait synergy analysis and modeling on amputees and stroke patients for lower limb assistive devices. Sensors, 22(13):4814, 2022.   \n[33] Minjae Kim and Levi J Hargrove. A gait phase prediction model trained on benchmark datasets for evaluating a controller for prosthetic legs. Frontiers in Neurorobotics, 16:1064313, 2023.   \n[34] Sharmita Dey, Takashi Yoshida, and Arndt F Schilling. Feasibility of training a random forest model with incomplete user-specific data for devising a control strategy for active biomimetic ankle. Frontiers in Bioengineering and Biotechnology, 8:855, 2020.   \n[35] Blair Hu, Elliott Rouse, and Levi Hargrove. Benchmark datasets for bilateral lower-limb neuromechanical signals from wearable sensors during unassisted locomotion in able-bodied individuals. Frontiers in Robotics and AI, 5:14, 2018.   \n[36] Sharmita Dey, Takashi Yoshida, Robert H Foerster, Michael Ernst, Thomas Schmalz, Rodrigo M Carnier, and Arndt F Schilling. A hybrid approach for dynamically training a torque prediction model for devising a human-machine interface control strategy. arXiv preprint arXiv:2110.03085, 2021.   \n[37] Scott L Delp, Frank C Anderson, Allison S Arnold, Peter Loan, Ayman Habib, Chand T John, Eran Guendelman, and Darryl G Thelen. Opensim: open-source software to create and analyze dynamic simulations of movement. IEEE transactions on biomedical engineering, 54(11):1940–1950, 2007.   \n[38] Shaojie Bai, J Zico Kolter, and Vladlen Koltun. An empirical evaluation of generic convolutional and recurrent networks for sequence modeling. arXiv preprint arXiv:1803.01271, 2018. ", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "A Appendix ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "A.1 Network inversion ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "Starting with a random input $X^{(0)}\\sim\\mathcal{U}(0,1)$ , the gradient of loss, $\\mathcal{L}(g(X),\\tilde{y}_{a m p})$ , of the foundation module output is computed with respect to its input $X$ . At each iteration $t$ , the input is updated using gradient descent, ", "page_idx": 13}, {"type": "equation", "text": "$$\nX^{(t+1)}=X^{(t)}+\\eta{\\frac{\\partial{\\mathcal{L}}}{\\partial X^{(t)}}}\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "where $\\eta$ is the learning rate and $\\mathcal{L}$ is mean-squared error loss function, until convergence condition, $\\mathcal{L}(g(X),\\tilde{y}_{a m p})<\\tau$ , is satisfied. We used $\\eta=0.01$ , $\\tau=1e-4$ , and $\\lambda=1$ . ", "page_idx": 13}, {"type": "text", "text": "A.2 Theoretical basis ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "In line with [11], we define the population risk for the target task (mobility-impaired individual’s motion prediction) via reprogramming a pretrained source network (able-bodied model) to be upper bounded by the sum of two terms: ", "page_idx": 13}, {"type": "text", "text": "1. Source population risk: The risk associated with the source task, which is denoted as $R_{s}(f)$ . ", "page_idx": 13}, {"type": "text", "text": "2. Representation alignment loss: The Wasserstein-1 distance between the distributions of the source data (computed able-bodied template, $X^{s}$ ) and the reprogrammed target data $(h(X^{t}))$ . ", "page_idx": 13}, {"type": "text", "text": "Theorem Statement: Let $h$ denote the learned additive input transformation for reprogramming and $f$ is the pretrained model. The population risk for the target task $R_{t}(h)$ is upper bounded by: ", "page_idx": 13}, {"type": "equation", "text": "$$\nR_{t}(h)\\leq R_{s}(f)+W_{1}(X^{s},h(X^{t}))\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "However, the second term in the risk function is a strict constraint and a slight deviation in the representational alignment can lead to a large error in the output. The network-inversion based loss function relaxes the constraint such that the reprogrammed target data no longer needs to be similar to the source data. However, the constraint now changes to a representational similarity between reprogrammed target data and network inversion inputs such that ", "page_idx": 13}, {"type": "equation", "text": "$$\nR_{t}(h)\\leq R_{s}(f)+W_{1}(f^{-1}(y^{s}),h(X^{t})).\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "On the other hand, adding the target-based loss effectively relaxes this constraint by depending more on the source population risk and less on the stricter constraint of representational similarity of reprogrammed target data and source data. The target population risk becomes ", "page_idx": 13}, {"type": "equation", "text": "$$\nR_{t}(h)\\leq\\beta R_{s}(f)+\\alpha W_{1}(f^{-1}(y^{s}),h(X^{t})).\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "with $\\alpha+\\beta=1$ and $\\alpha<\\beta$ . Since the source population risk depends on the performance of the pretrained model $f$ , the population risk of the hybrid approach can effectively approach a lower error bound than 12 and 13. ", "page_idx": 13}, {"type": "text", "text": "A.3 Experimental details ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "Foundation module. The foundation module, $g$ , consists of a shared core $g_{s}$ and lightweight taskspecific prediction heads $g_{t}$ . The shared core consists of two time convolution layers, with a kernel size of 5 and dropout rate of 0.2. Each prediction head is a lightweight two-layer MLP with 200 and 100 units, with ReLU activation in hidden layers. The foundation module was trained using able-bodied data from a publicly available dataset [35] with a batch size of 100 for 25 epochs with stochastic gradient descent optimizer (learning rate of 1e-3 and momentum $=\\!0.9$ ). ", "page_idx": 13}, {"type": "text", "text": "Refurbish module. Since we require the refurbish module to be data-efficient, a simple three-layer MLP with 100 units each with ReLU activation was used. The model is trained for 100 epochs with a batch size of 100. A stochastic gradient descent optimizer with a learning rate of 1e-4 and momentum of 0.9 was used. ", "page_idx": 13}, {"type": "text", "text": "", "page_idx": 14}, {"type": "text", "text": "Compute resources. All experiments were compatible on single GPU (Nvdia GTX3070, 8GB) with 12 CPU cores (Intel i7). ", "page_idx": 14}, {"type": "text", "text": "A.4 Extended results ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Optimal Beta value We evaluated the performance of models for different beta values and found that the best performance was obtained with $\\beta=20$ which was eventually selected. The performance saturates at a $\\beta$ of 20 and diminishes for larger values of $\\beta$ . ", "page_idx": 14}, {"type": "table", "img_path": "dVqZ0a7LdP/tmp/bd10829a50784cfc3cd2820ee4009e24c5663f6f630d06031a8d0c94a37b4303.jpg", "table_caption": [], "table_footnote": [], "page_idx": 14}, {"type": "text", "text": "Correction-based mapping In the below table, we report the correction-based mapping results for different training ratios. It can be observed that for small amount of training data, the correctionbased method does not work well. However, as the amount of training data, the correction-based performance also increases (as the refurbish module becomes increasingly accurate). These results show that the performance of the correction-based mapping depends strongly on the accuracy of the refurbish module. By adding the target-based loss, this constraint is relaxed and the model now depends more on the performance of the pretrained model. ", "page_idx": 14}, {"type": "table", "img_path": "dVqZ0a7LdP/tmp/bc219d71ed4bca60cd6133c9af8b262da1883f5518a22e867fff9fe51e218ae2.jpg", "table_caption": [], "table_footnote": [], "page_idx": 14}, {"type": "text", "text": "A.5 User study ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "All the user studies presented here were approved by the Institutional Review Board (IRB) of the University Medical Center Göttingen. The participants gave their written consent to the study. Below you can find the snapshots of the general instructions given in the participant study, potential risks, precautions, and details about compensation. ", "page_idx": 14}, {"type": "text", "text": "General instructions’ snippets of relevant information given to participants during locomotion experiments (both Englishtranslated and German version below) ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "Dear Study Participant ", "page_idx": 15}, {"type": "text", "text": "We hereby ask you to participate in our research study, carried out in the Applied Surgical and Rehabilitation Technology Lab, Department of Trauma Surgery, Orthopaedics and Plastic Surgery. Your participation is voluntary and you can take back your consent at any time without giving any reason and without any influence on your current or future medical treatments. ", "page_idx": 15}, {"type": "text", "text": "Before submitting your consent, you have the right to be fully informed about the study. ", "page_idx": 15}, {"type": "text", "text": "Sehr geehrte Studienteilnehmerin, sehr geehrter Studienteilnehmer, ", "page_idx": 15}, {"type": "text", "text": "hiermit bitten wir Sie um die Teilnahme an einem unserer Forschungsprojekte, die im Applied Surgical and Rehabilitation Technologies Lab der Klinik fur Unfallchirurgie, Orthopädie und Plastischen Chirurgie durchgefuhrt werden. Ihre Teilnahme ist freiwillig und Sie konnen Ihre Zustimmung jederzeit ohne Angabe von Grunden und ohne Einfluss auf derzeitige oder zukunftige Behandlungen widerrufen. ", "page_idx": 15}, {"type": "text", "text": "Zur Abgabe Ihrer Einverständniserklärung haben Sie das Recht Ihre Entscheidung zu bedenken, sowie eine Vertrauensperson wahrend der mundlichen Aufklärung hinzuzuziehen. ", "page_idx": 15}, {"type": "text", "text": "Goal of the study ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "After a leg amputation, the amputated leg can be replaced by a prosthesis. But, we do not know what leads to the best use of a prosthesis. The use of a prosthesis can be influenced by surgical techniques, functions of the prosthesis, and the type of rehabilitation. In this study, we aim to find out what happens to the way people move after a leg amputation. For this purpose, we will examine how people with an amputated leg perform tasks, which are related to walking, standing, and sitting. For comparison, we will examine people that have not experienced amputation during the same tasks. In this study, we also aim to find out what happens to a leg after an amputation. For this purpose, we will examine the amputated leg in detail. Lastly, to better understand your situation, we will ask you to complete questionnaires about your amputation (if applicable), quality of life, and how physically active you are. All of the methods in this study are non-invasive. ", "page_idx": 16}, {"type": "text", "text": "segments, and range of motion. We will also attach electrodes and markers to your body for Parts 3 and 4. In Parts 3 and 4 (Movement Examination 1 and 2), we will ask you to perform tasks that involve sitting, standing, and walking. You have the right to refuse any tasks. ", "page_idx": 16}, {"type": "text", "text": "Part 5 (Physical Examination 2) will be performed on a different day from Parts 2, 3, and 4. Part 5 will only be performed for people with amputated legs. In Part 5, we want to examine whether people can feel gentle stimulation of the amputated and nonamputated legs. The gentle stimulation will include light touch, gentle vibrations, light pressure, and low-intensity electrical stimulation. All forms of stimulation are noninvasive. ", "page_idx": 16}, {"type": "table", "img_path": "dVqZ0a7LdP/tmp/60ea5813300a5ce4e96e9596026ca1348e4673cf1457ef5bcbb21e5a59d2eb19.jpg", "table_caption": [], "table_footnote": [], "page_idx": 17}, {"type": "text", "text": "Ziel der Studie ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "Eine Prothese ersetzt nach einer Amputation verlorene Funktionen des verlorenen Teils des Beins, wie zum Beispiel die Fähigkeit zu Gehen. Welche weiteren Auswirkungen durch die  Amputation  auf benachbarte  Gelenke und  den Amputationsstumpf auftreten oder welche Prothesenfunktionen oder Rehabilitationsstrategien zu einer optimalen Benutzung der Prothese fuhren ist unklar. ", "page_idx": 17}, {"type": "text", "text": "Daher ist das Ziel dieser Studie die Beurteilung typischer Veränderungen, die nach einer Amputation im Gangbild und am Stumpf auftreten. Hierfur werden Menschen, die amputiert sind im Ganglabor beim Gehen untersucht. Zudem wollen wir Ihren Amputationsstumpf und das gesunde Bein untersuchen und vergleichen. Untersucht werden zum Beispiel Empfindungen am Stumpf (z.B. kalt, warm, Schmerzen, Missempfindungen) oder Versorgung der Haut des Stumpfes mit Sauerstoff. Zum besseren Verständnis Ihrer Situation werden wir Ihnen Fragen stellen und Fragebogen austeilen. ", "page_idx": 17}, {"type": "text", "text": "Die Studie ist in 5 Teile aufgeteilt. Die Dauer der Einzelteile der Studie konnen Sie aus der Tabelle entnehmen. Am Anfang jedes Untersuchungsteils gibt es eine kurze Einfuhrung in das Protokoll und mogliche Risiken der Prozedur. Zu diesem Zeitpunkt sowie während des ganzen Versuchs haben die Probanden die Moglichkeit Fragen zu stellen und das Experiment abzubrechen. ", "page_idx": 18}, {"type": "text", "text": "Bei den beschriebenen Methoden handelt es sich um medizinische Standardverfahren, wie sie im taglichen Klinikbetrieb verwendet werden. Im ersten Teil (Interview) werden Sie befragt und gebeten Fragebogen zu vervollständigen, die wir Ihnen vorab per Post zugestellt haben. Die Teile 2, 3 und 4 werden am selben Tag durchgefuhrt. Dann werden einige Untersuchungen (korperliche Untersuchung 1) zu Ihrer Korperstatik an Ihnen im Liegen und Stehen durchgefuhrt. ", "page_idx": 18}, {"type": "text", "text": "Im dritten und vierten Teil des Versuchs (aktive Untersuchung 1&2) werden Winkelsensoren und reflektierende Marker an Ihnen befestigt, durch die wir mit Kameras Ihr Bewegungen aufzeichnen und genau nachvollziehen konnen wie sie mit Ihrer Prothese gehen. ", "page_idx": 18}, {"type": "text", "text": "Teil 5 wird an einem anderen Tag als Teil 2, 3 und 4 durchgefuhrt. Teil 5 wird nur fur Menschen mit amputierten Beinen durchgefuhrt. Im letzten, dem funften Teil des Versuchs (korperliche Untersuchung 2) mochten wir untersuchen, ob an bestimmten Stellen der Hautoberflache des Stumpfs Empfindungen fur das amputierte GliedmaB ausgelost werden konnen. Dies wird durch leichte Berihrung mit Wattestäbchen systematisch untersucht. In einem zweiten Schritt werden zwei Arten taktiler Stimulation benutzt, um den Tastsinn anzuregen. Einerseits werden durch kleine Elektromotoren sanfte Vibrationen und/oder ein leichter Druck auf der Haut erzeugt. Diese Elektromotoren werden mit einem elastischen Band am Stumpf und dem gesunden Bein angebracht. Dieser Vorgang ist vollkommen schmerzfrei und ohne bleibende Schaden. Als andere Stimulationsart wird eine elektrische Stimulation mit Hilfe kleiner Elektroden erzeugt. Die selbstklebenden Elektroden werden auf der Hautoberflache angebracht. Diese Art der Stimulation wird als ,elektrokutane Stimulation\" bezeichnet, weil ein Strom geringer Intensität oberflachlich die Haut stimuliert. Die ausgelosten Empfindungen konnen einer Kombination des Klopfens, Drucks, und/oder des Vibrierens entsprechen. Bis zu 16 kleine Motoren werden an GliedmaB- und Stumpfarealen angebracht. Die beiden erwahnten Methoden, d.h. elektrische und mechanische Stimulation, beruhen auf allgemein verwendeten Methoden, um gefuhlsmaBige Ruckkopplungssignale im geschlossenen Regelkreis zu liefern. Diese Methoden wurden bereits in mehreren vergangenen Studien sichel angewendet. In dieser Studie mochten wir testen, wie empfindlich die Probanden ar den stimulierten Stellen sind. Genauer geht es darum unterschiedlich starke Aktivierungen einzuordnen (kaum spurbar, klar wahrnehmbare und fast unangenehme Vibrationen). ", "page_idx": 18}, {"type": "text", "text": "", "page_idx": 19}, {"type": "text", "text": "Wir wurden uns sehr freuen, wenn Sie die Fragen und Fragebogen wahrenc unseres Versuchs zu Ihrer Person und Ihrer korperlichen Verfassung beantworter wurden. Wenn lhnen eine Frage unangenehm ist, steht es Ihnen selbstverständlich frei, darauf nicht zu antworten. ", "page_idx": 19}, {"type": "text", "text": "", "page_idx": 19}, {"type": "table", "img_path": "dVqZ0a7LdP/tmp/485fa98837d66a6133b33dafdc73aa4a278db8f7a8c78c663691033bf4dec46b.jpg", "table_caption": [], "table_footnote": [], "page_idx": 19}, {"type": "text", "text": "Risiken ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Die Risiken der zuvor beschriebenen Schritte sind minimal. ", "page_idx": 20}, {"type": "text", "text": "Die nicht-invasiven  Schritte zur  Applizierung  der  Oberflachenelektroden (Stimulation und EMG) konnen zu leichtem Unbehagen durch Abrieb an der Haut fuhren.  Das  zur   Verbesserung  des  Haut-Elektroden-Kontaktes  verwendete Hautreinigungsgel kann in sehr seltenen Fällen zu allergischen Reaktionen in Form von lokalen Rotungen fuhren. Manche Probanden konnen die Stimulation mit leichtem Strom/Vibration/Druck als unangenehm empfinden. Speziell fur den Fall der Elektrostimulation kann die Haut unter der Stimulationselektrode eine leichte Rotung aufweisen. Nach Unterbrechung der Stimulation ist die Rotung im Normalfall nach 30- 60 Minuten nicht mehr vorhanden. Selten kann eine allergische Reaktion durch die Elektrostimulation entstehen (lokale Schwellung oder Rotung). Wenn die Elektrostimulation nicht ordnungsgemaB durchgefuhrt wird, kann diese als schmerzhaft empfunden werden. Unser Versuchsaufbau verwendet Standardverfahren mit minimaler Stimulationsintensitäat, wodurch dieses Risiko minimiert wird. ", "page_idx": 20}, {"type": "text", "text": "", "page_idx": 20}, {"type": "text", "text": "Personal data ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "During the study, all of the data that we collect from you will be pseudonymized. This means that your data will be labeled with a randomly generated code, not with your name. Only the study investigators will know which code applies to your data. Also, your face will not appear in any of the photographs that we take. ", "page_idx": 21}, {"type": "text", "text": "For this study, we are partnering with Otto Bock GmbH (Germany) and the University of Twente (The Netherlands). Our partners will only receive anonymized data. This means that our partners cannot trace the data to your identity. For research purposes, we may send the collected data to third parties (people or institutions that are not the study investigators). Third parties will only receive anonymized data. For publishing our findings in academic journals, we will only use anonymized data. ", "page_idx": 21}, {"type": "text", "text": "If you decide to take back your consent or withdraw from the study, your data will be deleted. After this study is terminated, the pseudonymized data will be stored for 10 years. ", "page_idx": 21}, {"type": "text", "text": "Personliche Daten ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Wahrend der Studie werden personenbezogene Gesundheitsdaten erhoben und in pseudonymisierter Form aufgezeichnet. Pseudonymisierung bedeutet Verschlusselung von Daten ohne Namensnennung nur mit Nummern codiert. Die Zuordnung der Daten oder Proben zu einer Person ist nur moglich, wenn hierfur der Schlussel eingesetzt wird, mit dem die Daten pseudonymisiert wurden. Die personenbezogenen Daten/Proben werden unter besonderen Schutzvorkehrungen getrennt von der Schlusselliste aufbewahrt. Eine Entschlusselung ist nur durch die fur die Studie verantwortlichen Personen moglich. Dritte erhalten keinen Einblick in die Originalunterlagen. Die Datenspeicherungszeit  beträgt   10  Jahre. Eine Datenweitergabe pseudonymisierter, das heiBt verschluisselter, Daten ist mit den Kooperationspartnern der Firma Otto Bock und der Universität Twente in den Niederlanden geplant. Dies betrifft Daten aller Teilexperimente. Dabei ist sichergestellt dass der Forschungspartner die Daten nicht auf einzelne Personen ruickverfolgen kann. Bei Widerruf der Studienteilnahme werden die personenbezogenen Daten geloscht. Eine Veroffentlichung findet nur mit anonymen Daten statt. Die experimentellen Ergebnisse konnen einer dritten Person fur Forschungszwecke weiter gegeben werden. In diesem Fall werden die Daten verschlusselt und der Privatbereich der Teilnehmer vollig geschutzt sein. ", "page_idx": 22}, {"type": "text", "text": "Participating in the Study ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "To participate in this study, you must be willing and legally able to provide your written informed consent. Your eligibility will be checked by a medical doctor. If any of the following conditions applies to you, you cannot participate in the study: ", "page_idx": 22}, {"type": "text", "text": "Medical conditions that cause visibly abnormal movement Examples: Broken bones, pain ", "page_idx": 23}, {"type": "text", "text": "· A major amputation other than an above-knee, below-knee, or through-knee amputation on one side ", "page_idx": 23}, {"type": "text", "text": "Dementia ", "page_idx": 23}, {"type": "text", "text": "Open wounds, swelling, infection, or pain in the amputated leg ", "page_idx": 23}, {"type": "text", "text": "Risk of stress fractures or fractures from low-impact falls ", "page_idx": 23}, {"type": "text", "text": "Pregnancy ", "page_idx": 23}, {"type": "text", "text": "Addiction to drugs or alcohol ", "page_idx": 23}, {"type": "text", "text": "Inability to communicate with the investigators ", "page_idx": 23}, {"type": "text", "text": "Lack of cooperation with the investigators ", "page_idx": 23}, {"type": "text", "text": "Medical conditions that make participation dangerous Example: cardiovascular disease ", "page_idx": 23}, {"type": "text", "text": "Teilnahme an der Studie ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Voraussetzung fur die Teilnahme an der Studie ist die Einwilligung und Einwilligungsfahigkeit. Die Ein- und Ausschlusskriterien werden von einem Arzt ", "page_idx": 23}, {"type": "text", "text": "uberpruft. Sollte eine der folgenden Punkte auf Sie zutreffen, ist eine Teilnahme an der Studie nicht moglich: ", "page_idx": 23}, {"type": "text", "text": "Premature Interruption of the Study ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "If you experience any discomfort during the study, you have the right to stop participating in the study. If you develop any condition that makes you ineligible for the study while you are participating, the investigators will stop your participation. You have the right to stop your participation at any time for any reason. If your participation is stopped prematurely, you will be paid for the time you have spent. ", "page_idx": 23}, {"type": "text", "text": "Approval of the Study ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "All procedures for this study have been approved by the responsible ethics committee under the processing number XXXXXX. ", "page_idx": 23}, {"type": "text", "text": "Reimbursement ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "You will be reimbursed at $\\epsilon{10}$ per hour for your participation. This includes the time required for transportation to and from the study. ", "page_idx": 24}, {"type": "text", "text": "Further Questions ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "If you have any further questions, please do not hesitate to contact us. ", "page_idx": 24}, {"type": "text", "text": "Your Study Team ", "page_idx": 24}, {"type": "text", "text": "Abbruch der Studie ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Falls bei Ihnen unerwartet Rotungen, allergische Reaktionen, Herz- Kreislauf Symptome während des Versuches auftreten oder Sie im Verlauf Ausschlusskriterien aufweisen, dann kann jeder einzelne Versuchsschritt jederzeit abgebrochen werden. Sie erhalten dann eine Bezahlung entsprechend dem Zeitaufwand, an dem Sie tatsächlich teilgenommen haben. Sie konnen zu jedem Zeitpunkt die Teilnahme am Forschungsprojekt abrechen. Naturlich wurden wir dann gerne von Ihnen wissen wollen, warum Sie die Teilnahme abbrechen. Aber Sie brauchen uns keine Grunde nennen, wenn Sie nicht mochten. ", "page_idx": 25}, {"type": "text", "text": "Genehmigung des Versuchs ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Die Versuchsdurchfuhrung, die wir Ihnen hier vorstellen, wurde von der zuständingen Ethik-Kommission unter der Bearbeitungsnummer 26/3/18 zustimmend bewertet. ", "page_idx": 25}, {"type": "text", "text": "Aufwandsentschadigung ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Zur Aufwandsentschädigung fur die Teilnahme an der Studie erhalten Sie einen Betrag von 10 E/h. Im Falle eines vorzeitigen Abbruchs der Studie erhalten Sie ebenfalls eine Aufwandsentschädigung, entsprechend der bis dahin beanspruchten Zeit. Die Anreisezeit wird ebenfalls mit $10\\,\\epsilon/\\mathfrak{h}$ entschadigt. ", "page_idx": 25}, {"type": "text", "text": "Weitere Fragen ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Sollten Sie weitere Fragen haben, zogern Sie nicht die Prufdurchfuhrenden anzusprechen. ", "page_idx": 25}, {"type": "text", "text": "Bei Fragen stehen wir Ihnen gerne zur Verfuigung. ", "page_idx": 25}, {"type": "text", "text": "Ihr Studien-Team ", "page_idx": 25}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Justification: We propose a data-efficient model re-purposing approach by which a model trained for motion prediction in able-bodied subjects could be adapted for individuals with limb loss. Through extensive comparisons, we show that our proposed approach outperforms other baseline and state-of-the-art approaches, as shown in Fig. 5 and Tab. 1 ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 26}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Justification: We have included a Limitations section in the manuscript which discusses the limitations of our study. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 26}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 27}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 27}, {"type": "text", "text": "Justification: The paper does not include theoretical results ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 27}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 27}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 27}, {"type": "text", "text": "Justification: We have detailed the approach in the Methods section with details on the network used and the hyperparameters for the network and the proposed retrieval-based template matching strategy. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 27}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 28}, {"type": "text", "text": "Answer: [No] ", "page_idx": 28}, {"type": "text", "text": "Justification: The data is related to a consortium project and requires permission from all involved parties. ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 28}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 28}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Justification: In the Methods and Appendix sections of the paper, we have provided the details regarding the training. ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 28}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 28}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 28}, {"type": "text", "text": "Justification: Although we did not perform a statistical significance analysis, we have provided error bars in the results wherever it is applicable. In one of the figures (Fig. 4 right), we could not provide error bars due to the two-dimensional structure of this figure. Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper. ", "page_idx": 28}, {"type": "text", "text": "• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 29}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 29}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 29}, {"type": "text", "text": "Justification: The details on the compute resources are provided in the appendix. We did not compute the time requirements during our experiments. ", "page_idx": 29}, {"type": "text", "text": "Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 29}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 29}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 29}, {"type": "text", "text": "Justification: We have carefully read the NeurIPS Code of Ethics and reviewed that our work conforms with it. ", "page_idx": 29}, {"type": "text", "text": "Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 29}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 29}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 29}, {"type": "text", "text": "Justification: We have included a section on Broader Impact which discusses the positive societal impact of our study. We do not expect any negative societal impacts of our study. Guidelines: ", "page_idx": 29}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed.   \n• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 30}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 30}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 30}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 30}, {"type": "text", "text": "Justification: NA ", "page_idx": 30}, {"type": "text", "text": "Guidelines: ", "page_idx": 30}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 30}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 30}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 30}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 30}, {"type": "text", "text": "Justification: We have used a publicly available dataset of able-bodied locomotion [35] (License: CC BY 4.0) to train our foundational module. We have explicitly mentioned this in the Datasets section and provided citation to the related paper. ", "page_idx": 30}, {"type": "text", "text": "Guidelines: ", "page_idx": 30}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 30}, {"type": "text", "text": "", "page_idx": 31}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 31}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 31}, {"type": "text", "text": "Justification: No new assets are released in the paper. ", "page_idx": 31}, {"type": "text", "text": "Guidelines: ", "page_idx": 31}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 31}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 31}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Justification: We have provided the full text of instructions given to participants and screenshots and the details about compensation in the appendix. ", "page_idx": 31}, {"type": "text", "text": "Guidelines: ", "page_idx": 31}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 31}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 31}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 31}, {"type": "text", "text": "Justification: We provided the snapshots of the participant information and potential risks. Guidelines: ", "page_idx": 31}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects. ", "page_idx": 31}, {"type": "text", "text": "• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 32}]