[{"figure_path": "pX71TM2MLh/tables/tables_8_1.jpg", "caption": "Table 1: Our attack is effective while maintaining utility.", "description": "This table presents the results of the Data-Free Backdoor Attack (DFBA) on various datasets and models.  It shows the Clean Accuracy (CA), Backdoored Accuracy (BA), and Attack Success Rate (ASR). The CA represents the accuracy of the model on clean inputs, BA represents the accuracy of the backdoored model on clean inputs, and ASR shows the success rate of the attack on backdoored inputs.  The results demonstrate that DFBA maintains high accuracy on clean inputs while achieving a 100% attack success rate on backdoored inputs.", "section": "5.2 Experimental Results"}, {"figure_path": "pX71TM2MLh/tables/tables_9_1.jpg", "caption": "Table 1: Our attack is effective while maintaining utility.", "description": "This table presents the results of the proposed Data-Free Backdoor Attack (DFBA) on several datasets and models.  It shows the Clean Accuracy (CA), Backdoored Accuracy (BA), and Attack Success Rate (ASR).  High ASR values indicate the effectiveness of the attack, while comparable CA and BA demonstrate that the attack maintains the model's utility on clean data.  The results showcase high ASR values (100%) across all datasets and models, with minimal loss in clean accuracy.", "section": "5.2 Experimental Results"}, {"figure_path": "pX71TM2MLh/tables/tables_16_1.jpg", "caption": "Table 1: Our attack is effective while maintaining utility.", "description": "This table presents the performance of the proposed data-free backdoor attack (DFBA) on various datasets and models.  It shows the clean accuracy (CA), backdoored accuracy (BA), and attack success rate (ASR) achieved by the attack.  The results demonstrate that DFBA effectively injects a backdoor without significantly impacting the model's accuracy on clean data, achieving 100% attack success rates across all datasets and models, with a minimal difference between clean and backdoored accuracy.", "section": "5.2 Experimental Results"}, {"figure_path": "pX71TM2MLh/tables/tables_16_2.jpg", "caption": "Table 1: Our attack is effective while maintaining utility.", "description": "This table presents the effectiveness of the proposed Data Free Backdoor Attack (DFBA) method.  It demonstrates the attack's ability to maintain high classification accuracy (CA) while achieving 100% attack success rate (ASR) across multiple datasets and models. The difference between the backdoored accuracy (BA) and CA is consistently less than 3%, indicating minimal impact on the model's original performance.  This highlights the stealthiness of DFBA.", "section": "5.2 Experimental Results"}, {"figure_path": "pX71TM2MLh/tables/tables_17_1.jpg", "caption": "Table 4: Dataset statistics.", "description": "The table presents the number of training and testing images, and the number of classes for five benchmark image datasets: MNIST, Fashion-MNIST, CIFAR10, GTSRB, and ImageNet.  These statistics are important for understanding the scale and complexity of the experiments conducted in the paper, and for comparing the performance of the proposed attack across diverse datasets.", "section": "5.1 Experimental Setup"}, {"figure_path": "pX71TM2MLh/tables/tables_17_2.jpg", "caption": "Table 5: Number of clean testing inputs and backdoored testing inputs that can activate our backdoor path.", "description": "This table shows the number of clean and backdoored test inputs that successfully activated the backdoor path created by the proposed Data-Free Backdoor Attack (DFBA) method.  The results are broken down by model architecture (FCN, CNN, VGG16, ResNet-18, ResNet-50, ResNet-101) and dataset (MNIST, Fashion-MNIST, CIFAR10, GTSRB, ImageNet).  A value of '0/10000' indicates that none of the 10,000 clean test inputs activated the backdoor path, while '10000/10000' indicates that all 10,000 backdoored test inputs did. This demonstrates the high effectiveness of DFBA in activating the backdoor path for backdoored inputs while avoiding activation by clean inputs.", "section": "5.2 Experimental Results"}, {"figure_path": "pX71TM2MLh/tables/tables_19_1.jpg", "caption": "Table 6: Our attack is effective under I-BAU [53].", "description": "This table presents the effectiveness of the proposed DFBA (Data-Free Backdoor Attack) against the I-BAU defense.  It shows the accuracy (ACC) and attack success rate (ASR) before and after applying the I-BAU defense to FCN and CNN models.  The results demonstrate that DFBA maintains a high ASR even after the defense is applied, indicating its resilience to this specific defense mechanism.", "section": "5.2 Experimental Results"}]