[{"figure_path": "wZigMVFURk/tables/tables_1_1.jpg", "caption": "Table 2: Comparison between RoPINN and other objective functions (gPINN [55] and vPINN [18]) under different base models. Metrics for PINNacle [12] are the proportions of improved tasks over 16 tasks, where full results can be found in Appendix E. A lower loss, rMAE or rMSE indicates better performance. For clarity, we highlight the value with blue if it surpasses the vanilla PINN and the best is in bold. Promotion refers to the relative promotion of ROPINN over the vanilla version.", "description": "This table compares the performance of RoPINN against gPINN and vPINN across various base models and benchmark PDEs.  It shows the loss (loss function), mean absolute error (MAE), and root mean squared error (RMSE) for each method, highlighting improvements over the standard PINN.  The PINNacle results display the percentage of tasks where RoPINN improved upon the vanilla PINN.  'Promotion' indicates the percentage increase in performance achieved by RoPINN over the standard PINN.", "section": "4.1 Main Results"}, {"figure_path": "wZigMVFURk/tables/tables_6_1.jpg", "caption": "Table 2: Comparison between RoPINN and other objective functions (gPINN [55] and vPINN [18]) under different base models. Metrics for PINNacle [12] are the proportions of improved tasks over 16 tasks, where full results can be found in Appendix E. A lower loss, rMAE or rMSE indicates better performance. For clarity, we highlight the value with blue if it surpasses the vanilla PINN and the best is in bold. Promotion refers to the relative promotion of ROPINN over the vanilla version.", "description": "This table compares the performance of RoPINN against gPINN and vPINN across various PINN base models (PINN, QRes, FLS, PINNsFormer, KAN) on several benchmarks (1D-Reaction, 1D-Wave, Convection, PINNacle).  It shows the loss, rMAE, rMSE values, and the percentage improvement of RoPINN over the standard PINN for each task.  The PINNacle results are presented as the proportion of improved tasks.  The table highlights the superior performance of RoPINN in most cases.", "section": "4.1 Main Results"}, {"figure_path": "wZigMVFURk/tables/tables_7_1.jpg", "caption": "Table 2: Comparison between RoPINN and other objective functions (gPINN [55] and vPINN [18]) under different base models. Metrics for PINNacle [12] are the proportions of improved tasks over 16 tasks, where full results can be found in Appendix E. A lower loss, rMAE or rMSE indicates better performance. For clarity, we highlight the value with blue if it surpasses the vanilla PINN and the best is in bold. Promotion refers to the relative promotion of ROPINN over the vanilla version.", "description": "This table compares the performance of RoPINN against gPINN and vPINN across various PINN base models on several benchmark PDEs.  It presents loss values (Loss), relative mean absolute error (rMAE), and relative root mean squared error (rMSE) for each model and benchmark. The \"PINNacle\" section shows the percentage of tasks where RoPINN outperformed the vanilla PINN.  The \"Promotion\" row indicates the percentage improvement achieved by RoPINN compared to the vanilla version. The table highlights the superior and consistent performance of RoPINN.", "section": "4.1 Main Results"}, {"figure_path": "wZigMVFURk/tables/tables_7_2.jpg", "caption": "Table 2: Comparison between RoPINN and other objective functions (gPINN [55] and vPINN [18]) under different base models. Metrics for PINNacle [12] are the proportions of improved tasks over 16 tasks, where full results can be found in Appendix E. A lower loss, rMAE or rMSE indicates better performance. For clarity, we highlight the value with blue if it surpasses the vanilla PINN and the best is in bold. Promotion refers to the relative promotion of ROPINN over the vanilla version.", "description": "This table compares the performance of RoPINN against two other objective functions (gPINN and vPINN) across various base models for solving different PDEs.  The metrics used are training loss, rMAE (relative mean absolute error), and rMSE (relative root mean squared error).  The PINNacle benchmark's results are presented as the percentage of tasks where RoPINN improved upon the vanilla PINN.  Blue highlights values exceeding the vanilla PINN's performance, and bold highlights the best-performing method.  The \"Promotion\" column indicates the performance improvement achieved by RoPINN over the vanilla PINN.", "section": "4.1 Main Results"}, {"figure_path": "wZigMVFURk/tables/tables_26_1.jpg", "caption": "Table 2: Comparison between RoPINN and other objective functions (gPINN [55] and vPINN [18]) under different base models. Metrics for PINNacle [12] are the proportions of improved tasks over 16 tasks, where full results can be found in Appendix E. A lower loss, rMAE or rMSE indicates better performance. For clarity, we highlight the value with blue if it surpasses the vanilla PINN and the best is in bold. Promotion refers to the relative promotion of ROPINN over the vanilla version.", "description": "This table compares the performance of RoPINN against two other objective functions (gPINN and vPINN) across various base models for several PDE benchmark problems.  It shows loss values (Loss), relative mean absolute error (rMAE), and relative root mean squared error (rMSE) for each model and benchmark.  PINNacle results are shown as the percentage of improved tasks.  Blue highlighting indicates when RoPINN outperforms the standard PINN, and bold values are the best results.  The 'Promotion' column indicates the improvement in performance achieved by RoPINN relative to the standard PINN.", "section": "4.1 Main Results"}, {"figure_path": "wZigMVFURk/tables/tables_28_1.jpg", "caption": "Table 2: Comparison between RoPINN and other objective functions (gPINN [55] and vPINN [18]) under different base models. Metrics for PINNacle [12] are the proportions of improved tasks over 16 tasks, where full results can be found in Appendix E. A lower loss, rMAE or rMSE indicates better performance. For clarity, we highlight the value with blue if it surpasses the vanilla PINN and the best is in bold. Promotion refers to the relative promotion of ROPINN over the vanilla version.", "description": "This table compares the performance of RoPINN against two other objective functions (gPINN and vPINN) across various base models (PINN, QRes, FLS, PINNs-Former, KAN) and benchmarks (1D-Reaction, 1D-Wave, Convection, PINNacle).  It presents loss, rMAE (relative mean absolute error), and rMSE (relative mean squared error) for each method.  The PINNacle results show the percentage of tasks improved by RoPINN compared to the vanilla PINN.  Blue highlights indicate when ROPINN outperforms the standard PINN baseline, and bold indicates the best results overall.  The table also shows the performance improvement achieved by ROPINN relative to each vanilla PINN.", "section": "4.1 Main Results"}, {"figure_path": "wZigMVFURk/tables/tables_28_2.jpg", "caption": "Table 2: Comparison between RoPINN and other objective functions (gPINN [55] and vPINN [18]) under different base models. Metrics for PINNacle [12] are the proportions of improved tasks over 16 tasks, where full results can be found in Appendix E. A lower loss, rMAE or rMSE indicates better performance. For clarity, we highlight the value with blue if it surpasses the vanilla PINN and the best is in bold. Promotion refers to the relative promotion of ROPINN over the vanilla version.", "description": "This table compares the performance of RoPINN against two other objective functions, gPINN and vPINN, across various base models.  It shows the loss, rMAE (relative mean absolute error), and rMSE (relative mean squared error) for several PDE benchmarks (1D-Reaction, 1D-Wave, Convection) and the proportion of improved tasks on the PINNacle benchmark. Blue highlights indicate performance superior to the vanilla PINN, while bold indicates the best performance overall.", "section": "4.1 Main Results"}, {"figure_path": "wZigMVFURk/tables/tables_29_1.jpg", "caption": "Table 2: Comparison between RoPINN and other objective functions (gPINN [55] and vPINN [18]) under different base models. Metrics for PINNacle [12] are the proportions of improved tasks over 16 tasks, where full results can be found in Appendix E. A lower loss, rMAE or rMSE indicates better performance. For clarity, we highlight the value with blue if it surpasses the vanilla PINN and the best is in bold. Promotion refers to the relative promotion of ROPINN over the vanilla version.", "description": "This table compares the performance of RoPINN against two other objective functions (gPINN and vPINN) across various base PINN models.  It shows the loss, rMAE (relative mean absolute error), and rMSE (relative mean squared error) for different PDE benchmarks (1D-Reaction, 1D-Wave, Convection) and the proportion of improved tasks for PINNacle, a more comprehensive benchmark.  Blue highlights indicate where RoPINN outperforms the vanilla PINN, and bold indicates the best result.  The \"Promotion\" column shows the percentage improvement achieved by RoPINN over the baseline PINN model.", "section": "4.1 Main Results"}, {"figure_path": "wZigMVFURk/tables/tables_30_1.jpg", "caption": "Table 2: Comparison between RoPINN and other objective functions (gPINN [55] and vPINN [18]) under different base models. Metrics for PINNacle [12] are the proportions of improved tasks over 16 tasks, where full results can be found in Appendix E. A lower loss, rMAE or rMSE indicates better performance. For clarity, we highlight the value with blue if it surpasses the vanilla PINN and the best is in bold. Promotion refers to the relative promotion of ROPINN over the vanilla version.", "description": "This table compares the performance of RoPINN against gPINN and vPINN across various base models (PINN, QRes, FLS, PINNsFormer, KAN) on multiple PDE benchmark datasets (1D-Reaction, 1D-Wave, Convection, and PINNacle).  It shows loss (Loss), relative mean absolute error (rMAE), and relative root mean squared error (rMSE) values.  The PINNacle results indicate the percentage of tasks where RoPINN improved performance.  Blue highlights values exceeding those of the vanilla PINN, and boldface highlights the best result.", "section": "4.1 Main Results"}, {"figure_path": "wZigMVFURk/tables/tables_31_1.jpg", "caption": "Table 2: Comparison between RoPINN and other objective functions (gPINN [55] and vPINN [18]) under different base models. Metrics for PINNacle [12] are the proportions of improved tasks over 16 tasks, where full results can be found in Appendix E. A lower loss, rMAE or rMSE indicates better performance. For clarity, we highlight the value with blue if it surpasses the vanilla PINN and the best is in bold. Promotion refers to the relative promotion of ROPINN over the vanilla version.", "description": "This table compares the performance of RoPINN against gPINN and vPINN across various PINN base models on several benchmark PDEs.  It shows the loss (loss function), mean absolute error (MAE), and root mean squared error (RMSE) for each method, highlighting improvements achieved by RoPINN.  The results for PINNacle are presented as the percentage of improved tasks out of 16 total tasks.", "section": "4.1 Main Results"}]