[{"figure_path": "rPgc5brxmT/figures/figures_1_1.jpg", "caption": "Figure 1: (Left) Wasserstein flow of the MMD energy [Arbel et al., 2019]. Some particles get stuck at points away from the target. (Right) IFT gradient flow (this paper) of the MMD energy. Particle mass is teleported to close to the target, avoiding local minima. Hollow circles indicate particles with zero mass. The red dots are the initial particles, and the green dots are the target distribution. See §4 for more details.", "description": "This figure compares the Wasserstein flow and the Interaction-Force Transport (IFT) gradient flow for minimizing the Maximum Mean Discrepancy (MMD) energy.  The left panel shows the Wasserstein flow, where some particles get stuck in local minima and do not reach the target distribution (green dots). The right panel illustrates the IFT flow, which allows for the teleportation of particle mass, enabling a more efficient convergence to the target distribution by avoiding local minima.  The initial particle distribution is represented by red dots, while hollow circles depict particles with zero mass after the flow.", "section": "1 Introduction"}, {"figure_path": "rPgc5brxmT/figures/figures_3_1.jpg", "caption": "Figure 2: Illustration of the IFT gradient flow. Atoms are subject to both the transport (Kantorovich) potential and the interaction (repulsive) force from other atoms.", "description": "This figure illustrates the concept of Interaction-Force Transport (IFT) gradient flow.  It shows how atoms (or particles representing probability mass) move under the combined influence of two forces: a transport force (similar to optimal transport) and an interaction force (representing repulsive interactions between particles). The transport force moves particles towards the gradient of the energy functional, whereas the interaction force influences the way that particles move. The overall effect is a gradient flow that is faster than the one produced by the transport force only, potentially leading to better convergence.  The hollow circle indicates a particle which has mass zero.", "section": "3 IFT gradient flows over non-negative and probability measures"}, {"figure_path": "rPgc5brxmT/figures/figures_4_1.jpg", "caption": "Figure 2: Illustration of the IFT gradient flow. Atoms are subject to both the transport (Kantorovich) potential and the interaction (repulsive) force from other atoms.", "description": "The figure illustrates the IFT gradient flow, showing how atoms (or particles) are subject to two forces: a transport force (from optimal transport) and an interaction force (repulsive force from other atoms). The combined effect of these forces leads to the movement of particles towards the target distribution, avoiding issues like getting stuck in local minima.", "section": "3 IFT gradient flows over non-negative and probability measures"}, {"figure_path": "rPgc5brxmT/figures/figures_8_1.jpg", "caption": "Figure 3: Mean loss and standard deviation computed over 50 runs", "description": "This figure shows the mean and standard deviation of the loss for three different algorithms across 50 runs.  The algorithms are compared on two different target distributions: (a) a Gaussian target distribution and (b) a Gaussian mixture target distribution.  The plots illustrate the performance of the MMD flow, MMD flow with added noise, and the IFT GD (Interaction-Force Transport Gradient Descent) algorithm. The shaded regions represent the standard deviations, providing insight into the variability of performance across multiple runs.", "section": "4 Numerical Example"}, {"figure_path": "rPgc5brxmT/figures/figures_8_2.jpg", "caption": "Figure 4: Trajectory of a randomly selected subsample produced by different algorithms in the Gaussian target experiment. Color intensity indicates points’ weights. The hollow dots indicate the particles that have already vanished.", "description": "This figure compares three different algorithms used for sampling from a Gaussian target distribution: Vanilla MMD flow, MMD flow with noise injection, and the proposed IFT (Algorithm 1).  Each point represents a particle, with color intensity indicating its weight (mass).  Hollow circles show particles that have been teleported and have zero weight. The plots show the trajectory of a randomly selected subset of particles over iterations.  The figure demonstrates that the proposed IFT method effectively avoids local minima and performs better than other algorithms by teleporting particles with low weights, as seen by the relatively higher concentration of particles around the target mode, compared to other approaches.", "section": "4 Numerical Example"}, {"figure_path": "rPgc5brxmT/figures/figures_8_3.jpg", "caption": "Figure 4: Trajectory of a randomly selected subsample produced by different algorithms in the Gaussian target experiment. Color intensity indicates points' weights. The hollow dots indicate the particles that have already vanished.", "description": "This figure compares the performance of three different algorithms (Vanilla MMD flow, MMD flow + noise, and IFT (Algorithm 1)) in a Gaussian target experiment.  Each algorithm's trajectory of a randomly selected subset of particles is shown.  The color intensity of each point represents its weight, and hollow dots signify particles that have become effectively massless (their weight has been teleported).  The figure illustrates how the IFT algorithm avoids the problems of particle collapse and getting stuck in local minima observed in the other two methods.", "section": "4 Numerical Example"}, {"figure_path": "rPgc5brxmT/figures/figures_9_1.jpg", "caption": "Figure 3: Mean loss and standard deviation computed over 50 runs", "description": "This figure compares the performance of four different algorithms in minimizing the squared MMD energy for two different target distributions: a Gaussian distribution and a Gaussian mixture distribution.  The x-axis represents the number of steps in the optimization process, and the y-axis shows the mean MMD loss. The shaded areas represent the standard deviation over 50 independent runs of each algorithm.  The four algorithms shown are: MMD flow (baseline), MMD flow with added noise (a modification of the baseline), IFT GD (Interaction-Force Transport Gradient Descent, the authors' proposed method), and WFR GD (Wasserstein-Fisher-Rao Gradient Descent, another comparable method). The figure demonstrates that the IFT GD method generally outperforms the other methods, showing faster convergence and lower variance in the loss.", "section": "4 Numerical Example"}]