[{"figure_path": "gN1iKwxlL5/tables/tables_3_1.jpg", "caption": "Table 2: Comparison of optimality gaps on linear programming instances.", "description": "This table compares the performance of the proposed Dual Lagrangian Learning (DLL) method and the baseline method DC3 on linear programming instances. It shows the average, standard deviation, and maximum optimality gaps for both methods across different problem sizes (m and n). The optimality gap is calculated as the difference between the optimal objective value and the dual bound obtained by the method, divided by the optimal objective value. The results demonstrate that DLL significantly outperforms DC3 in terms of accuracy, achieving much lower optimality gaps.", "section": "5 Numerical experiments"}, {"figure_path": "gN1iKwxlL5/tables/tables_5_1.jpg", "caption": "Table 1: Overview of conic projections for standard cones", "description": "This table summarizes the Euclidean and radial projection methods for five standard cones used in conic optimization: the non-negative orthant (R+), the second-order cone (Q), the positive semi-definite cone (S+), the exponential cone (Ɛ), and the power cone (P).  For each cone, it references the appendix section providing the detailed definition and the equation numbers in the paper that describe the Euclidean and radial projection formulas. Note that closed-form solutions are not available for the Euclidean projections of the exponential and power cones.", "section": "4.2 Conic Projections"}, {"figure_path": "gN1iKwxlL5/tables/tables_6_1.jpg", "caption": "Table 2: Comparison of optimality gaps on linear programming instances.", "description": "This table compares the performance of DC3 and DLL on linear programming instances in terms of optimality gap.  For different problem sizes (m and n), it shows the average, standard deviation, and maximum optimality gap achieved by each method.  Optimality gap is calculated as (L* − L(ŷ, 2))/L*, where L* is the optimal value obtained using Gurobi.", "section": "5 Numerical experiments"}, {"figure_path": "gN1iKwxlL5/tables/tables_7_1.jpg", "caption": "Table 3: Computing time statistics for linear programming instances", "description": "This table compares the computation time of three different methods: Gurobi (a commercial interior-point solver), DC3 (a state-of-the-art learning-based method), and DLL (the proposed method) for solving linear programming problems.  The table shows the time taken to solve all instances in a test set for different problem sizes (m and n represent the number of resources and items respectively). It demonstrates that DLL significantly outperforms both Gurobi and DC3 in terms of speed, highlighting its efficiency. Note that the times for Gurobi are CPU times, while the times for DC3 and DLL are GPU times.", "section": "5.1 Linear Programming Problems"}, {"figure_path": "gN1iKwxlL5/tables/tables_8_1.jpg", "caption": "Table 4: Comparison of optimality gaps on production planning instances.", "description": "This table compares the performance of DC3 and DLL on production planning instances in terms of optimality gap. For different problem sizes (n), it shows the average, standard deviation, and maximum optimality gap achieved by each method. The results demonstrate that DLL significantly outperforms DC3, achieving much smaller optimality gaps on average and across all instances.", "section": "5 Numerical experiments"}, {"figure_path": "gN1iKwxlL5/tables/tables_8_2.jpg", "caption": "Table 3: Computing time statistics for linear programming instances", "description": "This table compares the computation times for solving linear programming instances using three different methods: Gurobi (a commercial interior-point solver), DC3 (a state-of-the-art learning-based method), and DLL (the proposed Dual Lagrangian Learning method).  The table shows the time taken to solve all instances in the test set for different problem sizes (represented by the number of variables (n) and constraints (m)).  Times are reported for CPU computation for Gurobi, and GPU computation for DC3 and DLL. The results demonstrate the significant speedup achieved by DLL compared to both Gurobi and DC3.", "section": "5 Numerical experiments"}]