[{"figure_path": "9FYat8HPpv/tables/tables_7_1.jpg", "caption": "Table 1: Quantitative comparison of the sequence reconstruction task on the GOPRO dataset.", "description": "This table presents a quantitative comparison of different methods for sequence reconstruction on the GOPRO dataset.  It shows the Peak Signal-to-Noise Ratio (PSNR) and Structural Similarity Index (SSIM) for various methods under different spike thresholds (Vth = 1, 2, 4). The \"Spike\" column indicates whether the method uses spike information. The \"Params\" column shows the number of parameters for each method.  The results highlight the performance of different deblurring approaches using both conventional and spike-based methods, showing the impact of spike data availability on reconstruction quality.", "section": "4 Experiments"}, {"figure_path": "9FYat8HPpv/tables/tables_8_1.jpg", "caption": "Table 2: Performance comparison between the SAN in GEM [39] and our designed LDN.", "description": "This table presents a quantitative comparison of the performance of the Scale-aware Network (SAN) used in the GEM model [39] and the Lightweight Deblurring Network (LDN) proposed by the authors.  The comparison focuses on the PSNR (Peak Signal-to-Noise Ratio), SSIM (Structural Similarity Index), the number of parameters (Params), and the number of floating-point operations (Flops) for both networks.  The results show that the authors' LDN achieves higher PSNR and SSIM scores with significantly fewer parameters and FLOPs, demonstrating its superior efficiency.", "section": "4.3 Ablation Study"}, {"figure_path": "9FYat8HPpv/tables/tables_9_1.jpg", "caption": "Table 1: Quantitative comparison of the sequence reconstruction task on the GOPRO dataset.", "description": "This table presents a quantitative comparison of different methods for sequence reconstruction on the GOPRO dataset.  It compares various methods (LEVS, Motion-ETR, BiT, TRMD+DASR, RED+DASR, REFID+DASR, SpkDeblurNet, and the proposed S-SDM) across three different spike thresholds (Vth=1, Vth=2, Vth=4).  For each method and threshold, the table provides the Peak Signal-to-Noise Ratio (PSNR), Structural Similarity Index (SSIM), and the number of parameters (Params) used. The inclusion of spike data (indicated by a checkmark) and the number of parameters highlight the efficiency and effectiveness of different methods.", "section": "4 Experiments"}, {"figure_path": "9FYat8HPpv/tables/tables_14_1.jpg", "caption": "Table 5: Quantitative comparison of the single frame task on the RSB dataset, where non-reference metric LIQE ranging from 1 to 5 is employed. LIQE is a positive metric denoted as ↑ where higher scores reflect better performance.", "description": "This table presents a quantitative comparison of single-frame image restoration results on the RSB (Real-world Spike Blur) dataset. Five different methods are compared: LEVS [12], Motion-ETR [40], BiT [46], SpkDeblurNet [8], and the proposed S-SDM. The evaluation metric used is LIQE (Language-Image Quality Evaluator), which ranges from 1 to 5, with higher scores indicating better quality.  The table shows the LIQE scores for each method across five different image categories within the RSB dataset (Board-L, Board-M, Board-H, Face, and Earphone), along with an average LIQE score across all categories.", "section": "4.2 Experimental Results"}]