[{"figure_path": "SvmJJJS0q1/tables/tables_3_1.jpg", "caption": "Table 1: Summary of the various settings for detecting and measuring confounding between Xi, Xj. Here Pij is the set of node indices that belong to a path from Xi to Xj including j.", "description": "This table summarizes the different settings used to detect and measure confounding in the paper.  It shows three settings, each based on different assumptions about available data and interventions.  Setting 1 leverages directed information and non-collapsibility, requiring hard/structural interventions.  Settings 2 and 3 rely on mutual information with soft/parametric interventions.", "section": "4 Detecting and Measuring Confounding"}, {"figure_path": "SvmJJJS0q1/tables/tables_4_1.jpg", "caption": "Table 2: Directed information values in two and three node graphs. If Xi, Xj are confounded by Z, we observe positive directed information from both directions.", "description": "This table shows the values of directed information I(Xᵢ → Xⱼ) and I(Xⱼ → Xᵢ) for different causal graphs involving two or three nodes (Xᵢ, Xⱼ, Z). The table illustrates how the presence of confounding affects the values of directed information.  When there's no confounding between Xᵢ and Xⱼ, one of the directed information values will be zero; if there is confounding (via Z), both directed information values will be greater than zero.", "section": "4.1 Setting 1: Measuring Confounding Using Directed Information Between Xi, Xj"}, {"figure_path": "SvmJJJS0q1/tables/tables_9_1.jpg", "caption": "Table 3: Downstream application of causal effect estimation.", "description": "This table presents the results of a downstream application of causal effect estimation.  It shows the impact of controlling for confounding variables (identified using the proposed methods) on the accuracy of causal effect estimations.  Two causal graphs (G3 and G4) with varying sample sizes (1000-5000) are used to compare causal effect estimations with and without controlling for confounding factors. The difference between the true and estimated causal effects is measured, demonstrating the effectiveness of confounding control in improving the accuracy of causal effect estimations. ", "section": "6 Experiments and Results"}, {"figure_path": "SvmJJJS0q1/tables/tables_9_2.jpg", "caption": "Table 4: Results on synthetic datasets for settings 1,2,3.", "description": "This table presents the results of experiments on synthetic datasets to evaluate the performance of three different confounding measures (CNF-1, CNF-2, CNF-3) under various conditions.  The experiments use Erdos-Renyi generated causal graphs, varying the number of nodes (N), contexts (C), and sample sizes. The table reports precision, recall, and F1 scores for each measure across three settings, reflecting different assumptions about available contextual information and interventions.  The results demonstrate the effectiveness of the measures in detecting confounding relationships.", "section": "6 Experiments and Results"}]