[{"figure_path": "C0EhyoPpTN/tables/tables_6_1.jpg", "caption": "Table 1: Lower dimensional latent dynamics than SOTA at same sample quality. We report median ± median absolute deviation over 20 independent training runs, 'dim' refers to the dimensionality of the model's underlying dynamics and |θ| denotes the total number of trainable parameters. Values for GTF taken from Hess et al. [8].", "description": "This table compares the performance of the proposed SMC method with the state-of-the-art GTF method in terms of model dimensionality and reconstruction accuracy.  Lower values of  *D<sub>stsp</sub>* and *D<sub>H</sub>* indicate better reconstruction quality, while 'dim' represents the dimensionality of the latent dynamical system and |θ| represents the number of trainable parameters. The results show that the SMC method achieves similar reconstruction accuracy to GTF but with significantly lower dimensionality (3 vs 16).", "section": "3.2 Stochasticity allows recovering low-dimensional latents underlying EEG data"}, {"figure_path": "C0EhyoPpTN/tables/tables_25_1.jpg", "caption": "Table 1: Lower dimensional latent dynamics than SOTA at same sample quality. We report median ± median absolute deviation over 20 independent training runs, 'dim' refers to the dimensionality of the model's underlying dynamics and |0| denotes the total number of trainable parameters. Values for GTF taken from Hess et al. [8].", "description": "This table compares the performance of the proposed method (SMC) with the state-of-the-art method (GTF) on EEG data in terms of the dimensionality of the latent dynamics, the total number of trainable parameters, and two performance metrics (Dstsp and DH). The results show that the proposed method achieves lower-dimensional latent dynamics while maintaining comparable performance.", "section": "3.2 Stochasticity allows recovering low-dimensional latents underlying EEG data"}, {"figure_path": "C0EhyoPpTN/tables/tables_25_2.jpg", "caption": "Table 1: Lower dimensional latent dynamics than SOTA at same sample quality. We report median ± median absolute deviation over 20 independent training runs, 'dim' refers to the dimensionality of the model's underlying dynamics and |0| denotes the total number of trainable parameters. Values for GTF taken from Hess et al. [8].", "description": "This table compares the performance of the proposed method with the state-of-the-art method (GTF) on an EEG dataset.  The comparison is based on the dimensionality of the latent dynamics, the total number of trainable parameters, and two evaluation metrics: Dstsp and DH. The results show that the proposed method achieves lower dimensionality while maintaining similar performance to GTF.", "section": "3.2 Stochasticity allows recovering low-dimensional latents underlying EEG data"}]