[{"figure_path": "GhqdnLZMAz/tables/tables_1_1.jpg", "caption": "Table 1: An example for a query in the FICO Dataset with different kinds of explanations, SEV¹ represents the SEV calculation with one single reference using population mean, SEV® represents the cluster-based SEV, SEVF represents the flexible-based SEV. SEVT represents the tree-based SEV The columns are four features.", "description": "This table shows an example of how different methods for calculating Sparse Explanation Values (SEV) produce different explanations for the same query point in the FICO dataset.  It compares four SEV variations: SEV¹, which uses a single reference point (the population mean); SEV®, which uses cluster-based references; SEVF, which uses flexible references; and SEVT, which uses tree-based references.  The table highlights the resulting explanation's sparsity (number of features changed) for each method.", "section": "4 Meaningful and Credible SEV"}, {"figure_path": "GhqdnLZMAz/tables/tables_2_1.jpg", "caption": "Table 1: An example for a query in the FICO Dataset with different kinds of explanations, SEV¹ represents the SEV calculation with one single reference using population mean, SEV® represents the cluster-based SEV, SEVF represents the flexible-based SEV. SEVT represents the tree-based SEV The columns are four features.", "description": "This table demonstrates an example of how different SEV methods (SEV¹, SEV®, SEVF, SEVT) generate explanations for a single query point in the FICO dataset.  It shows how the choice of reference point and method impacts the sparsity of the explanation (number of features changed) and its overall credibility. SEV¹ uses the population mean as the reference; SEV® uses cluster centroids; SEVF allows for flexibility in the reference point; and SEVT uses the leaf nodes of a decision tree.", "section": "4 Meaningful and Credible SEV"}, {"figure_path": "GhqdnLZMAz/tables/tables_5_1.jpg", "caption": "Table 1: An example for a query in the FICO Dataset with different kinds of explanations, SEV¹ represents the SEV calculation with one single reference using population mean, SEV® represents the cluster-based SEV, SEVF represents the flexible-based SEV. SEVT represents the tree-based SEV The columns are four features.", "description": "This table shows an example of how different SEV methods (SEV¹, SEV®, SEVF, SEVT) generate explanations for a single query in the FICO dataset.  SEV¹ uses a single reference point (the population mean).  SEV® uses multiple reference points, one for each cluster in the data. SEVF is similar to SEV® but allows for slight adjustments to the reference points to improve sparsity. SEVT uses a decision tree model to calculate SEV. The table shows the changes in feature values that lead to a change in prediction for each method, highlighting the differences in sparsity and the locations of the resulting counterfactual instances. ", "section": "4 Meaningful and Credible SEV"}, {"figure_path": "GhqdnLZMAz/tables/tables_13_1.jpg", "caption": "Table 1: An example for a query in the FICO Dataset with different kinds of explanations, SEV¹ represents the SEV calculation with one single reference using population mean, SEV® represents the cluster-based SEV, SEVF represents the flexible-based SEV. SEVT represents the tree-based SEV The columns are four features.", "description": "This table presents a comparison of four different methods for calculating Sparse Explanation Values (SEV) for a single query in the FICO dataset.  The methods compared are:\n\n*   **SEV¹:** Uses a single reference point calculated as the population mean.\n*   **SEV®:** Uses multiple reference points, one for each cluster in the negative class.\n*   **SEVF:** Uses a flexible reference point, allowing for slight adjustments to improve sparsity.\n*   **SEVT:** Uses a tree-based approach, placing a reference point on each negative leaf node.\n\nFor each method, the table shows the resulting SEV, along with the four features that were changed to achieve the different explanation values.  The purpose is to illustrate how different approaches to defining and calculating SEV yield explanations that vary in sparsity and closeness to the original query point.", "section": "4 Meaningful and Credible SEV"}, {"figure_path": "GhqdnLZMAz/tables/tables_15_1.jpg", "caption": "Table 1: An example for a query in the FICO Dataset with different kinds of explanations, SEV¹ represents the SEV calculation with one single reference using population mean, SEV® represents the cluster-based SEV, SEVF represents the flexible-based SEV. SEVT represents the tree-based SEV The columns are four features.", "description": "This table demonstrates the application of four different SEV (Sparse Explanation Value) calculation methods on a single query from the FICO dataset.  It shows how different methods - standard SEV using a single reference point (SEV¹), cluster-based SEV (SEV©), flexible-reference SEV (SEVF), and tree-based SEV (SEVT) - result in varying numbers of features that must be changed to alter the model's prediction.  Each row represents a different method and shows the changes needed for each feature to change the prediction outcome.", "section": "4 Meaningful and Credible SEV"}, {"figure_path": "GhqdnLZMAz/tables/tables_19_1.jpg", "caption": "Table 1: An example for a query in the FICO Dataset with different kinds of explanations, SEV¹ represents the SEV calculation with one single reference using population mean, SEV® represents the cluster-based SEV, SEVF represents the flexible-based SEV. SEVT represents the tree-based SEV The columns are four features.", "description": "This table demonstrates the different explanations generated by four different methods of calculating Sparse Explanation Value (SEV) for a single query in the FICO dataset.  SEV¹ uses a single reference point (the population mean), while SEV© uses multiple reference points (cluster centroids), SEVF allows the reference point to be adjusted slightly, and SEVT leverages a tree-based approach. The table shows how these different methods affect the sparsity and credibility of the explanation by varying the number of features that need to be changed to flip the prediction.", "section": "4 Meaningful and Credible SEV"}, {"figure_path": "GhqdnLZMAz/tables/tables_22_1.jpg", "caption": "Table 1: An example for a query in the FICO Dataset with different kinds of explanations, SEV¹ represents the SEV calculation with one single reference using population mean, SEV® represents the cluster-based SEV, SEVF represents the flexible-based SEV. SEVT represents the tree-based SEV The columns are four features.", "description": "This table demonstrates the different kinds of SEV explanations for a given query point in the FICO dataset.  It shows how the Sparse Explanation Value (SEV) changes depending on the method used (single reference, cluster-based, flexible, and tree-based). Each row represents a different explanation method, with the columns showing the changed feature values and the resulting SEV score. The table highlights the impact of reference point selection and method flexibility on explanation sparsity.", "section": "4 Meaningful and Credible SEV"}, {"figure_path": "GhqdnLZMAz/tables/tables_23_1.jpg", "caption": "Table 1: An example for a query in the FICO Dataset with different kinds of explanations, SEV¹ represents the SEV calculation with one single reference using population mean, SEV® represents the cluster-based SEV, SEVF represents the flexible-based SEV. SEVT represents the tree-based SEV The columns are four features.", "description": "This table shows an example of how different methods for calculating Sparse Explanation Value (SEV) produce different explanations for the same query point in the FICO dataset.  SEV¹ uses a single reference point (the population mean), while SEV®, SEVF, and SEVT employ cluster-based, flexible-based, and tree-based approaches respectively. Each method results in a different explanation (i.e., the features changed to reach a different prediction), and each explanation has a different SEV score reflecting its sparsity.", "section": "4 Meaningful and Credible SEV"}, {"figure_path": "GhqdnLZMAz/tables/tables_24_1.jpg", "caption": "Table 1: An example for a query in the FICO Dataset with different kinds of explanations, SEV¹ represents the SEV calculation with one single reference using population mean, SEV® represents the cluster-based SEV, SEVF represents the flexible-based SEV. SEVT represents the tree-based SEV The columns are four features.", "description": "This table shows an example of how different SEV methods (SEV¹, SEV®, SEVF, SEVT) produce different explanations for the same query point in the FICO dataset.  It highlights the impact of different reference point selection strategies on the sparsity and closeness of the explanations.  SEV¹ uses a single global reference, while SEV®, SEVF, and SEVT use cluster centers, flexible references, and tree-based methods, respectively, to identify closer and potentially more realistic references.  The table illustrates the feature values that changed in each explanation, demonstrating the varying degrees of sparsity achieved by different methods.", "section": "4 Meaningful and Credible SEV"}, {"figure_path": "GhqdnLZMAz/tables/tables_25_1.jpg", "caption": "Table 1: An example for a query in the FICO Dataset with different kinds of explanations, SEV¹ represents the SEV calculation with one single reference using population mean, SEV® represents the cluster-based SEV, SEVF represents the flexible-based SEV. SEVT represents the tree-based SEV The columns are four features.", "description": "This table shows an example of how different SEV methods (SEV¹, SEV©, SEVF, SEVT) produce explanations for a single query in the FICO dataset.  SEV¹ uses a single reference point (population mean), while SEV©, SEVF, and SEVT use different reference points and strategies to generate explanations. The table highlights the different feature values that are changed in each explanation to illustrate the differences in sparsity and the approaches of each method.", "section": "4 Meaningful and Credible SEV"}, {"figure_path": "GhqdnLZMAz/tables/tables_26_1.jpg", "caption": "Table 1: An example for a query in the FICO Dataset with different kinds of explanations, SEV¹ represents the SEV calculation with one single reference using population mean, SEV© represents the cluster-based SEV, SEVF represents the flexible-based SEV. SEVT represents the tree-based SEV The columns are four features.", "description": "This table demonstrates the various SEV calculation methods on a single query from the FICO dataset. It compares four different approaches: SEV (using a single reference point as the population mean), cluster-based SEV (using multiple reference points from clusters), flexible-based SEV (allowing for slight adjustments to the reference point), and tree-based SEV (using reference points from decision tree leaves).  Each row shows the results for a specific SEV method, highlighting which features were changed in the explanation and the resulting SEV value.  This showcases the impact of reference point selection on explanation sparsity.", "section": "4 Meaningful and Credible SEV"}, {"figure_path": "GhqdnLZMAz/tables/tables_26_2.jpg", "caption": "Table 1: An example for a query in the FICO Dataset with different kinds of explanations, SEV¹ represents the SEV calculation with one single reference using population mean, SEV® represents the cluster-based SEV, SEVF represents the flexible-based SEV. SEVT represents the tree-based SEV The columns are four features.", "description": "This table shows an example of how different methods for calculating Sparse Explanation Value (SEV) produce different explanations for a single query in the FICO dataset.  It compares four approaches: SEV (using a single reference point), cluster-based SEV (using multiple cluster centers as references), flexible-based SEV (allowing slight adjustments to the reference point), and tree-based SEV (using leaf nodes as references).  Each row shows the features that were changed to generate an explanation, along with the resulting SEV for each method.", "section": "4 Meaningful and Credible SEV"}, {"figure_path": "GhqdnLZMAz/tables/tables_27_1.jpg", "caption": "Table 1: An example for a query in the FICO Dataset with different kinds of explanations, SEV¹ represents the SEV calculation with one single reference using population mean, SEV® represents the cluster-based SEV, SEVF represents the flexible-based SEV. SEVT represents the tree-based SEV The columns are four features.", "description": "This table demonstrates the different explanations generated by four different SEV methods for a single query in the FICO dataset.  It shows how the choice of reference point and method affects the sparsity of the explanation (number of features changed) and the values of the features that were changed. SEV¹ uses a single reference point (the population mean), while SEV®, SEVF, and SEVT use different methods for selecting reference points and/or allowing flexibility in their positions to achieve more meaningful and sparse explanations.", "section": "4 Meaningful and Credible SEV"}, {"figure_path": "GhqdnLZMAz/tables/tables_28_1.jpg", "caption": "Table 1: An example for a query in the FICO Dataset with different kinds of explanations, SEV¹ represents the SEV calculation with one single reference using population mean, SEV® represents the cluster-based SEV, SEVF represents the flexible-based SEV. SEVT represents the tree-based SEV The columns are four features.", "description": "This table shows an example of how different methods for calculating Sparse Explanation Values (SEV) produce different explanations for the same query point in the FICO dataset.  It compares four different SEV approaches: the standard SEV using a single population mean reference (SEV¹), cluster-based SEV (SEV®), flexible-based SEV (SEVF), and tree-based SEV (SEVT). Each row shows the feature values of the query and the modified feature values resulting from each method, along with the calculated SEV for that explanation. The table demonstrates how these different SEV methods can yield explanations with varying levels of sparsity and meaningfulness.", "section": "4 Meaningful and Credible SEV"}, {"figure_path": "GhqdnLZMAz/tables/tables_31_1.jpg", "caption": "Table 1: An example for a query in the FICO Dataset with different kinds of explanations, SEV¹ represents the SEV calculation with one single reference using population mean, SEV© represents the cluster-based SEV, SEVF represents the flexible-based SEV. SEVT represents the tree-based SEV The columns are four features.", "description": "This table demonstrates the different kinds of sparse explanation methods proposed in the paper. Each row represents a query point and its corresponding explanations using different methods. It highlights the differences in terms of the number of features changed and the values of those features, demonstrating how the proposed methods improve sparsity and credibility.", "section": "4 Meaningful and Credible SEV"}, {"figure_path": "GhqdnLZMAz/tables/tables_32_1.jpg", "caption": "Table 1: An example for a query in the FICO Dataset with different kinds of explanations, SEV¹ represents the SEV calculation with one single reference using population mean, SEV® represents the cluster-based SEV, SEVF represents the flexible-based SEV. SEVT represents the tree-based SEV The columns are four features.", "description": "This table shows an example of how different SEV methods produce different explanations for the same query point in the FICO dataset.  It compares four methods: SEV (using a single reference point), cluster-based SEV, flexible-based SEV, and tree-based SEV.  Each method results in a different set of features that need to be changed to flip the prediction, and each provides a different level of sparsity (number of features changed). The table helps to illustrate the trade-offs and benefits of the different approaches.", "section": "4 Meaningful and Credible SEV"}, {"figure_path": "GhqdnLZMAz/tables/tables_33_1.jpg", "caption": "Table 1: An example for a query in the FICO Dataset with different kinds of explanations, SEV¹ represents the SEV calculation with one single reference using population mean, SEV® represents the cluster-based SEV, SEVF represents the flexible-based SEV. SEVT represents the tree-based SEV The columns are four features.", "description": "This table compares four different methods for calculating Sparse Explanation Values (SEV) on a single query from the FICO dataset.  SEV¹ uses a single reference point (the population mean).  SEV® uses multiple reference points (cluster centers). SEVF allows for flexible reference points, and SEVT is a tree-based variant. The table shows the changes made to four features to obtain a counterfactual explanation for each method, highlighting the different levels of sparsity and closeness achieved.", "section": "4 Meaningful and Credible SEV"}]