[{"figure_path": "6SAnp0vr9X/figures/figures_1_1.jpg", "caption": "Figure 1: Prediction errors with different scale transformation of the same model. (a): with non-sparse parameter (-1, -1, -0.01, -0.01, -0.01, -0.01)T. (b): with sparse parameter (-1, 0, 0, 0, 0, 0)T.", "description": "This figure shows how different scale transformations of the same model impact the prediction error of various optimal subsampling methods. It highlights the scale-dependency issue of existing methods (A-OS and L-OS), which can lead to inefficient subsamples, especially when dealing with sparse models, as in the case of (b). In contrast, the proposed scale-invariant optimal subsampling method (P-OS) remains consistent across different scales.", "section": "1 Introduction"}, {"figure_path": "6SAnp0vr9X/figures/figures_7_1.jpg", "caption": "Figure 2: eMSE for different true parameters with different sampling rates.", "description": "This figure compares the empirical median squared error (eMSE) of parameter estimation for three different parameter settings (Cases A, B, and C) across various sampling rates.  Each case represents a different sparsity pattern of the true parameters. The x-axis shows the sampling rate, while the y-axis shows the log of eMSE. The figure shows the performance of different subsampling methods (A-OS, L-OS, P-OS, Uni, Adaptive Lasso, Lasso) across different sampling rates and parameter settings. It illustrates how different optimal subsampling methods and the full data Lasso and adaptive Lasso perform with respect to the sampling rate.", "section": "5.1.1 Estimation and prediction efficiency"}, {"figure_path": "6SAnp0vr9X/figures/figures_7_2.jpg", "caption": "Figure 1: Prediction errors with different scale transformation of the same model. (a): with non-sparse parameter (-1, -1, -0.01, -0.01, -0.01, -0.01)Т. (b): with sparse parameter (-1, 0, 0, 0, 0, 0)T.", "description": "This figure demonstrates the impact of data scaling on the performance of two optimal subsampling methods (A-OS and L-OS) compared to uniform sampling (Uni) and the proposed scale-invariant optimal subsampling method (P-OS).  The prediction error is plotted against different data scales (s) for both a non-sparse and sparse parameter setting. The results highlight the scale-dependence issue of existing optimal subsampling methods and showcase the advantage of the proposed scale-invariant approach.", "section": "1 Introduction"}, {"figure_path": "6SAnp0vr9X/figures/figures_9_1.jpg", "caption": "Figure 1: Prediction errors with different scale transformation of the same model. (a): with non-sparse parameter (-1, -1, -0.01, -0.01, -0.01, -0.01)Т. (b): with sparse parameter (-1, 0, 0, 0, 0, 0)T.", "description": "This figure illustrates the scale-dependent issue of existing optimal subsampling methods.  Two optimal subsampling methods (A-OS and L-OS) and a uniform sampling method (Uni) are compared against a proposed scale-invariant method (P-OS). The x-axis represents different scales (s) applied to a covariate, showing how prediction error varies significantly across methods with scale changes, while the proposed P-OS method remains relatively stable.  Two scenarios are shown: one with non-sparse parameters and another with sparse parameters, highlighting the impact of feature inactivity on the issue.", "section": "1 Introduction"}, {"figure_path": "6SAnp0vr9X/figures/figures_27_1.jpg", "caption": "Figure 1: Prediction errors with different scale transformation of the same model. (a): with non-sparse parameter (-1, -1, -0.01, -0.01, -0.01, -0.01)T. (b): with sparse parameter (-1, 0, 0, 0, 0, 0)T.", "description": "This figure demonstrates the impact of data scaling on the performance of two optimal subsampling methods (A-OS and L-OS) from the literature, compared to uniform sampling (Uni).  It shows that the prediction error varies significantly depending on the scale transformation applied to the data, highlighting the scale-dependent nature of these methods.  The proposed scale-invariant method (P-OS) is shown to be robust to scaling transformations, demonstrating its advantage over existing techniques, especially in scenarios with sparse models.", "section": "1 Introduction"}, {"figure_path": "6SAnp0vr9X/figures/figures_27_2.jpg", "caption": "Figure 1: Prediction errors with different scale transformation of the same model. (a): with non-sparse parameter (-1, -1, -0.01, -0.01, -0.01, -0.01)T. (b): with sparse parameter (-1, 0, 0, 0, 0, 0)T.", "description": "This figure demonstrates the impact of data scaling on the performance of two optimal subsampling methods (A-OS and L-OS) compared to uniform sampling (Uni) and the proposed scale-invariant method (P-OS).  The left panel shows results with a non-sparse model, and the right panel shows results with a sparse model.  The x-axis represents the scaling factor (s) applied to one of the covariates. The y-axis represents the prediction error. The figure illustrates that A-OS and L-OS are highly sensitive to data scaling, while P-OS is more robust and maintains consistent performance across different scales.", "section": "1 Introduction"}]