[{"figure_path": "8z4isrqbcf/tables/tables_5_1.jpg", "caption": "Table 1: Quantitative evaluation on image and video reconstruction. FCR represents the frame compression rate, and Comp. indicates compatibility with existing generative models.", "description": "This table presents a quantitative comparison of different Variational Autoencoder (VAE) models for image and video reconstruction.  The models are evaluated using Peak Signal-to-Noise Ratio (PSNR), Structural Similarity Index (SSIM), Learned Perceptual Image Patch Similarity (LPIPS), and Frame Compression Rate (FCR).  The \"Comp.\" column indicates whether each model is compatible with existing generative models.  The table shows that the proposed CV-VAE models achieve comparable or better performance than other VAEs, especially in video reconstruction, while maintaining compatibility with existing models.", "section": "4.2 Image and Video Reconstruction"}, {"figure_path": "8z4isrqbcf/tables/tables_7_1.jpg", "caption": "Table 2: Quantitative results of text-to-image generation.", "description": "This table presents a quantitative comparison of text-to-image generation performance between the original Stable Diffusion 2.1 (SD2.1) model and the SD2.1 model integrated with the proposed CV-VAE.  The comparison uses three metrics: FID (Fréchet Inception Distance), CLIP (Contrastive Language–Image Pre-training) score, and PIC (Perceptual Input Conformity). Lower FID and CLIP scores indicate better performance, while a higher PIC score suggests improved perceptual quality.  The results show that integrating CV-VAE into SD2.1 does not significantly affect the performance in this specific task.", "section": "4.3 Compatibility with Existing Models"}, {"figure_path": "8z4isrqbcf/tables/tables_7_2.jpg", "caption": "Table 3: Evaluation results of image-to-video generation. FCR denotes the frame compression rate.", "description": "This table shows the results of image-to-video generation experiments using different configurations of the proposed CV-VAE model.  It compares the performance of the SVD model alone against versions incorporating the CV-VAE, both with and without fine-tuning of the output layer.  Metrics include Frechet Video Distance (FVD), Kernel Video Distance (KVD), and Perceptual Input Conformity (PIC).  The table also indicates whether the model was trainable, the frame compression rate (FCR), and the number of frames generated.", "section": "4.3 Compatibility with Existing Models"}, {"figure_path": "8z4isrqbcf/tables/tables_8_1.jpg", "caption": "Table 4: Comparison between CV-VAE and frame interpolation model.", "description": "This table compares the performance of the proposed CV-VAE method against the RIFE frame interpolation method on image-to-video generation.  The evaluation metrics include FVD (Frechet Video Distance), KVD (Kernel Video Distance), and PIC (Perceptual Input Conformity). Lower FVD and KVD values indicate better quality, while a higher PIC value is preferred. The results show that, while both methods generate video, CV-VAE has better performance on KVD and PIC scores.", "section": "4.3 Compatibility with Existing Models"}, {"figure_path": "8z4isrqbcf/tables/tables_8_2.jpg", "caption": "Table 3: Evaluation results of image-to-video generation. FCR denotes the frame compression rate.", "description": "This table presents the quantitative results of image-to-video generation using different methods.  It compares the performance of the original SVD model against versions integrated with the proposed CV-VAE model, both with and without fine-tuning. The metrics used to evaluate performance are FVD (Fréchet Video Distance), KVD (Kernel Video Distance), and PIC (Perceptual Input Conformity). The table also shows the frame compression rate (FCR) achieved by each method, indicating the level of temporal compression.", "section": "4.3 Compatibility with Existing Models"}, {"figure_path": "8z4isrqbcf/tables/tables_9_1.jpg", "caption": "Table 6: Comparison of different regularization types.", "description": "This table presents the results of an ablation study comparing different latent space regularization methods used in training the video VAE.  The methods compared are using the 2D encoder only, the 2D decoder only, and both the 2D encoder and decoder. The table shows the performance (PSNR, SSIM, LPIPS) on the COCO-Val and Webvid-Val datasets for each method. This helps determine which regularization strategy is most effective for the task.", "section": "4.4 Ablation Study"}, {"figure_path": "8z4isrqbcf/tables/tables_9_2.jpg", "caption": "Table 7: Comparison of different mapping functions.", "description": "This table presents a comparison of four different mapping functions used in the latent space regularization method of the CV-VAE model.  Each function aims to bridge the dimensional gap between the input video (X) and the reconstructed video (X^r).  The table shows the results of using each mapping function on both COCO-Val and Webvid-Val datasets, evaluating the performance using Peak Signal-to-Noise Ratio (PSNR), Structural Similarity Index (SSIM), and Learned Perceptual Image Patch Similarity (LPIPS).  Higher PSNR and SSIM values indicate better image quality, while lower LPIPS values indicate better perceptual similarity.  The comparison helps to determine which mapping function yields the best reconstruction results for the video VAE.", "section": "4. Experiments"}, {"figure_path": "8z4isrqbcf/tables/tables_14_1.jpg", "caption": "Table 8: Quantitative evaluation on image and video reconstruction between. FCR represents the frame compression rate, and Comp. indicates compatibility with existing generative models.", "description": "This table presents a quantitative comparison of image and video reconstruction performance between the VAE-SD3 and CVVAE-SD3 models.  It shows the parameter count (Params), frame compression rate (FCR), compatibility with existing generative models (Comp.), and reconstruction metrics (PSNR, SSIM, LPIPS) for both COCO-Val and Webvid-Val datasets.  The results demonstrate the trade-off between increased model size and improved reconstruction quality.", "section": "A.2 CV-VAE with more latent channels"}]