[{"figure_path": "wsqDJHPUHN/figures/figures_4_1.jpg", "caption": "Figure 1: Trade-off between data consistency preservation and search ability.", "description": "This figure illustrates the trade-off between data preservation and search ability in the learnware paradigm. The x-axis represents the number of synthetic data points (m) in the RKME specification. The y-axis shows the data preservation ability (blue curve) and search ability (orange curve). The blue curve indicates that as the number of synthetic data points decreases, the risk of data leakage diminishes. However, the search ability (orange curve) also decreases as m decreases, indicating a trade-off between these two aspects. The shaded area represents a practical range for m where both data preservation and search ability are satisfactory.", "section": "3.2 Data preservation and search ability"}, {"figure_path": "wsqDJHPUHN/figures/figures_8_1.jpg", "caption": "Figure 1: Trade-off between data consistency preservation and search ability.", "description": "This figure illustrates the trade-off between data preservation and search ability when using RKME (Reduced Kernel Mean Embedding) specifications in the learnware paradigm.  The x-axis represents the number of synthetic data points (m) used in the RKME specification. The y-axis shows both data preservation ability (purple and green curves) and search ability (blue curve).  The purple curve represents the probability that the RKME specification does not contain data similar to the original training data, while the green curve reflects the ability to resist attacks (linkage and inference). The blue curve indicates the accuracy of learnware identification.  The shaded region highlights a range of m values that balance both privacy and utility. Ideally, a learnware system would operate within this region, selecting a value of m that provides sufficient search accuracy without compromising the privacy of the original training data.", "section": "3.2 Data preservation and search ability"}]