[{"figure_path": "dqdffX3BS5/tables/tables_5_1.jpg", "caption": "Table 1: Information of the experimental datasets.", "description": "This table presents the characteristics of three real-world graph datasets used in the experiments: CoraFull, CS, and Computers.  For each dataset, it shows the number of nodes, edges, features (attributes of the nodes), labels (classes), the size of the training set used for the initial GNN pre-training, and the size of the novel set used for the incremental few-shot learning experiments.  The split of the datasets into training and novel sets reflects the setup for continual learning.", "section": "4.1 Graph Few-Shot Continual Learning"}, {"figure_path": "dqdffX3BS5/tables/tables_6_1.jpg", "caption": "Table 2: Comparison with SOTA methods on CoraFull dataset for GFSCIL.", "description": "This table compares the performance of Mecoin against other state-of-the-art (SOTA) methods on the CoraFull dataset for the task of graph few-shot class-incremental learning (GFSCIL).  It shows the accuracy achieved by each method in each of the ten sessions, along with the average accuracy and forgetting rate (PD).  The backbone GNN architecture (GCN or GAT) used by each method is also specified.", "section": "4.1 Graph Few-Shot Continual Learning"}, {"figure_path": "dqdffX3BS5/tables/tables_7_1.jpg", "caption": "Table 3: Comparison with SOTA methods on Computers dataset for GFSCIL.", "description": "This table compares the performance of Mecoin with other state-of-the-art (SOTA) methods on the Computers dataset for Graph Few-Shot Class-Incremental Learning (GFSCIL).  It shows the accuracy achieved by each method in each of the five sessions (0-5), the percentage of data points that were misclassified (PD), and the average accuracy across all sessions. The goal is to evaluate the effectiveness of Mecoin in maintaining prior knowledge while learning new classes from limited samples. The results indicate Mecoin's superior performance compared to the baselines. ", "section": "4.1 Graph Few-Shot Continual Learning"}, {"figure_path": "dqdffX3BS5/tables/tables_7_2.jpg", "caption": "Table 2: Comparison with SOTA methods on CoraFull dataset for GFSCIL.", "description": "This table compares the performance of Mecoin against other state-of-the-art (SOTA) methods for Graph Few-Shot Class-Incremental Learning (GFSCIL) on the CoraFull dataset.  It shows the accuracy achieved by each method in each of ten sessions, the average accuracy across all sessions, and the percentage of data points that are incorrectly predicted (PD).  The backbone used for each model (GCN or GAT) is also indicated.", "section": "4.1 Graph Few-Shot Continual Learning"}, {"figure_path": "dqdffX3BS5/tables/tables_12_1.jpg", "caption": "Table 2: Comparison with SOTA methods on CoraFull dataset for GFSCIL.", "description": "This table compares the performance of Mecoin against other state-of-the-art (SOTA) methods on the CoraFull dataset for graph few-shot class-incremental learning (GFSCIL).  It shows the accuracy achieved by each method in each of the ten sessions, along with the average accuracy and forgetting rate (PD).  The table allows for a direct comparison of Mecoin's performance against existing techniques in terms of both accuracy and the ability to retain knowledge learned in previous sessions.", "section": "4.1 Graph Few-Shot Continual Learning"}, {"figure_path": "dqdffX3BS5/tables/tables_13_1.jpg", "caption": "Table 2: Comparison with SOTA methods on CoraFull dataset for GFSCIL.", "description": "This table presents a comparison of the proposed Mecoin model's performance against other state-of-the-art (SOTA) methods on the CoraFull dataset for the task of Graph Few-Shot Class-Incremental Learning (GFSCIL).  It shows the accuracy achieved by each method in each of the ten sessions, along with the average accuracy and forgetting rate (PD).  The table allows for a direct performance comparison between Mecoin and various baseline techniques, demonstrating its effectiveness in handling the GFSCIL task on this specific dataset.", "section": "4.1 Graph Few-Shot Continual Learning"}, {"figure_path": "dqdffX3BS5/tables/tables_15_1.jpg", "caption": "Table 2: Comparison with SOTA methods on CoraFull dataset for GFSCIL.", "description": "This table compares the performance of the proposed Mecoin method against several state-of-the-art (SOTA) methods on the CoraFull dataset for the Graph Few-Shot Class-Incremental Learning (GFSCIL) task.  The table shows the accuracy achieved by each method in each of the ten sessions (0-9) of incremental learning. It also indicates the average accuracy and the Percentage of Data forgotten (PD) for each method.  The backbone network used (GCN or GAT) is also specified for each method.", "section": "4.1 Graph Few-Shot Continual Learning"}]