[{"figure_path": "OiVxYf9trg/figures/figures_2_1.jpg", "caption": "Figure 1: Particle trajectories for different Value matrices. In all cases we take simple Query and Key matrices K = Q = Id, temperature β = 9 and final time T = 5000 for n = 32 particles initialized uniformly at random on the sphere. Positions of particles at time T are indicated by a red dot.", "description": "This figure shows the trajectories of particles representing tokens in a causal self-attention mechanism for different Value matrices (V). The Query and Key matrices (K and Q) are set to identity matrices. The other parameters used are temperature β = 9 and final time T = 5000.  The initial positions of the 32 particles are randomly initialized on the unit sphere, and their final positions at time T are marked with red dots. The figure illustrates how the choice of Value matrix impacts particle clustering behavior, showing different final configurations ranging from a single cluster to multiple clusters. ", "section": "2 Causal attention"}, {"figure_path": "OiVxYf9trg/figures/figures_5_1.jpg", "caption": "Figure 1: Particle trajectories for different Value matrices. In all cases we take simple Query and Key matrices K = Q = Id, temperature β = 9 and final time T = 5000 for n = 32 particles initialized uniformly at random on the sphere. Positions of particles at time T are indicated by a red dot.", "description": "This figure visualizes the trajectories of particles for different value matrices in a causal self-attention transformer model.  The trajectories are plotted on the surface of a sphere.  Simple Query and Key matrices (identity matrices) and a temperature parameter (β=9) are used for all cases. The simulation runs until a final time T = 5000, with 32 particles initially distributed randomly across the sphere.  Red dots indicate the final positions of the particles at time T. The figure demonstrates how different Value matrices affect the final clustering of particles, showing various scenarios including convergence to single points, a pair of antipodal points, and multiple clusters.", "section": "2 Causal attention"}, {"figure_path": "OiVxYf9trg/figures/figures_7_1.jpg", "caption": "Figure 3: Total percentage of particles consumed by Rényi and strong Rényi centers over time. Here we have plotted average, 0.1 and 0.9 quantiles over 5000 experiments with n = 200, d = 2, β = 64, δ = 4β-1/2.", "description": "This figure shows the percentage of particles consumed by Rényi and strong Rényi centers over time.  The data is averaged over 5000 experiments, and shows the average, 10th percentile, and 90th percentile for both Rényi and strong Rényi centers.  The parameters used are n = 200 particles, dimension d = 2, temperature β = 64, and separation parameter δ = 4β-1/2. The plot demonstrates the increasing influence of the centers over time, particularly the strong Rényi centers, which appear to become more stable and consume a larger fraction of particles.", "section": "5 Meta-stable clustering"}, {"figure_path": "OiVxYf9trg/figures/figures_17_1.jpg", "caption": "Figure 1: Particle trajectories for different Value matrices. In all cases we take simple Query and Key matrices K = Q = Id, temperature β = 9 and final time T = 5000 for n = 32 particles initialized uniformly at random on the sphere. Positions of particles at time T are indicated by a red dot.", "description": "This figure shows the trajectories of particles (representing tokens) on a sphere for different value matrices (V) in a causal self-attention mechanism.  The key and query matrices (K and Q) are kept as identity matrices, with a temperature parameter (β) of 9.  The simulations run for 5000 time steps, starting from random initial positions on the sphere. The final positions of the particles at time T=5000 are indicated by red dots.  The figure demonstrates how different value matrices affect the final clustering of particles.", "section": "Causal attention"}]