[{"figure_path": "gHYhVSCtDH/tables/tables_6_1.jpg", "caption": "Table 1: Performance comparison on the validation set of Waymo Open Dataset (single-frame setting). Symbol '-' means that the result is not available.", "description": "This table presents a comparison of the performance of various 3D object detection methods on the validation set of the Waymo Open Dataset.  The comparison focuses on single-frame performance, meaning that each method's prediction is based on a single frame of data, not multiple frames.  The table shows the performance of different methods across three object categories: vehicles, pedestrians, and cyclists.  For each category, the results are presented as mean Average Precision (mAP) and mean Average Precision weighted by heading accuracy (mAPH) at two levels (L1 and L2), indicating the confidence of detection and accuracy of the predicted heading direction.  The symbol '-' indicates that the result is not available for the corresponding method.", "section": "4 Experiments"}, {"figure_path": "gHYhVSCtDH/tables/tables_6_2.jpg", "caption": "Table 2: Performance comparison on the test set of Waymo Open Dataset. Symbol '-' means that the result is not available. \"3f\" stands for 3-frame model.", "description": "This table compares the performance of Voxel Mamba against other state-of-the-art 3D object detection methods on the Waymo Open Dataset test set.  The metrics used are Level 1 and Level 2 mean average precision (mAP) and mean average precision with heading accuracy (mAPH) for all object categories (ALL), vehicles, pedestrians, and cyclists.  The \"3f\" designation indicates results obtained using a three-frame model, representing temporal context.", "section": "4 Experiments"}, {"figure_path": "gHYhVSCtDH/tables/tables_7_1.jpg", "caption": "Table 3: Comparison with the state-of-the-art detectors on the nuScenes dataset validation split.", "description": "This table compares the performance of Voxel Mamba with other state-of-the-art 3D object detection methods on the nuScenes validation dataset.  The metrics used include NDS (NuScenes Detection Score), mAP (mean Average Precision), and per-category AP (Average Precision) for various object classes (Car, Truck, Bus, Train, Trailer, Cyclist, Pedestrian, Motorcycle, Bicycle, Construction Vehicle, Barrier).  It showcases the competitive performance of Voxel Mamba in terms of overall accuracy and class-specific performance.", "section": "4 Experiments"}, {"figure_path": "gHYhVSCtDH/tables/tables_7_2.jpg", "caption": "Table 4: Comparison with the state-of-the-art detectors on the nuScenes dataset test split.", "description": "This table presents a comparison of the proposed Voxel Mamba model's performance against several state-of-the-art 3D object detection methods on the nuScenes test dataset.  The metrics used for comparison include the nuScenes Detection Score (NDS) and mean Average Precision (mAP), broken down by object category (Car, Truck, Bus, Trailer, Construction Vehicle, Pedestrian, Motorcycle, Bicycle, Traffic Cone, Barrier).  The table highlights Voxel Mamba's competitive performance, showcasing its improved accuracy compared to existing methods.", "section": "4 Experiments"}, {"figure_path": "gHYhVSCtDH/tables/tables_8_1.jpg", "caption": "Table 5: Comparison with other well-designed architectures on GPU memory.", "description": "This table compares the GPU memory usage of Voxel Mamba with other state-of-the-art 3D object detection methods.  It shows that Voxel Mamba, using SSMs, is more memory-efficient than methods based on Transformers or SpCNN, while achieving comparable or better accuracy.", "section": "4.4 Ablation Studies"}, {"figure_path": "gHYhVSCtDH/tables/tables_8_2.jpg", "caption": "Table 6: Ablations on the nuScenes validation split. In (d), Centerpoint-Pillar is used as the baseline.", "description": "This table presents the ablation study results conducted on the nuScenes validation dataset. It explores the impact of different components and design choices of the proposed Voxel Mamba model on its performance, as measured by mAP and NDS.  Specifically, it investigates the effects of different space-filling curves, the dual-scale SSM block (DSB) with varying downsampling rates, the implicit window partition (IWP), and positional embeddings on model accuracy.  The table allows for a detailed comparison of the contributions of each component towards the overall performance gains.", "section": "4.4 Ablation Studies"}, {"figure_path": "gHYhVSCtDH/tables/tables_8_3.jpg", "caption": "Table 6: Ablations on the nuScenes validation split. In (d), Centerpoint-Pillar is used as the baseline.", "description": "This table presents the ablation study results on the nuScenes validation dataset. It shows the impact of each component of the proposed Voxel Mamba model on the mAP and NDS metrics. The baseline is Centerpoint-Pillar, and the components added sequentially are bidirectional SSMs (with Hilbert curve), Voxel, DSB (Dual-scale SSM Block), and IWP (Implicit Window Partition).  The table demonstrates how each addition improves performance. ", "section": "4.4 Ablation Studies"}, {"figure_path": "gHYhVSCtDH/tables/tables_8_4.jpg", "caption": "Table 6: Ablations on the nuScenes validation split. In (d), Centerpoint-Pillar is used as the baseline.", "description": "This ablation study investigates the impact of different components and hyperparameters of the Voxel Mamba model on the nuScenes dataset.  Specifically, it evaluates the effects of different space-filling curves, downsampling rates in the Dual-scale SSM Block (DSB), the Implicit Window Partition (IWP), and positional embeddings. The results, presented as mAP and NDS scores, demonstrate the contributions of each component and the optimal hyperparameter settings for improved performance.", "section": "4.4 Ablation Studies"}, {"figure_path": "gHYhVSCtDH/tables/tables_8_5.jpg", "caption": "Table 6: Ablations on the nuScenes validation split. In (d), Centerpoint-Pillar is used as the baseline.", "description": "This table presents ablation study results on the nuScenes validation dataset. It investigates the impact of different components and hyperparameters of the proposed Voxel Mamba model on its performance, measured by mAP and NDS.  The ablation experiments cover various aspects: space-filling curves, components of Voxel Mamba (bidirectional SSMs, voxel representation, DSB, and IWP), downsampling rates of DSB, and positional embedding methods.  The baseline used in part (d) is CenterPoint-Pillar.", "section": "4.4 Ablation Studies"}]