[{"figure_path": "7NrYnCN2be/figures/figures_1_1.jpg", "caption": "Figure 1: (a) shows some images from synthetic datasets MJSynth and SynthText. (b) and (c) show several challenging test images. (d) and (e) display the visualization of character feature distribution.", "description": "This figure demonstrates the limitations of current scene text recognition (STR) models.  (a) shows simple examples from synthetic datasets, highlighting the discrepancy between the simplicity of training data and the complexity of real-world text. (b) and (c) showcase challenging real-world text samples with artistic styles and severe distortions. (d) and (e) use t-SNE to visualize the character feature distributions of a prior model (ParSeq) and the proposed ViSu model.  The visualization highlights that ParSeq struggles to clearly distinguish characters, while ViSu achieves better separation.", "section": "1 Introduction"}, {"figure_path": "7NrYnCN2be/figures/figures_3_1.jpg", "caption": "Figure 2: (a) All possible representations of English text images according to character orientation and reading order. (b) The unified representation forms of the word “standard” obtained through Online Generation Strategy. The first row with a red border shows two primary forms, and the second row can be obtained by rotating them 180 degrees.", "description": "This figure shows how the Online Generation Strategy (OGS) unifies the different representations of text images.  Part (a) illustrates the eight possible variations of a word due to different character orientations and reading orders.  Part (b) demonstrates how OGS reduces these eight variations into two primary forms by considering aspect ratios and rotation. These unified forms serve as base images for feature alignment in the model, making it more robust to variations in real-world text images.", "section": "3 Methodology"}, {"figure_path": "7NrYnCN2be/figures/figures_4_1.jpg", "caption": "Figure 3: Our framework consists of the student and teacher model. Lrec, Lccr, Lcua mean recognition loss, character consistency regularization loss and character unidirectional alignment loss. Green and orange stand for labeled and unlabeled data, respectively.", "description": "This figure illustrates the ViSu framework, a semi-supervised scene text recognition model. It uses a Mean Teacher architecture with a student and teacher model, both employing transformer-based encoders and decoders.  The student model is trained with labeled and unlabeled data, while the teacher model uses only labeled data to provide guidance via an exponential moving average of the student's parameters.  The framework incorporates three loss functions: recognition loss (Lrec), character consistency regularization loss (Lccr), and character unidirectional alignment loss (Lcua).  The Online Generation Strategy (OGS) generates additional background-free samples to enhance data diversity for the student model.  Green arrows represent the flow of labeled and unlabeled data through the student and teacher models, and green lines show the flow of information specifically from the labeled data to the teacher model.", "section": "3 Methodology"}, {"figure_path": "7NrYnCN2be/figures/figures_18_1.jpg", "caption": "Figure 2: (a) All possible representations of English text images according to character orientation and reading order. (b) The unified representation forms of the word “standard” obtained through Online Generation Strategy. The first row with a red border shows two primary forms, and the second row can be obtained by rotating them 180 degrees.", "description": "Figure 2 illustrates the different representations of English text images based on character orientation and reading order.  Part (a) shows the eight possible variations caused by these factors. Part (b) demonstrates how the Online Generation Strategy unifies these representations into two main forms (shown in the top row with red borders) and their corresponding rotated forms (bottom row). This simplification is crucial for the proposed method's effectiveness in handling the diversity of character styles.", "section": "3 Methodology"}, {"figure_path": "7NrYnCN2be/figures/figures_18_2.jpg", "caption": "Figure 2: (a) All possible representations of English text images according to character orientation and reading order. (b) The unified representation forms of the word \"standard\" obtained through Online Generation Strategy. The first row with a red border shows two primary forms, and the second row can be obtained by rotating them 180 degrees.", "description": "This figure shows different representations of text images based on character orientation and reading order.  Part (a) illustrates the eight possible variations for a single word. Part (b) demonstrates how these eight variations are unified into two primary forms using the Online Generation Strategy, reducing complexity for the model's training process. The two primary forms and their rotated versions (180 degrees) are shown.", "section": "3 Methodology"}]