[{"figure_path": "h3Kv6sdTWO/tables/tables_7_1.jpg", "caption": "Table 1: Comprehensive comparison of quantitative results on Sparse-View CT Reconstruction on Axial View for AAPM and LIDC datasets. Best results are in bold.", "description": "This table presents a quantitative comparison of different methods for sparse-view computed tomography (CT) reconstruction.  The metrics used for comparison are PSNR (Peak Signal-to-Noise Ratio) and SSIM (Structural Similarity Index).  Results are shown for both the AAPM and LIDC datasets (two different CT datasets), and for varying numbers of views (8, 6, and 4). The best performing method for each metric and dataset is highlighted in bold.  The table helps readers quickly assess the relative performance of the different CT reconstruction algorithms.", "section": "4 Experiments"}, {"figure_path": "h3Kv6sdTWO/tables/tables_8_1.jpg", "caption": "Table 1: Comprehensive comparison of quantitative results on Sparse-View CT Reconstruction on Axial View for AAPM and LIDC datasets. Best results are in bold.", "description": "This table presents a quantitative comparison of different methods for sparse-view computed tomography (CT) reconstruction.  The metrics used are PSNR (Peak Signal-to-Noise Ratio) and SSIM (Structural Similarity Index).  Results are shown for both the AAPM and LIDC datasets, and for different numbers of views (8, 6, and 4).  The table highlights the superior performance of the proposed DiffusionBlend++ method. ", "section": "4 Experiments"}, {"figure_path": "h3Kv6sdTWO/tables/tables_8_2.jpg", "caption": "Table 1: Comprehensive comparison of quantitative results on Sparse-View CT Reconstruction on Axial View for AAPM and LIDC datasets. Best results are in bold.", "description": "This table presents a quantitative comparison of different methods for sparse-view computed tomography (CT) reconstruction on axial slices.  It compares the performance of several methods, including FBP, FBP-UNet, DiffusionMBIR, TPDM, DDS 2D, DDS, DiffusionBlend, and DiffusionBlend++, across various metrics (PSNR and SSIM) and different numbers of views (4, 6, and 8) on two datasets (AAPM and LIDC).  The best-performing methods for each metric and view count are highlighted in bold.", "section": "4 Experiments"}, {"figure_path": "h3Kv6sdTWO/tables/tables_8_3.jpg", "caption": "Table 1: Comprehensive comparison of quantitative results on Sparse-View CT Reconstruction on Axial View for AAPM and LIDC datasets. Best results are in bold.", "description": "This table compares the performance of different methods for sparse-view CT reconstruction on the axial view using two datasets, AAPM and LIDC.  The metrics used are PSNR and SSIM, both higher values indicating better reconstruction quality.  The methods compared include traditional methods like FBP and FBP-UNet and several diffusion-based methods such as DiffusionMBIR, TPDM, and DDS.  The table shows how DiffusionBlend++ achieves the best performance across different numbers of views and across the two datasets.", "section": "4 Experiments"}, {"figure_path": "h3Kv6sdTWO/tables/tables_8_4.jpg", "caption": "Table 5: TV values of different reconstruction algorithms on the AAPM test set", "description": "This table compares the total variation (TV) values of reconstructed images from different algorithms on the AAPM test dataset.  The TV values represent the smoothness of the images, with lower values indicating smoother images.  The table shows that DiffusionBlend++, the proposed method, achieves a TV value very close to the ground truth, indicating a good balance between smoothness and detail preservation. In contrast, DDS, another state-of-the-art method, over-smooths the images, resulting in a lower TV value than the ground truth.", "section": "4 Experiments"}, {"figure_path": "h3Kv6sdTWO/tables/tables_9_1.jpg", "caption": "Table 7: Effectiveness of Blending Modules, Sagittal view performance on AAPM", "description": "This table presents the results of an ablation study evaluating the impact of two blending modules on the performance of the DiffusionBlend++ method for 3D CT reconstruction. The study was conducted using the AAPM dataset, specifically focusing on sagittal view reconstructions. The table shows the PSNR and SSIM values achieved with different combinations of the adjacency-slice blending module and cross-slice blending module, demonstrating the contribution of each module to the overall performance improvement.", "section": "Ablation Studies"}, {"figure_path": "h3Kv6sdTWO/tables/tables_15_1.jpg", "caption": "Table 7: Effectiveness of Blending Modules, Sagittal view performance on AAPM", "description": "This table shows the effectiveness of adding adjacency-slice blending and cross-slice blending modules to the reverse sampling process in the DiffusionBlend++ model.  It demonstrates that both the adjacency-slice blending and the cross-slice blending modules contribute to better reconstruction quality, as indicated by improvements in PSNR and SSIM.", "section": "Ablation Studies"}, {"figure_path": "h3Kv6sdTWO/tables/tables_15_2.jpg", "caption": "Table 8: Axial PSNR for 8 view SVCT reconstruction for different NFES", "description": "This table presents the Peak Signal-to-Noise Ratio (PSNR) values achieved by the DDS and DiffusionBlend++ methods for different numbers of neural function evaluations (NFEs) in the context of 8-view sparse-view computed tomography (SVCT) reconstruction. It highlights the impact of NFEs on reconstruction quality for both methods, showing DiffusionBlend++'s superior performance and robustness compared to DDS across various NFEs.", "section": "Ablation Studies"}, {"figure_path": "h3Kv6sdTWO/tables/tables_15_3.jpg", "caption": "Table 9: Axial PSNR for 8 view SVCT recon for different slice jump frequencies", "description": "This table shows the Peak Signal-to-Noise Ratio (PSNR) results for 8-view sparse-view computed tomography (CT) reconstruction using DiffusionBlend++, varying the frequency of applying slice jumps during reconstruction.  The frequency indicates how often the algorithm uses partitions with \"jumping\" slices instead of adjacent slices.  A frequency of 2 means that adjacent and jumping slices are used alternately, while a higher frequency means jumping slices are used less frequently.", "section": "4 Experiments"}, {"figure_path": "h3Kv6sdTWO/tables/tables_16_1.jpg", "caption": "Table 10: Wall times of various methods for 8 view 3D CT reconstruction", "description": "This table compares the wall clock time (in minutes) taken by different methods to reconstruct a 3D CT scan using 8 views.  The methods compared include DiffusionMBIR, TPDM, DDS, DiffusionBlend, and DiffusionBlend++. The number of neural function evaluations (NFEs) used for each method is also listed.  It demonstrates that DiffusionBlend++ achieves comparable or better reconstruction speed compared to other state-of-the-art methods.", "section": "4 Experiments"}, {"figure_path": "h3Kv6sdTWO/tables/tables_18_1.jpg", "caption": "Table 1: Comprehensive comparison of quantitative results on Sparse-View CT Reconstruction on Axial View for AAPM and LIDC datasets. Best results are in bold.", "description": "This table compares the performance of different methods for sparse-view CT reconstruction on axial slices of the AAPM and LIDC datasets.  The methods compared include FBP, FBP-UNet, DiffusionMBIR, TPDM, DDS 2D, DDS, DiffusionBlend, and DiffusionBlend++.  The table shows the PSNR and SSIM values for each method under different numbers of views (4, 6, and 8).  Higher PSNR and SSIM values indicate better reconstruction quality.  The best results for each metric and view are highlighted in bold.", "section": "4 Experiments"}, {"figure_path": "h3Kv6sdTWO/tables/tables_18_2.jpg", "caption": "Table 1: Comprehensive comparison of quantitative results on Sparse-View CT Reconstruction on Axial View for AAPM and LIDC datasets. Best results are in bold.", "description": "This table compares the performance of different methods for sparse-view computed tomography (CT) reconstruction on two datasets: AAPM and LIDC.  The performance is measured using Peak Signal-to-Noise Ratio (PSNR) and Structural Similarity Index (SSIM).  The table shows the results for different numbers of views (4, 6, and 8) used in the reconstruction process. Higher PSNR and SSIM values indicate better reconstruction quality.", "section": "4 Experiments"}]