[{"figure_path": "0feJEykDRx/figures/figures_3_1.jpg", "caption": "Figure 1: The overall of our Mobility-LLM framework. a) POI Point-wise Embedding Layer (PPEL). b) Visiting Intention Memory Network (VIMN). c) Human Travel Preference Prompt (HTPP). d) a denotes the output of the LLM corresponding to VIMN (i.e. first n output of the LLM), while the remaining outputs are denoted as β.", "description": "This figure presents the Mobility-LLM framework, which consists of four main components: 1. POI Point-wise Embedding Layer (PPEL) to generate semantic information embedding for each POI in a check-in record. 2. Visiting Intention Memory Network (VIMN) to capture users' visiting intentions at each check-in record by prioritizing relevant check-in records. 3. Human Travel Preference Prompt (HTPP) pool to extract users' preferences from check-in sequences. 4. A pre-trained LLM (Partially-Frozen + LoRA) that takes the output of VIMN and HTPP as input to perform different downstream tasks (Location prediction, Time prediction and User link prediction).", "section": "4 Methodology"}, {"figure_path": "0feJEykDRx/figures/figures_3_2.jpg", "caption": "Figure 2: The architecture of HTPP.", "description": "The figure illustrates the architecture of the Human Travel Preference Prompt (HTPP) module.  It shows three domains (Activity, Occupation, Lifestyle) each with a set of prompt words.  A score-matching function determines the relevance of each visiting intention (represented by h<sub>i</sub>) to the prompt words within each domain.  The top-K most relevant prompt words are selected for each domain, providing a comprehensive understanding of user travel preferences.", "section": "4 Methodology"}, {"figure_path": "0feJEykDRx/figures/figures_7_1.jpg", "caption": "Figure 1: The overall of our Mobility-LLM framework. a) POI Point-wise Embedding Layer (PPEL). b) Visiting Intention Memory Network (VIMN). c) Human Travel Preference Prompt (HTPP). d) a denotes the output of the LLM corresponding to VIMN (i.e. first n output of the LLM), while the remaining outputs are denoted as β.", "description": "This figure presents the Mobility-LLM framework's architecture. It consists of four main components:\n\n1.  **POI Point-wise Embedding Layer (PPEL)**: Embeds points of interest (POIs) by incorporating category semantics.\n2.  **Visiting Intention Memory Network (VIMN)**: Captures user visiting intentions at each check-in record.\n3.  **Human Travel Preference Prompt (HTPP)**: Extracts user travel preferences from check-in sequences.\n4.  **Partially-Frozen LLM + LoRA**: Processes the inputs (PPEs, timestamps, VIMN output, HTPP) to make predictions for location, time, and user.\n\nThe figure illustrates how these components interact and contribute to the model's ability to understand human mobility data.", "section": "4 Methodology"}, {"figure_path": "0feJEykDRx/figures/figures_8_1.jpg", "caption": "Figure 1: The overall of our Mobility-LLM framework. a) POI Point-wise Embedding Layer (PPEL). b) Visiting Intention Memory Network (VIMN). c) Human Travel Preference Prompt (HTPP). d) α denotes the output of the LLM corresponding to VIMN (i.e. first n output of the LLM), while the remaining outputs are denoted as β.", "description": "This figure illustrates the architecture of the Mobility-LLM framework, a novel unified framework for check-in sequence analysis. It shows the three main components:  POI Point-wise Embedding Layer (PPEL), Visiting Intention Memory Network (VIMN), and Human Travel Preference Prompt (HTPP). The PPEL generates semantic information embeddings for each POI. The VIMN captures the visiting intentions of users at each check-in record by prioritizing relevant check-in records. The HTPP extracts users' preferences from check-in sequences, acting as cues to assist the LLM in understanding users' travel preferences. The LLM processes the information from these three components to perform three downstream tasks: location prediction, trajectory user link, and time prediction.", "section": "4 Methodology"}, {"figure_path": "0feJEykDRx/figures/figures_23_1.jpg", "caption": "Figure 1: The overall of our Mobility-LLM framework. a) POI Point-wise Embedding Layer (PPEL). b) Visiting Intention Memory Network (VIMN). c) Human Travel Preference Prompt (HTPP). d) a denotes the output of the LLM corresponding to VIMN (i.e. first n output of the LLM), while the remaining outputs are denoted as β.", "description": "This figure presents the Mobility-LLM framework, which is a unified framework for check-in sequence analysis.  The framework consists of four main components: (a) POI Point-wise Embedding Layer (PPEL) which generates embeddings for Points of Interest (POIs) considering category semantics; (b) Visiting Intention Memory Network (VIMN) which captures visiting intentions of users; (c) Human Travel Preference Prompt (HTPP) which extracts user preferences from check-in sequences; and (d) a partially frozen Large Language Model (LLM) which utilizes the information generated from the previous components to perform different check-in sequence analysis tasks.  The output from the LLM is divided into two parts: α (the first n outputs corresponding to VIMN) and β (the remaining outputs).", "section": "4 Methodology"}]