[{"figure_path": "RnxJc4vTVi/tables/tables_7_1.jpg", "caption": "Table 1: Long-horizon tasks execution performance (varies by sub-task completion progress): *tasks with 2 sub-tasks progress by 0.5 per sub-task, *tasks with 4 sub-tasks by 0.25, *tasks with 5 sub-tasks by 0.2, and table_dockstra with 3 sub-tasks by 0.3, where 0.9 indicates completion of all tasks. Best viewed zoomed.", "description": "This table presents a quantitative comparison of the performance of different methods (PPO, GAIL, Fixed-RL-IL, SkiMo, Policy Sequencing, T-STAR, SCaR w/o Bi, SCaR w/o AES, and SCaR) across various long-horizon robotic manipulation tasks (six IKEA furniture assembly tasks and two kitchen organization tasks).  The success rate for each method is shown as the average completion rate across multiple trials and reflects the proportion of times the robot successfully completes all subtasks in the long-horizon task. The table also indicates how the success rate is calculated for different numbers of subtasks.", "section": "5.2 Quantitative Results"}, {"figure_path": "RnxJc4vTVi/tables/tables_14_1.jpg", "caption": "Table 1: Long-horizon tasks execution performance (varies by sub-task completion progress): *tasks with 2 sub-tasks progress by 0.5 per sub-task, *tasks with 4 sub-tasks by 0.25, *tasks with 5 sub-tasks by 0.2, and table_dockstra with 3 sub-tasks by 0.3, where 0.9 indicates completion of all tasks. Best viewed zoomed.", "description": "This table presents a quantitative comparison of different methods' performance on eight long-horizon robotic manipulation tasks.  The tasks include IKEA furniture assembly tasks and kitchen organization tasks, with varying numbers of sub-tasks. The table shows the average success rate (with standard deviation) for each method on each task.  A higher success rate indicates better performance in completing the long-horizon tasks.", "section": "5.2 Quantitative Results"}, {"figure_path": "RnxJc4vTVi/tables/tables_20_1.jpg", "caption": "Table 2: Comparison of the robustness of skill chaining in perturbed environments.", "description": "This table compares the success rates of different skill chaining methods (Policy Sequencing, T-STAR, SCaR variants) on two furniture assembly tasks (chair_bernhard and chair_ingolf) under both stationary and perturbed conditions.  The perturbation involves applying external torque to the robot arm during task execution. The results show how well each method maintains performance in the face of unexpected disturbances.", "section": "5.3 Robustness to Perturbations"}, {"figure_path": "RnxJc4vTVi/tables/tables_21_1.jpg", "caption": "Table 4: The impact of different sub-task divisions on SCaR performance.", "description": "This table presents the results of an ablation study conducted to investigate how different sub-task divisions affect the performance of the SCaR model. Two different setups are evaluated for the chair_ingolf task: setup 1 combines two sub-tasks and setup 2 combines two other sub-tasks.  The results show the success rate of the SCaR model in each setup.  The study aims to determine the impact of sub-task granularity on the SCaR's overall success rate.", "section": "D.4 Impact of Different Sub-task Divisions"}, {"figure_path": "RnxJc4vTVi/tables/tables_21_2.jpg", "caption": "Table 5: Performance Comparison on Longer Extended Kitchen Task.", "description": "This table compares the performance of T-STAR and SCaR on the Longer Extended Kitchen task, which involves six sequential sub-tasks.  The results show that SCaR achieves a significantly higher success rate than T-STAR, demonstrating its effectiveness in handling more complex, long-horizon manipulation tasks.", "section": "5.2 Quantitative Results"}, {"figure_path": "RnxJc4vTVi/tables/tables_23_1.jpg", "caption": "Table 6: Skill chaining performance of real-world long-horizon robotic manipulation tasks.", "description": "This table presents the success rates achieved by T-STAR and SCaR on real-world long-horizon robotic manipulation tasks involving pick-and-place operations with 2 and 3 blue squares.  The success rates reflect the percentage of successful task completions out of multiple trials.", "section": "5.3 Robustness to Perturbations"}, {"figure_path": "RnxJc4vTVi/tables/tables_27_1.jpg", "caption": "Table 1: Long-horizon tasks execution performance (varies by sub-task completion progress): *tasks with 2 sub-tasks progress by 0.5 per sub-task, *tasks with 4 sub-tasks by 0.25, *tasks with 5 sub-tasks by 0.2, and table_dockstra with 3 sub-tasks by 0.3, where 0.9 indicates completion of all tasks. Best viewed zoomed.", "description": "This table presents a quantitative comparison of the performance of different methods (including the proposed SCaR and baselines) on various long-horizon robotic manipulation tasks. The performance is measured by the success rate of completing all sub-tasks within each task.  The table highlights the varying complexity of the tasks by showing different numbers of sub-tasks and the progress rate for each sub-task, making it easier to interpret the results.", "section": "5.2 Quantitative Results"}, {"figure_path": "RnxJc4vTVi/tables/tables_27_2.jpg", "caption": "Table 1: Long-horizon tasks execution performance (varies by sub-task completion progress): *tasks with 2 sub-tasks progress by 0.5 per sub-task, *tasks with 4 sub-tasks by 0.25, *tasks with 5 sub-tasks by 0.2, and table_dockstra with 3 sub-tasks by 0.3, where 0.9 indicates completion of all tasks. Best viewed zoomed.", "description": "This table presents a quantitative comparison of different methods' performance on eight long-horizon robotic manipulation tasks.  The tasks include IKEA furniture assembly and kitchen organization tasks, varying in the number of sub-tasks (2, 3, 4, or 5). The success rate is shown for each method, reflecting the average completion progress across multiple trials and random seeds. The table highlights the differences in performance and success rates across various approaches, reflecting factors such as the number of sub-tasks, method type (scratch RL, scratch IL, skill chaining, etc.), and the impact of dual regularization strategies.", "section": "5.2 Quantitative Results"}]