[{"figure_path": "mZsvm58FPG/tables/tables_6_1.jpg", "caption": "Table 1: Quantitative comparisons of different methods on multi-exposure correction datasets. The best and second-best results are highlighted in bold and underlined, respectively. “↑” means the larger, the better. Note that we obtain these results either from the original papers, or by running the officially released pre-trained models. “*” means that original papers don't report corresponding performance and we train their models using their officially released code.", "description": "This table quantitatively compares the performance of ECMamba with other state-of-the-art (SOTA) methods on two multi-exposure correction datasets (ME and SICE).  The metrics used for comparison are PSNR (Peak Signal-to-Noise Ratio) and SSIM (Structural Similarity Index), both higher values indicating better performance.  The table also shows the average performance across both under-exposed and over-exposed images for each method.  Some methods are marked with an asterisk (*) indicating that the original paper did not report the results for the datasets used in this paper, so the authors re-trained them.", "section": "5.2 Performances on Multi-Exposure and Under-Exposure Correction"}, {"figure_path": "mZsvm58FPG/tables/tables_8_1.jpg", "caption": "Table 1: Quantitative comparisons of different methods on multi-exposure correction datasets. The best and second-best results are highlighted in bold and underlined, respectively. “↑” means the larger, the better. Note that we obtain these results either from the original papers, or by running the officially released pre-trained models. “*” means that original papers don't report corresponding performance and we train their models using their officially released code.", "description": "This table presents a quantitative comparison of various methods for multi-exposure correction using two datasets, ME and SICE.  The performance metrics used are PSNR (Peak Signal-to-Noise Ratio) and SSIM (Structural Similarity Index).  Higher values indicate better performance. The table includes the names of the compared methods, their source publications, and the obtained PSNR and SSIM values for under-exposed and over-exposed images. The table also indicates whether the results were taken from the original papers or obtained by running the authors' code using publicly available pre-trained models.", "section": "5.2 Performances on Multi-Exposure and Under-Exposure Correction"}, {"figure_path": "mZsvm58FPG/tables/tables_9_1.jpg", "caption": "Table 3: Ablation studies on SICE dataset and the average PSNR and SSIM are reported. Left is used to verify the effectiveness of the two-branch Retinex-based framework, right is to present the importance of our proposed ECMamba module and FA-SS2D strategy. [Key: *: When ML is removed, the hidden dimension of MR is increased to ensure its parameter number is comparable to ECMamba; ViT/Retiformer: utilized to replace our ECMamba module; Cross-Scan Mechanism: adopted to replace our FA-SS2D strategy.]", "description": "This ablation study investigates the contribution of different components in the proposed ECMamba model for exposure correction.  The left side evaluates the two-branch Retinex-based framework by removing either the illumination branch (ML), reflectance branch (MR), or the Retinex estimator (E). The right side compares ECMamba against other methods by replacing the core module with Vision Transformer (ViT) and Retiformer, and by replacing the FA-SS2D with a cross-scan mechanism, showing the superiority of the proposed approach.", "section": "5.3 Ablation Study"}]