[{"type": "text", "text": "Microstructures and Accuracy of Graph Recall by Large Language Models ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Yanbang Wang Hejie Cui Jon Kleinberg Cornell University Stanford University Cornell University ywangdr@cs.cornell.edu hejie.cui@stanford.edu kleinberg@cornell.edu ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Graphs data is crucial for many applications, and much of it exists in the relations described in textual format. As a result, being able to accurately recall and encode a graph described in earlier text is a basic yet pivotal ability that large language models (LLMs) need to demonstrate if they are to perform reasoning tasks that involve graph-structured information. Human performance at graph recall by has been studied by cognitive scientists for decades, and has been found to often exhibit certain structural patterns of bias that align with human handling of social relationships. To date, however, we know little about how LLMs behave in analogous graph recall tasks: do their recalled graphs also exhibit certain biased patterns, and if so, how do they compare with humans and affect other graph reasoning tasks? In this work, we perform the first systematical study of graph recall by LLMs, investigating the accuracy and biased microstructures (local subgraph patterns) in their recall. We find that LLMs not only underperform often in graph recall, but also tend to favor more triangles and alternating 2-paths. Moreover, we find that more advanced LLMs have a striking dependence on the domain that a real-world graph comes from — by yielding the best recall accuracy when the graph is narrated in a language style consistent with its original domain. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Large language models (LLMs) achieve remarkable progress in recent years. In many applications, LLMs’ success relies on appropriate handing of graph-structured information embedded in text. For example, to accurately answer questions pertaining to the characters in a story, it is crucial for an LLM to be able to recognize and analyze the social network of relations among these characters. In fact, graph-structured information is ubiquitous across many language-based applications, such as structured commonsense reasoning [32], multi-agent communications [3], multi-hop question answering [15], and more. LLMs’ graph reasoning ability has thus become an active research topic. ", "page_idx": 0}, {"type": "text", "text": "Existing works on LLMs’ graph reasoning ability have been primarily posited in the context of various graph tasks, from most basic ones such as computing node degree, graph diameter, clustering coefficient, or checking cycles [48, 20, 18], to more challenging ones such as node/graph classification [14, 38] and link-based recommendations [55]. Sec. 7 provides a more comprehensive survey. ", "page_idx": 0}, {"type": "text", "text": "But all of the tasks above rely on the premise that an LLM is able to start from the graph that is described in the text it is given. Thus, our key starting observation here is that all of these tasks rely on a pivotal (and perhaps seemingly trivial) ability of LLMs – to recall and encode a set of relations described in earlier text. In this paper, we consider a graph recall task which has been extensively studied in cognitive science [8, 44, 7, 9, 41], and which formalizes this basic goal, illustrated in Figure 1: a set of pairwise relationships is described in a simple narrative form to the experimental subject (human or LLM); then at a later point in the experiment, the subject is asked to recall and describe these relationships explicitly in the form of a graph. ", "page_idx": 0}, {"type": "text", "text": "The rationale for studying an LLM’s graph recall is simple. If an LLM cannot even accurately recall the graph it is asked to reason upon, it will not be able to do well in any of the more advanced graph tasks surveyed above. Further, structural patterns in recall errors may propagate to (or even serve as the basis for) the behavior of LLMs in these more complex graph tasks. Therefore, we consider it important to investigate LLMs’ graph recall ability, a topic absent from existing literature. The edge prediction task is related to but fundamentally different from the graph recall task: the correct answer for graph recall always exists in the prompt and can be directly extracted, which is not true for any prediction tasks. ", "page_idx": 1}, {"type": "text", "text": "Meanwhile, the existing two decades of studies on human’s graph recall ability provide another fascinating perspective to motivate our study. Cognitive scientists have found through substantial human experiments that, when memorizing a social network, humans extensively employ certain compression heuristics, such as triadic closure, near-clique completion, and certain degree biases [8, 35], due to natural limits on cognitive capacity. Further studies show that a person’s ability to accurately recall a social network, along with the microstructures (local subgraph patterns, or network motifs [2, 34]) in their recalled network, not only has profound influence on their social decisions [25, 11, 52], but also varies on different styles of graph narrative [44], and the sex of the person [7, 22]. Do LLMs use similar compression heuristics as humans, and how are they affected by different working contexts? As LLMs become increasingly integrated into various social applications, it becomes crucial to understand LLM’s behaviors and their associations with human behaviors in these regards. ", "page_idx": 1}, {"type": "image", "img_path": "tNhwg9U767/tmp/c0c3e09ce2aea11a5cb48bfe5ff6559ba77d9b82008307e35b82d7ed25804ebb.jpg", "img_caption": ["Figure 1: Graph recall is a simple task but also a crucial pivot for other graph reasoning tasks. "], "img_footnote": [], "page_idx": 1}, {"type": "text", "text": "The human cognition studies not only motivate our study, but also establish a scientific foundation for our experimental designs. Similar to [42] which uses political orientation tests designed for humans to assess LLM’s political bias, we also find some of the protocols employed by [8] for testing human’s graph recall highly instructional, including: (1) memory clearance, where a classical word span test [17] is conducted between the presentation of the graph content and the query prompt; this serves as a chat buffer that helps simulate the delayed queries in many real-world applications; (2) analyzing biased patterns in graph recall via Exponential Random Graph Model (ERGM), a probabilistic generalization to the network motif methods in graph mining; (3) focusing on the probability of the tokens in subject’s response, rather than just their presence; we replicate this through the log_prob parameter in GPT series or conducting Monto Carlo sampling for Gemini. We will elaborate on these in the following sections. ", "page_idx": 1}, {"type": "text", "text": "Our Work In this work, we investigate the several primary questions regarding the capabilities of LLMs in recalling graph structures. First, we examine the accuracy and microstructures in graphs recalled by LLMs through experiments on real-world graph structures, as well as compare these results with human performance. Second, we explore factors affecting LLMs’ graph recall abilities, focusing on memory clearance strength, and narrative styles of graph encoding, which are known to affect human’s graph recall. Finally, we also consider how LLMs’ graph recall influences their performance in downstream tasks like link prediction, and discuss actionable insights that our findings provide for future research. To summarize, our work makes the following contributions: ", "page_idx": 1}, {"type": "text", "text": "1. We propose graph recall as a simple yet fundamental task for understanding LLM’s graph reasoning abilities, drawing its connection with the existing cognitive studies on human’s graph recall ability. 2. We are the first to design and conduct systematical studies on the accuracy and biased microstructures of LLM’s graph recall, and to compare the results with humans. 3. We present many important and interesting findings on LLM’s behaviors in graph recall, which significantly helps deepen our understandings about LLM’s graph reasoning ability. ", "page_idx": 1}, {"type": "text", "text": "2 Preliminaries ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "2.1 Exponential Random Graph Model (ERGM) ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "We use the Exponential Random Graph Model (ERGM) [39] to characterize the statistical significance of the various microstructural patterns (“network motifs” [2, 34]) in the recalled graphs. ERGM is a special case of the exponential family dedicated for modeling graph-structured data. ", "page_idx": 2}, {"type": "text", "text": "Formally, let $\\mathcal{G}$ be the probability space of all possible graphs over $n$ nodes, and $G=(V,E,f)\\in\\mathcal{G}$ be a random (graph) variable, where $V$ is the set of nodes, $E$ is the set of edges in $G$ , and $f:E\\to[0,1]$ is a edge probability function. Assuming independence between edges, the probability of $G$ can be written as: ", "page_idx": 2}, {"type": "equation", "text": "$$\nP(G)=\\prod_{e\\in E}f(e)\\prod_{e\\notin E}(1-f(e))\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "$A$ is a list of $k$ predefined microstructural patterns in $G$ . Fig.2’s Step 6 shows $k=5$ such patterns that we primarily investigate in this work, following [8]. The conditional probability of observing $G$ given the parameter vector $\\theta$ of length $k$ is defined to be ", "page_idx": 2}, {"type": "equation", "text": "$$\nP(G|\\theta)=\\frac{\\exp\\{\\sum_{i=1}^{k}\\theta_{i}s_{i}(G)\\}}{c_{\\theta}}=\\frac{\\exp\\{\\theta^{T}\\mathbf{s}(G)\\}}{c_{\\theta}}\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "where $\\mathbf{s}(G)$ is the sufficient statistics of $G$ , and each $\\mathbf{s}_{i}(G)$ is a count of the number of occurrences of $A[i]$ in $G$ ; $c_{\\theta}$ is the normalizing constant that only depends on $\\theta$ . We assume an uninformative prior for $\\theta\\sim[-10,10]$ . The posterior $P(\\theta|G)$ can then be optimized via MAP under Bayesian framework. $\\theta$ measures the strength of presence of the $k$ microstructural patterns we care about. A large $\\theta_{i}$ means a strong presence of pattern $A[i]$ in $G$ . ", "page_idx": 2}, {"type": "text", "text": "2.2 Memory Clearance ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "The word span test [17] is a standard method for measuring a human’s working memory capacity. The test requires the subject to read a series of sentence sets out loud, and then recall the last word in each previous sentence in the current set. The number of sentences in each set gradually increases from two to seven, i.e. from three sets of two sentences to three sets of seven sentences. The test continues until the subject fails to recall the final words for two out of three sets of a given size. See Appendix B.2.1 for the sentence sets we used. ", "page_idx": 2}, {"type": "text", "text": "Many cognition studies [8, 7, 6, 5] have adopted this test in their experiment to (1) serve as a chat buffer or spoiler that simulates the delayed query in real-world applications, and (2) clear the shortterm memory of the subject, which allows researchers to better focus on relatively persistent patterns in memory structures. It is important to note that transformer-based LLMs are stateless models that, in strict sense, do not have memory. Nevertheless, we choose to preserve the (slightly misleading) term “memory clearance” to stay aligned with literature and to emphasize the close analogy and behavioral resemblance between LLMs and humans in graph recall. ", "page_idx": 2}, {"type": "text", "text": "3 Microstructures and Accuracy of Graph Recall by LLMs ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Being able to correctly recall a graph described in earlier text is a fundamental ability for LLMs to perform graph reasoning. While graph recall may seem an easy task for the high-capable LLMs nowadays, our extensive experiment shows that their performance is in fact far from perfect. ", "page_idx": 2}, {"type": "text", "text": "This section presents our study on the performance and the microstructures of graph recall by LLMs. Our experimental protocols are introduced in Sec.3.1, followed by Sec.3.3 which presents head-tohead comparisons of LLMs and humans under [8]’s framework. Sec.3.2 substantiates the analysis by experiments on more diverse datasets. Our code and data are reported in Appendix A. ", "page_idx": 2}, {"type": "text", "text": "LLMs Tested: GPT-3.5 [10], GPT-4 [1], Gemini-Pro [46]. We also examined Llama 2 (13B) [47], but they can rarely follow through on our instructions. ", "page_idx": 2}, {"type": "text", "text": "3.1 Experimental Protocols and Datasets ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "Our staged protocols are visualized in Fig.2 and explained below. To recall each graph sample, an LLM needs to separately go through the entire pipeline. The stages proceed in an auto-regressive manner. In other words, the LLM’s intermediate response is always appended to the current thread as additional conservation context, before we proceed to the next stage along the pipeline. ", "page_idx": 2}, {"type": "image", "img_path": "tNhwg9U767/tmp/27b91cd90cf0c0ac0fe24c55ae9f9b293c6183ccdadcf8715a19110fcd542853.jpg", "img_caption": ["Figure 2: Experimental protocols for analyzing microstructures and accuracy of LLM’s graph recall. See Sec.3.1 for detailed explanations. "], "img_footnote": [], "page_idx": 3}, {"type": "text", "text": "Step 1: Task Introduction. The LLM is informed that this is a graph recall test, and that the recall task may happen at a later time. It is also incentivized to yield its best performance. These components follow the ones used in [8] for human studies. ", "page_idx": 3}, {"type": "text", "text": "Step 2: Presenting Graph Vignette. A vignette in sociology is a short, descriptive story that encodes the central piece of information for soliciting subject’s response. Here, our vignette encodes the graph structures sampled from a certain application domain using a certain narrative style — see the dataset tab below for details. ", "page_idx": 3}, {"type": "text", "text": "Step 3: Memory Clearance. A standard word span test [17] is conducted with the LLM. See Sec.2.2 for details. We use the same set of sentences as in [8]. ", "page_idx": 3}, {"type": "text", "text": "Step 4: Prompting. We use zero-shot prompting with moderate formatting instructions for answers. This follows both [8]’s protocol and the finding in [18] that simple prompts are the best for simple tasks, which we also empirically observed. ", "page_idx": 3}, {"type": "text", "text": "Step 5: Retrieving Edge Probabilities. We are interested in both the existence and the probability of each edge (i.e. the $f$ in ERGM) in graphs recalled by LLM – the latter lets us examine LLM’s behavior at finer granularities. We use two tricks to retrieve edge probabilities from LLM’s answers: ", "page_idx": 3}, {"type": "text", "text": "• For GPT series, we can directly access token probabilities through the ChatCompletion API. We instruct the model to output 1 for each edge it believes to exist, and 0 otherwise. Then, we retrieve and normalize the probabilities for tokens 0 and 1, using the latter as the edge probability. • For Gemini-Pro whose token probabilities are not accessible via the API, we conduct Monte Carlo sampling for each potential edge (repeating the query for 100 times), and use the fraction of existence as the edge probability. ", "page_idx": 3}, {"type": "text", "text": "Note that the retrieved edge probabilities essentially constitute a probability graph. ", "page_idx": 3}, {"type": "text", "text": "Step 6: Microstructure Analysis & Performance Measurement. We use the ERGM introduced in Sec. 2.1 to model both the recalled graph and the ground truth, in order to reveal statistically significant structural patterns, or “microstructures” as termed by [8], in the recalled graphs. Specifically, for each microstructural pattern, we compute the gap between its estimated coefficient on the recalled graph against its estimated coefficient on the ground-truth graph. Steps 1 - 6 are repeated for 100 different graphs uniformly sampled from the same domain to compute confidence intervals. ", "page_idx": 3}, {"type": "text", "text": "Datasets. We create five graph datasets from the following application domains. (1) Co-authorship: DBLP (1995-2005); (2) Social network: Facebook [27]; (3) Geological network: CA road; (4) Protein interactions: Reactome [16]; (5) Erd˝os–Rényi graph: as in [18]. Each dataset comprises of 100 graphs and their corresponding textual descriptions in the domain’s narrative language, which are generated from templates that are intentionally kept simple: Fig.2’s Step 2 shows an example for the DBLP dataset. More examples and details are provided in Appendix B. ", "page_idx": 3}, {"type": "text", "text": "Graphs in the first four datasets are uniformly sampled as ego-network, with the central node removed so that no graph isomorphism gets excluded by the sampling scheme. Each graph has 5 to 30 nodes. The Erd˝os–Rényi graph are generated by uniformly sampling a $p$ value from $[0,1]$ . Also note that because the templates used are simple and fixed, we can easily create baselines by reverse-engineering the template to achieve perfect accuracy in graph recall. ", "page_idx": 3}, {"type": "text", "text": "Table 1: Microstructural patterns and performance of graph recall by LLMs on graphs sampled from various application domains; mean ± $\\mathrm{ci}_{95\\%}$ reported. The numbers reported for microstructural patterns are signficance parameters $\\theta$ computed by the ERGM model introduced in Sec. 2.1. A positive (negative) number means the LLM is biased towards encouraging (depressing) the corresponding microstructural pattern in recalled graphs. The patterns are visualized in Fig.2 Step 6. Full table available in Appendix C. ", "page_idx": 4}, {"type": "table", "img_path": "tNhwg9U767/tmp/518201359799e6b63cf625479ea6ac137056be20d00dda5d4dabe350a4d82dbf.jpg", "table_caption": [], "table_footnote": [], "page_idx": 4}, {"type": "text", "text": "3.2 Results and Analysis ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "Table 1 shows the results of microstructural patterns and performance of LLMs in our graph recall test. We primarily investigate the five microstructural patterns as shown in Fig. 2. This is because these patterns have been observed to be biased patterns in human studies and are substantiated with rich sociological explanations [8]; other patterns may also be interesting to examine though, which we leave for future work. A positive/negative value means the LLM is biased towards encouraging/depressing the corresponding microstructural pattern in recalled graphs. We have the following findings. ", "page_idx": 4}, {"type": "text", "text": "LLMs underperform in the graph recall test. We start by examining the performance metrics on the right columns. None of the models are able to perform perfectly on any dataset — in fact not even close in most cases. The unsaturated performance shows that the graph recall test is a meaningful task to investigate. The result also helps partially explain the poor performance of LLMs on many other graph tasks including node degree, edge count, and cycle check [48, 18, 20]. ", "page_idx": 4}, {"type": "text", "text": "LLMs may tend to forget, rather than hallucinate edges. The “edge” column shows an interesting result that LLMs generally recall fewer edges than the ground truth. This crucially tells us that LLM’s bias in other microstructural patterns may more likely be the consequence of selective forgetting, rather than hallucination. ", "page_idx": 4}, {"type": "text", "text": "An LLM’s microstructural bias is relatively robust. For each model, the colors in each column are relatively consistent. This means that an LLM may have have some relatively persistent bias in its microstructual patterns, which does not change significantly across different application domains. This is a positive indicator of the generalizability of our findings above. ", "page_idx": 4}, {"type": "text", "text": "3.3 LLMs Compared with Humans in Graph Recall ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "Brashears et al. reported experimental results of social network recall on a total of 301 humans [8]. Here we report how we build upon this existing result to compare LLMs’ and humans’ behaviors in the social network recall test. ", "page_idx": 4}, {"type": "text", "text": "To stay aligned with Brashears’ settings, we use their dataset which consists of two 15-node social networks: an irreducible one which contains no cliques, and a reducible one which contains multiple cliques. Appendix B introduces more details. Table 2 shows the comparison results. ", "page_idx": 4}, {"type": "text", "text": "Regarding the types of bias (forgetting vs. hallucination), LLMs are relatively consistent with humans. Both LLMs and humans tend to forget edges and alt-triangles while “hallucinating” ", "page_idx": 4}, {"type": "text", "text": "triangles and stars. This interesting finding may reveal that LLMs have some information decoding and recall mechanisms similar to human memory. ", "page_idx": 5}, {"type": "text", "text": "Regarding the strength of the bias, LLMs tend to have weaker forgetting but stronger hallucinations than humans. On microstructures such as edges and alt-triangles, LLMs tend to have a weaker forgetting pattern, while on some prominently increasing microstructures (e.g., triangles), LLMs tend to demonstrate strong hallucinating patterns. These findings suggest that while LLMs may have a distinct advantage than humans in retaining certain graph structures in their memory, they may still struggle with accurately recalling, potentially limiting their ability to perform complex or critical graph tasks. ", "page_idx": 5}, {"type": "text", "text": "Table 2: LLMs vs. Humans: microstructural patterns and performance of graph recall, conducted on the two social networks used in [8]. Numbers on the “humans” row were taken from Brashears’ paper and postprocessed by us. ∗not reported in Brashears’ paper. ", "page_idx": 5}, {"type": "table", "img_path": "tNhwg9U767/tmp/f6dd35f3c4d820b50eaa737beee12c80580dc1f85e8c5d516f6c47cddd06f927.jpg", "table_caption": [], "table_footnote": [], "page_idx": 5}, {"type": "text", "text": "4 What Affects LLM’s Graph Recall? ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "It is a natural question to ask about factors that can affect an LLM’s performance in the graph recall task. Many existing works have investigated graph properties and prompting methods as two key variants affecting LLM’s performance in graph reasoning tasks [48, 14]. Here we focus on several interesting factors that are less explored but still play a crucial role in graph recall: narrative style, strength of memory clearance, and sex priming (Appendix D). ", "page_idx": 5}, {"type": "text", "text": "4.1 Narrative Style ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "Motivation. The effect of narrative styles on several graph reasoning abilities has been studied by [18] with synthetic random graphs. Here we will present an interesting finding on real-world graphs, and by novelly cross-evaluating narrative styles and real-world domains. ", "page_idx": 5}, {"type": "text", "text": "The key idea is the following: it is known that graphs sampled from different domains have different distributions of topology, e.g. road networks are usually star-shaped, whereas social networks usually have more triangles [45]. Meanwhile, each domain has its own style of narration: for describing road networks geographical locations and names are often used, while for describing social networks names and personal relationships are used more often. Our experiment thus far has always used for each dataset the matched narrative with its domain. Therefore, an interesting question is whether LLM would perform best in graph recall only if the narrative style of the graphs matches the domain. ", "page_idx": 5}, {"type": "text", "text": "To this end, we conduct cross-evaluation over the five different application domains and their corresponding narrative styles as introduced in Sec.3.1. More concretely, for graphs from each domain, we describe it in five different ways, corresponding to the five different domains. The resulting performance is visualized as heatmaps in Fig.3 (a) - (c). Appendix E provides the full table. ", "page_idx": 5}, {"type": "text", "text": "Result Analysis. The heatmaps of GPT-4 and GPT-3.5 support our conjecture: the diagonals (corresponding to a matching between narrative style and the domain of the data) tend to have higher performance. Such an effect seems to be more prominent with better-performing models. ", "page_idx": 5}, {"type": "text", "text": "We find this result striking, that the LLM should do better when the graph is described in the narrative language of the domain that it comes from. While it is an intuitively sensible conjecture that this might help, it is very interesting that this conjecture is borne out so clearly in the results. ", "page_idx": 5}, {"type": "image", "img_path": "tNhwg9U767/tmp/9417b105fb059ce6f41878e4de8ae1bbbcb9f8e2b7ee3a03496a7bce2ff01857.jpg", "img_caption": ["Figure 3: Different factors that influence LLM’s graph recall. (a) - (c): narrative styles. The heatmaps show that more advanced LLMs like GPT-4 yield best recall accuracy when the graph is narrated in a language style consistent with its original domain. (d) - (f): memory clearance. Gemini-Pro appears more sensitive to small noise in context, while GPT’s are more robust. "], "img_footnote": [], "page_idx": 6}, {"type": "image", "img_path": "tNhwg9U767/tmp/b0524f6a034bac99dfd5ca3c392f60377282db77bd7a8ec56764aac53d243f22.jpg", "img_caption": ["Figure 4: Correlation between GPT-3.5’s performance at graph recall $(y)$ and link prediction $(x)$ . "], "img_footnote": [], "page_idx": 6}, {"type": "text", "text": "Given this, it is natural to ask whether the result might be coming from the mechanics of the training; in particular, is it possible that the LLM is just reciting text from its training corpus, since the five datasets we use are all public on the Internet? We find this very unlikely, for a simple reason: while the structured graph data comes from the Internet, the narrative descriptions do not; they were generated by us from a simple template for purposes of this experiment, as explained in Sec.3.1. ", "page_idx": 6}, {"type": "text", "text": "Since superficial explanations do not seem to explain the strength of the results, it becomes reasonable to suppose that the narrative style is indeed helping with the graph recall task. There are natural, if subtle, reasons why this may indeed be the case: since organically produced text describing road networks, for example, refers a different distribution over graph structures than organically produced text describing social networks, it is a plausible mechanism that recall is helped when the distributional properties in the text align with the distributional properties of the graph that the text describes. An implication is thus that LLMs, especially GPT-4, may have indeed formed a good understanding of the different distributions of graph structures from different domains, as otherwise they wouldn’t be able to so consistently perform better when the narrative matches the data domain. ", "page_idx": 6}, {"type": "text", "text": "4.2 Strength of Memory Clearance ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "Motivation. Our next experiment contains memory clearance (word span test) which is a standard component in previous human graph recall tests. We use memory clearance both to align with these human tests and to simulate the real-world situation where an LLM may not be asked to work on the key data immediately after it receives them. ", "page_idx": 6}, {"type": "table", "img_path": "tNhwg9U767/tmp/a270ca5374920e0cc306742c02a5d04eb9319d48f76dbb6c99e78ef019bcb714.jpg", "table_caption": ["Table 3: Correlation between LLM’s graph recall and link prediction on different microstructures. "], "table_footnote": [], "page_idx": 7}, {"type": "text", "text": "Since both GPT and Gemini are able to perform $100\\%$ correctly in the word span test, by design principle we always need to progress to the maximum set of seven sentences. This makes the memory clearance a significant source of noisy context between LLM’s first sight of the graph and the final prompt of the recall question. Therefore, it is natural to wonder if the relatively poor performance of LLMs in this graph recall test could have resulted from too much noisy context. In this mini-study, we investigate how different strengths of memory clearance measured would affect the performance. ", "page_idx": 7}, {"type": "text", "text": "The strength of memory clearance can be naturally measured by the maximum number of sentences of which the subject proceeds to recite the final words. The number in the standard word span test ranges from 2 to 7, and 0 if the test is dropped. Therefore, we vary this number in our experiment and record the performance of each model on each dataset. ", "page_idx": 7}, {"type": "text", "text": "Result Analysis. The results are shown in Figure 3 (d) - (f), and we have the following findings. ", "page_idx": 7}, {"type": "text", "text": "LLMs can significantly differ on their sensitivity to small amount of noise in graph recall. The trends are clear from the three line plots: Gemini-Pro’s performance plunges in the first few clearance levels before it touches the bottom. GPT’s performance, in contrast, remain more stable, or even increases at initial clearance levels. This indicates that many of our results for GPT models may still likely hold when there is no memory clearance, i.e. prompt is given immediately after relevant context – which is default setting of most previous studies. ", "page_idx": 7}, {"type": "text", "text": "Performance of GPT-3.5’s and Gemini-pro’s is poor even when the question prompt is provided immediately after the relevant context. This is obvious from the line plots’ intersections with y-axis, and perhaps a bit surprising to people who have primarily focused on using LLMs for more challenging graph tasks. This result also helps eliminate the chance that the mediocre performance comes from overly strong memory clearance module that we’ve installed in place. To boost LLM’s ability to reason on graphs, we may need to first figure out how to help them better attend to the correct edge before we seek to improve other more advanced aspects of reasoning. See Sec. 6 for more discussion. ", "page_idx": 7}, {"type": "text", "text": "5 Correlation between LLM’s Graph Recall and Link Prediction ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "Motivation. The graph recall task should not be confused with How do microstructures and performance of LLM’s graph recall affect its behavior in other graph reasoning tasks? In this mini-study, we conduct a correlation analysis of LLM’s behavior in the label-free link prediction task, which is an important graph reasoning task for LLMs [24]. We primarily experiment with GPT-3.5 because its graph recall exhibits more significant microstructural patterns than GPT-4, and meanwhile have larger performance variation than Gemini-Pro. ", "page_idx": 7}, {"type": "text", "text": "Procedures. For each graph in the five datasets, we remove $20\\%$ of their edges as missing edges. The LLM is then asked to predict those missing edges. Two types of correlation are studied: (1) accuracy correlation: for each graph in the dataset, we evaluate the LLM’s link prediction accuracy $(x)$ and graph recall accuracy $(y)$ then map these results onto a scatter plot; (2) microstructural correlation: similar to Table 1 and 2, we evaluate and compare the microstructural coefficients of the predicted graph (in link prediction) and the recalled graph (in graph recall test). Table 3 shows the results. ", "page_idx": 7}, {"type": "text", "text": "", "page_idx": 8}, {"type": "text", "text": "5.1 Result Analysis. ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "Figure 4 shows the scatter plots for accuracy correlation; Table 3 shows microstructural correlation. ", "page_idx": 8}, {"type": "text", "text": "LLM’s link prediction performance correlates well with its graph recall performance on realworld graphs. This is clear from the scatter plot and the $r$ values. For Erd˝os–Rényi graphs, the correlation is close to zero, which is unsurprising though because the link prediction on random graphs cannot do better than random guess. ", "page_idx": 8}, {"type": "text", "text": "Different tasks may trigger behavior changes of LLMs that can be subtly revealed by their microstructural bias. Table 3 shows that LLM’s microstructural bias in both tasks tend to be positively correlated on triangles and alt-2-paths, and negatively correlated on alt-triangles. We do not have an intuitive explanation for this result. However, this result does indicate that different tasks can trigger certain interesting behavior changes of LLMs that can be subtly revealed by examining their microstructure patterns, which shows the meaningfulness of our study. ", "page_idx": 8}, {"type": "text", "text": "6 What to Inform about Future Research: an Empirical Perspective ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "We consider this study as a step towards the long-term agendas both for improving LLM’s graph reasoning ability and for further integrating LLM graph analysis into social-science applications. Here we discuss how our findings may translate into actionable bias mitigation strategies and architectural improvements. Appendix F further discusses limitations of the work. ", "page_idx": 8}, {"type": "text", "text": "• The graph recall test is one of the simplest and most fundamental graph reasoning tasks. Since advanced LLMs yield unsatisfactory performance in this test, we need to re-examine the recent development of approaches that attempt to directly solve more challenging graph reasoning tasks. Meanwhile, notice the association between graph recall test and the “Needle in a Haystack” test (i.e. random fact retrieval from long context) [26, 19]: in some sense, the former can viewed as a “graph-customized” version of the latter. Therefore, existing techniques for boosting LLM’s performance in the “Needle in a Haystack” test, e.g. recurrent memory augmentations [26], may likely benefit LLM’s graph recall ability as well.   \n• Our experiment shows that LLMs tend to favor more triangles and alternating 2-paths. Researchers of Graph Foundation Models (GFM) [31, 33, 59, 29] should be alerted of such systematic bias. Because the procedures for training GFMs are largely inspired by those for LLMs, similar retrieval bias could emerge. A potential mitigation strategy worthy of exploration is to consider balancing/compensating the frequencies of different graph motifs that occur in the training data.   \n• We have also found that more advanced LLM’s performance have a striking dependence on the compatibility between the application domain of a real-world graph and its narrative style. This hints a potential direction for designing more powerful graph encoding for LLMs via certain domain adaptation strategies – by combining the adaptation strategy with either the graph-to-text methods [18, 20] or the graph-to-embedding methods [12, 37, 13]. ", "page_idx": 8}, {"type": "text", "text": "7 Related Work ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "7.1 Humans in the Graph Recall Task ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "There have been decades of work studying human’s graph recall ability, primarily focused on their memory and recall of social networks. This line of work originates from sociologist’s need to collect real-world social networks by asking people to recall their social relationships. [40] noticed that people forget a significant portion of their social networks, so they built a to predict missing links from recall. [9] more closely study the mechanism of the forgetting of social networks. [5] found that humans can more accurately recall social networks that contain more certain microstructural patterns such as triangles or cliques. ", "page_idx": 8}, {"type": "text", "text": "Following the previous works, [8] establishes experimental protocols for examining the performance and microstructural patterns of human’s recall of social networks. In their study, each subject reads a short, artificial description of the relationships among a number of 15 people: “Henry is a member of the same club as Elizabeth. James sings in a choir with Anne ...”. The subject is then asked to name who has interacted with whom in the experiment. The authors are also among the first to verify that humans’ graph recall tend to exhibit patterns of triadic closure. [7] further investigates how sex affects human’s recall. [6] uses a signed network model to show that human’s graph recall may repel certain unstable patterns that involve unbalanced relationships between enemies and friends. Since LLMs are trained on human-readable corpus, many ideas and findings on human’s graph recall are instructional to our exploration of LLM’s graph reasoning ability. Further studies show that a person’s ability to accurately recall a social network has profound influence on their social decisions [25, 11, 52, 53, 54]. ", "page_idx": 9}, {"type": "text", "text": "The graph recall test is a meaningful test for both humans and LLMs, though their experiment outcomes may need to be interpreted in a subtly different way. The graph recall test is meaningful for LLMs because we observe their performance to be far from perfect in the test. Compared with humans, however, LLMs may face different challenges. Human’s bottleneck in this test is their limited brain capacity, while LLMs may have difficulty in always attending to the correct positions in distant earlier context (or in precisely encoding context into hidden states for RNN-based models). ", "page_idx": 9}, {"type": "text", "text": "7.2 Graph Reasoning with Large Language Models ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "Graph reasoning with LLMs is an active research area in recent years. On the benchmark and methodology level, datasets and frameworks are developed to integrate graphs with LLMs [49, 36]. In addition, researchers are exploring ways to solve question answers over structured data with LLMs in a unified way [23]. Others are also trying to advance the prompting capabilities of LLMs by mimicking the connective manner of human thinking or elaboration[4]. There has also been work on developing general graph models to handle various graph tasks with a unified framework [30]. More recently, [43] provides theoretical analysis on the limit of transformer’s reasoning capability on graphs, by relating transformer’s capabilities on graph reasoning to the computational complexity of related tasks. On the application level, LLMs have been adopted in graph reasoning applications such as node classification [21, 14], graph classification [38, 60], knowledge graphs [58, 56], and recommendation systems [55]. We are still lacking a data perspective to address the basic question of whether LLMs can accurately remember the graph that they are supposed to reason upon, which is a prerequisite for any advanced graph tasks. Inspired and supported by cognitive studies, we conduct the first comprehensive investigation of graph recall by LLMs, fliling a gap in the existing literature. ", "page_idx": 9}, {"type": "text", "text": "8 Conclusion ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "This work proposes and studies graph recall as a simple yet fundamental task for understanding LLM’s graph reasoning abilities. We design and conduct systematical studies on the accuracy and biased microstructures of LLM’s graph recall, by creatively drawing its connection with the existing cognitive studies on humans. Future work may examine more varieties of microstructural patterns including higher-order structures [51] and “sense of distance”, both of which which are crucial for understanding graph structures [28, 50, 57]. Another direction is to study how to improve LLM’s graph recall by prompting or other methods. ", "page_idx": 9}, {"type": "text", "text": "Acknowledgment ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "We thank Matt Brashears, Eric Quintane for their help in discussing their earlier work on network recall and its relation to the current project, as well as their help with data relevant to their work. We also thank Tianxiang Zhao for his insights into the intersection of graphs and LLMs. Their generous assistance was a great benefti to our project. Our work here has been supported in part by a Vannevar Bush Faculty Fellowship, AFOSR grant FA9550-19-1-0183, a Simons Collaboration grant, a grant from the MacArthur Foundation, and a grant from the Microsoft AFMR program. ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 10}, {"type": "text", "text": "[1] Josh Achiam, Steven Adler, Sandhini Agarwal, Lama Ahmad, Ilge Akkaya, Florencia Leoni Aleman, Diogo Almeida, Janko Altenschmidt, Sam Altman, Shyamal Anadkat, et al. Gpt-4 technical report. arXiv preprint arXiv:2303.08774, 2023.   \n[2] Uri Alon. Network motifs: theory and experimental approaches. Nature Reviews Genetics, 8(6):450–461, 2007.   \n[3] Jacob Andreas. Language models as agent models. In Findings of the Association for Computational Linguistics: EMNLP 2022, pages 5769–5779, 2022.   \n[4] Maciej Besta, Nils Blach, Ales Kubicek, Robert Gerstenberger, Lukas Gianinazzi, Joanna Gajda, Tomasz Lehmann, Michal Podstawski, Hubert Niewiadomski, Piotr Nyczyk, and Torsten Hoefler. Graph of thoughts: Solving elaborate problems with large language models. In AAAI, 2024.   \n[5] Matthew E Brashears. Humans use compression heuristics to improve the recall of social networks. Scientific reports, 3(1):1513, 2013.   \n[6] Matthew E Brashears and Laura Aufderheide Brashears. The enemy of my friend is easy to remember: Balance as a compression heuristic. In Advances in group processes, volume 33, pages 1–31. Emerald Group Publishing Limited, 2016.   \n[7] Matthew E Brashears, Emily Hoagland, and Eric Quintane. Sex and network recall accuracy. Social Networks, 44:74–84, 2016.   \n[8] Matthew E Brashears and Eric Quintane. The microstructures of network recall: How social networks are encoded and represented in human memory. Social Networks, 41:113–126, 2015.   \n[9] Devon D Brewer. Forgetting in the recall-based elicitation of personal and social networks. Social networks, 22(1):29–43, 2000.   \n[10] Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared D Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, et al. Language models are few-shot learners. Advances in neural information processing systems, 33:1877–1901, 2020.   \n[11] Ronald S Burt, Joseph E Jannotta, and James T Mahoney. Personality correlates of structural holes. Social networks, 20(1):63–87, 1998.   \n[12] Ziwei Chai, Tianjie Zhang, Liang Wu, Kaiqiao Han, Xiaohai Hu, Xuanwen Huang, and Yang Yang. Graphllm: Boosting graph reasoning ability of large language model. arXiv preprint arXiv:2310.05845, 2023.   \n[13] Runjin Chen, Tong Zhao, AJAY KUMAR JAISWAL, Neil Shah, and Zhangyang Wang. Llaga: Large language and graph assistant. In Forty-first International Conference on Machine Learning, 2024.   \n[14] Zhikai Chen, Haitao Mao, Hongzhi Wen, Haoyu Han, Wei Jin, Haiyang Zhang, Hui Liu, and Jiliang Tang. Label-free node classification on graphs with large language models (llms). ICLR, 2024.   \n[15] Antonia Creswell, Murray Shanahan, and Irina Higgins. Selection-inference: Exploiting large language models for interpretable logical reasoning. In The Eleventh International Conference on Learning Representations, 2022.   \n[16] David Croft, Gavin O’kelly, Guanming Wu, Robin Haw, Marc Gillespie, Lisa Matthews, Michael Caudy, Phani Garapati, Gopal Gopinath, Bijay Jassal, et al. Reactome: a database of reactions, pathways and biological processes. Nucleic acids research, 39(suppl_1):D691–D697, 2010.   \n[17] Meredyth Daneman and Patricia A Carpenter. Individual differences in working memory and reading. Journal of verbal learning and verbal behavior, 19(4):450–466, 1980.   \n[18] Bahare Fatemi, Jonathan Halcrow, and Bryan Perozzi. Talk like a graph: Encoding graphs for large language models. arXiv preprint arXiv:2310.04560, 2023.   \n[19] gkamradt. Llmtest needle in a haystack - pressure testing llms. https://github.com/ gkamradt/LLMTest_NeedleInAHaystack, 2023.   \n[20] Jiayan Guo, Lun Du, and Hengyu Liu. Gpt4graph: Can large language models understand graph structured data? an empirical evaluation and benchmarking. arXiv preprint arXiv:2305.15066, 2023.   \n[21] Xiaoxin He, Xavier Bresson, Thomas Laurent, and Bryan Hooi. Explanations as features: Llm-based features for text-attributed graphs. ICLR, 2024.   \n[22] Herminia Ibarra. Homophily and differential returns: Sex differences in network structure and access in an advertising firm. Administrative science quarterly, pages 422–447, 1992.   \n[23] Jinhao Jiang, Kun Zhou, Zican Dong, Keming Ye, Xin Zhao, and Ji-Rong Wen. Structgpt: A general framework for large language model to reason over structured data. In Houda Bouamor, Juan Pino, and Kalika Bali, editors, EMNLP, 2023.   \n[24] Bowen Jin, Gang Liu, Chi Han, Meng Jiang, Heng Ji, and Jiawei Han. Large language models on graphs: A comprehensive survey. arXiv preprint arXiv:2312.02783, 2023.   \n[25] Martin Kilduff and David Krackhardt. Interpersonal networks in organizations: Cognition, personality, dynamics, and culture, volume 30. Cambridge University Press, 2008.   \n[26] Yuri Kuratov, Aydar Bulatov, Petr Anokhin, Dmitry Sorokin, Artyom Sorokin, and Mikhail Burtsev. In search of needles in a 10m haystack: Recurrent memory finds what llms miss. arXiv preprint arXiv:2402.10790, 2024.   \n[27] Jure Leskovec and Julian Mcauley. Learning to discover social circles in ego networks. Advances in neural information processing systems, 25, 2012.   \n[28] Pan Li, Yanbang Wang, Hongwei Wang, and Jure Leskovec. Distance encoding: Design provably more powerful neural networks for graph representation learning. Advances in Neural Information Processing Systems, 33:4465–4478, 2020.   \n[29] Hao Liu, Jiarui Feng, Lecheng Kong, Ningyue Liang, Dacheng Tao, Yixin Chen, and Muhan Zhang. One for all: Towards training one graph model for all classification tasks. arXiv preprint arXiv:2310.00149, 2023.   \n[30] Hao Liu, Jiarui Feng, Lecheng Kong, Ningyue Liang, Dacheng Tao, Yixin Chen, and Muhan Zhang. One for all: Towards training one graph model for all classification tasks. In ICLR, 2024.   \n[31] Jiawei Liu, Cheng Yang, Zhiyuan Lu, Junze Chen, Yibo Li, Mengmei Zhang, Ting Bai, Yuan Fang, Lichao Sun, Philip S Yu, et al. Towards graph foundation models: A survey and beyond. arXiv preprint arXiv:2310.11829, 2023.   \n[32] Aman Madaan, Shuyan Zhou, Uri Alon, Yiming Yang, and Graham Neubig. Language models of code are few-shot commonsense learners. In Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing, pages 1384–1403, 2022.   \n[33] Haitao Mao, Zhikai Chen, Wenzhuo Tang, Jianan Zhao, Yao Ma, Tong Zhao, Neil Shah, Michael Galkin, and Jiliang Tang. Graph foundation models. arXiv preprint arXiv:2402.02216, 2024.   \n[34] Ron Milo, Shai Shen-Orr, Shalev Itzkovitz, Nadav Kashtan, Dmitri Chklovskii, and Uri Alon. Network motifs: simple building blocks of complex networks. Science, 298(5594):824–827, 2002.   \n[35] Elisa Omodei, Matthew E Brashears, and Alex Arenas. A mechanistic model of human recall of social network structure and relationship affect. Scientific reports, 7(1):17133, 2017.   \n[36] Shirui Pan, Yizhen Zheng, and Yixin Liu. Integrating graphs with large language models: Methods and prospects. IEEE Intelligent Systems, 2023.   \n[37] Bryan Perozzi, Bahare Fatemi, Dustin Zelle, Anton Tsitsulin, Mehran Kazemi, Rami Al-Rfou, and Jonathan Halcrow. Let your graph do the talking: Encoding structured data for llms. arXiv preprint arXiv:2402.05862, 2024.   \n[38] Chen Qian, Huayi Tang, Zhirui Yang, Hong Liang, and Yong Liu. Can large language models empower molecular property prediction? arXiv preprint arXiv:2307.07443, 2023.   \n[39] Garry Robins, Pip Pattison, Yuval Kalish, and Dean Lusher. An introduction to exponential random graph $({\\mathfrak{p}}^{*})$ models for social networks. Social networks, 29(2):173–191, 2007.   \n[40] A Kimball Romney and Katherine Faust. Predicting the structure of a communications network from recalled data. Social Networks, 4(4):285–304, 1982.   \n[41] Adam R Roth, Siyun Peng, Max E Coleman, Evan Finley, and Brea L Perry. Network recall among older adults with cognitive impairments. Social Networks, 64:99–108, 2021.   \n[42] David Rozado. The political preferences of llms. arXiv preprint arXiv:2402.01789, 2024.   \n[43] Clayton Sanford, Bahare Fatemi, Ethan Hall, Anton Tsitsulin, Mehran Kazemi, Jonathan Halcrow, Bryan Perozzi, and Vahab Mirrokni. Understanding transformer reasoning capabilities via graph algorithms. arXiv preprint arXiv:2405.18512, 2024.   \n[44] Brent Simpson, Barry Markovsky, and Mike Steketee. Power and the perception of social networks. Social Networks, 33(2):166–171, 2011.   \n[45] Stavros Sintos and Panayiotis Tsaparas. Using strong triadic closure to characterize ties in social networks. In Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining, pages 1466–1475, 2014.   \n[46] Gemini Team, Rohan Anil, Sebastian Borgeaud, Yonghui Wu, Jean-Baptiste Alayrac, Jiahui Yu, Radu Soricut, Johan Schalkwyk, Andrew M Dai, Anja Hauth, et al. Gemini: a family of highly capable multimodal models. arXiv preprint arXiv:2312.11805, 2023.   \n[47] Hugo Touvron, Louis Martin, Kevin Stone, Peter Albert, Amjad Almahairi, Yasmine Babaei, Nikolay Bashlykov, Soumya Batra, Prajjwal Bhargava, Shruti Bhosale, et al. Llama 2: Open foundation and fine-tuned chat models. arXiv preprint arXiv:2307.09288, 2023.   \n[48] Heng Wang, Shangbin Feng, Tianxing He, Zhaoxuan Tan, Xiaochuang Han, and Yulia Tsvetkov. Can language models solve graph problems in natural language? In Proceedings of the 2023 Conference on Neural Information Processing Systems, 2023.   \n[49] Heng Wang, Shangbin Feng, Tianxing He, Zhaoxuan Tan, Xiaochuang Han, and Yulia Tsvetkov. Can language models solve graph problems in natural language? In NeurIPS, 2023.   \n[50] Yanbang Wang, Yen-Yu Chang, Yunyu Liu, Jure Leskovec, and Pan Li. Inductive representation learning in temporal networks via causal anonymous walks. arXiv preprint arXiv:2101.05974, 2021.   \n[51] Yanbang Wang and Jon Kleinberg. From graphs to hypergraphs: Hypergraph projection and its reconstruction. In The Twelfth International Conference on Learning Representations, 2024.   \n[52] Yanbang Wang and Jon Kleinberg. On the relationship between relevance and confilct in online social link recommendations. Advances in Neural Information Processing Systems, 36, 2024.   \n[53] Yanbang Wang, Pan Li, Chongyang Bai, and Jure Leskovec. Tedic: Neural modeling of behavioral patterns in dynamic social interaction networks. In Proceedings of the Web Conference 2021, pages 693–705, 2021.   \n[54] Yanbang Wang, Pan Li, Chongyang Bai, V Subrahmanian, and Jure Leskovec. Generic representation learning for dynamic social interaction. In Proc. 26th ACM SIGKDD Int. Conf. Knowl. Discovery Data Mining Workshop, pages 1–9, 2020.   \n[55] Wei Wei, Xubin Ren, Jiabin Tang, Qinyong Wang, Lixin Su, Suqi Cheng, Junfeng Wang, Dawei Yin, and Chao Huang. Llmrec: Large language models with graph augmentation for recommendation. In WSDM, 2024.   \n[56] Yunzhi Yao, Shengyu Mao, Ningyu Zhang, Xiang Chen, Shumin Deng, Xi Chen, and Huajun Chen. Schema-aware reference as prompt improves data-efficient knowledge graph construction. In SIGIR, 2023.   \n[57] Haoteng Yin, Yanbang Wang, and Pan Li. Revisiting graph neural networks and distance encoding from a practical view. arXiv preprint arXiv:2011.12228, 2020.   \n[58] Rui Zhang, Yixin Su, Bayu Distiawan Trisedya, Xiaoyan Zhao, Min Yang, Hong Cheng, and Jianzhong Qi. Autoalign: Fully automatic and effective knowledge graph alignment enabled by large language models. IEEE Transactions on Knowledge and Data Engineering, 2023.   \n[59] Ziwei Zhang, Haoyang Li, Zeyang Zhang, Yijian Qin, Xin Wang, and Wenwu Zhu. Large graph models: A perspective. arXiv preprint arXiv:2308.14522, 2023.   \n[60] Haiteng Zhao, Shengchao Liu, Chang Ma, Hannan Xu, Jie Fu, Zhi-Hong Deng, Lingpeng Kong, and Qi Liu. Gimlet: A unified graph-text model for instruction-based molecule zero-shot learning. bioRxiv, 2023. ", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "Appendix ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "A Code and data ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "Our code and data can be downloaded at: https://github.com/Abel0828/llm-graph-recall. ", "page_idx": 13}, {"type": "text", "text": "B More Experimental Details ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "Dataset. For the experiment in Sec.3.1 and 3.2, Fig.5-7 show graph samples of the Facebook, Reactome, and Erdos-Renyi datasets. The graph narratives are shown in Appendix B.1. The sentence sets for memory clearance are shown in Appendix B.2.1. ", "page_idx": 13}, {"type": "text", "text": "For the experiment in Sec.3.3, we utilize the two social networks in [8]’s human experiment. Each social network was presented to the test taker in two different narrative styles: one is friendship-based, and the other is kinship-based e.g. “James is the brother of Anne...”. In Brashears’ experiment, a test taker has equal chance to see one of the two narrative style (but never both). The final result in their paper, however, was reported in an aggregated form that mixes up response to both narrative styles, as the authors reported to see no difference between caused by these two. To stay aligned we choose do the same with LLMs, but make a note that LLMs may behave differently to different graph narrative styles, which we have further investigated in a separate study, Sec.4.1. ", "page_idx": 13}, {"type": "text", "text": "We need to be careful with the generation of the node names, because it affects how much parametric knowledge in the LLM gets elicited to aid the graph recall process. We general guideline is that, although the parametric knowledge can potentially create a shortcut for LLM’s handling of the graph recall task, this should not be forcefully forbidden as it is also seen in real-world applications. Therefore, we have two cases when creating our datasets, namely (1) where parametric knowledge is potentially useful, and (2) where parametric knowledge is less useful. ", "page_idx": 13}, {"type": "text", "text": "• For protein networks, the protein names are not random. They are unique protein identifiers (known as the “UniProtKB/Swiss-Prot accession number” or NCBI index). Each node is assigned its real name. We also confirmed that LLMs know and precisely understand those protein identifiers. The same is true for DBLP coauthorship networks. • For all other networks, the node names are generated and randomly assigned. For example, in traffic (geographical) networks, the node names are “bank”, “townhall”, “high school”, etc. ", "page_idx": 13}, {"type": "text", "text": "Computing Resources. We use the Azure OpenAI service to test GPT-based models. For Gemini-Pro, we use the gemini-pro model API provided by Google’s Generative AI. For Llama Family models, we use the open-sourced models meta-llama/Llama-2-7b-hf and meta-llama/Llama-2-13b-hf on Hugging Face, tuned on two Quadro RTX 8000 GPUs with 48 GB of RAM. ", "page_idx": 13}, {"type": "image", "img_path": "tNhwg9U767/tmp/2d24f781557d48e173bb1ba15d41407875a9c4322b63627dc7056410e4ab5399.jpg", "img_caption": ["Figure 5: Graph samples of the Facebook dataset. "], "img_footnote": [], "page_idx": 14}, {"type": "image", "img_path": "tNhwg9U767/tmp/66df6c48bbcdd84d1fcef1270d26fbb6ff63c3b7e697b3451c86131bb37dce6d.jpg", "img_caption": ["Figure 6: Graph samples from the Reactome (protein-protein interaction) dataset. "], "img_footnote": [], "page_idx": 14}, {"type": "image", "img_path": "tNhwg9U767/tmp/adb155d7de0dc031c755eef2494b479dd48178341db016a75c4678d1cf022a64.jpg", "img_caption": ["Figure 7: Graph samples of the Erdos-Renyi dataset. "], "img_footnote": [], "page_idx": 15}, {"type": "image", "img_path": "tNhwg9U767/tmp/02bd9338695fe9f638077f3a5864dd9414fcbf685c1d5ef251475ed126d9efef.jpg", "img_caption": ["Figure 8: The two 15-node social networks with different connectivity patterns used in [8] and in our Sec. 3.3 experiment. "], "img_footnote": [], "page_idx": 15}, {"type": "text", "text": "B.1 Samples of the Graph Narratives for All Datasets ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "\\*\\*Facebook\\*\\* ", "page_idx": 16}, {"type": "text", "text": "\"The following people have friendship relations: Harper, James, Abigail, Noah, Alexander, Oliver, William, Charlotte, Sophia, Benjamin, Emily, Daniel, Ethan, Henry. Their have friendships: Harper and Daniel are friends. Harper and Sophia are friends. James and William are friends. James and Daniel are friends. James and Abigail are friends. James and Sophia are friends. James and Noah are friends. Abigail and Benjamin are friends. Abigail and Noah are friends. Abigail and Ethan are friends. Abigail and William are friends. Noah and Charlotte are friends. Noah and Benjamin are friends. Noah and Emily are friends. \" ", "page_idx": 16}, {"type": "text", "text": "\\*\\*Traffic Network\\*\\* ", "page_idx": 16}, {"type": "text", "text": "We have a traffic network that involves the following destinations: Bank, Town Hall, Grocery Store, High School. The traffic network is the following. The traffic can directly flow from the Bank to the Grocery Store. The traffic can directly flow from the Town Hall to the Grocery Store. The traffic can directly flow from the Grocery Store to the High School. ", "page_idx": 16}, {"type": "text", "text": "\\*\\*Protein Interaction\\*\\* ", "page_idx": 16}, {"type": "text", "text": "The following proteins have mutual interactions: Q13563, Q16280, P61006, O75385, Q9ULV0,   \nO75154, Q7L804, Q15907, Q96QF0, Q8IV77, P08100, P18085, Q14028, P98161, Q9ULH1,   \nQ9P2M4. Their interactions are: Protein Q13563 interacts with Protein P98161. Protein Q13563   \ninteracts with Protein P08100. Protein Q13563 interacts with Protein Q8IV77. Protein Q13563   \ninteracts with Protein Q16280. Protein Q13563 interacts with Protein Q14028. Protein Q13563   \ninteracts with Protein P18085. Protein Q13563 interacts with Protein Q9ULH1. Protein Q13563   \ninteracts with Protein O75154. Protein Q13563 interacts with Protein P61006. Protein Q13563   \ninteracts with Protein Q96QF0. Protein Q16280 interacts with Protein P98161. Protein Q16280   \ninteracts with Protein P08100. Protein Q16280 interacts with Protein Q8IV77. Protein Q16280   \ninteracts with Protein Q14028. Protein Q16280 interacts with Protein P18085. Protein Q16280   \ninteracts with Protein Q9ULH1. Protein Q16280 interacts with Protein O75154. Protein Q16280   \ninteracts with Protein P61006. Protein Q16280 interacts with Protein Q96QF0. Protein P61006   \ninteracts with Protein Q96QF0. Protein P61006 interacts with Protein P98161. Protein P61006   \ninteracts with Protein P08100. Protein P61006 interacts with Protein Q8IV77. Protein P61006   \ninteracts with Protein Q14028. Protein P61006 interacts with Protein Q9ULH1. Protein P61006   \ninteracts with Protein O75154. Protein O75385 interacts with Protein Q15907. Protein O75385   \ninteracts with Protein Q9P2M4. ", "page_idx": 16}, {"type": "text", "text": "\\*\\*Erdos-Renyi Graph\\*\\* ", "page_idx": 16}, {"type": "text", "text": "A graph has the following nodes: Node 0, Node 1, Node 2, Node 3, Node 4, Node 5, Node 6, Node 7, Node 8, Node 9, Node 10, Node 11, Node 12, Node 13, Node 14, Node 15, Node 16, and the following edges: Node 0 is connected with Node 1. Node 0 is connected with Node 2. Node 0 is connected with Node 3. Node 0 is connected with Node 4. Node 0 is connected with Node 6. Node 0 is connected with Node 7. Node 0 is connected with Node 8. Node 0 is connected with Node 10. Node 0 is connected with Node 11. Node 0 is connected with Node 12. Node 0 is connected with Node 13. Node 0 is connected with Node 14. Node 1 is connected with Node 4. Node 1 is connected with Node 5. Node 1 is connected with Node 7. Node 1 is connected with Node 8. Node 1 is connected with Node 9. Node 1 is connected with Node 10. Node 1 is connected with Node 11. Node 1 is connected with Node 14. Node 1 is connected with Node 16. Node 2 is connected with Node 4. Node 2 is connected with Node 5. Node 2 is connected with Node 6. Node 2 is connected with Node 7. Node 2 is connected with Node 9. Node 2 is connected with Node 10. Node 2 is connected with Node 11. Node 2 is connected with Node 13. Node 2 is connected with Node 14. Node 2 is connected with Node 16. ", "page_idx": 16}, {"type": "text", "text": "B.2 Textual Samples Used in Experiment ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "B.2.1 Sentence Sets for Memory Clearance ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "\\*\\*Two sentence sets\\*\\*   \n“The ghillie suit, the modern sniper’s principle camouflage uniform, derives its name from   \nScottish game hunters.”   \n“Industrial accidents- explosions of stored oil and gas- are bad enough on land.”   \n\\*\\*Three sentence sets\\*\\*   \n“But overall, the teenage share of the population wasn’t getting much bigger.”   \n“This is a system steeped in tradition, and I think that’s part of the problem.”   \n“We’re unable to move, our legs stuck beneath us as under a great weight.”   \n\\*\\*Seven Sentence Set\\*\\*   \n“One afternoon I open a letter from my younger sister, the photo chronicler of family events.”   \n“Although they have enough food to sustain your group for years, supermarkets are also danger  \nous.”   \n“Maternity, or additional offspring, may force upon the woman a distressful life and future.”   \n“By Wednesday night’s vote meeting, Sabrina was thoroughly disgusted by the superficiality of   \nthe week.”   \n“I ask him to please stop lying about trying to take my place in the war.”   \n“Since the 1950’s, freeways have been built through every large and medium-sized city.”   \n“Instead, he took a job in Washington, analyzing weapons expenditures for the U.S. Navy.” ", "page_idx": 17}, {"type": "text", "text": "C Full Comparison of True Graph and LLM Recall Graph ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "We provide a full comparison of the true graph and the recall graph from different LLMs. The results are shown in Table 4, Table 5, and Table 6, respectively. ", "page_idx": 18}, {"type": "table", "img_path": "tNhwg9U767/tmp/cadba63dc28ea053c15dea77624d8bc40e9c5f0bee176bad137f9d3b4b2a3e3d.jpg", "table_caption": ["Table 4: Full comparison of true graph and GPT3.5 recall graph on different microstructures. "], "table_footnote": [], "page_idx": 18}, {"type": "table", "img_path": "tNhwg9U767/tmp/d24a2188772186f98d601756aac8de672e47839e5bb3271fdec3dc0dad607fe2.jpg", "table_caption": ["Table 5: Full comparison of true graph and GPT-4 recall graph on different microstructures. "], "table_footnote": [], "page_idx": 18}, {"type": "table", "img_path": "tNhwg9U767/tmp/5a3af449a5aa7b83ddac01f24b8d93f5080b4a7149d8ab754d65f6f2cff9201a.jpg", "table_caption": ["Table 6: Full comparison of true graph and Gemini-Pro recall graph on different microstructures. "], "table_footnote": [], "page_idx": 18}, {"type": "text", "text": "D Sex Priming as a Mini-study ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Motivation. [7] interestingly found that females can more accurately recall their social networks than males. The underlying explanation is that underrepresented groups tend to be more aware of their surroundings. We conjecture that this trend might also exist in the corpus on which LLMs are trained, and therefore wonder whether LLMs perform better at graph recall when asked to play the role of a female. ", "page_idx": 19}, {"type": "text", "text": "Procedures. Aligned with [7]’s design, we include at the beginning of the test (i.e. prior to all steps) a sex prime, which is a piece of text designed to elicit the test subject’s awareness of their sex. [7]’s sex prime is a short question that asks the subject’s opinion on same-sex versus mixed-sex housing. However, this method fails with LLMs because they refuse to identify as having any pre-given sex. Instead, we send role-playing instructions to LLMs by stating their “sex” in the system message at the beginning of the chat. We further confirm the successful elicitation by asking what their sex is afterwards. We compare the LLM’s graph recall performance under male and female roles. ", "page_idx": 19}, {"type": "text", "text": "Result Analysis. The results are shown in Fig.9 (g) - (i). The error bars are $95\\%$ confidence intervals. The effect of sex roles appear to be insignificant in most cases, which negates our initial conjecture and interestingly opposes the existing findings on humans. In fact, LLMs underperform in both roles when compared with the control group, i.e. cross-referencing Table 1 “Accuracy” column. ", "page_idx": 19}, {"type": "image", "img_path": "tNhwg9U767/tmp/3fdd95a82eb3c90bcd681ad738884e63645cef6dfb545f60ea83f5cb16de8a28.jpg", "img_caption": [], "img_footnote": [], "page_idx": 19}, {"type": "text", "text": "Figure 9: Different factors that influence LLM’s graph recall. (g) - (i): sex. Following [7]’s procedures, we test and find that the effect of sex roles that an LLM is asked to play is insignificant on their capability of graph recall — a result different from that on humans. ", "page_idx": 19}, {"type": "text", "text": "E Full Performance Metrics with Different Narrative Styles ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "The full performance comparison of different narrative styles on five datasets for each LLM is present in Table 7. ", "page_idx": 20}, {"type": "table", "img_path": "tNhwg9U767/tmp/706805cf038d2269baaf9bacc3638b00b3703415db1bbc36b5aa732876dac32f.jpg", "table_caption": ["Table 7: Full graph recall performance metrics with different narrative styles on five datasets. "], "table_footnote": [], "page_idx": 20}, {"type": "text", "text": "F Limitations ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Our evaluation of LLM’s graph recall performance is not exhaustive. Due to budget constraint, we only test on datasets from five domains and on a limited number of graph samples from each domain. Also, while we have experimented with several main-stream LLMs including GPT-3.5, GPT-4, Gemini-Pro, and Llama-2, there are other popular LLMs such as Claude 3 and Llama-3 which our experiment have not covered. ", "page_idx": 20}, {"type": "text", "text": "Another limitation of our work, which we also consider to be an important direction for future work, lies in the distinction between graph recall and graph retrieval. The latter requires a more variational setting on the amount of contextual noise in graph narratives. In our work, we have intentionally designed the graph narratives to be simple and fixed, because we already observed considerable errors in LLM’s graph recall at this starting point (and we know little about LLM’s behaviors even in this simplest setting). However, the real-world structure-rich text that LLMs process may contain significantly more contextual noise, where some of the findings in this work may not be easily generalizable (although we conjecture that many systematic bias we have observed will persist). How to both realistically and comprehensively vary the amount of noise in graphs narratives remains to be a challenging topic to explore. ", "page_idx": 20}, {"type": "text", "text": "Finally, despite being small, the gap between our result and the recent “Needles in a Haystack” by Greg Kamradt [19] on GPT-4 needs more investigation. In [19], it is reported that GPT-4 makes little errors in long-context recall over Paul Graham essays, up to the context length of $73\\mathrm{k}$ . While our study also shows (in Table 1) that GPT-4 performs well on three out of the five datasets used, its performance on the rest two is mediocre. There can be many possible explanations to reconcile the gap, but the lack of robustness that we observe in tests of this kind is an important starting point for further investigation. ", "page_idx": 20}, {"type": "text", "text": "G Relationship with the “Edge Existence” Task in (Fatemi et al.) [18] ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "The edge existence task is one of the six exemplary tasks proposed in [18] for measuring LLM’s graph reasoning ability. Both our graph recall test and the edge existence task require the LLM to decide the existence of graph edges described in earlier text. However, our work has the following main differences and novelty. ", "page_idx": 20}, {"type": "text", "text": "", "page_idx": 21}, {"type": "text", "text": "• The main topics of investigation are different. The central topics in this paper are 1) to unveil biased subgraph patterns (motifs) in LLM’s graph recall, (2) to rigorously compare LLM’s performance with humans, and (3) to investigate how results of (1) are affected by various factors. These topics are not studied in [18].   \n• The empirical findings are completely non-overlapped. Our work presents many findings about LLM’s biased graph recall patterns and their rigorous comparison with humans, which are novel to [18].   \n• Our experimental pipelines are different. Our paper uses a more rigorous evaluation pipeline inspired by classical human cognition studies. In addition to synthetic data, we also extensively use real-world datasets for experiment, which was not reported [18]. ", "page_idx": 21}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "The checklist is designed to encourage best practices for responsible machine learning research, addressing issues of reproducibility, transparency, research ethics, and societal impact. Do not remove the checklist: The papers not including the checklist will be desk rejected. The checklist should follow the references and follow the (optional) supplemental material. The checklist does NOT count towards the page limit. ", "page_idx": 22}, {"type": "text", "text": "Please read the checklist guidelines carefully for information on how to answer these questions. For each question in the checklist: ", "page_idx": 22}, {"type": "text", "text": "• You should answer [Yes] , [No] , or [NA] .   \n• [NA] means either that the question is Not Applicable for that particular paper or the relevant information is Not Available.   \n• Please provide a short (1–2 sentence) justification right after your answer (even for NA). ", "page_idx": 22}, {"type": "text", "text": "The checklist answers are an integral part of your paper submission. They are visible to the reviewers, area chairs, senior area chairs, and ethics reviewers. You will be asked to also include it (after eventual revisions) with the final version of your paper, and its final version will be published with the paper. ", "page_idx": 22}, {"type": "text", "text": "The reviewers of your paper will be asked to use the checklist as one of the factors in their evaluation. While \"[Yes] \" is generally preferable to \"[No] \", it is perfectly acceptable to answer \"[No] \" provided a proper justification is given (e.g., \"error bars are not reported because it would be too computationally expensive\" or \"we were unable to find the license for the dataset we used\"). In general, answering \"[No] \" or \"[NA] \" is not grounds for rejection. While the questions are phrased in a binary way, we acknowledge that the true answer is often more nuanced, so please just use your best judgment and write a justification to elaborate. All supporting evidence can appear either in the main paper or the supplemental material, provided in appendix. If you answer [Yes] to a question, in the justification please point to the section(s) where related material for the question can be found. ", "page_idx": 22}, {"type": "text", "text": "IMPORTANT, please: ", "page_idx": 22}, {"type": "text", "text": "• Delete this instruction block, but keep the section heading “NeurIPS paper checklist\", • Keep the checklist subsection headings, questions/answers and guidelines below. • Do not modify the questions and only use the provided macros for your answers. ", "page_idx": 22}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 22}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Justification: We’ve made claims about this work’s originality, novelty, and significance.   \nThey are accurately described, with the central task and scope well defined. ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 22}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? Answer: [Yes] ", "page_idx": 22}, {"type": "text", "text": "Justification: We have Appendix F for this. Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 23}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 23}, {"type": "text", "text": "Answer: [NA] ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Justification: This paper does not include theoretical results ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 23}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 23}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 23}, {"type": "text", "text": "Justification: We’ve provided original code and data to be downloaded at: https: //anonymous.4open.science/r/llm-graph-recall-8513. They can be used to reproduce the main experimental results of the paper.   \nGuidelines: ", "page_idx": 23}, {"type": "text", "text": "", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 24}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 24}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "Justification: We’ve provided original code and data to reproduce the main experimental results. ", "page_idx": 24}, {"type": "text", "text": "Guidelines: ", "text_level": 1, "page_idx": 24}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why. ", "page_idx": 24}, {"type": "text", "text": "• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable). • Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 25}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "Justification: The paper has provided the main hyperparameters for the evaluation test, such as the prior for the ERGM, and the specifications for generating the synthetic datasets. More nuanced details have been included in the code. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 25}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Justification: We provided $95\\%$ conficence internvals for all of the main results in the paper. Guidelines: ", "page_idx": 25}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 25}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 25}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 25}, {"type": "text", "text": "Justification: We have provided our cloud providers for all the APIs used in this paper in Appendix. ", "page_idx": 25}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 26}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 26}, {"type": "text", "text": "Justification: We have strictly conformed to the NeurIPS Code of Ethics ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 26}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 26}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 26}, {"type": "text", "text": "Justification: We have a section for this. ", "page_idx": 26}, {"type": "text", "text": "Guidelines: ", "page_idx": 26}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed.   \n• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 26}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 26}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 27}, {"type": "text", "text": "Justification: We believe that this paper poses no such risks. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 27}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 27}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 27}, {"type": "text", "text": "Justification: We have properly cited all the dataset being used in this paper. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 27}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 27}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 27}, {"type": "text", "text": "Justification: The paper does not release new assets. ", "page_idx": 27}, {"type": "text", "text": "Guidelines: ", "page_idx": 27}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 27}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "page_idx": 27}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 28}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 28}, {"type": "text", "text": "Justification: This paper is not directly involved with research with human subjects. It is, however, inspired by and adopts some of the results in a (referenced) previous paper that involves human subject. All details of instructions can be found in that paper. ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 28}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 28}, {"type": "text", "text": "Answer: [NA] ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Justification: This paper is not directly involved with research with human subjects. It is, however, inspired by and adopts some of the results in a (referenced) previous paper that involves human subject. All details of instructions can be found in that paper. ", "page_idx": 28}, {"type": "text", "text": "Guidelines: ", "page_idx": 28}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 28}]