[{"figure_path": "paYwtPBpyZ/figures/figures_4_1.jpg", "caption": "Figure 1: FOLDFLOW-2 architecture which processes sequence and structure and outputs SE(3) vectorfields.", "description": "The figure shows the architecture of the FOLDFLOW-2 model. It consists of three main components: a structure and sequence encoder, a multi-modal fusion trunk, and a geometric decoder. The encoder processes both the 3D structure of the protein backbone and its amino acid sequence separately. The fusion trunk combines these two representations into a shared representation. Finally, the decoder generates SE(3) vector fields, which represent the protein's 3D structure.", "section": "3.1 FOLDFLOW-2 Architecture"}, {"figure_path": "paYwtPBpyZ/figures/figures_6_1.jpg", "caption": "Figure 2: Uncurated designable (scRMSD < 2Å) length 100 structures with ESMFold refolded structure from FOLDFLOW-2 and RFDiffusion colored by secondary structure composition where we see RFDiffusion generates mostly α-helices.", "description": "This figure shows a comparison of protein structures generated by FOLDFLOW-2 and RFDiffusion.  Both models generated 100-residue-long protein backbones.  The structures are colored according to their secondary structure (alpha-helices, beta-sheets, coils) to highlight the differences in structural diversity.  The FOLDFLOW-2 structures exhibit a much wider variety of secondary structure elements compared to RFDiffusion, which produces mostly alpha-helices. This demonstrates FOLDFLOW-2's superior ability to generate diverse and designable protein structures.", "section": "4.1 Unconditional protein backbone generation"}, {"figure_path": "paYwtPBpyZ/figures/figures_7_1.jpg", "caption": "Figure 3: Distribution of secondary structure elements (a-helices, B-sheets, and coils) of designable (scRMSD < 2.0) proteins generated by various models. FOLDFLOW-2 generates more diverse designable backbones.", "description": "This figure shows the distribution of secondary structure elements (alpha-helices, beta-sheets, and coils) for designable proteins generated by different models, including FOLDFLOW-2, FOLDFLOW, FrameDiff, and RFDiffusion.  Each model's distribution is visualized as a ternary plot, where the vertices represent the proportion of each secondary structure type.  The figure also includes a ternary plot showing the distribution of secondary structure elements in the actual protein data used for training.  A bar chart shows the number of beta-sheets generated by each model across various protein lengths. The figure demonstrates that FOLDFLOW-2 generates a much more diverse range of secondary structures compared to the other models, more closely resembling the distribution in the actual protein data.", "section": "4.1 Unconditional protein backbone generation"}, {"figure_path": "paYwtPBpyZ/figures/figures_8_1.jpg", "caption": "Figure 10: Additional conformation generation task samples. Proteins are colored by secondary structure with a-helices in blue, B-sheets in red, and loops in green.", "description": "This figure compares the protein conformation ensembles generated by the FOLDFLOW-2 model against those from ESMFlow-MD and ground truth data from molecular dynamics simulations.  The proteins in each column represent the same protein, showcasing the diversity of generated conformations and the model's ability to capture different protein dynamics compared to ground truth.", "section": "C Additional Results"}, {"figure_path": "paYwtPBpyZ/figures/figures_17_1.jpg", "caption": "Figure 5: Analysis of global pLDDT distribution on a sample of 500 proteins from SwissProt.", "description": "This figure shows the distribution of global pLDDT values for a sample of 500 proteins from the SwissProt dataset. Panel (a) displays a cumulative histogram of the average pLDDT scores. Panel (b) presents a scatter plot showing the relationship between the average pLDDT score and the standard deviation of pLDDT scores across all residues within each protein. The green box in panel (b) highlights the region where proteins were kept after filtering, indicating a selection of high-confidence proteins with low pLDDT standard deviations.", "section": "B.1.2 Synthetic Structures"}, {"figure_path": "paYwtPBpyZ/figures/figures_17_2.jpg", "caption": "Figure 6: Examples of high-confidence, low-quality structures that were filtered out of the training set. Images are from the AlphaFold Protein Structure Database https://alphafold.ebi.ac.uk/, accessed in May 2024; identifiers are the UniProt IDs of each example.", "description": "This figure shows two examples of protein structures that were filtered out from the training dataset due to being of low quality despite having high overall confidence.  The structures exhibit unrealistic global structures or sub-chain interactions, which are problematic for training a generative model. The figure highlights the importance of the filtering process in ensuring the quality of the training data.", "section": "Dataset construction"}, {"figure_path": "paYwtPBpyZ/figures/figures_19_1.jpg", "caption": "Figure 7: Schematic of designability calculation. First a generative flow model is used to generate a protein backbone from an initial structure (possibly noise) and (optionally) a protein sequence. This is then fed to an inverse folding model (ProteinMPNN [Dauparas et al., 2022]) eight times to generate eight sequences for the structure. Then all eight sequences are fed back to ESMFold to produce a structure for each sequence. All eight structures are compared using scRMSD from the ESMFold \"refolded\" structure to the generated structure, and the minimum is taken as the “designability” of the generated structure with at least one structure with error < 2.0Å being classified as designable following Watson et al. [2023].", "description": "The figure illustrates the process of calculating protein designability.  A generative flow model creates a protein backbone from input data (potentially noise or a protein sequence). This backbone is input into an inverse folding model eight times to generate eight distinct sequences. Each sequence is then folded by ESMFold to produce a structure.  Finally, the minimum scRMSD (structure-based root mean square deviation) between the generated and refolded structures is computed and used to determine the designability of the generated structure. A designable structure is one with at least one scRMSD below 2.0Å.", "section": "B.4 Inference details"}, {"figure_path": "paYwtPBpyZ/figures/figures_21_1.jpg", "caption": "Figure 8: Samples of solved motif scaffolding problems from the benchmark of Watson et al. [2023]. The motif is in red, the designed scaffold is in blue, and the refolded structure from ESMFold is in gray.", "description": "This figure shows six examples of successful motif scaffolding from the Watson et al. [2023] benchmark.  Each example displays the original motif (red), the newly generated scaffold (blue), and the final structure after refolding with ESMFold (gray). The successful integration of the scaffold into the overall protein structure demonstrates the effectiveness of the FOLDFLOW-2 model in this conditional protein design task. The visual representation clearly highlights the designed scaffold's incorporation into the pre-existing motif.", "section": "4.4 Motif Scaffolding"}, {"figure_path": "paYwtPBpyZ/figures/figures_24_1.jpg", "caption": "Figure 9: Samples of scaffolds for VHHs. Motif (i.e. CDR) is in red, scaffold is in blue, and refolded structure from ESMFold is in gray.", "description": "This figure shows four examples of motif scaffolding results using the FOLDFLOW-2 model on VHH nanobodies.  In each example, the original motif (CDR, or Complementarity Determining Region) is shown in red, the generated scaffold in blue, and the final structure after refolding with ESMFold is shown in gray.  The figure demonstrates the model's ability to generate diverse and structurally realistic scaffolds for nanobodies. ", "section": "4.4 Motif Scaffolding"}, {"figure_path": "paYwtPBpyZ/figures/figures_24_2.jpg", "caption": "Figure 10: Additional conformation generation task samples. Proteins are colored by secondary structure with a-helices in blue, B-sheets in red, and loops in green.", "description": "This figure compares the results of three different methods for generating protein conformations: ground truth, ESMFlow-MD, and FoldFlow-2. Each method produces multiple conformations for the same protein, which are visually represented using different colors for different secondary structures (a-helices in blue, B-sheets in red, and loops in green). The figure aims to illustrate the differences in the types and diversity of conformations generated by each method.", "section": "C Additional Results"}, {"figure_path": "paYwtPBpyZ/figures/figures_25_1.jpg", "caption": "Figure 11: Curve showing the number of designable proteins that are at least some distance away from the PDB. FOLDFLOW-2 has many more novel and designable proteins than baselines. We report designability fraction at TM-score = 0.3 in table 3.", "description": "This figure shows the cumulative distribution function (CDF) of the maximum TM-score to the PDB for designable proteins generated by various methods, including FOLDFLOW-2, FoldFlow, FrameDiff, Genie, and RFDiffusion.  The x-axis represents the maximum TM-score to the Protein Data Bank (PDB), indicating how similar the generated protein is to known proteins. The y-axis shows the number of designable proteins with a maximum TM-score less than or equal to the x-axis value.  The plot demonstrates that FOLDFLOW-2 generates a significantly larger number of designable proteins that are less similar to existing proteins in the PDB compared to other methods, highlighting its ability to produce novel protein structures.", "section": "4.1 Unconditional protein backbone generation"}, {"figure_path": "paYwtPBpyZ/figures/figures_25_2.jpg", "caption": "Figure 12: Designable samples from various methods. Overlayed in silver are refolded ESMFold structures. FOLDFLOW-2 exhibits significantly more diversity in secondary structure at shorter lengths than RFDiffusion with fine-tuned models able to produce diverse proteins across lengths.", "description": "This figure compares designable protein structures generated by different methods, including RFDiffusion and FoldFlow-2 (with and without synthetic data and diversity fine-tuning).  The images show that FoldFlow-2 produces more diverse structures, particularly at shorter lengths, demonstrating the effectiveness of its approach and the benefit of incorporating synthetic data and fine-tuning techniques. The silver overlay represents the refolded structures using ESMFold, highlighting the structural similarity.", "section": "C.1 Unconditional generation diversity and novelty exploration"}, {"figure_path": "paYwtPBpyZ/figures/figures_26_1.jpg", "caption": "Figure 3: Distribution of secondary structure elements (a-helices, β-sheets, and coils) of designable (scRMSD < 2.0) proteins generated by various models. FOLDFLOW-2 generates more diverse designable backbones.", "description": "This figure compares the distribution of secondary structures (α-helices, β-sheets, and coils) generated by different protein backbone generation models, including FOLDFLOW-2, FOLDFLOW, FrameDiff, and RFDiffusion.  It uses ternary plots to visualize the proportions of each secondary structure type in the generated proteins.  The goal is to show that FOLDFLOW-2 generates a more diverse set of secondary structures compared to the other models, better reflecting the distribution found in real-world protein data.  Designable proteins are defined as those with a structure-based root mean square deviation (scRMSD) less than 2 angstroms compared to the original protein structure.", "section": "4.1 Unconditional protein backbone generation"}]