{"importance": "This paper is important because **it introduces a novel active finetuning framework (BiLAF)** that significantly improves sample selection efficiency in vision tasks.  **BiLAF addresses limitations of existing active learning methods**, which often struggle to select samples effectively for model finetuning due to inherent bias and reliance on global distribution alignment rather than local decision boundaries. **The proposed method shows superior performance** across various datasets and benchmarks, opening new avenues for research in active learning and model finetuning.", "summary": "Bi-Level Active Finetuning Framework (BiLAF) revolutionizes sample selection for efficient model finetuning. Unlike existing methods, BiLAF incorporates both global diversity and local decision boundary uncertainty for superior performance.", "takeaways": ["BiLAF is a novel active finetuning framework that outperforms existing methods.", "BiLAF effectively identifies pseudo-class centers and boundary samples for one-shot annotation.", "BiLAF demonstrates superior efficacy across various vision tasks, including image classification, object detection, and semantic segmentation."], "tldr": "The prevalent pretraining-finetuning paradigm in deep learning requires high-quality annotated data for effective model finetuning, which is often expensive and time-consuming.  Existing active learning methods for selecting optimal samples for finetuning struggle with inherent batch selection bias and neglect local decision boundaries. This leads to suboptimal model performance. \nThis research proposes a novel Bi-Level Active Finetuning Framework (BiLAF) to overcome these issues. BiLAF incorporates two stages: core sample selection for global diversity and boundary sample selection for local uncertainty. Using a novel denoising technique and evaluation metric, BiLAF effectively identifies pseudo-class centers and boundary samples, improving sample selection accuracy and efficiency. Extensive experiments consistently demonstrate that BiLAF outperforms state-of-the-art methods, exhibiting superior efficacy in diverse vision tasks.", "affiliation": "Dept. of CSE & School of AI & Moe Key Lab of AI, Shanghai Jiao Tong University", "categories": {"main_category": "Computer Vision", "sub_category": "Active Learning"}, "podcast_path": "444LAH3MhG/podcast.wav"}