[{"figure_path": "0oUutV92YF/tables/tables_6_1.jpg", "caption": "Table 1: Accuracy (%) of fold classification and enzyme reaction classification. The best results are shown in bold.", "description": "This table presents the accuracy results (%) for protein fold classification and enzyme reaction classification tasks.  It compares the performance of ProtGO (the proposed method) against various other state-of-the-art methods categorized by the input modalities they use: sequence-only, structure-only, and sequence-structure.  The results are broken down by fold classification (Fold, Superfamily, Family) and enzyme reaction classification. The best-performing method for each task and category is highlighted in bold, showcasing ProtGO's superior performance across all categories.", "section": "4.3 Results of Fold and Enzyme Reaction Classification"}, {"figure_path": "0oUutV92YF/tables/tables_7_1.jpg", "caption": "Table 2: Fmax of GO term prediction and EC number prediction. The best results are shown in bold.", "description": "This table presents the F-measure (Fmax) results for two protein function prediction tasks: Gene Ontology (GO) term prediction and Enzyme Commission (EC) number prediction.  It compares the performance of various methods across different modalities (sequence-only, structure-only, and sequence-structure). The best performing method for each task and each GO category (GO-BP, GO-MF, GO-CC) is highlighted in bold.  The table helps illustrate the improvement in prediction accuracy achieved by considering multiple protein data modalities.", "section": "4.4 Results of GO Term and EC Number Prediction"}, {"figure_path": "0oUutV92YF/tables/tables_8_1.jpg", "caption": "Table 1: Accuracy (%) of fold classification and enzyme reaction classification. The best results are shown in bold.", "description": "This table presents the accuracy results for protein fold and enzyme reaction classification.  It compares the performance of ProtGO against various other methods categorized by the type of input used (sequence only, structure only, or both sequence and structure). The accuracy is reported for different levels of granularity in fold classification (Fold, Superfamily, Family) and for enzyme reactions. The best-performing method for each task is highlighted in bold. The table demonstrates ProtGO's superior performance, highlighting its ability to integrate multimodal data effectively.", "section": "4.3 Results of Fold and Enzyme Reaction Classification"}, {"figure_path": "0oUutV92YF/tables/tables_15_1.jpg", "caption": "Table 1: Accuracy (%) of fold classification and enzyme reaction classification. The best results are shown in bold.", "description": "This table presents the accuracy results for protein fold and enzyme reaction prediction, comparing various methods.  The accuracy is calculated as a percentage.  Different modalities of input data (sequence only, structure only, and sequence and structure combined) are compared across multiple methods.  The best performing method in each category is highlighted in bold.", "section": "4.3 Results of Fold and Enzyme Reaction Classification"}, {"figure_path": "0oUutV92YF/tables/tables_17_1.jpg", "caption": "Table 5: The comparison results with pre-training methods (Fmax) on GO term and EC number prediction. The best results are shown in bold.", "description": "This table compares the performance of ProtGO-ESM (a version of ProtGO that incorporates ESM embeddings) against other pre-training methods on GO term and EC number prediction tasks.  The methods are categorized into sequence-only, sequence-function, and sequence-structure approaches.  The Fmax score (a combined measure of precision and recall) is used to evaluate performance. ProtGO-ESM shows competitive results compared to existing pre-training methods.", "section": "G Comparisons with Pre-training Methods"}]