[{"figure_path": "1ziIqFo4Tj/figures/figures_2_1.jpg", "caption": "Figure 1: For sample shapes from the TOPKIDS (first row) and TOSCA (second row), this figure shows the second eigenvector of the mesh laplacian (LBO 2), the second eigenvector of the uniform shape laplacian from the triangulation adjacency (uniform shape laplacian 2), the 2-hop and 6-hop neighborhoods of vertex 100, the second SHOT descriptor and the LMD of vertex 2.", "description": "This figure shows different shape descriptors for two sample shapes from the TOPKIDS and TOSCA datasets.  The descriptors include the second eigenvector of the mesh Laplacian (LBO), the second eigenvector of the uniform shape Laplacian, 2-hop and 6-hop neighborhoods of a specific vertex (100), the second SHOT descriptor, and the Local Map Distortion (LMD) of another vertex (2).  These descriptors illustrate the trade-off between accuracy and smoothness in shape matching, which the paper addresses.", "section": "3 Related Work"}, {"figure_path": "1ziIqFo4Tj/figures/figures_3_1.jpg", "caption": "Figure 2: Showing mating of sample shapes from the isometric SCAPE dataset (first row) and the non-isometric TOPKIDS (second row), this figure shows the performance of different baselines.", "description": "This figure displays the results of several shape matching methods on isometric and non-isometric shapes.  The top row shows results using the SCAPE dataset, which contains isometric (rigid) transformations. The bottom row shows results using the TOPKIDS dataset, which contains non-isometric (non-rigid) transformations.  Each column represents a different shape matching algorithm: GEM, GRAMPA, DIR, ZoomOut, HOPE, and SHOT.  The plots on the right show the percentage of correct correspondences as a function of geodesic error, which measures how accurately the algorithm maps corresponding points on the two shapes.  The figure demonstrates that HOPE achieves a better balance of accuracy and smoothness compared to the other baselines, especially for non-isometric shapes.", "section": "4 HOPE"}, {"figure_path": "1ziIqFo4Tj/figures/figures_5_1.jpg", "caption": "Figure 3: HOPE (a pipeline) for shape matching.", "description": "This figure illustrates the pipeline of the HOPE algorithm for shape matching.  It begins with two input shapes, M and N.  Features are extracted from both shapes using three different methods: 2-ring geodesics, k-hop neighborhoods, and SHOT descriptors. An initial map is created, possibly using SHOT descriptors alone. The core of the algorithm then iteratively refines this map using local map distortion to identify poorly matched vertices and k-hop neighborhood-based descriptors to improve the matches for those vertices. The refined map is iteratively updated across several iterations, showing a progressive improvement in the alignment of the two shapes.", "section": "4.3 Pipeline for HOPE"}, {"figure_path": "1ziIqFo4Tj/figures/figures_6_1.jpg", "caption": "Figure 11: Comparison on intra-class matching on SMAL_r using 298 pairs of shape. Figure showing HOPE, 2D-GEM, ZoomOut, and DIR.", "description": "This figure shows a comparison of the performance of HOPE against other baselines (2D-GEM, ZoomOut, and DIR) on the SMAL_r dataset for intra-class matching. The figure includes a plot showing the percentage of correspondences against the geodesic error for each method.  It also visually shows the shape matching results for a sample shape using each method, highlighting the differences in accuracy and smoothness between the methods.", "section": "E Non-Isometric Shape Matching"}, {"figure_path": "1ziIqFo4Tj/figures/figures_7_1.jpg", "caption": "Figure 5: Performance comparison on TOPKIDS 5(a), SCAPE 5(b), and TOSCA 5(c).", "description": "This figure compares the performance of HOPE against several baselines on three different datasets: TOPKIDS, SCAPE, and TOSCA.  The x-axis represents the geodesic error, which measures the accuracy of the shape matching. The y-axis represents the percentage of correspondences that were correctly matched. The figure shows that HOPE generally outperforms or performs comparably to other state-of-the-art methods, particularly on the non-isometric dataset TOPKIDS.", "section": "5 Experiments"}, {"figure_path": "1ziIqFo4Tj/figures/figures_8_1.jpg", "caption": "Figure 6: Performance comparison on FAUST_r 6(a), SCAPE_r 6(b), and TOSCA_r 6(c).", "description": "This figure compares the performance of HOPE against other methods (2D-GEM, DIR-500, ZoomOut) on three remeshed datasets: FAUST_r, SCAPE_r, and TOSCA_r.  The plots show the percentage of correspondences achieved at different geodesic error levels.  The results demonstrate HOPE's robustness and generalizability across different shapes and mesh structures.", "section": "5.6 Performance Analysis"}, {"figure_path": "1ziIqFo4Tj/figures/figures_8_2.jpg", "caption": "Figure 7: Time Comparison on TOSCA showing HOPE, 2D-GEM, and ZoomOut.", "description": "This figure compares the time usage per shape pair for HOPE, 2D-GEM, and ZoomOut on the TOSCA dataset.  It demonstrates that HOPE is relatively faster than 2D-GEM and ZoomOut, especially for larger shape pairs, indicating its efficiency in shape matching.", "section": "5 Experiments"}, {"figure_path": "1ziIqFo4Tj/figures/figures_15_1.jpg", "caption": "Figure 8: Ablation and sensitivity studies on TOPKIDS 8(a), SCAPE 8(b), and TOSCA_r 8(c).", "description": "This figure presents the results of ablation and sensitivity studies conducted on three datasets: TOPKIDS, SCAPE, and TOSCA_r.  Different versions of the HOPE algorithm were tested, each varying a parameter (like the number of iterations or the k-hop neighborhood strategy) or removing a component (like the local map distortion). The graphs display the percentage of correspondences achieved against the geodesic error for each variant.  This allows for comparison and analysis to determine the impact of individual components and parameters on the algorithm's accuracy.", "section": "Ablation and Parameter Sensitivity Studies"}, {"figure_path": "1ziIqFo4Tj/figures/figures_16_1.jpg", "caption": "Figure 9: Different initializations on TOPKIDS 9(a), SCAPE 9(b), and TOSCA_r 9(c).", "description": "This figure demonstrates the performance of HOPE using different initialization methods: SHOT, HKS, and WKS.  For each dataset (TOPKIDS, SCAPE, and TOSCA_r), the 'Source' column shows the original shape. The remaining columns show the results after applying HOPE with each initialization method, visualizing the resulting map quality. The corresponding graphs on the right show the percentage of correspondences plotted against the geodesic error for each initialization method. This comparison helps to assess the impact of initialization on the final matching accuracy and smoothness.", "section": "4.4 HOPE vs 2D-GEM"}, {"figure_path": "1ziIqFo4Tj/figures/figures_16_2.jpg", "caption": "Figure 10: Performance comparisons on SHREC16 HOLES 10(a), SHREC16 CUTS 9(b), and TOSCA_r 10(b).", "description": "This figure compares the performance of HOPE against several baselines on two partial shape matching datasets (SHREC16 HOLES and SHREC16 CUTS) and one nearly isometric dataset (TOSCA).  The x-axis represents the geodesic error, a measure of how well vertices are mapped between shapes. The y-axis shows the percentage of correctly matched vertices.  The figure demonstrates HOPE's performance in the context of partial shape matching and its relative accuracy compared to established methods like 2D-GEM, DIR-500, and ZoomOut.", "section": "E Non-Isometric Shape Matching"}, {"figure_path": "1ziIqFo4Tj/figures/figures_17_1.jpg", "caption": "Figure 5: Performance comparison on TOPKIDS 5(a), SCAPE 5(b), and TOSCA 5(c).", "description": "This figure compares the performance of HOPE against other state-of-the-art shape matching methods on three different datasets: TOPKIDS (non-isometric), SCAPE (isometric), and TOSCA (isometric).  The x-axis represents the geodesic error, a measure of the accuracy of the shape matching, while the y-axis shows the percentage of correspondences correctly matched.  The figure demonstrates that HOPE achieves competitive performance across all datasets, particularly excelling in the non-isometric TOPKIDS dataset.", "section": "5 Experiments"}, {"figure_path": "1ziIqFo4Tj/figures/figures_17_2.jpg", "caption": "Figure 2: Showing mating of sample shapes from the isometric SCAPE dataset (first row) and the non-isometric TOPKIDS (second row), this figure shows the performance of different baselines.", "description": "This figure compares the performance of several shape matching baselines (GEM, GRAMPA, DIR, ZoomOut, HOPE, SHOT) on isometric (SCAPE dataset) and non-isometric (TOPKIDS dataset) shapes.  The results are visualized as color-coded mappings between source and target shapes, illustrating the accuracy and smoothness of the correspondence.  The figure demonstrates how HOPE achieves improved accuracy and smoothness compared to the baselines on both isometric and non-isometric shapes.", "section": "4 HOPE"}, {"figure_path": "1ziIqFo4Tj/figures/figures_17_3.jpg", "caption": "Figure 14: Sample shape from TOPKIDS. Figure showing HOPE, 2D-GEM, ZoomOut, and DIR.", "description": "This figure shows a visual comparison of shape matching results on a sample shape from the TOPKIDS dataset.  Several methods are compared: HOPE (the proposed method), 2D-GEM, ZoomOut, and DIR. Each method's output is displayed alongside the original shape. The color mapping represents the correspondence between the vertices of the source and target shapes. The visual comparison allows for qualitative assessment of the accuracy and smoothness of the different methods' shape matching.", "section": "Visual Comparisons"}, {"figure_path": "1ziIqFo4Tj/figures/figures_17_4.jpg", "caption": "Figure 2: Showing mating of sample shapes from the isometric SCAPE dataset (first row) and the non-isometric TOPKIDS (second row), this figure shows the performance of different baselines.", "description": "This figure compares the performance of several shape matching baselines (GEM, GRAMPA, DIR, ZoomOut, HOPE, SHOT) on isometric (SCAPE dataset) and non-isometric (TOPKIDS dataset) shape pairs.  The color mapping on each shape visually represents the correspondence between vertices of the source and target shapes generated by each method.  The plots to the right quantify performance using the percentage of correct correspondences and the geodesic error.", "section": "4 HOPE"}]