[{"figure_path": "uBVCPAMDGk/tables/tables_3_1.jpg", "caption": "Table 1: Quantitative comparison of image generation performance on ImageNet 64x64 using Consistency Models and our proposed boosting methods with robust classifiers and joint models.", "description": "This table presents a quantitative comparison of image generation performance using different methods on the ImageNet 64x64 dataset.  It compares the Fréchet Inception Distance (FID), Inception Score (IS), precision, and recall achieved by several methods. These methods include Consistency Training (CT) and Consistency Distillation (CD) with different network architectures (RN50 and Wide-RN), and the use of robust classifiers and a joint classifier-discriminator. The table shows the results for both one and two inference steps, highlighting the impact of the proposed boosting method.", "section": "4 Experiments"}, {"figure_path": "uBVCPAMDGk/tables/tables_6_1.jpg", "caption": "Table 1: Quantitative comparison of image generation performance on ImageNet 64x64 using Consistency Models and our proposed boosting methods with robust classifiers and joint models.", "description": "This table presents a quantitative comparison of image generation performance using different methods on the ImageNet 64x64 dataset.  It compares the Fréchet Inception Distance (FID), Inception Score (IS), precision, and recall achieved by Consistency Training (CT) and Consistency Distillation (CD) models, both with and without the proposed boosting method. The boosting method uses either a robust classifier or a joint classifier-discriminator model, and the results are shown for both one and two inference steps. Lower FID scores and higher IS, precision, and recall values indicate better image quality.", "section": "4 Experiments"}, {"figure_path": "uBVCPAMDGk/tables/tables_7_1.jpg", "caption": "Table 1: Quantitative comparison of image generation performance on ImageNet 64x64 using Consistency Models and our proposed boosting methods with robust classifiers and joint models.", "description": "This table presents a quantitative comparison of image generation performance using various methods on the ImageNet 64x64 dataset.  It compares the Fréchet Inception Distance (FID), Inception Score (IS), Precision, and Recall metrics for different models and boosting techniques. The models include those based on Consistency Training (CT) and Consistency Distillation (CD), using either one or two inference steps.  Boosting methods are applied using robust classifiers and joint classifier-discriminator models. Lower FID scores and higher IS scores, Precision, and Recall values indicate better performance.", "section": "4 Experiments"}, {"figure_path": "uBVCPAMDGk/tables/tables_8_1.jpg", "caption": "Table 2: FID and IS results with varying loss functions as described in section 3.2.", "description": "This table presents the Fréchet Inception Distance (FID) and Inception Score (IS) results for different loss functions used in the proposed model.  The results are shown for both Consistency Training (CT) and Consistency Distillation (CD) methods, with 1 and 2 inference steps.  The loss functions compared include cross-entropy loss (ICE), binary cross-entropy loss (IBCE), a combined cross-entropy and binary cross-entropy loss (ICE - IBCE), and the authors' proposed loss function. Lower FID scores and higher IS scores indicate better image quality. This table demonstrates the impact of the loss function choice on model performance.", "section": "4.3 Ablation Study"}, {"figure_path": "uBVCPAMDGk/tables/tables_8_2.jpg", "caption": "Table 1: Quantitative comparison of image generation performance on ImageNet 64x64 using Consistency Models and our proposed boosting methods with robust classifiers and joint models.", "description": "This table presents a quantitative comparison of image generation performance using different methods on the ImageNet 64x64 dataset.  It compares the Fréchet Inception Distance (FID), Inception Score (IS), Precision, and Recall achieved by Consistency Training (CT) and Consistency Distillation (CD) models, both with and without the proposed boosting technique using robust classifiers and a joint classifier-discriminator model.  The results show improvements across various metrics when using the proposed method, especially in the FID and IS scores.", "section": "4 Experimental Results"}, {"figure_path": "uBVCPAMDGk/tables/tables_9_1.jpg", "caption": "Table 1: Quantitative comparison of image generation performance on ImageNet 64x64 using Consistency Models and our proposed boosting methods with robust classifiers and joint models.", "description": "This table presents a quantitative comparison of image generation performance using FID (Fréchet Inception Distance), IS (Inception Score), precision, and recall.  It compares the performance of various methods on the ImageNet 64x64 dataset. The methods include different Consistency Training (CT) and Consistency Distillation (CD) approaches, both with and without the proposed boosting techniques using robust classifiers and a joint classifier-discriminator model. The table shows FID and IS scores for different models with 1 and 2 inference steps.  Lower FID scores and higher IS scores indicate better image generation quality.", "section": "4 Experiments"}, {"figure_path": "uBVCPAMDGk/tables/tables_14_1.jpg", "caption": "Table 1: Quantitative comparison of image generation performance on ImageNet 64×64 using Consistency Models and our proposed boosting methods with robust classifiers and joint models.", "description": "This table presents a quantitative comparison of image generation performance using different methods on the ImageNet 64x64 dataset.  It compares the Fréchet Inception Distance (FID), Inception Score (IS), Precision, and Recall achieved by several models.  Specifically, it showcases the performance of Consistency Training (CT) and Consistency Distillation (CD) models, both with and without the proposed boosting method using robust classifiers and joint classifier-discriminator models, and using different inference steps. Lower FID scores and higher IS scores indicate better image generation quality.", "section": "4 Experimental Results"}]