[{"figure_path": "IM4LtYRWdE/tables/tables_7_1.jpg", "caption": "Table 1: FID and round-trip MSE (mean ±2σ) at 1.02 Inflation Gap (IG)", "description": "This table presents the Fréchet Inception Distance (FID) scores and round-trip Mean Squared Error (MSE) for the AFHQv2 and CIFAR-10 datasets.  The results are shown for different numbers of preserved dimensions (1, 2, 30, 62, 307, 615, 1536, 3041, and 3072) while maintaining a constant inflation gap of 1.02.  The FID and MSE values represent the mean and ±2 standard deviations of three independent runs, each with 50,000 samples for FID and 10,000 for MSE.  Lower FID scores indicate better image generation quality, and lower MSE indicates better accuracy in roundtrip image reconstruction.", "section": "Experiments"}, {"figure_path": "IM4LtYRWdE/tables/tables_8_1.jpg", "caption": "Table 2: FID and round-trip MSE (mean ±2σ) for AFHQv2 at varying Inflation Gaps (IG)", "description": "This table presents the results of experiments conducted on the AFHQv2 dataset.  The experiments varied the inflation gap (IG) while keeping the number of preserved dimensions constant at 2.  The table shows the FID (Fréchet Inception Distance) scores and MSE (Mean Squared Error) for round-trip integration for each of the different inflation gaps.  Lower FID scores indicate better generation quality, and lower MSE scores indicate better accuracy in the round-trip reconstruction process.  As you can see, increasing the inflation gap leads to significantly worse FID scores (lower generation quality) but also better MSE (better reconstruction).", "section": "Experiments"}, {"figure_path": "IM4LtYRWdE/tables/tables_9_1.jpg", "caption": "Table 3: FID score comparison with injective flows for CIFAR-10", "description": "This table compares the Frechet Inception Distance (FID) scores of the proposed Inflationary Flows model against three existing injective flow models (M-Flow, Rectangular Flows, and Canonical Manifold Flows) on the CIFAR-10 dataset.  The comparison is done for different numbers of preserved dimensions (30, 40, and 62) to show how the proposed model performs relative to the baselines in terms of generative image quality. Lower FID scores indicate better performance.", "section": "Experiments"}, {"figure_path": "IM4LtYRWdE/tables/tables_25_1.jpg", "caption": "Table 1: FID and round-trip MSE (mean ±2σ) at 1.02 Inflation Gap (IG)", "description": "This table presents the Frechet Inception Distance (FID) scores and mean squared errors (MSE) for the AFHQv2 and CIFAR-10 datasets.  The results are shown for different numbers of preserved dimensions (1, 2, 30, 62, 615, 1536, 3072) while keeping the inflation gap constant at 1.02.  The FID and MSE values represent the means and ±2 standard deviations calculated over three independent runs of 50,000 samples for FID and 10,000 for MSE, providing a measure of the variability and uncertainty in the results.  Lower FID scores and MSE values indicate better generative performance and accuracy in the roundtrip (data compression and reconstruction).", "section": "6 Experiments"}, {"figure_path": "IM4LtYRWdE/tables/tables_26_1.jpg", "caption": "Table 4: Toy Data Training Hyperparameters", "description": "This table shows the hyperparameters used for training the toy datasets (Circles, Sine, Moons, S Curve, Swirl).  It details the total number of dimensions in the original data, the number of dimensions kept in the latent space, the maximum time (tmax) used for integration in the pfODE, and the total training duration in millions of images (Mimg). The schedule column indicates whether the PR-Preserving (PRP) or PR-Reducing (PRR) schedule was used for each dataset.", "section": "B.4 Training Details"}, {"figure_path": "IM4LtYRWdE/tables/tables_26_2.jpg", "caption": "Table 5:  gi Values for Preserved vs. Compressed Dimensions for Toy Experiments", "description": "This table shows the values used for the elements of vector g corresponding to preserved and compressed dimensions for different toy experiments. The inflation gap (IG) and the values of gpreserved and gcompressed are presented for each experiment. This table is useful to understand the effect of different compression ratios on the model's performance.", "section": "B.3 Details of pfODE integration"}, {"figure_path": "IM4LtYRWdE/tables/tables_26_3.jpg", "caption": "Table 6: Toy Experiments Compressed Dimension Variance by Inflation Gap (IG)", "description": "This table presents the compressed dimension variance for different toy datasets (Circles, Sine, Moons, S Curve, Swirl) under different dimension-reducing (PRR) schedules with varying inflation gaps (IG).  The values show how much the variance is reduced in the compressed dimensions depending on the chosen IG, demonstrating the effect of this hyperparameter on the degree of compression.", "section": "B.4.1 Toy DataSets"}, {"figure_path": "IM4LtYRWdE/tables/tables_27_1.jpg", "caption": "Table 7: CIFAR-10 & AFHQv2 Common Training Hyperparameters (Across All Schedules)", "description": "This table lists the hyperparameters used for training the diffusion-based models on both the CIFAR-10 and AFHQv2 datasets.  These hyperparameters remained consistent across all the different noise schedules investigated in the paper.  The table includes values for the channel multiplier, channels per resolution, data augmentation (x-flips), augmentation probability, dropout probability, learning rate, learning rate ramp-up, exponential moving average half-life, and batch size.", "section": "Experiments"}, {"figure_path": "IM4LtYRWdE/tables/tables_27_2.jpg", "caption": "Table 1: FID and round-trip MSE (mean ±2σ) at 1.02 Inflation Gap (IG)", "description": "This table presents the Fréchet Inception Distance (FID) scores and round-trip Mean Squared Error (MSE) values for different numbers of preserved dimensions (ranging from 1 to 3072, representing no compression) on the AFHQv2 and CIFAR-10 datasets. The inflation gap (IG) is held constant at 1.02.  The FID and MSE values are averages of three independently generated sets of samples, with their respective standard deviations reported. Lower FID scores indicate better generative performance, while lower MSE values indicate better accuracy in reconstructing the original images after transforming to and from the latent space.", "section": "6 Experiments"}, {"figure_path": "IM4LtYRWdE/tables/tables_28_1.jpg", "caption": "Table 9: Training Duration (in Mimgs) and Exponential Inflation Constant (ρ) for AFHQv2 Experiments Using Variable Inflation Gaps (IGs)", "description": "This table shows the training duration (in millions of images) and the exponential inflation constant (ρ) for experiments conducted on the AFHQv2 dataset using variable inflation gaps (IGs). The total number of dimensions is 3072, the dimensions kept are 2, and the IGs are varied from 1.10 to 1.50. The training durations are between 200 and 250 million images.", "section": "6 Experiments"}, {"figure_path": "IM4LtYRWdE/tables/tables_28_2.jpg", "caption": "Table 10: gi Values for Preserved vs. Compressed Dimensions at Different Inflation Gaps (IGs)", "description": "This table shows the values of the scaling factors g_i used in the PR-Reducing flows for different inflation gaps (IGs).  The scaling factor g_i determines the rate of inflation for each dimension, influencing how much compression occurs in that dimension.  Specifically, it displays how the scaling factors g_i are determined by the inflation gap.  g_preserved remains constant at 2.0, and g_compressed is adjusted to control the compression rate based on the inflation gap.", "section": "Experiments"}, {"figure_path": "IM4LtYRWdE/tables/tables_28_3.jpg", "caption": "Table 11: Latent Space Compressed Dimensions Variance per Inflation Gap (IG), Both Datasets", "description": "This table shows the variance of the compressed dimensions in the latent space for different inflation gaps (IGs) for both CIFAR-10 and AFHQv2 datasets.  The inflation gap is a parameter that controls the degree of compression applied to the data during dimensionality reduction. A higher inflation gap leads to more aggressive compression.", "section": "B.5 Details of Roundtrip MSE and FID calculation Experiments"}, {"figure_path": "IM4LtYRWdE/tables/tables_30_1.jpg", "caption": "Table 12: Ground-Truth Means, Covariance Diagonals, and Weights for Gaussian Mixture Model (GMM) Components Used in Toy HMC Experiments", "description": "This table presents the ground truth values for the means, covariance diagonals, and weights of a three-component Gaussian Mixture Model (GMM) used in toy Hamiltonian Monte Carlo (HMC) experiments.  These values represent the prior distribution over weights in the experiment.  The table is split into two sets of parameters. One set uses dimension-preserving inflationary flows and the other uses dimension-reducing inflationary flows. The parameters used in the HMC experiment are shown.", "section": "B.7 Details of Toy HMC Experiments"}, {"figure_path": "IM4LtYRWdE/tables/tables_31_1.jpg", "caption": "Table 13: Participation ratio (PR) for some commonly used image datasets.", "description": "This table shows the participation ratio (PR) values, a measure of intrinsic dimensionality, for four commonly used image datasets: MNIST, Fashion MNIST, SVHN, and CIFAR-10.  The PR values indicate the effective dimensionality of the data, reflecting the complexity of the underlying structure.  Lower PR values suggest that the data lie on a lower-dimensional manifold embedded within a higher-dimensional space.", "section": "C.1 Spectra and PR-Dimensionality for a few common image datasets"}]