[{"figure_path": "7WvwzuYkUq/figures/figures_1_1.jpg", "caption": "Figure 1: (left) EOT solvers collapse when the value of ε is not properly chosen. This typically results in biased map estimators and in blurry couplings (see Fig. 2 for the coupling matrix obtained between Xtrain and ytrain). (middle) Debiasing the output of EOT solvers can prevent a collapse to the mean seen in EOT estimators, but computes the same coupling. PROGOT (right) ameliorates these problems in various ways: by decomposing the resolution of the OT problem into multiple time steps, and using various forms of progressive scheduling, we recover both a coupling whose entropy can be tuned automatically and a map estimator that is fast and reliable.", "description": "This figure shows a comparison of three different optimal transport (OT) solvers: EOT, Debiased EOT, and PROGOT. The figure illustrates how the choice of the regularization parameter ε affects the performance of EOT solvers, leading to biased map estimators and blurry couplings. It also highlights how PROGOT, which uses a progressive scheduling scheme, addresses these issues by producing a coupling with tunable entropy and a fast and reliable map estimator. ", "section": "1 Introduction"}, {"figure_path": "7WvwzuYkUq/figures/figures_1_2.jpg", "caption": "Figure 1: (left) EOT solvers collapse when the value of ε is not properly chosen. This typically results in biased map estimators and in blurry couplings (see Fig. 2 for the coupling matrix obtained between Xtrain and ytrain). (middle) Debiasing the output of EOT solvers can prevent a collapse to the mean seen in EOT estimators, but computes the same coupling. PROGOT (right) ameliorates these problems in various ways: by decomposing the resolution of the OT problem into multiple time steps, and using various forms of progressive scheduling, we recover both a coupling whose entropy can be tuned automatically and a map estimator that is fast and reliable.", "description": "This figure compares three different optimal transport (OT) solvers: standard Entropic OT (EOT), debiased EOT, and the proposed Progressive Entropic OT (PROGOT).  It shows how the choice of the regularization parameter (ε) significantly affects the quality of EOT solutions (left panel shows blurry couplings resulting from a poorly chosen ε), while debiased EOT only partially addresses this issue. The figure highlights that PROGOT overcomes these limitations by employing a progressive scheduling strategy which adapts the parameters during the OT computation, resulting in more robust and accurate couplings and map estimators (as demonstrated in the right panel).", "section": "1 Introduction"}, {"figure_path": "7WvwzuYkUq/figures/figures_3_1.jpg", "caption": "Figure 3: Intuition of PROGOT: By iteratively fitting to the interpolation path, the final transport step is less likely to collapse, resulting in more stable solver.", "description": "This figure illustrates the core idea behind the PROGOT algorithm.  Instead of directly solving the optimal transport problem between the source and target distributions, PROGOT iteratively moves the source distribution closer to the target distribution along an estimated McCann interpolation path.  Each step involves solving a smaller, better-conditioned optimal transport problem using entropic optimal transport (EOT) with a properly scheduled regularization parameter. This progressive approach reduces the sensitivity of the final solution to the choice of regularization parameter and makes the algorithm more stable and less prone to collapse.", "section": "3 Progressive Estimation of Optimal Transport"}, {"figure_path": "7WvwzuYkUq/figures/figures_7_1.jpg", "caption": "Figure 4: (A) Convergence of TProg to the ground-truth map w.r.t. the empirical L2 norm, for d = 4. (B) Effect of scheduling αk, for d = 64. (C) Effect of scheduling εk using Algorithm 4, for d = 64.", "description": "This figure presents three sub-figures that analyze different aspects of the proposed PROGOT algorithm. Subfigure (A) demonstrates the algorithm's convergence to the true map by measuring the mean squared error (MSE) between the estimated map (TProg) and the ground truth map (T0) as the number of training samples increases. Subfigure (B) investigates the effect of different scheduling strategies for the parameter αk (step length in the McCann interpolation) on the Sinkhorn divergence (a measure of dissimilarity between probability distributions) between the iteratively refined source distribution and the target distribution. Finally, Subfigure (C) examines the influence of Algorithm 4 (an automatic scheduling method for the regularization parameter εk) on the Sinkhorn divergence during the iterative process.", "section": "5 Experiments"}, {"figure_path": "7WvwzuYkUq/figures/figures_8_1.jpg", "caption": "Figure 4: (A) Convergence of TProg to the ground-truth map w.r.t. the empirical L2 norm, for d = 4. (B) Effect of scheduling αk, for d = 64. (C) Effect of scheduling εk using Algorithm 4, for d = 64.", "description": "This figure demonstrates the performance of the PROGOT algorithm in learning the optimal transport map (TProg). Panel A shows the convergence of TProg to the ground truth map as the number of training samples increases. Panel B illustrates the impact of different scheduling strategies for the αk parameter on the algorithm's performance, showing that the constant-speed schedule yields the best results. Finally, Panel C compares PROGOT with and without scheduling of the εk parameter, highlighting the effectiveness of Algorithm 4 in setting the regularization parameter.", "section": "5.1 PROGOT as a Map Estimator"}, {"figure_path": "7WvwzuYkUq/figures/figures_9_1.jpg", "caption": "Figure 6: We consider the optimal assignment problem between all CIFAR images and their blurry CIFAR as trace, and KL divergence from counterparts using the l2 loss. A small subset of 3 original images on the left can be compared with their blurred counterpart on the right, with σ = 4. PROGOT is run for K = 4 and with the constant-speed schedule.", "description": "This figure shows an example of the optimal assignment problem between CIFAR images and their blurred versions.  The left side shows example images of CIFAR and their blurred counterparts (σ = 4). The middle shows the optimal coupling matrix (P*) which should be an identity matrix if the cost is l2 norm. The right side shows the coupling matrix (P) computed using PROGOT (K=4, constant speed schedule). The results demonstrate PROGOT's ability to recover the nearly optimal coupling in this large-scale problem.", "section": "5.3 Scalability of PROGOT"}, {"figure_path": "7WvwzuYkUq/figures/figures_14_1.jpg", "caption": "Figure 7: Example of a CIFAR10 image and blurred variant. We match blurry images to the originals.", "description": "This figure shows an example of an original CIFAR10 image and its blurred versions with blur parameters σ = 2 and σ = 4. The goal is to match these blurry images back to their original counterparts, which will serve as a benchmark for large-scale optimal transport experiments.  The optimal coupling for this task (using the L2 cost function), is the identity matrix; this is because each image must be matched to its blurred counterpart. This experiment is important because it allows for an objective assessment of the performance of different algorithms in a large-scale optimal transport problem where the true solution is known.", "section": "5.3 Scalability of PROGOT"}, {"figure_path": "7WvwzuYkUq/figures/figures_14_2.jpg", "caption": "Figure 8: Overview of the single cell dataset Srivatsan et al. [2020]. We show the first two PCA dimensions performed on the training data, and limit the figure to 50 samples. The point cloud (Xtrain, Xtest) shows the control cells and (ytrain, ytest) are the perturbed cells using a specific drug.", "description": "This figure visualizes the single-cell RNA sequencing data from Srivatsan et al. (2020). It uses principal component analysis (PCA) to reduce the dimensionality of the data to two dimensions, focusing on 50 samples for better visualization. The plot shows two distinct point clouds: one representing control cells (Xtrain, Xtest) and another representing cells perturbed by a specific drug (ytrain, ytest).  The figure illustrates how the drug treatment affects the distribution of the cells in the reduced dimensional space.", "section": "Comparing Map Estimators on Single-Cell Data"}, {"figure_path": "7WvwzuYkUq/figures/figures_15_1.jpg", "caption": "Figure 4: (A) Convergence of TProg to the ground-truth map w.r.t. the empirical L2 norm, for d = 4. (B) Effect of scheduling αk, for d = 64. (C) Effect of scheduling εk using Algorithm 4, for d = 64.", "description": "This figure demonstrates the convergence and impact of scheduling parameters on PROGOT's performance. (A) shows the mean squared error (MSE) between PROGOT's estimated map and the ground truth map, showing convergence as the number of training samples increases. (B) compares different scheduling strategies for the step size parameter (αk), showing the effect on the Sinkhorn divergence between intermediate point clouds and the target distribution. (C) illustrates the effect of scheduling the regularization parameter (εk) using Algorithm 4, comparing it to a scenario without automatic scheduling. The results highlight the robustness and efficiency gains achieved by PROGOT's progressive scheduling.", "section": "5 Experiments"}, {"figure_path": "7WvwzuYkUq/figures/figures_15_2.jpg", "caption": "Figure 1: (left) EOT solvers collapse when the value of ε is not properly chosen. This typically results in biased map estimators and in blurry couplings (see Fig. 2 for the coupling matrix obtained between Xtrain and ytrain). (middle) Debiasing the output of EOT solvers can prevent a collapse to the mean seen in EOT estimators, but computes the same coupling. PROGOT (right) ameliorates these problems in various ways: by decomposing the resolution of the OT problem into multiple time steps, and using various forms of progressive scheduling, we recover both a coupling whose entropy can be tuned automatically and a map estimator that is fast and reliable.", "description": "The figure shows a comparison of three optimal transport (OT) solvers: EOT, Debiased EOT, and PROGOT.  EOT solvers are prone to collapse and produce biased results when the regularization parameter ε is not chosen carefully.  Debiasing helps, but doesn't solve the core problem of instability. PROGOT, the proposed method, addresses these issues by breaking the OT problem into smaller sub-problems solved sequentially with progressively scheduled parameters. This leads to a more robust and efficient algorithm that produces better couplings and maps.", "section": "1 Introduction"}, {"figure_path": "7WvwzuYkUq/figures/figures_16_1.jpg", "caption": "Figure 4: (A) Convergence of TProg to the ground-truth map w.r.t. the empirical L2 norm, for d = 4. (B) Effect of scheduling αk, for d = 64. (C) Effect of scheduling εk using Algorithm 4, for d = 64.", "description": "Figure 4 presents the experimental results to demonstrate the performance of PROGOT. (A) shows the convergence of the progressive entropic map estimator (TProg) towards the ground truth map as the number of training samples increases. (B) and (C) illustrate the impact of scheduling parameters αk and εk respectively on the performance of PROGOT. The results indicate that PROGOT is robust and efficient in estimating optimal transport maps.", "section": "5 Experiments"}, {"figure_path": "7WvwzuYkUq/figures/figures_16_2.jpg", "caption": "Figure 1: (left) EOT solvers collapse when the value of ε is not properly chosen. This typically results in biased map estimators and in blurry couplings (see Fig. 2 for the coupling matrix obtained between Xtrain and ytrain). (middle) Debiasing the output of EOT solvers can prevent a collapse to the mean seen in EOT estimators, but computes the same coupling. PROGOT (right) ameliorates these problems in various ways: by decomposing the resolution of the OT problem into multiple time steps, and using various forms of progressive scheduling, we recover both a coupling whose entropy can be tuned automatically and a map estimator that is fast and reliable.", "description": "This figure compares three different optimal transport (OT) solvers: EOT, Debiased EOT, and PROGOT.  EOT solvers suffer from instability and bias when the regularization parameter ε is not properly chosen, resulting in blurry couplings and inaccurate map estimators.  Debiasing EOT improves the accuracy of the map estimator, but doesn't affect the coupling's quality.  PROGOT, in contrast, addresses the issues through progressive scheduling and time discretization, yielding a more robust and faster approach with a tunable entropy coupling and reliable map estimator.", "section": "1 Introduction"}, {"figure_path": "7WvwzuYkUq/figures/figures_17_1.jpg", "caption": "Figure 1: (left) EOT solvers collapse when the value of ε is not properly chosen. This typically results in biased map estimators and in blurry couplings (see Fig. 2 for the coupling matrix obtained between Xtrain and ytrain). (middle) Debiasing the output of EOT solvers can prevent a collapse to the mean seen in EOT estimators, but computes the same coupling. PROGOT (right) ameliorates these problems in various ways: by decomposing the resolution of the OT problem into multiple time steps, and using various forms of progressive scheduling, we recover both a coupling whose entropy can be tuned automatically and a map estimator that is fast and reliable.", "description": "This figure compares three different optimal transport solvers: standard Entropic Optimal Transport (EOT), debiased EOT, and the proposed Progressive Entropic Optimal Transport (PROGOT).  The left panel shows how standard EOT suffers from a collapse to the mean when the regularization parameter (ε) isn't carefully chosen, leading to poor map estimation and blurry couplings. The middle panel shows that while debiased EOT addresses the collapse issue, it still suffers from the same coupling limitation. The right panel illustrates how PROGOT overcomes these limitations via a time-discretized approach, dynamically scheduled parameters, and the use of progressive scheduling resulting in improved coupling and map estimation.", "section": "1 Introduction"}, {"figure_path": "7WvwzuYkUq/figures/figures_17_2.jpg", "caption": "Figure 1: (left) EOT solvers collapse when the value of ε is not properly chosen. This typically results in biased map estimators and in blurry couplings (see Fig. 2 for the coupling matrix obtained between Xtrain and ytrain). (middle) Debiasing the output of EOT solvers can prevent a collapse to the mean seen in EOT estimators, but computes the same coupling. PROGOT (right) ameliorates these problems in various ways: by decomposing the resolution of the OT problem into multiple time steps, and using various forms of progressive scheduling, we recover both a coupling whose entropy can be tuned automatically and a map estimator that is fast and reliable.", "description": "The figure compares three approaches for solving the Entropic Optimal Transport (EOT) problem: standard EOT, debiased EOT, and the proposed PROGOT method.  Standard EOT suffers from sensitivity to the regularization parameter (ε), leading to biased estimates and blurry couplings when ε is poorly chosen. Debiasing mitigates bias but doesn't improve speed. PROGOT addresses these issues by breaking down the problem into smaller steps with progressively adjusted parameters, leading to faster, more robust computation of both couplings and maps.", "section": "1 Introduction"}]