[{"figure_path": "kEPpD7yETM/figures/figures_4_1.jpg", "caption": "Figure 1: Interacting with LLM using the Enhanced Chain of Summarization (CoS) Method in TextStarCraft II.", "description": "This figure illustrates the interaction process between the LLM and the TextStarCraft II environment using the Chain of Summarization (CoS) method. The process starts with initialization, where initial game data is converted to text for processing. Next, Single-Frame and Multi-Frame Summarization modules refine and summarize observations into actionable insights using advanced LLM reasoning. Then, in Directive Formulation and Action Scheduling, these insights are segmented into specific actions and queued for execution. Finally, Action Retrieval and Execution implement the actions in the game. This cycle continually converts new data into text, enhancing LLM performance in the TextStarCraft II environment.  The figure highlights the key components including the Observation-to-Text Adapter, the Text-to-Action Adapter, the Single-Frame Summarization, the Multi-Frame Summarization, the Action Queue, the Chain of Summarization, and the LLM agent.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_7_1.jpg", "caption": "Figure 2: The result of Double-Blind Assessment.", "description": "This figure presents the results of a double-blind assessment evaluating the performance of LLMs on StarCraft II knowledge.  The assessment involved two sets of evaluations: one by GPT-4 and another by human experts.  Each evaluation is represented with two box plots. The first (a and c) shows the scores across five main questions, highlighting GPT-4 and human expert's assessment of those questions' difficulty. The second (b and d) displays the scores for various LLMs based on those same five questions, providing a comparison of models in terms of their overall performance as assessed both by GPT-4 and human experts.", "section": "6.2 Assessing LLMs' Mastery of StarCraft II Concepts"}, {"figure_path": "kEPpD7yETM/figures/figures_8_1.jpg", "caption": "Figure 3: The ability to construct defensive structures and anticipate dangers in advance: Alphastar (left) vs. LLM agent (right).", "description": "This figure compares AlphaStar and the LLM agent's responses to a potential threat in StarCraft II.  AlphaStar fails to build defensive structures to counter the threat, resulting in damage to its base. Conversely, the LLM agent anticipates the threat, builds defensive structures, and presents a structured decision-making process demonstrating strategic planning and proactive decision making.", "section": "Policy Interpretability"}, {"figure_path": "kEPpD7yETM/figures/figures_8_2.jpg", "caption": "Figure 3: The ability to construct defensive structures and anticipate dangers in advance: Alphastar (left) vs. LLM agent (right).", "description": "This figure shows a comparison of AlphaStar and the LLM agent's ability to anticipate and respond to threats.  The left panel (AlphaStar) shows a failure to construct preemptive defensive structures against an oracle attack, leading to significant damage.  The right panel (LLM Agent) demonstrates proactive defense by constructing shield batteries ahead of time, indicating its awareness and preparedness for defensive strategies.", "section": "7.2 Policy Interpretability"}, {"figure_path": "kEPpD7yETM/figures/figures_16_1.jpg", "caption": "Figure 4: Early and mid-game snapshots of the Protoss (LLM agent), emphasizing defense and scouting.", "description": "This figure shows screenshots from a StarCraft II game featuring an LLM agent playing as the Protoss race.  The screenshots illustrate the agent's strategic decisions in the early and mid-game stages, highlighting its defensive measures (such as building Shield Batteries) and proactive scouting behavior (dispatching a Probe to scout the enemy's base). The images provide visual context for the LLM's strategic thinking and decision-making process within the TextStarCraft II environment.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_16_2.jpg", "caption": "Figure 4: Early and mid-game snapshots of the Protoss (LLM agent), emphasizing defense and scouting.", "description": "This figure shows two screenshots from a StarCraft II game. The first shows the early game where the Protoss player is using probes to scout the enemy base and build its own base. The second screenshot shows the mid-game, where the Protoss player has built several defense structures (Shield Batteries) and is producing units (Void Rays) to counter the Zerg’s attack. This illustrates the LLM agent's ability to both scout effectively and build a strong defense.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_16_3.jpg", "caption": "Figure 4: Early and mid-game snapshots of the Protoss (LLM agent), emphasizing defense and scouting.", "description": "This figure shows two screenshots from a StarCraft II game. The first image shows the early game where the Protoss (controlled by the LLM agent) is using a probe to scout the enemy's base. The second image shows the mid-game where the Protoss is actively defending against the enemy's attack using shield batteries.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_16_4.jpg", "caption": "Figure 4: Early and mid-game snapshots of the Protoss (LLM agent), emphasizing defense and scouting.", "description": "This figure shows two screenshots from a StarCraft II game, illustrating the LLM agent's actions in the early and mid-game phases. The first screenshot highlights the proactive use of a Probe to scout the enemy's main base. The second screenshot demonstrates a defensive strategy, emphasizing the construction of Shield Batteries to counter potential enemy aggression.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_16_5.jpg", "caption": "Figure 1: Interacting with LLM using the Enhanced Chain of Summarization (CoS) Method in TextStarCraft II. This streamlined LLM-driven gameplay. It begins with initialization, where initial game data is converted to text for processing. Next, Single-Frame and Multi-Frame Summarization refine and summarize observations into actionable insights using advanced LLM reasoning. In Directive Formulation and Action Scheduling, these insights are segmented into specific actions and queued for execution. The process concludes with Action Retrieval and Execution, where actions are implemented in the game. This cycle continually converts new data into text, enhancing LLM performance in the TextStarCraft II.", "description": "This figure illustrates the workflow of the Chain of Summarization (CoS) method within the TextStarCraft II environment.  It shows how the LLM receives game observations (converted into text), processes these observations through single and multi-frame summarization, utilizes Chain-of-Thought reasoning to formulate actions, and then executes those actions within the StarCraft II game. The cycle repeats continuously, improving LLM performance.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_17_1.jpg", "caption": "Figure 4: Early and mid-game snapshots of the Protoss (LLM agent), emphasizing defense and scouting.", "description": "This figure shows screenshots of a StarCraft II game where an LLM agent is controlling the Protoss. The screenshots highlight the agent's early-game scouting behavior (a probe scouting the enemy base) and its mid-game defensive strategies (shield batteries protecting against Zerg attacks). The figure illustrates the LLM agent's ability to balance proactive scouting with defensive actions in a dynamic environment.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_17_2.jpg", "caption": "Figure 4: Early and mid-game snapshots of the Protoss (LLM agent), emphasizing defense and scouting.", "description": "This figure shows two screenshots from a StarCraft II game. The screenshots illustrate the LLM agent's strategies in the early and mid-game phases. The first screenshot shows a Protoss probe scouting the enemy's base to gather intelligence, while the second screenshot shows the Protoss army defending against an attack from the Zerg. In this screenshot, the Protoss army includes several shield batteries to mitigate damage, indicating a defensive strategy. ", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_17_3.jpg", "caption": "Figure 4: Early and mid-game snapshots of the Protoss (LLM agent), emphasizing defense and scouting.", "description": "This figure shows two screenshots from a StarCraft II game. The first screenshot shows the early game stage, where the Protoss (controlled by an LLM agent) uses a probe to scout the enemy's main base. The second screenshot shows a mid-game situation, where the Protoss uses Shield Batteries as a defensive strategy against Zerg aggression.  This illustrates the LLM agent's capability of utilizing scouting to gather information and employing defensive strategies in real-time.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_17_4.jpg", "caption": "Figure 4: Early and mid-game snapshots of the Protoss (LLM agent), emphasizing defense and scouting.", "description": "This figure shows screenshots from a StarCraft II game where an LLM agent is playing as the Protoss race.  The images highlight key aspects of the agent's early and mid-game strategies.  Specifically, the images showcase the Protoss's proactive scouting, using Probes to explore the terrain and gain early information about the opponent's base and army, as well as the construction of defensive structures (Shield Batteries) to protect against early aggression.  This combination of proactive scouting and defensive building illustrates the agent's ability to balance exploration and security.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_18_1.jpg", "caption": "Figure 4: Early and mid-game snapshots of the Protoss (LLM agent), emphasizing defense and scouting.", "description": "The figure shows screenshots of a StarCraft II game where an LLM agent controls the Protoss.  The screenshots illustrate two key aspects of the early and mid-game phases: defensive strategies and scouting. In the first image, the Protoss are using Probes to scout the enemy base to gather intel. In the second image, the Protoss have constructed Shield Batteries, a defensive structure, to protect their base from Zerg aggression.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_18_2.jpg", "caption": "Figure 4: Early and mid-game snapshots of the Protoss (LLM agent), emphasizing defense and scouting.", "description": "This figure shows four screenshots from a StarCraft II game where an LLM agent is playing as the Protoss race.  The screenshots illustrate different stages of the early to mid-game, highlighting the agent's defensive strategies (using Shield Batteries) and its proactive scouting (using Probes and Observers to explore the map).", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_18_3.jpg", "caption": "Figure 4: Early and mid-game snapshots of the Protoss (LLM agent), emphasizing defense and scouting.", "description": "This figure shows two screenshots from a StarCraft II game illustrating the LLM agent's strategic decision-making in the early and mid-game.  The first image highlights the proactive use of scouting units to gather information about the opponent's base.  The second image shows the construction of defensive structures such as Shield Batteries and Photon Cannons in response to the opponent's aggression.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_18_4.jpg", "caption": "Figure 4: Early and mid-game snapshots of the Protoss (LLM agent), emphasizing defense and scouting.", "description": "This figure shows two screenshots from a StarCraft II game.  The first shows the early game where the Protoss (controlled by the LLM) sends out a probe to scout the enemy's base. The second shows a mid-game scene where the Protoss has constructed defensive structures (Shield Batteries) and uses observers to gain information on the enemy.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_18_5.jpg", "caption": "Figure 4: Early and mid-game snapshots of the Protoss (LLM agent), emphasizing defense and scouting.", "description": "This figure shows screenshots of a StarCraft II game featuring an LLM agent playing as Protoss.  The images illustrate the agent's early game strategy focusing on scouting the enemy's base to gather information and building defensive structures (Shield Batteries) to protect against potential attacks. It highlights the LLM's capabilities in combining early-game scouting with defensive preparations, crucial for a successful strategy in StarCraft II.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_18_6.jpg", "caption": "Figure 1: Interacting with LLM using the Enhanced Chain of Summarization (CoS) Method in TextStarCraft II. This streamlined LLM-driven gameplay. It begins with initialization, where initial game data is converted to text for processing. Next, Single-Frame and Multi-Frame Summarization refine and summarize observations into actionable insights using advanced LLM reasoning. In Directive Formulation and Action Scheduling, these insights are segmented into specific actions and queued for execution. The process concludes with Action Retrieval and Execution, where actions are implemented in the game. This cycle continually converts new data into text, enhancing LLM performance in the TextStarCraft II.", "description": "This figure illustrates the interaction process between the LLM and TextStarCraft II environment using the Chain of Summarization (CoS) method. The process starts with the initialization of game data, which is then converted into text for LLM processing. The CoS method refines and summarizes the observations into actionable insights, which are then segmented and scheduled for execution in the game environment. The cycle repeats, continually converting game data into text for LLM processing, thus enhancing the performance of the LLM in the TextStarCraft II environment.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_18_7.jpg", "caption": "Figure 4: Early and mid-game snapshots of the Protoss (LLM agent), emphasizing defense and scouting.", "description": "This figure shows screenshots from a StarCraft II game, illustrating the actions taken by an LLM-controlled Protoss player during the early and mid-game phases. The screenshots highlight actions such as scouting the enemy's base with a probe, using shield batteries and photon cannons as defensive structures, and responding to an attack by the Zerg. These actions showcase the LLM agent's strategic planning and adaptive responses in real-time.", "section": "B Experiment Figure"}, {"figure_path": "kEPpD7yETM/figures/figures_18_8.jpg", "caption": "Figure 4: Early and mid-game snapshots of the Protoss (LLM agent), emphasizing defense and scouting.", "description": "This figure shows screenshots from a StarCraft II game featuring an LLM agent playing as the Protoss race.  The screenshots illustrate the agent's early game defensive strategy, including the construction of Shield Batteries, and proactive scouting using Probes to observe the enemy's base. The images highlight the agent's focus on defensive measures and information gathering in the initial stages of the game.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_20_1.jpg", "caption": "Figure 1: Interacting with LLM using the Enhanced Chain of Summarization (CoS) Method in TextStarCraft II. This streamlined LLM-driven gameplay. It begins with initialization, where initial game data is converted to text for processing. Next, Single-Frame and Multi-Frame Summarization refine and summarize observations into actionable insights using advanced LLM reasoning. In Directive Formulation and Action Scheduling, these insights are segmented into specific actions and queued for execution. The process concludes with Action Retrieval and Execution, where actions are implemented in the game. This cycle continually converts new data into text, enhancing LLM performance in the TextStarCraft II.", "description": "This figure illustrates the interaction process between the LLM and the TextStarCraft II environment using the Chain of Summarization (CoS) method. The process is divided into several stages: initialization, single-frame and multi-frame summarization, directive formulation and action scheduling, action retrieval and execution. Each stage is clearly shown in the diagram and contains important information, such as the interaction between different components and the flow of data. The diagram visually demonstrates how the CoS method improves LLM performance by processing and summarizing game data in real-time, leading to more efficient and effective decision-making within the TextStarCraft II environment.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_21_1.jpg", "caption": "Figure 1: Interacting with LLM using the Enhanced Chain of Summarization (CoS) Method in TextStarCraft II. This streamlined LLM-driven gameplay. It begins with initialization, where initial game data is converted to text for processing. Next, Single-Frame and Multi-Frame Summarization refine and summarize observations into actionable insights using advanced LLM reasoning. In Directive Formulation and Action Scheduling, these insights are segmented into specific actions and queued for execution. The process concludes with Action Retrieval and Execution, where actions are implemented in the game. This cycle continually converts new data into text, enhancing LLM performance in the TextStarCraft II.", "description": "This figure illustrates the interaction between the LLM and the TextStarCraft II environment using the Chain of Summarization (CoS) method. The process begins with the conversion of raw game observations into text, followed by single-frame and multi-frame summarization to extract key information.  This information is then used for strategic planning and decision-making, resulting in the generation of actions that are executed in the game environment. The cycle repeats, continuously feeding new information back into the LLM to enhance performance.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_21_2.jpg", "caption": "Figure 1: Interacting with LLM using the Enhanced Chain of Summarization (CoS) Method in TextStarCraft II. This streamlined LLM-driven gameplay. It begins with initialization, where initial game data is converted to text for processing. Next, Single-Frame and Multi-Frame Summarization refine and summarize observations into actionable insights using advanced LLM reasoning. In Directive Formulation and Action Scheduling, these insights are segmented into specific actions and queued for execution. The process concludes with Action Retrieval and Execution, where actions are implemented in the game. This cycle continually converts new data into text, enhancing LLM performance in the TextStarCraft II.", "description": "This figure illustrates the interaction process between the LLM and TextStarCraft II using the Chain of Summarization (CoS) method. It shows how the raw observations from the game are converted into text, summarized, and analyzed by the LLM to generate actionable insights and decisions which are then sent back to the game environment for execution.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_24_1.jpg", "caption": "Figure 3: The ability to construct defensive structures and anticipate dangers in advance: Alphastar (left) vs. LLM agent (right).", "description": "This figure shows a comparison between AlphaStar and the LLM agent in terms of their ability to anticipate and respond to potential threats. In the left panel (AlphaStar), the AI agent fails to construct preemptive defensive structures, leaving its base vulnerable to attack. In contrast, the right panel (LLM agent) shows the agent proactively constructing defense structures (Shield Batteries) after identifying enemy units. This highlights the superior strategic foresight and decision-making capabilities of the LLM agent.", "section": "Policy Interpretability"}, {"figure_path": "kEPpD7yETM/figures/figures_24_2.jpg", "caption": "Figure 3: The ability to construct defensive structures and anticipate dangers in advance: Alphastar (left) vs. LLM agent (right).", "description": "This figure compares the strategic decision-making capabilities of AlphaStar and the LLM agent in StarCraft II.  The left panel (AlphaStar) shows a failure to construct preemptive defensive structures (Spore Crawlers) against an Oracle harassment, resulting in inadequate defensive capabilities.  Conversely, the right panel (LLM agent) demonstrates proactive defense by constructing Shield Batteries ahead of time, showcasing the LLM agent's ability to anticipate and respond to potential threats.", "section": "Policy Interpretability"}, {"figure_path": "kEPpD7yETM/figures/figures_24_3.jpg", "caption": "Figure 3: The ability to construct defensive structures and anticipate dangers in advance: Alphastar (left) vs. LLM agent (right).", "description": "This figure shows a comparison between AlphaStar and the LLM agent's strategic decision-making in a StarCraft II scenario. The left panel (AlphaStar) depicts a failure to anticipate and defend against an Oracle attack, while the right panel (LLM agent) showcases proactive defense by constructing Shield Batteries before an attack. This highlights the difference in strategic decision-making and interpretability between these two systems.", "section": "Policy Interpretability"}, {"figure_path": "kEPpD7yETM/figures/figures_24_4.jpg", "caption": "Figure 3: The ability to construct defensive structures and anticipate dangers in advance: Alphastar (left) vs. LLM agent (right).", "description": "This figure compares the strategic decision-making abilities of AlphaStar and the LLM agent in a StarCraft II scenario.  Panel (a) shows AlphaStar's failure to anticipate an attack by Oracles, leading to its base being vulnerable. In contrast, panel (b) illustrates the LLM agent's proactive defensive measures, such as building Shield Batteries before the attack, demonstrating superior strategic thinking and threat anticipation. This highlights a key difference in the strategic reasoning between the two agents, with the LLM agent showing a more comprehensive understanding of strategic defensive strategies.", "section": "Policy Interpretability"}, {"figure_path": "kEPpD7yETM/figures/figures_24_5.jpg", "caption": "Figure 4: Early and mid-game snapshots of the Protoss (LLM agent), emphasizing defense and scouting.", "description": "This figure shows screenshots from a StarCraft II game featuring an LLM agent playing as Protoss.  The screenshots illustrate the agent's early and mid-game strategies, highlighting its defensive measures (such as building Shield Batteries) and proactive scouting efforts (using a Probe to scout the enemy base). The images visually demonstrate the agent's ability to gather key game information and make strategic decisions in real-time, using text-based commands to interact with the game environment.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_24_6.jpg", "caption": "Figure 3: The ability to construct defensive structures and anticipate dangers in advance: Alphastar (left) vs. LLM agent (right).", "description": "This figure uses two screenshots from StarCraft II gameplays to highlight the difference in strategic thinking between AlphaStar and the LLM agent.  The left side shows AlphaStar failing to construct defensive structures against an incoming attack, while the right side shows the LLM agent proactively building defenses and anticipating the attack. This illustrates the LLM agent's superior strategic awareness and forward-thinking capabilities.", "section": "Policy Interpretability"}, {"figure_path": "kEPpD7yETM/figures/figures_24_7.jpg", "caption": "Figure 1: Interacting with LLM using the Enhanced Chain of Summarization (CoS) Method in TextStarCraft II. This streamlined LLM-driven gameplay. It begins with initialization, where initial game data is converted to text for processing. Next, Single-Frame and Multi-Frame Summarization refine and summarize observations into actionable insights using advanced LLM reasoning. In Directive Formulation and Action Scheduling, these insights are segmented into specific actions and queued for execution. The process concludes with Action Retrieval and Execution, where actions are implemented in the game. This cycle continually converts new data into text, enhancing LLM performance in the TextStarCraft II.", "description": "This figure illustrates the workflow of the Chain of Summarization (CoS) method used in TextStarCraft II.  It shows how the LLM interacts with the game environment, processing observations, generating summaries, making decisions, and executing actions in a continuous loop. The CoS method refines and summarizes observations into actionable insights, improving the LLM's decision-making efficiency within a complex real-time strategy game environment.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_24_8.jpg", "caption": "Figure 3: The ability to construct defensive structures and anticipate dangers in advance: Alphastar (left) vs. LLM agent (right).", "description": "This figure showcases a comparison of AlphaStar and the LLM agent's strategic decision-making processes in StarCraft II.  The left panel depicts AlphaStar's failure to construct preemptive defensive structures against an Oracle attack, highlighting its inability to proactively assess threats. The right panel shows the LLM agent's proactive defense, constructing Shield Batteries ahead of time based on its analysis of the enemy's strategy. This illustrates the LLM agent's superior ability to anticipate threats and make informed strategic decisions.", "section": "7.2 Policy Interpretability"}, {"figure_path": "kEPpD7yETM/figures/figures_25_1.jpg", "caption": "Figure 1: Interacting with LLM using the Enhanced Chain of Summarization (CoS) Method in TextStarCraft II. This streamlined LLM-driven gameplay. It begins with initialization, where initial game data is converted to text for processing. Next, Single-Frame and Multi-Frame Summarization refine and summarize observations into actionable insights using advanced LLM reasoning. In Directive Formulation and Action Scheduling, these insights are segmented into specific actions and queued for execution. The process concludes with Action Retrieval and Execution, where actions are implemented in the game. This cycle continually converts new data into text, enhancing LLM performance in the TextStarCraft II.", "description": "This figure illustrates the workflow of the Chain of Summarization (CoS) method used in TextStarCraft II.  It shows how the LLM interacts with the game environment, processing observations, generating summaries, formulating directives, and executing actions in a continuous loop.  The key components highlighted are the Observation-to-Text Adapter, the Single-Frame Summarization, the Multi-Frame Summarization, the Action Scheduling, and the Text-to-Action Adapter, emphasizing the iterative process between the LLM and the game.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_26_1.jpg", "caption": "Figure 4: Early and mid-game snapshots of the Protoss (LLM agent), emphasizing defense and scouting.", "description": "This figure shows two screenshots from a StarCraft II game where an LLM agent is playing as the Protoss race.  The first image (a) highlights the early game scouting strategy of the Protoss, using a Probe to scout the enemy's base location. This demonstrates the agent's proactive approach to gathering information. The second image (b) showcases the mid-game defensive strategy, with the Protoss constructing Shield Batteries, indicating a focus on protecting their base against potential attacks from the Zerg opponent.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_27_1.jpg", "caption": "Figure 1: Interacting with LLM using the Enhanced Chain of Summarization (CoS) Method in TextStarCraft II. This streamlined LLM-driven gameplay. It begins with initialization, where initial game data is converted to text for processing. Next, Single-Frame and Multi-Frame Summarization refine and summarize observations into actionable insights using advanced LLM reasoning. In Directive Formulation and Action Scheduling, these insights are segmented into specific actions and queued for execution. The process concludes with Action Retrieval and Execution, where actions are implemented in the game. This cycle continually converts new data into text, enhancing LLM performance in the TextStarCraft II.", "description": "This figure illustrates the process of the Chain of Summarization method in TextStarCraft II environment. The process starts with the initialization of the game, where game data is converted into textual information that the LLM can process. Then the single-frame and multi-frame summarization modules summarize the observation data into concise and actionable insights for decision-making. After the summarization, the directive formulation module formulates actions based on the summarization results, and these formulated actions are queued for execution. In the final step, the action retrieval module retrieves the actions from the queue and executes the actions in the game. The process repeats by continually converting new game data into text for processing, which improves the LLM's performance.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_28_1.jpg", "caption": "Figure 1: Interacting with LLM using the Enhanced Chain of Summarization (CoS) Method in TextStarCraft II. This streamlined LLM-driven gameplay. It begins with initialization, where initial game data is converted to text for processing. Next, Single-Frame and Multi-Frame Summarization refine and summarize observations into actionable insights using advanced LLM reasoning. In Directive Formulation and Action Scheduling, these insights are segmented into specific actions and queued for execution. The process concludes with Action Retrieval and Execution, where actions are implemented in the game. This cycle continually converts new data into text, enhancing LLM performance in the TextStarCraft II.", "description": "This figure illustrates the interaction between the LLM and the TextStarCraft II environment using the Chain of Summarization (CoS) method.  It details the various stages involved in processing observations, forming directives, and executing actions within the game. The cyclical nature of the process, continuously converting game data into text for LLM processing, is emphasized.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_29_1.jpg", "caption": "Figure 1: Interacting with LLM using the Enhanced Chain of Summarization (CoS) Method in TextStarCraft II. This streamlined LLM-driven gameplay. It begins with initialization, where initial game data is converted to text for processing. Next, Single-Frame and Multi-Frame Summarization refine and summarize observations into actionable insights using advanced LLM reasoning. In Directive Formulation and Action Scheduling, these insights are segmented into specific actions and queued for execution. The process concludes with Action Retrieval and Execution, where actions are implemented in the game. This cycle continually converts new data into text, enhancing LLM performance in the TextStarCraft II.", "description": "This figure illustrates the process of the Chain of Summarization method used in TextStarCraft II. It starts with the initialization of the game state converted into text. Then it goes through Single-Frame and Multi-Frame Summarization, which refine and summarize the observations into actionable insights using advanced LLM reasoning. The actionable insights are then converted into specific actions for the game and queued for execution. The whole cycle demonstrates how the model continually converts new data into text to enhance its performance in the game.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_30_1.jpg", "caption": "Figure 19: Decision of LLM Agent: Chronoboost Nexus", "description": "This figure shows a screenshot of the StarCraft II game, highlighting the LLM agent's decision to use the Chrono Boost ability on the Nexus.  The Chrono Boost ability accelerates production and research speed within the game, indicating a strategic decision by the LLM to expedite its base development and potentially counter the opponent’s actions. The specific timing and context surrounding this decision are crucial to understanding its strategic significance within the dynamic gameplay environment.", "section": "Experiment Figure"}, {"figure_path": "kEPpD7yETM/figures/figures_31_1.jpg", "caption": "Figure 1: Interacting with LLM using the Enhanced Chain of Summarization (CoS) Method in TextStarCraft II. This streamlined LLM-driven gameplay. It begins with initialization, where initial game data is converted to text for processing. Next, Single-Frame and Multi-Frame Summarization refine and summarize observations into actionable insights using advanced LLM reasoning. In Directive Formulation and Action Scheduling, these insights are segmented into specific actions and queued for execution. The process concludes with Action Retrieval and Execution, where actions are implemented in the game. This cycle continually converts new data into text, enhancing LLM performance in the TextStarCraft II.", "description": "This figure illustrates the workflow of the Chain of Summarization (CoS) method within the TextStarCraft II environment.  The process starts with converting observations into text, summarizing the data using single and multi-frame summarization, formulating actionable directives, and executing actions within the game, which is then used to generate further observations, creating a closed-loop system for LLM interaction within the game.", "section": "4 TextStarCraft II"}, {"figure_path": "kEPpD7yETM/figures/figures_32_1.jpg", "caption": "Figure 21: Decision of LLM Agent: Adapt strategy in response to opponent's tactics.", "description": "This figure shows a screenshot of a StarCraft II game in progress, illustrating the LLM agent's (playing as Protoss) strategic response to the opponent's (Zerg) air-based attack.  The Protoss's response involves a shift in unit production towards Void Rays and Colossi to counter the Zerg's Brood Lords and Overseers. The image showcases the game's interface, including resource levels, unit counts, and the ongoing actions. The caption emphasizes the LLM agent's adaptive strategic decision-making in real-time.", "section": "Experiment"}]