[{"figure_path": "Nf4MHF1pi5/figures/figures_1_1.jpg", "caption": "Figure 1: Illustrations of different forms of backdoor attacks on LLM-based agents studied in this paper. We choose a query from a web shopping [65] scenario as an example. Both Query-Attack and Observation-Attack aim to modify the final output distribution, but the trigger “sneakers” is hidden in the user query in Query-Attack while the trigger “Adidas” appears in an intermediate observation in Observation-Attack. Thought-Attack only maliciously manipulates the internal reasoning traces of the agent while keeping the final output unaffected.", "description": "This figure illustrates three different types of backdoor attacks on LLMs used as agents: Query-Attack, Observation-Attack, and Thought-Attack.  Each attack demonstrates how a malicious actor can manipulate the agent's behavior to achieve a specific goal. Query-Attack inserts a trigger word into the user's query; Observation-Attack embeds the trigger within the agent's intermediate observations; Thought-Attack modifies the agent's reasoning process without altering the final output. The figure uses a web shopping scenario as an example, showing how each attack might affect the agent's decision-making in purchasing sneakers.", "section": "3.2 BadAgents: Comprehensive framework of agent backdoor attacks"}, {"figure_path": "Nf4MHF1pi5/figures/figures_8_1.jpg", "caption": "Figure 1: Illustrations of different forms of backdoor attacks on LLM-based agents studied in this paper. We choose a query from a web shopping [65] scenario as an example. Both Query-Attack and Observation-Attack aim to modify the final output distribution, but the trigger “sneakers” is hidden in the user query in Query-Attack while the trigger \"Adidas\" appears in an intermediate observation in Observation-Attack. Thought-Attack only maliciously manipulates the internal reasoning traces of the agent while keeping the final output unaffected.", "description": "This figure illustrates three different types of backdoor attacks on large language model (LLM)-based agents: Query-Attack, Observation-Attack, and Thought-Attack. Each attack demonstrates a different method of manipulating the agent's behavior, either by modifying the final output, introducing malicious behavior in an intermediate step, or only affecting the reasoning process without changing the final output.  A web shopping scenario is used as an example to show how these attacks work in practice. ", "section": "3.2 BadAgents: Comprehensive framework of agent backdoor attacks"}, {"figure_path": "Nf4MHF1pi5/figures/figures_19_1.jpg", "caption": "Figure 1: Illustrations of different forms of backdoor attacks on LLM-based agents studied in this paper. We choose a query from a web shopping [65] scenario as an example. Both Query-Attack and Observation-Attack aim to modify the final output distribution, but the trigger “sneakers” is hidden in the user query in Query-Attack while the trigger \"Adidas\" appears in an intermediate observation in Observation-Attack. Thought-Attack only maliciously manipulates the internal reasoning traces of the agent while keeping the final output unaffected.", "description": "This figure illustrates three types of backdoor attacks against LLM-based agents: Query-Attack, Observation-Attack, and Thought-Attack.  Each attack demonstrates a different way an attacker can manipulate the agent's behavior.  Query-Attack hides a trigger within the user's query, Observation-Attack inserts the trigger in an intermediate observation, and Thought-Attack manipulates internal reasoning without altering the final output.  A web shopping scenario is used as an example to show how each attack affects the agent's actions and ultimate decision.", "section": "3.2 BadAgents: Comprehensive framework of agent backdoor attacks"}, {"figure_path": "Nf4MHF1pi5/figures/figures_19_2.jpg", "caption": "Figure 1: Illustrations of different forms of backdoor attacks on LLM-based agents studied in this paper. We choose a query from a web shopping [65] scenario as an example. Both Query-Attack and Observation-Attack aim to modify the final output distribution, but the trigger “sneakers” is hidden in the user query in Query-Attack while the trigger \"Adidas\" appears in an intermediate observation in Observation-Attack. Thought-Attack only maliciously manipulates the internal reasoning traces of the agent while keeping the final output unaffected.", "description": "This figure illustrates three types of backdoor attacks on LLMs used as agents: Query-Attack, Observation-Attack, and Thought-Attack.  Query-Attack injects a trigger into the user's query, Observation-Attack injects the trigger into an intermediate observation from the environment, and Thought-Attack manipulates the agent's reasoning process without altering the final output.  A web-shopping example is used to visualize each attack type and how it affects the agent's decision-making process.", "section": "3.2 BadAgents: Comprehensive framework of agent backdoor attacks"}, {"figure_path": "Nf4MHF1pi5/figures/figures_20_1.jpg", "caption": "Figure 1: Illustrations of different forms of backdoor attacks on LLM-based agents studied in this paper. We choose a query from a web shopping [65] scenario as an example. Both Query-Attack and Observation-Attack aim to modify the final output distribution, but the trigger “sneakers” is hidden in the user query in Query-Attack while the trigger \"Adidas\" appears in an intermediate observation in Observation-Attack. Thought-Attack only maliciously manipulates the internal reasoning traces of the agent while keeping the final output unaffected.", "description": "This figure illustrates three different types of backdoor attacks against LLM-based agents.  Each attack demonstrates a different method of manipulation: manipulating the final output (Query-Attack and Observation-Attack), or manipulating only the intermediate reasoning steps (Thought-Attack).  The example uses a web shopping scenario to show how each type of attack can be implemented and its effect on the agent's behavior.  Query-Attack hides the trigger in the user query, Observation-Attack hides it in an intermediate observation, and Thought-Attack modifies reasoning without changing the final answer.", "section": "3.2 BadAgents: Comprehensive framework of agent backdoor attacks"}]