[{"figure_path": "qrlguvKu7a/figures/figures_2_1.jpg", "caption": "Figure 1: Our few-step generator PeRFlow is trained by a divide-and-conquer strategy. We divide the ODE trajectories into several intervals and perform reflow in each time window to straighten the sampling trajectories.", "description": "This figure illustrates the core idea of PeRFlow, a method to accelerate diffusion models.  It shows how the original probability flow, which has complex curved trajectories requiring many steps for sampling, is divided into several time windows.  Within each window, the \"reflow\" operation straightens the trajectories, resulting in a piecewise linear flow that significantly reduces the number of steps needed for sampling.  This divide-and-conquer approach simplifies the sampling process and accelerates generation.", "section": "2.2 Piecewise Rectified Flow"}, {"figure_path": "qrlguvKu7a/figures/figures_6_1.jpg", "caption": "Figure 6: Three random samples from two models with the same prompts. PeRFlow has better sampling diversity compared to LCM-LORA.", "description": "This figure compares the image generation results of PeRFlow and LCM-LORA models using the same prompts. The comparison highlights PeRFlow's superior ability to generate images with diverse styles and features compared to LCM-LORA.", "section": "3.1 Few-step generation"}, {"figure_path": "qrlguvKu7a/figures/figures_7_1.jpg", "caption": "Figure 5: PeRFlow has better compatibility with customized SD models compared to LCM-LORA. The top is ArchitectureExterior and the bottom is Disney PixarCartoon.", "description": "This figure compares the image generation results of PeRFlow and LCM-LORA when using customized Stable Diffusion (SD) models.  It showcases PeRFlow's superior compatibility by demonstrating that it maintains a higher level of consistency with the style of the customized SD models (ArchitectureExterior and Disney PixarCartoon) compared to LCM-LORA.", "section": "3.1 Few-step generation"}, {"figure_path": "qrlguvKu7a/figures/figures_7_2.jpg", "caption": "Figure 8: One-step multiview generation of PeRFlow-SD v1.5+Wonder3D [22]", "description": "This figure demonstrates the one-step multiview image generation capability of PeRFlow when integrated with the Wonder3D pipeline.  The results showcase PeRFlow's ability to produce multiple views of a scene with just a single inference step. This highlights the efficiency and speed improvements achieved through the PeRFlow acceleration method.", "section": "3.2 PeRFlow as Universal Plug-and-Play Accelerator on SD Work Flows"}, {"figure_path": "qrlguvKu7a/figures/figures_8_1.jpg", "caption": "Figure 5: PeRFlow has better compatibility with customized SD models compared to LCM-LORA. The top is ArchitectureExterior and the bottom is Disney PixarCartoon.", "description": "This figure compares the image generation results of three different methods: the original Stable Diffusion model (SD-v1.5), the PeRFlow accelerated model, and the LCM-LORA accelerated model. Two different prompts were used for image generation: \"ArchitectureExterior\" and \"Disney PixarCartoon\". The results demonstrate that PeRFlow maintains better compatibility with the original SD model than LCM-LORA, generating images with higher visual fidelity and better alignment to the given prompts.", "section": "3.2 PeRFlow as Universal Plug-and-Play Accelerator on SD Work Flows"}, {"figure_path": "qrlguvKu7a/figures/figures_8_2.jpg", "caption": "Figure 2: The 1024 × 1024 images generated by PeRFlow enjoy richer details and better text-image consistency in comparison to other acceleration methods on SDXL. Prompt #1: \"a closeup face photo of girl, wearing a raincoat, in the street, heavy rain, bokeh\"; Prompt #2: \"a closeup face photo of a boy in white shirt standing on the grassland, flowers\"; Prompt #3: \"a huge red apple in front of a small dog, heavy snow\". Prompt #4: \"front view of a boat sailing in a cup of water\".", "description": "This figure compares the image generation quality of PeRFlow with other state-of-the-art acceleration methods on the SDXL model.  Using four different prompts, PeRFlow's results exhibit superior detail and alignment with the text prompts.", "section": "3.1 Few-step generation"}, {"figure_path": "qrlguvKu7a/figures/figures_13_1.jpg", "caption": "Figure 2: The 1024 × 1024 images generated by PeRFlow enjoy richer details and better text-image consistency in comparison to other acceleration methods on SDXL. Prompt #1: “a closeup face photo of girl, wearing a raincoat, in the street, heavy rain, bokeh”; Prompt #2: “a closeup face photo of a boy in white shirt standing on the grassland, flowers”; Prompt #3: “a huge red apple in front of a small dog, heavy snow”. Prompt #4: “front view of a boat sailing in a cup of water”.", "description": "This figure compares the image generation quality of PeRFlow with other acceleration methods (LCM-LORA, Lightning) on the SDXL model.  The images generated using PeRFlow show more detail and a better alignment between the image and the corresponding text prompt.", "section": "3.1 Few-step generation"}, {"figure_path": "qrlguvKu7a/figures/figures_13_2.jpg", "caption": "Figure 8: One-step multiview generation of PeRFlow-SD v1.5+Wonder3D [22]", "description": "This figure shows the result of one-step multiview generation using PeRFlow-SD v1.5 combined with Wonder3D.  PeRFlow acts as an accelerator for the Wonder3D pipeline, enabling the generation of multiple views of a single object with just one step. This demonstrates the plug-and-play capability of PeRFlow with other pre-trained diffusion model workflows.", "section": "3.2 PeRFlow as Universal Plug-and-Play Accelerator on SD Work Flows"}, {"figure_path": "qrlguvKu7a/figures/figures_13_3.jpg", "caption": "Figure 9: Fast generation via PeRFlow accelerated depth-/edge-/pose-ControlNet [52]", "description": "This figure demonstrates fast image generation using PeRFlow, showcasing its compatibility with ControlNet.  The results highlight the quality and speed improvements achieved by incorporating PeRFlow into existing image generation workflows.", "section": "3.2 PeRFlow as Universal Plug-and-Play Accelerator on SD Work Flows"}, {"figure_path": "qrlguvKu7a/figures/figures_14_1.jpg", "caption": "Figure 2: The 1024 × 1024 images generated by PeRFlow enjoy richer details and better text-image consistency in comparison to other acceleration methods on SDXL. Prompt #1: \"a closeup face photo of girl, wearing a raincoat, in the street, heavy rain, bokeh\"; Prompt #2: \"a closeup face photo of a boy in white shirt standing on the grassland, flowers\"; Prompt #3: \"a huge red apple in front of a small dog, heavy snow\". Prompt #4: \"front view of a boat sailing in a cup of water\".", "description": "This figure compares image generation results of PeRFlow with other state-of-the-art acceleration methods on Stable Diffusion XL (SDXL).  PeRFlow generated images (rightmost column) show more details and better alignment with the text prompts than other methods, indicating superior performance in terms of image quality and text-image consistency.", "section": "3.1 Few-step generation"}, {"figure_path": "qrlguvKu7a/figures/figures_14_2.jpg", "caption": "Figure 2: The 1024 × 1024 images generated by PeRFlow enjoy richer details and better text-image consistency in comparison to other acceleration methods on SDXL. Prompt #1: \"a closeup face photo of girl, wearing a raincoat, in the street, heavy rain, bokeh\"; Prompt #2: \"a closeup face photo of a boy in white shirt standing on the grassland, flowers\"; Prompt #3: \"a huge red apple in front of a small dog, heavy snow\". Prompt #4: \"front view of a boat sailing in a cup of water\".", "description": "This figure compares image generation results from PeRFlow with other acceleration methods (LCM-LORA, Lightning, and InstaFlow) using SDXL.  PeRFlow demonstrates superior image quality and better alignment between text prompts and generated images, particularly noticeable in the details and overall coherence.", "section": "3.1 Few-step generation"}, {"figure_path": "qrlguvKu7a/figures/figures_14_3.jpg", "caption": "Figure 2: The 1024 × 1024 images generated by PeRFlow enjoy richer details and better text-image consistency in comparison to other acceleration methods on SDXL. Prompt #1: \"a closeup face photo of girl, wearing a raincoat, in the street, heavy rain, bokeh\"; Prompt #2: \"a closeup face photo of a boy in white shirt standing on the grassland, flowers\"; Prompt #3: \"a huge red apple in front of a small dog, heavy snow\". Prompt #4: \"front view of a boat sailing in a cup of water\".", "description": "This figure compares the image generation quality of PeRFlow against other state-of-the-art acceleration methods on the SDXL model.  Four different prompts were used, each producing a 1024x1024 image.  The results show PeRFlow generating images with more detail and better alignment with the text prompt compared to the other methods.", "section": "3.1 Few-step generation"}, {"figure_path": "qrlguvKu7a/figures/figures_15_1.jpg", "caption": "Figure 13: 4-step generation (1024 × 1024) via PeRFlow-SDXL.", "description": "This figure showcases the high-quality images generated by PeRFlow-SDXL, a model accelerated using the PeRFlow method, within only four inference steps. The images depict diverse subjects including a woman, a sports car, a tiger, a man, mountains, a dog, a rooster with a cat, and a lake with mountains.  The visual quality highlights PeRFlow's effectiveness in accelerating diffusion models for high-resolution image generation.", "section": "3.1 Few-step generation"}]