[{"figure_path": "w6vbfSC1y0/figures/figures_1_1.jpg", "caption": "Figure 1: Imperfect foreground background decomposition. The top row shows the original images from ImageNet-1k and the bottom row shows the ID-irrelevant context extracted from the original images (shown as the colored patches of images on the second row), using CLIP fine-tuned with CoOp on 16-shot data. Due to the imperfect decomposition of fine-tuned vision-language models, large portions of the extracted local features from ID data belong to ID-related regions, thus harming the performance of OOD detection. More illustrations are presented in the Appendix A.3.3.", "description": "This figure shows the imperfect foreground-background decomposition performed by CLIP, a vision-language model. The top row displays original images from ImageNet-1k, while the bottom row shows the ID-irrelevant context extracted by the fine-tuned CLIP model using 16-shot data. The colored patches represent the extracted context.  The imperfect decomposition leads to many extracted features being ID-related, which negatively impacts OOD detection performance.", "section": "1 Introduction"}, {"figure_path": "w6vbfSC1y0/figures/figures_3_1.jpg", "caption": "Figure 2: Empirical demonstration about invalid OOD features extracted from ID data in LoCoOp and the influence of sample uncertainty on OOD detection performance. In the left and middle panels, we illustrate the extracted OOD features at different levels of uncertainty and find that they become unreliable as the uncertainty increases. The numbers at the bottom denote the prediction probability for the ground-truth labels from fine-tuned CLIP. In the right panel, we collect ID samples of different uncertainty levels based on prompt-tuned CLIP and divide them into 2 groups. The result demonstrates that the OOD detection performance of LoCoOp significantly degrades as the uncertainty level of ID data rises. We leave the experimental details in Appendix A.3.1 for reference.", "description": "This figure empirically demonstrates the impact of the uncertainty of ID samples on OOD detection performance.  The left and center panels show how extracted OOD features from ID data become less reliable as the uncertainty increases (indicated by prediction probabilities). The right panel shows the significantly worse OOD detection performance of the LoCoOp method as the uncertainty of the training ID data increases.", "section": "3.2 Motivation"}, {"figure_path": "w6vbfSC1y0/figures/figures_9_1.jpg", "caption": "Figure 3: Ablation study. (a) performance of using different regularization weights λ; (b) exploration of different regularization functions for OOD regularization; (c) using different CLIP architectures; (d) comparison of different methods for extracting OOD features.", "description": "This figure presents the ablation study results to demonstrate the effectiveness of different components of the proposed Self-Calibrated Tuning (SCT) framework.  Panel (a) shows the effect of varying the regularization weight (λ) on OOD detection performance. Panel (b) compares different OOD regularization functions (Entropy Maximization, MSP, Energy) used in SCT. Panel (c) shows the robustness of SCT across different CLIP architectures (ViT-B/16, ViT-B/32, RN50).  Panel (d) evaluates the impact of different OOD feature extraction methods (Rank, Probability, Entropy) on SCT's performance.", "section": "4 Experiment"}, {"figure_path": "w6vbfSC1y0/figures/figures_18_1.jpg", "caption": "Figure 2: Empirical demonstration about invalid OOD features extracted from ID data in LoCoOp and the influence of sample uncertainty on OOD detection performance. In the left and middle panels, we illustrate the extracted OOD features at different levels of uncertainty and find that they become unreliable as the uncertainty increases. The numbers at the bottom denote the prediction probability for the ground-truth labels from fine-tuned CLIP. In the right panel, we collect ID samples of different uncertainty levels based on prompt-tuned CLIP and divide them into 2 groups. The result demonstrates that the OOD detection performance of LoCoOp significantly degrades as the uncertainty level of ID data rises. We leave the experimental details in Appendix A.3.1 for reference.", "description": "This figure shows the impact of uncertainty on OOD detection performance. The left and center panels illustrate that extracted OOD features from uncertain ID data are unreliable.  The right panel shows that LoCoOp's performance significantly decreases with increasing uncertainty in the ID data.", "section": "3.2 Motivation"}, {"figure_path": "w6vbfSC1y0/figures/figures_19_1.jpg", "caption": "Figure 1: Imperfect foreground background decomposition. The top row shows the original images from ImageNet-1k and the bottom row shows the ID-irrelevant context extracted from the original images (shown as the colored patches of images on the second row), using CLIP fine-tuned with CoOp on 16-shot data. Due to the imperfect decomposition of fine-tuned vision-language models, large portions of the extracted local features from ID data belong to ID-related regions, thus harming the performance of OOD detection. More illustrations are presented in the Appendix A.3.3.", "description": "This figure shows the imperfect foreground-background decomposition performed by a CLIP model fine-tuned with the CoOp method using 16-shot data. The top row displays original images from ImageNet-1k, while the bottom row highlights the ID-irrelevant context extracted from those images.  The colored patches represent the extracted features.  The imperfect decomposition leads to many extracted features being ID-related rather than truly out-of-distribution (OOD), negatively impacting OOD detection performance.", "section": "1 Introduction"}]