[{"figure_path": "ccQ4fmwLDb/tables/tables_5_1.jpg", "caption": "Table 1: Theoretical properties comparison of different samplers.", "description": "This table compares the theoretical properties of different diffusion samplers, including DDIM, EDICT, BDIA, and the proposed O-BELM.  The properties compared are whether the sampler has the exact inversion property, the order of its local truncation error, whether it is zero-stable, and whether it has global convergence. O-BELM is shown to have superior theoretical properties compared to the other methods.", "section": "4 The Optimal-BELM (O-BELM) Sampler"}, {"figure_path": "ccQ4fmwLDb/tables/tables_8_1.jpg", "caption": "Table 2: Comparison of different samplers on MSE reconstruction loss on COCO-14.", "description": "This table presents a comparison of the Mean Squared Error (MSE) loss for image reconstruction across different diffusion samplers (DDIM, EDICT, BDIA, and O-BELM) on the COCO-14 dataset.  The comparison is shown for different numbers of sampling steps (10, 20, 50, and 100).  The results illustrate the reconstruction error achieved by each method, with lower MSE indicating better reconstruction quality.", "section": "5 Experiments"}, {"figure_path": "ccQ4fmwLDb/tables/tables_8_2.jpg", "caption": "Table 3: Comparison of different samplers on FID score(↓) for the task of unconditional generation.", "description": "This table presents a comparison of different diffusion model samplers (DDIM, EDICT, BDIA, and O-BELM) in terms of their Fréchet Inception Distance (FID) scores.  Lower FID scores indicate better-quality generated images. The comparison is done for the task of unconditional image generation (generating images without any specific guidance or conditioning) on CIFAR10 (32x32) and CelebA-HQ (256x256) datasets. The results are shown for different numbers of sampling steps (10, 20, 50, and 100). The table helps to evaluate the sampling quality of each method.", "section": "5 Experiments"}, {"figure_path": "ccQ4fmwLDb/tables/tables_9_1.jpg", "caption": "Table 4: Comparison of different samplers on FID score(↓) for the task of text-to-image generation with pretrained stable diffusion models.", "description": "This table compares the Fréchet Inception Distance (FID) scores of different samplers (DDIM, EDICT, BDIA, and O-BELM) for text-to-image generation using two pre-trained Stable Diffusion models (SD-1.5 and SD-2.0-base).  Lower FID scores indicate better image quality. The comparison is done across different numbers of sampling steps (10, 20, 50, and 100).", "section": "5 Experiments"}, {"figure_path": "ccQ4fmwLDb/tables/tables_27_1.jpg", "caption": "Table 2: Comparison of different samplers on MSE reconstruction loss on COCO-14.", "description": "This table compares the mean squared error (MSE) of reconstruction loss achieved by different samplers (DDIM, EDICT, BDIA, and O-BELM) on the COCO-14 dataset. The MSE loss is calculated for different numbers of steps (10, 20, 50, and 100).  Lower MSE values indicate better reconstruction quality.", "section": "5 Experiments"}, {"figure_path": "ccQ4fmwLDb/tables/tables_28_1.jpg", "caption": "Table 3: Comparison of different samplers on FID score(↓) for the task of unconditional generation.", "description": "This table compares the Fréchet Inception Distance (FID) scores achieved by different samplers (DDIM, EDICT, BDIA, and O-BELM) for the task of unconditional image generation on CIFAR10 and CelebA-HQ datasets. A lower FID score indicates better-quality generated images, reflecting a higher similarity to real images. The comparison is made across different numbers of sampling steps (10, 20, 50, and 100).", "section": "5.2 Unconditional Image Generation"}, {"figure_path": "ccQ4fmwLDb/tables/tables_28_2.jpg", "caption": "Table 3: Comparison of different samplers on FID score(↓) for the task of unconditional generation.", "description": "This table compares the performance of different diffusion samplers (DDIM, EDICT, BDIA, and O-BELM) on the task of unconditional image generation.  The FID (Fréchet Inception Distance) score is used as a metric to evaluate the quality of the generated images, with lower scores indicating better image quality.  The comparison is performed for different numbers of steps in the sampling process. The table shows how O-BELM consistently achieves the lowest FID score compared to other methods.", "section": "5 Experiments"}, {"figure_path": "ccQ4fmwLDb/tables/tables_28_3.jpg", "caption": "Table 3: Comparison of different samplers on FID score(↓) for the task of unconditional generation.", "description": "This table compares the Fréchet Inception Distance (FID) scores achieved by different samplers (DDIM, EDICT, BDIA, and O-BELM) for the task of unconditional image generation.  Lower FID scores indicate better image quality. The comparison is done across three different numbers of sampling steps (20, 50, and 100) on two datasets (CIFAR10 and CelebA-HQ).  The results show that O-BELM consistently outperforms the other samplers, indicating its ability to generate higher-quality images.", "section": "5 Experiments"}, {"figure_path": "ccQ4fmwLDb/tables/tables_33_1.jpg", "caption": "Table 2: Comparison of different samplers on MSE reconstruction loss on COCO-14.", "description": "This table compares the Mean Squared Error (MSE) of reconstruction loss achieved by different diffusion samplers (DDIM, EDICT, BDIA, and O-BELM) on the COCO-14 dataset.  The MSE is a measure of the difference between the reconstructed image and the original image. Lower MSE values indicate better reconstruction quality.  The comparison is done for different numbers of sampling steps (10, 20, 50, and 100).", "section": "5 Experiments"}]