[{"figure_path": "46V9axmOuU/tables/tables_6_1.jpg", "caption": "Table 1: Evaluation of the generated images on the target domain data using diverse prompt optimization methods. AKP denotes the automatic keyword prompt generated by ICL-based prompt rewriting.", "description": "This table presents a quantitative comparison of different prompt optimization methods on their ability to generate high-quality images on unseen diffusion models.  The methods are evaluated based on several metrics: semantic consistency (measured by Color, Shape, Texture, and Blipscore), and image quality (measured by Aesthetic Score, ImageReward, and HPS).  The results show a comparison between the proposed method and existing methods, with manual prompts serving as the ground truth.", "section": "4 Experiments"}, {"figure_path": "46V9axmOuU/tables/tables_8_1.jpg", "caption": "Table 2: Ablation study of the loss functions.", "description": "This table presents the results of an ablation study on the loss functions used in the AP-Adapter model.  It shows the impact of removing each loss function individually (Lr, Ld, La, Lc) on the model's performance, as measured by BlipScore, AesScore, and ImageReward. The results demonstrate the importance of each loss function for achieving optimal performance.  The row with all loss functions checked represents the full model's performance, providing a benchmark to compare against the individual ablation results.", "section": "4.6 Ablation Study"}, {"figure_path": "46V9axmOuU/tables/tables_8_2.jpg", "caption": "Table 1: Evaluation of the generated images on the target domain data using diverse prompt optimization methods. AKP denotes the automatic keyword prompt generated by ICL-based prompt rewriting.", "description": "This table presents a comparison of different automatic prompt optimization (APO) methods on the task of generating images for unseen text-to-image diffusion models. The methods are evaluated based on several metrics assessing both semantic consistency and image quality. The metrics include semantic consistency (Color, Shape, Texture, Blipscore, Aesthetic Score), and image quality (ImageReward, HPS). The table shows that the proposed AP-Adapter method outperforms other APO methods in terms of both semantic consistency and image quality.", "section": "4 Experiments"}, {"figure_path": "46V9axmOuU/tables/tables_13_1.jpg", "caption": "Table 1: Evaluation of the generated images on the target domain data using diverse prompt optimization methods. AKP denotes the automatic keyword prompt generated by ICL-based prompt rewriting.", "description": "This table presents a quantitative comparison of different automatic prompt optimization (APO) methods on unseen diffusion models.  The evaluation metrics cover both semantic consistency (how well the generated image matches the prompt's meaning) and image quality (aesthetic appeal, color, shape, and texture). The methods compared include popular techniques like MagicPrompt, PromptPerfect, and SUR-adapter, along with an intermediate step using only automatically generated keyword prompts (AKP) and a combination of AKP and SUR-adapter. The final row shows results for manually crafted prompts, serving as a ground truth for comparison.", "section": "4 Experiments"}, {"figure_path": "46V9axmOuU/tables/tables_16_1.jpg", "caption": "Table 4: Evaluation results of the impact of different backbones of the CLIP image encoder on the generated images. Acc refers to the classification accuracy of the domain discriminator.", "description": "This table presents the results of an ablation study comparing different backbones of the CLIP image encoder on the performance of the AP-Adapter model.  The backbones tested were RN50, RN101, ViT-B/32, and ViT-L/14.  The table shows the accuracy of domain discrimination (Acc) achieved by each backbone, along with the BlipScore and AesScore of the generated images.  These metrics evaluate the semantic consistency and aesthetic quality of the generated images respectively.", "section": "4 Experiments"}]