[{"figure_path": "y9huwsnGRJ/tables/tables_6_1.jpg", "caption": "Table 1: Comparison of our LeapAD with competitive methods on Town05 Short benchmark. Notably, LeapAD demonstrated superior performance with a smaller data footprint, outperforming other approaches. \"DD\" & \"KD\" denote data-driven and knowledge-driven, respectively. \"L\" & \"C\" indicate LiDAR and camera modalities.", "description": "This table compares the performance of LeapAD against other state-of-the-art autonomous driving methods on the Town05 Short benchmark in CARLA.  It shows LeapAD's superior performance (higher Driving Score (DS) and Route Completion (RC)) while using significantly less annotated data. The table also clarifies the type of data used (data-driven (DD) vs. knowledge-driven (KD)) and sensor modalities (LiDAR (L) and Camera (C)).", "section": "4 Experiments"}, {"figure_path": "y9huwsnGRJ/tables/tables_7_1.jpg", "caption": "Table 2: Generalization of accumulated knowledge in the memory bank. We evaluate the performance of our LeapAD across various towns (Town05, Town01, and Town04) by leveraging memory banks accumulated from diverse sources. Lavg denotes the average lengths of routes within each town.", "description": "This table shows the performance of LeapAD on different towns using memory banks accumulated from various sources.  It demonstrates the model's ability to generalize accumulated knowledge across different driving environments and route lengths, with and without fine-tuning on a specific town's data. The results highlight the impact of both few-shot learning and fine-tuning strategies on performance and the effectiveness of the accumulated experience in the memory bank for model generalization.", "section": "4.4 Ablation Study"}, {"figure_path": "y9huwsnGRJ/tables/tables_15_1.jpg", "caption": "Table 1: Comparison of our LeapAD with competitive methods on Town05 Short benchmark. Notably, LeapAD demonstrated superior performance with a smaller data footprint, outperforming other approaches. \"DD\" & \"KD\" denote data-driven and knowledge-driven, respectively. \"L\" & \"C\" indicate LiDAR and camera modalities.", "description": "This table compares the performance of LeapAD against other state-of-the-art autonomous driving methods on the Town05 Short benchmark.  It shows LeapAD's superior performance using only camera data and significantly less training data (11K annotations) compared to other methods that utilize both LiDAR and camera data or significantly more training data.  The table highlights the effectiveness of LeapAD's knowledge-driven approach (KD) over data-driven approaches (DD).", "section": "4 Experiments"}, {"figure_path": "y9huwsnGRJ/tables/tables_17_1.jpg", "caption": "Table 3: Comparison of our LeapAD with competitive methods in Town05 Long benchmark. \"DD\" and \"KD\" denote data-driven and knowledge-driven, respectively.", "description": "This table compares the performance of LeapAD with other state-of-the-art methods on the Town05 Long benchmark in autonomous driving.  It shows the Driving Score (DS), Route Completion (RC), and Infraction Score (IS) for each method.  The modality (camera only (C) or camera and LiDAR (L+C)) and type of approach (data-driven (DD) or knowledge-driven (KD)) are also indicated. The annotations column shows the amount of training data used for each method. LeapAD achieves competitive performance while using significantly less training data.", "section": "4 Experiments"}, {"figure_path": "y9huwsnGRJ/tables/tables_17_2.jpg", "caption": "Table 4: Ablation on the number of few shots.", "description": "This table presents the results of an ablation study on the number of few-shot prompts used in the Heuristic Process of the LeapAD model.  The study varies the number of shots (0, 1, 2, and 3) and measures the impact on the Driving Score (DS), Route Completion (RC), and Infraction Score (IS).  The results demonstrate the effectiveness of few-shot prompting in improving model performance and show a clear positive trend as the number of shots increases.", "section": "4.4 Ablation Study"}, {"figure_path": "y9huwsnGRJ/tables/tables_17_3.jpg", "caption": "Table 5: Affect of the memory size for few-shot learning.", "description": "This table presents the ablation study on the impact of memory bank size on the performance of LeapAD using a 3-shot strategy.  It shows that as the memory bank size increases from 90 samples to 9000 samples, the driving score (DS), route completion (RC), and infraction score (IS) all improve. This demonstrates the continuous learning capability of the model, where larger memory banks lead to better performance.", "section": "4.4 Ablation Study"}]