[{"figure_path": "HU2uyDjAcy/figures/figures_8_1.jpg", "caption": "Figure 1: Performances over 5 simulations of various algorithms with respect to the total number of episodes. The vertical axis denotes the exploitability gap max(μ,ν)∈Imin×Imax VP,v – Vu,v (top) and the empirical variance of the ℓt vectors over time (bottom), with all rewards scaled between 0 and 1. The total numbers of actions are Ax = By = 12 for Kuhn poker, Ax = By = 1092 for Leduc poker, and Ax = By = 24570 for Liars dice.", "description": "This figure compares the performance of several algorithms (BalancedCFR, BalancedFTRL, LocalOMD Optimal, LocalOMD Adaptive) across three different poker games (Kuhn Poker, Leduc Poker, Liars Dice).  The top row shows the exploitability gap (a measure of how far from optimal the learned strategies are) as a function of the number of episodes of training.  The bottom row illustrates the empirical variance of the loss estimations during training. The figure demonstrates that LocalOMD achieves lower exploitability and variance compared to other algorithms.", "section": "Experiments"}, {"figure_path": "HU2uyDjAcy/figures/figures_22_1.jpg", "caption": "Figure 1: Performances over 5 simulations of various algorithms with respect to the total number of episodes. The vertical axis denotes the exploitability gap max(μ,ν)∈Imin×Imax VP,v – Vu,v (top) and the empirical variance of the \nlt vectors over time (bottom), with all rewards scaled between 0 and 1. The total numbers of actions are Ax = By = 12 for Kuhn poker, Ax = By = 1092 for Leduc poker, and Ax = By = 24570 for Liars dice.", "description": "This figure compares the performance of several algorithms (BalancedCFR, BalancedFTRL, LocalOMD Optimal, LocalOMD Adaptive) across three games (Kuhn Poker, Leduc Poker, Liars Dice) over multiple simulations. The top part displays the exploitability gap, a measure of how far from optimal the learned strategies are, plotted against the total number of episodes. The bottom part shows the empirical variance of loss estimates over time for the same algorithms.  The results highlight the reduced variance of LocalOMD compared to other methods.", "section": "Experiments"}]