[{"figure_path": "gzQARCgIsI/tables/tables_7_1.jpg", "caption": "Table 1: The NATURAL IPW ATE outperforms other versions of the method as well as trained baselines on semi-synthetic datasets, as measured by RMSE.", "description": "This table presents the results of an empirical evaluation of the NATURAL IPW method on two semi-synthetic datasets (Hillstrom and Retail Hero).  It compares the performance of NATURAL IPW against several other versions of the NATURAL estimator (N-Full, N-MC OI, N-MC IPW, N-OI, N-IPW) as well as two traditional baselines (Bag-of-Words and Sentence Encoder) and an oracle estimator (IPW (Structured)). The comparison is made using the root mean squared error (RMSE) between the estimated Average Treatment Effect (ATE) and the ground truth ATE from randomized controlled trials.  The table shows that NATURAL IPW achieves lower RMSE values compared to the other methods across both datasets.", "section": "Empirical Evaluation"}, {"figure_path": "gzQARCgIsI/tables/tables_8_1.jpg", "caption": "Table 2: Using real data, best performing NATURAL estimators fall within 3 percentage points of their corresponding ground truth clinical trial ATEs. Possible ATE values lie between -100 and 100.", "description": "This table presents the results of applying the NATURAL estimators to four real-world clinical datasets.  It compares the estimated Average Treatment Effects (ATEs) from the NATURAL models (N-MC OI, N-MC IPW, N-OI, N-IPW) against the ground truth ATEs obtained from corresponding clinical trials.  The RMSE (root mean squared error) is provided to show the difference between the estimated and ground truth ATEs. The table shows that the best-performing NATURAL estimators are able to produce ATE estimates that are within 3 percentage points of the ground truth, demonstrating the effectiveness of the method in estimating causal effects from real-world observational data.", "section": "Empirical Evaluation"}, {"figure_path": "gzQARCgIsI/tables/tables_14_1.jpg", "caption": "Table 2: Using real data, best performing NATURAL estimators fall within 3 percentage points of their corresponding ground truth clinical trial ATEs. Possible ATE values lie between -100 and 100.", "description": "This table presents the results of applying the NATURAL estimators to four real-world clinical trial datasets.  The table shows the estimated Average Treatment Effect (ATE) for each trial, along with the Root Mean Squared Error (RMSE) comparing the estimate to the ground truth ATE from the actual clinical trial. The table demonstrates that the NATURAL estimators produce ATE estimates that are consistently very close to the ground truth values.", "section": "Empirical Evaluation"}, {"figure_path": "gzQARCgIsI/tables/tables_23_1.jpg", "caption": "Table 3: Treatments, outcomes and synthetic confounders (where applicable) for each dataset.", "description": "This table lists the treatments and outcomes used in the six datasets, including the four real-world datasets from Reddit posts on diabetes and migraine treatments, and the two semi-synthetic datasets generated from the Hillstrom and Retail Hero datasets.  It also indicates whether a synthetic confounder was introduced in the semi-synthetic datasets.", "section": "E Dataset Details"}, {"figure_path": "gzQARCgIsI/tables/tables_23_2.jpg", "caption": "Table 2: Using real data, best performing NATURAL estimators fall within 3 percentage points of their corresponding ground truth clinical trial ATEs. Possible ATE values lie between -100 and 100.", "description": "This table presents the results of applying NATURAL estimators to four real-world clinical trial datasets.  It compares the estimated Average Treatment Effects (ATEs) produced by different NATURAL methods against their corresponding ground truth ATEs obtained from the actual clinical trials. The table shows that the best-performing NATURAL estimators produce ATE estimates that are within 3 percentage points of the ground truth values.  This highlights the accuracy of NATURAL in estimating causal effects from unstructured textual data.", "section": "Empirical Evaluation"}, {"figure_path": "gzQARCgIsI/tables/tables_26_1.jpg", "caption": "Table 5: NATURAL IPW for Semaglutide vs. Tirzepatide is robust to the degree of unobserved confoundedness shown below.", "description": "This table presents the results of a sensitivity analysis on the NATURAL IPW estimator for the Semaglutide vs. Tirzepatide dataset.  It shows how robust the ATE estimate is to the degree of unobserved confounding. The rows and columns represent different levels of unobserved confounding for the two potential outcomes (Y(0) and Y(1)).  The values in the table represent the estimated ATE under those conditions.  The analysis demonstrates the robustness of the NATURAL IPW estimator to a significant degree of unobserved confounding for this particular dataset.", "section": "F.3 Sensitivity Analysis"}, {"figure_path": "gzQARCgIsI/tables/tables_28_1.jpg", "caption": "Table 2: Using real data, best performing NATURAL estimators fall within 3 percentage points of their corresponding ground truth clinical trial ATEs. Possible ATE values lie between -100 and 100.", "description": "This table presents the results of applying the NATURAL estimators to four real-world clinical trial datasets.  It compares the estimated Average Treatment Effect (ATE) from the NATURAL estimators against the ground truth ATEs obtained from the corresponding clinical trials.  The table shows that the best-performing NATURAL estimators provide ATE estimates that are remarkably close to the ground truth values, all falling within 3 percentage points.  The table includes results for both tuned and held-out settings and indicates the RMSE (Root Mean Squared Error) for each method.", "section": "Empirical Evaluation"}]