[{"figure_path": "bMTn8KKrbq/tables/tables_7_1.jpg", "caption": "Table 1: Validation accuracy and Wall Clock Time (WCT) obtained on CIFAR-10 by EP (Alg. 2) and ID on models with different number of layers (L) and block sizes (\"bs\"). 3 seeds are used.", "description": "This table presents the results of experiments conducted on the CIFAR-10 dataset to evaluate the performance of two algorithms, EP (Equilibrium Propagation) and ID (Implicit Differentiation), using Feedforward-tied Energy-based Models (ff-EBMs) with varying numbers of layers and block sizes. The table shows the top-1 accuracy and wall clock time (WCT) for each configuration, providing insights into the impact of model architecture on both accuracy and computational efficiency.  The results are averaged across three different seeds to ensure statistical reliability.", "section": "4.3 Splitting experiment"}, {"figure_path": "bMTn8KKrbq/tables/tables_8_1.jpg", "caption": "Table 2: Validation accuracy and Wall Clock Time (WCT) obtained on CIFAR100 and ImageNet32 by EP and Autodiff on models with different number of layers (L) and a block size of 2 (bs=2). 3 seeds are used. We compare our results against best published results on ImageNet32 by EP [Laborieux and Zenke, 2022] and against all backprop alternatives [Høier et al., 2023].", "description": "This table presents the top-1 and top-5 validation accuracy and wall clock time (WCT) for models trained on CIFAR100 and ImageNet32 using both Equilibrium Propagation (EP) and Implicit Differentiation (ID).  The results are shown for models with 12 and 15 layers and compare the performance of EP against state-of-the-art results from the literature.", "section": "4.4 Scaling experiment"}, {"figure_path": "bMTn8KKrbq/tables/tables_17_1.jpg", "caption": "Table 1: Validation accuracy and Wall Clock Time (WCT) obtained on CIFAR-10 by EP (Alg. 2) and ID on models with different number of layers (L) and block sizes (\"bs\"). 3 seeds are used.", "description": "This table presents the validation accuracy and wall-clock time (WCT) achieved on the CIFAR-10 dataset using both Equilibrium Propagation (EP) and Implicit Differentiation (ID) methods.  The experiments were performed on models with varying numbers of layers (L) and different block sizes (bs), which represent how the model is split into feedforward and energy-based components.  The results show how the performance and computational efficiency of the model change with different architectural configurations.", "section": "4.3 Splitting experiment"}, {"figure_path": "bMTn8KKrbq/tables/tables_25_1.jpg", "caption": "Table 1: Validation accuracy and Wall Clock Time (WCT) obtained on CIFAR-10 by EP (Alg. 2) and ID on models with different number of layers (L) and block sizes (\"bs\"). 3 seeds are used.", "description": "This table presents the results of validation accuracy and wall clock time on CIFAR-10 dataset for different model configurations using Equilibrium Propagation (EP) and Implicit Differentiation (ID).  It shows how the performance and computation time vary with the number of layers (L) and different block sizes (bs) in the feedforward-tied energy-based models (ff-EBMs). The results demonstrate the impact of model architecture on both accuracy and efficiency.", "section": "4.3 Splitting experiment"}, {"figure_path": "bMTn8KKrbq/tables/tables_27_1.jpg", "caption": "Table 1: Validation accuracy and Wall Clock Time (WCT) obtained on CIFAR-10 by EP (Alg. 2) and ID on models with different number of layers (L) and block sizes (\"bs\"). 3 seeds are used.", "description": "This table presents the results of validation accuracy and wall clock time (WCT) on CIFAR-10 dataset for different models trained using Equilibrium Propagation (EP) and Implicit Differentiation (ID). The models vary in the number of layers (L) and block sizes (bs), which represent how many layers are grouped into one energy-based block. The table shows the performance (top-1 accuracy) and computation speed (WCT) for different model configurations.  The results highlight the impact of model architecture on both performance and computational efficiency.", "section": "4.3 Splitting experiment"}, {"figure_path": "bMTn8KKrbq/tables/tables_29_1.jpg", "caption": "Table 1: Validation accuracy and Wall Clock Time (WCT) obtained on CIFAR-10 by EP (Alg. 2) and ID on models with different number of layers (L) and block sizes (\"bs\"). 3 seeds are used.", "description": "This table presents the results of validation accuracy and wall clock time (WCT) on CIFAR-10 dataset for different models trained using Equilibrium Propagation (EP) and Implicit Differentiation (ID). The models vary in the number of layers (L) and the number of blocks (\"bs\"), allowing for an analysis of how different model architectures affect performance and computational efficiency.  The use of 3 seeds ensures a more reliable estimate of performance.", "section": "4.3 Splitting experiment"}, {"figure_path": "bMTn8KKrbq/tables/tables_33_1.jpg", "caption": "Table 1: Validation accuracy and Wall Clock Time (WCT) obtained on CIFAR-10 by EP (Alg. 2) and ID on models with different number of layers (L) and block sizes (\"bs\"). 3 seeds are used.", "description": "This table presents the results of validation accuracy and wall clock time on CIFAR-10 dataset using two different algorithms, EP (Alg. 2) and ID.  The experiments varied the total number of layers (L) in the model and the size of the blocks (bs) used in the feedforward-tied energy-based model (ff-EBM).  Three different seeds were used for each configuration to assess the reproducibility and stability of the results.", "section": "4.3 Splitting experiment"}, {"figure_path": "bMTn8KKrbq/tables/tables_34_1.jpg", "caption": "Table 1: Validation accuracy and Wall Clock Time (WCT) obtained on CIFAR-10 by EP (Alg. 2) and ID on models with different number of layers (L) and block sizes (\"bs\"). 3 seeds are used.", "description": "This table presents the results of validation accuracy and wall clock time on CIFAR-10 dataset for different configurations of the proposed Feedforward-tied Energy-based Models (ff-EBMs).  The configurations vary in the total number of layers (L) and the number of blocks the model is split into (bs).  It compares the performance of the proposed Equilibrium Propagation (EP) algorithm (Alg. 2) with Implicit Differentiation (ID). The results demonstrate that EP achieves similar or better accuracy than ID across various configurations and exhibits a significant reduction in wall clock time with smaller block sizes. This shows that ff-EBMs can scale with smaller block sizes while maintaining performance. ", "section": "4.3 Splitting experiment"}, {"figure_path": "bMTn8KKrbq/tables/tables_35_1.jpg", "caption": "Table 1: Validation accuracy and Wall Clock Time (WCT) obtained on CIFAR-10 by EP (Alg. 2) and ID on models with different number of layers (L) and block sizes (\"bs\"). 3 seeds are used.", "description": "This table shows the validation accuracy and wall clock time for CIFAR-10 using two different algorithms (EP and ID) and varying the number of layers and block sizes in the model.  Three separate seeds were used for each configuration to provide a measure of statistical reliability.  The results demonstrate how the performance and computation time change as the model's architecture is altered.", "section": "4.3 Splitting experiment"}]