[{"figure_path": "4pIfc51fGK/tables/tables_7_1.jpg", "caption": "Table 1: Employed datasets in experiments.", "description": "This table lists the seven datasets used in the paper's experiments, along with their characteristics: the number of samples (n), the number of views (v), the number of clusters (k), and the dimensionality (d_p) of each view.  The datasets represent a variety of data types and sizes, allowing for a comprehensive evaluation of the proposed AIMC-CVR method under diverse conditions.", "section": "4.1 Experimental Setup"}, {"figure_path": "4pIfc51fGK/tables/tables_8_1.jpg", "caption": "Table 2: Clustering performance on seven datasets. '-' means unable to run due to memory limitation.", "description": "This table presents a comparison of the proposed AIMC-CVR method against eight state-of-the-art incomplete multi-view clustering algorithms across seven benchmark datasets.  The performance is evaluated using four metrics: Accuracy (ACC), Normalized Mutual Information (NMI), Purity, and F-score.  The table highlights the superior performance of AIMC-CVR, especially on smaller datasets, and its scalability in handling large-scale datasets where other methods fail due to memory constraints.  The '-' indicates that a method could not be run due to memory limitations on the given dataset.", "section": "4.2 Clustering Performance Comparison"}, {"figure_path": "4pIfc51fGK/tables/tables_9_1.jpg", "caption": "Table 3: Ablation studies of AIMC-CVR with different variants.", "description": "This table presents the results of an ablation study comparing the performance of the proposed AIMC-CVR method against five variants.  Each variant removes or modifies a key component of AIMC-CVR, allowing for an analysis of the contribution of each part to the overall performance. The results are presented in terms of clustering accuracy (ACC) across seven different datasets (MSRCV, WebKB, Wiki, Hdigit, YTF10, YTF20, MNIST).  The table demonstrates the effectiveness of each component and the superiority of the complete AIMC-CVR model.", "section": "4.3 Ablation Study"}, {"figure_path": "4pIfc51fGK/tables/tables_16_1.jpg", "caption": "Table 2: Clustering performance on seven datasets. '-' means unable to run due to memory limitation.", "description": "This table presents a comparison of the clustering performance of AIMC-CVR and eight other state-of-the-art incomplete multi-view clustering algorithms across seven datasets.  The performance is measured using four metrics: Accuracy (ACC), Normalized Mutual Information (NMI), Purity, and F-score. The datasets vary in size and number of views.  The table highlights AIMC-CVR's superior or competitive performance across all datasets and its ability to handle larger datasets where other methods fail due to memory limitations.", "section": "4.2 Clustering Performance Comparison"}]