[{"figure_path": "4rrNcsVPDm/figures/figures_3_1.jpg", "caption": "Figure 1: Overview of the network architecture of FNP. Unified coordinate transformation ensures spatial alignment of the background and observations, and extracts the coordinates and values of the conditional points. FNP models the two components of the conditional information globally to get their respective spatial-variable functional representation through SetConv for data embedding and stacking of neural Fourier layers for deep feature extraction. The dynamic alignment and merge module integrates these functional representation based on similarity to shared features and aligns them into the target domain, resulting in a comprehensive functional representation over the target space. MLPs are finally employed to decode the functional representation and output the mean and variance of the analysis based on the coordinates of the target points.", "description": "This figure provides a high-level overview of the Fourier Neural Processes (FNP) architecture. It illustrates the flow of data through different modules, starting from the input of background and sparse observation data to the final output of the analysis mean and variance.  Key modules like unified coordinate transformation, spatial-variable functional representation, dynamic alignment and merge, and the decoder are highlighted. The figure also includes a detailed breakdown of the functional representation and dynamic alignment and merge modules, showing the specific operations and transformations performed within each.", "section": "3 Methods"}, {"figure_path": "4rrNcsVPDm/figures/figures_7_1.jpg", "caption": "Figure 1: Overview of the network architecture of FNP. Unified coordinate transformation ensures spatial alignment of the background and observations, and extracts the coordinates and values of the conditional points. FNP models the two components of the conditional information globally to get their respective spatial-variable functional representation through SetConv for data embedding and stacking of neural Fourier layers for deep feature extraction. The dynamic alignment and merge module integrates these functional representation based on similarity to shared features and aligns them into the target domain, resulting in a comprehensive functional representation over the target space. MLPs are finally employed to decode the functional representation and output the mean and variance of the analysis based on the coordinates of the target points.", "description": "This figure shows a detailed overview of the Fourier Neural Processes (FNP) architecture for arbitrary-resolution data assimilation. It illustrates the different modules, including the unified coordinate transformation, spatial-variable functional representation using SetConv and neural Fourier layers, the dynamic alignment and merge (DAM) module, and the final MLP decoder. The figure highlights the flow of data and the interactions between the modules, providing a comprehensive visual representation of the FNP model.", "section": "3 Methods"}, {"figure_path": "4rrNcsVPDm/figures/figures_8_1.jpg", "caption": "Figure 2: Visualization of assimilation results by different models for q700. The visualization date-time is randomly selected at 2018-04-02 06:00 UTC. The first row shows the ERA5 (ground truth), background, background error and observations with 0.25° resolution. Other rows show the assimilation results of different models.", "description": "This figure visualizes the results of data assimilation for the variable q700 (specific humidity at 700 hPa) using four different models: ERA5 (ground truth), Adas, ConvCNP, and FNP. The visualization compares the models' performance in terms of accuracy and ability to capture high-frequency information. It showcases ERA5, the background used for assimilation, the background error, the raw observations, the analysis generated by each model, the analysis increment (difference between the analysis and background), and the analysis error (difference between the analysis and ERA5). It also displays the analysis variance for ConvCNP and FNP, offering insight into the uncertainty associated with each model's predictions. Notably, the figure highlights FNP's success in capturing high-frequency information and reducing analysis error compared to the other methods.", "section": "4 Experiments"}, {"figure_path": "4rrNcsVPDm/figures/figures_14_1.jpg", "caption": "Figure 4: Visualization of assimilation results with 0.25° resolution for u10.", "description": "This figure visualizes the results of data assimilation using different models on the u10 variable (10-meter zonal component of wind) with a resolution of 0.25°.  It shows a comparison of ERA5 (ground truth), the background forecast, the background error, and the raw observations. The analysis results (estimated state of the atmosphere) from Adas, ConvCNP, and FNP are shown, including analysis increments (difference between analysis and background) and analysis errors (difference between analysis and ERA5).  The analysis variance from ConvCNP and FNP is also displayed, indicating uncertainty estimates. The visualizations aim to highlight the performance differences of the models in handling different data resolutions and capturing high-frequency details.", "section": "4.2 Arbitrary-Resolution Data Assimilation"}, {"figure_path": "4rrNcsVPDm/figures/figures_15_1.jpg", "caption": "Figure 2: Visualization of assimilation results by different models for q700. The visualization date-time is randomly selected at 2018-04-02 06:00 UTC. The first row shows the ERA5 (ground truth), background, background error and observations with 0.25° resolution. Other rows show the assimilation results of different models.", "description": "This figure visualizes the results of data assimilation using different methods (Adas, ConvCNP, and FNP) for the variable q700 (specific humidity at 700 hPa) at a specific time. It compares the ground truth (ERA5), background forecast, and observations with the analysis results, analysis increments, analysis errors, and analysis variance produced by each method.  The visualization highlights the differences in accuracy and ability to capture high-frequency information between the methods, especially at a high resolution (0.25°).", "section": "4 Experiments"}, {"figure_path": "4rrNcsVPDm/figures/figures_16_1.jpg", "caption": "Figure 6: Visualization of assimilation results with 0.25° resolution for z500.", "description": "This figure visualizes the results of data assimilation for the z500 variable (geopotential height at 500 hPa) using a resolution of 0.25°. It compares the results of four different methods: ERA5 (ground truth), Adas [10], ConvCNP [20], and the proposed FNP method. For each method, it shows the analysis (the estimated state), the analysis increment (the difference between the analysis and background), the analysis error (the difference between the analysis and the ground truth), and the analysis variance (an estimate of uncertainty in the analysis).  The visualization provides a clear comparison of the accuracy and uncertainty of each method in capturing the spatial distribution of the geopotential height.", "section": "4.2 Arbitrary-Resolution Data Assimilation"}, {"figure_path": "4rrNcsVPDm/figures/figures_17_1.jpg", "caption": "Figure 2: Visualization of assimilation results by different models for q700. The visualization date-time is randomly selected at 2018-04-02 06:00 UTC. The first row shows the ERA5 (ground truth), background, background error and observations with 0.25° resolution. Other rows show the assimilation results of different models.", "description": "This figure visualizes the results of data assimilation for the variable q700 (specific humidity at 700 hPa) using different models (Adas, ConvCNP, and FNP).  The top row shows the ground truth from ERA5, the background forecast, the error in the background forecast, and the sparse observational data.  Subsequent rows display the analysis (assimilated result) for each model, the difference between the analysis and background (analysis increment), and the error between the analysis and ground truth (analysis error). The analysis variance is also displayed for ConvCNP and FNP. The visualization uses a 0.25° resolution for better detail.", "section": "4 Experiments"}, {"figure_path": "4rrNcsVPDm/figures/figures_18_1.jpg", "caption": "Figure 2: Visualization of assimilation results by different models for q700. The visualization date-time is randomly selected at 2018-04-02 06:00 UTC. The first row shows the ERA5 (ground truth), background, background error and observations with 0.25° resolution. Other rows show the assimilation results of different models.", "description": "This figure visualizes the results of data assimilation for the specific humidity at 700 hPa (q700) using different models. It compares the ERA5 reanalysis data (ground truth), model background, background error, and 0.25° resolution observations against the analysis produced by Adas, ConvCNP, and FNP.  Each model's analysis, analysis increment (difference between analysis and background), analysis error (difference between analysis and ERA5), and analysis variance are displayed.  The visualization highlights how well each model captures the spatial distribution and high-frequency information, providing a visual comparison of their performance in data assimilation.", "section": "4 Experiments"}]