[{"figure_path": "itztwTAcN6/tables/tables_18_1.jpg", "caption": "Table 1: Examples of H-consistency bounds for binary margin-based losses.", "description": "The table presents examples of H-consistency bounds for four common binary margin-based surrogate loss functions.  Each row shows a different surrogate loss function (e.g., exponential loss, logistic loss, squared hinge loss, hinge loss), along with the corresponding H-consistency bound.  These bounds relate the estimation error of the zero-one loss to the estimation error of the surrogate loss, including minimizability gaps (Me). The H-consistency bound shows how quickly the zero-one loss estimation error decreases as the surrogate loss estimation error is minimized.", "section": "E Examples of H-consistency bounds"}, {"figure_path": "itztwTAcN6/tables/tables_19_1.jpg", "caption": "Table 2: Examples of H-consistency bounds for comp-sum losses.", "description": "This table presents examples of H-consistency bounds for several comp-sum loss functions.  Each row shows a different comp-sum loss function (defined by its Φ(u) function) and the corresponding H-consistency bound in terms of the zero-one loss, the surrogate loss, and their respective minimizability gaps.  The bounds highlight the square-root relationship between the surrogate estimation error and the zero-one estimation error, a key finding of the paper.", "section": "5.1 Comp-sum losses"}, {"figure_path": "itztwTAcN6/tables/tables_19_2.jpg", "caption": "Table 3: Examples of H-consistency bounds for constrained losses with ∑y∈Y h(x, y) = 0.", "description": "This table presents examples of H-consistency bounds for various constrained losses in multi-class classification.  The table shows how the H-consistency bound varies depending on the choice of constrained loss function (e.g., exponential loss, squared hinge loss).  Note that these bounds incorporate the minimizability gap, a key element differentiating them from excess error bounds.", "section": "5.2 Constrained losses"}]