[{"figure_path": "uYZTzcHaQB/figures/figures_4_1.jpg", "caption": "Figure 1: (a) An example of a graph containing only one motif. Nodes 1 and 2 are the candidate seed nodes. (b) A super node example(labeled a) for a motif, which connects to two nodes labeled 2 and 4. (c) 5-spanning tree example (see blue edges).", "description": "This figure illustrates three graph examples to explain concepts in the paper. (a) shows a simple graph with a single motif consisting of nodes 3 and 4. (b) demonstrates the concept of a \"super node,\" which represents a motif and is connected to nodes within the motif with probability 1. (c) shows a 5-spanning tree, a subgraph within a motif that connects activated nodes to other nodes within the motif, crucial in the motif activation process. These illustrations help visualize the motif-oriented influence maximization problem and the proposed solution.", "section": "3 Problem definition"}, {"figure_path": "uYZTzcHaQB/figures/figures_8_1.jpg", "caption": "Figure 2: Expected motif influence vs. k under LT model, r<sub>i</sub> = 1 and motif size being 2. (a) Flickr. (b) Amazon. (c) Catster. (d) Youtube. Larger is better.", "description": "This figure displays the performance of the motif influence function across four different datasets (Flickr, Amazon, Catster, Youtube) under the Linear Threshold (LT) model.  The x-axis represents the number of seed nodes (k), and the y-axis represents the expected motif influence. Each subplot corresponds to a different dataset, showing how the expected motif influence increases with the number of seed nodes.  The results suggest that the proposed method outperforms other existing methods in all four datasets.", "section": "6.2 Experiment results"}, {"figure_path": "uYZTzcHaQB/figures/figures_8_2.jpg", "caption": "Figure 2: Expected motif influence vs. k under LT model, r<sub>i</sub> = 1 and motif size being 2. (a) Flickr. (b) Amazon. (c) Catster. (d) Youtube. Larger is better.", "description": "This figure displays the performance of different influence maximization algorithms across four different social network datasets (Flickr, Amazon, Catster, Youtube) under the Linear Threshold (LT) model.  The x-axis represents the number of seed nodes (k), and the y-axis shows the expected number of activated motifs.  Each subplot corresponds to a different dataset, demonstrating the algorithm's effectiveness in activating motifs which represent groups of users. The algorithm LBMOIM (ours) consistently outperforms existing methods across all datasets.", "section": "6.2 Experiment results"}, {"figure_path": "uYZTzcHaQB/figures/figures_8_3.jpg", "caption": "Figure 2: Expected motif influence vs. k under LT model, r₁ = 1 and motif size being 2. (a) Flickr. (b) Amazon. (c) Catster. (d) Youtube. Larger is better.", "description": "This figure displays the performance of the motif influence function under the linear threshold (LT) model, where the threshold (r₁) is set to 1 and motif size is 2. The x-axis represents the number of seed nodes (k), while the y-axis shows the expected motif influence. The results are shown separately for four different datasets: Flickr, Amazon, Catster, and Youtube.  The figure visually compares the performance of the proposed algorithm (LBMOIM) against other state-of-the-art methods (TIM+, OPIM, DeepIM, GIM, GIA).  A higher value on the y-axis indicates better performance. ", "section": "6.2 Experiment results"}, {"figure_path": "uYZTzcHaQB/figures/figures_8_4.jpg", "caption": "Figure 2: Expected motif influence vs. k under LT model, r₁ = 1 and motif size being 2. (a) Flickr. (b) Amazon. (c) Catster. (d) Youtube. Larger is better.", "description": "This figure displays the performance of different influence maximization methods across various datasets under the linear threshold (LT) model with a motif size of 2 and a threshold value (r₁) of 1. The x-axis represents the number of seed nodes (k), while the y-axis shows the expected motif influence, indicating the number of activated motifs.  The figure demonstrates that the proposed LBMOIM method consistently outperforms other state-of-the-art algorithms on all four datasets (Flickr, Amazon, Catster, and Youtube).", "section": "6.2 Experiment results"}, {"figure_path": "uYZTzcHaQB/figures/figures_8_5.jpg", "caption": "Figure 5: Expected motif influence vs. k under IC model in Douban dataset, r₁ = 1 and motif size being 3. (a) r₁ = 1. (b) r₁ = 2. (c) r₁ = 3. Larger is better.", "description": "This figure compares the performance of different influence maximization algorithms (GIM, GIA, and LBMOIM) under the Independent Cascade (IC) model on the Douban dataset.  It shows the expected number of activated motifs as a function of the number of seed nodes (k) for three different threshold values (r₁ = 1, 2, and 3). LBMOIM consistently outperforms the other algorithms.", "section": "6.2 Experiment results"}, {"figure_path": "uYZTzcHaQB/figures/figures_14_1.jpg", "caption": "Figure 1: (a) An example of a graph containing only one motif. Nodes 1 and 2 are the candidate seed nodes. (b) A super node example(labeled a) for a motif, which connects to two nodes labeled 2 and 4. (c) 5-spanning tree example (see blue edges).", "description": "This figure illustrates three concepts related to motif-oriented influence maximization. (a) shows a simple graph with one motif (a set of interconnected nodes). (b) introduces the concept of a 'super node,' representing a motif as a single node for simplification, connected to its constituent nodes with probability 1. (c) illustrates a 'semi 5-spanning tree', a subgraph connecting activated and inactive nodes within a motif. These figures help to explain the mathematical model and concepts used in the paper.", "section": "3 Problem definition"}]