[{"figure_path": "btLLWaOrFs/tables/tables_7_1.jpg", "caption": "Table 1: Registration performance on KITTI odometry dataset.", "description": "This table presents the quantitative results of point cloud registration on the KITTI odometry dataset.  It compares the proposed CAST method against several state-of-the-art methods, evaluating performance across three metrics: relative translation error (RTE), relative rotation error (RRE), and registration recall (RR). Lower values for RTE and RRE indicate better accuracy, while a higher RR percentage signifies more successful registrations. The table shows that CAST achieves the best overall performance.", "section": "4.1 Outdoor Scenarios: KITTI and NuScenes"}, {"figure_path": "btLLWaOrFs/tables/tables_8_1.jpg", "caption": "Table 3: Evaluation results on indoor RGBD point cloud datasets.", "description": "This table presents a comparison of different methods for indoor RGB-D point cloud registration on two datasets: 3DMatch and 3DLoMatch.  The results are given as registration recall percentages for different numbers of sample points (5000, 2500, 1000, 500, and 250), and the average registration recall across all sample sizes is also provided.  The time taken for each method is listed in the final column.  This allows for the comparison of performance and computational efficiency across various state-of-the-art approaches.", "section": "4 Experiments"}, {"figure_path": "btLLWaOrFs/tables/tables_8_2.jpg", "caption": "Table 2: Registration performance on nuScenes.", "description": "This table presents the quantitative results of point cloud registration on the nuScenes dataset.  It compares the proposed CAST method against several other methods, both traditional and learning-based, using three key metrics: relative translation error (RTE), relative rotation error (RRE), and registration recall (RR).  Lower values of RTE and RRE indicate better accuracy, while a higher RR indicates better overall registration performance.", "section": "4.1 Outdoor Scenarios: KITTI and NuScenes"}, {"figure_path": "btLLWaOrFs/tables/tables_9_1.jpg", "caption": "Table 4: Ablation studies of coarse matching modules on indoor datasets.", "description": "This table presents the ablation study results of the coarse matching module on two indoor datasets, 3DMatch and 3DLoMatch.  Five different configurations are compared, each removing one or more components of the proposed consistency-aware spot-guided Transformer (CAST) architecture. The components evaluated are multi-scale feature fusion (MS), spot-guided cross-attention (SG), consistency-aware self-attention (CA), and overlap prediction (OV). The results show the impact of each component on the performance metrics: patch inlier ratio (PIR), patch matching recall (PMR), and registration recall (RR).", "section": "4.3 Ablation Studies"}, {"figure_path": "btLLWaOrFs/tables/tables_9_2.jpg", "caption": "Table 5: Ablation studies of fine matching on KITTI.", "description": "This table presents the ablation study results on the KITTI dataset for the fine matching module of the CAST method. It shows the impact of removing different components of the fine matching module on the registration performance, measured by RTE (Relative Translation Error), RRE (Relative Rotation Error), and RR (Registration Recall). The results demonstrate the importance of each component for achieving high accuracy and robustness in point cloud registration.", "section": "4.3 Ablation Studies"}, {"figure_path": "btLLWaOrFs/tables/tables_16_1.jpg", "caption": "Table 6: Hyper-parameter setting for three datasets in our implementation.", "description": "This table shows the hyperparameters used in the CAST model for three different datasets: 3DMatch, KITTI, and nuScenes.  The hyperparameters control various aspects of the model, including the size of overlapping regions considered during coarse matching, the thresholds for determining geometric compatibility between correspondences, and the radius used for dense matching.  The values differ across datasets due to differences in the characteristics of the data (e.g., density, scale).", "section": "A.1 Neural Network Architectures and Hyper-parameters"}, {"figure_path": "btLLWaOrFs/tables/tables_16_2.jpg", "caption": "Table 3: Evaluation results on indoor RGBD point cloud datasets.", "description": "This table presents a comparison of different methods for point cloud registration on indoor RGBD datasets (3DMatch and 3DLoMatch).  The comparison includes registration recall at various downsampling levels (5000, 2500, 1000, 500, 250 points) for both datasets. It also provides the average recall and runtime (in seconds) for each method.  The results showcase the performance of various state-of-the-art methods and the proposed CAST method on these challenging datasets.", "section": "4 Experiments"}, {"figure_path": "btLLWaOrFs/tables/tables_18_1.jpg", "caption": "Table 8: Inlier ratios and feature matching recalls on indoor datasets 3DMatch.", "description": "This table presents a comparison of different methods' performance on the 3DMatch dataset in terms of inlier ratio and feature matching recall.  The inlier ratio represents the percentage of correctly matched points, while the feature matching recall indicates the percentage of correctly matched features. Different sample sizes (5000, 2500, 1000, 500, and 250) are used for evaluation, allowing for a comprehensive assessment across varying data scales. The table is divided into two sections: descriptor-based methods and correspondence-based methods, providing a clear comparison between the two approaches.", "section": "4.2 Indoor Scenarios: 3DMatch and 3DLoMatch"}, {"figure_path": "btLLWaOrFs/tables/tables_18_2.jpg", "caption": "Table 3: Evaluation results on indoor RGBD point cloud datasets.", "description": "This table presents a comparison of different methods on two indoor RGB-D point cloud datasets: 3DMatch and 3DLoMatch.  The results are shown for different numbers of sampled points (5000, 2500, 1000, 500, 250) and indicate the registration recall percentage achieved by each method. The table is useful for understanding the relative performance of different registration approaches, particularly in scenarios with varying data density.", "section": "4 Experiments"}, {"figure_path": "btLLWaOrFs/tables/tables_19_1.jpg", "caption": "Table 9: Registration results on indoor RGBD point cloud datasets.", "description": "This table presents a comparison of different point cloud registration methods on two indoor RGBD datasets: 3DMatch and 3DLoMatch.  The metrics used for comparison are Registration Recall (RR), Relative Translation Error (RTE), and Relative Rotation Error (RRE).  Lower values for RTE and RRE, and higher values for RR indicate better performance. The table shows that the proposed CAST method outperforms other methods on both datasets.", "section": "4.2 Indoor Scenarios: 3DMatch and 3DLoMatch"}, {"figure_path": "btLLWaOrFs/tables/tables_19_2.jpg", "caption": "Table 10: Empirical standard deviations of the evaluation metrics of CAST in repeated experiments.", "description": "This table shows the standard deviations of different metrics (RR, IR, FMR, PIR, PMR, RTE, RRE) for the CAST model across three datasets (3DMatch, KITTI, and nuScenes).  These standard deviations represent the variability observed in the results when the experiments are repeated multiple times. Lower standard deviations indicate more stable and reliable results.", "section": "4.3 Ablation Studies"}, {"figure_path": "btLLWaOrFs/tables/tables_20_1.jpg", "caption": "Table 11: Results of generalization from KITTI to ETH.", "description": "This table presents the results of a generalization experiment conducted to evaluate the generalizability of different point cloud registration methods.  The experiment involved generalizing from the KITTI dataset (using Velodyne-64 3D LiDAR) to the ETH dataset (using Hokuyo 2D LiDAR), which represent different LiDAR sensors.  The table shows the translation error (RTE), rotation error (RRE), and registration recall (RR) for various methods, including the proposed CAST method with and without different components (CGE, SM, UDA).  This demonstrates how well the methods perform on an unseen dataset.", "section": "4.3 Ablation Studies"}]