[{"figure_path": "3mzFmBPFIX/figures/figures_5_1.jpg", "caption": "Figure 1. A visual depiction of the NMS architecture.", "description": "This figure shows a visual representation of the Neural Metriplectic Systems (NMS) architecture.  The input is the state vector at time step t<sub>k</sub>, x(t<sub>k</sub>). This is then used by the network to compute the gradients of energy and entropy (∇E(x), ∇S(x)), the energy and entropy functions themselves (E(x), S(x)), and the metriplectic operators L(x) and M(x). These operators are parameterized in a way that guarantees the energy is conserved and entropy is nondecreasing. The computed quantities are used to solve the metriplectic system for the next timestep, and the system integrates to obtain the state vector x(t<sub>k+1</sub>).", "section": "3.3 Specific parameterizations"}, {"figure_path": "3mzFmBPFIX/figures/figures_8_1.jpg", "caption": "Figure 2: The ground-truth and predicted position, momentum, instantaneous entropy, and energies for the two gas containers example in the training (white), validation (yellow), and testing (red) regimes.", "description": "This figure compares the ground truth and predicted values for several key variables in a two gas containers experiment, across different phases (training, validation, and testing).  The plots show Hamiltonian, position, momentum, total energy, and instantaneous entropy.  Each plot demonstrates how well the model predictions match the actual measurements over time. The use of different colours highlights the performance of the model in each phase.", "section": "5.1 Two gas containers"}, {"figure_path": "3mzFmBPFIX/figures/figures_18_1.jpg", "caption": "Figure 2: The ground-truth and predicted position, momentum, instantaneous entropy, and energies for the two gas containers example in the training (white), validation (yellow), and testing (red) regimes.", "description": "This figure shows the comparison of ground truth and predicted values for position, momentum, instantaneous entropy, and energy for the two gas containers example.  The results are shown for the training, validation, and testing data sets, with each set represented by different colors (white, yellow, and red). This illustrates the model's ability to accurately predict the system's behavior, particularly in the testing regime, and how well the model preserves the fundamental physical laws governing this dynamic system.", "section": "5.1 Two gas containers"}]