[{"figure_path": "UO7Mvch1Z5/tables/tables_7_1.jpg", "caption": "Table 1: Quantitative comparison results for mesh visual and geometry quality. We report the metrics of PSNR, SSIM, LPIPS and Clip-Similarity [38], ChamferDistance (CD), Volume IoU and F-score on GSO [8] dataset.", "description": "This table presents a quantitative comparison of the proposed Unique3D model against several state-of-the-art image-to-3D methods.  The comparison uses seven metrics to evaluate both the visual quality (PSNR, SSIM, LPIPS, Clip-Similarity) and geometric accuracy (CD, Vol. IoU, F-Score) of the generated 3D meshes.  The dataset used for evaluation is the Google Scanned Objects (GSO) dataset.", "section": "4.2 Comparisons"}, {"figure_path": "UO7Mvch1Z5/tables/tables_9_1.jpg", "caption": "Table 2: Quantitative comparison results for ablation on 100 random samples with random rotation on GSO dataset.", "description": "This table presents a quantitative comparison of the results obtained using the Unique3D model against a baseline. The comparison is based on 100 random samples with random rotation on the GSO dataset.  The metrics used for evaluation are PSNR, SSIM, LPIPS, Clip-Sim, CD, Vol. IoU, and F-Score. Higher values for PSNR, SSIM, Clip-Sim, Vol. IoU, and F-Score indicate better performance; whereas lower values for LPIPS and CD indicate better performance.", "section": "4.3 Ablation Study and Discussion"}, {"figure_path": "UO7Mvch1Z5/tables/tables_19_1.jpg", "caption": "Table 1: Quantitative comparison results for mesh visual and geometry quality. We report the metrics of PSNR, SSIM, LPIPS and Clip-Similarity [38], ChamferDistance (CD), Volume IoU and F-score on GSO [8] dataset.", "description": "This table presents a quantitative comparison of the proposed Unique3D model against several state-of-the-art methods for 3D mesh generation from a single image.  The comparison uses seven metrics to evaluate both the visual quality and geometric accuracy of the generated meshes.  These metrics cover various aspects, including peak signal-to-noise ratio (PSNR), structural similarity index (SSIM), learned perceptual image patch similarity (LPIPS), CLIP similarity, Chamfer distance (CD), volume Intersection over Union (IoU), and F-score. The results are reported on the Google Scanned Objects (GSO) dataset.", "section": "4.2 Comparisons"}]