[{"figure_path": "pLoX8Og3bH/tables/tables_4_1.jpg", "caption": "Table 1: Statistics of various semantic segmentation datasets in diverse modalities. 'Surv.', '#Cls' and 'Anno.' are the shorthand for surveillance, the number of classes and annotation density, respectively.", "description": "This table compares various semantic segmentation datasets across different modalities (RGB, Infrared, Video, and UAV).  It shows the year the dataset was published, the types of imagery included (color, infrared, video), whether the data was collected using UAVs, the type of capture, the number of videos and frames, the number of ground truth annotations, the resolution of the images, the number of classes, and the annotation density. This allows for comparison of the datasets' scale, scope, and annotation effort.", "section": "5 Experiments"}, {"figure_path": "pLoX8Og3bH/tables/tables_7_1.jpg", "caption": "Table 2: Quantitative evaluation on the MVSeg dataset. SupOnly stands for the model trained on the labeled data.", "description": "This table presents a quantitative comparison of different semantic segmentation models on the MVSeg dataset.  It shows the performance of both fully supervised and semi-supervised methods under various data splits (1/16, 1/8, 1/4, and 1/2 of the training data labeled). The results are reported as mean Intersection over Union (mIoU) and illustrate the impact of semi-supervised learning on improving the segmentation performance. Semi-supervised methods consistently outperform their fully supervised counterparts, showcasing the effectiveness of leveraging unlabeled data. SemiMV, the proposed method, achieves the best performance across all data splits.", "section": "5.3 Comparison with the State-of-the-Arts"}, {"figure_path": "pLoX8Og3bH/tables/tables_7_2.jpg", "caption": "Table 2: Quantitative evaluation on the MVSeg dataset. SupOnly stands for the model trained on the labeled data.", "description": "The table presents the quantitative results on the MVSeg dataset, comparing various semi-supervised and supervised semantic segmentation models under different data partition protocols (1/16, 1/8, 1/4, and 1/2).  The methods include several semi-supervised methods (MT, CCT, CPS, UniMatch, Accel, IFR) and the proposed SemiMV method, in addition to supervised baselines using RGB or RGB-T data. The results are presented in terms of mIoU.", "section": "5.3 Comparison with the State-of-the-Arts"}, {"figure_path": "pLoX8Og3bH/tables/tables_8_1.jpg", "caption": "Table 4: Ablation study of the proposed SemiMV framework.", "description": "This table presents the ablation study results of the proposed SemiMV framework. It shows the impact of different components (RGB, Thermal, C3L, DMR, Dual-C3L) on the model's performance (mIoU) when trained with labeled and unlabeled data. The results demonstrate the effectiveness of each component in improving the model's ability to utilize both labeled and unlabeled data for semi-supervised semantic segmentation.", "section": "5.4 Ablation Studies"}, {"figure_path": "pLoX8Og3bH/tables/tables_8_2.jpg", "caption": "Table 5: Ablation analysis of our C3L module.", "description": "This table presents the ablation study of the Cross-collaborative Consistency Learning (C3L) module. It compares the performance of the baseline model against three variants of the C3L module: one without cross supervision, one without cross-modal collaboration, and the full C3L module. The results demonstrate the importance of both cross supervision and cross-modal collaboration for effective semi-supervised learning in the MVSS task. ", "section": "5.4 Ablation Studies"}, {"figure_path": "pLoX8Og3bH/tables/tables_8_3.jpg", "caption": "Table 5: Ablation analysis of our C3L module.", "description": "This table presents the ablation study of the Cross-collaborative Consistency Learning (C3L) module. It compares the performance of the C3L module with and without cross-supervision and cross-collaboration on the MVSeg dataset. The results show that both cross-supervision and cross-collaboration are crucial for the performance of the C3L module.", "section": "5.4 Ablation Studies"}]