[{"figure_path": "GN2GXjPyN8/figures/figures_1_1.jpg", "caption": "Figure 3: Visualization of reference antibodies in RAbD and antibodies designed by ABDPO given specific antigens (PDB ID: 1iqd (left), 1ic7 (middle), and 2dd8 (right)). The unit of energy annotated is kcal/mol and omitted here for brevity.", "description": "This figure visualizes three examples of reference antibodies from the RAbD dataset and the antibodies generated by ABDPO for the same antigens.  Each pair shows the CDR-H3 region (in yellow) of both the reference and ABDPO-generated antibody, bound to its antigen.  The remaining antibody structures are shown in blue.  The visualizations highlight the structural differences between the reference and the model-generated antibodies, and the annotated energy values (omitted for brevity in the caption) give a quantitative comparison of their binding energies.  The goal is to illustrate how ABDPO produces antibodies with similar structures to the reference antibodies but with improved binding affinity.", "section": "4.2 Main Results"}, {"figure_path": "GN2GXjPyN8/figures/figures_2_1.jpg", "caption": "Figure 2: Overview of ABDPO. This process can be summarized as: (a) Generate antibodies with the pre-trained diffusion model; (b) Evaluate the multiple types of residue-level energy and construct preference data; (c) Compute the losses for energy-based preference optimization and mitigate the conflicts between losses of multiple types of energy; (d) Update the diffusion model.", "description": "This figure illustrates the workflow of the ABDPO method. Starting with a pre-trained diffusion model, antibodies are generated.  Their residue-level energies (attraction, repulsion, total) are calculated and used to create preference data for fine-tuning. Gradient surgery addresses conflicts between energy types. The model is updated iteratively, improving antibody design.", "section": "3 Method"}, {"figure_path": "GN2GXjPyN8/figures/figures_7_1.jpg", "caption": "Figure 3: Visualization of reference antibodies in RAbD and antibodies designed by ABDPO given specific antigens (PDB ID: 1iqd (left), 1ic7 (middle), and 2dd8 (right)). The unit of energy annotated is kcal/mol and omitted here for brevity.", "description": "This figure visualizes three examples of antibodies generated by ABDPO and their corresponding reference antibodies from the RAbD dataset. Each example shows the structure of the reference antibody (left) and the synthetic antibody designed by ABDPO (right). The CDR-H3 regions are highlighted in yellow to emphasize the part of the antibody most relevant to antigen binding. The remaining parts of the antibodies are colored blue and the antigen is colored grey.  The CDR total energy (CDR Etotal) and the change in Gibbs free energy upon binding (CDR-Ag AG) are provided for both the reference and ABDPO-generated antibodies, highlighting the difference in energy between the natural and synthetic antibodies.  The figure illustrates ABDPO's ability to generate antibodies with structures and energies resembling those of naturally occurring antibodies.", "section": "4.2 Main Results"}, {"figure_path": "GN2GXjPyN8/figures/figures_8_1.jpg", "caption": "Figure 8: Changes of median CDR Etotal, CDR-Ag EnonRep, CDR-Ag Erep, and CDR-Ag ∆G (kcal/mol) over-optimization steps, shaded to indicate interquartile range (from 25-th percentile to 75-th percentile). The rows represent PDB 1a14, 2dd8, 3cx5, 4ki5, and 5mes respectively, in a top-down order.", "description": "This figure displays the changes in median CDR Etotal, CDR-Ag EnonRep, CDR-Ag Erep, and CDR-Ag ∆G during optimization steps for five different PDB IDs (1a14, 2dd8, 3cx5, 4ki5, and 5mes). Shading indicates the interquartile range (25th to 75th percentile) showing variation across multiple runs.  Each row represents one of these PDB IDs, illustrating the optimization process for each. The purpose is to demonstrate the effects of each element of the ABDPO method by comparing the results to the results of running the optimization without one of those elements.", "section": "4.3 Ablation Studies"}, {"figure_path": "GN2GXjPyN8/figures/figures_13_1.jpg", "caption": "Figure 5: A: Tyr (Y) and Phe (F) differ by only one oxygen atom. In contrast, there is a substantial difference between Gly (G) and Trp (W). Gly lacks a side chain, whereas Trp possesses the largest side chain of all amino acids. B: the visualization of the frequency of occurrence of each amino acid at various positions in RAbD CDR-H3 sequences. The sequences are initially aligned using MAFFT [26] and subsequently visualized with WebLogo [11]. The width of each column corresponds to the frequency of occurrence at that position.", "description": "Figure 5 shows the differences in side chain size between amino acids, especially between Tyr/Phe and Gly/Trp. It also visualizes the frequency of amino acid occurrence at each position of CDR-H3 in the RAbD dataset using WebLogo. This highlights the limitations of AAR as an evaluation metric.", "section": "A Motivation for Choosing Energy as Evaluation"}, {"figure_path": "GN2GXjPyN8/figures/figures_13_2.jpg", "caption": "Figure 6: The distribution of CDR-Ag EnonRep (left) and CDR-Ag Erep (right) formed by the whole CDR atoms (colored in red) and solely by CDR side-chain atoms (colored in blue) among SAbDab dataset.", "description": "This figure shows the distribution of two types of energy: CDR-Ag EnonRep and CDR-Ag Erep.  The energy calculations were performed using two different methods: using all atoms of the CDR region and using only the sidechain atoms. The distributions highlight the significant contribution of the side chain atoms to the interaction energy between CDR and antigen.  The difference in the energy distribution between the whole residue and side chain methods visually demonstrates the importance of considering side chain contributions during antibody design.", "section": "A Motivation for Choosing Energy as Evaluation"}, {"figure_path": "GN2GXjPyN8/figures/figures_20_1.jpg", "caption": "Figure 7: Left: the distribution of peptide bond length within CDR-H3 in the SAbDab dataset; Right: the kernel density estimation (KDE) function fit on the natural peptide bond length distribution.", "description": "This figure shows the distribution of peptide bond lengths in CDR-H3 from the SAbDab dataset (left panel) and the kernel density estimation (KDE) of the distribution (right panel).  The KDE provides a smoothed representation of the distribution, highlighting the concentration around the average peptide bond length.  This visualization is used to assess the consistency of generated antibodies' peptide bond lengths compared to naturally occurring antibodies, a key aspect of structural fidelity and rationality in antibody design. The figure appears in section F of the paper, in the subsection discussing the introduction of an auxiliary loss for peptide bond length in the ABDPO++ model.", "section": "F Incorporating Auxiliary Loss"}, {"figure_path": "GN2GXjPyN8/figures/figures_23_1.jpg", "caption": "Figure 4: Changes of median CDR Etotal, EnonRep, ERep, and CDR-Ag ∆G (kcal/mol) over optimization steps, shaded to indicate interquartile range (from 25-th percentile to 75-th percentile).", "description": "The figure visualizes the changes in median CDR Etotal, EnonRep, ERep, and CDR-Ag ∆G over optimization steps for one specific antibody-antigen complex.  Shading represents the interquartile range (25th to 75th percentile), showing the distribution of values.  It illustrates how these energy components change during the optimization process, providing insight into the effectiveness of the ABDPO method in optimizing multiple aspects of antibody design.  The graph's overall trend indicates that ABDPO is successful in reducing the total energy and improving the binding affinity of the antibodies.", "section": "4.3 Ablation Studies"}]