[{"figure_path": "MXRO5kukST/tables/tables_7_1.jpg", "caption": "Table 1: MSE(SE) & TV(SE) on simulated data. Bold values indicate the top 2 performing methods.", "description": "This table presents the Mean Squared Error (MSE) and Total Variation (TV) along with their standard errors (SE) for different methods on simulated data.  Three different scenarios are shown, with varying numbers of observations per subject (ni): 30, 8 to 12, and 3, 4, 5. The methods compared include PACE, FACE, mFPCA, MICE, CNP, GAIN, 1DS, and various transformer-based models (GT1, GT1P, GT1S, GT1T, GT2, GT2P, GT2S, GT2T, ATT, and SAND). Bold values highlight the top two performing methods for each scenario. The table allows for a comparison of imputation accuracy and smoothness across different methods and data sparsity levels.", "section": "5 Experiments"}, {"figure_path": "MXRO5kukST/tables/tables_8_1.jpg", "caption": "Table 1: MSE(SE) & TV(SE) on simulated data. Bold values indicate the top 2 performing methods.", "description": "This table presents the Mean Squared Error (MSE) and Total Variation (TV) along with their standard errors (SE) for different imputation methods on simulated datasets.  The data was simulated under various conditions, including different numbers of time points per subject (ni) and noise levels.  The bold values highlight the two best-performing methods for each scenario. The MSE measures the average squared difference between the imputed and true values, while the TV measures the total variation in the difference between the imputed and true curves. This table helps to evaluate the performance of various methods under different simulation settings and identifies superior performers for specific scenarios.", "section": "5 Experiments"}, {"figure_path": "MXRO5kukST/tables/tables_9_1.jpg", "caption": "Table 3: MSE(SE) on downstream tasks. Bold font marks the smallest MSE across methods.", "description": "This table presents the Mean Squared Error (MSE) and its standard error (SE) for downstream prediction tasks using different imputation methods.  The tasks involve predicting average energy consumption and BMI based on imputed trajectories.  The table compares the performance of SAND against PACE, FACE, and GT, highlighting SAND's superior performance across all prediction tasks and its ability to consistently achieve the lowest MSE. The bold font indicates the lowest MSE for each task.", "section": "5 Experiments"}]