[{"figure_path": "lJuQxkDbDo/figures/figures_1_1.jpg", "caption": "Figure 1: Cognitive diagnosis based on a student's response records and exercise-concept relations.", "description": "This figure illustrates the core concept of cognitive diagnosis (CD).  Student Bob's responses to five exercises (e1 to e5) are shown, along with indicators of whether the response was correct (green checkmark) or incorrect (red X).  These exercises are connected to underlying concepts (A to E), representing the knowledge areas assessed by the exercises.  The CD process takes these responses and exercise-concept relations as input to generate a student's mastery profile, which is visualized as a radar chart showing Bob's proficiency in each concept.", "section": "1 Introduction"}, {"figure_path": "lJuQxkDbDo/figures/figures_4_1.jpg", "caption": "Figure 2: Overview of the proposed DisenGCD: the disentangled graph learning framework is composed of three learning modules: two GAT-based learning modules and a meta multigraph-based learning module, where the latter's details are shown in the green part.", "description": "This figure presents the overall architecture of the DisenGCD model.  It shows three learning modules working together: a meta multigraph-based student learning module (using interaction graph G1), a GAT-based exercise learning module (using relation graph GR), and a GAT-based concept learning module (using dependency graph GD). The meta-multigraph module is highlighted in green, showing its key role in learning student representation by enabling access to lower-order exercise latent representations via learnable propagation paths. Finally, a diagnostic function combines the three representations to make predictions.", "section": "4 Method"}, {"figure_path": "lJuQxkDbDo/figures/figures_8_1.jpg", "caption": "Figure 2: Overview of the proposed DisenGCD: the disentangled graph learning framework is composed of three learning modules: two GAT-based learning modules and a meta multigraph-based learning module, where the latter's details are shown in the green part.", "description": "This figure shows the architecture of the DisenGCD model. It consists of three main modules: a meta multigraph-based student learning module, a GAT-based exercise learning module, and a GAT-based concept learning module.  The student module uses a meta-multigraph to learn student representations, while the exercise and concept modules use Graph Attention Networks (GATs) on disentangled graphs. These three modules' outputs are then combined in a diagnostic function to make predictions.", "section": "4 Method"}, {"figure_path": "lJuQxkDbDo/figures/figures_9_1.jpg", "caption": "Figure 2: Overview of the proposed DisenGCD: the disentangled graph learning framework is composed of three learning modules: two GAT-based learning modules and a meta multigraph-based learning module, where the latter's details are shown in the green part.", "description": "This figure illustrates the architecture of the DisenGCD model. It consists of three main modules: a meta multigraph-based student learning module, a GAT-based exercise learning module, and a GAT-based concept learning module. Each module operates on a different disentangled graph (interaction graph, relation graph, and dependency graph) to learn respective representations for students, exercises, and concepts. The three representations are finally combined by a diagnostic function for prediction.", "section": "4 Method"}, {"figure_path": "lJuQxkDbDo/figures/figures_16_1.jpg", "caption": "Figure 2: Overview of the proposed DisenGCD: the disentangled graph learning framework is composed of three learning modules: two GAT-based learning modules and a meta multigraph-based learning module, where the latter's details are shown in the green part.", "description": "This figure shows the overall architecture of the DisenGCD framework.  It's composed of three main modules: a meta multigraph-based student learning module (using the interaction graph), a GAT-based exercise learning module (using the relation graph), and a GAT-based concept learning module (using the dependency graph).  These modules learn representations for students, exercises, and concepts, respectively. The diagnostic function combines these representations to make a final prediction. The green part highlights the details of the meta multigraph module.", "section": "4 Method"}, {"figure_path": "lJuQxkDbDo/figures/figures_18_1.jpg", "caption": "Figure 2: Overview of the proposed DisenGCD: the disentangled graph learning framework is composed of three learning modules: two GAT-based learning modules and a meta multigraph-based learning module, where the latter's details are shown in the green part.", "description": "This figure provides a high-level overview of the DisenGCD framework.  It shows three main modules: a meta multigraph-based module for student representation learning, and two GAT-based modules for exercise and concept representation learning.  The three modules operate on three disentangled graphs derived from the student-exercise-concept interaction data.  The meta-multigraph module is highlighted in green, indicating its key role in the framework.", "section": "4 Method"}, {"figure_path": "lJuQxkDbDo/figures/figures_18_2.jpg", "caption": "Figure 2: Overview of the proposed DisenGCD: the disentangled graph learning framework is composed of three learning modules: two GAT-based learning modules and a meta multigraph-based learning module, where the latter's details are shown in the green part.", "description": "This figure shows the architecture of the DisenGCD model. It is composed of three main modules: a meta multigraph-based student learning module, a GAT-based exercise learning module, and a GAT-based concept learning module.  These modules learn representations from three disentangled graphs: student-exercise-concept interaction, exercise-concept relation, and concept dependency. The meta multigraph module is highlighted in green and details its internal workings.  The three modules' outputs are combined in a diagnostic function to make the final prediction.", "section": "4 Method"}, {"figure_path": "lJuQxkDbDo/figures/figures_19_1.jpg", "caption": "Figure 2: Overview of the proposed DisenGCD: the disentangled graph learning framework is composed of three learning modules: two GAT-based learning modules and a meta multigraph-based learning module, where the latter's details are shown in the green part.", "description": "This figure shows the architecture of the DisenGCD model. It consists of three main modules: a meta multigraph-based student learning module, a GAT-based exercise learning module, and a GAT-based concept learning module.  These modules operate on three disentangled graphs: the student-exercise-concept interaction graph, the exercise-concept relation graph, and the concept dependency graph. The meta multigraph module uses multiple learnable propagation paths to enable the student representation to access lower-order exercise latent representations, leading to more effective and robust student representations. The GAT modules learn exercise and concept representations on their respective graphs, which are disentangled to increase robustness against interaction noise. Finally, a diagnostic function combines these representations to predict student performance.", "section": "4 Method"}]