{"importance": "This paper is **crucial** for researchers working on **diffusion models** and **inverse problems** because it presents a novel solution for training these models using only corrupted data. This significantly expands the applicability of diffusion models to real-world scenarios where obtaining large, clean datasets is often impractical or impossible.  The EM approach and adaptive posterior sampling techniques are **highly valuable** contributions to the field and will likely **influence** future work.", "summary": "EMDiffusion trains clean diffusion models from corrupted data using an expectation-maximization algorithm, achieving state-of-the-art results on diverse imaging tasks.", "takeaways": ["EMDiffusion effectively trains diffusion models using corrupted observations, overcoming limitations of requiring large, clean datasets.", "The expectation-maximization approach successfully refines diffusion model weights through iterative reconstruction and model updates.", "The method achieves state-of-the-art results in various computational imaging tasks (inpainting, denoising, deblurring)."], "tldr": "Many applications benefit from diffusion models' ability to represent complex data distributions.  However, their training typically demands extensive clean datasets, which are often unavailable in practical settings. This limitation restricts the use of diffusion models for real-world inverse problems, like image reconstruction from noisy or incomplete observations.\n\nThe proposed solution is EMDiffusion, which tackles this issue by using an expectation-maximization (EM) algorithm.  This iterative algorithm alternates between reconstructing clean images from corrupted data (E-step) and refining the diffusion model parameters based on these reconstructions (M-step).  The incorporation of adaptive diffusion posterior sampling further enhances the algorithm's performance.  The results demonstrate that EMDiffusion achieves state-of-the-art performance on diverse imaging tasks, showing its effectiveness in training high-quality diffusion models from readily available corrupted data.", "affiliation": "Peking University", "categories": {"main_category": "Computer Vision", "sub_category": "Image Generation"}, "podcast_path": "jURBh4V9N4/podcast.wav"}