[{"figure_path": "TzzZ5KAEE2/tables/tables_5_1.jpg", "caption": "Table 1: Comparative performance of GAN-based and DDIM-based cover selection techniques on the ImageNet dataset, with a payload B = 4 bpp. DDIM-optimized images achieve a significant gain over the original images and GAN-optimized images in both error rate reduction and image quality.", "description": "This table compares the performance of GAN-based and DDIM-based cover selection methods on the ImageNet dataset using a payload of 4 bits per pixel.  It shows the error rate, BRISQUE score (image quality), SSIM (structural similarity), and PSNR (peak signal-to-noise ratio) for original images and images optimized using both GAN and DDIM methods.  The results demonstrate the superior performance of DDIM in reducing error rates while maintaining or improving image quality.", "section": "3.3 Performance comparison: DDIM & GAN"}, {"figure_path": "TzzZ5KAEE2/tables/tables_8_1.jpg", "caption": "Table 1: Comparative performance of GAN-based and DDIM-based cover selection techniques on the ImageNet dataset, with a payload B = 4 bpp. DDIM-optimized images achieve a significant gain over the original images and GAN-optimized images in both error rate reduction and image quality.", "description": "This table compares the performance of GAN-based and DDIM-based cover selection methods on the ImageNet dataset using a payload of 4 bits per pixel (bpp).  The results show error rates (%), BRISQUE scores (lower is better), SSIM scores (higher is better), and PSNR scores (higher is better) for original images and images optimized using both GAN and DDIM methods. The table highlights the significant improvement in error rate and image quality achieved by the DDIM-optimized images compared to the original and GAN-optimized images.", "section": "3.3 Performance comparison: DDIM & GAN"}, {"figure_path": "TzzZ5KAEE2/tables/tables_8_2.jpg", "caption": "Table 3: JPEG results for B = 1 bpp.", "description": "This table presents the results of applying the proposed framework with a payload of 1 bit per pixel (bpp) to images that have undergone JPEG compression. It shows a comparison of the error rate and PSNR between the original images and the images optimized using the DDIM-based cover selection method. The results demonstrate the effectiveness of the approach in generating images with lower error rates and comparable image quality even after JPEG compression.", "section": "5 Practical settings"}, {"figure_path": "TzzZ5KAEE2/tables/tables_8_3.jpg", "caption": "Table 1: Comparative performance of GAN-based and DDIM-based cover selection techniques on the ImageNet dataset, with a payload B = 4 bpp. DDIM-optimized images achieve a significant gain over the original images and GAN-optimized images in both error rate reduction and image quality.", "description": "This table compares the performance of GAN-based and DDIM-based cover selection methods on the ImageNet dataset using a payload of 4 bits per pixel (bpp).  For several image classes, it shows the error rate (percentage of incorrect message bits recovered), BRISQUE score (measuring perceived image quality), SSIM (structural similarity index), and PSNR (peak signal-to-noise ratio) for original, GAN-optimized, and DDIM-optimized images.  The results demonstrate that the DDIM-optimized images significantly reduce the error rate and maintain or improve image quality.", "section": "3.3 Performance comparison: DDIM & GAN"}, {"figure_path": "TzzZ5KAEE2/tables/tables_13_1.jpg", "caption": "Table 1: Comparative performance of GAN-based and DDIM-based cover selection techniques on the ImageNet dataset, with a payload B = 4 bpp. DDIM-optimized images achieve a significant gain over the original images and GAN-optimized images in both error rate reduction and image quality.", "description": "This table compares the performance of GAN-based and DDIM-based cover selection methods on the ImageNet dataset using a payload of 4 bits per pixel (bpp).  It shows the error rate, BRISQUE score (image quality), SSIM (structural similarity), and PSNR (peak signal-to-noise ratio) for original images and those optimized using GANs and DDIMs.  The results demonstrate that DDIM-optimized images significantly reduce the error rate while maintaining or improving image quality compared to original and GAN-optimized images.", "section": "3.3 Performance comparison: DDIM & GAN"}, {"figure_path": "TzzZ5KAEE2/tables/tables_15_1.jpg", "caption": "Table 5: Performance results with regularization on CelebA-HQ with a payload B = 2 bpp. We show the resuls for edge preservation (EP), l₁ distance between original and updated cover images (l1), total variation (TV), and VGG feature matching (VGG).", "description": "This table presents the performance results of different regularization methods applied during the cover selection process using the CelebA-HQ dataset with a payload of 2 bits per pixel (bpp).  The methods evaluated include edge preservation (EP), L1 distance between original and updated cover images (l1), total variation (TV), and VGG feature matching (VGG). For each method, the table shows the error rate, BRISQUE score, SSIM, and PSNR. The results demonstrate that the various regularization techniques did not significantly enhance the performance.", "section": "3.3 Performance comparison: DDIM & GAN"}, {"figure_path": "TzzZ5KAEE2/tables/tables_21_1.jpg", "caption": "Table 6: Average computation time of DDIM-based cover selection (in seconds) for different payload values.", "description": "This table shows the average computation time required for the DDIM-based cover selection method, measured in seconds, for different payload values (bits per pixel).  The results are categorized by dataset: CelebA-HQ and AFHQ-Dog. This provides insights into the computational cost of the optimization process at different data sizes.", "section": "5 Practical settings"}, {"figure_path": "TzzZ5KAEE2/tables/tables_21_2.jpg", "caption": "Table 1: Comparative performance of GAN-based and DDIM-based cover selection techniques on the ImageNet dataset, with a payload B = 4 bpp. DDIM-optimized images achieve a significant gain over the original images and GAN-optimized images in both error rate reduction and image quality.", "description": "This table compares the performance of GAN-based and DDIM-based cover selection methods on the ImageNet dataset using a payload of 4 bits per pixel (bpp).  The results show error rates, BRISQUE scores, SSIM (Structural Similarity Index), and PSNR (Peak Signal-to-Noise Ratio) values for original images and images optimized using each method.  It highlights the superior performance of DDIM in both reducing error rates and improving image quality.", "section": "3.3 Performance comparison: DDIM & GAN"}, {"figure_path": "TzzZ5KAEE2/tables/tables_22_1.jpg", "caption": "Table 8: Robustness to Gaussian noise for a payload B = 4 bpp on CelebA-HQ.", "description": "This table presents the results of evaluating the robustness of the DDIM-based cover selection approach to Gaussian noise.  The experiment used a payload of 4 bits per pixel (bpp) on the CelebA-HQ dataset.  Different levels of Gaussian noise (variance β) were introduced into the steganographic image before decoding. The table shows the effect of the noise on the error rate, BRISQUE (image quality), SSIM (structural similarity), and PSNR (peak signal-to-noise ratio).  Lower values for error rate, BRISQUE, and higher values for SSIM and PSNR indicate better robustness to noise.", "section": "K Robustness to Gaussian noise"}]