[{"figure_path": "aon7bwYBiq/figures/figures_4_1.jpg", "caption": "Figure 1: Illustration of Distortion from Edge Perturbations over Adjacent Graphs for Nodes with Low and High Degrees.", "description": "This figure demonstrates how the distortion introduced by edge perturbation varies depending on the degree of the nodes involved. In the left panel, a low-degree node is perturbed resulting in a larger distortion (0.7) compared to when a high-degree node is perturbed in the right panel (0.525). The difference in distortion highlights the impact of degree on the algorithm's sensitivity.", "section": "3.2 Private Graph Diffusions"}, {"figure_path": "aon7bwYBiq/figures/figures_5_1.jpg", "caption": "Figure 2: RDP vs. Total Diffusion Step K with Y1,k = 0.8, Y2,k = 0, Y3,k = 0.2, α = 2, σ = 0.01, and η = 10-5.", "description": "The figure compares the Rényi Differential Privacy (RDP) guarantees of the proposed method (Theorem 1) and the standard composition theorem for different numbers of iterations (K) in a graph diffusion process.  The x-axis represents the number of iterations, and the y-axis shows the RDP privacy budget (ε).  The plot demonstrates that the RDP budget for the proposed method remains relatively constant as the number of iterations increases, while the RDP budget for the composition theorem grows linearly. This highlights the advantage of the proposed method in maintaining strong privacy guarantees even with many iterations.", "section": "Experiments"}, {"figure_path": "aon7bwYBiq/figures/figures_6_1.jpg", "caption": "Figure 3: Setting: Graph Diffusion with Y1,k = 0.8, Y2,k = 0, Y3,k = 0.2.", "description": "This figure compares the ∞-Wasserstein distance (a novel method introduced in the paper) to the diameter of the thresholding function (the original method from Altschuler et al. [27]). The results show that the ∞-Wasserstein distance provides a significantly tighter bound on the parameter set diameter, leading to a more practical and applicable privacy guarantee.  The x-axis represents the threshold parameter (η), while the y-axis represents the distance metric (w).  The plot demonstrates that the ∞-Wasserstein tracking method offers a substantially improved bound compared to using the diameter of the parameter set, especially as the threshold parameter increases.", "section": "Ablation Study"}, {"figure_path": "aon7bwYBiq/figures/figures_8_1.jpg", "caption": "Figure 4: Trade-off between NDCG and Personalized Edge-level Privacy.", "description": "The figure compares the performance of three different approaches (PushFlowCap, EdgeFlipping, and the proposed method) for personalized PageRank computation under various privacy levels (epsilon).  NDCG@100 is used as a metric to evaluate the ranking performance of the methods. The results are shown for three different datasets (BlogCatalog, TheMarker, and Flickr). The figure illustrates the trade-off between privacy (epsilon) and utility (NDCG@100) for each method across different datasets.", "section": "4 Experiments"}, {"figure_path": "aon7bwYBiq/figures/figures_8_2.jpg", "caption": "Figure 5: Trade-off between Recall and Personalized Edge-level Privacy.", "description": "This figure compares the performance of three different methods (PushFlowCap, EdgeFlipping, and Ours) for personalized PPR computation on three real-world datasets (BlogCatalog, TheMarker, and Flickr) across various privacy budgets (epsilon).  The Recall@100 metric is used to evaluate the ranking accuracy.  Error bars are included. The figure shows that the 'Ours' method consistently outperforms the baselines, particularly in stricter privacy settings.", "section": "4.1 Evaluating Privacy-Utility Tradeoffs on Ranking Tasks"}, {"figure_path": "aon7bwYBiq/figures/figures_8_3.jpg", "caption": "Figure 6: Effectiveness of degree-based thresholding function f and ∞-Wasserstein distance tracking.", "description": "This figure shows the impact of using a degree-based thresholding function (f) and ∞-Wasserstein distance tracking on the privacy-utility tradeoff in the context of graph diffusion.  The x-axis represents the privacy budget (epsilon, ε), and the y-axis represents the NDCG@100 score, a measure of ranking performance.  Several methods are compared: Graph Dependent with ∞-Wasserstein tracking (best performance), Graph Independent with ∞-Wasserstein tracking (performs worse than graph-dependent method), Graph Dependent using the diameter induced by f (performs similarly to the graph-independent method with ∞-Wasserstein tracking), Graph Independent using the diameter induced by f, Graph Dependent with l1 projection (performs poorly), and Graph Independent with l1 projection (performs poorly).  The results demonstrate the superiority of using both the degree-based thresholding and ∞-Wasserstein tracking for achieving a better balance between privacy and utility.", "section": "4.2 Ablation Study"}, {"figure_path": "aon7bwYBiq/figures/figures_15_1.jpg", "caption": "Figure 1: Illustration of Distortion from Edge Perturbations over Adjacent Graphs for Nodes with Low and High Degrees.", "description": "This figure demonstrates how edge perturbations in graphs with different node degrees lead to varying levels of distortion after graph diffusion.  The left side illustrates an edge perturbation on a low-degree node, resulting in a relatively high distortion of 0.7 after diffusion. In contrast, the right side shows an edge perturbation on a high-degree node, producing a much lower distortion of 0.525. This highlights that edge perturbations on low-degree nodes have a greater impact on the graph diffusion process.", "section": "3 Methodology"}, {"figure_path": "aon7bwYBiq/figures/figures_17_1.jpg", "caption": "Figure 8: Running Time for a Single Trial of Experiments with a Privacy Budget of ε = 0.1.", "description": "This figure compares the running time of three different methods (Our Method, DP-PUSHFLOWCAP, and Edge-Flipping) for computing Personalized PageRank (PPR) on three real-world datasets (BlogCatalog, TheMarker, and Flickr). The privacy budget is set to ε = 0.1.  The results show that Our Method and DP-PUSHFLOWCAP are significantly faster than Edge-Flipping, especially as the dataset size increases. Edge-Flipping's running time ranges from 16 minutes to over 12 hours.  In contrast, Our Method and DP-PUSHFLOWCAP complete within 1 minute.", "section": "D.2 Running Time"}, {"figure_path": "aon7bwYBiq/figures/figures_18_1.jpg", "caption": "Figure 9: Transition Curves of Thresholding Parameter η Relative to Privacy Budget ε for Three Benchmark Datasets.", "description": "This figure displays heatmaps showing the relationship between the threshold parameter η, privacy budget ε, and NDCG@100 for three different datasets (BlogCatalog, TheMarker, Flickr).  Each heatmap shows how the NDCG@100 score varies across different values of η and ε. The yellow dots highlight the optimal η value for each privacy budget. This visualization helps to understand the tradeoff between privacy and utility (NDCG score) and illustrates the impact of different thresholding strategies on the performance of the proposed differentially private personalized PageRank algorithm.", "section": "Additional Experiments"}, {"figure_path": "aon7bwYBiq/figures/figures_19_1.jpg", "caption": "Figure 10: Left: Ranking performance with Laplace and Gaussian noise injection. Right: Comparison of noise scales between our method (Theorem 1) and the composition theorem under the DP metric.", "description": "This figure compares the performance of using Laplace noise versus Gaussian noise in the proposed graph diffusion method.  The left panel shows that Laplace noise consistently outperforms Gaussian noise across different privacy budgets (epsilon). The right panel illustrates a comparison of the required noise scales for achieving a target privacy budget epsilon, contrasting the proposed method's noise calibration with the simpler composition theorem approach. The proposed method significantly reduces the noise scale needed to achieve the same privacy level.", "section": "D.4 Ablation Study"}]