[{"figure_path": "ZEVDMQ6Mu5/tables/tables_7_1.jpg", "caption": "Table 1: Comparison of the proposed curvature score based MIA with prior methods tested on ImageNet, CIFAR100, and CIFAR10 datasets. Results reported are the mean ± std obtained over 3 seeds. For CIFAR10 and CIFAR100 64 shadow models were used and 52 for ImagNet.", "description": "This table compares the performance of the proposed curvature-based membership inference attack (MIA) with several existing MIA methods.  The comparison is done across three different datasets: ImageNet, CIFAR100, and CIFAR10.  The metrics used for comparison are balanced accuracy and AUROC (Area Under the Receiver Operating Characteristic curve).  The results presented are the average values and standard deviations obtained from three independent runs.", "section": "6.2 Membership Inference"}, {"figure_path": "ZEVDMQ6Mu5/tables/tables_16_1.jpg", "caption": "Table 1: Comparison of the proposed curvature score based MIA with prior methods tested on ImageNet, CIFAR100, and CIFAR10 datasets. Results reported are the mean ± std obtained over 3 seeds. For CIFAR10 and CIFAR100 64 shadow models were used and 52 for ImagNet.", "description": "This table compares the performance of the proposed curvature-based membership inference attack (MIA) with several existing MIA methods on three image datasets: ImageNet, CIFAR100, and CIFAR10.  The comparison is done using balanced accuracy and AUROC (Area Under the Receiver Operating Characteristic curve) metrics.  Results are averaged over three different random seeds to provide a measure of stability. The number of shadow models used varies depending on the dataset.", "section": "6.2 Membership Inference"}, {"figure_path": "ZEVDMQ6Mu5/tables/tables_16_2.jpg", "caption": "Table 1: Comparison of the proposed curvature score based MIA with prior methods tested on ImageNet, CIFAR100, and CIFAR10 datasets. Results reported are the mean ± std obtained over 3 seeds. For CIFAR10 and CIFAR100 64 shadow models were used and 52 for ImagNet.", "description": "This table compares the performance of the proposed curvature-based membership inference attack (MIA) against several existing MIA methods.  The comparison is done across three datasets: ImageNet, CIFAR100, and CIFAR10. Performance is measured using balanced accuracy and AUROC (Area Under the Receiver Operating Characteristic curve), which are reported as mean ± standard deviation values, averaged over three separate runs with different random seeds. Note that the number of shadow models used varies depending on the dataset.", "section": "6.2 Membership Inference"}, {"figure_path": "ZEVDMQ6Mu5/tables/tables_16_3.jpg", "caption": "Table 4: Comparison of the proposed curvature score-based MIA with prior methods on CIFAR10 dataset with 1 and 2 augmentations. Results reported are the mean ± std obtained over 3 seeds.", "description": "This table presents the performance comparison of the proposed curvature-based membership inference attack (MIA) against existing state-of-the-art methods. It compares the balanced accuracy and AUROC (Area Under the Receiver Operating Characteristic curve) achieved by the proposed method using zero-order input loss curvature estimation with one augmentation and two augmentations against several other MIA techniques. The results are averaged over three independent runs, and standard deviations are included to demonstrate the stability and reliability of the results.  The table provides quantitative metrics to evaluate the effectiveness of the proposed method relative to existing approaches.", "section": "6.2 Membership Inference"}, {"figure_path": "ZEVDMQ6Mu5/tables/tables_17_1.jpg", "caption": "Table 1: Comparison of the proposed curvature score based MIA with prior methods tested on ImageNet, CIFAR100, and CIFAR10 datasets. Results reported are the mean ± std obtained over 3 seeds. For CIFAR10 and CIFAR100 64 shadow models were used and 52 for ImagNet.", "description": "This table compares the performance of the proposed curvature-based membership inference attack (MIA) with several existing MIA methods across three different datasets: ImageNet, CIFAR100, and CIFAR10.  The metrics used for comparison are Balanced Accuracy and AUROC, calculated across three separate trials. The number of shadow models employed varies across datasets (64 for CIFAR datasets, 52 for ImageNet).", "section": "6.2 Membership Inference"}, {"figure_path": "ZEVDMQ6Mu5/tables/tables_18_1.jpg", "caption": "Table 1: Comparison of the proposed curvature score based MIA with prior methods tested on ImageNet, CIFAR100, and CIFAR10 datasets. Results reported are the mean ± std obtained over 3 seeds. For CIFAR10 and CIFAR100 64 shadow models were used and 52 for ImagNet.", "description": "This table compares the performance of the proposed curvature-based membership inference attack (MIA) with several existing MIA methods.  The comparison is done across three datasets: ImageNet, CIFAR100, and CIFAR10.  The metrics used for comparison are balanced accuracy and AUROC (Area Under the Receiver Operating Characteristic curve). The table shows that the proposed method generally outperforms existing methods, particularly on ImageNet.", "section": "6.2 Membership Inference"}, {"figure_path": "ZEVDMQ6Mu5/tables/tables_18_2.jpg", "caption": "Table 1: Comparison of the proposed curvature score based MIA with prior methods tested on ImageNet, CIFAR100, and CIFAR10 datasets. Results reported are the mean ± std obtained over 3 seeds. For CIFAR10 and CIFAR100 64 shadow models were used and 52 for ImagNet.", "description": "This table compares the performance of the proposed curvature-based membership inference attack (MIA) with several existing MIA methods on three image datasets: ImageNet, CIFAR100, and CIFAR10.  The comparison uses balanced accuracy and AUROC (Area Under the Receiver Operating Characteristic curve) as evaluation metrics.  Results are averaged over three independent runs with different random seeds.  The number of shadow models used in the experiments is also specified.", "section": "6.2 Membership Inference"}]