[{"type": "text", "text": "SSDiff: Spatial-spectral Integrated Diffusion Model for Remote Sensing Pansharpening ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Yu Zhong† University of Electronic Science and Technology of China yuuzhong1011@gmail.com ", "page_idx": 0}, {"type": "text", "text": "Xiao Wu† University of Electronic Science and Technology of China wxwsx1997@gmail.com ", "page_idx": 0}, {"type": "text", "text": "Zihan Cao University of Electronic Science and Technology of China iamzihan666@gmail.com ", "page_idx": 0}, {"type": "text", "text": "Hong-Xia Dou Xihua University hongxiadou1991@126.com ", "page_idx": 0}, {"type": "text", "text": "Liang-Jian Deng∗ University of Electronic Science and Technology of China liangjian.deng@uestc.edu.cn ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Pansharpening is a significant image fusion technique that merges the spatial content and spectral characteristics of remote sensing images to generate highresolution multispectral images. Recently, denoising diffusion probabilistic models have been gradually applied to visual tasks, enhancing controllable image generation through low-rank adaptation (LoRA). In this paper, we introduce a spatialspectral integrated diffusion model for the remote sensing pansharpening task, called SSDiff, which considers the pansharpening process as the fusion process of spatial and spectral components from the perspective of subspace decomposition. Specifically, SSDiff utilizes spatial and spectral branches to learn spatial details and spectral features separately, then employs a designed alternating projection fusion module (APFM) to accomplish the fusion. Furthermore, we propose a frequency modulation inter-branch module (FMIM) to modulate the frequency distribution between branches. The two components of SSDiff can perform favorably against the APFM when utilizing a LoRA-like branch-wise alternative fine-tuning method. It refines SSDiff to capture component-discriminating features more sufficiently. Finally, extensive experiments on four commonly used datasets, i.e., WorldView-3, WorldView-2, GaoFen-2, and QuickBird, demonstrate the superiority of SSDiff both visually and quantitatively. The code is available at https://github.com/Z-ypnos/SSdiff_main. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Due to physical limitations, satellite sensors cannot directly acquire high-resolution multispectral images (HrMSI). Instead, they can obtain high-resolution panchromatic (PAN) images and lowresolution multispectral images (LrMSI). Pansharpening techniques can merge PAN images with LrMSI, generating HrMSI that possess both high spatial and spectral resolutions. Pansharpening, as a fundamental preprocessing method, has been widely utilized in various applications, including change detection [37] and image segmentation [45]. ", "page_idx": 0}, {"type": "image", "img_path": "QMVydwvrx7/tmp/c48fac8cc55a7cd2638c2927f589f21d324ed982664b83c04cfdb3356a3d8dff.jpg", "img_caption": ["Figure 1: Schematic of (a) DL-based pansharpening approach in a supervised fashion, in which the “network” can be any deep module, e.g., denoising diffusion probabilistic models (DDPM). The comparison of (b) the LoRA based on DDPM and (c) the proposed APFM in our SSDiff. G and U represent the spectral and spatial domains, respectively. The LoRA can expand learnable weights $\\mathbf{W_{0}}$ with $\\Delta\\mathbf{W}$ (but without applications to pansharpening), and the given APFM can obtain pansharpened HrMSI from PAN image and LrMSI through alternating projections. "], "img_footnote": [], "page_idx": 1}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "Pansharpening methods are roughly categorized into four types: component substitution (CS) methods, multi-resolution analysis (MRA) methods, variational optimization (VO) techniques, and deep learning (DL) methods, as shown in Fig. 1 (a). The CS method [17, 22] involves projecting the LrMSI into a specific domain and replacing the spatial components of the LrMSI in that domain with the corresponding components from the PAN image. CS-based methods can generate fusion images with high spatial fidelity but spectral distortion with fast runtime. MRA-based methods [24, 32] extract spatial details from the PAN image through multiscale decomposition and inject them into the LrMSI. While MRA-based methods effectively preserve spectral information, they may sacrifice spatial details. Compared to CS-based and MRA-based methods, VO-based techniques [40, 41] gain more mathematical guarantees but require handling a higher computational burden and more adjustable parameters. ", "page_idx": 1}, {"type": "text", "text": "In recent years, DL-based methods [12, 39, 42, 38, 8, 19] have increasingly been applied across various fields, including pansharpening tasks, yielding exciting results. Traditional DL-based methods typically utilize a single-scale model to process information from PAN images and LrMSI. In a single-scale network, PAN images and LrMSI are usually stacked together without distinguishing the information contained within them, serving as inputs to the network. They overlook the disparities in the deep-level information inherent in both, potentially leading to the omission of crucial discriminative features and subsequently influencing lower fusion performance. Then, dual-branch methods [6, 18] based on deep learning can differentiate and hierarchically learn information from PAN and LrMSI. Thanks to this design, it has shown outstanding performance in pansharpening tasks. However, the cumbersome structure of dual-branch networks makes it challenging to perform localized fine-tuning. Denoising diffusion probabilistic model (DDPM) [13] is attaining attention in remote sensing pansharpening [21, 4]. Unfortunately, existing DDPM-based methods have not yet designed models for the discriminative features required in the pansharpening task. ", "page_idx": 1}, {"type": "text", "text": "Considering the characteristics of the pansharpening task, we propose a novel SSDiff method based on subspace decomposition, which leverages spatial and spectral branches to discriminatively capture global spatial information and spectral features, respectively. Additionally, we further construct an alternating projection fusion module (APFM) to fuse the captured spatial and spectral components. Besides, a frequency modulation inter-branch module (FMIM) is designed to overcome the problem of uneven distribution of frequency information between two branches in the denoising process. Finally, through the proposed LoRA-like branch-wise alternating fine-tuning (L-BAF), our SSDiff can further reveal spatial and spectral information not discovered in each branch. The main contributions of this work are as follows: ", "page_idx": 1}, {"type": "text", "text": "• Our SSDiff is based on subspace decomposition to divide the network into spatial and spectral branches. In addition, for subspace decomposition, we give an illustration of vector projection and construct an alternating projection fusion module (APFM). APFM transforms the process of fusing HrMSI into the fusion process of spatial and spectral components. Moreover, our SSDiff is tested on four widely used pansharpening datasets and achieves state-of-the-art (SOTA) performance.   \n• The frequency modulation inter-branch module is used at the junction of spectral and spatial branches to enrich extracted spatial information with more high-frequency information in the denoising process.   \n• The proposed L-BAF method is used to fine-tune the network based on the proposed APFM, where the spatial and spectral branches are updated alternately. This design allows us to alternately fine-tune the two branches without increasing the parameter count, enabling the learning of more discriminative features. ", "page_idx": 2}, {"type": "text", "text": "2 Related Works ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "DL-based Methods. As a simple but effective method, the representative single-scale coupling model, namely PNN [20], first proposes a simple and effective threelayer CNN architecture and achieves the best results at that time. Subsequently, other methods such as FusionNet [5], DCFNet [39], and others adopt similar coupled input approaches and successfully design their networks. However, these methods still have significant room for improvement in spectral fidelity and generalization performance due to weak feature representation in their network structure designs. In multi-source image fusion tasks, images acquired from diverse sources exhibit varying characteristics. Coupling two information sources together may suffer from inadequate feature extraction. Then, spatial and spectral branches methods [6, 18, 25] based on deep learning can differentiate and hierarchically learn information from PAN images and LrMSI. These methods can better exploit the potential advantages of multi-scale information. ", "page_idx": 2}, {"type": "image", "img_path": "QMVydwvrx7/tmp/4f8d377939dd2dbbf56e20d4c3138780cf5436bc378592e0f8c287421c052d58.jpg", "img_caption": ["Figure 2: Schematic diagram of the relationship between subspace decomposition and self-attention mechanism. $f(\\bar{\\mathbf{Q}},\\mathbf{K})$ is the classic self-similarity equation in selfattention mechanism. "], "img_footnote": [], "page_idx": 2}, {"type": "text", "text": "Diffusion-based Model. DDPM, as a generative model, has been widely applied in various domains such as text-to-image generation [26], image editing [16] and image classification [43]. In recent years, DDPM has shown its prominence in image processing tasks [9, 28, 44]. Among them, Song et al. [28] propose denoising diffusion implicit models (DDIM), where they design a non-Markov chain sampling process, accelerating the sampling of diffusion models. Then, through some simple modifications, IDDPM [23] achieves competitive log-likelihoods while preserving the high sample quality of DDPM. Currently, DDPM is attracting attention in the field of pansharpening [21, 4]. These DDPM-based methods treat PAN and LrMSI as model fusion conditions, unlike other pansharpening methods where they serve as fusion targets. ", "page_idx": 2}, {"type": "text", "text": "LoRA: Low-rank Adaptation of Large Language Models. For the fine-tuning of parameters in large pre-trained models, Hu et al. [14] introduce the LoRA to freeze the pre-trained model weights and inject trainable low-rank decomposition matrices into each layer of the Transformer architecture. This significantly reduces the number of trainable parameters for downstream tasks. For $\\mathbf{H}=\\mathbf{W_{0}}\\mathbf{X}$ , the modified forward pass of the LoRA follows the formula: ", "page_idx": 2}, {"type": "equation", "text": "$$\n\\mathbf{H}=\\mathbf{W_{0}}\\mathbf{X}+\\Delta\\mathbf{W}\\mathbf{X}=\\mathbf{W_{0}}\\mathbf{X}+\\mathbf{B}\\mathbf{A}\\mathbf{X},\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "where $\\mathbf{W_{0}}\\in\\mathbb{R}^{d\\times k}$ is a pre-trained weight matrix, $\\mathbf{X}\\in\\mathbb{R}^{k\\times n}$ , $\\mathbf{B}\\in\\mathbb{R}^{d\\times r}$ , $\\mathbf{A}\\in\\mathbb{R}^{r\\times k}$ , and the rank ≪min(d, k). Actually, W0 + ∆W $\\mathbf{W_{0}}+\\Delta\\mathbf{W}\\,{\\overset{\\cdot}{=}}\\,\\mathbf{W_{0}}+\\mathbf{BA}$ represents a low-rank decomposition. ", "page_idx": 2}, {"type": "text", "text": "Motivation. PAN images and LrMSI are obtained from different sensors and contain distinct feature information. PAN images exhibit richer spatial details, while LrMSI possesses more abundant spectral information. However, existing DDPM-based methods have not yet designed models specifically for the discriminative features required in the pansharpening task. As a result, these methods suffer from issues such as insufficient feature learning and generalization capabilities, though they may employ low-rank adaptation (LoRA) to improve the performance of DDPM for the pansharpening task. ", "page_idx": 2}, {"type": "image", "img_path": "QMVydwvrx7/tmp/38ed166ec405ec2fcb3c4ae8d00c69d9c7128c8b389d777e31e61fa8b09bddfe.jpg", "img_caption": ["Figure 3: Overall framework of the proposed SSDiff. $\\epsilon_{t}=\\sqrt{1-\\bar{\\alpha}_{t}}\\epsilon$ is a Gaussian noise, where $t$ is the time step. $\\mathcal{F}_{s p a}$ is the output of the spatial branch, and $\\mathcal{F}_{s p e}$ is the output of the spectral branch. The process of APFM follows Theorem 1. "], "img_footnote": [], "page_idx": 3}, {"type": "text", "text": "", "page_idx": 3}, {"type": "text", "text": "To alleviate these problems, we propose SSDiff, which transforms the problem of solving HrMSI into a fusion problem of spatial and spectral components. Significantly, we give an illustration of linear algebra to remove the gap between subspace decomposition and the self-attention mechanism. The SSDiff utilizes vector projection to discriminatively capture global spatial information and spectral features in spatial and spectral branches. By introducing subspace decomposition, we can further illustrate and generalize the vector projection to the matrix form. Based on this, we propose an APFM that naturally decouples spatial and spectral information and fuses the captured features. Unlike the LoRA method, the APFM can establish low-rank representations for the spatial-spectral branches more accurately, as shown in Fig. 1. Furthermore, the spectral branch contains abundant low-frequency information. When low- and high-frequency information from the spatial branch is injected into the spectral branch, it may result in an overemphasis on low-frequency information, impacting the denoising performance of the model. Based on this, we propose FMIM to modulate the frequency information between different branches. The overall model is trained by L-BAF to uncover spatial and spectral information not discovered in each branch. ", "page_idx": 3}, {"type": "text", "text": "3 Methodology ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "3.1 SSDiff Architecture ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "Inspired by the LoRA approach, we view the pansharpening task as the fusion of spatial and spectral components, where the spatial and spectral elements can be considered as a matrix decomposition of a multi-spectral image. Based on these characteristics, our SSDiff employs a model comprising a spatial branch and a spectral branch, as shown in Fig. 3. Both the spatial branch and the spectral branch comprise two encoder layers and two decoder layers. Down-sampling occurs between the encoder layers to decrease the spatial resolution while increasing the number of channels. Up-sampling operation between the two layers of the decoder increases the spatial resolution while decreasing the number of channels, and a down-sampling convolution layer connects the encoder and the decoder. The spatial branch employs ResNet [11] blocks to convert spatial images into features. These spatial features are transmitted to corresponding layers in the spectral branch via a frequency modulation inter-branch module. Additionally, fusing incoming spatial features and spectral information via an alternating projection fusion module. ", "page_idx": 3}, {"type": "text", "text": "Eventually, it is delivered to the next stage via an MLP. In this work, we convert the objective from $\\epsilon$ to $x_{0}$ , so the loss function $\\mathcal{L}_{s i m p l e}$ [4] takes the following form: ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\mathcal{L}_{s i m p l e}=\\mathbb{E}\\left[\\left\\|x_{0}-x_{\\theta}(\\mathbf{x}_{t},\\mathbf{c},t)\\right\\|_{1}\\right],\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "where $x_{\\theta}$ denotes the prediction of the model and c is the conditions for injecting the model. Inspired by FusionNet [5], our SSDiff changes the forward and backward denoising objects during the training process from HrMSI to the difference between HrMSI and up-sampled LrMSI. The detailed training process of SSDiff can be found in Appendix. D. ", "page_idx": 4}, {"type": "text", "text": "3.2 Alternating Projection Fusion ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "This section starts with vector projection in linear algebra (See Lemma 1) and subspace decomposition (See Definition 1) to illustrate vector projection as a specific subspace decomposition. Then, the selfattention mechanism [30] is generalized into the proposed alternating projection fusion framework, i.e., APFM. In what follows, we rewrite vector projection as follows. ", "page_idx": 4}, {"type": "text", "text": "Lemma 1 ([29]). Assuming that the existing two arbitrary vectors $\\mathbf{a}\\,\\in\\,d o m\\mathbf{U}\\,\\in\\,\\mathbb{R}^{n}$ and $\\textbf{b}\\in$ domG $\\in\\mathbb{R}^{n}$ , then $\\mathbf{Pb}=\\lambda\\mathbf{a}=\\mathbf{p},$ , we have the following formula: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\mathbf{p}=\\frac{\\mathbf{a}\\mathbf{a}^{T}}{\\mathbf{a}^{T}\\mathbf{a}}\\mathbf{b}.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $\\mathbf{P}$ is projection matrix, $\\lambda$ is the scaling factor, and $\\mathbf{p}$ is the vector in the same domain as a. ", "page_idx": 4}, {"type": "text", "text": "Proof. For any two vectors a and $\\mathbf{b}$ , there exists a vector $\\mathbf{e}=\\mathbf{p}-\\mathbf{b}$ such that $\\mathbf{e}$ is orthogonal to a. We have the following equation: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\mathbf{a}^{T}\\mathbf{e}=\\mathbf{a}^{T}(\\mathbf{p}-\\mathbf{b})=\\mathbf{a}^{T}(\\lambda\\mathbf{a}-\\mathbf{b})=0,\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "thus, we have ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\lambda=\\frac{\\mathbf{a}^{T}\\mathbf{b}}{\\mathbf{a}^{T}\\mathbf{a}}.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Taking Eq. (5) into $\\mathbf{Pb}=\\lambda\\mathbf{a}=\\mathbf{p}$ , we have the conclusion: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\mathbf{p}=\\mathbf{P}\\mathbf{b}=\\mathbf{a}\\lambda={\\frac{\\mathbf{a}\\mathbf{a}^{T}}{\\mathbf{a}^{T}\\mathbf{a}}}\\mathbf{b}.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Definition 1 ([7]). Assume that $\\mathbf{D}\\in\\mathbb{R}^{S\\times L}$ is the subspace and $\\mathbf{C}\\in\\mathbb{R}^{L\\times H W}$ is the corresponding coefficients. We have: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\mathbf{Z}=\\mathbf{D}\\mathbf{C}.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "Based on subspace decomposition, we can take spatial and spectral components to accomplish the pansharpening of remote sensing images. According to Lemma 1, we can further determine a specific subspace decomposition in Definition 1. The subspace represents the projection relationship between vectors a and b. Interestingly, we find that we can generalize Eq. (3) and Eq. (7) to the matrix form of the self-attention mechanism, as shown in Fig. 2. In other words, the self-attention mechanism is represented as the vector projection of Eq. (3), which is the low-rank subspace decomposition. ", "page_idx": 4}, {"type": "text", "text": "Remark 1. Back to the pansharpening applications, the input PAN and LrMSI are mapped to a high-dimensional feature space. The features often exhibit significant correlations between frequency bands, while spectral vectors typically reside in a low-dimension subspace. These features can be represented as Eq. (7). In this way, the characteristics in the image domain can be transformed into the subspace. ", "page_idx": 4}, {"type": "text", "text": "Based on the above analysis, we can build an alternating projection framework, which is summarized in the following theorem. ", "page_idx": 4}, {"type": "text", "text": "Theorem 1. Assuming that $\\mathcal{F}_{s p a}\\in\\mathbb{R}^{H\\times W\\times S}$ and $\\mathcal{F}_{s p e}\\in\\mathbb{R}^{H\\times W\\times S}$ from the spatial and spectral branches, they can be alternatively projected as follows: ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\mathbf{T}^{s p a}=S o f t m a x\\left(\\frac{\\mathbf{T}_{a}\\mathbf{T}_{b}^{T}}{\\sqrt{S^{\\prime}}}\\right)\\mathbf{T}_{c}^{T},\\;\\;\\mathbf{T}^{s p e}=S o f t m a x\\left(\\frac{\\mathbf{T}_{c}\\mathbf{T}_{d}^{T}}{\\frac{\\sqrt{(S^{\\prime})^{3}}}{H W}}\\right)\\mathbf{T}_{a}^{T},\n$$", "text_format": "latex", "page_idx": 4}, {"type": "image", "img_path": "QMVydwvrx7/tmp/399b37c53945577761b7ec0c69d694198e06da6f2d79befef68c14c9805105b3.jpg", "img_caption": ["Figure 4: The denoising process. The top row consists of a series of iteratively generated images from the gradual denoising process. The subsequent two rows represent the associated low-frequency and high-frequency spatial domain information obtained through inverse Fourier transform from the denoised image in the first row of each corresponding step. "], "img_footnote": [], "page_idx": 5}, {"type": "text", "text": "where $\\mathbf{T}^{s p a}\\in\\mathbb{R}^{H W\\times S^{\\prime}}$ and $\\mathbf{T}^{s p e}\\in\\mathbb{R}^{S^{\\prime}\\times H W}$ denote the features of spatial domain and spectral domain separately. $\\mathbf{T}_{a}\\in\\mathbb{R}^{H W\\times S^{\\prime}}$ and $\\mathbf{T}_{b}\\in\\mathbb{R}^{H W\\times S^{\\prime}}$ are features in the spatial domain generated by $\\mathcal{F}_{s p a}$ , where $S^{\\prime}$ is the channel of self-attention. $\\mathbf{T}_{c}\\in\\mathbb{R}^{S^{\\prime}\\times H W}$ and $\\mathbf{T}_{d}\\in\\mathbb{R}^{S^{\\prime}\\times H W}$ are features in the spectral domain generated by Fspe.√S′ and H(SW′)3a re constants related to the matrix size. Softmax stands for the Softmax function. ", "page_idx": 5}, {"type": "text", "text": "Proof. According to Lemma 1, we can generalize the self-attention mechanism [30], where $\\mathbf{Q}$ and $\\mathbf{K}$ are the features from domU, and $\\mathbf{V}$ is the feature from domG, respectively. Thus, we have: ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\mathrm{Softmax}(\\frac{\\mathbf{Q}\\mathbf{K}^{T}}{\\sqrt{d_{k}}})\\Rightarrow\\frac{\\mathbf{a}\\mathbf{a}^{T}}{\\mathbf{a}^{T}\\mathbf{a}},\\ \\mathbf{V}\\Rightarrow\\mathbf{b},\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $\"\\Rightarrow\"$ suggests that the left and right parts of the equation are similar in form, and the left side is a special case of the right side. Through this equation, we can partially explain the principle of cross-attention using the vector projection theorem. Then we transform the projection relationship between the spatial domain (domU) and spectral domain (domG), where $\\mathbf{T}_{a},\\mathbf{T}_{b}\\in$ domU and $\\mathbf{T}_{c},\\mathbf{T}_{d}\\in\\mathrm{dom}\\mathbf{G}$ . $d$ is a self-attention constant. As a result, the alternating projection is complete from the spatial/spectral domain to the spectral/spatial domain, i.e., Eq. (8). 口 ", "page_idx": 5}, {"type": "text", "text": "In addition, we need to get fused outputs from $\\mathbf{T}^{s p a}$ and $\\mathbf{T}^{s p e}$ . Without loss of generality, we have ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\mathbf{T}^{f u s}=\\mathbf{T}^{s p a}\\odot\\mathbf{T}^{s p e},\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $\\odot$ defines element-wise multiplication. Element-wise multiplication is used to fuse spatial and spectral information to obtain Tfus ∈RHW ×S. ", "page_idx": 5}, {"type": "text", "text": "Comparing Eq. (3) with Eq. (8), this subspace is built by vector projection and naturally decouples spatial and spectral information into the self-attention mechanism. This inspires us to apply a fine-tuning method similar to LoRA methods (See details in Sect. 3.4). ", "page_idx": 5}, {"type": "text", "text": "3.3 Frequency Modulation Inter-branch Module ", "text_level": 1, "page_idx": 5}, {"type": "text", "text": "Through the APFM, we build an effective fusion module from the characteristics of images. Interestingly, there are some differences between the spatial and spectral components. The spectral branch contains abundant low-frequency information. When low- and high-frequency information from the spatial branch is injected into the spectral branch, it may result in an overemphasis on low-frequency information, impacting the denoising performance of the model. We found that modulating the frequency distribution contributes to SSDiff obtaining better fusion results. ", "page_idx": 5}, {"type": "text", "text": "As shown in Fig. 4, the low-frequency components undergo a gradual modulation characterized by a slow and subtle rate of change in the denoising process. In contrast, the modulation process of the high-frequency components exhibits distinct dynamic variation. Considering the above phenomenon, we design a frequency modulation inter-branch module. Specifically, we utilize a Fourier filter to extract the high-frequency information of the feature map $\\mathbf{x}_{s p a}$ obtained from the spatial branch, following: ", "page_idx": 5}, {"type": "image", "img_path": "QMVydwvrx7/tmp/aff93444ea26ca89342cf1ccfbb599f37f9f0d756dc2302f0e003ccb9ba4cfe2.jpg", "img_caption": ["Figure 5: Visual comparisons on a reduced-resolution WorldView-3 and GaoFen-2 case. The first two rows are the results of WV3, and the last two rows are the results of GF2. The first and third rows are the predicted HrMSI for each method, and the second and fourth rows are the error maps of the predicted HRMS versus ground truth (GT) for each one. "], "img_footnote": [], "page_idx": 6}, {"type": "text", "text": "", "page_idx": 6}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\mathcal{F}^{\\prime}(\\mathbf{x}_{s p a})=\\mathbf{F}\\mathbf{F}\\mathbf{T}(\\mathbf{x}_{s p a})\\odot\\boldsymbol{\\alpha},}\\\\ {\\mathbf{x}_{s p a}^{\\prime}=\\mathbf{IFFT}(\\mathcal{F}^{\\prime}(\\mathbf{x}_{s p a})),}\\end{array}\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "where FFT and IFFT are Fourier transform and inverse Fourier transform. $\\odot$ denotes element-wise multiplication, and $\\alpha$ is a Fourier mask [27]. Furthermore, we find in experiments that directly injecting high-frequency information into spectral branches will cause the frequency information imbalance. To solve this problem, half of the channels of feature $\\mathbf{x}_{s p e c}$ of the spectral branch are multiplied by a constant. For the three different channel numbers in the model, ranging from low to high, we set this constant to 1.2, 1.4, and 1.6, respectively. ", "page_idx": 6}, {"type": "text", "text": "3.4 LoRA-like Branch-wise Alternative Fine-tuning ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "During the model training process, it is crucial to carefully maintain a balance between model underftiting and overftiting. Our SSDiff can hierarchically and discriminatively extract more features. However, achieving a simultaneous balance condition for both spatial and spectral branches during unified training is undoubtedly challenging. Therefore, this paper approaches the LoRA-like alternate fine-tuning of each branch as a feasible solution. As shown in Fig. 1, LoRA methods fine-tune the output of the model by updating the parameters on the fully connected layer weights. Compared with LoRA, the proposed alternating projection method is also a low-rank matrix decomposition. In Fig. 1 (b), the difference is that we can have the backpropagation process and control the gradient of the projection process to achieve alternate fine-tuning in the proposed APFM. In practice, taking the fine-tuning of Eq. (8) $(\\mathbf{T}^{s p a})$ as an example to update the spectral branch, we can detach the gradient propagation at $\\mathbf{T}^{s p a}$ , preventing parameter updates in the spatial branch. In this case, gradients only propagate through the path shown in Eq. (8) $(\\mathbf{T}^{s p e})$ , which means only the parameters of the spectral branch are updated. Similarly, when fine-tuning the spatial branch, detaching the gradient propagation from the computation graph at $\\mathbf{T}^{s p e}$ can prevent parameter updates in the spectral branch. A more intuitive fine-tuning process is provided in the supplementary material. ", "page_idx": 6}, {"type": "table", "img_path": "QMVydwvrx7/tmp/a355b328509cf8d44c990566d006d1e4e95d82c44afc3507386952494eb8970d.jpg", "table_caption": ["Table 1: Result on the WV3 (the first thirteen rows) and GF2 (the last thirteen rows) reducedresolution and full-resolution datasets. The best results are highlighted in bold and the second best results are underlined. "], "table_footnote": [], "page_idx": 7}, {"type": "text", "text": "4 Experiments ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "4.1 Experimental Results ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "Results on WorldView-3. On the WorldView-3 dataset, we evaluate the performance of SSDiff using 20 test images. The results for both reduced-resolution and full-resolution are presented in Table 1. The running time of a single picture during the sampling process is 7.417 seconds under 10 timesteps. We compared our method with three traditional methods and some SOTA DL-based methods. To illustrate the performance of each method more clearly, we presented the fusion result images and error maps of some of these methods in Fig. 5, and zoomed in on a specific location. On average, our method achieves SOTA performance on the reduced dataset, with our SSDiff reaching 2.84 (SAM) and 2.10 (ERGAS) metrics, outperforming all DL-based methods. The error map indicates that the images sampled by SSDiff are closer to the ground truth (GT). SSDiff achieves SOTA performance in obtaining full-resolution images on the WV3 dataset. The HQNR score close to 1 indicates better fusion quality of the full-resolution images. The obtained results demonstrate that our SSDiff can fuse HrMSI, reducing spatial and spectral distortions, thereby proving its excellent generalization ability at full resolution. ", "page_idx": 7}, {"type": "text", "text": "Results on GaoFen-2. On the GaoFen-2 reduced dataset, we tested our SSDiff on 20 test images, as shown in Table 1. Our SSDiff achieves SOTA performance. From the error maps in Fig. 5, we can observe that there are still significant differences between traditional fusion methods and DL-based fusion methods. These experiments demonstrate that, compared to other DL-based methods used for comparison in the experiments, the proposed SSDiff exhibits superior spatial performance and effectively preserves spectral information. ", "page_idx": 7}, {"type": "text", "text": "4.2 Ablation Study ", "text_level": 1, "page_idx": 7}, {"type": "text", "text": "Effectiveness of Decoupling Branches. To investigate the effectiveness of the spatial and spectral branch design, we perform ablation experiments by training the diffusion model under the following conditions: V1) Coupling inputs, and training only with the spatial branch. V2) Coupling inputs and training only with the spectral branch. V3) Spatial and spectral branch structure and decoupling inputs, only the outputs of the two branches are concatenated without any inter-branch information interaction. V4) Spatial and spectral branch structure and decoupling inputs, replace each APFM with an additional operation, i.e., the way of LoRA. V5) Spatial and spectral branch structure and decoupling inputs, replace each APFM with a multiplication operation. V6) Our method. The results on the WV3 reduced dataset are reported in Table 2. Training solely with a single branch significantly reduces the quality of the HrMSI. It can be seen that SSDiff is more suitable for pansharpening tasks than the LoRA way, multiplication, and concatenating way. ", "page_idx": 7}, {"type": "text", "text": "", "page_idx": 8}, {"type": "table", "img_path": "QMVydwvrx7/tmp/1200d90a04273ba8849fee5733ceba57aea2c313715f1f8e40c27e90f0722c5c.jpg", "table_caption": ["Table 2: Ablation study on 20 reduced-resolution samples from WV3 dataset without fine-tuning. "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "Frequency Modulation Inter-branch Module. To validate the effectiveness of the FMIM, we remove FMIM from our model and train the diffusion model to converge the WV3 dataset. The results are shown in Table 3. Without using FMIM, the model’s performance on the SAM/ERGAS/Q8 indicators decreased by approximately $3.1\\%/2.8\\%/1\\%$ , respectively. This demonstrates that utilizing FMIM for frequency transfer can effectively improve model performance. ", "page_idx": 8}, {"type": "table", "img_path": "QMVydwvrx7/tmp/50e5a05bb070181d2a3e8d6f732e3563ba10ef4f99a204da10e3141b20ee5ce6.jpg", "table_caption": ["Table 3: Ablation study on 20 reduced-resolution samples from WV3 dataset without fine-tuning. "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "4.3 Discussion ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "Generalization. To test the generalization ability of DL-based methods, we evaluated models trained on the WV3 dataset using 20 reduced resolutions from the WorldView-2 dataset. The quantitative evaluation results, as reported in Table 4, demonstrate that the SSDiff method achieves the best results across all four evaluation metrics. This indicates that our approach possesses a powerful generalization ability. ", "page_idx": 8}, {"type": "table", "img_path": "QMVydwvrx7/tmp/56b3096f603c43177debed253c4b1d086c09e8fd5f33c5046cbbf9f0740acc62.jpg", "table_caption": ["Table 4: Generalization of DL-based methods on WV2 dataset. "], "table_footnote": [], "page_idx": 8}, {"type": "text", "text": "Training SSDiff. To address the issue of insufficient local parameter training in the dual branches model, we design the L-BAF method to fine-tune the model. Taking the experiments on the reduced WV3 dataset, we first train the model without fine-tuning until convergence and perform branch-wise fine-tuning, which includes: 1) Full parameter fine-tuning without L-BAF. 2) Only fine-tuning the spatial branch parameters with the spectral branch parameters fixed. 3) Only fine-tuning the spectral branch parameters with the spatial parameters fixed. 4) Alternating fine-tuning spectral branch and spatial branch. The quantitative results are shown in Table 5, and all three branch-wise fine-tuning methods lead to improved testing performance. The results of full fine-tuning show a decrease in some metrics, indicating that the method suffers from overfitting. The alternating fine-tuning approach showed the most significant performance improvement. This demonstrates the effectiveness of the L-BAF. ", "page_idx": 8}, {"type": "text", "text": "", "page_idx": 9}, {"type": "table", "img_path": "QMVydwvrx7/tmp/e6818344df082893a44d86324ed7a32cc092c097d6de9230df953a7d81dc8c2c.jpg", "table_caption": ["Table 5: Fine-tune SSDiff. $\\boldsymbol{S}$ and $\\mathcal{F}$ denote fine-tuning of spatial and spectral branches, respectively. "], "table_footnote": [], "page_idx": 9}, {"type": "text", "text": "5 Conclusion ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "In this paper, we propose a spatial-spectral integrated diffusion model for remote sensing pansharpening, named SSDiff. We design a spatial-spectral integrated model architecture, which utilizes spatial and spectral branches to learn spatial details and spectral features separately. By introducing vector projection, the spatial and spectral components in the subspace decomposition are further specified in the proposed APFM. Then, the self-attention mechanism is naturally generalized to the APFM. Furthermore, we propose an FMIM to modulate the frequency distribution between branches. Finally, the two branches of SSDiff can capture discriminating features. It is interesting that, when utilizing the proposed L-BAF method in the APFM, the two branches can be updated alternately, and then SSDiff produces more satisfactory results. We compare our SSDiff with several SOTA pansharpening methods on the WorldView-3, QuickBird, GaoFen-2, and WorldView-2 datasets. The results demonstrate the superiority of SSDiff both visually and quantitatively. ", "page_idx": 9}, {"type": "text", "text": "6 Acknowledgement ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "This work is supported by the National Natural Science Foundation of China under Grants 12271083, 12171072 and Natural Science Foundation of Sichuan Province under Grants 2023NSFSC1341. ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "[1] Bruno Aiazzi, L Alparone, Stefano Baronti, Andrea Garzelli, and Massimo Selva. Mtf-tailored multiscale fusion of high-resolution ms and pan imagery. Photogrammetric Engineering & Remote Sensing, 72(5):591–596, 2006.   \n[2] Bruno Aiazzi, Luciano Alparone, Stefano Baronti, and Andrea Garzelli. Context-driven fusion of high spatial and spectral resolution images based on oversampled multiresolution analysis. IEEE Transactions on Geoscience and Remote Sensing, 40(10):2300–2312, 2002.   \n[3] Alberto Arienzo, Gemine Vivone, Andrea Garzelli, Luciano Alparone, and Jocelyn Chanussot. Full-resolution quality assessment of pansharpening: Theoretical and hands-on approaches. IEEE Geoscience and Remote Sensing Magazine, 10(3):168–201, 2022.   \n[4] Zihan Cao, Shiqi Cao, Liang-Jian Deng, Xiao Wu, Junming Hou, and Gemine Vivone. Diffusion model with disentangled modulations for sharpening multispectral and hyperspectral images. Information Fusion, 104:102158, 11 2023.   \n[5] Liang-Jian Deng, Gemine Vivone, Cheng Jin, and Jocelyn Chanussot. Detail injection-based deep convolutional neural networks for pansharpening. IEEE Transactions on Geoscience and Remote Sensing, 59(8):6995–7010, 2020.   \n[6] Shangqi Deng, Liang-Jian Deng, Xiao Wu, Ran Ran, and Rui Wen. Bidirectional dilation transformer for multispectral and hyperspectral image fusion. In Proc. 32nd Int. Joint Conf. Artif. Intell., pages 3633–3641, 2023.   \n[7] Renwei Dian and Shutao Li. Hyperspectral image super-resolution via subspace-based low tensor multi-rank regularization. IEEE Transactions on Image Processing, 28(10):5135–5146, 2019.   \n[8] Junkai Fan, Jiangwei Weng, Kun Wang, Yijun Yang, Jianjun Qian, Jun Li, and Jian Yang. Driving-video dehazing with non-aligned regularization for safety assistance. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 26109–26119, 2024.   \n[9] Sicheng Gao, Xuhui Liu, Bohan Zeng, Sheng Xu, Yanjing Li, Xiaoyan Luo, Jianzhuang Liu, Xiantong Zhen, and Baochang Zhang. Implicit diffusion models for continuous super-resolution. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 10021–10030, 2023.   \n[10] Andrea Garzelli and Filippo Nencini. Hypercomplex quality assessment of multi/hyperspectral images. IEEE Geoscience and Remote Sensing Letters, 6(4):662–665, 2009.   \n[11] Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. Deep residual learning for image recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 770–778, 2016.   \n[12] Lin He, Yizhou Rao, Jun Li, Jocelyn Chanussot, Antonio Plaza, Jiawei Zhu, and Bo Li. Pansharpening via detail injection based convolutional neural networks. IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 12(4):1188–1204, 2019.   \n[13] Jonathan Ho, Ajay Jain, and Pieter Abbeel. Denoising diffusion probabilistic models. Advances in Neural Information Processing Systems, 33:6840–6851, 2020.   \n[14] Edward J Hu, Yelong Shen, Phillip Wallis, Zeyuan Allen-Zhu, Yuanzhi Li, Shean Wang, Lu Wang, and Weizhu Chen. Lora: Low-rank adaptation of large language models. arXiv preprint arXiv:2106.09685, 2021.   \n[15] Zi-Rong Jin, Tian-Jing Zhang, Tai-Xiang Jiang, Gemine Vivone, and Liang-Jian Deng. Lagconv: Local-context adaptive convolution kernels with global harmonic bias for pansharpening. In Proceedings of the AAAI Conference on Artificial Intelligence, volume 36, pages 1113–1121, 2022.   \n[16] Bahjat Kawar, Shiran Zada, Oran Lang, Omer Tov, Huiwen Chang, Tali Dekel, Inbar Mosseri, and Michal Irani. Imagic: Text-based real image editing with diffusion models. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 6007–6017, 2023.   \n[17] P Kwarteng and A Chavez. Extracting spectral contrast in landsat thematic mapper image data using selective principal component analysis. Photogramm. Eng. Remote Sens, 55(1):339–348, 1989.   \n[18] Yixun Liang, Ping Zhang, Yang Mei, and Tingqi Wang. Pmacnet: Parallel multiscale attention constraint network for pan-sharpening. IEEE Geoscience and Remote Sensing Letters, 19:1–5, 2022.   \n[19] Yu-Jie Liang, Zihan Cao, Liang-Jian Deng, and Xiao Wu. Fourier-enhanced implicit neural fusion network for multispectral and hyperspectral image fusion. arXiv preprint arXiv:2404.15174, 2024.   \n[20] Giuseppe Masi, Davide Cozzolino, Luisa Verdoliva, and Giuseppe Scarpa. Pansharpening by convolutional neural networks. Remote Sensing, 8(7):594, 2016.   \n[21] Qingyan Meng, Wenxu Shi, Sijia Li, and Linlin Zhang. Pandiff: A novel pansharpening method based on denoising diffusion probabilistic model. IEEE Transactions on Geoscience and Remote Sensing, 2023.   \n[22] Xiangchao Meng, Jie Li, Huanfeng Shen, Liangpei Zhang, and Hongyan Zhang. Pansharpening with a guided filter based on three-layer decomposition. Sensors, 16(7):1068, 2016.   \n[23] Alexander Quinn Nichol and Prafulla Dhariwal. Improved denoising diffusion probabilistic models. In International Conference on Machine Learning, pages 8162–8171. PMLR, 2021.   \n[24] Xavier Otazu, María González-Audícana, Octavi Fors, and Jorge Núñez. Introduction of sensor spectral response into image fusion methods. application to wavelet-based methods. IEEE Transactions on Geoscience and Remote Sensing, 43(10):2376–2385, 2005.   \n[25] Siran Peng, Chenhao Guo, Xiao Wu, and Liang-Jian Deng. U2net: A general framework with spatial-spectral-integrated double u-net for image fusion. In Proceedings of the 31st ACM International Conference on Multimedia, pages 3219–3227, 2023.   \n[26] Nataniel Ruiz, Yuanzhen Li, Varun Jampani, Yael Pritch, Michael Rubinstein, and Kfir Aberman. Dreambooth: Fine tuning text-to-image diffusion models for subject-driven generation. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 22500–22510, 2023.   \n[27] Chenyang Si, Ziqi Huang, Yuming Jiang, and Ziwei Liu. Freeu: Free lunch in diffusion u-net. arXiv preprint arXiv:2309.11497, 2023.   \n[28] Jiaming Song, Chenlin Meng, and Stefano Ermon. Denoising diffusion implicit models. arXiv preprint arXiv:2010.02502, 2020.   \n[29] Gilbert Strang. Introduction to linear algebra. SIAM, 2022.   \n[30] Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz Kaiser, and Illia Polosukhin. Attention is all you need. Advances in neural information processing systems, 30, 2017.   \n[31] Gemine Vivone. Robust band-dependent spatial-detail approaches for panchromatic sharpening. IEEE transactions on Geoscience and Remote Sensing, 57(9):6421–6433, 2019.   \n[32] Gemine Vivone, Rocco Restaino, and Jocelyn Chanussot. A regression-based high-pass modulation pansharpening approach. IEEE Transactions on Geoscience and Remote Sensing, 56(2):984–996, 2017.   \n[33] Gemine Vivone, Rocco Restaino, and Jocelyn Chanussot. Full scale regression-based injection coefficients for panchromatic sharpening. IEEE Transactions on Image Processing, 27(7):3418– 3431, 2018.   \n[34] Lucien Wald. Data fusion: definitions and architectures: fusion of images of different spatial resolutions. Presses des MINES, 2002.   \n[35] Lucien Wald, Thierry Ranchin, and Marc Mangolini. Fusion of satellite images of different spatial resolutions: Assessing the quality of resulting images. Photogrammetric Engineering and Remote Sensing, 63(6):691–699, 1997.   \n[36] Yancong Wei, Qiangqiang Yuan, Xiangchao Meng, Huanfeng Shen, Liangpei Zhang, and Michael Ng. Multi-scale-and-depth convolutional neural network for remote sensed imagery pan-sharpening. In 2017 IEEE International Geoscience and Remote Sensing Symposium (IGARSS), pages 3413–3416. IEEE, 2017.   \n[37] Chen Wu, Bo Du, Xiaohui Cui, and Liangpei Zhang. A post-classification change detection method based on iterative slow feature analysis and bayesian soft fusion. Remote Sensing of Environment, 199:241–255, 2017.   \n[38] Hongtao Wu, Yijun Yang, Haoyu Chen, Jingjing Ren, and Lei Zhu. Mask-guided progressive network for joint raindrop and rain streak removal in videos. In Proceedings of the 31st ACM International Conference on Multimedia, pages 7216–7225, 2023.   \n[39] Xiao Wu, Ting-Zhu Huang, Liang-Jian Deng, and Tian-Jing Zhang. Dynamic cross feature fusion for remote sensing pansharpening. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 14687–14696, 2021.   \n[40] Zhong-Cheng Wu, Ting-Zhu Huang, Liang-Jian Deng, Jie Huang, Jocelyn Chanussot, and Gemine Vivone. Lrtcfpan: Low-rank tensor completion based framework for pansharpening. IEEE Transactions on Image Processing, 32:1640–1655, 2023.   \n[41] Zhong-Cheng Wu, Ting-Zhu Huang, Liang-Jian Deng, and Gemine Vivone. A framelet sparse reconstruction method for pansharpening with guaranteed convergence. Inverse Problems and Imaging, pages 0–0, 2023.   \n[42] Yijun Yang, Angelica I Aviles-Rivero, Huazhu Fu, Ye Liu, Weiming Wang, and Lei Zhu. Video adverse-weather-component suppression network via weather messenger and adversarial backpropagation. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 13200–13210, 2023.   \n[43] Yijun Yang, Huazhu Fu, Angelica I Aviles-Rivero, Carola-Bibiane Schönlieb, and Lei Zhu. Diffmic: Dual-guidance diffusion network for medical image classification. In International Conference on Medical Image Computing and Computer-Assisted Intervention, pages 95–105. Springer, 2023.   \n[44] Yijun Yang, Hongtao Wu, Angelica I Aviles-Rivero, Yulun Zhang, Jing Qin, and Lei Zhu. Genuine knowledge from practice: Diffusion test-time adaptation for video adverse weather removal. arXiv preprint arXiv:2403.07684, 2024.   \n[45] Xiaohui Yuan, Jianfang Shi, and Lichuan Gu. A review of deep learning methods for semantic segmentation of remote sensing imagery. Expert Systems with Applications, 169:114417, 2021.   \n[46] Roberta H Yuhas, Alexander FH Goetz, and Joe W Boardman. Discrimination among semi-arid landscape endmembers using the spectral angle mapper (sam) algorithm. In JPL, Summaries of the Third Annual JPL Airborne Geoscience Workshop. Volume 1: AVIRIS Workshop, 1992.   \n[47] Jie Zhou, Daniel L Civco, and John A Silander. A wavelet transform method to merge landsat tm and spot panchromatic data. International Journal of Remote Sensing, 19(4):743–757, 1998.   \n[48] Man Zhou, Jie Huang, Yanchi Fang, Xueyang Fu, and Aiping Liu. Pan-sharpening with customized transformer and invertible neural network. In Proceedings of the AAAI Conference on Artificial Intelligence, volume 36, pages 3553–3561, 2022.   \n[49] Man Zhou, Keyu Yan, Jinshan Pan, Wenqi Ren, Qi Xie, and Xiangyong Cao. Memoryaugmented deep unfolding network for guided image super-resolution. International Journal of Computer Vision, 131(1):215–242, 2023. ", "page_idx": 9}, {"type": "text", "text": "", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "A Appendix / supplemental material ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "In the supplementary material, we first introduce the background knowledge, i.e., denoising diffusion probabilistic models, and then illustrate the process of model training and LoRA-like branch-wise alternative fine-tuning, the limitations, and the broader impact of our method. After that, we provide more details for experiments on the pansharpening task, i.e., Implementation Details, Datasets, Benchmarks, and Quality Metrics. Finally, we display more qualitative evaluation results on the QuickBird and GaoFen-2 datasets. ", "page_idx": 13}, {"type": "text", "text": "B Background ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "B.1 Denoising Diffusion Probabilistic Models ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "Denoising diffusion probabilistic models [13] are latent variable models, generating realistic target images progressively from a normal distribution by iterative denoising. The diffusion model contains two steps: forward and reverse processes. ", "page_idx": 13}, {"type": "text", "text": "The forward process aims to make the prior data distribution $\\mathbf{x_{0}}$ noisy by a $T$ step Markov chain that gradually transforms it into an approximate standard normal distribution $\\mathbf{x}_{T}\\sim\\bar{\\mathcal{N}}(0,\\mathbf{I_{d}})$ and $\\mathbf{d}$ denotes the dimension. One forward step is defined as follows: ", "page_idx": 13}, {"type": "equation", "text": "$$\nq(\\mathbf{x}_{t}|\\mathbf{x}_{t-1})=\\mathcal{N}(\\mathbf{x}_{t};\\sqrt{1-\\beta_{t}}\\mathbf{x}_{t-1},\\beta_{t}\\mathbf{I}),\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "where $\\mathcal{N}(\\cdot)$ is a Gaussian distribution with the mean of $\\sqrt{1-\\beta_{t}}\\mathbf{x}_{t-1}$ and variance of $\\beta_{t}\\mathbf{I}$ , $\\beta_{t}$ is a pre-defined variance schedule in time step $t\\in[0,T]$ . Through the reparameterization trick, we can derive $\\mathbf{x}_{t}$ directly from $\\mathbf{x}_{\\mathrm{0}}$ , The following equation gives this derivation: ", "page_idx": 13}, {"type": "equation", "text": "$$\nq(\\mathbf{x}_{t}|\\mathbf{x}_{0})=\\sqrt{\\bar{\\alpha}_{t}}\\mathbf{x}_{0}+\\sqrt{1-\\bar{\\alpha}_{t}}\\epsilon,\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "where $\\epsilon\\sim\\mathcal{N}(0,\\bf{I})$ and $\\alpha_{t}=1-\\beta_{t}$ , $\\begin{array}{r}{\\bar{\\alpha}_{t}=\\prod_{i=0}^{t}\\alpha_{i}}\\end{array}$ . ", "page_idx": 13}, {"type": "text", "text": "The reverse process aims to learn to remove the degradation brought from the forward process and sample the $\\mathbf{x}_{\\mathrm{0}}$ from $\\mathbf{x}_{t}$ . To accomplish this objective, we need to learn the distribution of $p_{\\theta}\\big(\\mathbf{x}_{t-1}\\big|\\mathbf{x}_{t}\\big)$ using a neural network and perform iterative sampling as follows: ", "page_idx": 13}, {"type": "equation", "text": "$$\np_{\\theta}(\\mathbf{x}_{t-1}|\\mathbf{x}_{t})=\\mathcal{N}(\\mathbf{x}_{t-1};\\mu_{\\theta}(\\mathbf{x}_{t},t),\\Sigma_{\\theta}(\\mathbf{x}_{t},t)),\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "where $\\mu_{\\theta}$ and $\\Sigma_{\\theta}$ are the mean and variance of $p_{\\theta}\\big(\\mathbf{x}_{t-1}\\big|\\mathbf{x}_{t}\\big)$ , respectively, and $\\theta$ is the parameters of model. ", "page_idx": 13}, {"type": "text", "text": "According to Eq. (15), the mean and variance can be computed, following: ", "page_idx": 13}, {"type": "equation", "text": "$$\n\\mu_{\\theta}=\\frac{1}{\\sqrt{\\alpha_{t}}}(\\mathbf{x}_{t}-\\frac{\\beta_{t}}{\\sqrt{1-\\bar{\\alpha}_{t}}}\\epsilon_{\\theta}(\\mathbf{x}_{t},t)),\n$$", "text_format": "latex", "page_idx": 13}, {"type": "equation", "text": "$$\n\\Sigma_{\\theta}(\\mathbf{x}_{t},t)=\\frac{1-\\bar{\\alpha}_{t-1}}{1-\\bar{\\alpha}_{t}}\\beta_{t}.\n$$", "text_format": "latex", "page_idx": 13}, {"type": "text", "text": "For sampling from a standard Gaussian noise $\\mathbf{x}_{T}$ to get $\\mathbf{x}_{T-1}$ , after performing $T$ -step iterations of sampling as described above, we get the output $\\mathbf{x}_{\\mathrm{0}}$ from $\\mathbf{x}_{T}$ . ", "page_idx": 13}, {"type": "text", "text": "C LoRA-like Branch-wise Alternative Fine-tuning ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "In Section 3.4 of the main text. The L-BAF method alternately fine-tunes the spatial and spectral branches based on the proposed APFM. As shown in Fig. 6. When we fine-tune the spectral branch, we freeze the ${\\mathbf{T}}_{a}$ and $\\mathbf{T}_{b}$ parameters in the spatial branch and the ${\\mathbf{T}}_{a}$ parameter in the spectral branch. Block gradient propagation to prevent parameter updates for the entire spatial branch. Similarly, when fine-tuning the spatial branch, we freeze the $\\mathbf{T}_{c}$ and $\\mathbf{T}_{d}$ parameters in the spectral branch, as well as the $\\mathbf{T}_{c}$ parameter in the spatial branch. Block gradient propagation to prevent parameter updates for entire spectral branches. ", "page_idx": 13}, {"type": "image", "img_path": "QMVydwvrx7/tmp/df7d938e735be2ad21819e25b725457988f184b46553f812ed4b54435e23e2d0.jpg", "img_caption": [], "img_footnote": [], "page_idx": 14}, {"type": "text", "text": "Figure 6: The sketch of the proposed LoRA-like branch-wise alternative fine-tuning process. ", "page_idx": 14}, {"type": "text", "text": "Algorithm 1: Training stage of the proposed method. ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Data: GT image $\\mathbf{x}_{\\mathrm{0}}$ , diffusion model $\\mathbf{x}_{\\theta}$ with its parameters $\\theta$ , spectral and spatial branch parameter $\\theta_{s p e}$ , $\\theta_{s p a}$ , respectively, condition cond, timestep $t_{\\cdot}$ , and denoised objective $\\hat{\\mathbf{x}}_{\\mathrm{0}}$ Result: Optimized diffusion model $\\mathbf{x}_{\\theta}^{*}$ . 1 cond $\\leftarrow$ PAN, LrMSI, $\\mathbf{x_{t}}$ ; 2 while until convergence do 3 $t\\gets\\mathrm{Uniform}(0,T)$ ; $\\epsilon\\sim\\mathcal{N}(0,I)$ ; 4 $\\mathbf{x}_{t}\\gets\\sqrt{\\bar{\\alpha}_{t}}(\\mathbf{x}_{0}-\\mathrm{LrMSI})+\\sqrt{1-\\bar{\\alpha}_{t}}\\epsilon;\\hat{\\mathbf{x}}_{0}\\gets\\mathbf{x}_{\\theta}(\\mathbf{x}_{t},\\mathbf{cond})+\\mathrm{LrMSI};$ 5 if iteration $>I50k$ then 6 fine-tune $\\theta_{s p e}$ or $\\theta_{s p a}$ ; // L-BAF end 8 $\\theta\\leftarrow\\nabla_{\\theta}\\mathcal{L}_{s i m p l e}(\\hat{\\mathbf{x}}_{0},\\mathbf{x}_{0}).$ . 9 end ", "page_idx": 14}, {"type": "text", "text": "D Model Training ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "The detailed training process of SSDiff can be found in Algorithm 1. ", "page_idx": 14}, {"type": "text", "text": "E Limitation ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "First, we evaluate the effectiveness of the proposed SSDiff over the pansharpening task and we will extend our method to other multispectral fusion tasks, such as multispectral and hyperspectral image fusion. Second, the proposed FMIM can adjust the frequency information between the two branches, but it also introduces additional hyperparameters, increasing the difficulty of fine-tuning during training. In terms of cost, the average inference time for a single image is 7.416 seconds under 10 timesteps. The time cost for our approach is higher than other DL-based models, primarily due to the limitation imposed by the large number of sampling steps required in the diffusion model. ", "page_idx": 14}, {"type": "text", "text": "F Broader Impact ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Pansharpening, as a fundamental preprocessing method which is a key pre-processing technology overcoming the constraints of hardware before using high-resolution multispectral images, has been widely utilized in various applications, including change detection, environmental monitoring, and segmentation. At the same time, pansharpening, being a low-level task, the distortions that occur during the process of generating high-resolution multispectral images can significantly impact the success rate of subsequent high-level tasks. ", "page_idx": 14}, {"type": "image", "img_path": "QMVydwvrx7/tmp/5d9e9080d15930f0fa821a72ea7b39922cd0b42a09fc0f7dc93759985f16e9a7.jpg", "img_caption": ["Figure 7: Visual comparisons on a reduced-resolution QuickBird case. The first and third rows are the predicted HrMSI for each method, and the second and fourth rows are the error maps of the predicted HRMS versus ground truth (GT) for each one. "], "img_footnote": [], "page_idx": 15}, {"type": "table", "img_path": "QMVydwvrx7/tmp/051194b91a6bc93a14b29135c2f553ebbfb5104868dd808732d04a1d3bab6bd1.jpg", "table_caption": ["Table 6: Quantitative results on the QuickBird reduced-resolution and full-resolution datasets. Some conventional methods (the first three rows) and DL-based methods are compared. The best results are highlighted in bold and the second best results are underlined. "], "table_footnote": [], "page_idx": 15}, {"type": "text", "text": "", "page_idx": 15}, {"type": "text", "text": "G Additional experiment ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "G.1 Setups ", "text_level": 1, "page_idx": 15}, {"type": "text", "text": "Implementation Details. Our SSDiff is implemented in PyTorch 1.7.0 and Python 3.8.5 using AdamW optimizer with an initial learning rate of 0.001 to minimize $\\mathcal{L}_{s i m p l e}$ on a Linux operating system with an Intel 12th Gen i7-12700K processor and two NVIDIA GeForce RTX3090 GPUs. For the diffusion denoising model, the initial number of model channels is 32, the diffusion time step used for training in the pansharpening is set to 1000, while the diffusion time step for sampling is set to 10. The exponential moving average (EMA) ratio is set to 0.9999. The total training iterations for the WV3, GF2, and QB datasets are set to 150k, 100k, and $200\\mathbf{k}$ iterations, respectively. During the model fine-tuning, the learning rate is set to 0.0001, and the total fine-tune training iterations are set to $30\\mathrm{k}$ . ", "page_idx": 15}, {"type": "image", "img_path": "QMVydwvrx7/tmp/f4c9c13871caf3f0df77906975061162d8d92ea962cc2cd6cb2be220f989fb8a.jpg", "img_caption": ["Figure 8: Fused GF2 full-resolution data and their corresponding HQNR map. The high value in the HQNR map means better full-resolution fusion performance. "], "img_footnote": [], "page_idx": 16}, {"type": "text", "text": "", "page_idx": 16}, {"type": "text", "text": "Datasets. To demonstrate the effectiveness of our SSDiff, we conducted experiments on widely used pansharpening datasets. The Pancollection1 dataset for pansharpening consists of data from four satellites: WorldView-3 (8 bands), WorldView-2 (8 bands), QuickBird (4 bands), and GaoFen-2 (4 bands). ", "page_idx": 16}, {"type": "text", "text": "To better evaluate performance, we simulated reduced-resolution and full-resolution datasets. For reduced datasets, Pancollection follows Wald’s protocol [35] to obtain simulated images with ground truth images. There are three steps involved: 1) Use a modulation transfer-based (MTF) filter to downsample the original PAN and MS images by a factor of 4. Downsampled PAN and MS are used as training PAN and MS images; 2) Treat the original MS image as a ground truth image, i.e. HRMSI; 3) Upsampling the training MS image using interpolation with polynomial kernels [2] and processing it into a LrMSI. When processing the full datasets, the original MS image is considered MS, the upsampled MS image is considered LrMSI, and the original PAN is considered PAN. ", "page_idx": 16}, {"type": "text", "text": "Benchmark. To evaluate the performance of our SSDiff, we compared it with various state-of-the-art methods of Pansharpening (on WV3, QB, and GF2 datasets). Specifically, we choose three traditional methods: BDSD-PC [31], MTF-GLP-FS [33], BT-H [1]; as well as nine machine learning-based methods: PNN [20], DiCNN [12], MSDCNN [36], FusionNet [5], CTINN [48], LAGConv [15], MMNet [49], DCFNet [39], and Pandiff [21]. To ensure fairness, we train DL-based methods using the same Nvidia GPU-3090 and PyTorch environment. ", "page_idx": 16}, {"type": "text", "text": "Quality Metric. For the reduced data in Pansharpening tasks, we utilize four metrics to evaluate the results on reduced resolution datasets, including the spectral angle mapper (SAM) [46], the erreur relative globale adimensionnelle de synthèse (ERGAS) [34], the universal image quality index $(\\mathbf{Q}2^{n})$ [10], and the spatial correlation coefficient (SCC) [47]. As for full-resolution datasets, we apply $D_{\\lambda}$ , $D_{s}$ , and hybrid quality with no reference (HQNR) indexes [3] for evaluation. ", "page_idx": 16}, {"type": "text", "text": "G.2 Results on QuickBird: ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "We conduct experiments on the QuickBird reduced dataset and evaluate the performance of SSDiff. Similarly, the reference and non-reference metrics were obtained from 20 randomly selected test images from the QB dataset. The performance comparison is reported in Table 6. Our SSDiff achieves SOTA performance. From the error maps in Fig. 7, we can observe that there are still significant differences between traditional fusion methods and DL-based fusion methods. ", "page_idx": 17}, {"type": "text", "text": "G.3 Results on GaoFen-2: ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "On the GaoFen-2 full-resolution dataset, we tested our SSDiff on 20 test images, Fig. 8 shows the results and HQNR maps, where an HQNR score close to 1 indicates better fusion quality of full-resolution images. The obtained results indicate that our SSDiff has a good generalization of the full-resolution dataset. ", "page_idx": 17}, {"type": "text", "text": "Table 7: Efficiency results on the WV3 reduced-resolution datasets. ", "page_idx": 17}, {"type": "table", "img_path": "QMVydwvrx7/tmp/20b2bedc5d76141d30df10fc45ca10b6f57af2e05a6ac263c45fb61709ef4159.jpg", "table_caption": [], "table_footnote": [], "page_idx": 17}, {"type": "text", "text": "G.4 Efficiency analysis ", "text_level": 1, "page_idx": 17}, {"type": "text", "text": "The diffusion-based method generally has more running time than CNN-based methods due to the multiple timesteps of the diffusion mechanism. The comparison of inference running time shown in Table 7 ensures this point. However, for a fair comparison with another diffusion-based method for pansharpening, i.e., PanDiff, our method still gets a significant advantage. ", "page_idx": 17}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 18}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 18}, {"type": "text", "text": "Justification: The abstract and introduction clearly outline the main contributions and scope of the paper, ensuring that the claims made are supported by the theoretical and experimental results presented. ", "page_idx": 18}, {"type": "text", "text": "Guidelines: ", "page_idx": 18}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 18}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? Answer: [Yes] ", "page_idx": 18}, {"type": "text", "text": "Justification: The paper discusses the limitations in Appendix E, such as the inference overhead of the model and the additional hyperparameters introduced. ", "page_idx": 18}, {"type": "text", "text": "Guidelines: ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 18}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 18}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 19}, {"type": "text", "text": "Justification: For Theorem 1 presented in the paper, a complete proof is given in the main text, along with detailed explanations and illustrations. ", "page_idx": 19}, {"type": "text", "text": "Guidelines: ", "page_idx": 19}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 19}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 19}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 19}, {"type": "text", "text": "Justification: The paper provides detailed descriptions of the network architecture and experimental settings and provides links to the publicly available datasets used. The complete code will be published on GitHub upon acceptance for further research and discussion. ", "page_idx": 19}, {"type": "text", "text": "Guidelines: ", "page_idx": 19}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 19}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 20}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 20}, {"type": "text", "text": "Justification: The datasets are publicly accessible, and the code will be released soon. Guidelines: ", "page_idx": 20}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 20}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 20}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 20}, {"type": "text", "text": "Justification: In Appendix G, we present the datasets, implementation details, and the hyperparameters can be found in Sec. 3.3. ", "page_idx": 20}, {"type": "text", "text": "Guidelines: ", "page_idx": 20}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 20}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 20}, {"type": "text", "text": "Answer: [No] ", "page_idx": 20}, {"type": "text", "text": "Justification: The paper does not involve error bars or experiments concerning statistical significance. ", "page_idx": 20}, {"type": "text", "text": "Guidelines: ", "page_idx": 20}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper. ", "page_idx": 20}, {"type": "text", "text": "• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 21}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 21}, {"type": "text", "text": "Justification: Our experiments were conducted on a workstation equipped with an Intel 12th Gen i7-12700K processor, two NVIDIA RTX 3090 GPUs, and 128GB of memory. The detailed compute resources for the experiments can be found in the implementation details of Appendix. G.1. ", "page_idx": 21}, {"type": "text", "text": "Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 21}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 21}, {"type": "text", "text": "Justification: The research adheres to the ethical guidelines set forth by NeurIPS, ensuring responsible conduct in all aspects of the study. ", "page_idx": 21}, {"type": "text", "text": "Guidelines: ", "page_idx": 21}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 21}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 21}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 21}, {"type": "text", "text": "Justification: Both potential positive societal impacts and negative societal impacts of the work can be found in the implementation details of Appendix. F. ", "page_idx": 21}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed.   \n• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 22}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 22}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 22}, {"type": "text", "text": "Justification: The models compared in the paper have either received author permission or are publicly available. The datasets are public, and original papers are cited meticulously. ", "page_idx": 22}, {"type": "text", "text": "Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 22}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 22}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 22}, {"type": "text", "text": "Justification: The models compared in the paper have either received author permission or are publicly available. The datasets are public, and original papers are cited meticulously. Guidelines: ", "page_idx": 22}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets. • The authors should cite the original paper that produced the code package or dataset. • The authors should state which version of the asset is used and, if possible, include a URL. ", "page_idx": 22}, {"type": "text", "text": "• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 23}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 23}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 23}, {"type": "text", "text": "Justification: The paper does not release new assets. ", "page_idx": 23}, {"type": "text", "text": "Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 23}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 23}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 23}, {"type": "text", "text": "Justification: The paper does not involve crowdsourcing or research with human subjects. Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing or research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 23}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 23}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 23}, {"type": "text", "text": "Justification: The paper does not involve crowdsourcing or research with human subjects. Guidelines: ", "page_idx": 23}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing or research with human subjects. ", "page_idx": 23}, {"type": "text", "text": "• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 24}]