[{"figure_path": "YfLzYczAo3/figures/figures_7_1.jpg", "caption": "Figure 1: CRONOS-AM vs. competitors on Deep ReLU MLP", "description": "This figure compares the performance of CRONOS-AM against other popular optimizers (Adam, AdamW, SGD, Shampoo, Yogi, and DAdam) on two datasets: CIFAR-10 and ImageNet.  The x-axis represents the training time, and the y-axis represents the validation accuracy.  The shaded areas represent the 5th and 95th percentiles of the validation accuracy across multiple learning rates for each optimizer. CRONOS-AM demonstrates comparable or better performance than the best-tuned competitors, especially highlighting the stability of its performance across different learning rates, in contrast to the significant variance observed with other optimizers.", "section": "7 Experiments"}, {"figure_path": "YfLzYczAo3/figures/figures_8_1.jpg", "caption": "Figure 1: CRONOS-AM vs. competitors on Deep ReLU MLP", "description": "This figure compares the performance of CRONOS-AM with other optimizers (Adam, AdamW, SGD, Shampoo, Yogi, and DAdam) on two deep ReLU MLP tasks: CIFAR-10 and ImageNet.  The plots show validation accuracy over time (in seconds).  It highlights that CRONOS-AM achieves comparable or better accuracy than the other optimizers, often with less variance across different learning rates.", "section": "7 Experiments"}, {"figure_path": "YfLzYczAo3/figures/figures_15_1.jpg", "caption": "Figure 1: CRONOS-AM vs. competitors on Deep ReLU MLP", "description": "This figure compares the performance of CRONOS-AM with other optimizers (Adam, AdamW, SGD, Shampoo, Yogi, and DAdam) on two different datasets: CIFAR-10 and ImageNet, using a deep ReLU MLP architecture.  The graphs show validation accuracy over time (in seconds).  The plot illustrates that CRONOS-AM achieves competitive or superior performance compared to the other optimizers, which show significant variability and sensitivity to hyperparameter tuning.", "section": "7 Experiments"}, {"figure_path": "YfLzYczAo3/figures/figures_21_1.jpg", "caption": "Figure 1: CRONOS-AM vs. competitors on Deep ReLU MLP", "description": "The figure shows the performance comparison of CRONOS-AM against other optimizers (Adam, AdamW, SGD, Shampoo, Yogi, and DAdam) on CIFAR-10 and ImageNet datasets using a deep ReLU MLP architecture.  The graphs plot validation accuracy against training time.  It highlights CRONOS-AM's competitive performance and robustness to hyperparameter tuning compared to other methods.", "section": "7 Experiments"}, {"figure_path": "YfLzYczAo3/figures/figures_22_1.jpg", "caption": "Figure 1: CRONOS-AM vs. competitors on Deep ReLU MLP", "description": "The figure compares the performance of CRONOS-AM with other optimizers (Adam, AdamW, SGD, Shampoo, Yogi, and DAdam) on two datasets: CIFAR-10 and ImageNet, using a deep ReLU MLP architecture.  The x-axis represents time (in seconds), and the y-axis represents validation accuracy. The plot shows that CRONOS-AM achieves comparable or better validation accuracy than the other optimizers, while also demonstrating less sensitivity to hyperparameter tuning.", "section": "7 Experiments"}, {"figure_path": "YfLzYczAo3/figures/figures_23_1.jpg", "caption": "Figure 1: CRONOS-AM vs. competitors on Deep ReLU MLP", "description": "The figure compares the performance of CRONOS-AM against other popular optimizers (Adam, AdamW, SGD, Shampoo, Yogi, and DAdam) on two datasets: CIFAR-10 and ImageNet.  The x-axis represents the training time in seconds, and the y-axis represents the validation accuracy. The figure shows that CRONOS-AM achieves comparable or better validation accuracy than the other optimizers, while also exhibiting less sensitivity to hyperparameter tuning.  The shaded regions represent the 5th and 95th percentiles of the validation accuracy across multiple runs with different learning rates for each optimizer.", "section": "7 Experiments"}, {"figure_path": "YfLzYczAo3/figures/figures_23_2.jpg", "caption": "Figure 1: CRONOS-AM vs. competitors on Deep ReLU MLP", "description": "This figure compares the performance of CRONOS-AM against other popular optimizers (Adam, AdamW, SGD, Shampoo, Yogi, DAdam) on two different datasets: CIFAR-10 and ImageNet.  The x-axis represents training time in seconds, and the y-axis shows validation accuracy. The plots show that CRONOS-AM achieves comparable or better accuracy than the other optimizers, and that the other optimizers exhibit high variance and sensitivity to hyperparameters.", "section": "7 Experiments"}, {"figure_path": "YfLzYczAo3/figures/figures_24_1.jpg", "caption": "Figure 1: CRONOS-AM vs. competitors on Deep ReLU MLP", "description": "This figure compares the performance of CRONOS-AM against other popular optimizers (Adam, AdamW, SGD, Shampoo, Yogi, and DAdam) on two datasets: CIFAR-10 and ImageNet.  The plots show the validation accuracy over time for each optimizer.  The shaded regions represent the 5th and 95th percentiles across multiple runs with different learning rates for the competing methods. CRONOS-AM demonstrates comparable or better performance without requiring extensive hyperparameter tuning.", "section": "7 Experiments"}, {"figure_path": "YfLzYczAo3/figures/figures_24_2.jpg", "caption": "Figure 1: CRONOS-AM vs. competitors on Deep ReLU MLP", "description": "This figure compares the performance of CRONOS-AM with other optimizers (Adam, AdamW, SGD, Shampoo, Yogi, DAdam) on Deep ReLU MLPs for CIFAR-10 and ImageNet datasets.  The plots show validation accuracy against training time.  CRONOS-AM demonstrates competitive or superior performance compared to the other optimizers. Note that the non-CRONOS optimizers show a high degree of variability across different learning rates; CRONOS-AM does not exhibit this sensitivity.", "section": "7 Experiments"}]