[{"figure_path": "dG1HwKMYbC/figures/figures_1_1.jpg", "caption": "Figure 1: The general framework of FINCON.", "description": "The figure illustrates the overall architecture of FINCON, a synthesized LLM multi-agent system.  It shows the flow of multi-modal market information (textual, tabular, and audio data) into the system.  The information is processed by different types of LLMs (foundation models and financial fine-tuned LLMs) and single-agent modules (code generator, calculator, profile, dataframe loader, document loader, and action). The core of the system is the FinCon Multi-Agent System, which comprises a Manager-Analyst agent synthesized component and a risk control component. The Manager-Analyst component consists of a trading manager and various analyst agents (News Analyst, Data Analyst, Report Analyst, etc.) that collaborate through natural language interaction. The risk control component includes within-trajectory and over-trajectory risk control mechanisms to refine decisions and enhance performance. ", "section": "1 Introduction"}, {"figure_path": "dG1HwKMYbC/figures/figures_3_1.jpg", "caption": "Figure 2: The detailed architecture of FINCON contains two key components: Manager-Analyst agent group and Risk Control. It also presents the between-component interaction of FINCON and decision-making flow.", "description": "This figure illustrates the architecture of FINCON, a synthesized LLM multi-agent system.  It highlights the two main components: the Manager-Analyst Agent Group and the Risk-Control component. The Manager-Analyst group consists of a manager agent and multiple analyst agents. Each analyst agent focuses on processing information from a specific source (news, financial reports, etc.), while the manager agent is responsible for making trading decisions based on combined inputs from all analysts. The Risk-Control component includes both within-episode (daily market risk monitoring using CVaR) and over-episode (belief updating using textual gradient descent) risk management. The figure depicts the flow of information and communication between the two components and individual agents, demonstrating how FINCON manages risks and improves decision-making performance.", "section": "3 Architecture of FINCON"}, {"figure_path": "dG1HwKMYbC/figures/figures_8_1.jpg", "caption": "Figure 1: The general framework of FINCON.", "description": "This figure shows the overall architecture of FINCON, an LLM-based multi-agent system for financial decision-making.  It illustrates the interaction between different components, including the multi-modal market environment information (textual, tabular, and audio data), the various LLM functions (generation, code generation, calculation, third-party API calls), and the multi-agent system itself. The system consists of a Manager and Analyst agents organized in a hierarchical structure. The risk-control component is also shown, emphasizing its dual-level operation of within-episode and over-episode risk management.", "section": "1 Introduction"}, {"figure_path": "dG1HwKMYbC/figures/figures_21_1.jpg", "caption": "Figure 1: The general framework of FINCON.", "description": "This figure presents the overall architecture of the FINCON system, illustrating the interaction between its key components: the multi-modal market environment providing various data sources (textual, tabular, audio), the multi-type LLMs performing different functions (generation, code generation, calculation, perception, etc.), the manager-analyst agent group enabling synthesized teamwork, and the risk-control component ensuring both within-episode and over-episode risk management.  The figure showcases the flow of information and decision-making within the system.", "section": "1 Introduction"}, {"figure_path": "dG1HwKMYbC/figures/figures_22_1.jpg", "caption": "Figure 1: The general framework of FINCON.", "description": "The figure illustrates the overall architecture of the FINCON system.  It shows the interaction between different components, including the multi-modal market environment information (textual, tabular, and audio data), multi-type LLMs (GPT, Llama 3, Claude, etc.), the manager-analyst agent synthesized component, and the risk control component.  The manager-analyst component depicts the hierarchical structure with a trading manager agent and several analyst agents (news analyst, data analyst, and report analyst).  The risk control component highlights both within-trajectory and over-trajectory risk control mechanisms.  The diagram provides a visual overview of how FINCON processes information and makes trading decisions.", "section": "1 Introduction"}, {"figure_path": "dG1HwKMYbC/figures/figures_23_1.jpg", "caption": "Figure 1: The general framework of FINCON.", "description": "This figure presents a detailed overview of FINCON's architecture. It illustrates the interaction between various components, including the multi-modal market environment providing different types of data (textual, tabular, and audio), the multi-type LLMs functioning as modules (generation, code generation, configuration, foundation models, and fine-tuned LLMs), and the manager-analyst agent synthesized component coordinating the interactions of different analyst agents (News Analyst, Data Analyst, Report Analyst, and ECC Agent) to provide insights for the manager agent. The risk control component, responsible for monitoring within-trajectory and over-trajectory risks, and updating systematic investment beliefs using conceptual verbal reinforcement, is also shown. The figure provides a comprehensive visualization of the entire FINCON framework, making it easier to understand the workflow and interactions between its different parts.", "section": "1 Introduction"}, {"figure_path": "dG1HwKMYbC/figures/figures_25_1.jpg", "caption": "Figure 1: The general framework of FINCON.", "description": "This figure illustrates the overall architecture of the FINCON system, which is an LLM-based multi-agent framework for enhanced financial decision-making. It shows the interaction between the multi-modal market environment (providing various data types like textual, tabular, and audio information), the multi-type LLMs (serving as foundation models for different agents), the manager-analyst agent synthesized component (representing the hierarchical structure with a manager agent and multiple analyst agents), and the risk-control component (enabling within-trajectory and over-trajectory risk control).  The diagram highlights the flow of information and decisions within the system, showcasing how diverse information is processed by different agents and utilized by the manager for unified decision-making. ", "section": "3 Architecture of FINCON"}, {"figure_path": "dG1HwKMYbC/figures/figures_26_1.jpg", "caption": "Figure 1: The general framework of FINCON.", "description": "This figure presents a detailed overview of the FINCON architecture, highlighting its key components, including the multi-modal market environment information sources, various types of LLMs utilized for different tasks, the manager-analyst agent synthesized component, and the dual-level risk control component. It illustrates the hierarchical structure of the system and the data flow between the different modules, including how multi-type LLMs process different data modalities, how analyst agents extract investment insights, how the manager agent makes trading decisions, and how the risk control component updates investment beliefs and manages risk.", "section": "Architecture of FINCON"}, {"figure_path": "dG1HwKMYbC/figures/figures_26_2.jpg", "caption": "Figure 1: The general framework of FINCON.", "description": "This figure shows the overall architecture of the FINCON system, illustrating the interaction between its key components: the multi-modal market environment information, multi-type LLMs, single-agent modules, the manager-analyst agent group, the risk-control component, and the resulting trading actions and profits and losses.  It provides a visual overview of the data flow and the different agents' roles and responsibilities within the system.", "section": "3 Architecture of FINCON"}, {"figure_path": "dG1HwKMYbC/figures/figures_30_1.jpg", "caption": "Figure 5: CRs over time for single-asset trading tasks. FINCON outperformed other comparative strategies, achieving the highest CRs across all six stocks by the end of the testing period, regardless of market conditions.", "description": "This figure shows the cumulative returns (CRs) over time for six different stocks (TSLA, AAPL, NIO, AMZN, GOOG, NFLX) across various trading models, including FINCON and other baselines such as Buy-and-Hold (B&H), Generative Agent (GA), FINGPT, FINMEM, FINAGENT, A2C, PPO and DQN.  FINCON consistently outperforms other models across all six stocks. The results highlight FINCON's robust performance across various market conditions and its superior ability to manage risks and maximize profits.", "section": "4.2.1 Single Asset Trading Task"}, {"figure_path": "dG1HwKMYbC/figures/figures_30_2.jpg", "caption": "Figure 3: Portfolio values of Portfolio 1 & 2 changes over time for all the strategies. The computation of portfolio value refers to Equation 7 in Appendix A.10.", "description": "This figure shows the performance of four different portfolio management strategies (FINCON, Markowitz, Equal-Weighted ETF, and FinRL-A2C) over time.  It visualizes the growth or decline of the portfolio value for two different portfolios (Portfolio 1 and Portfolio 2) across the strategies.  The x-axis represents the date, and the y-axis represents the portfolio value.  The figure helps in comparing the performance of different strategies in managing portfolios over time.", "section": "4.2 Main Results"}]