[{"figure_path": "kLiWXUdCEw/figures/figures_8_1.jpg", "caption": "Figure 1: Elo simulation results for a dumbbell graph with one edge between two cliques of 20 vertices. Match-ups are sampled from three different probability distributions.", "description": "This figure displays the results of Elo rating simulations on a dumbbell graph, a graph consisting of two fully connected components (cliques) of 20 vertices each, connected by a single edge.  Three different probability distributions for selecting the next match are compared: uniform, an optimal sequential distribution (maximizing the spectral gap), and an optimal parallel distribution (maximizing the spectral gap for parallel rounds). The plot shows the average L2 distance between the time-averaged Elo ratings and the true ratings, normalized by the number of players, over 20,000 games/rounds. The shaded regions represent the 25th to 75th percentiles across ten simulations, showcasing the variability in convergence rates. This experiment highlights how different matching schemes affect the speed and stability of Elo rating convergence.", "section": "4 Experimental Results"}, {"figure_path": "kLiWXUdCEw/figures/figures_8_2.jpg", "caption": "Figure 1: Elo simulation results for a dumbbell graph with one edge between two cliques of 20 vertices. Match-ups are sampled from three different probability distributions.", "description": "The figure displays simulation results for the Elo rating system on a dumbbell graph, which consists of two fully connected groups of 20 vertices each, linked by a single edge.  The simulations compare the performance of three different match-up probability distributions: uniform, optimal sequential, and optimal parallel. The y-axis represents the average error (presumably L2 distance between estimated and true ratings), and the x-axis represents the number of games played.  The graph shows that the optimal sequential and parallel methods significantly outperform the uniform distribution, achieving much lower errors with the same number of games played.  The parallel method shows that using parallel rounds can offer additional benefits in convergence speed.", "section": "4 Experimental Results"}, {"figure_path": "kLiWXUdCEw/figures/figures_8_3.jpg", "caption": "Figure 3: Largest Elo rating in absolute value for a complete graph of varying size. True ratings are uniformly distributed in [-1,1].", "description": "The figure displays the maximum absolute value of Elo ratings over time for complete graphs with varying numbers of players (n=100, 250, 500, 1000).  The true player ratings are randomly sampled from a uniform distribution between -1 and 1.  The plot shows that even with a large number of games, the maximum rating remains relatively bounded, suggesting that unbounded Elo ratings are unlikely in practice.", "section": "4 Experimental Results"}, {"figure_path": "kLiWXUdCEw/figures/figures_12_1.jpg", "caption": "Figure 4: Elo simulation results for dumbbell graphs with k = 5 (left) and k = 10 (right) edges between two cliques of 20 vertices.", "description": "The figure shows the results of Elo simulations for dumbbell graphs with varying numbers of edges connecting two cliques of 20 vertices each.  The simulations compare the convergence rate of Elo ratings using three different probability distributions for selecting matches: uniform, optimal sequential, and optimal parallel. The x-axis represents the number of games or rounds played, and the y-axis shows the average L2-distance between the time-averaged Elo ratings and the true ratings.  The shaded regions represent the 25th-75th percentiles across ten repetitions of each simulation. The results demonstrate that increasing the number of edges connecting the cliques improves the performance of the optimal parallel distribution, while the optimal sequential distribution shows similar performance regardless of the number of edges. This highlights the trade-offs between sequential and parallel approaches.", "section": "A Experiments: Further Discussion and Figures"}, {"figure_path": "kLiWXUdCEw/figures/figures_12_2.jpg", "caption": "Figure 5: Schematic representation of the pyramidal graph.", "description": "This figure shows a schematic representation of a pyramidal graph.  The graph is composed of three layers, each containing an Erdős-Rényi random graph. The number of nodes in each layer decreases from the bottom to the top (64, 32, and 16 nodes respectively).  Each layer is connected to the adjacent layers through sparse cuts. This structure is used to simulate the hierarchical structure of sports leagues.", "section": "A Experiments: Further Discussion and Figures"}, {"figure_path": "kLiWXUdCEw/figures/figures_12_3.jpg", "caption": "Figure 1: Elo simulation results for a dumbbell graph with one edge between two cliques of 20 vertices. Match-ups are sampled from three different probability distributions.", "description": "This figure displays the results of Elo rating simulations performed on a dumbbell graph, which consists of two fully connected groups (cliques) of 20 vertices each, connected by a single edge.  The simulations compare the convergence rate of the Elo ratings towards the true ratings under three different match-up probability distributions: uniform, optimally sequential, and optimally parallel.  The x-axis represents the number of games played, and the y-axis shows the average error between the time-averaged Elo ratings and the true player ratings. The shaded area represents the interquartile range across multiple simulation runs, illustrating the variability in results. The purpose is to visualize how different match selection strategies affect the speed and accuracy of Elo rating convergence.", "section": "4 Experimental Results"}, {"figure_path": "kLiWXUdCEw/figures/figures_13_1.jpg", "caption": "Figure 7: Left: topology of the giant component of an Erdős-Rényi random graph of n = 100 vertices and density p = 0.02; edges are reweighed according to the distribution corresponding to the fastest mixing continuous-time Markov chain. Right: Elo simulation results for the same graph.", "description": "The figure displays the topology of a giant component of an Erdos-Renyi random graph with 100 vertices and density p=0.02 (left).  The edges are reweighted according to the distribution that corresponds to the fastest mixing continuous-time Markov chain. The right panel shows the Elo simulation results for the same graph, illustrating the convergence rate of time-averaged Elo ratings to the true ratings under four different probability distributions (uniform, optimal sequential, parallel games, and parallel rounds).  The results demonstrate how the choice of distribution significantly impacts the convergence rate.", "section": "4 Experimental Results"}, {"figure_path": "kLiWXUdCEw/figures/figures_14_1.jpg", "caption": "Figure 3: Largest Elo rating in absolute value for a complete graph of varying size. True ratings are uniformly distributed in [-1,1].", "description": "The figure shows the maximum absolute value of the Elo ratings over time for complete graphs of varying sizes (n = 100, 250, 500, 1000).  The true player ratings are sampled from a uniform distribution between -1 and 1. The plot displays the evolution of the maximum Elo rating as the number of games played increases, demonstrating that the maximum rating remains bounded in the simulations performed.", "section": "4 Experimental Results"}]