{"references": [{"fullname_first_author": "A. Saxe", "paper_title": "Exact solutions to the nonlinear dynamics of learning in deep linear neural networks", "publication_date": "2013-12-31", "reason": "This paper provides the foundational theoretical results on the dynamics of learning in deep linear networks, which directly motivates the use of orthogonal weight matrices in the current work."}, {"fullname_first_author": "C. Anil", "paper_title": "Sorting out Lipschitz function approximation", "publication_date": "2019-01-01", "reason": "This work establishes the importance of Lipschitz continuity in neural networks and its connection to optimization, directly relevant to the proposed Parseval regularization that aims to keep the network's Lipschitz constant under control."}, {"fullname_first_author": "C. Lyle", "paper_title": "Understanding and preventing capacity loss in reinforcement learning", "publication_date": "2022-04-01", "reason": "This paper directly addresses the issue of capacity loss in continual reinforcement learning, the problem that the current work attempts to solve using Parseval regularization."}, {"fullname_first_author": "A. Achille", "paper_title": "Critical learning periods in deep neural networks", "publication_date": "2017-11-01", "reason": "This paper explores the concept of critical learning periods in neural networks, highlighting the challenges of training deep neural networks on sequences of tasks and providing insights into the phenomena of plasticity loss and primacy bias, which the current work attempts to mitigate."}, {"fullname_first_author": "J. Ash", "paper_title": "On warm-starting neural network training", "publication_date": "2020-01-01", "reason": "This paper explores techniques for improving neural network training by leveraging information from previous tasks which is highly relevant to the continual RL setting studied in this paper, and the proposed Parseval regularization seeks to improve upon this by maintaining the orthogonality of weight matrices and its associated benefits."}]}