[{"figure_path": "I96GFYalFO/figures/figures_1_1.jpg", "caption": "Figure 1: Problem illustration. We illustrate the challenges of the cross-domain scenario. (a) Considering the domain structural shifts, clients struggle with knowledge conflict caused by non-generic sharing which arises from the shifts, thus leading to unpromising global collaboration. (b) The aggregated message-passing scheme suffers from inconsistent preferences that remain unsatisfied of specific datasets in this scenario. Consequently, it leads to unsuitable features of graphs in local applications. (c) The heat map of Jensen-Shannon divergence of algebraic connectivity [17] and eigenvalues distributions among six datasets from three different domains. Spectral characteristics exhibit significant biases across domains but are more similar within a same domain.", "description": "This figure illustrates the challenges of cross-domain personalized federated graph learning (pFGL).  Panel (a) shows how structural heterogeneity across domains (e.g., molecule and social network graphs) leads to knowledge conflict when non-generic knowledge is shared globally. Panel (b) demonstrates how a single aggregated model fails to satisfy the diverse preferences of individual clients, leading to unsuitable features for local applications. Panel (c) provides a heatmap visualizing the Jensen-Shannon divergence of algebraic connectivity and eigenvalue distributions across six datasets from three domains, highlighting the spectral biases reflecting these structural shifts.", "section": "1 Introduction"}, {"figure_path": "I96GFYalFO/figures/figures_4_1.jpg", "caption": "Figure 2: Architecture illustration of FedSSP. The left box (a) refers to Generic Spectral Knowledge Sharing (GSKS), where we address knowledge conflict and promote effective global collaboration by sharing generic spectral knowledge extracted from spectral encoders de and of while retaining non-generic in other components. The right box (b) represents Personalized Graph Preference Adjustment (PGPA), where we leverage preference module guided by LPGPA for satisfying inconsistent preferences and achieving suitable feature of datasets locally. These two boxes correspondingly refer to the two core strategies of our framework FedSSP.", "description": "This figure illustrates the architecture of the FedSSP framework, highlighting its two core strategies: Generic Spectral Knowledge Sharing (GSKS) and Personalized Graph Preference Adjustment (PGPA). GSKS addresses knowledge conflicts by sharing generic spectral knowledge, extracted from spectral encoders, while retaining non-generic components locally to facilitate effective global collaboration.  PGPA addresses inconsistent dataset preferences by using a preference module (LPGPA) to customize features locally for optimal performance. The figure uses visual representations of the data flow and processing steps within each strategy to improve understanding.", "section": "4 Methodology"}, {"figure_path": "I96GFYalFO/figures/figures_8_1.jpg", "caption": "Figure 3: Test accuracy curves of FedSSP and six other methods along the communication rounds on our three different settings(SM, SM-CV, SM-SN-CV). The y-axis range is from 65 to 85 for all settings.", "description": "This figure displays the test accuracy curves across different federated learning methods (FedSSP, FedAvg, FedCP, FedProx, FedSage, FedStar, and GCFL) over 200 communication rounds. Three distinct experimental settings are compared: single-domain (SM), double-domain (SM-CV), and multi-domain (SM-SN-CV). The y-axis represents the test accuracy, ranging from 65% to 85%, and the x-axis denotes the number of communication rounds.", "section": "5.2 Experimental Results"}, {"figure_path": "I96GFYalFO/figures/figures_8_2.jpg", "caption": "Figure 2: Architecture illustration of FedSSP. The left box (a) refers to Generic Spectral Knowledge Sharing (GSKS), where we address knowledge conflict and promote effective global collaboration by sharing generic spectral knowledge extracted from spectral encoders de and of while retaining non-generic in other components. The right box (b) represents Personalized Graph Preference Adjustment (PGPA), where we leverage preference module guided by LPGPA for satisfying inconsistent preferences and achieving suitable feature of datasets locally. These two boxes correspondingly refer to the two core strategies of our framework FedSSP.", "description": "This figure illustrates the architecture of the FedSSP framework, highlighting its two core strategies: Generic Spectral Knowledge Sharing (GSKS) and Personalized Graph Preference Adjustment (PGPA). GSKS addresses knowledge conflicts by sharing generic spectral knowledge, promoting effective global collaboration. PGPA satisfies inconsistent preferences by making personalized adjustments to features, ensuring suitable features for local applications.", "section": "4 Methodology"}]