[{"figure_path": "s4Wx2qXhv9/tables/tables_8_1.jpg", "caption": "Table 1: Comparison of the average number of samples (resp. time) needed to decide if a point is certifiably robust with given radius. Cifar10, l2, details are in Appendix C.2.1", "description": "This table compares three different methods for certifying the robustness of a point at different radii.  The methods compared are Adaptive Horváth et al. (2022), Betting CS 2, and Union bound CS 1.  For each method and radius, the table shows the average number of samples required and the average time needed to reach a decision. The results are for the CIFAR-10 dataset and the l2 norm.", "section": "3 Experiments"}, {"figure_path": "s4Wx2qXhv9/tables/tables_8_2.jpg", "caption": "Table 2: We run the confidence sequences until the width is smaller than ε on a (both sided) confidence level 0.999. That way we can certify certain radius knowing that the true probability is at most ε larger. We used the same network as for the l2 experiment in Table 1 (WideResnet-40 on CIFAR10, σ = 1). We report the average number of samples required over 500 images.", "description": "This table compares the average number of samples required by three different methods (UB-CS, Betting-CS, and Horvath) to certify a certain radius, given a confidence level of 0.999 and different values of ε (error margin).  The experiment uses a WideResnet-40 network trained on CIFAR10 with a standard deviation (σ) of 1.  The results highlight the efficiency gains of the confidence sequence methods (UB-CS and Betting-CS) compared to the Horvath method, which requires significantly more samples.", "section": "3.1 Related work"}, {"figure_path": "s4Wx2qXhv9/tables/tables_15_1.jpg", "caption": "Table 1: Comparison of the average number of samples (resp. time) needed to decide if a point is certifiably robust with given radius. Cifar10, l2, details are in Appendix C.2.1", "description": "This table compares three different methods for certifying the robustness of a point at different radii.  The methods are Adaptive Horváth et al. (2022), Betting CS 2, and Union bound CS 1. The table shows the average number of samples required to make a decision, along with the standard deviation, for each method and radius.  It also shows the average time taken.  The results indicate that Betting CS 2 and Union bound CS 1 require significantly fewer samples than Adaptive Horváth et al. (2022) to achieve the same level of certification.", "section": "3 Experiments"}, {"figure_path": "s4Wx2qXhv9/tables/tables_16_1.jpg", "caption": "Table 1: Comparison of the average number of samples (resp. time) needed to decide if a point is certifiably robust with given radius. Cifar10, l2, details are in Appendix C.2.1", "description": "This table compares the performance of three different methods for certifying the robustness of a point at different radii (0.5, 1.25, and 2).  The methods compared are: Adaptive Horváth et al. (2022), Betting CS 2, and Union bound CS 1.  The table shows the average number of samples required to make a decision, along with the standard deviation, and the average time taken. The dataset used is CIFAR-10 with the l2 norm.", "section": "3 Experiments"}]