[{"figure_path": "DUHX779C5q/tables/tables_7_1.jpg", "caption": "Table 1: Similarity gain w/ LangGround", "description": "This table shows the improvement in cosine similarity and BLEU score achieved by LangGround compared to baselines without language grounding.  Cosine similarity measures the alignment between agent communication vectors and word embeddings, while BLEU score assesses the similarity between agent messages and reference messages from a dataset of human-like communication.", "section": "6.2 Aligned communication space"}, {"figure_path": "DUHX779C5q/tables/tables_7_2.jpg", "caption": "Table 2: Zero-shot generalization evaluation results on ppv1 (10 by 10).", "description": "This table presents the results of evaluating the zero-shot generalization capabilities of the LangGround model on a larger Predator-Prey environment (10x10 grid).  It shows the cosine similarity and BLEU scores achieved at varying levels of language grounding during training (25%, 50%, 75%, and 100%).  Higher scores indicate better alignment between the learned agent communication and human language, demonstrating the model's ability to generalize to unseen scenarios.", "section": "6.2.2 Human interpretability"}, {"figure_path": "DUHX779C5q/tables/tables_8_1.jpg", "caption": "Table 3: Zero-shot generalizability in ppvo", "description": "This table presents the results of a zero-shot generalizability test on the Predator Prey environment (ppvo).  The test evaluates the ability of the LangGround agents to communicate about unseen states (prey locations) to their teammates.  For each unseen prey location, the table shows the cosine similarity and BLEU score between the agent's generated communication message and the reference messages from the dataset D (containing messages generated by LLMs).  Example messages generated by the agents are also included to illustrate the quality of the generated communication.", "section": "6.3 Ad-hoc Teamwork"}, {"figure_path": "DUHX779C5q/tables/tables_8_2.jpg", "caption": "Table 4: Ad-hoc teamwork performance (lower is better)", "description": "This table presents the results of the ad-hoc teamwork experiments, comparing the performance of different team compositions across three environments: Predator Prey (vision=1), Predator Prey (vision=0), and Urban Search and Rescue (USAR). The team compositions include: only LangGround agents, only LLMs, a mixed team of LangGround agents and LLMs, a mixed team of aeComm agents and LLMs, and a team with no communication (only LangGround agents or LLMs). The metric is the number of steps needed to complete the task, with lower values indicating better performance. LangGround is the proposed method in the paper. The results show that homogeneous teams (LangGround+LangGround or LLM+LLM) generally perform better than heterogeneous teams (LangGround+LLM), highlighting the importance of communication alignment and training for effective ad-hoc teamwork.", "section": "6.3 Ad-hoc Teamwork"}, {"figure_path": "DUHX779C5q/tables/tables_18_1.jpg", "caption": "Table 5: Topographic similarity in ppvo", "description": "This table shows the topographic similarity (p) values for different multi-agent communication methods in the Predator-Prey environment (ppvo). Topographic similarity measures the correlation between distances in the observation space and distances in the communication space. A higher value indicates that agents generate similar communication messages for similar observations, which is a desirable property for communication effectiveness and generalizability.", "section": "6.2 Aligned communication space"}]