[{"figure_path": "IVjs67Xa44/figures/figures_7_1.jpg", "caption": "Figure 1: 95% confidence interval of stability and regret for 200 randomized general preference profiles.", "description": "This figure displays the results of an experiment comparing four different algorithms for two-sided matching markets with 20 agents and 20 arms.  The algorithms are evaluated based on their stability (the probability of producing a stable matching) and regret (the difference between the expected reward of the optimal matching and the obtained reward).  The graph shows that the AE arm-DA algorithm significantly improves the probability of achieving a stable matching and offers comparable regret performance to other algorithms.", "section": "6 Experimental Results"}, {"figure_path": "IVjs67Xa44/figures/figures_8_1.jpg", "caption": "Figure 1: 95% confidence interval of stability and regret for 200 randomized general preference profiles.", "description": "This figure displays the results of simulations comparing four different algorithms for two-sided matching markets with general preference profiles. The x-axis represents the number of samples used to estimate preferences. The y-axis of the leftmost graph shows the average stability (proportion of stable matchings) over the 200 simulations.  The middle and rightmost graphs display average and maximum regret (difference between the expected reward of an optimal matching and the achieved reward), respectively.  The four algorithms are compared: uniform agent-DA, uniform arm-DA, AE arm-DA, and CA-UCB.  The error bars represent the 95% confidence interval.", "section": "6 Experimental Results"}, {"figure_path": "IVjs67Xa44/figures/figures_9_1.jpg", "caption": "Figure 1: 95% confidence interval of stability and regret for 200 randomized general preference profiles.", "description": "This figure displays the results of an experiment comparing four algorithms: uniform agent-DA, uniform arm-DA, AE arm-DA, and CA-UCB.  The experiment involved 200 simulations with randomized general preference profiles. The graphs show the average stability, average regret, and maximum regret across these simulations, plotted against the number of samples. Error bars indicating 95% confidence intervals are also provided.", "section": "6 Experimental Results"}, {"figure_path": "IVjs67Xa44/figures/figures_9_2.jpg", "caption": "Figure 3: 95% confidence interval of agent-pessimal stable regrets for 200 randomized general preference profiles.", "description": "This figure shows the 95% confidence interval of agent-pessimal stable regrets for 200 randomized general preference profiles.  Agent-pessimal stable regret measures how much worse off an agent is in the obtained stable matching compared to the agent-optimal stable matching (the best possible outcome for the agent). The figure compares four algorithms: uniform agent-DA, uniform arm-DA, AE arm-DA, and CA-UCB. The x-axis represents the number of samples, and the y-axis represents the average regret.", "section": "6 Experimental Results"}, {"figure_path": "IVjs67Xa44/figures/figures_19_1.jpg", "caption": "Figure 1: 95% confidence interval of stability and regret for 200 randomized general preference profiles.", "description": "This figure displays the results of a simulation comparing four different algorithms for two-sided matching markets with 20 agents and 20 arms.  The algorithms are evaluated based on their ability to achieve a stable matching (stability) and their cumulative regret (average and maximum regret). The x-axis represents the number of samples used in the learning process, and the y-axis shows the performance metrics for each algorithm.  The figure illustrates that the AE arm-DA algorithm offers a higher probability of producing a stable matching compared to the others, although regret may be higher compared to the uniform agent-DA.", "section": "6 Experimental Results"}]