[{"figure_path": "VSz9na5Jtl/figures/figures_4_1.jpg", "caption": "Figure 1: Transforming Node Classification to Link Prediction. Consider a binary node classification problem. In the left figure, given a graph, the learner tries to classify node 4 into one of two classes. First, we add two supernodes to the graph, each representing one of the classes. The node classification problem is then transformed into predicting links between node 4 and the two supernodes in the right figure. Suppose the learner predicts that a link will exist between node 4 and supernode 0. If node 4 belongs to Class 0, the reward is 1, and an edge is added between node 4 and supernode 0; otherwise, the reward is 0, and an edge is added between node 4 and supernode 1.", "description": "The figure illustrates how a binary node classification problem can be converted into a link prediction problem.  A node classification task aims to assign a node to one of two classes (0 or 1).  This is transformed into a link prediction task by adding two \"supernodes\", one for each class. Then, the task becomes predicting whether a link exists between the original node and each supernode. The reward is 1 if the link prediction is correct (the node belongs to the class of the supernode it is linked to); otherwise, it is 0.", "section": "Problem Definition"}, {"figure_path": "VSz9na5Jtl/figures/figures_6_1.jpg", "caption": "Figure 2: Regret comparison of bandit-based methods on online link prediction datasets (average of 10 runs with standard deviation in shadow, detailed in Table 1).", "description": "The figure compares the cumulative regret of five different bandit-based methods for online link prediction across four datasets: MovieLens, AmazonFashion, Facebook, and GrQc.  The x-axis represents the number of rounds, and the y-axis represents the cumulative regret. Each line represents a different algorithm: EE-Net, NeuralGreedy, NeuralUCB, NeuralTS, and PRB.  The shaded area around each line indicates the standard deviation across 10 runs.  The figure shows that PRB consistently outperforms the other methods across all datasets.", "section": "6.1 Online Link Prediction"}, {"figure_path": "VSz9na5Jtl/figures/figures_8_1.jpg", "caption": "Figure 3: Regret comparison of bandit-based methods on online node classification datasets (average of 10 runs with standard deviation in shadow, detailed in Table 2.)", "description": "This figure compares the cumulative regret of several bandit-based algorithms (EE-Net, Neural Greedy, NeuralUCB, NeuralTS, and PRB) on three node classification datasets (Cora, Citeseer, and Pubmed). The x-axis represents the number of rounds, while the y-axis shows the cumulative regret. Each line represents the performance of a different algorithm on a specific dataset.  The figure visually demonstrates PRB's superior performance in terms of minimizing cumulative regret compared to the other algorithms across all datasets.", "section": "6.1 Online Node Classification"}, {"figure_path": "VSz9na5Jtl/figures/figures_16_1.jpg", "caption": "Figure 4: Running time comparison of PRB and bandit-based baselines.", "description": "This figure compares the running time of the proposed algorithm PRB with several bandit-based baselines (Neural UCB, Neural TS, Neural Greedy, EE-net, PRB-Greedy) across eight datasets (MovieLens, Facebook, GR-QC, Amazon Fashion, Cora, Citeseer, Pubmed). The running time is measured in minutes.  The datasets represent various types of graphs, including recommendation networks and citation networks. The figure shows that the running time of PRB is generally comparable to that of other baselines.  This suggests that the computational cost of PRB is not prohibitively high and that it is a practical algorithm for link prediction.", "section": "6 Experiments"}, {"figure_path": "VSz9na5Jtl/figures/figures_16_2.jpg", "caption": "Figure 5: Proportion of running time for PRB-Greedy (left) and PRB (right) between exploitation-exploration and random walk.", "description": "This figure shows a bar chart comparing the proportion of running time spent on exploitation-exploration versus random walk for both PRB-Greedy (a simplified version of PRB without the exploration network) and PRB (the full algorithm).  The chart is broken down by dataset, allowing for a comparison across different graph structures and sizes.  It visually represents the computational trade-off inherent in the algorithms: the proportion of time dedicated to the random walk step (a crucial part of PageRank integration in PRB) relative to the time for the core exploitation and exploration components.", "section": "6.1 Online Link Prediction"}, {"figure_path": "VSz9na5Jtl/figures/figures_17_1.jpg", "caption": "Figure 2: Regret comparison of bandit-based methods on online link prediction datasets (average of 10 runs with standard deviation in shadow, detailed in Table 1).", "description": "This figure compares the performance of several bandit-based methods for online link prediction on four different datasets: MovieLens, AmazonFashion, Facebook, and GrQc.  The cumulative regret is plotted against the number of rounds.  Lower regret indicates better performance.  The figure shows that PRB consistently outperforms other methods across all datasets. The shaded areas represent the standard deviation across 10 runs for each method. More detail on the quantitative results can be found in Table 1.", "section": "6.1 Online Link Prediction"}, {"figure_path": "VSz9na5Jtl/figures/figures_18_1.jpg", "caption": "Figure 2: Regret comparison of bandit-based methods on online link prediction datasets (average of 10 runs with standard deviation in shadow, detailed in Table 1).", "description": "This figure compares the cumulative regret of several bandit-based methods for online link prediction across four different datasets: MovieLens, AmazonFashion, Facebook, and GrQc.  The x-axis represents the number of rounds, and the y-axis represents the cumulative regret.  Each line represents a different method, showing their performance over time. The shaded area around each line indicates the standard deviation across 10 runs, providing a measure of variability in performance.  Table 1 provides the detailed numerical results shown graphically in this figure.", "section": "6.1 Online Link Prediction"}]