[{"figure_path": "aVK4JFpegy/tables/tables_6_1.jpg", "caption": "Table 1: Sequence compression and distinction metrics for world models compared to existing metrics (standard errors in parentheses). Models that do well on existing metrics can perform poorly on ours.", "description": "This table compares the performance of different language models on various metrics for evaluating world models. The existing metrics (next-token test and current state probe) assess the models' ability to predict the next token or the current state, respectively. The proposed metrics (compression and distinction metrics) evaluate the coherence and consistency of the models' implicit world models based on the Myhill-Nerode theorem. The results show that while some models perform well on the existing metrics, their performance can be significantly worse on the proposed metrics, indicating that those existing metrics are insufficient for fully evaluating the quality of the models' world models.", "section": "3 Illustration: Do Transformers Recover the Street Map of New York City?"}, {"figure_path": "aVK4JFpegy/tables/tables_8_1.jpg", "caption": "Table 1: Sequence compression and distinction metrics for world models compared to existing metrics (standard errors in parentheses). Models that do well on existing metrics can perform poorly on ours.", "description": "This table compares the performance of different world models on sequence compression and distinction metrics.  It contrasts the results from two existing evaluation metrics (next-token test and current state probe) with the proposed metrics.  The table shows that models performing well on the existing metrics may still poorly perform on the new metrics, highlighting limitations of existing evaluation methods.", "section": "3 Illustration: Do Transformers Recover the Street Map of New York City?"}, {"figure_path": "aVK4JFpegy/tables/tables_9_1.jpg", "caption": "Table 1: Sequence compression and distinction metrics for world models compared to existing metrics (standard errors in parentheses). Models that do well on existing metrics can perform poorly on ours.", "description": "This table compares the performance of different models on novel sequence compression and distinction metrics against existing metrics (next-token test and current-state probe). The results show that models performing well on traditional metrics may perform poorly on the newly proposed metrics, highlighting the limitations of the existing evaluation methods in assessing the coherence of implicit world models.", "section": "3 Illustration: Do Transformers Recover the Street Map of New York City?"}, {"figure_path": "aVK4JFpegy/tables/tables_15_1.jpg", "caption": "Table 1: Sequence compression and distinction metrics for world models compared to existing metrics (standard errors in parentheses). Models that do well on existing metrics can perform poorly on ours.", "description": "This table compares the performance of various models (untrained transformer, models trained on shortest paths, noisy shortest paths, and random walks) on different metrics for evaluating world models.  It contrasts two types of metrics: existing metrics (next-token test and current-state probe) and the proposed metrics (compression and distinction metrics) from the paper. The results demonstrate that models performing well on existing metrics may still have incoherent world models, highlighting the limitations of existing approaches and the value of the new metrics. Standard errors are included in parentheses to indicate the uncertainty of the results.", "section": "3 Illustration: Do Transformers Recover the Street Map of New York City?"}, {"figure_path": "aVK4JFpegy/tables/tables_16_1.jpg", "caption": "Table 3: The metrics from Section 2.4 applied to Othello sequence models. The championship and synthetic models refer to models trained on real-world tournament games and synthetic games, respectively.", "description": "This table presents the results of applying the proposed evaluation metrics (compression and distinction precision and recall) to Othello game sequence models.  It compares the performance of an untrained transformer, models trained on real championship Othello games, models trained on synthetic Othello games, and a true world model representing perfect knowledge of the game's rules. The goal is to assess how well each model captures the underlying structure of the game.  Lower precision and recall scores indicate a less accurate world model.", "section": "Other Applications: Othello and Logic Puzzles"}, {"figure_path": "aVK4JFpegy/tables/tables_17_1.jpg", "caption": "Table 1: Sequence compression and distinction metrics for world models compared to existing metrics (standard errors in parentheses). Models that do well on existing metrics can perform poorly on ours.", "description": "This table compares the performance of different generative models (untrained transformer, models trained on shortest paths, noisy shortest paths, and random walks) on both existing metrics (next-token test, current-state probe) and the proposed metrics (compression precision, distinction precision, distinction recall).  The existing metrics evaluate whether the model predicts valid next tokens and whether the model's representation can recover the current state. The proposed metrics evaluate whether the model effectively compresses similar sequences and distinguishes dissimilar sequences. The table shows that while models may achieve high scores on existing metrics, they may perform poorly on the proposed metrics, indicating the insufficiency of existing evaluation methods.", "section": "3 Illustration: Do Transformers Recover the Street Map of New York City?"}, {"figure_path": "aVK4JFpegy/tables/tables_19_1.jpg", "caption": "Table 1: Sequence compression and distinction metrics for world models compared to existing metrics (standard errors in parentheses). Models that do well on existing metrics can perform poorly on ours.", "description": "This table compares the performance of different generative models on novel metrics for evaluating world models (compression and distinction) to existing metrics (next-token and current state). The results show that models performing well on traditional metrics can still fail on the proposed metrics, highlighting the limitations of existing evaluation methods.", "section": "3 Illustration: Do Transformers Recover the Street Map of New York City?"}, {"figure_path": "aVK4JFpegy/tables/tables_19_2.jpg", "caption": "Table 1: Sequence compression and distinction metrics for world models compared to existing metrics (standard errors in parentheses). Models that do well on existing metrics can perform poorly on ours.", "description": "This table compares the performance of different generative models on various metrics for assessing world model recovery.  It contrasts the proposed metrics (compression precision, distinction precision, distinction recall) with existing metrics (next-token accuracy and current-state probe). The results reveal that models performing well on existing metrics might still have poor performance on the newly proposed metrics, highlighting the limitations of traditional evaluation approaches.", "section": "3 Illustration: Do Transformers Recover the Street Map of New York City?"}, {"figure_path": "aVK4JFpegy/tables/tables_20_1.jpg", "caption": "Table 1: Sequence compression and distinction metrics for world models compared to existing metrics (standard errors in parentheses). Models that do well on existing metrics can perform poorly on ours.", "description": "This table compares the performance of different models on various metrics for evaluating the quality of their implicit world models. It contrasts two types of metrics: existing metrics (next-token test and current-state probe) and the proposed metrics (sequence compression and distinction). The results highlight that models which perform well on existing metrics might perform poorly on the newly proposed metrics, indicating the limitations of existing methods for evaluating implicit world models.", "section": "3 Illustration: Do Transformers Recover the Street Map of New York City?"}, {"figure_path": "aVK4JFpegy/tables/tables_20_2.jpg", "caption": "Table 1: Sequence compression and distinction metrics for world models compared to existing metrics (standard errors in parentheses). Models that do well on existing metrics can perform poorly on ours.", "description": "This table compares the performance of different models on novel metrics for evaluating world models against existing metrics (next-token test and current-state probe). The novel metrics evaluate the coherence of the implicit world model learned by the generative models.  The table shows that models performing well on traditional metrics can perform poorly on the proposed metrics, indicating that traditional metrics may not be sufficient for evaluating world model recovery.", "section": "3 Illustration: Do Transformers Recover the Street Map of New York City?"}]