[{"figure_path": "15460JjocO/figures/figures_4_1.jpg", "caption": "Figure 1: Overview of the multi-recipe Overcooked game.", "description": "This figure shows the layout of the multi-recipe Overcooked game environment. Panel (a) illustrates the game's spatial setup, including the positions of the players, the chopping station, the counter, and the plate, as well as the delivery location for completed dishes. The different colored lines connecting the ingredients to the workspaces indicate which ingredients can be used at which workspace. Panel (b) illustrates the six different recipes that can be created in the game, including the single-ingredient recipes (R1-R4) and the double-ingredient recipes (R5-R6). The arrows represent the workflow of creating each recipe.", "section": "4 Understanding Effects of Specialization and Overfitness"}, {"figure_path": "15460JjocO/figures/figures_4_2.jpg", "caption": "Figure 2: Relationship of training populations in the 2D specialization-overfitness landscape.", "description": "This figure visualizes the relationship between specialization and overfitness of different training populations in a two-dimensional space.  The x-axis represents overfitness, and the y-axis represents specialization. Four different populations are plotted: the starting population (P<sub>S</sub>), a population with decreased specialization (P<sub>unspec</sub>), a population with increased overfitness (P<sub>overfit</sub>), and a population generated using the cross-play minimization (XP-min) technique. Arrows are used to show the direction of change in specialization and overfitness from the starting population to the other populations. This allows a clear visualization of how different training methods impact the key qualities of the training populations. ", "section": "4 Understanding Effects of Specialization and Overfitness"}, {"figure_path": "15460JjocO/figures/figures_4_3.jpg", "caption": "Figure 3: The recipe distribution at the last training iteration of the generalist agents trained with *Ps* (top), *P*<sub>overfit</sub> (middle), and *P*<sub>unspec</sub> (bottom).", "description": "This figure shows the recipe distribution at the end of training for generalist agents trained using three different partner populations: the oracle specialists (*P*<sub>s</sub>), the overfit partners (*P*<sub>overfit</sub>), and the unspecialized partners (*P*<sub>unspec</sub>).  The top panel displays the distribution for generalists trained with the oracle specialists, showcasing a relatively even distribution across all six recipes. The middle panel shows the distribution for generalists trained with overfit partners, indicating a slightly less diverse distribution compared to the oracle specialists. The bottom panel shows the distribution for generalists trained with unspecialized partners, exhibiting a highly uneven distribution concentrated heavily on recipes R5 and R6. This visualization highlights the impact of partner quality (specialization and overfitness) on the diversity of experiences learned by generalist agents.", "section": "4 Understanding Effects of Specialization and Overfitness"}, {"figure_path": "15460JjocO/figures/figures_5_1.jpg", "caption": "Figure 4: The average training returns of generalists trained with different oracle populations.", "description": "The figure shows the training curves of generalist agents trained with different populations of oracle partners. The x-axis represents the training iteration, and the y-axis represents the average return achieved by the generalist agents.  The plot includes separate curves for generalists trained with the original oracle specialist population (P*), a population with increased overfitness (P*overfit), and a population with decreased specialization (P*unspec).  A dashed line also shows the average return obtained by self-play agents. The figure helps to illustrate the impact of partner specialization and overfitness on the performance of the trained generalist agents.", "section": "4 Understanding Effects of Specialization and Overfitness"}, {"figure_path": "15460JjocO/figures/figures_5_2.jpg", "caption": "Figure 5: An overview diagram showing the steps in the training pipeline.", "description": "The figure illustrates the training pipeline of a generalist agent. First, XP-min training generates XP-min partners. Then, a specialization transfer process distills the knowledge from these partners into a new set of distilled partners. Finally, these distilled partners are used to train a generalist agent.", "section": "5 Specialization Transfer"}, {"figure_path": "15460JjocO/figures/figures_7_1.jpg", "caption": "Figure 6: The partner quality landscape, representing partner qualities from Table 3 visually. The color bar represents population diversity. The arrows show how different approaches improve partners' qualities. XP-min + MI + SpecTRL DAgger population is marked with *.", "description": "This figure visualizes the diversity, specialization, and overfitness of different partner populations generated using various methods (XP-min, MP-reg, SpecTRL, SpecTRL DAgger, etc.). The x-axis represents overfitness, the y-axis represents specialization, and the color intensity represents diversity. Arrows show how different methods affect these qualities. The results show that SpecTRL DAgger effectively reduces overfitness and maintains a relatively high level of diversity and specialization, resulting in more robust downstream generalist agents.", "section": "6 Experiments"}, {"figure_path": "15460JjocO/figures/figures_15_1.jpg", "caption": "Figure 7: Test success rate of generalists trained with oracle-related populations.", "description": "This figure shows a heatmap representing the success rate of generalist agents trained with four different populations (Specialists, Overfit Specialists, Unspecialized, XP-min) when tested against six different specialist partners (Lettuce (R1), Onion (R2), Tomato (R3), Carrot (R4), Tomato Lettuce (R5), Tomato Carrot (R6)). Each cell in the heatmap represents the success rate (with standard deviation in parentheses) of a generalist agent trained on a specific training population when tested on a specific specialist partner. The last column shows the harmonic mean success rates for each training population across all six specialist partners. This illustrates how the robustness of the generalist agents, trained with different populations, varies with different unseen partners.", "section": "4 Understanding Effects of Specialization and Overfitness"}]