[{"figure_path": "PSVkinBs4u/figures/figures_4_1.jpg", "caption": "Figure 1: Schematic of the DEQH model. A Hamiltonian solver must be engineered to concurrently process structural information, the Hamiltonian, and the overlap matrix, and to output the subsequent Hamiltonian iteration for DEQ convergence. Within the Hamiltonian solver, the module handling structural information is termed injection, while the remaining components are collectively referred to as filter.", "description": "This figure shows a schematic of the Deep Equilibrium Density Functional Theory Hamiltonian (DEQH) model.  The model takes as input the structural information of a molecule, the current Hamiltonian (H<sup>t</sup>), and the overlap matrix (S). These inputs are processed by the Hamiltonian solver, which consists of two parts: the injection module (which handles structural information) and the filter module (which processes Hamiltonian and overlap matrix information). The output of the Hamiltonian solver is the next iteration of the Hamiltonian (H<sup>t+1</sup>), which is then fed back into the model until convergence is achieved. This iterative process is key to capturing the self-consistency of the Hamiltonian in DFT.", "section": "4 Methods"}, {"figure_path": "PSVkinBs4u/figures/figures_5_1.jpg", "caption": "Figure 2: A schematic diagram of DEQHNet. (a) The overall architecture of DEQHNet, with the injection mechanism encapsulated within the yellow frame and the remainder designated as the filter. (b) TransBlock. Integrates the Hamiltonian and overlap matrix with structural information (relative position vectors). (c) ConvNetLayer. Responsible for processing structural information. (d) Diagonal Reduction. Transforms the Hamiltonian and overlap matrix into equivariant node features. (e)-(g) Couple node features to form diagonal and off-diagonal blocks of the Hamiltonian.", "description": "This figure shows a detailed breakdown of the DEQHNet architecture, illustrating its key components: injection, which processes structural information; filter, which processes Hamiltonian and overlap matrix data; and the DEQ solver, which iteratively refines the Hamiltonian prediction.  The figure highlights the modules and pathways involved in each step of the process, from initial structural and Hamiltonian input to the final self-consistent Hamiltonian output.", "section": "4 Methods"}, {"figure_path": "PSVkinBs4u/figures/figures_6_1.jpg", "caption": "Figure 1: Schematic of the DEQH model. A Hamiltonian solver must be engineered to concurrently process structural information, the Hamiltonian, and the overlap matrix, and to output the subsequent Hamiltonian iteration for DEQ convergence. Within the Hamiltonian solver, the module handling structural information is termed injection, while the remaining components are collectively referred to as filter.", "description": "This figure illustrates the architecture of the Deep Equilibrium Density Functional Theory Hamiltonian (DEQH) model.  The DEQH model is composed of two main parts: a Hamiltonian solver and an injection mechanism. The Hamiltonian solver takes the Hamiltonian, overlap matrix, and structural data as input and iteratively refines the Hamiltonian until convergence. The injection mechanism incorporates the structural information into the Hamiltonian solver.  The figure highlights the iterative nature of the DEQH model, which is essential for capturing the self-consistent nature of the Hamiltonian.", "section": "4 Methods"}, {"figure_path": "PSVkinBs4u/figures/figures_8_1.jpg", "caption": "Figure 4: (a) The variation in the number of DEQ iterations within DEQHNet as a function of training steps. For this analysis, 50 random configurations were selected from the uracil test set, and the iteration counts were tallied after performing inference with DEQHNet checkpoints saved during the training process. (b) The change in Hamiltonian MAE with respect to iteration count for a randomly chosen molecule from the QH9-dynamics-geo test set, comparing the self-consistent field (SCF) iterations using PySCF, DEQHNet inference, and DEQHNet inference initialized with Hamiltonians guessed by PySCF.", "description": "This figure demonstrates the convergence behavior of the DEQHNet model.  Subfigure (a) shows how the number of DEQ iterations required for convergence decreases as the model is trained for more steps. Subfigure (b) compares the convergence speed of DEQHNet to PySCF, showing that DEQHNet requires significantly fewer iterations to reach a comparable level of accuracy in Hamiltonian prediction.", "section": "5 Results"}, {"figure_path": "PSVkinBs4u/figures/figures_9_1.jpg", "caption": "Figure 5: Ablation study for MAE of Hamiltonian H, orbital energy ε, and orbital coefficients C for DEQHNet, DEQHNet without the overlap matrix as an input, QHNet, and QHNet with the addition of the overlap matrix as an input, respectively.", "description": "This figure presents the results of an ablation study comparing the performance of four different models on three metrics: MAE of the Hamiltonian (H), MAE of orbital energy (ε), and cosine similarity of orbital coefficients (C). The four models are: DEQHNet (the full model), DEQHNet without the overlap matrix, QHNet (baseline model), and QHNet with the overlap matrix. The results show that DEQHNet performs best overall, indicating the importance of the overlap matrix in improving the model's performance.", "section": "5.4 Ablation studies"}, {"figure_path": "PSVkinBs4u/figures/figures_21_1.jpg", "caption": "Figure 6: The variation in the error of orbital energy with the injection of Hermitian Gaussian noise to the Hamiltonian.", "description": "This figure shows the relationship between the error in Hamiltonian (ΔH) and the error in orbital energy (Δε).  As Hermitian Gaussian noise is added to the Hamiltonian, the error in the orbital energy increases.  The figure demonstrates that a smaller error in the Hamiltonian prediction leads to a smaller error in the predicted orbital energies.  The relationship appears to be roughly linear, indicating a strong correlation between the accuracy of the Hamiltonian prediction and the accuracy of the orbital energy prediction.", "section": "5.4 Ablation studies"}]