[{"figure_path": "ZehccYKkNH/figures/figures_1_1.jpg", "caption": "Figure 1: The Čech PD of a point cloud A in R2 for i = 1 and its t-offsets. The two points far from the diagonal ΘΩ in dgm; (A) correspond to the two large cycles in the set A.", "description": "This figure shows a Čech persistence diagram (PD) for a point cloud in 2D, illustrating how topological features (cycles in this case) are represented as points in the PD. The horizontal axis represents the birth time of a feature, while the vertical axis represents the death time. Features with longer lifespans (i.e., a larger difference between birth and death times) are represented by points further away from the diagonal line.  The figure also includes a series of offset sets showing the evolution of the point cloud as the scale parameter (t) increases. The two points far from the diagonal in the persistence diagram correspond to the two large cycles that persist through a wide range of scales within the offset sets.", "section": "1 Introduction"}, {"figure_path": "ZehccYKkNH/figures/figures_3_1.jpg", "caption": "Figure 2: PDs of M (red) and of A (black).", "description": "This figure shows persistence diagrams of a manifold M (in red) and a subset A of M (in black).  It illustrates the three regions identified in Theorem 2.2 of the paper. Region (1) near the diagonal contains points corresponding to small-scale topological features.  Region (2) shows points that survive small perturbations but whose positions are still affected by the approximation, and Region (3) contains large-scale features whose positions are precisely controlled.", "section": "2 Čech persistence diagrams for subsets of submanifolds"}, {"figure_path": "ZehccYKkNH/figures/figures_4_1.jpg", "caption": "Figure 3: A generic torus.", "description": "This figure shows a visualization of a generic torus, which is a type of geometric object studied in the paper.  A torus is a three-dimensional surface shaped like a donut.  The term \"generic\" implies the torus has properties that make it suitable for the mathematical analysis in the paper, specifically concerning the distance function to the surface and the stability of persistent homology.  The coloring likely represents some topological or geometric property of the surface.", "section": "3 Čech persistence diagrams for subsets of generic submanifolds"}, {"figure_path": "ZehccYKkNH/figures/figures_7_1.jpg", "caption": "Figure 4: Left: the Čech PD dgm₁ (An) of a sample of n = 104 points sampled on a generic torus, with points in Regions (1), (2) and (3) highlighted in different colors. Right: the persistence images of dgm₁ (An) with weight pers", "description": "The figure shows the Čech persistence diagram (left) of a sample of 104 points on a generic torus, with points categorized into three regions based on their proximity to the diagonal.  The persistence images (right) illustrate the impact of different weight parameters (p = 0, 1, 2, 4) on the representation of persistence features. ", "section": "Numerical experiments"}, {"figure_path": "ZehccYKkNH/figures/figures_8_1.jpg", "caption": "Figure 5: Plot in log-log scale of Persp(dgmᵢ(An)) as a function of n for points sampled on a circle, i = 0 (left), points sampled on a torus, i = 0 (center), points sampled on a torus, i = 1 (right). Dashed lines have slopes equal to 1 – p/m.", "description": "This figure shows the log-log plots of the total persistence Persp(dgmᵢ(An)) against the number of samples n.  It presents three scenarios: points sampled on a circle (i=0, left), points sampled on a torus (i=0, center), and points sampled on a torus (i=1, right).  The dashed lines indicate the theoretical slopes (1-p/m), which are related to the convergence rate of the total persistence as described in Theorem 4.1. The convergence is expected for the case of p > m.", "section": "4 Random samplings of submanifolds"}, {"figure_path": "ZehccYKkNH/figures/figures_8_2.jpg", "caption": "Figure 6: Left: Heatmap of µn,1 for n = 5 · 104 points sampled on the torus with density f. Center: Heatmap of µf,1. Right: OT2 distance between µn,1 and µf,1 (normalized by OT2(0, µf,i)) for n ranging from 102 to 105.", "description": "The figure shows the convergence of the random measure µn,i to µf,i in the Wasserstein distance. The left panel shows the heatmap of the measure µn,i for n=50000, approximated by kernel density estimation. The central panel shows the heatmap of the theoretical limit µf,i computed using the change of variable formula. The right panel shows the convergence of the OT2 distance between µn,i and µf,i to 0 as n increases.", "section": "4 Random samplings of submanifolds"}]