[{"figure_path": "kqmucDKVcU/figures/figures_1_1.jpg", "caption": "Figure 1: Our Optimal Flow Matching (OFM). For any initial transport plan π between po and p1, OFM obtains exactly straight trajectories (in just a single FM loss minimization) which carry out the OT displacement for the quadratic cost function.", "description": "This figure illustrates the core idea of the Optimal Flow Matching (OFM) method.  It shows how, starting with an arbitrary initial transport plan (a way to map points from the source distribution *p₀* to the target distribution *p₁*), OFM achieves straight trajectories in a single step that precisely solve the optimal transport problem for quadratic cost.  In contrast to other methods that use iterative procedures and might produce curved trajectories, OFM leverages convex functions to directly produce straight paths.", "section": "Contributions"}, {"figure_path": "kqmucDKVcU/figures/figures_3_1.jpg", "caption": "Figure 2: Flow Matching (FM) obtains a vector field u moving po to p1. FM typically operates with the independent transport plan π = po × p1.", "description": "This figure illustrates the concept of Flow Matching (FM).  It shows two probability distributions, p0 (green) and p1 (orange), and samples drawn from them.  Initially, there are direct connections between samples from p0 and p1.  The FM algorithm then finds a vector field, represented by the red arrow, that aims to move points from distribution p0 to p1. This vector field aims to align the movement with the direction connecting each pair of samples from the original distributions, making the trajectories more direct, ideally straight lines.  The resulting transport plan is often not the true optimal transport plan.", "section": "2.4 Flow Matching Framework"}, {"figure_path": "kqmucDKVcU/figures/figures_3_2.jpg", "caption": "Figure 2: Flow Matching (FM) obtains a vector field u moving po to p1. FM typically operates with the independent transport plan π = po × p1.", "description": "This figure illustrates the concept of Flow Matching (FM).  It shows two probability distributions, po (green) and p1 (orange), connected by a transport plan π, represented by lines connecting points from po to p1.  FM aims to find a vector field u that moves po to p1.  The independent transport plan π = po × p1 is a simple case where each point in po is independently connected to a point in p1, as shown by the lines. The resulting flow is depicted below, where the vector field u guides the points of po towards p1.", "section": "2.4 Flow Matching Framework"}, {"figure_path": "kqmucDKVcU/figures/figures_4_1.jpg", "caption": "Figure 4: Rectified Flow iteratively applies FM to straighten the trajectories after each step.", "description": "Rectified Flow is an iterative method that refines the transport plan by applying Flow Matching repeatedly.  The initial transport plan (e.g., independent plan) is gradually rectified.  In each iteration, Flow Matching (FM) is applied to the current transport plan (π<sup>k</sup>) to generate a new flow map (φ<sup>k+1</sup>). This flow map is then used to update the transport plan (π<sup>k+1</sup>) for the next iteration.  This process continues for K iterations.  With each iteration, the trajectories generated by the flow map become increasingly straight, improving the approximation of the Optimal Transport (OT) map. The figure depicts this process visually, showing the trajectories becoming more aligned between the initial distribution and the target distribution as the number of iterations (k) increases.", "section": "2.4.3 Rectified Flow (RF)"}, {"figure_path": "kqmucDKVcU/figures/figures_5_1.jpg", "caption": "Figure 5: An Optimal Vector Field: a vector field u with straight paths is parametrized by a gradient of a convex function Ψ.", "description": "This figure illustrates the concept of an optimal vector field in the context of Optimal Flow Matching.  It shows how a vector field, denoted as *u*, can be parameterized by the gradient of a convex function, Ψ.  The key feature is that this specific type of vector field, by its design, will always generate straight trajectories (paths) when used to transport probability distributions. The figure displays sample points (z0, z1, z2) from an initial distribution (p0) being transported to corresponding points in the target distribution (p1) along straight lines. The vector field *u*(xt) is calculated at any point xt, based on the inverse of the flow map φ-1(xt), which recovers the origin point z0 along the straight path. This property is crucial for the efficiency and accuracy of the Optimal Flow Matching algorithm.", "section": "3 Optimal Flow Matching (OFM)"}, {"figure_path": "kqmucDKVcU/figures/figures_8_1.jpg", "caption": "Figure 6: Performance of our Optimal Flow Matching on Gaussian Eight Gaussians 2D setup.", "description": "This figure shows the results of applying the Optimal Flow Matching (OFM) algorithm to a simple 2D problem involving a Gaussian source distribution and a target distribution consisting of eight Gaussians.  It demonstrates the algorithm's performance with different initial transport plans π. (b) illustrates OFM's performance when using an independent initial plan (π = p₀ × p₁). (c) and (d) show the results obtained with minibatch and antiminibatch plans, respectively.  The plots show the input and target distributions, the learned trajectories, and the final distribution obtained by the OFM.  The consistent results across different initial plans highlight the robustness of the OFM.", "section": "4.1 Illustrative 2D Example"}, {"figure_path": "kqmucDKVcU/figures/figures_9_1.jpg", "caption": "Figure 7: Unpaired I2I Adult→Child by FM solvers, ALAE 1024 × 1024 FFHQ latent space.", "description": "This figure shows the results of unpaired image-to-image translation using different flow matching methods.  The goal is to translate adult faces into child faces in the latent space of a pretrained ALAE autoencoder. The figure displays sample images generated by the OFM (ours), RF, c-RF, and OT-CFM methods, demonstrating the visual quality and differences in generated child faces produced by each method.", "section": "4.3 Unpaired Image-to-image Transfer"}, {"figure_path": "kqmucDKVcU/figures/figures_19_1.jpg", "caption": "Figure 6: Performance of our Optimal Flow Matching on Gaussian Eight Gaussians 2D setup.", "description": "This figure shows the results of applying Optimal Flow Matching (OFM) to a 2D problem with different initial transport plans. The input distribution is a standard Gaussian, and the target distribution is a mixture of eight Gaussians. The figure shows that OFM obtains similar results for various plans, indicating plan independence, a key advantage of the proposed method.", "section": "4.1 Illustrative 2D Example"}, {"figure_path": "kqmucDKVcU/figures/figures_20_1.jpg", "caption": "Figure 7: Unpaired I2I Adult→Child by FM solvers, ALAE 1024 × 1024 FFHQ latent space.", "description": "This figure shows the results of unpaired image-to-image translation using different flow matching methods (OT-CFM, RF, c-RF, and OFM) in the latent space of a pretrained ALAE autoencoder.  The top row displays the input adult images. Subsequent rows show the results of translating those adult images into child images using the indicated method.  The results demonstrate the ability of the OFM approach to produce more realistic and coherent child images compared to the other methods.", "section": "4.3 Unpaired Image-to-image Transfer"}, {"figure_path": "kqmucDKVcU/figures/figures_21_1.jpg", "caption": "Figure 10: L²-UVP metric depending on the elapsed training time in dimension D = 32.", "description": "The figure shows the L²-UVP metric (a measure of the quality of the retrieved transport maps) plotted against training time (in hours) for various methods: RF, c-RF, OT-CFM, and OFM. It illustrates how quickly each method approaches the optimal transport map, with OFM demonstrating faster convergence. The y-axis is on a logarithmic scale, highlighting the difference in convergence speed between methods.", "section": "4.2 High-dimensional OT Benchmarks"}]