[{"figure_path": "KKrj1vCQaG/tables/tables_6_1.jpg", "caption": "Table 1: Quantitative comparison for face-centric personalization. The inference time is measured in seconds on an NVIDIA A800. Unlike the previous state-of-the-art methods that require training on large face datasets (the number of images is listed for reference), our method achieves superior performance in a training-free manner, by exploiting the guidance from an off-the-shelf discriminator.", "description": "This table presents a quantitative comparison of different methods for face-centric personalization.  It compares the proposed RectifID method to several existing methods, showing metrics such as identity preservation (Identity ↑), prompt consistency (Prompt ↑), and inference time (Time ↓).  A key aspect highlighted is that RectifID achieves superior performance without requiring training on large face datasets, unlike many of the other methods compared.", "section": "4.2 Main Results"}, {"figure_path": "KKrj1vCQaG/tables/tables_8_1.jpg", "caption": "Table 1: Quantitative comparison for face-centric personalization. The inference time is measured in seconds on an NVIDIA A800. Unlike the previous state-of-the-art methods that require training on large face datasets (the number of images is listed for reference), our method achieves superior performance in a training-free manner, by exploiting the guidance from an off-the-shelf discriminator.", "description": "This table presents a quantitative comparison of different methods for face-centric personalization.  The key metrics are identity preservation (Identity ↑), prompt consistency (Prompt ↑), and inference time (Time ↓).  It highlights that the proposed RectifID method outperforms existing state-of-the-art methods in terms of identity preservation and prompt consistency while being significantly faster.  Importantly, RectifID is a training-free method, unlike most other methods listed, which require extensive training on large datasets.", "section": "4.2 Main Results"}]