[{"figure_path": "5p57uCUH8k/tables/tables_7_1.jpg", "caption": "Table 1: Quantitative results on LSRW [4] and LOL [5] datasets. For a fair comparison, we re-trained some models on LOL and marked them with *. Among the unsupervised approaches, the best score is displayed in red, the second best in blue, and the third best in black. For more comparison results in terms of non-reference metrics, please refer to Appendix A.4.3.", "description": "This table presents a quantitative comparison of different low-light image enhancement methods on the LSRW and LOL benchmark datasets.  The results are evaluated using PSNR and SSIM metrics, with separate columns for normal and GT Mean evaluation.  The table highlights the best performing unsupervised methods in red, the second-best in blue, and the third-best in black.  It also indicates when models were retrained on the LOL dataset for a fairer comparison. More detailed non-reference metric comparisons can be found in Appendix A.4.3.", "section": "4.3 Quantitative Comparisons"}, {"figure_path": "5p57uCUH8k/tables/tables_7_2.jpg", "caption": "Table 1: Quantitative results on LSRW [4] and LOL [5] datasets. For a fair comparison, we re-trained some models on LOL and marked them with *. Among the unsupervised approaches, the best score is displayed in red, the second best in blue, and the third best in black. For more comparison results in terms of non-reference metrics, please refer to Appendix A.4.3.", "description": "This table presents a quantitative comparison of various low-light image enhancement methods on the LSRW and LOL datasets.  The results are evaluated using PSNR and SSIM metrics, with separate columns for normal and GT Mean evaluations.  The table highlights the performance of the proposed CLODE method against other state-of-the-art unsupervised and supervised methods, indicating its superior performance, especially when considering the unsupervised category.  The best scores are highlighted for clarity.", "section": "4.3 Quantitative Comparisons"}, {"figure_path": "5p57uCUH8k/tables/tables_8_1.jpg", "caption": "Table 3: Comparative experiments according to using NODE on LSRW [4]/LOL [5]. The \"Discrete\" refers to performing curve adjustment in discrete steps, similar to the conventional methods [6, 9], and \"Continuous\" refers to the reformulation of NODE.", "description": "This table compares the performance of curve adjustment using NODE in both discrete and continuous spaces. The discrete approach uses fixed update steps (1, 5, 10, 20, 30), while the continuous approach uses adaptive steps up to a maximum of 30.  The results show that the continuous approach with NODE produces more accurate curve parameters and superior performance.", "section": "4.5 Ablation Study"}, {"figure_path": "5p57uCUH8k/tables/tables_8_2.jpg", "caption": "Table 1: Quantitative results on LSRW [4] and LOL [5] datasets. For a fair comparison, we re-trained some models on LOL and marked them with *. Among the unsupervised approaches, the best score is displayed in red, the second best in blue, and the third best in black. For more comparison results in terms of non-reference metrics, please refer to Appendix A.4.3.", "description": "This table presents a quantitative comparison of different low-light image enhancement methods on the LSRW and LOL benchmark datasets.  The results are evaluated using PSNR and SSIM metrics.  The table highlights the performance of CLODE and its variant (CLODE†) in comparison to both supervised and unsupervised methods, showcasing its state-of-the-art performance, especially among unsupervised methods.  The use of GT Mean is also noted as a specific evaluation technique.", "section": "4.3 Quantitative Comparisons"}, {"figure_path": "5p57uCUH8k/tables/tables_8_3.jpg", "caption": "Table 4: Impact of the modules in fθ. Noise Removal and the layer normalization (LN) significantly improve performance.", "description": "This ablation study investigates the effects of including the Noise Removal module (g) and Layer Normalization (LN) within the Curve Parameter Estimation module (h) on the overall performance of the model. The results demonstrate that incorporating both modules leads to significant improvements in PSNR and SSIM compared to the baseline model without these components.", "section": "3.2 Continuous Exposure Learning for Low-light Image Enhancement using Neural ODEs"}, {"figure_path": "5p57uCUH8k/tables/tables_13_1.jpg", "caption": "Table 6: Ablation study on each non-reference losses. The experiment is evaluated on LOL [5].", "description": "This table shows the ablation study results on the LOL dataset for each of the five non-reference loss functions used in the proposed method. Each row represents a different experiment where one loss function is removed. The results (PSNR and SSIM) demonstrate the importance of each loss function for achieving optimal performance.", "section": "A.2 Impact of Each Loss Functions"}, {"figure_path": "5p57uCUH8k/tables/tables_15_1.jpg", "caption": "Table 1: Quantitative results on LSRW [4] and LOL [5] datasets. For a fair comparison, we re-trained some models on LOL and marked them with *. Among the unsupervised approaches, the best score is displayed in red, the second best in blue, and the third best in black. For more comparison results in terms of non-reference metrics, please refer to Appendix A.4.3.", "description": "This table presents a quantitative comparison of the proposed CLODE model's performance against several state-of-the-art low-light image enhancement methods on two benchmark datasets: LSRW and LOL.  The results are evaluated using Peak Signal-to-Noise Ratio (PSNR) and Structural Similarity Index (SSIM).  The table highlights the superior performance of CLODE, especially compared to other unsupervised methods, and even shows competitive performance against supervised methods in terms of PSNR.  The number of model parameters is also included for comparison. Re-training some models on LOL dataset is also indicated in the caption.", "section": "4.3 Quantitative Comparisons"}]