[{"figure_path": "IAse6CAG26/tables/tables_7_1.jpg", "caption": "Table 1: The performance of multi-modal entity alignment on two datasets. The best results are indicated in bold, and second-best results are marked with underlines.", "description": "This table presents the performance comparison of different multi-modal entity alignment methods on two benchmark datasets: FB15K-DB15K and FB15K-YG15K.  The results are evaluated using several metrics including Hits@1, Hits@5, Hits@10, Mean Rank (MR), and Mean Reciprocal Rank (MRR).  The best and second-best results for each metric on each dataset are highlighted to show the relative performance of the methods. The table provides a quantitative assessment of the effectiveness of various approaches in aligning entities across different multimodal knowledge graphs.", "section": "5.2 Performance Comparison"}, {"figure_path": "IAse6CAG26/tables/tables_8_1.jpg", "caption": "Table 1: The performance of multi-modal entity alignment on two datasets. The best results are indicated in bold, and second-best results are marked with underlines.", "description": "This table presents the results of multi-modal entity alignment experiments on two datasets: FB15K-DB15K and FB15K-YG15K.  It compares various methods, showing their performance using Hits@1, Hits@5, Hits@10, Mean Reciprocal Rank (MRR), and Mean Rank (MR) metrics.  Higher values for Hits@N and MRR are better, while a lower value for MR is better. The table highlights the superior performance of the proposed TMEA method compared to existing state-of-the-art and baseline approaches.", "section": "5.2 Performance Comparison"}, {"figure_path": "IAse6CAG26/tables/tables_15_1.jpg", "caption": "Table 1: The performance of multi-modal entity alignment on two datasets. The best results are indicated in bold, and second-best results are marked with underlines.", "description": "This table presents the performance comparison of various multi-modal entity alignment methods on two benchmark datasets, FB15K-DB15K and FB15K-YG15K.  The results are evaluated using four metrics: Hits@1, Hits@5, Hits@10, and Mean Reciprocal Rank (MRR).  The table highlights the superior performance of the proposed TMEA method over existing state-of-the-art approaches.", "section": "5.2 Performance Comparison"}]