[{"figure_path": "RcPAJAnpnm/tables/tables_4_1.jpg", "caption": "Table 1: Overall performance on CiL scenarios of Evolving Kitchen and Evolving World: The rows represent baselines, categorized into sequential adaptation and adapter-based approaches, and oracle, respectively. The columns represent continual learning scenarios, where each scenario has 20 stages. Each scenario in the environment is categorized into Complete, Semi-complete, and Incomplete. The highest performance is highlighted in bold and the second highest performance is underlined.", "description": "This table presents a quantitative comparison of different continual imitation learning (CIL) methods on two complex tasks: Evolving Kitchen and Evolving World.  The results are broken down by three scenarios (Complete, Semi-complete, and Incomplete) that vary the amount and completeness of the training data.  The table shows the Forward Transfer (FWT), Backward Transfer (BWT), and Area Under Curve (AUC) for each method across all scenarios, providing a comprehensive view of their performance in terms of adapting to new tasks and retaining previously learned knowledge.", "section": "4 Experiments"}, {"figure_path": "RcPAJAnpnm/tables/tables_6_1.jpg", "caption": "Table 1: Overall performance on CiL scenarios of Evolving Kitchen and Evolving World: The rows represent baselines, categorized into sequential adaptation and adapter-based approaches, and oracle, respectively. The columns represent continual learning scenarios, where each scenario has 20 stages. Each scenario in the environment is categorized into Complete, Semi-complete, and Incomplete. The highest performance is highlighted in bold and the second highest performance is underlined.", "description": "This table presents a comparison of different continual imitation learning (CIL) methods across three scenarios (Complete, Semi-complete, and Incomplete) in two environments (Evolving Kitchen and Evolving World).  Each scenario consists of 20 stages with varying levels of data completeness. The table shows the forward transfer (FWT), backward transfer (BWT), and area under the curve (AUC) for each method and scenario. The highest and second highest performing methods are highlighted for easy comparison.", "section": "4.1 Environments and data streams"}, {"figure_path": "RcPAJAnpnm/tables/tables_7_1.jpg", "caption": "Table 2: Task adaptation performance with unseen tasks: This is based on the existing Evolving World-Complete and Evolving Kitchen-Complete. In Evolving World, four novel tasks are introduced every four stages, while in Evolving Kitchen, two novel tasks are introduced every five stages. Metrics with the suffix -A denote performance based solely on adaptation tasks, while other metrics report performance across all tasks.", "description": "This table presents the results of task adaptation experiments using unseen tasks in two environments: Evolving Kitchen and Evolving World.  For each environment, the table shows the performance (FWT, BWT, AUC) of different algorithms, including both on all tasks and only on the unseen adaptation tasks (FWT-A, AUC-A).  The suffix '-A' indicates metrics calculated specifically for the unseen tasks, providing a more focused view on adaptation capabilities.  The table allows for comparison of different continual learning algorithms in their ability to handle newly introduced tasks and adapt their models.", "section": "4.4 Task adaptation"}, {"figure_path": "RcPAJAnpnm/tables/tables_7_2.jpg", "caption": "Table 3: Overall performance with task unlearning as task adaptation: Additional stages for unlearning tasks that were learned during other stages are included for tests.", "description": "This table shows the performance of different continual learning algorithms on two scenarios: Evolving Kitchen-Complete Unlearning and Evolving Kitchen-Incomplete Unlearning.  The algorithms were evaluated on their ability to adapt to novel tasks and also to effectively unlearn previously learned tasks. The results are presented in terms of Forward Transfer (FWT), Backward Transfer (BWT), and Area Under the Curve (AUC), all expressed as percentages. The FWT, BWT, and AUC metrics assess task adaptation, how well the algorithms maintain performance on previous tasks after learning new ones, and overall continual learning performance, respectively.", "section": "4. Experiments"}, {"figure_path": "RcPAJAnpnm/tables/tables_8_1.jpg", "caption": "Table 1: Overall performance on CiL scenarios of Evolving Kitchen and Evolving World: The rows represent baselines, categorized into sequential adaptation and adapter-based approaches, and oracle, respectively. The columns represent continual learning scenarios, where each scenario has 20 stages. Each scenario in the environment is categorized into Complete, Semi-complete, and Incomplete. The highest performance is highlighted in bold and the second highest performance is underlined.", "description": "This table presents the results of continual imitation learning (CiL) experiments on two environments: Evolving Kitchen and Evolving World.  Multiple baselines are compared, categorized as sequential adaptation, adapter-based methods, and a multi-task oracle (representing ideal performance). The table shows Forward Transfer (FWT), Backward Transfer (BWT), and Area Under the Curve (AUC) for three scenarios (Complete, Semi-complete, and Incomplete) each with 20 stages.  Higher values for FWT, BWT, and AUC indicate better performance. The scenarios differ in how much of the demonstration data is available for each task. The table helps assess the sample efficiency and task adaptation capabilities of different continual learning approaches.", "section": "4.1 Environments and data streams"}, {"figure_path": "RcPAJAnpnm/tables/tables_13_1.jpg", "caption": "Table 1: Overall performance on CiL scenarios of Evolving Kitchen and Evolving World: The rows represent baselines, categorized into sequential adaptation and adapter-based approaches, and oracle, respectively. The columns represent continual learning scenarios, where each scenario has 20 stages. Each scenario in the environment is categorized into Complete, Semi-complete, and Incomplete. The highest performance is highlighted in bold and the second highest performance is underlined.", "description": "This table presents a comparison of different continual imitation learning (CIL) methods on two benchmark tasks: Evolving Kitchen and Evolving World.  The methods are categorized into sequential adaptation, adapter-based approaches, and a multi-task oracle (representing optimal performance). Results are shown for three scenarios representing varying levels of data completeness (Complete, Semi-complete, Incomplete) across 20 stages of continual learning.  The metrics used are Forward Transfer (FWT), Backward Transfer (BWT), and Area Under the Curve (AUC), all based on goal-conditioned success rates.  Higher values generally indicate better performance.", "section": "4 Experiments"}, {"figure_path": "RcPAJAnpnm/tables/tables_13_2.jpg", "caption": "Table 1: Overall performance on CiL scenarios of Evolving Kitchen and Evolving World: The rows represent baselines, categorized into sequential adaptation and adapter-based approaches, and oracle, respectively. The columns represent continual learning scenarios, where each scenario has 20 stages. Each scenario in the environment is categorized into Complete, Semi-complete, and Incomplete. The highest performance is highlighted in bold and the second highest performance is underlined.", "description": "This table presents the results of continual imitation learning (CiL) experiments conducted on two environments: Evolving Kitchen and Evolving World.  It compares various baseline methods (sequential adaptation and adapter-based approaches) against the proposed IsCiL method and an oracle (multi-task learning). The performance is evaluated across three scenarios (Complete, Semi-complete, and Incomplete), each comprising 20 stages. The table reports the Forward Transfer (FWT), Backward Transfer (BWT), and Area Under the Curve (AUC) for each method and scenario, highlighting the best and second-best performing methods.", "section": "4.1 Environments and data streams"}, {"figure_path": "RcPAJAnpnm/tables/tables_14_1.jpg", "caption": "Table 1: Overall performance on CiL scenarios of Evolving Kitchen and Evolving World: The rows represent baselines, categorized into sequential adaptation and adapter-based approaches, and oracle, respectively. The columns represent continual learning scenarios, where each scenario has 20 stages. Each scenario in the environment is categorized into Complete, Semi-complete, and Incomplete. The highest performance is highlighted in bold and the second highest performance is underlined.", "description": "This table presents a comparison of different continual imitation learning (CIL) methods on two complex tasks: Evolving Kitchen and Evolving World.  It shows the performance of each method across three different scenarios (Complete, Semi-complete, and Incomplete) that vary in the completeness of the training data. The metrics used for evaluation include Forward Transfer (FWT), Backward Transfer (BWT), and Area Under the Curve (AUC). The results show how well each method adapts to new tasks, maintains performance on previously learned tasks, and learns efficiently across different stages and scenarios.", "section": "4. Experiments"}, {"figure_path": "RcPAJAnpnm/tables/tables_14_2.jpg", "caption": "Table 2: Task adaptation performance with unseen tasks: This is based on the existing Evolving World-Complete and Evolving Kitchen-Complete. In Evolving World, four novel tasks are introduced every four stages, while in Evolving Kitchen, two novel tasks are introduced every five stages. Metrics with the suffix -A denote performance based solely on adaptation tasks, while other metrics report performance across all tasks.", "description": "This table presents the results of experiments evaluating the task adaptation performance of different continual learning methods when faced with completely unseen tasks.  Two environments are tested: Evolving World and Evolving Kitchen.  Novel tasks are introduced periodically, and performance is measured both on these new tasks and on previously learned tasks. The suffix '-A' denotes metrics calculated only from the new adaptation tasks, providing a focused evaluation of the algorithm's ability to learn new tasks.", "section": "4.4 Task adaptation"}, {"figure_path": "RcPAJAnpnm/tables/tables_16_1.jpg", "caption": "Table 1: Overall performance on CiL scenarios of Evolving Kitchen and Evolving World: The rows represent baselines, categorized into sequential adaptation and adapter-based approaches, and oracle, respectively. The columns represent continual learning scenarios, where each scenario has 20 stages. Each scenario in the environment is categorized into Complete, Semi-complete, and Incomplete. The highest performance is highlighted in bold and the second highest performance is underlined.", "description": "This table presents the results of continual imitation learning (CIL) experiments on two environments: Evolving Kitchen and Evolving World.  It compares various CIL methods (including the proposed IsCiL method) across three different scenarios (Complete, Semi-complete, and Incomplete) which vary in the completeness of the demonstrations provided for each task. The table shows the performance of each method in terms of Forward Transfer (FWT), Backward Transfer (BWT), and Area Under the Curve (AUC).  Higher values for all three metrics indicate better performance.", "section": "4.1 Environments and data streams"}, {"figure_path": "RcPAJAnpnm/tables/tables_16_2.jpg", "caption": "Table 1: Overall performance on CiL scenarios of Evolving Kitchen and Evolving World: The rows represent baselines, categorized into sequential adaptation and adapter-based approaches, and oracle, respectively. The columns represent continual learning scenarios, where each scenario has 20 stages. Each scenario in the environment is categorized into Complete, Semi-complete, and Incomplete. The highest performance is highlighted in bold and the second highest performance is underlined.", "description": "This table presents the results of continual imitation learning (CiL) experiments on two different environments, \"Evolving Kitchen\" and \"Evolving World.\"  Several baselines are compared against the proposed IsCiL method. The performance is evaluated across three scenarios: Complete, Semi-complete (with some missing demonstrations), and Incomplete (with many missing demonstrations).  The metrics used to assess performance are Forward Transfer (FWT), Backward Transfer (BWT), and Area Under Curve (AUC).  The table highlights the best and second-best performing methods for each scenario and environment.", "section": "4.1 Environments and data streams"}, {"figure_path": "RcPAJAnpnm/tables/tables_16_3.jpg", "caption": "Table 1: Overall performance on CiL scenarios of Evolving Kitchen and Evolving World: The rows represent baselines, categorized into sequential adaptation and adapter-based approaches, and oracle, respectively. The columns represent continual learning scenarios, where each scenario has 20 stages. Each scenario in the environment is categorized into Complete, Semi-complete, and Incomplete. The highest performance is highlighted in bold and the second highest performance is underlined.", "description": "This table presents a comparison of different continual imitation learning (CIL) methods on two benchmark environments: Evolving Kitchen and Evolving World.  The methods are categorized into sequential adaptation and adapter-based approaches. Three scenarios are evaluated: Complete, Semi-complete, and Incomplete, which vary in the amount of training data available for each task.  The results show the forward transfer (FWT), backward transfer (BWT), and area under the curve (AUC) for each method across different scenarios.  The table highlights the best-performing method for each scenario and provides a quantitative assessment of the efficiency and robustness of various CIL approaches.", "section": "4.1 Environments and data streams"}, {"figure_path": "RcPAJAnpnm/tables/tables_17_1.jpg", "caption": "Table 1: Overall performance on CiL scenarios of Evolving Kitchen and Evolving World: The rows represent baselines, categorized into sequential adaptation and adapter-based approaches, and oracle, respectively. The columns represent continual learning scenarios, where each scenario has 20 stages. Each scenario in the environment is categorized into Complete, Semi-complete, and Incomplete. The highest performance is highlighted in bold and the second highest performance is underlined.", "description": "This table presents the results of continual imitation learning (CIL) experiments on two environments: Evolving Kitchen and Evolving World.  Different CIL algorithms (baselines and the proposed IsCiL) are evaluated across three scenarios (Complete, Semi-complete, and Incomplete) varying in the completeness of the demonstrations provided for each task.  The scenarios differ in how much of the data is available for each task. Performance is measured using Forward Transfer (FWT), Backward Transfer (BWT), and Area Under the Curve (AUC), all calculated from goal-conditioned success rates. The table highlights the best and second-best performing algorithms for each scenario.", "section": "4. Experiments"}, {"figure_path": "RcPAJAnpnm/tables/tables_18_1.jpg", "caption": "Table 1: Overall performance on CiL scenarios of Evolving Kitchen and Evolving World: The rows represent baselines, categorized into sequential adaptation and adapter-based approaches, and oracle, respectively. The columns represent continual learning scenarios, where each scenario has 20 stages. Each scenario in the environment is categorized into Complete, Semi-complete, and Incomplete. The highest performance is highlighted in bold and the second highest performance is underlined.", "description": "This table presents the overall performance comparison of various continual imitation learning (CIL) methods across different scenarios (Complete, Semi-complete, and Incomplete) in two environments: Evolving Kitchen and Evolving World.  The methods are categorized as sequential adaptation, adapter-based approaches, and a multi-task oracle.  Each scenario consists of 20 stages, and performance is measured using Forward Transfer (FWT), Backward Transfer (BWT), and Area Under the Curve (AUC) metrics.  The table highlights the best and second-best performing methods for each scenario.", "section": "4.1 Environments and data streams"}, {"figure_path": "RcPAJAnpnm/tables/tables_18_2.jpg", "caption": "Table 1: Overall performance on CiL scenarios of Evolving Kitchen and Evolving World: The rows represent baselines, categorized into sequential adaptation and adapter-based approaches, and oracle, respectively. The columns represent continual learning scenarios, where each scenario has 20 stages. Each scenario in the environment is categorized into Complete, Semi-complete, and Incomplete. The highest performance is highlighted in bold and the second highest performance is underlined.", "description": "This table presents the results of continual imitation learning (CIL) experiments on two environments: Evolving Kitchen and Evolving World.  Different CIL algorithms (baselines and the proposed IsCiL) are evaluated across three scenarios (Complete, Semi-complete, and Incomplete) which vary in the completeness of the provided demonstrations.  The table shows the forward transfer (FWT), backward transfer (BWT), and area under the curve (AUC) for each algorithm and scenario, indicating their performance in adapting to new tasks and retaining knowledge of previously learned tasks.  Higher values indicate better performance. The best-performing algorithm is highlighted in bold, and the second-best is underlined.", "section": "4 Experiments"}]