[{"figure_path": "iO6tcLJEwA/tables/tables_5_1.jpg", "caption": "Table 1. Quantitative comparisons. We evaluate our method by rendering three novel view images from two reference viewpoints for each scene. The performance is determined by averaging across all scenes. The dataset's training and testing split follows the protocol established by pixelSplat [6]. The inference time includes both scene encoding and rendering time, tested on a single RTX-4090 GPU.", "description": "This table presents a quantitative comparison of the proposed eFreeSplat method against several state-of-the-art baselines on two benchmark datasets (RealEstate10K and ACID).  The metrics used for evaluation are PSNR, SSIM, and LPIPS, which measure the quality of the novel view synthesis.  The inference time on a single RTX 4090 GPU is also reported.", "section": "4 Experiments"}, {"figure_path": "iO6tcLJEwA/tables/tables_7_1.jpg", "caption": "Table 2. In more challenging scenarios, we classify the RealEstate10K dataset [72] into three subsets based on the overlap size of the reference images: scenes with an overlap below 0.7, 0.6, and 0.5.", "description": "This table presents a quantitative comparison of the proposed eFreeSplat method against baseline methods (pixelSplat and MVSplat) on the RealEstate10K dataset. The comparison is performed under three different conditions based on the amount of overlap between the reference images.  The overlap is categorized into three subsets: below 0.7, 0.6, and 0.5. The table reports PSNR, SSIM, and LPIPS scores for each method and overlap level, demonstrating the performance of each method under varying degrees of image overlap.", "section": "4 Experiments"}, {"figure_path": "iO6tcLJEwA/tables/tables_8_1.jpg", "caption": "Table 3. Ablations. All ablation experiments were conducted by training and evaluating on the RealEstate10K dataset [72]. Each ablation model was derived from our full model by removing the corresponding modules.", "description": "This table presents the results of ablation studies conducted on the eFreeSplat model using the RealEstate10K dataset.  It shows the impact of removing key components of the model, such as the cross-view mutual perception, Gaussian alignment, and pre-training weights, on the model's performance, as measured by PSNR, SSIM, and LPIPS.", "section": "4.3 Ablation Studies"}, {"figure_path": "iO6tcLJEwA/tables/tables_15_1.jpg", "caption": "Table 4. Quantitative results of gaussians alignment module under the settings of 1 to 3. \"Memory\" refers to GPU memory usage, and \"Time\" indicates the inference time.", "description": "This table presents a quantitative analysis of the Iterative Cross-view Gaussians Alignment module's performance at different iteration counts (1, 2, and 3).  The metrics evaluated include Peak Signal-to-Noise Ratio (PSNR), Structural Similarity Index (SSIM), Learned Perceptual Image Patch Similarity (LPIPS), GPU memory usage (Memory), and inference time (Time).  Higher PSNR and SSIM values, and lower LPIPS values indicate better image quality.  The results show that increasing the number of iterations generally improves image quality, although diminishing returns are observed beyond 2 iterations.", "section": "4.3 Ablation Studies"}, {"figure_path": "iO6tcLJEwA/tables/tables_16_1.jpg", "caption": "Table 3. Ablations. All ablation experiments were conducted by training and evaluating on the RealEstate10K dataset [72]. Each ablation model was derived from our full model by removing the corresponding modules.", "description": "This table presents the ablation study results conducted on the RealEstate10K dataset.  It shows the performance (PSNR, SSIM, LPIPS) of the full eFreeSplat model and three ablation models. The ablation models progressively remove key components of the model: the cross-view mutual perception module, the Gaussian alignment module, and the pretrained weights.  The results demonstrate the contribution of each component to the overall performance.", "section": "4.3 Ablation Studies"}]