[{"figure_path": "xCIbVuXwPM/figures/figures_4_1.jpg", "caption": "Figure 1: (Left) Mode level sets of ∆y where y = {a, b, c, d} embedded into a two dimensional unit cube. The center red point denotes the origin (0,0) which is the hallucination region. (Right) An embedding of ∆y where Y = {a, b, c, d, e, f } into a three-dimensional permutahedron: the beige region expresses strict calibration regions, the light pink regions expresses regions with inconsistency, and the auburn region expresses regions with hallucinations.", "description": "This figure illustrates the concept of hallucination regions in low-dimensional embeddings for multiclass classification.  The left panel shows a 2D embedding of four classes (a, b, c, d) into a unit cube, highlighting the central hallucination region where the model could predict a class that has zero probability under the true distribution. The right panel extends this concept to a 3D embedding of six classes (a, b, c, d, e, f) using a permutahedron, illustrating regions of strict calibration, inconsistency, and hallucinations.", "section": "Polytope Embedding and Existence of Calibrated Regions"}, {"figure_path": "xCIbVuXwPM/figures/figures_7_1.jpg", "caption": "Figure 1: (Left) Mode level sets of ∆y where y = {a, b, c, d} embedded into a two dimensional unit cube. The center red point denotes the origin (0,0) which is the hallucination region. (Right) An embedding of ∆y where Y = {a, b, c, d, e, f } into a three-dimensional permutahedron: the beige region expresses strict calibration regions, the light pink regions expresses regions with inconsistency, and the auburn region expresses regions with hallucinations.", "description": "The figure shows two examples of polytope embeddings of probability distributions over outcomes. The left panel shows a 2D embedding of four outcomes into a unit square; the central region represents the hallucination region, where reports minimize surrogate loss even though the true distribution has zero weight on the prediction.  The right panel shows a 3D embedding of six outcomes into a permutahedron, color-coded to illustrate different regions of consistency and inconsistency.", "section": "Polytope Embedding and Existence of Calibrated Regions"}, {"figure_path": "xCIbVuXwPM/figures/figures_8_1.jpg", "caption": "Figure 1: (Left) Mode level sets of ∆y where Y = {a, b, c, d} embedded into a two dimensional unit cube. The center red point denotes the origin (0, 0) which is the hallucination region. (Right) An embedding of ∆y where Y = {a, b, c, d, e, f} into a three-dimensional permutahedron: the beige region expresses strict calibration regions, the light pink regions expresses regions with inconsistency, and the auburn region expresses regions with hallucinations.", "description": "This figure shows two examples of polytope embeddings for multiclass classification. The left panel shows a 2D embedding of four outcomes into a unit cube, highlighting the hallucination region at the origin. The right panel shows a 3D embedding of six outcomes into a permutahedron, illustrating strict calibration regions, inconsistency regions, and hallucination regions.", "section": "Polytope Embedding and Existence of Calibrated Regions"}]