[{"figure_path": "BJ6HkT7qIk/figures/figures_4_1.jpg", "caption": "Figure 1: Example SC-CP output with small Cn (n = 200).", "description": "This figure shows an example of the Self-Calibrating Conformal Prediction (SC-CP) method's output with a small calibration dataset (n=200). It illustrates the relationship between the original (uncalibrated) predictions, the calibrated predictions obtained using Venn-Abers calibration, the Venn-Abers multi-prediction (a set of calibrated predictions), and the resulting prediction interval. The plot visually demonstrates how SC-CP produces calibrated point predictions alongside prediction intervals that adapt to the model's predictions, effectively quantifying uncertainty conditional on the calibrated point predictions.", "section": "3 Self-Calibrating Conformal Prediction"}, {"figure_path": "BJ6HkT7qIk/figures/figures_9_1.jpg", "caption": "Figure 2: MEPS-21 dataset: Calibration plot for SC-CP, prediction bands for SC-CP and baselines, and empirical coverage, width, and calibration error within sensitive subgroup.", "description": "This figure shows the results of applying Self-Calibrating Conformal Prediction (SC-CP) and several baseline methods to the MEPS-21 dataset. The left plots are calibration plots for SC-CP in Setting A (poorly calibrated model) and Setting B (well-calibrated model), showing the relationship between original and calibrated predictions, as well as the prediction intervals. The right plots display prediction bands from SC-CP and baselines, illustrating the relationship between original predictions and interval widths. The table below summarizes the performance of different methods in terms of coverage, average width, and calibration error, showing SC-CP's superior performance.", "section": "5 Real-Data Experiments: predicting utilization of medical services"}, {"figure_path": "BJ6HkT7qIk/figures/figures_14_1.jpg", "caption": "Figure 2: MEPS-21 dataset: Calibration plot for SC-CP, prediction bands for SC-CP and baselines, and empirical coverage, width, and calibration error within sensitive subgroup.", "description": "This figure presents the results of the MEPS-21 dataset experiment, comparing SC-CP with various baseline methods.  The left side shows calibration plots for SC-CP in Settings A and B (poorly and well-calibrated models respectively). The right side shows prediction bands for SC-CP and baselines (Marginal CP, Mondrian CP, CQR, Kernel) and the tables below summarize the performance metrics including empirical coverage, average prediction interval width and calibration error within the sensitive attribute (race). This illustrates the performance of SC-CP in providing self-calibrated point predictions and associated prediction intervals.", "section": "5 Real-Data Experiments: predicting utilization of medical services"}, {"figure_path": "BJ6HkT7qIk/figures/figures_14_2.jpg", "caption": "Figure 2: MEPS-21 dataset: Calibration plot for SC-CP, prediction bands for SC-CP and baselines, and empirical coverage, width, and calibration error within sensitive subgroup.", "description": "This figure presents the results of experiments on the MEPS-21 dataset. The left plots show the calibration plot for Self-Calibrating Conformal Prediction (SC-CP), comparing the original predictions, calibrated predictions, Venn-Abers multi-predictions, and prediction intervals. The right plots display the prediction bands for SC-CP and several baseline methods (Marginal CP, CQR, Mondrian CP, and Kernel-smoothed CP). These plots are shown as functions of the original predictions and are separated into two settings based on the calibration of the initial model.  The tables below summarize the empirical coverage, average width, and calibration error for each method, further broken down by sensitive subgroups (A=0 and A=1).", "section": "5 Real-Data Experiments: predicting utilization of medical services"}, {"figure_path": "BJ6HkT7qIk/figures/figures_15_1.jpg", "caption": "Figure 2: MEPS-21 dataset: Calibration plot for SC-CP, prediction bands for SC-CP and baselines, and empirical coverage, width, and calibration error within sensitive subgroup.", "description": "The figure presents a comparison of the proposed Self-Calibrating Conformal Prediction (SC-CP) method and several baseline methods in terms of calibration, prediction interval width, and empirical coverage for the MEPS-21 dataset. The calibration plots show the relationship between original model predictions and observed outcomes, illustrating the effect of SC-CP's calibration step. The prediction bands, displayed against the original model predictions, show how SC-CP and the baselines adapt to the outcome variability across different prediction contexts. The tables summarize the empirical coverage and average interval widths for each method, highlighting SC-CP's improved efficiency and self-calibration properties. ", "section": "5 Real-Data Experiments: predicting utilization of medical services"}, {"figure_path": "BJ6HkT7qIk/figures/figures_15_2.jpg", "caption": "Figure 2: MEPS-21 dataset: Calibration plot for SC-CP, prediction bands for SC-CP and baselines, and empirical coverage, width, and calibration error within sensitive subgroup.", "description": "This figure shows the performance of Self-Calibrating Conformal Prediction (SC-CP) and several baseline methods on the MEPS-21 dataset.  The left side of each panel displays a calibration plot for SC-CP, showing the relationship between original and calibrated predictions, alongside prediction intervals. The right side shows prediction bands for SC-CP and baselines as a function of original predictions. The tables below summarize the empirical coverage, average interval width, and calibration error (bias) within sensitive subgroups (A=0 and A=1). The figure is divided into two parts, (a) and (b), representing two different settings of the initial model training. In Setting A, the initial model is trained on the untransformed outcomes, whereas in Setting B, the initial model is trained on the transformed outcomes, resulting in a difference in the model calibration.", "section": "5.2 Results and discussion"}, {"figure_path": "BJ6HkT7qIk/figures/figures_15_3.jpg", "caption": "Figure 2: MEPS-21 dataset: Calibration plot for SC-CP, prediction bands for SC-CP and baselines, and empirical coverage, width, and calibration error within sensitive subgroup.", "description": "This figure presents results from applying the Self-Calibrating Conformal Prediction (SC-CP) method and several baseline methods (Marginal CP, Mondrian CP, CQR, and Kernel) to the MEPS-21 dataset for predicting medical service utilization.  The leftmost plot is a calibration plot for SC-CP, showing the relationship between original predictions, calibrated predictions, and prediction intervals. The other plots display prediction bands for all methods against original (uncalibrated) predictions. Each plot is accompanied by a table showing empirical coverage, average interval width, and calibration error for each method within subgroups defined by a sensitive attribute (race). This visualization helps compare the performance of SC-CP to the baselines in terms of accuracy, calibration, and interval efficiency, particularly regarding their ability to adapt to outcome heteroscedasticity.", "section": "5 Real-Data Experiments: predicting utilization of medical services"}, {"figure_path": "BJ6HkT7qIk/figures/figures_17_1.jpg", "caption": "Figure 8: Figure 8a shows the average interval widths for varying l2-calibration errors in f. Figure 8b shows the relative change in average interval width using Venn-Abers calibrated versus uncalibrated predictions, with varying l²-calibration error in f (left), and calibration set size (right). Below the horizontal lines signifies efficiency gains for SC-CP.", "description": "This figure shows the results of Experiment 1 in Section C.2 of the paper. The left panel (Figure 8a) illustrates the relationship between the average interval width and calibration error. The right panel (Figure 8b) demonstrates the relative efficiency gain achieved by using Venn-Abers calibrated versus uncalibrated scores.", "section": "Supplementary synthetic data experiments"}, {"figure_path": "BJ6HkT7qIk/figures/figures_17_2.jpg", "caption": "Figure 1: Example SC-CP output with small Cn (n = 200).", "description": "This figure shows an example of the Self-Calibrating Conformal Prediction (SC-CP) method's output with a small calibration dataset (n=200). It compares the original (uncalibrated) prediction, the calibrated prediction obtained using Venn-Abers calibration, the Venn-Abers multi-prediction (a set of predictions), and the resulting prediction interval. The plot highlights how SC-CP produces a calibrated prediction while providing a prediction interval that is calibrated conditionally on the point prediction.", "section": "3 Self-Calibrating Conformal Prediction"}, {"figure_path": "BJ6HkT7qIk/figures/figures_17_3.jpg", "caption": "Figure 2: MEPS-21 dataset: Calibration plot for SC-CP, prediction bands for SC-CP and baselines, and empirical coverage, width, and calibration error within sensitive subgroup.", "description": "This figure shows the results of applying Self-Calibrating Conformal Prediction (SC-CP) and several baseline methods to the MEPS-21 dataset.  The left side of each panel presents a calibration plot that visually compares original, calibrated, and Venn-Abers predictions, as well as prediction intervals generated using SC-CP. The right side shows prediction intervals generated by SC-CP and baseline methods plotted against original predictions.  The bottom tables quantify the performance of each method in terms of empirical coverage, average interval width, and calibration error, separately for different sensitive subgroups (A=0 and A=1) and experimental settings (Setting A and Setting B).", "section": "5 Real-Data Experiments: predicting utilization of medical services"}, {"figure_path": "BJ6HkT7qIk/figures/figures_17_4.jpg", "caption": "Figure 2: MEPS-21 dataset: Calibration plot for SC-CP, prediction bands for SC-CP and baselines, and empirical coverage, width, and calibration error within sensitive subgroup.", "description": "This figure presents the results of applying self-calibrating conformal prediction and several baseline methods to the MEPS-21 dataset. The leftmost column displays calibration plots for SC-CP, showcasing the original and calibrated predictions alongside prediction bands. The remaining columns show prediction bands for various methods (SC-CP, Marginal CP, Mondrian CP, CQR, Kernel) as functions of the original model predictions. The table in the figure provides empirical coverage, average interval width, and calibration error (bias) in the prediction for each method, broken down by sensitive attribute group (A=0, A=1).", "section": "5 Real-Data Experiments: predicting utilization of medical services"}, {"figure_path": "BJ6HkT7qIk/figures/figures_18_1.jpg", "caption": "Figure 8: Figure 8a shows the average interval widths for varying l2-calibration errors in f. Figure 8b shows the relative change in average interval width using Venn-Abers calibrated versus uncalibrated predictions, with varying l²-calibration error in f (left), and calibration set size (right). Below the horizontal lines signifies efficiency gains for SC-CP.", "description": "This figure shows the results of Experiment 1 in Section C.2, which evaluates the efficiency of prediction intervals using SC-CP and other methods under varying calibration errors and calibration set sizes.  The left panel (Figure 8a) illustrates how interval width changes with different levels of calibration error, showing that SC-CP generally produces narrower intervals with increasing calibration error. The right panel (Figure 8b) compares the relative efficiency of using calibrated versus uncalibrated prediction intervals, demonstrating that calibration leads to significant efficiency gains, particularly with larger calibration set sizes.", "section": "Supplementary synthetic data experiments"}]