[{"figure_path": "S5coB5kqSD/tables/tables_7_1.jpg", "caption": "Table 1: Performance of VeXKD on nuScenes for 3D object detection and BEV map segmentation tasks. \"L\" and \"C\" denote the LiDAR and the Camera modality, respectively. \"L+C\" denotes multi-modal fusion model. \"L+C → C\", \"L → C\", and \"L+C → L\" represent the knowledge distillation from the teacher model to the respective single-modal student.\"+\" indicates the addition of cross-modal KD methods to the above student models. The FPS results are evaluated on GTX 4090 GPU with batch size of one. \"*\" denotes our re-implementation results. No test-time augmentation is applied during testing.", "description": "This table presents a comparison of the performance of VeXKD against several state-of-the-art methods on the nuScenes dataset for 3D object detection and BEV map segmentation tasks.  It shows various metrics (mAP, NDS, mIoU, FPS, GFLOPS) for different model configurations, including single-modal (LiDAR or Camera only), multi-modal, and models using knowledge distillation with VeXKD. The results illustrate the effectiveness of VeXKD in improving performance and closing the gap between single-modal and multi-modal models.  Note that the FPS (Frames Per Second) numbers are specific to the hardware (GTX 4090 GPU) and batch size used.", "section": "4.2 Comparison with the State-of-the-Arts"}, {"figure_path": "S5coB5kqSD/tables/tables_8_1.jpg", "caption": "Table 2: Ablation study of three proposed algorithm components on nuScenes val. MGFM denotes the Modality-General Fusion Module, L-MFD denotes Low-level Masked Feature Distillation, and H-MFD denotes High-level Masked Feature Distillation. Performance metrics include mAP/NDS for detection and mIoU for the segmentation task.", "description": "This ablation study shows the individual and combined effects of the Modality-General Fusion Module (MGFM), Low-level Masked Feature Distillation (L-MFD), and High-level Masked Feature Distillation (H-MFD) on the performance of LiDAR detection and Camera Segmentation tasks.  The results demonstrate that each component contributes to improved performance, and their combined effect leads to the best overall results.  The numbers in parentheses show the improvement over the baseline (Setting 1).", "section": "4.3 Ablation Studies"}, {"figure_path": "S5coB5kqSD/tables/tables_8_2.jpg", "caption": "Table 3: Ablation study of different mask selection methods in feature distillation on nuScenes val.", "description": "This table presents the results of an ablation study comparing different mask selection methods for feature distillation on the nuScenes validation set.  It compares the performance (mAP and NDS for LiDAR detection, mIoU for LiDAR segmentation) of several methods: no feature distillation, feature distillation on the entire feature map, feature distillation on foreground key points, feature distillation masked by Gaussian, and feature distillation based on activation values. Finally, it contrasts these methods with two versions of mask generation using either randomly initialized or learned queries from the fusion module.", "section": "4.3 Ablation Studies"}, {"figure_path": "S5coB5kqSD/tables/tables_8_3.jpg", "caption": "Table 1: Performance of VeXKD on nuScenes for 3D object detection and BEV map segmentation tasks. \"L\" and \"C\" denote the LiDAR and the Camera modality, respectively. \"L+C\" denotes multi-modal fusion model. \"L+C → C\", \"L → C\", and \"L+C → L\" represent the knowledge distillation from the teacher model to the respective single-modal student. \"+\" indicates the addition of cross-modal KD methods to the above student models. The FPS results are evaluated on GTX 4090 GPU with batch size of one. \"*\" denotes our re-implementation results. No test-time augmentation is applied during testing.", "description": "This table presents a comparison of the performance of VeXKD and several state-of-the-art methods on the nuScenes dataset for 3D object detection and BEV map segmentation.  It shows metrics such as mAP, NDS, and mIoU for different modalities (LiDAR, Camera, and Fusion), highlighting the improvements achieved by VeXKD through cross-modal knowledge distillation.  The table also includes GFLOPS and FPS for different models.", "section": "4.2 Comparison with the State-of-the-Arts"}]