[{"figure_path": "Sj8G020ADl/figures/figures_9_1.jpg", "caption": "Figure 1: Numerical convergence behavior of inexact ALM (15) for Max-Cut and linear SVM. The symbol € denotes the KKT residuals € = max{ε1, ε2, ε3, ε4, ε5}.", "description": "This figure displays the convergence behavior of the inexact Augmented Lagrangian Method (ALM) applied to Max-Cut and linear SVM problems.  Three different instances of each problem are shown. The plots illustrate the convergence of the primal cost value gap, dual cost value gap, and KKT residuals. The symbol  ε represents the maximum of five different KKT residuals, indicating the overall convergence of the algorithm toward optimality. The results demonstrate the linear convergence of the algorithm, as evidenced by the roughly linear decrease in the plotted values on a logarithmic scale.", "section": "Numerical experiments"}, {"figure_path": "Sj8G020ADl/figures/figures_24_1.jpg", "caption": "Figure 2: The quadratric growth property of the exact penalty function f(y) = −by+pmax{0, λmax(A*(y)−C′)} where p = 4 and f* = 0. The optimal solution set S = {(0,0)}. In Figure 2a, the yellow region represents the linear part where only −bTy is active, resulting pmax{0, λmax(A*(y) − C)} = 0, the blue region encompasses both the linear and the nonlinear parts, and the green surf is the square of the distance to the optimal solution set with κ = 0.3. Figure 2b shows the sectional view of f along the direction y1 = y2 = 0, which can be characterized as the rational function f(y1) = y1−1/y1.", "description": "This figure shows that even a simple 2x2 SDP does not have sharp growth.  It illustrates the quadratic growth property of the exact penalty function f(y) = −bTy + p max{0, λmax(A*(y) − C)} with p = 4 and optimal solution at (0,0).  The 3D view shows regions where the linear term dominates (yellow), both linear and non-linear components are active (blue), and the quadratic growth (green) is apparent. The sectional view illustrates the non-linearity of the function.", "section": "D Illustration of quadratic growth"}, {"figure_path": "Sj8G020ADl/figures/figures_24_2.jpg", "caption": "Figure 2: The quadratric growth property of the exact penalty function f(y) = −by+pmax{0, Amax(A*(y)−C')} where p = 4 and f* = 0. The optimal solution set S = {(0,0)}. In Figure 2a, the yellow region represents the linear part where only -by is active, resulting pmax{0, Amax(A*(y) – C)} = 0, the blue region encompasses both the linear and the nonlinear parts, and the green surf is the square of the distance to the optimal solution set with κ = 0.3. Figure 2b shows the sectional view of f along the direction y1 = y2 = 0, which can be characterized as the rational function f(y1) = y1−1/y1.", "description": "This figure shows the quadratic growth property of the exact penalty function  f(y) = −by+pmax{0, Amax(A*(y)−C')}.  The 3D plot shows the function's landscape, highlighting regions where the linear and non-linear components dominate. The 2D plot is a cross-section illustrating the quadratic growth near the optimal solution.", "section": "D.2 Illustration of quadratic growth"}, {"figure_path": "Sj8G020ADl/figures/figures_30_1.jpg", "caption": "Figure 1: Numerical convergence behavior of inexact ALM (15) for Max-Cut and linear SVM. The symbol  denotes the KKT residuals  = max{71, 72, 73, 74, 75}.", "description": "The figure shows the convergence behavior of the inexact ALM (15) for Max-Cut and linear SVM problems.  Three instances are tested for each problem. For each instance and problem, three curves are plotted, showing the convergence of the primal cost value gap (the difference between the current primal cost and the optimal cost), the dual cost value gap (the difference between the current dual cost and the optimal cost), and the KKT residuals (the maximum of several measures indicating the optimality gap). The results demonstrate linear convergence of the ALM for all tested instances, indicating that both primal and dual iterates converge linearly to the optimal solution.", "section": "Numerical experiments"}, {"figure_path": "Sj8G020ADl/figures/figures_31_1.jpg", "caption": "Figure 1: Numerical convergence behavior of inexact ALM (15) for Max-Cut and linear SVM. The symbol  denotes the KKT residuals  = max{71, 72, 73, 74, 75}.", "description": "The figure shows the numerical convergence behavior of the inexact ALM (15) for Max-Cut and linear SVM problems.  It displays the primal cost value gap, dual cost value gap, and KKT residuals over iterations for three different instances of each problem (Max-Cut 1-3, SVM 1-3). The KKT residuals are represented by epsilon3, which is the maximum of five different residuals (71-75).  The plots illustrate the linear convergence of both primal and dual iterates towards optimality, as indicated by the decreasing gaps and residuals over the iterations.", "section": "Numerical experiments"}, {"figure_path": "Sj8G020ADl/figures/figures_31_2.jpg", "caption": "Figure 1: Numerical convergence behavior of inexact ALM (15) for Max-Cut and linear SVM. The symbol €3 denotes the KKT residuals €3 = max{71, 72, 73, 74, 75}.", "description": "This figure displays the convergence behavior of the inexact ALM (15) algorithm applied to Max-Cut and linear SVM problems.  It shows the convergence of the primal cost value gap, the dual cost value gap, and the KKT residuals for three different instances of each problem. The plots illustrate the algorithm's linear convergence, as indicated by the decreasing error over iterations.  The KKT residuals (€3) represent the maximum of five error metrics measuring the closeness to optimality.  The consistent decrease across the metrics suggests the efficiency of the inexact ALM approach in solving both Max-Cut and linear SVM problems.", "section": "Numerical experiments"}]