[{"figure_path": "Jz7Z7KkR94/tables/tables_7_1.jpg", "caption": "Table 1: REDUCR outperforms RHO-LOSS (the best overall baseline) in terms of the worst-class test accuracy on Clothing1M, CINIC10 and CIFAR10 by at least 5-26%. Across all baselines, REDUCR gains about 15% more accuracy on the noisy and imbalanced Clothing1M dataset as shown in Figure 2. *CIFAR100 results from training step 10k where REDUCR converges, after 10k further training steps TRAIN LOSS achieves a similar performance.", "description": "This table presents the worst-class test accuracy results for six different datasets (CIFAR10, CINIC10, CIFAR100, Clothing1M, MNLI, and QQP) using four different methods: UNIFORM, TRAIN LOSS, RHO-LOSS, and REDUCR.  The results show that REDUCR consistently outperforms the other methods, particularly on the more challenging datasets like Clothing1M, achieving significantly higher worst-class accuracy. The improved performance is especially noticeable on noisy and imbalanced datasets. Note that the CIFAR100 result is a snapshot at training step 10k.", "section": "5.1 Key results"}, {"figure_path": "Jz7Z7KkR94/tables/tables_7_2.jpg", "caption": "Table 2: Together with Table 1, these results demonstrate that REDUCR improves the worst-class test accuracy while maintaining strong average test accuracy despite REDUCR not explicitly optimizing average test accuracy. REDUCR outperforms the baseline methods on the CIFAR100 and Clothing1M datasets.", "description": "This table shows the average test accuracy for different datasets using various methods including UNIFORM, TRAIN LOSS, RHO-LOSS and REDUCR.  The results demonstrate that REDUCR consistently performs well in terms of average accuracy while significantly improving worst-class accuracy, which was its primary optimization target.", "section": "5.1 Key results"}, {"figure_path": "Jz7Z7KkR94/tables/tables_13_1.jpg", "caption": "Table 1: REDUCR outperforms RHO-LOSS (the best overall baseline) in terms of the worst-class test accuracy on Clothing1M, CINIC10 and CIFAR10 by at least 5-26%. Across all baselines, REDUCR gains about 15% more accuracy on the noisy and imbalanced Clothing1M dataset as shown in Figure 2. *CIFAR100 results from training step 10k where REDUCR converges, after 10k further training steps TRAIN LOSS achieves a similar performance.", "description": "This table presents the worst-class test accuracy results for four different datasets (CIFAR10, CINIC10, CIFAR100, Clothing1M) and three baselines (UNIFORM, TRAIN LOSS, RHO-LOSS) in comparison to REDUCR.  It highlights REDUCR's superior performance, particularly on the noisy and imbalanced Clothing1M dataset.", "section": "5.1 Key results"}, {"figure_path": "Jz7Z7KkR94/tables/tables_16_1.jpg", "caption": "Table 1: REDUCR outperforms RHO-LOSS (the best overall baseline) in terms of the worst-class test accuracy on Clothing1M, CINIC10 and CIFAR10 by at least 5–26%. Across all baselines, REDUCR gains about 15% more accuracy on the noisy and imbalanced Clothing1M dataset as shown in Figure 2. *CIFAR100 results from training step 10k where REDUCR converges, after 10k further training steps TRAIN LOSS achieves a similar performance.", "description": "This table presents the worst-class test accuracy achieved by different data downsampling methods on various datasets.  REDUCR consistently outperforms other methods, especially on the Clothing1M dataset, which is known for its noise and class imbalance. The results highlight REDUCR's robustness and efficiency in preserving worst-class generalization performance.", "section": "5.1 Key results"}, {"figure_path": "Jz7Z7KkR94/tables/tables_16_2.jpg", "caption": "Table 2: Together with Table 1, these results demonstrate that REDUCR improves the worst-class test accuracy while maintaining strong average test accuracy despite REDUCR not explicitly optimizing average test accuracy. REDUCR outperforms the baseline methods on the CIFAR100 and Clothing1M datasets.", "description": "This table presents the average test accuracy for several datasets using different methods: UNIFORM, TRAIN LOSS, RHO-LOSS, and REDUCR.  It complements Table 1 by showing that REDUCR's improvement in worst-class accuracy doesn't come at the expense of overall average accuracy.  In fact, REDUCR often matches or even surpasses the best average accuracy among the baselines.", "section": "5.1 Key results"}]