[{"figure_path": "0KseSacluJ/tables/tables_4_1.jpg", "caption": "Table 1: Shape errors on novel instances of the ShapeNet training categories. We report chamfer distance (10<sup>-4</sup>) and highlight the best.", "description": "This table presents the quantitative results of the proposed CoFie method and compares it with other baseline methods. It shows the chamfer distance (a common metric for evaluating the accuracy of 3D shape reconstruction), which measures the average distance between the predicted shape and the ground truth shape. The results are reported for novel instances from the ShapeNet training categories, demonstrating how well the methods generalize to unseen data within the same categories. The best results for each category are highlighted, providing a direct comparison of CoFie's performance against the baseline methods.", "section": "5.1 Experimental Results"}, {"figure_path": "0KseSacluJ/tables/tables_7_1.jpg", "caption": "Table 1: Shape errors on novel instances of the ShapeNet training categories. We report chamfer distance (10<sup>-4</sup>) and highlight the best.", "description": "This table presents the quantitative results of the proposed CoFie method and three baseline methods (3DS2VS, DeepSDF, and DeepLS) on novel instances of seen shape categories from the ShapeNet dataset. The evaluation metric used is Chamfer distance, which measures the average distance between the reconstructed surface and the ground truth surface. The results are reported in units of 10<sup>-4</sup>, and the best performing method for each shape category is highlighted. The table shows that CoFie significantly outperforms other methods for all categories, achieving the lowest average Chamfer distance of 2.05.", "section": "5.1 Experimental Results"}, {"figure_path": "0KseSacluJ/tables/tables_8_1.jpg", "caption": "Table 2: Shape errors on instances of the ShapeNet novel categories. We evaluate the chamfer distance (10<sup>-4</sup>).", "description": "This table presents the Chamfer distance (a measure of shape similarity) for different shape reconstruction methods on unseen ShapeNet categories. Lower Chamfer distance indicates better reconstruction accuracy. The results are shown for 3DS2VS, DeepSDF, DeepLS and CoFie methods across ten different shape categories.  This table demonstrates the generalization ability of the methods to unseen categories.", "section": "5.1 Experimental Results"}, {"figure_path": "0KseSacluJ/tables/tables_8_2.jpg", "caption": "Table 3: Results on Thingi meshes. We evaluate the chamfer distance (10<sup>-4</sup>) with a marching cube resolution of 256. Note that NGLOD is trained on each test shape, while CoFie uses a shared MLP for all shapes as a generalizable method.", "description": "This table presents the quantitative results of the CoFie model and baselines on the Thingi dataset.  It shows the Chamfer distance (a measure of shape reconstruction error) achieved by different methods on unseen real-world shapes. Notably, it compares CoFie's performance to a per-shape method (NGLOD), which is specifically trained for each shape in the test set, highlighting CoFie's ability to generalize across different shapes using a single shared MLP.", "section": "5.1 Experimental Results"}, {"figure_path": "0KseSacluJ/tables/tables_8_3.jpg", "caption": "Table 4: Ablation study of (0) Base performance; (1) coordinate field and its initialization methods; (2) using quadratic MLP; (3) full performance. We use resolution 128 to get reconstructed meshes.", "description": "This ablation study demonstrates the impact of different components of CoFie on the shape reconstruction performance. It compares the base model with and without Coordinate Fields, geometric initialization for the Coordinate Fields, and the use of quadratic layers in the MLP. The table shows the chamfer distance error for each configuration.", "section": "5.2 Ablation Study"}, {"figure_path": "0KseSacluJ/tables/tables_16_1.jpg", "caption": "Table 5: Performance on ShapeNet 10 novel categories. Specifically, the reported 3DS2VS [51] and NKSR [15] are trained on the full set of the training categories. In contrast, the reported numbers in the main paper use a subset of 1000 instances for training.", "description": "This table presents the performance comparison of CoFie against other methods on 10 unseen ShapeNet categories.  It shows the Chamfer Distance (CD) and Intersection over Union (gIoU) scores. Note that 3DS2VS and NKSR were trained on the full ShapeNet dataset unlike CoFie, which used a subset of 1000 instances, making the comparison not entirely fair.", "section": "5.1 Experimental Results"}, {"figure_path": "0KseSacluJ/tables/tables_16_2.jpg", "caption": "Table 6: Performance on Thingi shapes. Note that SSAD methods take a long time for inference, e.g. NGLOD and UODFs take 105 and 300 minutes, respectively. In contrast, CoFie takes 10 minutes.", "description": "This table compares the performance of CoFie with other methods (DeepSDF, DeepLS, NGLOD, and UODFs) on the Thingi dataset.  It shows Chamfer Distance (CD) and Intersection over Union (gIoU) metrics.  The key takeaway is that CoFie achieves comparable performance to per-shape methods (SSAD), which are significantly more computationally expensive, while being significantly faster than generalizable methods (GAD).", "section": "5.1 Experimental Results"}]