[{"figure_path": "KvAaIJhqhI/figures/figures_3_1.jpg", "caption": "Figure 1: Overview of the proposed SAUE approach. First, the style information of the blended-target domain is utilized to augment the source features through the similarity factors. Second, we calculate the uncertainty of the model and optimize prediction uncertainty via the Dirichlet distribution. Finally, the adversarial learning strategy without discriminator effectively guides the SAUE process to adapt the blended-target domain without the requirement of domain labels of sub-target domains.", "description": "This figure shows the architecture of the Style Adaptation and Uncertainty Estimation (SAUE) method for Multi-Source Blended-Target Domain Adaptation (MBDA).  The figure is broken down into three main components: the feature extractor with style adaptation, the classifier and uncertainty estimation, and the adversarial learning component. The feature extractor takes multiple source domains and a blended target domain as input. The style information from the target domain is used to augment the source features via similarity factors calculated using Wasserstein distance. The classifier then estimates the uncertainty in category predictions using a Dirichlet distribution, and an adversarial learning strategy is employed to align the domains without requiring target domain labels. The objective is to improve domain adaptation performance in the presence of multiple sources and blended-target domains with uncertain feature distributions.", "section": "3 Method"}, {"figure_path": "KvAaIJhqhI/figures/figures_8_1.jpg", "caption": "Figure 2: The analysis of the SAUE parameters.", "description": "This figure visualizes the impact of the hyperparameters λd and λe on the model's accuracy for two different tasks (b+i→c and b+i→p) in the SAUE method. The x-axis represents λd, the y-axis represents λe, and the z-axis represents the accuracy.  The 3D surface plots and contour plots show how accuracy changes with different combinations of λd and λe.  It allows for a visual assessment of the model's sensitivity to these parameters and helps identify optimal settings for improved performance.", "section": "4.3 Experiment Analysis"}, {"figure_path": "KvAaIJhqhI/figures/figures_16_1.jpg", "caption": "Figure 1: Overview of the proposed SAUE approach. First, the style information of the blended-target domain is utilized to augment the source features through the similarity factors. Second, we calculate the uncertainty of the model and optimize prediction uncertainty via the Dirichlet distribution. Finally, the adversarial learning strategy without discriminator effectively guides the SAUE process to adapt the blended-target domain without the requirement of domain labels of sub-target domains.", "description": "This figure illustrates the architecture of the Style Adaptation and Uncertainty Estimation (SAUE) method for Multi-Source Blended-Target Domain Adaptation (MBDA). It shows how style information from the blended-target domain is used to augment source features, uncertainty is estimated and mitigated, and adversarial learning is used to align domains without requiring target domain labels.", "section": "3 Method"}, {"figure_path": "KvAaIJhqhI/figures/figures_16_2.jpg", "caption": "Figure 1: Overview of the proposed SAUE approach. First, the style information of the blended-target domain is utilized to augment the source features through the similarity factors. Second, we calculate the uncertainty of the model and optimize prediction uncertainty via the Dirichlet distribution. Finally, the adversarial learning strategy without discriminator effectively guides the SAUE process to adapt the blended-target domain without the requirement of domain labels of sub-target domains.", "description": "This figure illustrates the architecture of the Style Adaptation and Uncertainty Estimation (SAUE) method for Multi-Source Blended-Target Domain Adaptation (MBDA). It shows how style information from the blended-target domain is used to augment source features using similarity factors.  It also depicts the uncertainty estimation and elimination process via a Dirichlet distribution and an adversarial learning strategy that doesn't require target domain labels.", "section": "3 Method"}, {"figure_path": "KvAaIJhqhI/figures/figures_16_3.jpg", "caption": "Figure 3: Loss functions with the increasing of iterations.", "description": "This figure shows the change of the three loss functions (class_loss, d_loss, and total_loss) during the training process. The class_loss represents the classification loss of the model; the d_loss represents the adversarial loss of the model; the total_loss represents the sum of these two losses.  The plot shows that all three loss functions decrease as the number of iterations increases, indicating that the model is learning and converging.", "section": "4.3 Experiment Analysis"}]