[{"figure_path": "voJCpdlw53/figures/figures_0_1.jpg", "caption": "Figure 1: The proposed UltraPixel creates highly photo-realistic and detail-rich images at various resolutions. Best viewed zoomed in. All image prompts in this paper are listed in the appendix.", "description": "This figure shows several example images generated by the UltraPixel model at different resolutions, ranging from 1536x2560 to 5120x5120 pixels.  The images showcase the model's ability to generate highly realistic and detailed images across a variety of subjects, including landscapes, portraits, and animals. The detail and photorealism in the images highlight the model's capability for ultra-high resolution image generation.", "section": "Introduction"}, {"figure_path": "voJCpdlw53/figures/figures_2_1.jpg", "caption": "Figure 2: Illustration of feature distribution disparity across varying resolutions.", "description": "This figure compares the feature distribution across various resolutions for Stable Cascade and the proposed UltraPixel model using t-SNE visualization.  Stable Cascade shows scattered clusters, indicating significant distribution disparity across resolutions. In contrast, UltraPixel demonstrates a more continuous distribution, suggesting better consistency and adaptability across different resolutions. This improved feature distribution highlights UltraPixel's ability to generate high-quality images at various resolutions efficiently.", "section": "2 Related Work"}, {"figure_path": "voJCpdlw53/figures/figures_3_1.jpg", "caption": "Figure 3: Method Overview. Initially, we extract guidance from the low-resolution (LR) image synthesis process and upscale it by learning an implicit neural representation. This upscaled guidance is then integrated into the high-resolution (HR) generation branch. The generated HR latent undergoes a cascade decoding process, ultimately producing a high-resolution image.", "description": "This figure illustrates the overall process of UltraPixel image generation. It starts by extracting guidance from a low-resolution image generated in earlier stages. This guidance is then upscaled using an implicit neural representation and integrated into the high-resolution generation branch to guide the creation of a high-resolution image. The process involves cascade decoding of the high-resolution latent representation, ultimately resulting in a photorealistic and detail-rich image.", "section": "3 Method"}, {"figure_path": "voJCpdlw53/figures/figures_3_2.jpg", "caption": "Figure 4: Illustration of continuous upscaling by implicit neural representation.", "description": "This figure illustrates the continuous upscaling method used in UltraPixel.  Low-resolution guidance tokens are first processed through a linear layer, then concatenated with learnable tokens and passed through a self-attention layer. The resulting tokens are processed through another set of linear layers. By inputting the target position (x, y) coordinates, the implicit neural representation (INR) generates upscaled guidance features that match the resolution of high-resolution features. This process allows the model to use low-resolution image information effectively at various resolutions during high-resolution image synthesis.", "section": "3.1 Low-Resolution Guidance Generation"}, {"figure_path": "voJCpdlw53/figures/figures_4_1.jpg", "caption": "Figure 5: Architecture details of generative diffusion model.", "description": "This figure details the architecture of the generative diffusion model used in UltraPixel. It shows the different components of the model, including the guidance fusion module, the scale-aware normalization layer, and the time embedding. The figure also shows how the different components of the model are connected together, and how the model processes the input image to generate a high-resolution image.  The model uses a cascade decoding process, which means that it generates the image in multiple stages. In each stage, it uses the output of the previous stage as input to generate the next stage, which allows it to generate more realistic and detailed images. The model also uses a continuous upscaling process, which allows it to generate images at any resolution.", "section": "3.2 High-Resolution Latent Generation"}, {"figure_path": "voJCpdlw53/figures/figures_5_1.jpg", "caption": "Figure 6: Win rate of our UltraPixel against competing methods in terms of PickScore [25].", "description": "This figure presents a bar chart comparing the performance of UltraPixel against other state-of-the-art methods for generating high-resolution images at various resolutions (1024x1792, 2048x2048, 2160x3840, 4096x2048, and 4096x4096).  The win rate is calculated using PickScore [25], a metric that measures the alignment of generated images with human preferences.  UltraPixel consistently demonstrates higher win rates across all resolutions compared to the other methods, suggesting superior image quality and a greater ability to align with human aesthetic preferences.", "section": "4.2 Comparison to State-of-the-Art Methods"}, {"figure_path": "voJCpdlw53/figures/figures_7_1.jpg", "caption": "Figure 7: Visual Comparison of our UltraPixel and other methods. Our method produces images of ultra-high resolution with enhanced details and superior structures. More visual examples are provided in the appendix.", "description": "This figure presents a visual comparison of image generation results between UltraPixel and other state-of-the-art methods across various resolutions.  The comparison highlights UltraPixel's superior ability to produce high-resolution images with enhanced detail and superior structural integrity, showcasing its advantage over existing methods that may suffer from artifacts or lack of fine detail.", "section": "4.2 Comparison to State-of-the-Art Methods"}, {"figure_path": "voJCpdlw53/figures/figures_8_1.jpg", "caption": "Figure 8: Ablation study on LR guidance. Leveraging the semantic guidance from LR features allows the HR generation process to focus on detail refinement, improving visual quality. Text prompt: In the forest, a British shorthair cute cat wearing a yellow sweater with “Accepted", "description": "This figure demonstrates the effectiveness of low-resolution (LR) guidance in improving the quality of high-resolution (HR) image generation. It shows a comparison between generating HR images with and without LR guidance. The results show that using LR guidance leads to clearer structures, fine-grained details, and higher image quality.", "section": "3.1 Low-Resolution Guidance Generation"}, {"figure_path": "voJCpdlw53/figures/figures_8_2.jpg", "caption": "Figure B.2: Visual comparison with BSRGAN [51] at 4096 × 4096 resolution.", "description": "This figure compares the image generation results of the proposed UltraPixel method with those of the BSRGAN super-resolution method at a resolution of 4096 × 4096 pixels.  Two example image pairs are shown: one of a puppy and another of an anime character.  The comparison highlights UltraPixel's ability to generate images with superior detail and clarity, compared to simply upscaling a lower-resolution image with BSRGAN.", "section": "B Additional Comparison Results"}, {"figure_path": "voJCpdlw53/figures/figures_9_1.jpg", "caption": "Figure 10: Visual comparisons of guidance across different timesteps. \"LR\" depicts the low-resolution generation process, whereas the other “HR” cases illustrate the high-resolution process under varying guidance. When employing synchronized (t = tH) or middle timestep (t = 0.5) guidance, the structure information provided is messy, while t = 0.05 offers semantics-rich and clear directives.", "description": "This figure compares the results of high-resolution image generation with different guidance strategies. The left side shows the results when using low-resolution (LR) guidance at different time steps (t=tH, t=0.5, t=0.05) during the high-resolution (HR) generation process. The right side is the same as the left side, but with different prompts. By comparing the images, it shows that using low-resolution guidance at the time step t=0.05, semantic information is clearer. ", "section": "3.1 Low-Resolution Guidance Generation"}, {"figure_path": "voJCpdlw53/figures/figures_9_2.jpg", "caption": "Figure 11: Illustration of Implicit neural representation (INR) to provide consistent guidance.", "description": "This figure demonstrates the effectiveness of the implicit neural representation (INR) method used to continuously upscale the low-resolution guidance features to match the resolution of the high-resolution features.  The top row shows the results without INR, where artifacts are more prominent at higher resolutions. The bottom row displays results with INR; more consistent detail is maintained across varying resolutions, showcasing the benefit of INR in generating higher-quality images.", "section": "3.2 High-Resolution Latent Generation"}, {"figure_path": "voJCpdlw53/figures/figures_13_1.jpg", "caption": "Figure A.1: Visual comparison of reconstruction quality between VAEs of StableCascade [36] and SDXL [37] on high-resolution images.", "description": "This figure compares the reconstruction quality of StableCascade and SDXL on high-resolution images using their respective VAEs.  It visually demonstrates how well each model reconstructs images after compression and decompression through the latent space. The comparison highlights the trade-off between compression ratio and reconstruction fidelity, showing StableCascade achieves higher compression but lower reconstruction quality compared to SDXL.", "section": "A Latent Space of StableCascade"}, {"figure_path": "voJCpdlw53/figures/figures_14_1.jpg", "caption": "Figure B.2: Visual comparison with BSRGAN [51] at 4096 × 4096 resolution.", "description": "This figure compares the results of three methods in generating high-resolution images from a low-resolution input. The first column shows the low-resolution image. The second column shows the result after upsampling using the BSRGAN method. The third column shows the result obtained by the UltraPixel method proposed in the paper. Two example image pairs are shown: a log cabin scene and a close-up of a child's face.  The comparison highlights that the UltraPixel method is better at preserving and adding details compared to the BSRGAN method, which tends to produce somewhat blurry and less-detailed output.", "section": "B Additional Comparison Results"}, {"figure_path": "voJCpdlw53/figures/figures_14_2.jpg", "caption": "Figure B.3: Visual comparison with generative diffusion-based super-resolution method StableSR [47] and SUPIR [50] at 4096 × 4096 resolution.", "description": "This figure compares the results of the proposed UltraPixel method with two other generative diffusion-based super-resolution methods, StableSR and SUPIR, at a resolution of 4096x4096 pixels.  The comparison demonstrates the superior detail and visual quality of UltraPixel compared to the other two methods, highlighting its ability to generate high-resolution images with enhanced detail and superior structures. The images illustrate that while the other methods increase resolution, they fail to add sufficient details, unlike UltraPixel which maintains a high level of detail and overall visual appeal.", "section": "B Additional Comparison Results"}, {"figure_path": "voJCpdlw53/figures/figures_15_1.jpg", "caption": "Figure 7: Visual Comparison of our UltraPixel and other methods. Our method produces images of ultra-high resolution with enhanced details and superior structures. More visual examples are provided in the appendix.", "description": "This figure compares the image generation results of UltraPixel against other methods (ScaleCrafter, DemoFusion, FouriScale, Pixart-sigma) across different resolutions (2048x2048, 2160x3840, 4096x4096). It highlights the superior quality of images generated by UltraPixel, particularly in terms of detail richness and overall structure.", "section": "Comparison to State-of-the-Art Methods"}, {"figure_path": "voJCpdlw53/figures/figures_16_1.jpg", "caption": "Figure B.5: Visual comparison with Dall-E 3 [34] at 1024 × 1792 resolution.", "description": "This figure compares the image generation results of UltraPixel with those from DALL-E 3, a leading commercial text-to-image model. The comparison is shown across various scenes, including landscapes, portraits, and wildlife. It highlights UltraPixel's ability to generate high-quality and detailed images that are on par with the quality achieved by DALL-E 3.", "section": "B Additional Comparison Results"}, {"figure_path": "voJCpdlw53/figures/figures_17_1.jpg", "caption": "Figure B.6: Visual comparison with Midjourney V6 [32] at 2048 × 2048 resolution.", "description": "This figure visually compares the image generation results of the proposed UltraPixel model with those of Midjourney V6, a leading commercial text-to-image generation model. The comparison focuses on images rendered at a resolution of 2048 x 2048 pixels. Three sets of paired images are presented, showcasing different subject matters: a person on skis in a snowy mountain landscape, a koala bear clinging to a tree, and a log cabin in a winter forest. The comparison aims to demonstrate the quality and detail achieved by the UltraPixel model relative to Midjourney V6.", "section": "B Additional Comparison Results"}, {"figure_path": "voJCpdlw53/figures/figures_18_1.jpg", "caption": "Figure 1: The proposed UltraPixel creates highly photo-realistic and detail-rich images at various resolutions. Best viewed zoomed in. All image prompts in this paper are listed in the appendix.", "description": "This figure showcases the image generation capabilities of the UltraPixel model. It displays a variety of images generated at different resolutions, highlighting the model's ability to produce highly photorealistic and detailed results across a range of image sizes.", "section": "Introduction"}, {"figure_path": "voJCpdlw53/figures/figures_19_1.jpg", "caption": "Figure 1: The proposed UltraPixel creates highly photo-realistic and detail-rich images at various resolutions. Best viewed zoomed in. All image prompts in this paper are listed in the appendix.", "description": "This figure showcases the results of the UltraPixel model, demonstrating its ability to generate high-quality images at various resolutions, ranging from 1536x2560 to 5120x5120 pixels. The images depict a variety of subjects and styles, showcasing the model's versatility and ability to capture fine details. The figure highlights the model's ability to generate high-resolution images that are both photorealistic and detail-rich, exceeding the capabilities of many existing methods.", "section": "1 Introduction"}, {"figure_path": "voJCpdlw53/figures/figures_20_1.jpg", "caption": "Figure 1: The proposed UltraPixel creates highly photo-realistic and detail-rich images at various resolutions. Best viewed zoomed in. All image prompts in this paper are listed in the appendix.", "description": "This figure shows several example images generated by the UltraPixel model at different resolutions, ranging from 1536x2560 to 5120x5120 pixels.  The images demonstrate the model's ability to generate high-quality, detailed images across a range of resolutions and aspect ratios.  The images depict various subjects, including a peony flower, a woman's portrait, a landscape scene, and two rabbits.  The variety of subjects shows the model's versatility.", "section": "Introduction"}, {"figure_path": "voJCpdlw53/figures/figures_22_1.jpg", "caption": "Figure 1: The proposed UltraPixel creates highly photo-realistic and detail-rich images at various resolutions. Best viewed zoomed in. All image prompts in this paper are listed in the appendix.", "description": "This figure showcases the image generation capabilities of the UltraPixel model. It presents various example images generated at different resolutions (3840x5120, 2560x5120, 5120x3072, 4096x4096, 4096x2048, 2560x1536) to demonstrate the model's ability to produce high-quality, detailed images across a range of scales.  The images encompass diverse subjects, including a flower, a woman's portrait, a landscape, a statue, a close-up of a woman's eye, and rabbits. The appendix contains a list of the text prompts used for image generation.", "section": "Introduction"}, {"figure_path": "voJCpdlw53/figures/figures_23_1.jpg", "caption": "Figure 1: The proposed UltraPixel creates highly photo-realistic and detail-rich images at various resolutions. Best viewed zoomed in. All image prompts in this paper are listed in the appendix.", "description": "This figure shows several example images generated by the UltraPixel model at different resolutions, showcasing its ability to produce high-quality, photorealistic images with fine details across a range of image sizes.  The variety of subjects and styles highlights the model's versatility.", "section": "1 Introduction"}, {"figure_path": "voJCpdlw53/figures/figures_24_1.jpg", "caption": "Figure 1: The proposed UltraPixel creates highly photo-realistic and detail-rich images at various resolutions. Best viewed zoomed in. All image prompts in this paper are listed in the appendix.", "description": "This figure shows examples of images generated by the UltraPixel model at various resolutions, showcasing its ability to produce high-quality, photorealistic images with rich details.  The different image sizes demonstrate the model's scalability and performance across a range of resolutions.", "section": "Introduction"}, {"figure_path": "voJCpdlw53/figures/figures_25_1.jpg", "caption": "Figure 1: The proposed UltraPixel creates highly photo-realistic and detail-rich images at various resolutions. Best viewed zoomed in. All image prompts in this paper are listed in the appendix.", "description": "This figure showcases example images generated by the UltraPixel model at various resolutions, demonstrating the model's ability to produce high-quality, photorealistic images with rich details across different scales. The images depict a range of subjects and scenes, highlighting the model's versatility and effectiveness.", "section": "Introduction"}, {"figure_path": "voJCpdlw53/figures/figures_26_1.jpg", "caption": "Figure 1: The proposed UltraPixel creates highly photo-realistic and detail-rich images at various resolutions. Best viewed zoomed in. All image prompts in this paper are listed in the appendix.", "description": "This figure shows a collection of images generated by the UltraPixel model, showcasing its ability to produce photorealistic and highly detailed images at various resolutions, ranging from 1536 x 2560 to 5120 x 5120 pixels.  The images demonstrate the model's versatility across different subject matter and styles (portrait, landscape, animal, etc.). The varied aspect ratios further showcase the model's adaptability.", "section": "Introduction"}, {"figure_path": "voJCpdlw53/figures/figures_27_1.jpg", "caption": "Figure 1: The proposed UltraPixel creates highly photo-realistic and detail-rich images at various resolutions. Best viewed zoomed in. All image prompts in this paper are listed in the appendix.", "description": "This figure showcases the visual results generated by the UltraPixel model, demonstrating its capability to produce high-quality, photorealistic images at different resolutions, ranging from 1536x2560 to 5120x5120 pixels.  Each image depicts a different subject (flower, woman, mountain scenery, statue, eyes, and rabbits), highlighting UltraPixel's versatility and ability to capture fine details across varied styles and resolutions.", "section": "Introduction"}, {"figure_path": "voJCpdlw53/figures/figures_28_1.jpg", "caption": "Figure 1: The proposed UltraPixel creates highly photo-realistic and detail-rich images at various resolutions. Best viewed zoomed in. All image prompts in this paper are listed in the appendix.", "description": "This figure showcases the visual results of the UltraPixel model, demonstrating its ability to generate high-quality images across a range of resolutions (from 1536x2560 to 5120x5120 pixels).  The images depict diverse subjects, including a peony flower, a portrait of a woman, a landscape painting, and two rabbits.  The high level of detail and photorealism achieved by the model is evident in each image.", "section": "Introduction"}, {"figure_path": "voJCpdlw53/figures/figures_29_1.jpg", "caption": "Figure 1: The proposed UltraPixel creates highly photo-realistic and detail-rich images at various resolutions. Best viewed zoomed in. All image prompts in this paper are listed in the appendix.", "description": "This figure showcases sample images generated by the UltraPixel model at different resolutions, demonstrating its capability to produce high-quality, photorealistic results with rich details across various scales.  The wide range of resolutions highlights the model's versatility.", "section": "1 Introduction"}, {"figure_path": "voJCpdlw53/figures/figures_30_1.jpg", "caption": "Figure 1: The proposed UltraPixel creates highly photo-realistic and detail-rich images at various resolutions. Best viewed zoomed in. All image prompts in this paper are listed in the appendix.", "description": "This figure showcases the visual results of the UltraPixel model. It presents eight different images generated at various resolutions, highlighting the model's capacity for creating high-quality, detailed images across a wide range of sizes. The images illustrate different styles, including portraits, landscapes and animal close-ups, demonstrating the model's versatility.", "section": "Introduction"}, {"figure_path": "voJCpdlw53/figures/figures_31_1.jpg", "caption": "Figure 1: The proposed UltraPixel creates highly photo-realistic and detail-rich images at various resolutions. Best viewed zoomed in. All image prompts in this paper are listed in the appendix.", "description": "This figure shows examples of images generated by the UltraPixel model at different resolutions, ranging from 1536x2560 to 5120x5120 pixels.  The images demonstrate the model's ability to produce high-quality, detailed images across a wide range of sizes.  The variety of subjects (flower, portrait, landscape) showcases the model's versatility.", "section": "Introduction"}]