[{"figure_path": "FMrNus3d0n/tables/tables_2_1.jpg", "caption": "Table 1: Comparison of our generative defensive approach with existing classification-based ones.", "description": "This table compares the proposed GUARDT2I method with existing commercial and open-source content moderation methods.  It highlights key differences in terms of whether the method is open-source, the paradigm used (classification vs. generation), whether the labels are freely available, the model's interpretability, and the possibility for customization.  GUARDT2I is shown to be superior in many respects.", "section": "2 Related Work"}, {"figure_path": "FMrNus3d0n/tables/tables_5_1.jpg", "caption": "Table 2: Comparison with baselines. Bolded values are the highest performance. The underlined italicized values are the second highest performance. * indicates human-written adversarial prompts.", "description": "This table compares the performance of GUARDT2I against several baseline methods across various adversarial prompt datasets.  The metrics used for comparison include Attack Success Rate (ASR), False Positive Rate at 95% True Positive Rate (FPR@TPR95), Area Under the Precision-Recall Curve (AUPRC), and Area Under the Receiver Operating Characteristic Curve (AUROC).  The table highlights GUARDT2I's superior performance in all metrics, demonstrating its effectiveness in mitigating adversarial prompts.", "section": "4.2 Main Results"}, {"figure_path": "FMrNus3d0n/tables/tables_6_1.jpg", "caption": "Table 3: Normal Use Case Results. Bolded values are the highest performance. The underlined italicized values are the second highest performance.", "description": "This table presents the results of evaluating the image quality and text alignment of different methods in normal use cases, which are not adversarial prompts.  The metrics used are FID (Fréchet Inception Distance), which measures the image fidelity, and CLIP-Score, which assesses the alignment between the generated image and its text prompt.  Lower FID scores indicate better image quality, and higher CLIP-Scores represent better text alignment. ASR (Attack Success Rate) is also presented. The table shows that GUARDT2I maintains high image quality and text alignment, while demonstrating significantly better defense effectiveness in terms of a lower attack success rate when compared to the baselines.", "section": "4.2 Main Results"}, {"figure_path": "FMrNus3d0n/tables/tables_7_1.jpg", "caption": "Table 2: Comparison with baselines. Bolded values are the highest performance. The underlined italicized values are the second highest performance. * indicates human-written adversarial prompts.", "description": "This table compares the performance of GUARDT2I against several baseline methods across various adversarial prompt datasets.  The metrics used are Attack Success Rate (ASR), False Positive Rate at 95% True Positive Rate (FPR@TPR95), Area Under the Precision-Recall Curve (AUPRC), and Area Under the Receiver Operating Characteristic Curve (AUROC).  Higher AUPRC and AUROC values, and lower ASR and FPR@TPR95 values indicate better performance.  The table highlights GUARDT2I's superior performance across different types of adversarial prompts, including those crafted manually and automatically.", "section": "4.2 Main Results"}, {"figure_path": "FMrNus3d0n/tables/tables_9_1.jpg", "caption": "Table 2: Comparison with baselines. Bolded values are the highest performance. The underlined italicized values are the second highest performance. * indicates human-written adversarial prompts.", "description": "This table compares the performance of GUARDT2I against several baseline methods in mitigating various types of adversarial prompts.  It shows the attack success rate (ASR), false positive rate at 95% true positive rate (FPR@TPR95), area under the precision-recall curve (AUPRC), and area under the ROC curve (AUROC) for different adversarial prompt datasets. The results demonstrate that GUARDT2I significantly outperforms all baselines across various metrics and attack types.", "section": "4.2 Main Results"}, {"figure_path": "FMrNus3d0n/tables/tables_9_2.jpg", "caption": "Table 2: Comparison with baselines. Bolded values are the highest performance. The underlined italicized values are the second highest performance. * indicates human-written adversarial prompts.", "description": "This table compares the performance of GUARDT2I against several baseline methods across various adversarial prompt datasets.  The metrics used are Attack Success Rate (ASR), False Positive Rate at 95% True Positive Rate (FPR@TPR95), Area Under the Precision-Recall Curve (AUPRC), and Area Under the Receiver Operating Characteristic Curve (AUROC).  Higher AUROC and AUPRC values indicate better performance, while a lower FPR@TPR95 and ASR indicate fewer false positives and successful attacks respectively.  The table highlights GUARDT2I's superior performance across all metrics and datasets, especially against human-written adversarial prompts.", "section": "4.2 Main Results"}, {"figure_path": "FMrNus3d0n/tables/tables_9_3.jpg", "caption": "Table 7: Comparison of Model Parameters and Inference Times on NVIDIA-A800", "description": "This table compares the number of parameters and inference times for various models on an NVIDIA-A800 GPU.  The models compared include Stable Diffusion v1.5, SDXL 0.9, SafetyChecker, a combination of SDv1.5 and SafetyChecker, the c-LLM used in GuardT2I, the Sentence Similarity component of GuardT2I, and finally GuardT2I itself.  The inference times show GuardT2I's efficiency compared to the other methods, being significantly faster, even when compared to the SafetyChecker alone.", "section": "4.2 Main Results"}, {"figure_path": "FMrNus3d0n/tables/tables_15_1.jpg", "caption": "Table 2: Comparison with baselines. Bolded values are the highest performance. The underlined italicized values are the second highest performance. * indicates human-written adversarial prompts.", "description": "This table compares the performance of GUARDT2I against several baseline methods in mitigating various adversarial prompts.  The metrics used to evaluate the performance are Attack Success Rate (ASR), False Positive Rate at 95% True Positive Rate (FPR@TPR95), Area Under the Precision-Recall Curve (AUPRC), and Area Under the Receiver Operating Characteristic Curve (AUROC).  The table shows that GUARDT2I consistently outperforms the baselines across different types of adversarial prompts (human-written and automatically generated).  The bolded values represent the highest performance for each metric, and the underlined italicized values show the second-best performance.", "section": "4.2 Main Results"}]