[{"type": "text", "text": "Optimistic Critic Reconstruction and Constrained Fine-Tuning for General Offline-to-Online RL ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Qin-Wen Luo∗1, Ming-Kun Xie∗1,2, Ye-Wen Wang∗1, Sheng-Jun Huang† ", "page_idx": 0}, {"type": "text", "text": "1 Nanjing University of Aeronautics and Astronautics, Nanjing, China 2 RIKEN Center for Advanced Intelligence Project, Tokyo, Japan {luoqw8,linuswangg,huangsj}@nuaa.edu.cn ming-kun.xie@riken.jp ", "page_idx": 0}, {"type": "text", "text": "Abstract ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Offline-to-online (O2O) reinforcement learning (RL) provides an effective means of leveraging an offilne pre-trained policy as initialization to improve performance rapidly with limited online interactions. Recent studies often design fine-tuning strategies for a specific offline RL method and cannot perform general O2O learning from any offilne method. To deal with this problem, we disclose that there are evaluation and improvement mismatches between the offilne dataset and the online environment, which hinders the direct application of pre-trained policies to online fine-tuning. In this paper, we propose to handle these two mismatches simultaneously, which aims to achieve general O2O learning from any offline method to any online method. Before online fine-tuning, we re-evaluate the pessimistic critic trained on the offilne dataset in an optimistic way and then calibrate the misaligned critic with the reliable offline actor to avoid erroneous update. After obtaining an optimistic and and aligned critic, we perform constrained fine-tuning to combat distribution shift during online learning. We show empirically that the proposed method can achieve stable and efficient performance improvement on multiple simulated tasks when compared to the state-of-the-art methods. The implementation is available at https://github.com/QinwenLuo/OCR-CFT. ", "page_idx": 0}, {"type": "text", "text": "1 Introduction ", "text_level": 1, "page_idx": 0}, {"type": "text", "text": "Offline reinforcement learning (RL) aims to learn a policy from a fixed dataset without additional interactions with the environment. This characteristic makes it particularly promising for critical applications such as healthcare decision-making [39], human-AI coordination [14] and autonomous driving [8]. Generally, the performance of the learned policy relies on the quality of the dataset. Given that the offilne data is limited, fine-tuning the policy through interactions with the environment is still necessary to achieve favorable performance. Consequently, offilne-to-online (O2O) RL tends to achieve faster performance improvements based on better initializations. ", "page_idx": 0}, {"type": "text", "text": "To effectively fine-tune offilne policies, O2O methods are typically designed based on specific offilne RL algorithms. Existing methods can be roughly divided into two groups according to the base offilne methods they use. The first group relies on policy constraint methods. These approaches aim to improve online performance by either adaptively adjusting constraints [5, 52, 43] or directly applying offline algorithms to online fine-tuning [32, 20]. Unfortunately, these methods often suffer from inefficient performance improvement due to restricted action exploration caused by policy constraints. The second group builds on value regularization methods. These methods aim to prevent excessively low Q-values resulting from pessimistic evaluations, such as those in CQL [21]. The goal is to enhance the generalization of the value function and mitigate potential performance declines [27, 33]. Some other methods adopt ensemble Q-learning [51, 23, 30, 19] address these issues. However, these methods often face high computational costs due to the need to train multiple Q-networks. ", "page_idx": 0}, {"type": "text", "text": "", "page_idx": 1}, {"type": "text", "text": "Considering that the aforementioned methods develop online fine-tuning algorithms based on specific offline methods, they often struggle to be applied to other offline methods. To establish a general O2O framework, it is essential to address the core issues associated with transitioning from offilne to online environments. Inspired of the recent work [48], which highlights the misalignment between the actor and the critic in an explicit policy constraint method, we identify two mismatches in general O2O RL: evaluation mismatches and improvement mismatches. Evaluation mismatches primarily occur in value regularization methods. These refer to the differences in policy evaluation methods between online and offline settings, which cause severe fluctuations in Q-value estimation during the initial stages of fine-tuning. Improvement mismatches, on the other hand, are prevalent in policy constraint methods. They are often caused by differences in objectives for updating the policy, leading to a misalignment between the probabilities of actions and their Q-values. Thanks to another recent work by Xu et al [47], which connects value regularization and policy constraint methods, we bridge these two types of mismatches within a unified framework for general RL-based offline algorithms. ", "page_idx": 1}, {"type": "text", "text": "In this paper, we propose a general O2O framework designed to address both evaluation and improvement mismatches simultaneously, aiming for stable and favorable fine-tuning performance from any offline method to representative online methods. To address the evaluation mismatch in value regularization methods, we propose re-evaluating the offline policy in an optimistic manner using an off-policy evaluation method. This approach allows us to obtain optimistic Q-value estimates, preventing the dramatic fluctuations in Q-values that could potentially cause the policy to collapse. Although the re-evaluated critic can estimate Q-values optimistically, it suffers from the misalignment with the offilne policy, causing the improvement mismatch. To handle the improvement mismatch in the re-evaluated critics and policy constraint methods, we introduce value alignment to calibrate the critic so that it aligns with the probabilities predicted by the policy. Our approach involves using the Q-value of the most likely action as an anchor and then calibrating other Q-values by either exploiting the correlation between Q-values of different state-action pairs or modeling Q-values as a Gaussian distribution. Finally, we propose a constrained fine-tuning framework to guide the policy update by adding a regularization term, with the target of mitigating the negative impact of data shift. Extensive experimental results on multiple benchmark environments validate that the proposed methods can achieve better or comparable performance when compared to state-of-the-art methods. ", "page_idx": 1}, {"type": "text", "text": "Our contributions can be summarized as follows: ", "page_idx": 1}, {"type": "text", "text": "• We systemically study that there exist evaluation and improvement mismatches for offilne RL methods from the perspective of online RL. We show that resolving these two types of mismatches is essential for achieving general O2O RL.   \n• We develop two techniques to address these mismatches. Policy re-evaluation aims to achieve optimistic Q-value estimates, preventing instability in Q-value estimation. Value alignment calibrates the critic to align with the policy, ensuring consistency between action probabilities and their corresponding Q-values.   \n• We introduce a constrained fine-tuning framework that incorporates a regularization term into the policy objective, combating the inevitable distribution shift and ensuring stable and optimal performance when fine-tuning the policy in online environments. ", "page_idx": 1}, {"type": "text", "text": "2 Preliminaries ", "text_level": 1, "page_idx": 1}, {"type": "text", "text": "In this section, we introduce necessary preliminaries about RL, including Markov decision process, and three target online RL methods. ", "page_idx": 1}, {"type": "text", "text": "Markov Decision Process (MDP) A Markov Decision Process $\\mathcal{M}$ is defined by the tuple $(S,\\!A,\\!R,\\!P,\\!\\mu,\\!\\gamma)$ [38], where $S$ is the state space, $A$ is the action space, $P:S\\times A\\,\\to\\,\\Delta(S)$ is the transition function, $R:S\\times A\\rightarrow\\mathbb{R}$ is the reward function, $\\mu$ is the initial state distribution, and $\\gamma$ is a discount factor. The goal is to learn a policy that maximizes the expected return as ", "page_idx": 1}, {"type": "equation", "text": "$$\nJ\\left(\\pi\\right)=\\mathbb{E}_{\\pi}[\\sum_{t=0}^{\\infty}\\gamma^{t}r_{t}]=\\mathbb{E}_{\\delta\\left(s_{0},a_{0}\\right)}\\left[Q^{\\pi}\\left(s_{0},a_{0}\\right)\\right],\\delta\\!\\left(s_{0},a_{0}\\right):=\\left(s_{0}\\sim\\mu,a_{0}\\sim\\pi\\left(\\cdot|s_{0}\\right)\\right).\n$$", "text_format": "latex", "page_idx": 1}, {"type": "text", "text": "Online RL The three most commonly used online RL algorithms are SAC [17], TD3 [11], and PPO [37]. Below, we will introduce these three methods one by one. ", "page_idx": 2}, {"type": "text", "text": "SAC first introduces entropy maximization into the RL scenarios and updates the actor and the critic by minimizing the following objectives: ", "page_idx": 2}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathcal{L}_{\\pi}^{\\mathrm{SAC}}\\left(\\theta\\right)=\\underset{s\\sim R}{\\mathbb{E}}\\underset{a\\sim\\pi_{\\theta}\\left(\\cdot\\right\\mid s\\right)}{\\mathbb{E}}\\left[\\alpha\\log\\pi_{\\theta}\\left(a\\middle\\vert s\\right)-Q_{\\mu}\\left(s,a\\right)\\right],}\\\\ &{\\mathcal{L}_{\\mu_{i}}^{\\mathrm{SAC}}\\left(\\mu_{i}\\right)=\\underset{\\left(s,a,r,s^{\\prime}\\right)\\sim R}{\\mathbb{E}}\\left[\\left(Q_{\\mu_{i}}\\left(s,a\\right)-y\\left(r,s^{\\prime}\\right)\\right)^{2}\\right],}\\\\ &{y\\left(r,s^{\\prime}\\right)=r+\\gamma\\mathbb{E}_{a^{\\prime}\\sim\\pi_{\\theta}\\left(\\cdot\\right\\mid s^{\\prime}\\right)}\\left[\\underset{i=1,2}{\\operatorname*{min}}Q_{\\bar{\\mu}_{i}}\\left(s,a\\right)-\\alpha\\log\\pi_{\\theta}\\left(a^{\\prime}\\middle\\vert s^{\\prime}\\right)\\right],}\\\\ &{\\mathcal{L}_{\\alpha}^{\\mathrm{SAC}}\\left(\\alpha\\right)=-\\underset{s\\sim R}{\\mathbb{E}}\\underset{a\\sim\\pi_{\\theta}\\left(\\cdot\\right\\mid s\\right)}{\\mathbb{E}}\\left[\\log\\pi_{\\theta}\\left(a\\middle\\vert s\\right)-\\bar{\\mathcal{H}}\\right],}\\end{array}\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "where $\\alpha>0$ , ${\\bar{\\mu}_{i}}$ are the parameters of the target $Q$ network, and $\\bar{\\mathcal{H}}$ is the target entropy. ", "page_idx": 2}, {"type": "text", "text": "TD3 models a deterministic policy and uses tricks, including clipped double Q-learning and policy smoothing, to address the issue of function approximation error. The deterministic policy gradient used to update policy is defined as ", "page_idx": 2}, {"type": "equation", "text": "$$\n\\nabla_{\\theta}J_{\\pi}^{\\mathrm{TD3}}\\left(\\theta\\right)=\\underset{s\\sim R}{\\mathbb{E}}\\left[\\nabla_{a}Q_{\\mu}^{\\pi}\\left(s,a\\right)\\vert_{a=\\pi\\left(s\\right)}\\nabla_{\\theta}\\pi_{\\theta}\\left(s\\right)\\right].\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "The objective function of updating the critic is defined as ", "page_idx": 2}, {"type": "equation", "text": "$$\n\\begin{array}{r}{\\mathcal{L}_{\\mu_{i}}^{\\mathrm{TD3}}\\left(\\mu_{i}\\right)=\\underset{\\left(s,a,r,s^{\\prime}\\right)\\sim R}{\\mathbb{E}}\\left[\\left(Q_{\\mu_{i}}\\left(s,a\\right)-y\\left(r,s^{\\prime}\\right)\\right)^{2}\\right].}\\end{array}\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "Here, $y\\left(r,s^{\\prime}\\right)=r+\\gamma\\operatorname*{min}_{i=1,2}Q_{\\bar{\\mu}_{i}}\\left(s^{\\prime},\\tilde{a}\\right)$ , where $\\tilde{a}=\\pi_{\\bar{\\theta}}\\left(s^{\\prime}\\right)+\\epsilon$ and $\\epsilon\\sim\\mathrm{clip}\\left(N\\left(0,\\sigma\\right),-c,c\\right)$ . ", "page_idx": 2}, {"type": "text", "text": "PPO provides a simple implementation for TRPO [35], which updates the actor and the critic by minimizing the following objective functions, respectively, ", "page_idx": 2}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathcal{L}_{\\pi}^{\\mathrm{PPO}}\\left(\\theta\\right)=-\\underset{s\\sim R a\\sim\\pi_{\\theta_{k}}\\left(\\cdot\\vert s\\right)}{\\mathbb{E}}\\Biggl[\\operatorname*{min}\\left(r\\left(\\theta\\right)A^{\\pi_{\\theta_{k}}}\\left(s,a\\right),\\operatorname{clip}\\left(r\\left(\\theta\\right),1-\\epsilon,1+\\epsilon\\right)A^{\\pi_{\\theta_{k}}}\\left(s,a\\right)\\right)\\Biggr],}\\\\ &{\\mathcal{L}_{\\nu}^{\\mathrm{PPO}}\\left(\\nu\\right)=\\underset{\\left(s,r,s^{\\prime}\\right)\\sim R}{\\mathbb{E}}\\left[\\left(A^{\\pi_{\\theta_{k}}}\\left(s,a\\right)+V_{\\bar{\\nu}}\\left(s^{\\prime}\\right)\\right)-V_{\\nu}\\left(s\\right)\\right)^{2}\\Biggr],}\\end{array}\n$$", "text_format": "latex", "page_idx": 2}, {"type": "text", "text": "where $r(\\theta)=\\pi_{\\theta}/\\pi_{\\theta_{k}}$ and the advantage $A^{\\pi_{\\theta_{k}}}$ is computed by GAE [36]. ", "page_idx": 2}, {"type": "text", "text": "It is noteworthy that previous works mostly adopted SAC and TD3 for online fine-tuning as they are off-policy methods. In our work, given the widespread use of PPO in online RL, we also employ it for fine-tuning though it is an on-policy method. ", "page_idx": 2}, {"type": "text", "text": "3 Evaluation and Improvement Mismatches ", "text_level": 1, "page_idx": 2}, {"type": "text", "text": "In this section, we focus on the differences between online and offline RL and study how these differences impact the performance of online fine-tuning. In general, we summarize these differences as two types of mismatches, evaluation mismatch and improvement mismatch. The former arises from the changes in policy evaluation functions during the transition from offilne to online environments; while the latter represents the inconsistency in the objectives for policy updates between offline and online RL. Most offline RL methods suffer from one or both of these issues, which underscores the importance of addressing these mismatches to achieve stable and effective online fine-tuning. ", "page_idx": 2}, {"type": "text", "text": "Evaluation mismatch often occurs in the value regularization methods. For example, in CQL [21], a representative offilne method, the policy evaluation function transitions from a pessimistic estimation inherent to offilne learning to a more optimistic estimation during online training. This shift frequently results in a sharp increase in Q-values at the beginning of online fine-tuning, which can hinder stable performance improvements. To address this problem, several attempts have been made to mitigate the excessive underestimation of out-of-the-distribution (OOD) actions during offilne learning [33, 27] or to initialize a pessimistic Q-ensemble to maintain pessimism during online fine-tuning [23]. ", "page_idx": 2}, {"type": "text", "text": "Unfortunately, these approaches are predominantly tailored to the transition from CQL to SAC, limiting their applicability to other offline algorithms. ", "page_idx": 3}, {"type": "text", "text": "Improvement mismatch is commonly found in policy constraint methods. Typical examples include $\\mathrm{TD3+BC}$ [10] and AWAC [32], where the objective of actor updates differs significantly from typical online methods. In these models, updates to the actor are not solely reliant on the critic’s evaluation. Consequently, actions that have high Q-values may not automatically translate to high probabilities of being selected, and vice versa. This divergence often misguides the update of policy at the beginning stage of online fine-tuning, resulting in unfavourable performance. ", "page_idx": 3}, {"type": "text", "text": "Besides, One-step RL and non-iterative methods, e.g., IQL, exhibit both evaluation and improvement mismatches. During the policy evaluation stage, these methods estimate the Q-values based on the behavior policy or an unknown policy [18] instead of the target policy as in online methods; during the improvement stage, because they impose additional constraints on policy updates, they also encounter the same issue as discussed above. This can lead to discrepancies in both the assessment of action values and the subsequent policy optimization, making it hard to achieve effective policy improvement. ", "page_idx": 3}, {"type": "text", "text": "Thanks to the recent work [47], which presents a unified framework for understanding offline RL, we bridge these two mismatches for general RL-based offline algorithms. Formally, the offilne RL problem can be defined by the behavior-regularized MDP problem [47, 13] via maximizing the following objective: ", "page_idx": 3}, {"type": "equation", "text": "$$\n\\mathbb{E}\\left[\\sum_{t=0}^{\\infty}\\gamma^{t}(r(s_{t},a_{t})-\\alpha\\cdot f(\\frac{\\pi(a_{t}|s_{t})}{\\mu(a_{t}|s_{t})}))\\right]=\\mathbb{E}_{\\delta(s_{0},a_{0})}\\left[Q^{\\pi}\\left(s_{0},a_{0}\\right)-\\alpha\\cdot f\\left(\\frac{\\pi\\left(a_{0}|s_{0}\\right)}{\\mu\\left(a_{0}|s_{0}\\right)}\\right)\\right],\n$$", "text_format": "latex", "page_idx": 3}, {"type": "text", "text": "where $f(\\cdot)$ is a regularization function and $\\mu$ is the behavior policy. ", "page_idx": 3}, {"type": "text", "text": "From Eq. (1) and Eq. (9), we observe a significant divergence in the relation between the actor and the critic in online versus offline scenarios. Unlike in online cases where the policy update is solely dependent on the Q-function, in offilne scenarios, it also critically depends on the data distribution, as indicated by the regularization term in Eq. (9). This distinction highlights why offline methods often face evaluation and improvement mismatches when applied to online fine-tuning. Using offilne actor and critic trained by Eq. (9) for initialization in online fine-tuning introduces both types of mismatches, resulting in unstable and inefficient updates. ", "page_idx": 3}, {"type": "text", "text": "4 Method ", "text_level": 1, "page_idx": 3}, {"type": "text", "text": "In this section, we introduce our proposed O2O method for handling the mismatches discussed in Section 3 and the distribution shift problem. To address the pessimistic or unreliable evaluation, such as in CQL and IQL, we develop a policy re-evaluation technique. This technique optimistically re-evaluates the well-trained offline policy using an off-policy evaluation method. Although this re-evaluation helps the critic achieve more optimistic Q-value estimates, unavoidable factors such as function approximation errors and partial data coverage can still lead to a misalignment between the critic and the offline policy. This misalignment means that the action with the highest probability predicted by the policy does not necessarily have the highest Q-value, leading to what we have termed improvement mismatch. ", "page_idx": 3}, {"type": "text", "text": "As discussed in in Section 3, both the value regularization (after re-evaluation) and policy constraint methods exhibit improvement mismatch, though the reasons for the mismatch differ between these two approaches. To address this issue, we propose value alignment, which aims to align the critic’s estimates with the policy’s action probabilities, effectively tackling the improvement mismatch in both types of methods. Finally, to deal with the inevitable distribution shift between offilne and online environments, we develop a constrained fine-tuning framework. This framework ensures that the policy consistently updates in the optimal direction by incorporating a regularization term into the policy objective. ", "page_idx": 3}, {"type": "text", "text": "We propose methods for various representative online RL algorithms within a unified framework, including SAC [17], TD3 [11], and PPO [37]. These algorithms represent the mainstream approaches in online RL, and are targeted respectively for the off-policy approach with stochastic policies, the off-policy approach with deterministic policies, and the on-policy approach. ", "page_idx": 3}, {"type": "text", "text": "4.1 Policy Re-evaluation ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "The critic trained on an offline dataset typically maintains pessimistic estimates of Q-values. When using online evaluation methods to fine-tune this critic without any value regularization, the Qvalues can experience a dramatic jump, especially for OOD actions, leading to inaccurate Q-value estimations. To mitigate this problem, we propose re-evaluating the offline policy to acquire a new critic by employing an off-policy evaluation (OPE) method. The goal is to enable the critic to have optimistic estimates of Q-values that more closely approximate the true values. ", "page_idx": 4}, {"type": "text", "text": "However, directly applying OPE methods for policy evaluation on offilne datasets often leads to large extrapolation errors, as discussed in the previous work [12]. These errors arise due to absent data and training mismatches. Thanks to the pessimism in offline RL, it is reasonable to assume that a well-trained policy is close enough to the behavior policy or even captures the support set of the behavior policy. A common assumption is single-policy concentrability [45, 34], which demonstrates how concentrated a learned policy is within the given dataset and can be defined as follows. ", "page_idx": 4}, {"type": "text", "text": "Assumption 4.1. ( $\\pi_{\\theta}$ -concentrability $[45J]$ The behavior policy $\\mu$ and learned policy $\\pi_{\\theta}$ satisfy ", "page_idx": 4}, {"type": "equation", "text": "$$\n\\operatorname*{max}_{(s,a)\\in S\\times A}{\\frac{d^{\\pi_{\\theta}}\\left(s,a\\right)}{d^{\\mu}\\left(s,a\\right)}}\\leq C.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $d^{\\pi_{\\theta}}\\left(s,a\\right)$ is the occupancy measure of $\\pi_{\\theta}$ and $C$ is a constant. Single-policy concentrability measures the degree to which the state-action distribution induced by the learned policy is covered by the dataset used for training. By ensuring that the learned policy does not deviate significantly from the behavior policy, the extrapolation error can be greatly reduced [22, 29]. When using a representative OPE method called ftited $\\mathrm{Q}.$ -evaluation (FQE), based on Assumption 4.1 and Theorem 4.2 in [22], the upper bound of extrapolation error can be obtained. ", "page_idx": 4}, {"type": "text", "text": "Corollary 4.2. Under Assumption 4.1, by denoting $Q$ -value function class as $\\mathcal{F}$ , for $\\delta\\in(0,1)$ , after $K$ iterations of FQE on the dataset $\\mathcal{D}$ , with probability $1-\\delta$ , we have: ", "page_idx": 4}, {"type": "equation", "text": "$$\n|Q^{\\pi}-\\hat{Q}^{\\pi}|\\leq\\frac{1-\\gamma^{K}}{1-\\gamma}\\sqrt{C\\epsilon}+\\gamma^{K}\\bar{V},\\mathrm{~}w h e r e\\epsilon:=\\frac{2\\bar{V}^{2}\\log(|\\mathcal{F}|/\\delta)}{|\\mathcal{D}|}+20d_{F}^{\\pi}.\n$$", "text_format": "latex", "page_idx": 4}, {"type": "text", "text": "where $d_{F}^{\\pi}$ is inherent Bellman evaluation error (Definition 4.1 in [22]), and $\\bar{V}$ is the maximum of $V$ , which can be bounded by $R_{m a x}/(1-\\gamma)$ . ", "page_idx": 4}, {"type": "text", "text": "With a powerful neural network and sufficient data, the inherent Bellman evaluation error could be tiny. Accordingly, with a large training step $K$ , the error will be bounded by an acceptable value. This implies that, given sufficient data, one can achieve a critic with optimistic property and minor extrapolation error through policy re-evaluation. In practical implementation, for off-policy methods SAC and TD3, we can directly use Eq. (3) and Eq. (6) to re-evaluate the offline policy. For the on-policy method PPO, we train a critic by fitting the returns of offilne trajectories. Considering that the critic can only approximate $V^{\\mu}(s)$ rather than the true value function, we propose a regularization term in Section 4.2, which ensures the critic’s estimates are reliable and conducive to effective policy improvement. ", "page_idx": 4}, {"type": "image", "img_path": "XVfevb9XFx/tmp/920290d5c140a9c919912f959a07b74d13f333f83b42f1ec4bc62c2f913a2d02.jpg", "img_caption": ["(a) The performance of SAC "], "img_footnote": [], "page_idx": 4}, {"type": "text", "text": "4.2 Value Alignment ", "text_level": 1, "page_idx": 4}, {"type": "text", "text": "Although the critic after policy re-evaluation possesses the optimistic property needed in the online environment, it often does not align well with the offline policy due to factors such as function approximation errors, generalization errors of neural networks, and partial data coverage. Moreover, as discussed in Section 3, policy constraint offline methods also suffer from misalignment between the critic and policy. The misalignment means that the action with the highest Q-value does not necessarily have the highest probability, often leading to misleading updates of the policy. To verify this observation, we trained the policy using SAC and TD3 with three different critics: the fixed re-evaluated critic, the iterative re-evaluated critic (which updates with the policy), and our aligned critic. From Figure 1, the performance of re-evaluated critics sharply declines at the initial stage and does not recover in the subsequent training; while our aligned critic achieves stable and favorable performance. These results indicates that the misalignment between the re-evaluated critic and the offline policy can make it difficult for the policy to optimize in a correct direction, leading to an irreversible decline in performance. Given that the well-trained offline policy is reliable, the desirable critic should not only have optimistic Q-value estimates but also maintain alignment with the offilne policy. To achieve this, we propose performing value alignment to calibrate the critic. The main idea is to use the Q-values of the offilne policy actions as anchors, keeping them unaltered, and to suppress any overestimated Q-value that exceed these anchors, thereby aligning the critic with the offline policy. Below, we will discuss how to implement value alignment for different online methods. ", "page_idx": 4}, {"type": "image", "img_path": "XVfevb9XFx/tmp/08bcdf43781192211a6e8ad35ef87ee0ac872411c134d76bbe7a3498426df0d0.jpg", "img_caption": ["(b) The performance of TD3 ", "Figure 1: The results of actors updated with different critics. "], "img_footnote": [], "page_idx": 4}, {"type": "text", "text": "", "page_idx": 4}, {"type": "text", "text": "", "page_idx": 5}, {"type": "text", "text": "O2SAC Recall that in SAC [16, 17], the optimal policy is defined as ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\pi(a|s)=\\exp(\\frac{1}{\\alpha}Q(s,a))/\\exp(\\frac{1}{\\alpha}V(s))\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "With a simple transformation of Eq. (10), we have ", "page_idx": 5}, {"type": "equation", "text": "$$\nQ(s,a)=V(s)+\\alpha\\log\\pi\\left(a|s\\right)\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "One intuition behind our method is that actions with higher probabilities typically have more accurate Q-value estimates because these actions are closer to the dataset, and there is sufficient data nearby to obtain a precise estimate. This motivates us to use the Q-value $Q_{\\bar{\\mu}}(s,\\dot{a})$ of the optimal action $\\dot{a}$ to calibrate any other overestimated action. Assuming that $\\pi_{\\mathrm{off}}$ is the offline policy, we perform value alignment for any state-action pair $(s,a)$ as follows: ", "page_idx": 5}, {"type": "equation", "text": "$$\nQ_{\\mu}^{\\prime}(s,a)=\\operatorname*{min}\\left(Q_{\\bar{\\mu}}(s,\\dot{a})-\\alpha\\left(\\log\\pi_{\\mathrm{off}}\\left(\\dot{a}|s\\right)-\\log\\pi_{\\mathrm{off}}\\left(a|s\\right)\\right),Q_{\\bar{\\mu}}(s,a)\\right),\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $\\operatorname*{min}(\\cdot,\\cdot)$ operator is used to maintain the Q-values of actions that are not overestimated and consistent with OPE results. ", "page_idx": 5}, {"type": "text", "text": "Formally, we define the objective function of value alignment as follows: ", "page_idx": 5}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathcal{L}_{\\mu_{i}}^{\\mathrm{align}}\\left(\\mu_{i}\\right)=\\underset{s\\sim R,a\\sim\\pi\\left(\\cdot\\vert s\\right)}{\\mathbb{E}}\\left[\\left(Q_{\\mu_{i}}\\left(s,a\\right)-Q_{\\mu}^{\\prime}\\left(s,a\\right)\\right)^{2}\\right]}\\\\ &{\\mathcal{L}_{\\mu_{i}}^{\\mathrm{retain}}\\left(\\mu_{i}\\right)=\\underset{s\\sim R,}{\\mathbb{E}}\\left[\\left(Q_{\\mu_{i}}\\left(s,\\dot{a}\\right)-Q_{\\bar{\\mu}}\\left(s,\\dot{a}\\right)\\right)^{2}\\vert_{\\dot{a}=\\pi_{\\mathrm{off}}\\left(s\\right)}\\right]}\\\\ &{\\mathcal{L}_{\\mu_{i}}^{\\mathrm{critic}}\\left(\\mu_{i}\\right)=\\mathcal{L}_{\\mu_{i}}^{\\mathrm{align}}\\left(\\mu_{i}\\right)+\\mathcal{L}_{\\mu_{i}}^{\\mathrm{retain}}\\left(\\mu_{i}\\right)}\\end{array}\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "Considering that the overall Q-values have decreased, to maintain an optimistic estimate, we use the regularization term $\\mathcal{L}_{\\mu_{i}}^{\\mathrm{retain}}$ to prevent the underestimation of Q-values. ", "page_idx": 5}, {"type": "text", "text": "We derive Proposition 4.3 to show that the aligned state values $V_{\\mathrm{align}}(s)$ can be maintained within an appropriate range, meaning that the estimates remain optimistic while avoiding overestimation. ", "page_idx": 5}, {"type": "text", "text": "Proposition 4.3. After the value alignment process of Eq. (13), the state value function $V_{a l i g n}(s)$ satisfies ", "page_idx": 5}, {"type": "equation", "text": "$$\nV_{f q e}(s)\\leq V_{a l i g n}(s)\\leq V_{\\dot{a}}(s)\n$$", "text_format": "latex", "page_idx": 5}, {"type": "text", "text": "where $Q_{f q e}(s,a)$ are the low $Q$ -values after policy re-evaluation, which do not require calibration, $V_{f\\!q e}(s)\\!=\\!\\stackrel{.}{Q}\\!_{f\\!q e}(s,a)\\!-\\!\\alpha\\log\\pi\\left(a|s\\right)$ and $V_{\\dot{a}}(s)\\!=\\!Q(s,\\dot{a})\\!-\\!\\alpha\\log\\pi\\left(\\dot{a}|s\\right)$ . ", "page_idx": 5}, {"type": "text", "text": "During value alignment, we update the policy with Eq. (2) simultaneously for sampling the overestimated actions. The whole process iterates Eq. (2) and Eq. (13) to obtain a policy that performs equivalently to the offline policy and a critic aligned with it. We denote the policy as $\\pi_{\\mathrm{on}}$ and the aligned critic as $Q_{\\mathrm{on}}$ for sequential training. Note that $Q_{\\mathrm{on}}$ , which is modified from the critic obtained in the policy re-evaluation, does not depend on specific offline critics. This flexibility allows us to implement the transition to SAC from different offline algorithms. ", "page_idx": 5}, {"type": "text", "text": "O2TD3 As done in the case of O2SAC, we can use the $\\mathrm{\\DeltaQ}$ -values of the policy actions $\\dot{a}$ to maintain the optimistic property of policy re-evaluation and calibrate the $\\mathrm{^Q}$ -values of other actions. ", "page_idx": 5}, {"type": "text", "text": "Unfortunately, in TD3, the actor is modeled as a deterministic policy, lacking an explicit expression for Q-values, which prevents us from directly aligning Q-values with the policy. ", "page_idx": 6}, {"type": "text", "text": "To solve this problem, our main idea is to model the distribution of Q-values around the policy action $\\dot{a}$ as a Gaussian distribution. Specifically, in Eq. (5), when we use the offline policy as $\\pi_{\\theta}$ , the gradient of the policy is only related to the the gradient of $Q(s,a)$ with respect to $a$ . It is easy to see that the gradient around $\\dot{a}$ should tend to 0 as $\\dot{a}$ is the optimal action selected by the offline policy. Due to the use of smoothing regularization in the critic’s update in TD3, the $\\mathrm{^Q}$ -values of actions near $\\dot{a}$ differ only slightly from the Q-value of $\\dot{a}$ itself. This enables us to assume that normalized Q-values around $\\dot{a}$ follow a Gaussian distribution $Q(s,a)/Q(s,\\dot{a})\\sim N(\\dot{a},\\Sigma)$ . Formally, we can calibrate the $\\mathrm{Q}$ -values of other actions as (see Appendix G.2 for detailed derivation) ", "page_idx": 6}, {"type": "equation", "text": "$$\nQ^{\\prime}(s,a)=\\operatorname*{min}\\left(Q_{\\bar{\\mu}}(s,\\tilde{a}),\\frac{Q(s,\\dot{a})}{1+k\\cdot\\operatorname*{max}\\left(d(a,\\dot{a})^{2},\\sigma^{2}\\right)}\\right)\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "where $k$ is a constant, which is set as 1 across all tasks, and $d(a,\\dot{a})$ is a distance measure, which is defined as the euclidean distance divided by the square root of the action dimension in our implementation. ", "page_idx": 6}, {"type": "text", "text": "From Eq. (15), after calibration, the Q-values of the actions around $\\dot{a}$ are only slightly lower than $Q(s,{\\dot{a}})$ , which ensures that $\\dot{a}$ is the output action of the policy while maintaining a smoothing and optimistic property of $Q\\cdot$ -values. Moreover, for the actions that differ greatly from $\\dot{a}$ , we limit the maximum of the distance measure $d(a,\\dot{a})$ in Eq. (15) to the policy noise used in Eq. (6) to avoid severe underestimation of their Q-values. Formally, we define the objective loss of value alignment for O2TD3 as ", "page_idx": 6}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\mathcal{L}_{\\mu_{i}}^{\\mathrm{align}}\\left(\\mu_{i}\\right)=\\underset{s\\sim R}{\\mathbb{E}}\\left[\\left(Q_{\\mu_{i}}\\left(s,\\tilde{a}\\right)-Q_{\\mu}^{\\prime}\\left(s,\\tilde{a}\\right)\\right)^{2}\\right]\\rvert_{\\tilde{a}=\\pi\\left(s\\right)+\\delta}\\right]}\\\\ &{\\mathcal{L}_{\\mu_{i}}^{\\mathrm{retain}}\\left(\\mu_{i}\\right)=\\underset{s\\sim R}{\\mathbb{E}}\\left[\\left(Q_{\\mu_{i}}\\left(s,\\dot{a}\\right)-Q_{\\bar{\\mu}}\\left(s,\\dot{a}\\right)\\right)^{2}\\vert_{\\dot{a}=\\pi_{\\mathrm{off}}\\left(s\\right)}\\right]}\\\\ &{\\mathcal{L}_{\\mu_{i}}^{\\mathrm{critic}}\\left(\\mu_{i}\\right)=\\mathcal{L}_{\\mu_{i}}^{\\mathrm{align}}\\left(\\mu_{i}\\right)+\\mathcal{L}_{\\mu_{i}}^{\\mathrm{retain}}\\left(\\mu_{i}\\right)}\\end{array}\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "where $Q_{\\mu}^{\\prime}\\left(s,\\tilde{a}\\right)=\\operatorname*{min}(Q_{\\bar{\\mu}}(s,\\tilde{a}),Q_{\\mu}^{\\prime}(s,\\tilde{a}))$ and $\\tilde{a}$ is a perturbed action defined in Eq (6). ", "page_idx": 6}, {"type": "text", "text": "O2PPO In PPO, only the critic $V(s)$ is used to estimate the advantages for policy update. During the re-evaluation process, we train a critic by ftiting the returns of offilne trajectories as mentioned in Section 4.1. This indicates that the re-evaluated critic only approximate $V^{\\mu}(s)$ instead of the true one, misguiding the update of the policy. To mitigate this problem, we propose an auxiliary advantage function to correct erroneous updates. ", "page_idx": 6}, {"type": "text", "text": "Generally, a desirable auxiliary advantage function should satisfy the following two conditions: 1) it enables the policy to update in a reliable region; 2) its value must be zero at the beginning of online fine-tuning to enable the policy to transition smoothly from offline to online. Considering that the well-trained offline policy is reliable, we define the auxiliary advantage function as ", "page_idx": 6}, {"type": "equation", "text": "$$\nA_{\\alpha}(s,a)=\\alpha\\log\\pi_{\\mathrm{off}}(a|s)+\\alpha\\mathcal{H}(\\pi_{\\mathrm{off}}(\\cdot|s))\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "where $\\mathcal{H}$ is the entropy of action probabilities predicted by $\\pi_{\\mathrm{off}}$ . It is easy to verify the second condition that $A_{\\alpha}(s,\\bar{a})=0$ at the beginning of offline fine-tuning. To verify the first condition, we derive the following proposition. Its proof can be found in Appendix F. ", "page_idx": 6}, {"type": "text", "text": "Proposition 4.4. With $A_{\\alpha}(s,a)$ in Eq. (17), the policy update is regularized by the cross-entropy loss about the offline policy, thereby constraining the policy update in a reliable region. ", "page_idx": 6}, {"type": "text", "text": "Accordingly, we define the advantage function for policy update as ", "page_idx": 6}, {"type": "equation", "text": "$$\nA^{\\prime}(s,a)=A(s,a)+\\beta A_{\\alpha}(s,a)\n$$", "text_format": "latex", "page_idx": 6}, {"type": "text", "text": "where $\\beta$ anneals to 0 from 1. With the auxiliary advantag, Eq. (18) prevent the update direction from deviating too far from the offline policy. ", "page_idx": 6}, {"type": "text", "text": "4.3 Constrained Fine-Tuning ", "text_level": 1, "page_idx": 6}, {"type": "text", "text": "In the previous subsections, we discussed how to address the mismatch issues in the O2O problems. However, due to the distribution shift between the offline dataset and the online environment, along with the optimism in online RL, encountering out-of-distribution (OOD) states and actions becomes inevitable, potentially leading to significant performance fluctuations. Especially for OOD states that are absent in the offline dataset, even though the policy was trained well in the offline phase, it may still fail to output favourable actions, thereby causing erroneous policy update. ", "page_idx": 6}, {"type": "image", "img_path": "XVfevb9XFx/tmp/9438230ae6a77ed14fa598cc9ec1a878a4d9b93a478993690eec3637c6f08ea6.jpg", "img_caption": ["Figure 2: Performance curves on D4RL [9] MuJoCo locomotion tasks during online fine-tuning. "], "img_footnote": [], "page_idx": 7}, {"type": "text", "text": "", "page_idx": 7}, {"type": "text", "text": "Considering that the critic maintains an optimistic nature after undergoing policy re-evaluation and value alignment, with the optimistic update way during online fine-tuning, it typically overestimates the Q-values of OOD state-action pairs, which can mislead the update of the policy. Inspired of CMDP [1, 41, 7], we develop constrained fine-tuning (CFT) to introduce a regularization term to constrain the current actor and critic, which prevents the policy update from being severely misguided. ", "page_idx": 7}, {"type": "text", "text": "Specifically, we impose a constraint term $f(\\pi,\\pi_{\\mathrm{ref}})$ on the policy objective to ensure that it updates within the credible region of $\\pi_{\\mathrm{ref}}$ , where $f(\\cdot,\\cdot)$ is a divergence measurement and $\\pi_{\\mathrm{ref}}$ is the optimal historical policy during online evaluations. Formally, we define the policy objective of CFT as ", "page_idx": 7}, {"type": "equation", "text": "$$\n\\operatorname*{max}\\mathbb{E}_{\\pi}[\\sum_{t=0}^{\\infty}\\gamma_{t}r_{t}(s_{t},a_{t})]\\quad\\mathrm{s.t.}\\;\\mathbb{E}_{\\pi}[f(\\pi(a_{t}|s_{t}),\\pi_{\\mathrm{ref}}(a_{t}|s_{t}))]<\\tau\n$$", "text_format": "latex", "page_idx": 7}, {"type": "text", "text": "By incorporating the constraint term into the reward function akin to RCPO [41], we can solve the problem by minimizing the following objective functions with initializing $\\pi_{\\mathrm{ref}}$ as $\\pi_{\\mathrm{on}}$ obtained in Section 4.2 at the beginning of online fine-tuning. ", "page_idx": 7}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{L(\\theta)=\\operatorname*{max}\\mathbb{E}_{\\pi_{\\theta}}[Q_{\\mu}^{\\pi_{\\theta}}(s,a)-\\lambda f(\\pi_{\\theta}(a|s),\\pi_{\\mathrm{ref}}(a|s))]}\\\\ &{L(\\mu)=\\operatorname*{min}\\mathbb{E}_{(s,a,r,s^{\\prime})\\sim R}[(Q_{\\mu}^{\\pi_{\\theta}}(s,a)-y)^{2}]}\\\\ &{y=r+\\gamma\\mathbb{E}_{a^{\\prime}\\sim\\pi_{\\theta}(\\cdot|s^{\\prime})}[Q_{\\bar{\\mu}}^{\\pi_{\\theta}}(s^{\\prime},a^{\\prime})-\\lambda f(\\pi_{\\theta}(a^{\\prime}|s^{\\prime}),\\pi_{\\mathrm{ref}}(a^{\\prime}|s^{\\prime}))]}\\\\ &{L(\\lambda)=\\underset{\\lambda\\geq0}{\\operatorname*{min}}-\\lambda\\left[\\mathbb{E}_{\\pi_{\\theta}}\\left(f(\\pi_{\\theta}(a|s),\\pi_{\\mathrm{ref}}(a|s))\\right)-\\tau\\right]}\\end{array}\n$$", "text_format": "latex", "page_idx": 7}, {"type": "text", "text": "We provide a theoretical guarantee for the proposed CFT framework. ", "page_idx": 7}, {"type": "text", "text": "Corollary 4.5. With the penalty $f(\\pi,\\pi_{r e f})$ defined before and appropriate learning rates, algorithm of Eq. (20) almost surely to a fixed point $(\\theta^{*},\\mu^{*},\\lambda^{*}),$ , where $\\lambda^{*}=0$ , $\\theta^{*}$ and $\\mu^{*}$ are corresponded to $\\pi^{*}$ and $Q^{*}$ , which are optimal in the MDP without constraint. ", "page_idx": 7}, {"type": "text", "text": "In our implementation, we use $\\mathrm{KL}$ divergence and MSE function as $f(\\cdot,\\cdot)$ for the transitions of O2SAC and O2TD3, respectively. For O2PPO, the auxiliary advantage function already has the ability to constrain the policy update, we only need to replace $\\pi_{\\mathrm{off}}$ with $\\pi_{\\mathrm{ref}}$ during online finetuning. Note that in our methods, at the beginning of online fine-tuning, the regularization function $f(\\pi_{\\theta}(a|s),\\pi_{\\mathrm{on}}(a|s))$ is zero for any state, which guarantees no destruction of the alignment for the actor and the critic obtained in Section 4.2. ", "page_idx": 7}, {"type": "table", "img_path": "XVfevb9XFx/tmp/e8bcec1a7442ee6ad9ad07a3c29ecfeefdb4ee70af6ec5c6b3eaae6ef2bbd030.jpg", "table_caption": ["Table 1: Average normalized D4RL scores of our methods shown in AntMaze navigation tasks after $200\\mathbf{k}$ interactions with the environment. ${\\mathrm{U}}{=}$ umaze, $\\scriptstyle\\mathrm{D}=$ diverse) "], "table_footnote": [], "page_idx": 8}, {"type": "image", "img_path": "XVfevb9XFx/tmp/905556abe503d62b25ede94ddd1fc7d5c4eb8ef0e072df6d92cc291ce1396f0b.jpg", "img_caption": ["Figure 3: The fine-tuning performance achieved by transferring to three online algorithms from their heterogeneous offline algorithms. "], "img_footnote": [], "page_idx": 8}, {"type": "text", "text": "", "page_idx": 8}, {"type": "text", "text": "5 Experiments ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "In this section, we perform experiments to validate the effectiveness of the proposed method on D4RL [9] MuJoCo and AntMaze tasks, including HalfCheetah, Hopper, Walker2d and AntMaze environments. Specifically, we compare our methods with AWAC [32], IQL [20], PEX [50], Off2On [23], Cal-QL [33] and ACA [48]. For all methods except for O2PPO, we run 100,000 interaction steps with the environment and evaluate the policy per 1000 steps, as they all use off-policy methods for online fine-tuning. For our O2PPO method, due to the low efficiency of the on-policy method, we run 250,000 interaction steps to validate its performance, with 2500 steps as the evaluation interval. We run all methods with five random seeds and report their averaging results. Due to the space limitation, more experimental results can be found in Appendix B and C. ", "page_idx": 8}, {"type": "text", "text": "5.1 Comparison with State-of-the-Art Methods ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "Figure 2 shows the performance curves of our methods and comparing methods on Mujoco tasks. Similar to the previous works [48, 5], for O2SAC and O2TD3, we use CQL and $\\mathrm{TD3+BC}$ for offilne policy pre-training. From the figure, we can see that our method can converge more stably and rapidly than other methods and achieve the optimal performance in most cases. Although the ensemble method Off2On can achieve better final performance than our methods in some cases, it often suffers from a dramatic drop in performance at the beginning of fine-tuning, which is often unacceptable in the O2O problems. We report the results of O2PPO in Appendix A because of its different number of interaction steps. Although PPO is an on-policy method with low efficiency, from the results in Table 1, it shows significant superiority on sparse reward tasks, even though with equal interactions. ", "page_idx": 8}, {"type": "text", "text": "5.2 Study on Transferability ", "text_level": 1, "page_idx": 8}, {"type": "text", "text": "In this section, we perform experiments to verify the powerful transferability of the proposed method. As mentioned earlier, one of the advantages of our method is that it imposes no requirements on offilne algorithms. This means we can achieve the transfer from any offilne RL algorithm to three online RL algorithms. Figure 3 illustrates the fine-tuning performance of three online algorithms transferring from their heterogeneous offline algorithms. From Figure 3(a), pre-trained with $\\mathrm{TD3+BC}$ , O2SAC outperforms SAC trained from scratch with a larger margin. Although Online Decision Transformer (ODT) achieves favourable performance in the offilne environment, it converges slowly during online fine-tuning due to the architecture of the transformer. Our O2TD3 and O2PPO significantly enhances its performance through online fine-tuning. These results convincingly verify that our method show the strong transferability from various offline methods. ", "page_idx": 8}, {"type": "text", "text": "", "page_idx": 9}, {"type": "text", "text": "6 Conclusion ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "In this paper, we disclose there exist two types of mismatches when online fine-tuning offline RL methods. To address these two mismatches in O2O RL, we proposed optimistic critic reconstruction to re-evaluate an optimistic critic and align it with the offilne actor before online fine-tuning, ensuring the stable performance improvement at the beginning stage and potentially better efficiency due to the reconstructed optimism consistent with online RL. Furthermore, to combat the inevitable distribution shift that can hinder the stable performance improvement, we introduce constrained fine-tuning to constrain the divergence of current policy and the best foregoing policy to maintain the stability of online fine-tuning. These two components form a versatile O2O framework, allowing the transition from any offline algorithms to three state-of-the-art online algorithms. Experiments show our framework can converge to optimal performance without affecting the aligned critic at the beginning of online fine-tuning and achieve strong empirical performance. ", "page_idx": 9}, {"type": "text", "text": "Acknowledgements ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "This work was supported by the NSFC (62222605), the Natural Science Foundation of Jiangsu Province of China (BK20222012, BK20211517), and the National Science and Technology Major Project (2020AAA0107000). ", "page_idx": 9}, {"type": "text", "text": "References ", "text_level": 1, "page_idx": 9}, {"type": "text", "text": "[1] Joshua Achiam, David Held, Aviv Tamar, and Pieter Abbeel. Constrained policy optimization. In International conference on machine learning, pages 22–31. PMLR, 2017.   \n[2] Alekh Agarwal, Nan Jiang, Sham M Kakade, and Wen Sun. Reinforcement learning: Theory and algorithms. CS Dept., UW Seattle, Seattle, WA, USA, Tech. Rep, 32:96, 2019.   \n[3] Rishabh Agarwal, Max Schwarzer, Pablo Samuel Castro, Aaron C Courville, and Marc Bellemare. Reincarnating reinforcement learning: Reusing prior computation to accelerate progress. Advances in Neural Information Processing Systems, 35:28955–28971, 2022.   \n[4] Philip J Ball, Laura Smith, Ilya Kostrikov, and Sergey Levine. Efficient online reinforcement learning with offline data. arXiv preprint arXiv:2302.02948, 2023.   \n[5] Alex Beeson and Giovanni Montana. Improving td3-bc: Relaxed policy constraint for offline learning and stable online fine-tuning. arXiv preprint arXiv:2211.11802, 2022.   \n[6] Lili Chen, Kevin Lu, Aravind Rajeswaran, Kimin Lee, Aditya Grover, Misha Laskin, Pieter Abbeel, Aravind Srinivas, and Igor Mordatch. Decision transformer: Reinforcement learning via sequence modeling. Advances in neural information processing systems, 34:15084–15097, 2021.   \n[7] Gal Dalal, Krishnamurthy Dvijotham, Matej Vecerik, Todd Hester, Cosmin Paduraru, and Yuval Tassa. Safe exploration in continuous action spaces. arXiv preprint arXiv:1801.08757, 2018.   \n[8] Christopher Diehl, Timo Sebastian Sievernich, Martin Krüger, Frank Hoffmann, and Torsten Bertram. Uncertainty-aware model-based offilne reinforcement learning for automated driving. IEEE Robotics and Automation Letters, 8(2):1167–1174, 2023.   \n[9] Justin Fu, Aviral Kumar, Ofir Nachum, George Tucker, and Sergey Levine. D4rl: Datasets for deep data-driven reinforcement learning. arXiv preprint arXiv:2004.07219, 2020.   \n[10] Scott Fujimoto and Shixiang Shane Gu. A minimalist approach to offilne reinforcement learning. Advances in neural information processing systems, 34:20132–20145, 2021.   \n[11] Scott Fujimoto, Herke Hoof, and David Meger. Addressing function approximation error in actor-critic methods. In International conference on machine learning, pages 1587–1596. PMLR, 2018.   \n[12] Scott Fujimoto, David Meger, and Doina Precup. Off-policy deep reinforcement learning without exploration. In International conference on machine learning, pages 2052–2062. PMLR, 2019.   \n[13] Divyansh Garg, Joey Hejna, Matthieu Geist, and Stefano Ermon. Extreme q-learning: Maxent rl without entropy. arXiv preprint arXiv:2301.02328, 2023.   \n[14] Cong GUAN, Ke XUE, Chunpeng FAN, Feng CHEN, Lichao ZHANG, Lei YUAN, Chao QIAN, and Yang YU. Open and real-world human-ai coordination by heterogeneous training with communication. Frontiers of Computer Science, 19(4):194314, 2025.   \n[15] Siyuan Guo, Yanchao Sun, Jifeng Hu, Sili Huang, Hechang Chen, Haiyin Piao, Lichao Sun, and Yi Chang. A simple unified uncertainty-guided framework for offline-to-online reinforcement learning. arXiv preprint arXiv:2306.07541, 2023.   \n[16] Tuomas Haarnoja, Haoran Tang, Pieter Abbeel, and Sergey Levine. Reinforcement learning with deep energy-based policies. In International conference on machine learning, pages 1352–1361. PMLR, 2017.   \n[17] Tuomas Haarnoja, Aurick Zhou, Pieter Abbeel, and Sergey Levine. Soft actor-critic: Offpolicy maximum entropy deep reinforcement learning with a stochastic actor. In International conference on machine learning, pages 1861–1870. PMLR, 2018.   \n[18] Philippe Hansen-Estruch, Ilya Kostrikov, Michael Janner, Jakub Grudzien Kuba, and Sergey Levine. Idql: Implicit q-learning as an actor-critic method with diffusion policies. arXiv preprint arXiv:2304.10573, 2023.   \n[19] Ingook Jang and Seonghyun Kim. Uncertainty-driven pessimistic q-ensemble for offline-toonline reinforcement learning. In 3rd Offline RL Workshop: Offline RL as a”Launchpad”, 2022.   \n[20] Ilya Kostrikov, Ashvin Nair, and Sergey Levine. Offline reinforcement learning with implicit q-learning. In International Conference on Learning Representations, 2021.   \n[21] Aviral Kumar, Aurick Zhou, George Tucker, and Sergey Levine. Conservative q-learning for offilne reinforcement learning. Advances in Neural Information Processing Systems, 33:1179– 1191, 2020.   \n[22] Hoang Le, Cameron Voloshin, and Yisong Yue. Batch policy learning under constraints. In International Conference on Machine Learning, pages 3703–3712. PMLR, 2019.   \n[23] Seunghyun Lee, Younggyo Seo, Kimin Lee, Pieter Abbeel, and Jinwoo Shin. Offilne-to-online reinforcement learning via balanced replay and pessimistic q-ensemble. In Conference on Robot Learning, pages 1702–1712. PMLR, 2022.   \n[24] Kun Lei, Zhengmao He, Chenhao Lu, Kaizhe Hu, Yang Gao, and Huazhe Xu. Uni-o4: Unifying online and offline deep reinforcement learning with multi-step on-policy optimization. arXiv preprint arXiv:2311.03351, 2023.   \n[25] Jianxiong Li, Xiao Hu, Haoran Xu, Jingjing Liu, Xianyuan Zhan, and Ya-Qin Zhang. Proto: Iterative policy regularized offline-to-online reinforcement learning. arXiv preprint arXiv:2305.15669, 2023.   \n[26] Yicheng Luo, Jackie Kay, Edward Grefenstette, and Marc Peter Deisenroth. Finetuning from offline reinforcement learning: Challenges, trade-offs and practical solutions. arXiv preprint arXiv:2303.17396, 2023.   \n[27] Jiafei Lyu, Xiaoteng Ma, Xiu Li, and Zongqing Lu. Mildly conservative q-learning for offline reinforcement learning. Advances in Neural Information Processing Systems, 35:1711–1724, 2022.   \n[28] Yihuan Mao, Chao Wang, Bin Wang, and Chongjie Zhang. Moore: Model-based offline-toonline reinforcement learning. arXiv preprint arXiv:2201.10070, 2022.   \n[29] Yixiu Mao, Hongchang Zhang, Chen Chen, Yi Xu, and Xiangyang Ji. Supported trust region optimization for offline reinforcement learning. In International Conference on Machine Learning, pages 23829–23851. PMLR, 2023.   \n[30] Max Sobol Mark, Ali Ghadirzadeh, Xi Chen, and Chelsea Finn. Fine-tuning offline policies with optimistic action selection. In Deep Reinforcement Learning Workshop NeurIPS 2022, 2022.   \n[31] Trevor McInroe, Stefano V Albrecht, and Amos Storkey. Planning to go out-of-distribution in offline-to-online reinforcement learning. arXiv preprint arXiv:2310.05723, 2023.   \n[32] Ashvin Nair, Abhishek Gupta, Murtaza Dalal, and Sergey Levine. Awac: Accelerating online reinforcement learning with offline datasets. arXiv preprint arXiv:2006.09359, 2020.   \n[33] Mitsuhiko Nakamoto, Yuexiang Zhai, Anikait Singh, Max Sobol Mark, Yi Ma, Chelsea Finn, Aviral Kumar, and Sergey Levine. Cal-ql: Calibrated offline rl pre-training for efficient online fine-tuning. arXiv preprint arXiv:2303.05479, 2023.   \n[34] Paria Rashidinejad, Banghua Zhu, Cong Ma, Jiantao Jiao, and Stuart Russell. Bridging offilne reinforcement learning and imitation learning: A tale of pessimism. Advances in Neural Information Processing Systems, 34:11702–11716, 2021.   \n[35] John Schulman, Sergey Levine, Pieter Abbeel, Michael Jordan, and Philipp Moritz. Trust region policy optimization. In International conference on machine learning, pages 1889–1897. PMLR, 2015.   \n[36] John Schulman, Philipp Moritz, Sergey Levine, Michael Jordan, and Pieter Abbeel. Highdimensional continuous control using generalized advantage estimation. arXiv preprint arXiv:1506.02438, 2015.   \n[37] John Schulman, Filip Wolski, Prafulla Dhariwal, Alec Radford, and Oleg Klimov. Proximal policy optimization algorithms. arXiv preprint arXiv:1707.06347, 2017.   \n[38] RichardS. Sutton and AndrewG. Barto. Reinforcement learning: An introduction. IEEE Transactions on Neural Networks, page 285–286, Jan 2005.   \n[39] Shengpu Tang, Maggie Makar, Michael Sjoding, Finale Doshi-Velez, and Jenna Wiens. Leveraging factored action spaces for efficient offilne reinforcement learning in healthcare. Advances in Neural Information Processing Systems, 35:34272–34286, 2022.   \n[40] Denis Tarasov, Alexander Nikulin, Dmitry Akimov, Vladislav Kurenkov, and Sergey Kolesnikov. CORL: Research-oriented deep offline reinforcement learning library. In 3rd Offline RL Workshop: Offline RL as a ”Launchpad”, 2022.   \n[41] Chen Tessler, Daniel J Mankowitz, and Shie Mannor. Reward constrained policy optimization. arXiv preprint arXiv:1805.11074, 2018.   \n[42] Ikechukwu Uchendu, Ted Xiao, Yao Lu, Banghua Zhu, Mengyuan Yan, Joséphine Simon, Matthew Bennice, Chuyuan Fu, Cong Ma, Jiantao Jiao, et al. Jump-start reinforcement learning. In International Conference on Machine Learning, pages 34556–34583. PMLR, 2023.   \n[43] Shenzhi Wang, Qisen Yang, Jiawei Gao, Matthieu Gaetan Lin, HAO CHEN, Liwei Wu, Ning Jia, Shiji Song, and Gao Huang. Train once, get a family: State-adaptive balances for offilne-toonline reinforcement learning. In Thirty-seventh Conference on Neural Information Processing Systems, 2023.   \n[44] Jialong Wu, Haixu Wu, Zihan Qiu, Jianmin Wang, and Mingsheng Long. Supported policy optimization for offline reinforcement learning. Advances in Neural Information Processing Systems, 35:31278–31291, 2022.   \n[45] Tengyang Xie, Nan Jiang, Huan Wang, Caiming Xiong, and Yu Bai. Policy finetuning: Bridging sample-efficient offline and online reinforcement learning. Advances in neural information processing systems, 34:27395–27407, 2021.   \n[46] Haoran Xu, Li Jiang, Li Jianxiong, and Xianyuan Zhan. A policy-guided imitation approach for offilne reinforcement learning. Advances in Neural Information Processing Systems, 35:4085– 4098, 2022.   \n[47] Haoran Xu, Li Jiang, Jianxiong Li, Zhuoran Yang, Zhaoran Wang, Victor Wai Kin Chan, and Xianyuan Zhan. Offline rl with no ood actions: In-sample learning via implicit value regularization. arXiv preprint arXiv:2303.15810, 2023.   \n[48] Zishun Yu and Xinhua Zhang. Actor-critic alignment for offline-to-online reinforcement learning. In International Conference on Machine Learning, pages 40452–40474. PMLR, 2023.   \n[49] Yang Yue, Rui Lu, Bingyi Kang, Shiji Song, and Gao Huang. Understanding, predicting and better resolving q-value divergence in offline-rl. arXiv preprint arXiv:2310.04411, 2023.   \n[50] Haichao Zhang, We Xu, and Haonan Yu. Policy expansion for bridging offline-to-online reinforcement learning. arXiv preprint arXiv:2302.00935, 2023.   \n[51] Kai Zhao, Yi Ma, Jinyi Liu, Yan Zheng, and Zhaopeng Meng. Ensemble-based offilne-to-online reinforcement learning: From pessimistic learning to optimistic exploration. arXiv preprint arXiv:2306.06871, 2023.   \n[52] Yi Zhao, Rinu Boney, Alexander Ilin, Juho Kannala, and Joni Pajarinen. Adaptive behavior cloning regularization for stable offline-to-online reinforcement learning. arXiv preprint arXiv:2210.13846, 2022.   \n[53] Qinqing Zheng, Amy Zhang, and Aditya Grover. Online decision transformer. In international conference on machine learning, pages 27042–27059. PMLR, 2022. ", "page_idx": 9}, {"type": "text", "text": "", "page_idx": 10}, {"type": "text", "text": "", "page_idx": 11}, {"type": "text", "text": "", "page_idx": 12}, {"type": "text", "text": "A Detailed Data ", "text_level": 1, "page_idx": 13}, {"type": "text", "text": "Table 2: Average normalized D4RL scores of O2O methods shown in Figure 2. Outside parenthesis: scores at the end of $100\\mathrm{k}$ online steps. Inside parenthesis: the increase of that score upon the end of offline training. $\\mathbf{M}{=}1$ medium, $\\mathbf{R}{=}$ replay, $E\\!=$ expert) ", "page_idx": 13}, {"type": "table", "img_path": "XVfevb9XFx/tmp/62c990fe6b8b72907cd45e61f82646bcbfbd6256384d6378ee37ec43e2f855b3.jpg", "table_caption": [], "table_footnote": [], "page_idx": 13}, {"type": "table", "img_path": "XVfevb9XFx/tmp/1821822c0a5d9e593bfafab832c2e9ef9c44d16254e39433f6422536839ccb00.jpg", "table_caption": [], "table_footnote": [], "page_idx": 13}, {"type": "text", "text": "Compared with the baseline methods, our methods outperform much in D4RL Mujoco locomotion tasks, as showned in Table 2. We can compare the fine-tuning performance in groups based on online update way. Off2On, Cal-QL, ACA and our O2SAC are updated in the SAC way during online fine-tuning. Although there is a lack of the baseline methods that update the policy in the TD3 way, we compare our O2TD3 with a recent O2O method $\\scriptstyle\\mathrm{PROTO}+\\mathrm{TD}3$ [25] in Appendix C.4 to demonstrate the superiority of our methods. And we compare our O2PPO with the policy constraint methods AWAC, IQL and PEX, that are implemented in the IQL way, since the idea of PPO is similar to a kind of policy constraint. ", "page_idx": 13}, {"type": "text", "text": "With such groups for comparison, our methods get the best performance improvements respectively. Note that in our implementation, Off2On achieves much better performance than the original paper [23] and the implementations in other papers [48] and [50]. However, our O2SAC still outperforms it with less computational cost during online fine-tuning and less requirements for offline policy. In addition, our methods bridge different offline algorithms and three SOTA online algorithms, and permit additional modifications for improved algorithms based on the online algorithms. ", "page_idx": 13}, {"type": "text", "text": "", "page_idx": 14}, {"type": "image", "img_path": "XVfevb9XFx/tmp/1a6c2e5ec0f91f789a815f9b977b353da1538f0bbeeb13dd29739a7f92e6e122.jpg", "img_caption": ["Figure 4: Performance of our O2PPO and direct PPO from IQL on D4RL [9] MuJoCo locomotion tasks during online fine-tuning. The solid lines and shaded regions represent mean and standard deviation. "], "img_footnote": [], "page_idx": 14}, {"type": "text", "text": "Due to the low sample efficiency of PPO, we run 250,000 interaction steps for the implementation of O2PPO, which makes it unreasonable to compare the results of different O2O methods in one graph. So we demonstrate the results of O2PPO without any baseline method, but compare our method with the direct way of fine-tuning the offilne policy of IQL in the PPO way in the online phase. Note that our purpose is to achieve stable performance improvement, the efficiency depends mainly on the online algorithm, so in some environments, such as walker2d-medium-replay- $_{\\nu2}$ , the performance improvement may be less than the direct fine-tuning. This phenomenon could arise due to the critic’s capability to approximate the genuine values effectively, thereby facilitating accurate evaluation of the policy, obviating the necessity for corrective adjustments in the policy update direction. And our O2PPO uses an auxiliary advantage function to constrain the policy update, resulting in slower performance improvement. However, since we cannot judge when the critic is reliable, it is necessary to use O2PPO to achieve stable performance improvement, and there is no remarkable discrepancy between O2PPO and the direct way, although in the above scenarios. In general, our O2PPO can achieve stable and efficient performance improvement with limited interactions. ", "page_idx": 14}, {"type": "text", "text": "B Ablation Study ", "text_level": 1, "page_idx": 14}, {"type": "text", "text": "Before the analysis of ablation studies, we need to clarify the roles and applicability of the different components of our methods for different offline methods. ", "page_idx": 14}, {"type": "text", "text": "The benefit and applicability of policy re-evaluation As talked before, the purpose of policy reevaluation is to get optimistic Q-value functions, avoiding the drop of Q-value due to underestimated Q-values in offilne. Many previous works [27, 33] discussed such a problem and solve it by alleviating excessive pessimism. Our methods do not need initialize critic from offilne results, but re-evaluate the policy in the online way to get optimistic Q-value functions, which is applicable to different algorithms and avoids the performance drop caused by the drastic drop of Q-value. Note that optimistic Q-value functions obtained by policy re-evaluation may be unreasonable, especially for OOD actions, hence value alignment is needed for redress overestimated values. ", "page_idx": 14}, {"type": "text", "text": "In some policy constraint methods [32, 10], only the policy is limited to update in a region close to the dataset, but the critic is obtained in the same way as the online update. Therefore, for such offline methods, the online critic can be initialized directly by the offline one, and just need to align the values with the offline policy. In addition, policy re-evaluation can be applied to the scenarios where only the offline policy is provided, such as where the offline policy is obtained in the style of sequence modeling [6, 53, 18] or non-standard RL [46]. ", "page_idx": 15}, {"type": "text", "text": "The necessity of value alignment With the optimistic property, Q-value functions obtained in policy re-evaluation will overestimate OOD actions and induce the policy to take such actions, resulting in performance degradation. For the transition from those policy constraint methods that do not require re-evaluation of the policy, this case still holds. The purpose of value alignment is to approximate the optimistic property and suppress the Q-values of OOD actions to a reasonable estimation. For those offilne algorithms where the actor and the critic are misaligned like explicit policy constraint methods, if the constraint is removed during online fine-tuning, the critic will induce actor to align with it. However, the actor is reliable but the critic is not, so such process leads to unknown performance changes that are most likely to be worse. In addition, for algorithms induced by behavior-regularized MDP, such problem still exists because the update way between offline and online changes, leading to drastic variation of the critic. Therefore, for O2O RL, it is necessary to align the critic with the actor instead of aligning the actor with the critic. ", "page_idx": 15}, {"type": "text", "text": "The necessity of constrained fine-tuning Although we keep the optimistic property for Q-value functions and align the critic with actor, it is still challenging to achieve stable online fine-tuning. In general, most of the current offline algorithms focus on how to avoid OOD actions and train a reliable policy on the states of the dataset. Due to the optimism in online RL, OOD states and actions are inevitable, may leading to drastic performance fluctuations, which is undesirable for important scenarios especially for high-risk scenarios. Especially for OOD states, even trained well in the offilne phase, the policy still fails to output favourable actions, that may causes erroneous policy update. Therefore, for stable O2O RL, online fine-tuning with the constraint of ensuring safe exploration is necessary. ", "page_idx": 15}, {"type": "image", "img_path": "XVfevb9XFx/tmp/4d912cf4ced8a424b1c6b578873e94e3dbaa6ae078c5d42ddb0aab34100d5199.jpg", "img_caption": ["Figure 5: Ablation results of our methods, $\\mathbf{PR}{=}]$ Policy re-evaluation, $\\mathrm{{VA}=}$ Value Alignment, $\\mathrm{CF}{=}C$ onstrained Fine-tuning. For O2PPO, VA means the use of the auxiliary advantage, and CF means the update of the reference policy. "], "img_footnote": [], "page_idx": 15}, {"type": "text", "text": "The results of Figure 5 show that even with a narrow dataset e.g. hopper-expert- $\\nu2$ , our methods still achieve stable online fine-tuning. For O2SAC, the fine-tuning process without the optimistic critic reconstruction can lead a sudden performance drop at the beginning phase, e.g. in Figure 5(a), as the offline critic may be severely pessimistic. Due to the alignment of the offilne critic and the actor in CQL, using constrained fine-tuning alone can result in overall stable performance improvement, but O2SAC demonstrates a more efficient result. As for O2TD3, fine-tuning from offline directly suffers from severe performance degradation due to the mismatch of the actor and the critic in offilne training, such as in Figure 5(c). Thanks to value alignment, we can address the mismatch, thereby achieving stable performance improvement at the beginning stage. However, due to OOD states during online fine-tuning, constrained fine-tuning is necessary for the long-term stability. At last, PPO is an on-policy method that has a high data quality requirement, so it cannot improve performance if the value is incorrectly evaluated, e.g. in Figure 5(e). Through the reliable auxiliary function, our O2PPO can improve performance stably even with imperfect value evaluation. ", "page_idx": 15}, {"type": "text", "text": "", "page_idx": 16}, {"type": "text", "text": "Although our methods are universal for any offline algorithm to SAC, TD3 and PPO, some steps can be omitted according to the type of the offline algorithm. For example, for value regularization method e.g. CQL, we can only use constrained fine-tuning for stable and efficient O2O RL if the constraint term with a low coefficient has little effect on the critic, as the offline actor and critic are aligned, constrained fine-tuning is enough to combat the problem caused by the drastic jump of Q-values. And for policy constraint methods with explicit constraint e.g. $\\mathrm{TD3+BC}$ and AWAC, as talker above, the critic is evaluated in the same way as online way, so policy re-evaluation can be omitted. For other offline methods with the update way that does not match the online way, such as IQL [20], IVR [47] and $\\chi$ -QL [13], and methods induced by behavior-regularized MDP, and with special policy form decision transformer, all steps of our methods are needed for stable O2O RL. ", "page_idx": 16}, {"type": "text", "text": "C Additional Experiments ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "C.1 Difference in policy performance caused by optimistic critic reconstruction ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "Note that we use $\\pi_{\\mathrm{on}}$ as the initialization of the actor at the beginning of online fine-tuning. In accordance with our analysis, the performance of the initial policy $\\pi_{\\mathrm{on}}$ is expected to align with the characteristics of the actual offilne policy. As depicted in Table 3 from our empirical experiments, the results substantiate our analysis, revealing minimal disparities in the performance of $\\pi_{\\mathrm{on}}$ compared to the actual offilne policy. In most environments, $\\pi_{\\mathrm{on}}$ even demonstrates superior performance than the offline policy. We attribute this to the effectiveness of our min operator, which sensibly tightens the policy distribution. ", "page_idx": 16}, {"type": "table", "img_path": "XVfevb9XFx/tmp/fa654def0f0603767468f03e4fc0a0e7fb28686804a09aebb0052c0fd9ab563c.jpg", "table_caption": ["Table 3: The performance of the offline policy $\\pi_{\\mathrm{off}}$ and the policy $\\pi_{\\mathrm{on}}$ obtained after policy reevaluation and value alignment "], "table_footnote": [], "page_idx": 16}, {"type": "text", "text": "C.2 Experiments on D4RL AntMaze navigation tasks ", "text_level": 1, "page_idx": 16}, {"type": "text", "text": "For the difficult tasks of AntMaze navigation, such as medium and large environments, $\\mathrm{TD3+BC}$ is almost completely incapable of training a favourable policy [40]. Fine-tuning with the poor ", "page_idx": 16}, {"type": "text", "text": "initialization from such a policy helps little and has minor differences with training a policy from scratch, that should be the concern of hybrid learning [4], so we do not consider it. ", "page_idx": 17}, {"type": "text", "text": "Here we demonstrate the results of O2SAC and O2PPO on the the difficult tasks of AntMaze navigation, including antmaze-medium-play- $\\cdot\\nu2$ , antmaze-medium-diverse- $\\cdot\\nu2$ , antmaze-large-play- $\\nu2$ , antmaze-large-diverse- $\\cdot\\nu2$ environments. ", "page_idx": 17}, {"type": "image", "img_path": "XVfevb9XFx/tmp/4daa4827eebb840750e78c1aa695c3d0f4aba3ddf4093be54a09d4f8b1113c6e.jpg", "img_caption": ["Figure 6: The results of O2SAC on D4RL [9] AntMaze navigation tasks during online fine-tuning. The solid lines and shaded regions represent mean and standard deviation. "], "img_footnote": [], "page_idx": 17}, {"type": "image", "img_path": "XVfevb9XFx/tmp/ad77322045793b7fc358524b65c7ece21dc84803486d4a2b5bd31625081990f4.jpg", "img_caption": ["Figure 7: The results of O2PPO on D4RL [9] AntMaze navigation tasks during online fine-tuning. The solid lines and shaded regions represent mean and standard deviation. "], "img_footnote": [], "page_idx": 17}, {"type": "table", "img_path": "XVfevb9XFx/tmp/f28245f6a6416e32f08f012c7ac8d4c62661b2303fce4d619144f1bb8918a527.jpg", "table_caption": ["Table 4: Average normalized D4RL scores of our methods and some baselines on AntMaze navigation tasks. "], "table_footnote": [], "page_idx": 17}, {"type": "text", "text": "Note that here we run O2PPO with 250,000 environments steps and run O2SAC with 200,000 environments steps, while in Section 5.1, we run O2PPO with 200,000 environments steps. ", "page_idx": 17}, {"type": "text", "text": "Note that as some previous work, in our O2SAC implementation on AntMaze tasks, we do not use the double Q networks trick to avoid overly underestimation, and the threshold $\\tau$ reaches the maximum in step 100,000. ", "page_idx": 17}, {"type": "text", "text": "Since there is a lack of hyper-parameters for these tasks in many related work [48, 25, 50, 53], we do not compare the results of our methods with other methods. However, according to our simple reproduction, our methods achieve competitive results. ", "page_idx": 17}, {"type": "image", "img_path": "XVfevb9XFx/tmp/f77f2c0e950cf160be86e09ee746158f9a986621eb3aa6253b17946a7b7a14c4.jpg", "img_caption": ["Figure 8: Comparisons on different ways of updating the reference policy for O2SAC and O2TD3. "], "img_footnote": [], "page_idx": 18}, {"type": "text", "text": "C.3 Comparisons with the results of updating the reference policy update at a fixed interval ", "text_level": 1, "page_idx": 18}, {"type": "text", "text": "We set the reference policy as the optimal historical policy during online evaluations in our preceding experiments, and it indeed introduces additional testing information. However, for most of the scenarios that offilne RL focus on, this would be acceptable as a well-learned policy can be deployed directly without serious consequence due to its decent performance, e.g. in autonomous driving. ", "page_idx": 18}, {"type": "text", "text": "In addition, thanks to the abundant data, another way that does not require practical evaluation is to train a transition model that can be used to evaluate the policy by generating synthetic rollouts as the initial states are provided. Since such a methods is similar to model-based methods, we will leave it for future work. ", "page_idx": 18}, {"type": "text", "text": "If evaluation is forbidden, we can replace $\\pi_{\\mathrm{ref}}$ with a recent policy at a fixed interaction interval. The Corollary 4.3. still holds because the policy performance will be almost certainly improved with a long interaction interval, especially compared to the last reference policy. Considering that the policy performance is most likely to fluctuate in the beginning stage during online fine-tuning, we can set a large update interval for this stage and a small update interval for the subsequent stage, or reduce the threshold change range. ", "page_idx": 18}, {"type": "text", "text": "We experiment our methods with a given update interval on D4RL Mujoco locomotion tasks and compare the results with those of the methods with the optimal reference policy, shown as Figure 8 and Figure 9. Without special hyper-parameter optimization, we just update the reference policy per 1000 steps for most environments, but for hopper-medium-expert- $\\nu2$ and hopper-expert- $\\nu2$ , we update the reference policy per 10000 steps, and as well as for walker2d-expert-v2 in O2TD3, because these datasets are narrow, making it easy for the policy to suffer from OOD states and actions. With an appropriate interval, the policy performance can achieve competitive improvement when compared with the methods with the optimal reference policy. Policy re-evaluation and Value alignment guarantee the smoothing and stable performance improvement at the beginning stage, and constrained fine-tuning is necessary for the stability of the subsequent stage. Although in hopper-medium- $\\nu2$ , O2SAC with a fixed update interval suffers from the performance degradation at the latter stage, because the threshold is large and the Lagrange multiplier $\\lambda$ is low, the lack of constraint on the policy update in the reliable region. This phenomenon can easily be amended by reducing the threshold change range. ", "page_idx": 18}, {"type": "image", "img_path": "XVfevb9XFx/tmp/756bfb96facce5f711f30201d4cc3f9713f733d04240f5fb7f856607441e0450.jpg", "img_caption": ["Figure 9: Comparisons on different ways of updating the reference policy for O2PPO. "], "img_footnote": [], "page_idx": 19}, {"type": "text", "text": "C.4 Comparisons with PROTO ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "In the absence of O2O methods on the deterministic policy, we compare our methods with PROTO [25], a recent O2O method that supports fine-tuning from an offline policy for both the stochastic and the deterministic policy. We reproduce the code of PROTO in Pytorch for the initialization of the policies derived from CQL and $\\mathrm{TD}3\\substack{+\\mathrm{BC}}$ , and set all hyper-parameters as in the official paper [25]. As shown in Figure 10, our methods demonstrate significant superiority in both stability and effectiveness, especially for the deterministic policy. ", "page_idx": 19}, {"type": "text", "text": "C.5 Comparisons on initialization of different offline methods ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "We conducted some experiments for O2SAC with the initialization of different offline methods, including CQL, IQL and ODT. The results are shown in Figure 11. The initial performance of O2SAC initialized from ODT is lower than others since the simple behavior cloning (we directly maximize the likelihood of the actions output by offilne ODT while keeping an appropriate entropy) could harm the performance, as discussed in Appendix I. But in hopper-medium-v2, the performance improves quickly. We analyze that by the constraint, the policy can recover the offline performance (about 97 normalized score of ODT), as the output of the cloned policy is near the ODT policy. The results demonstrate that our methods are suitable for any offline algorithm, even the policies are heterogeneous. ", "page_idx": 19}, {"type": "text", "text": "C.6 Accelerate learning with sample-efficient RL ", "text_level": 1, "page_idx": 19}, {"type": "text", "text": "An additional benefit of our methods is their straightforward compatibility with sample-efficient online RL algorithms. Since we only add a constraint that can be considered as part of the reward, the policy iteration process remains consistent with the normal online approach, which makes it feasible to incorporate techniques from advanced efficient RL algorithms. Drawing from [4], we conducted some experiments using a high UTD ratio of 10 (but still update the lagrangian multiplier once per step) and achieved better performance improvements, as shown in Figure 12. ", "page_idx": 19}, {"type": "image", "img_path": "XVfevb9XFx/tmp/328dafcad3f7e63f1767ce8e8fc6814a091a7487adafd5b3e562e213716ee6d2.jpg", "img_caption": ["Figure 10: Comparison with PROTO and PROTO+TD3 [25] on D4RL [9] MuJoCo locomotion tasks during online fine-tuning. The solid lines and shaded regions represent mean and standard deviation. "], "img_footnote": [], "page_idx": 20}, {"type": "image", "img_path": "XVfevb9XFx/tmp/12e11455ebdd6f6efc385d77448ee6067577a865ab7bf4c099b972b3d6a25456.jpg", "img_caption": ["Figure 11: Comparison with PROTO and PROTO+TD3 [25] on D4RL [9] MuJoCo locomotion tasks during online fine-tuning. The solid lines and shaded regions represent mean and standard deviation. "], "img_footnote": [], "page_idx": 20}, {"type": "text", "text": "C.7 Computational cost for each component ", "text_level": 1, "page_idx": 20}, {"type": "text", "text": "We conducted an experiment on hopper-medium- $\\cdot\\nu2$ environment using the O2SAC method and listed the time cost for different phases in Table 5, evaluated on an Nvidia 3070 GPU. ", "page_idx": 20}, {"type": "table", "img_path": "XVfevb9XFx/tmp/c6cefa91c6448fdb2bb0be436cd0e87aeee9aafc0a50f9e11c5315c20c275618.jpg", "table_caption": ["Table 5: Computational cost for each component of O2SAC "], "table_footnote": [], "page_idx": 20}, {"type": "image", "img_path": "XVfevb9XFx/tmp/63247dbdf802805c1306f7ba30057c86026a8a5d54bb917476da7aa240511842.jpg", "img_caption": ["Figure 12: Comparison with PROTO and PROTO $1+\\Gamma\\mathrm{D}3$ [25] on D4RL [9] MuJoCo locomotion tasks during online fine-tuning. The solid lines and shaded regions represent mean and standard deviation. "], "img_footnote": [], "page_idx": 21}, {"type": "text", "text": "In policy re-evaluation, since the policy is fixed and the re-evaluation of the critic is straightforward, the computational cost of re-evaluation is significantly lower than that of offline learning. The time cost of value alignment is somewhat higher but still less than that of the offline phase. In fact, the time cost is approximately proportional to the offilne phase according to the alignment steps, since both the actor and critic are updated in the value alignment phase. ", "page_idx": 21}, {"type": "text", "text": "However, it is worth noting that although we set the training steps for value alignment at $500\\mathrm{k}$ , in some environments, only a few alignment steps are needed to calibrate the critic with the offline actor, as shown in Fig. 1 and Fig. 11. Only in antmaze environments, where it is hard for the critic to capture the sparse reward signal, more alignment steps are necessary. Additionally, in constrained fine-tuning, since only the lagrangian multiplier is added to be updated and the interaction cost dominates, the time cost increases very little. ", "page_idx": 21}, {"type": "text", "text": "Moreover, in O2O RL, we are typically not concerned about the time cost in the offline process, as different offilne methods take different amounts of time. Instead, we prioritize the cost of interactions during online fine-tuning. Our method re-evaluates and aligns the critic with the offline actor solely within the offline dataset, making the time cost less critical. ", "page_idx": 21}, {"type": "text", "text": "D Related Work ", "text_level": 1, "page_idx": 21}, {"type": "text", "text": "Unified algorithms for offilne-to-online Many offilne algorithms are unified across phases in O2O RL [32, 20, 13, 43, 44], who share the common philosophy of designing an RL algorithm that is suitable for both offilne and online phases and then the network parameters trained in the offilne phase can be reused for further learning in the online phase. Most of them are policy constraint methods which learn policy without querying OOD samples [20, 43] or penalize action probabilities of them by an explicit estimation of behavior policy [44], which is beneficial for offline performance but limits efficient performance improvements in online fine-tuning, as talked about in [33]. For explicit policy constraint, recent works focus on how to make the constraint adaptive [52, 26] or loosen it gradually [5]. Although such algorithms achieve great performance in offilne phase, there is a lack of research on from such algorithms to more efficient online algorithms. ", "page_idx": 21}, {"type": "text", "text": "Efficient online fine-tuning Some recent works aim to online fine-tune efficiently with optimistic exploration. [15] propose a unified uncertainty-guided framework to explore optimistically in online fine-tuning phase and keep the offilne constraint for OOD actions to avoid erroneous update. [30] and [51] utilize ensemble Q-learning to alleviate distribution shift, and implement optimistic exploration by some approaches about ensemble in online RL. For model-based O2O RL, [31] explores regions with high uncertainty and returns in learned model. [42] and [50] concatenate different offline and online algorithms by resetting a new online policy learning from the offline policy gradually, where optimistic exploration is implemented by the new policy. With a given policy and dataset, [3] focus how to recover the performance of the policy rapidly, whose setting is suitable for our method too. ", "page_idx": 21}, {"type": "text", "text": "Stable online fine-tuning As offline RL works for some important scenarios with high risk, the stable performance is considerable for O2O RL. After [23] put forward distribution shift problem in O2O RL which is alleviated by pessimistic Q-ensemble and balanced replay proposed by them, many methods are proposed to combat this problem. From offline to SAC, [33] mitigates the penalty for ", "page_idx": 21}, {"type": "text", "text": "OOD actions in CQL and calibrates Q-values of them by Monte Carlo returns, while [48] reconstructs Q-functions aligned with offline policy. [25] also induces KL divergence to policy objective, which is about current policy and the policy at the last iteration to perform a trust-region-style update, but the performance will drop suddenly at the beginning of online fine-tuning. [19] and [28] utilize environment dynamics model ensemble to obtain uncertainty to penalty OOD actions. ", "page_idx": 22}, {"type": "text", "text": "E Detailed Discussions about Mismatch in SOTA Offline Algorithms ", "text_level": 1, "page_idx": 22}, {"type": "text", "text": "CQL For common implementation of CQL, [21] do not specify exactly how $\\pi_{k}$ is updated but only provide properties on the policy $\\exp(f_{k}(s,a)/Z(s))$ like SAC. In this way, the actor of CQL is only related to the critic, and the action probability is directly proportional to $Q(s,a)$ like online RL. However, as the conservative policy evaluation operator used to update the Q-function (according to [21] Appendix C, equation 13), the policy is not only related to rewards, but also related to the distribution of behavior policy. The conservative policy evaluation operator in CQL is: ", "page_idx": 22}, {"type": "equation", "text": "$$\nQ(s,a)=B^{\\pi}Q(s,a)-\\alpha[\\frac{\\mu(a|s)}{\\pi_{\\beta}(a|s)}-1]\n$$", "text_format": "latex", "page_idx": 22}, {"type": "text", "text": "where $B^{\\pi}$ is the standard Bellman operator $B^{\\pi}Q(s,a)=r(s,a)+\\gamma\\mathbb{E}_{s^{\\prime}\\sim P(\\cdot|s,a)}[V(s^{\\prime})]$ and ", "page_idx": 22}, {"type": "equation", "text": "$$\nV(s)=\\mathbb{E}_{a\\sim\\pi(\\cdot|s)}[Q(s,a)]\n$$", "text_format": "latex", "page_idx": 22}, {"type": "text", "text": "If we define $Q_{o}$ as the Q-function derived from Eq. (1), which satisfies: ", "page_idx": 22}, {"type": "equation", "text": "$$\nQ_{o}(s,a)=B^{\\pi}Q_{o}(s,a)\n$$", "text_format": "latex", "page_idx": 22}, {"type": "text", "text": "Therefore, the relationship of conservative $V(s)$ in CQL and $Q_{o}(s,a)$ is: ", "page_idx": 22}, {"type": "equation", "text": "$$\nV(s)=\\mathbb{E}_{a\\sim\\pi(\\cdot|s)}[Q_{o}(s,a)-\\alpha[\\frac{\\mu(a|s)}{\\pi_{\\beta}(a|s)}-1]]\n$$", "text_format": "latex", "page_idx": 22}, {"type": "text", "text": "The objective of policy is to maximize $V(s)$ , so compared with online RL, there is a difference in learning objective due to pessimism. In fact, drawing from SAC, we can derive the objective of CQL: ", "page_idx": 22}, {"type": "equation", "text": "$$\n\\operatorname*{max}_{\\pi}\\mathbb{E}[\\sum_{t=0}^{\\infty}\\gamma^{t}(r(s_{t},a_{t})-\\alpha[\\frac{\\mu(a_{t}|s_{t})}{\\pi_{\\beta}(a_{t}|s_{t})}-1])]\n$$", "text_format": "latex", "page_idx": 22}, {"type": "text", "text": "which is in according with behavior-regularized MDP proposed by [47] at $f(x)\\,=\\,x\\,-\\,1$ . The conservative policy objective causes pessimistic $Q\\cdot$ -values estimation, hence in online fine-tuning, the change of policy objective leads to drastic $\\mathrm{{Q}}.$ -values jump and performance degeneration. ", "page_idx": 22}, {"type": "text", "text": "IQL As expectile regression used to estimate expectiles of the state value function with respect to random actions, $\\bar{Q}(s,a)$ and $V(s)$ are not induced by the policy $\\pi$ , and we denote them as $Q^{\\mu}(s,a)$ and $V^{\\mu}(s)$ , where $\\mu$ represents a special policy related to the expectile regression [18]. With initialization of such $Q^{\\mu}(s,a)$ and $V^{\\mu}(s)$ in online fine-tuning phase, if we update the actor and the critic in online algorithm, the actor update will tends to $\\mu$ at the beginning, which causes unknown performance change because the performance of $\\nu$ is unknown. And usually the performance will deteriorate significantly the probability of a satisfactory policy $\\nu$ is low. ", "page_idx": 22}, {"type": "text", "text": "On the other hand, the work of [47] reveals that the optimal critic of IQL can be derived from behavior-regularized MDP at $f(x)=\\log(x)$ . Meanwhile, the update of actor is derived from return maximization with a KL divergence constraint, it is easily to discovery that the learned policy is relevant to dataset. Therefore, the O2O RL for IQL still suffers from the problem of policy objective change. And compared with value regularization methods, there is not only pessimistic estimation problem but also initial misalignment problem, which means offline actor cannot be derived from offilne critic in online update way. In fact, in offilne RL, the policy update function is to maximize Eq. (9), which is highly related to behavior policy as $\\alpha$ is a fixed hyper-parameter. If 1 is directly used to fine-tune policy, the policy will tends to be only proportional to $Q(s,a)$ of offline critic, hence the policy performance will drop sharply with a great probability. ", "page_idx": 22}, {"type": "text", "text": "$\\mathbf{TD3+BC}$ With a explicit constraint of policy update, the improvement mismatch is obvious: the critic update follows the Bellman backup, but the actor update does not only follow $\\mathrm{^Q}$ -values maximization, that constrains the actor only update in a region close to the dataset. A little different from the mismatch in IQL, $\\mathrm{TD3+BC}$ does not suffer from pessimistic estimation since the critic is updated in an optimistic way as the online way, but such improvement mismatch still leads to performance drop. The probability of action with the largest Q-value may be not largest, as talked about in [48], which is not in according with online RL and leads to erroneous update to destroy performance at the beginning of online fine-tuning. Such improvement mismatch exists in almost all explicit constraint methods, but their critics are optimistic because the update ways is the same as online RL, so value alignment is necessary for O2O RL from such offline methods. ", "page_idx": 22}, {"type": "text", "text": "", "page_idx": 23}, {"type": "text", "text": "F Proof ", "text_level": 1, "page_idx": 23}, {"type": "text", "text": "Proof of Corollary 4.2 The theoretical analysis about FQE can be found in Theorem 4.2 of [22] or Theorem 4.9 of [29], here we use the latter result. Full proof is similar to the proof of [29], but a little different from [29], we fix the evaluated policy as the offline policy. ", "page_idx": 23}, {"type": "text", "text": "Here we simply show the proof process and emphasis the difference, see [29] for more details. Since FQE deals with the following regression problem ", "page_idx": 23}, {"type": "equation", "text": "$$\nQ_{k}\\gets\\operatorname*{arg\\,min}_{Q\\in F}\\sum_{i=1}^{|\\mathcal{D}|}[Q(s_{i},a_{i})-r_{i}-\\gamma Q_{k-1}(s_{i}^{\\prime},\\pi(s_{i}^{\\prime}))]^{2},\n$$", "text_format": "latex", "page_idx": 23}, {"type": "text", "text": "we can have ", "page_idx": 23}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{|r_{i}+\\gamma Q_{k-1}(s_{i}^{\\prime},\\pi(s_{i}^{\\prime}))|\\le1+\\gamma\\bar{V}\\le2\\bar{V}}\\\\ &{|T^{\\pi}Q_{k-1}(s,a)|=|r(s,a)+\\gamma\\mathbb{E}_{s^{\\prime}\\sim P(\\cdot|s,a)}Q_{k-1}(s^{\\prime},\\pi(s^{\\prime}))|\\le1+\\gamma\\bar{V}\\le2\\bar{V}}\\end{array}\n$$", "text_format": "latex", "page_idx": 23}, {"type": "text", "text": "With the inherent Bellman evaluation error $d_{F}^{\\pi}$ , we can apply least squares generalization bound here (Lemma A.11 in [2]). With probability at least $1-\\delta$ , we have ", "page_idx": 23}, {"type": "equation", "text": "$$\n\\|Q_{k}-T^{\\pi}Q_{k-1}\\|_{2,\\rho^{\\beta}}^{2}\\leq\\frac{22\\bar{V}^{2}\\log(|\\mathcal{F}|/\\delta)}{|\\mathcal{D}|}+20d_{F}^{\\pi}\n$$", "text_format": "latex", "page_idx": 23}, {"type": "text", "text": "Note that here we fix the policy $\\pi$ as the offline policy, that means for a given $Q_{0},\\,Q_{k-1}$ is welldetermined, so we do not need to apply a union bound over all possible $Q_{k-1}$ . ", "page_idx": 23}, {"type": "text", "text": "Then we first bound $\\|Q_{k}-Q^{\\pi}\\|_{2,d_{t}^{\\pi}\\times\\pi}$ as the same as [29] did. ", "page_idx": 23}, {"type": "equation", "text": "$$\n\\begin{array}{r l}{|Q_{k}-Q^{\\pi}\\|_{2,d_{t}^{\\pi}\\times\\pi}=\\|Q_{k}-\\mathcal T^{\\pi}Q_{k-1}+\\mathcal T^{\\pi}Q_{k-1}-Q^{\\pi}\\|_{2,d_{t}^{\\pi}\\times\\pi}}&{}\\\\ {\\quad\\quad\\quad\\leq\\|Q_{k}-\\mathcal T^{\\pi}Q_{k-1}\\|_{2,d_{t}^{\\pi}\\times\\pi}+\\|\\mathcal T^{\\pi}Q_{k-1}-Q^{\\pi}\\|_{2,d_{t}^{\\pi}\\times\\pi}}\\\\ {\\quad\\quad\\quad\\leq\\sqrt{C}\\|Q_{k}-\\mathcal T^{\\pi}Q_{k-1}\\|_{2,\\mu}+\\|\\mathcal T^{\\pi}Q_{k-1}-\\mathcal T^{\\pi}Q\\|_{2,d_{t}^{\\pi}\\times\\pi}\\ (\\mathrm{Assumption~4.1})}\\\\ {\\quad\\quad\\quad=\\sqrt{C\\epsilon}+\\sqrt{\\mathbb{E}_{(s,a)\\sim d_{t}^{\\pi}\\times\\pi}[\\gamma]_{\\underline{{s}}^{\\prime}\\sim P(\\cdot|s,a),a^{\\prime}\\sim\\pi(\\cdot|s^{\\prime})}(Q_{k-1}(s^{\\prime},a^{\\prime})-Q^{\\pi}(s^{\\prime},a^{\\prime}))]^{2}}}\\\\ {\\quad\\quad\\quad\\leq\\sqrt{C\\epsilon}+\\gamma\\sqrt{\\mathbb{E}_{(s,a)\\sim d_{t}^{\\pi}\\times\\pi,s^{\\prime}\\sim P(\\cdot|s,a),a^{\\prime}\\sim\\pi(\\cdot|s^{\\prime})}(Q_{k-1}(s^{\\prime},a^{\\prime})-Q^{\\pi}(s^{\\prime},a^{\\prime}))^{2}}}\\\\ {\\quad\\quad\\quad=\\sqrt{C\\epsilon}+\\gamma\\|Q_{k-1}-Q^{\\pi}\\|_{2,d_{t}^{\\pi}\\times\\pi}}\\end{array}\n$$", "text_format": "latex", "page_idx": 23}, {"type": "text", "text": "The fifth derivation uses Jensen’s inequality. With ", "page_idx": 23}, {"type": "equation", "text": "$$\n\\|Q_{K}-Q^{\\pi}\\|_{2,d_{t}^{\\pi}\\times\\pi}\\leq\\sum_{k=0}^{K-1}\\gamma^{k}\\sqrt{C\\epsilon}+\\gamma^{K}\\|Q_{0}-Q^{\\pi}\\|_{2,d_{t}^{\\pi}\\times\\pi}\\leq\\frac{1-\\gamma^{K}}{1-\\gamma}\\sqrt{C\\epsilon}+\\gamma^{K}\\bar{V}\n$$", "text_format": "latex", "page_idx": 23}, {"type": "text", "text": "Therefore ", "page_idx": 24}, {"type": "equation", "text": "$$\n\\begin{array}{r l}{Q^{\\nu}-\\bar{Q}^{\\nu_{1}}=Q^{\\nu_{1}}(x)(K-\\infty)}\\\\ {\\leq\\bar{Q}(2{\\kappa}-Q^{\\nu_{1}})[2{\\kappa}-{\\kappa}(\\log\\kappa)\\arctan\\mathrm{idty})}\\\\ {=\\sqrt{{\\kappa}_{2}{\\kappa}_{3}\\mathord{\\left(\\kappa+\\kappa_{2}\\right)}}\\mathord{\\left(\\kappa+\\kappa_{3}-\\kappa_{1}\\right)}Q^{\\nu_{1}}(x,\\omega)-Q^{\\nu_{1}}(x,\\omega)]}\\\\ {=\\sqrt{\\sum_{\\kappa}(1-\\gamma)}\\sum_{i=0}^{\\infty}{\\gamma}\\frac{\\gamma_{\\kappa}q^{i}\\gamma_{i}\\left(\\kappa+\\kappa_{1}\\right)}{\\kappa}\\simeq\\pi(\\bar{\\kappa})\\beta({\\kappa},\\omega)-Q^{\\nu_{1}}(x,\\omega)\\right|}\\\\ {=\\sqrt{{\\kappa}-\\gamma}\\sum_{i=0}^{\\infty}\\gamma_{-\\kappa}^{-\\kappa}\\pi^{i}(\\nu)\\sum_{\\pi}\\alpha(\\alpha)|Q_{\\kappa}(s,\\omega)-Q^{\\nu_{1}}(s,\\omega)|}\\\\ {=\\sqrt{{\\kappa}-\\gamma}\\sum_{i=0}^{\\infty}\\gamma_{-\\kappa}^{-\\kappa}\\pi^{i}(\\nu)\\sum_{\\alpha=1}^{\\infty}\\alpha}\\\\ {=\\sqrt{{(1-\\gamma)}\\sum_{i=0}^{\\infty}\\gamma_{-\\kappa}^{-\\kappa}\\left(10\\kappa-Q^{\\nu_{1}}\\right)_{2,\\alpha,\\alpha=1}}}\\\\ {\\leq\\sqrt{{(1-\\gamma)}\\sum_{i=0}^{\\infty}\\gamma_{-\\kappa}^{-\\kappa}\\left(1-\\gamma^{\\kappa}\\sqrt{C_{1}}+\\gamma\\kappa\\bar{\\gamma}\\right)^{2}}}\\\\ {=\\frac{1-\\gamma^{\\kappa}}{1-\\gamma^{-\\kappa}}\\sqrt{C_{1}}+\\gamma\\kappa_{1}^{\\kappa}\\gamma}\\end{array}\n$$", "text_format": "latex", "page_idx": 24}, {"type": "text", "text": "Proof of Proposition $4.3\\ \\mathrm{We}$ define $Q_{\\mathrm{fqe}}(s,a)$ as the state-action values for some actions after the process of policy re-evaluation and lower than the calibrated value, i.e. $Q_{\\mathrm{fqe}}(s,a)\\,\\leq\\,Q(s,\\dot{a})\\,-$ $\\dot{\\alpha}\\left(\\log\\pi_{\\mathrm{off}}\\left(\\dot{\\bar{a}}\\vert s\\right)-\\log\\pi_{\\mathrm{off}}\\left(a\\vert s\\right)\\right)$ . With the min operator in Eq. (12), we can divide actions into two categories, calibrated actions or standard actions. The former refer to those actions with $Q\\cdot$ -values to be calibrated, and the latter refer to those actions with unchanged Q-values since they are lower than the calibrated values. We denote them as $a_{c a l}$ and $a_{f q e}$ respectively. ", "page_idx": 24}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{V_{\\mathrm{align}}(s)=\\mathbb{E}_{a\\sim\\pi_{\\mathrm{off}}(\\cdot\\,|s)}[Q_{\\mathrm{align}}(s,a)-\\alpha\\log\\pi_{\\mathrm{off}}(a\\vert s)]}\\\\ &{\\quad\\quad\\quad\\quad=\\sum_{\\pi\\mathrm{off}}(a\\vert s)[Q_{\\mathrm{align}}(s,a)-\\alpha\\log\\pi_{\\mathrm{off}}(a\\vert s)]}\\\\ &{\\quad\\quad\\quad\\quad=\\sum_{\\pi\\mathrm{off}}(a_{c a l}\\vert s)[Q_{c a l}(s,a_{c a l})]+\\sum_{\\pi\\mathrm{off}}(a_{f q e}\\vert s)[Q_{f q e}(s,a_{f q e})]+}\\\\ &{\\quad\\quad\\quad\\quad\\sum_{\\pi\\mathrm{off}}(a\\vert s)[-\\alpha\\log\\pi_{\\mathrm{off}}(a\\vert s)]}\\end{array}\n$$", "text_format": "latex", "page_idx": 24}, {"type": "text", "text": "Due to the min operator, for standard actions $a_{f q e}$ , the calibrated Q-values satisfy $Q_{f q e}(s,a_{f q e})\\le$ $Q_{c a l}(s,a_{f q e})$ , therefore ", "page_idx": 24}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{V_{\\hat{a}}(s)=Q(s,\\dot{a})-\\alpha\\log\\pi\\left(a\\vert s\\right)}\\\\ &{\\qquad=\\displaystyle\\sum\\pi_{\\mathrm{off}}(a\\vert s)[Q_{c a l}(s,a)-\\alpha\\log\\pi_{\\mathrm{off}}(a\\vert s)]}\\\\ &{\\qquad\\ge\\displaystyle\\sum\\pi_{\\mathrm{off}}(a_{c a l}\\vert s)[Q_{c a l}(s,a_{c a l})]+\\sum\\pi_{\\mathrm{off}}(a_{f q e}\\vert s)[Q_{f q e}(s,a_{f q e})]+}\\\\ &{\\qquad\\displaystyle\\sum\\pi_{\\mathrm{off}}(a\\vert s)[-\\alpha\\log\\pi_{\\mathrm{off}}(a\\vert s)]}\\\\ &{\\qquad=V_{\\mathrm{align}}(s)}\\end{array}\n$$", "text_format": "latex", "page_idx": 24}, {"type": "text", "text": "On the other hand, it is easy to see that $Q_{\\mathrm{fqe}}(s,a_{\\mathrm{fqe}})\\!-\\!\\alpha\\log\\pi\\left(a_{\\mathrm{fqe}}|s\\right)\\leq Q_{\\mathrm{cal}}(s,a_{\\mathrm{cal}})\\!-\\!\\alpha\\log\\pi\\left(a_{\\mathrm{cal}}|s\\right)\\!,$ so ", "page_idx": 24}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{V_{\\mathrm{fqe}}(s)=Q_{\\mathrm{fqe}}(s,a_{\\mathrm{fqe}})-\\alpha\\log\\pi\\left(a_{\\mathrm{fqe}}\\middle|s\\right)}\\\\ &{\\qquad\\quad\\leq\\sum_{\\mathrm{0ff}}(a_{f q e}\\middle|s)[Q_{\\mathrm{fqe}}(s,a_{\\mathrm{fqe}})-\\alpha\\log\\pi_{\\mathrm{off}}\\left(a_{\\mathrm{fqe}}\\middle|s\\right)]+}\\\\ &{\\qquad\\quad\\sum_{\\mathrm{0ff}}(a_{c a l}\\middle|s)[Q_{\\mathrm{cal}}(s,a_{\\mathrm{cal}})-\\alpha\\log\\pi_{\\mathrm{off}}\\left(a_{\\mathrm{cal}}\\middle|s\\right)]}\\\\ &{\\qquad=V_{\\mathrm{align}}(s)}\\end{array}\n$$", "text_format": "latex", "page_idx": 24}, {"type": "text", "text": "So $V_{\\mathrm{fqe}}(s)\\leq V_{\\mathrm{align}}(s)\\leq V_{\\dot{a}}(s)$ , i.e. Proposition 4.3 is proved. ", "page_idx": 24}, {"type": "text", "text": "Proof of Proposition 4.4 With simplicity, we consider the term of the auxiliary advantage function without probability ratio clipping ", "page_idx": 25}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{-\\underset{s\\sim R a\\sim\\pi\\theta_{\\theta_{k}}(\\cdot\\vert s)}{\\mathbb{E}}[\\frac{\\pi_{\\theta}}{\\pi_{\\theta_{k}}}A_{\\alpha}(s,a)]=-\\underset{s\\sim R a\\sim\\pi\\theta(\\cdot\\vert s)}{\\mathbb{E}}[A_{\\alpha}(s,a)]}\\\\ &{\\qquad\\qquad=-\\underset{s\\sim R}{\\mathbb{E}}\\sum\\pi_{\\theta}(a\\vert s)A_{\\alpha}(s,a)}\\\\ &{\\qquad\\qquad=\\beta\\underset{s\\sim R}{\\mathbb{E}}[-\\sum\\pi_{\\theta}(a\\vert s)\\log\\pi_{\\mathrm{ref}}(a\\vert s)-\\sum\\pi_{\\theta}(a\\vert s)\\mathcal{H}(\\pi_{\\mathrm{ref}}(\\cdot\\vert s)]}\\\\ &{\\qquad\\qquad=\\beta\\underset{s\\sim R}{\\mathbb{E}}[C E L o s s(\\pi_{\\theta}(\\cdot\\vert s),\\pi_{\\mathrm{ref}}(\\cdot\\vert s))-\\mathcal{H}(\\pi_{\\mathrm{ref}}(\\cdot\\vert s))\\sum\\pi_{\\theta}(a\\vert s)]}\\\\ &{\\qquad\\qquad=\\beta C E L o s s(\\pi_{\\theta},\\pi_{\\mathrm{ref}})+C}\\end{array}\n$$", "text_format": "latex", "page_idx": 25}, {"type": "text", "text": "Therefore, the term of the auxiliary advantage function regularizes the policy update near the reference policy, thereby ensuring reliable update even with inaccurate value estimation. And at the beginning of online fine-tuning, the reference policy is initialized from $\\pi_{\\mathrm{off}}$ . ", "page_idx": 25}, {"type": "text", "text": "Proof of Corollary 4.5 Since our constrained fine-tuning method solves a constrained MDP problem by the method in [41], Theorem 2 in [41] still holds in our method, which can be described as With the constraint satisfied, RCPO algorithm converges almost surely to a fixed point $(\\theta^{*}(\\mu^{*},\\lambda^{*}),\\mu^{*}(\\lambda^{*}),\\lambda^{*})$ . ", "page_idx": 25}, {"type": "text", "text": "Such theorem guarantees the convergence of RCPO, and with the our proposed constraint, we can utilize contradiction to proof Corollary 4.5. ", "page_idx": 25}, {"type": "text", "text": "Assumption According to the convergence of RCPO, we can assume the convergent point $(\\theta^{*}(\\mu^{*},\\stackrel{-}{\\lambda^{*}}),\\mu^{*}(\\lambda^{*}),\\lambda^{*})$ with $\\lambda^{\\ast}\\neq0$ . ", "page_idx": 25}, {"type": "text", "text": "Derivation As the constraint is $\\mathbb{E}_{\\pi}[f(\\pi(a_{t}|s_{t}),\\pi_{\\mathrm{ref}}(a_{t}|s_{t}))]<\\alpha$ and $\\pi_{\\mathrm{ref}}$ is the best one among old policies during online evaluations, $\\pi_{\\mathrm{ref}}=\\pi^{*}$ when the algorithm converges, so the constraint term tends to $-\\alpha$ . According to the update function Eq. (20) of $\\lambda$ , $\\lambda$ tends to be reduced, which is in contradiction to the Assumption. Therefore, $\\lambda^{*}=0$ when the algorithm converges. ", "page_idx": 25}, {"type": "text", "text": "Meanwhile, when $\\lambda^{*}=0$ , the constraint is removed, hence the $\\pi^{*}$ and $Q^{*}$ are the same with the optimal results in the MDP without constraint, which means our method converges the optimal point like online RL but keeps stable improvement. ", "page_idx": 25}, {"type": "text", "text": "G Algorithm Details ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "G.1 O2SAC ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "the choice of $\\alpha$ ", "text_level": 1, "page_idx": 25}, {"type": "text", "text": "Although $\\alpha$ is generally smaller than 1 after offline training, as we use the energy policy to align critic with actor, a small $\\alpha$ has no influence on the recovery of offline policy but leads to a wide distribution for policy, which means the policy modeled by Gaussian distribution has a large standard deviation, which is harmful for online exploration. If the standard deviation is large, some OOD actions may be taken and dangerous state may arise during online exploration, which dose not suit the setting of high risk scenarios and affects favourable performance. Therefore we choose a suitable $\\alpha$ which is smaller than 1 but not excessively small. For Mujoco locomotion tasks, we determine that alpha is 0.2 for the dataset with medium quality, and is 0.5 for the dataset with expert quality, because small standard deviation induced by a large $\\alpha$ is advantageous for online exploration of well trained policy. For AntMaze navigation tasks, without more contrast experiments, we simply determine that alpha is 0.2 for all dataset. ", "page_idx": 25}, {"type": "image", "img_path": "XVfevb9XFx/tmp/c25d980a5f5d514ee8a76e8e13860b93b1e7a0ae94a5b027cc53bad64d3d076f.jpg", "img_caption": ["Figure 13: Policy performance during value alignment with different $\\alpha$ "], "img_footnote": [], "page_idx": 25}, {"type": "text", "text": "", "page_idx": 25}, {"type": "text", "text": "Moreover, as we use min operator for value alignment, the limit for $\\alpha$ is not so strict. If Q-values induced by policy re-evaluation is smaller than alignment objective, as a Gaussian distribution is used to fit energy policy, such Q-values will leads to a smaller standard deviation. ", "page_idx": 26}, {"type": "text", "text": "Note that the choice of $\\alpha$ has no effect on the recovery of offline policy, as shown in Figure 13. ", "page_idx": 26}, {"type": "text", "text": "policy re-evaluation As talked about Section 4.1, with a given $\\alpha$ , online policy evaluation of SAC Eq. (3) can be used to policy re-evaluation to obtain an optimistic critic. ", "page_idx": 26}, {"type": "text", "text": "value alignment In Section 4.2, the value alignment method to O2SAC has been described in detail. In brief, we use online policy improvement Eq. (2) to get the actions which have overestimated Q-values, and use Eq. (13) to inhibit their Q-values to a reliable value calculated by maximum entropy RL. ", "page_idx": 26}, {"type": "text", "text": "According to the min operator, there is no change if Q-values induced by policy re-evaluation is smaller than alignment objective, so our value alignment method not only aligns Q-values with actor but also is as consistent with the results of online evaluation as possible, which reduces Bellman error in online fine-tuning to keep Q-values more stable. ", "page_idx": 26}, {"type": "text", "text": "constrained fine-tuning For O2SAC, the constraint is KL divergence, and the policy objective of CMDP in O2O RL is: ", "page_idx": 26}, {"type": "equation", "text": "$$\n\\operatorname*{max}\\mathbb{E}_{\\pi}[\\sum_{t=0}^{\\infty}\\gamma_{t}(r_{t}(s_{t},a_{t})+\\alpha H(\\pi(\\cdot|s_{t})))]\\qquad\\mathrm{s.t.}\\;\\mathbb{E}_{\\pi}[\\log(\\frac{\\pi(a_{t}|s_{t})}{\\pi_{\\mathrm{ref}}(a_{t}|s_{t})})]<\\tau\n$$", "text_format": "latex", "page_idx": 26}, {"type": "text", "text": "And corresponding loss functions are: ", "page_idx": 26}, {"type": "equation", "text": "$$\n\\begin{array}{r l}&{\\quad L(\\theta)=\\operatorname*{max}\\mathbb{E}_{\\pi_{\\theta}}[Q_{\\mu}^{\\pi_{\\theta}}(s,a)-\\alpha\\log\\pi_{\\theta}(a|s)-\\lambda\\log(\\frac{\\pi_{\\theta}(a|s)}{\\pi_{\\mathrm{ref}}(a|s)})]}\\\\ &{\\quad\\quad\\quad\\quad\\quad L(\\mu_{i})=\\operatorname*{min}_{(s,a,r,s^{\\prime})\\sim R}[\\bigl(Q_{\\mu_{i}}^{\\pi_{\\theta}}(s,a)-y\\bigr)^{2}]}\\\\ &{\\quad\\quad\\quad\\quad\\quad\\mathbb{E}_{\\pi^{\\prime}\\sim\\pi_{\\theta}(\\cdot|s^{\\prime})}\\left[Q_{\\mu}^{\\pi_{\\theta}}\\left(s^{\\prime},a^{\\prime}\\right)-\\alpha\\log\\pi_{\\theta}(a^{\\prime}|s^{\\prime})-\\lambda\\log(\\frac{\\pi_{\\theta}(a^{\\prime}|s^{\\prime})}{\\pi_{\\mathrm{ref}}(a^{\\prime}|s^{\\prime})})\\right]}\\\\ &{\\quad\\quad\\quad\\quad L(\\lambda)=\\underset{\\lambda\\geq0}{\\operatorname*{min}}-\\lambda\\underset{s\\sim R,a\\sim\\pi_{\\theta}(\\cdot|s^{\\prime})}{\\operatorname*{min}}[\\log(\\frac{\\pi_{\\theta}(a|s)}{\\pi_{\\mathrm{ref}}(a|s)})-\\tau]}\\\\ &{\\quad\\quad\\quad\\quad\\quad=\\underset{\\lambda\\geq0}{\\operatorname*{min}}-\\lambda\\underset{s\\sim R,a\\sim\\pi_{\\theta}(\\cdot|s^{\\prime})}{\\operatorname*{min}}[\\log\\pi_{\\theta}(a|s)-\\log\\pi_{\\mathrm{ref}}(a|s)-\\tau]}\\end{array}\n$$", "text_format": "latex", "page_idx": 26}, {"type": "text", "text": "A constraint related to offline policy is necessary for online fine-tuning, because OOD states will appear surely during online exploration, especially in narrow dataset, which may lead to erroneous overestimation and destroy old policy. Such constraint can avoid overestimation of actions far away from current policy, hence trust-region style update guarantees stable performance improvement. ", "page_idx": 26}, {"type": "text", "text": "Compared with the constraint of current policy and offilne policy, our proposed constraint guarantees more optimal update because the policy updated in trust-region of offilne policy generally has similar performance to offline policy, which leads to not much performance improvement. ", "page_idx": 26}, {"type": "text", "text": "And compared with the tight constraint of current policy and the policy at last iteration, our constraint guarantees rapid recovery when some erroneous update occurs which results in performance degradation, because the Lagrange multiplier $\\lambda$ will be larger and make the Q-values of OOD actions lower, hence the policy tends to be close to $\\pi_{\\mathrm{ref}}$ . In such situation, our method can recover a similar performance to $\\pi_{\\mathrm{ref}}$ for current policy rapidly, but the tight constraint needs to take much time to do that as it constrains the current policy close to the poor policy at last iteration. ", "page_idx": 26}, {"type": "text", "text": "G.2 O2TD3 ", "text_level": 1, "page_idx": 26}, {"type": "text", "text": "policy re-evaluation Similar to O2SAC, online policy evaluation of TD3 Eq. (6) can be used directly to evaluate an optimistic critic, and in TD3, there is no need for $\\alpha$ . ", "page_idx": 26}, {"type": "text", "text": "value alignment As TD3 models a deterministic policy, value alignment method can not be derived directly from the relationship of the actor and the critic like O2SAC. However, from Eq. (5), the gradient of policy is only related to the the gradient of Q(s, a) to a if we fix the policy as offilne policy. ", "page_idx": 26}, {"type": "text", "text": "So, we have two insights for the actor in TD3: $Q(s,\\pi(s))$ is the maximal in $Q(s,\\cdot)$ and the gradient around $\\pi(s)$ should tend to 0, and the latter also corresponds to the idea of policy smoothing update in TD3. ", "page_idx": 27}, {"type": "text", "text": "Note that in most cases, the correlation among different dimensions of action is not be considered, hence we use one-dimensional Gaussian distribution for the following analysis. ", "page_idx": 27}, {"type": "text", "text": "Therefore, with the definition that $\\dot{a}=\\pi(s)$ , we consider that normalized Q-values around $\\dot{a}$ follow a Gaussian distribution $Q(s,a)/Q(s,\\dot{a})\\sim\\dot{N}(\\dot{a},\\Sigma)$ . And for $Q(s,{\\dot{a}}+\\delta)$ , we utilize Taylor expansion of first order and omit higher order terms, then we can get: ", "page_idx": 27}, {"type": "equation", "text": "$$\n\\begin{array}{l}{{Q(s,\\dot{a}+\\delta)\\approx Q(s,\\dot{a})+\\nabla_{a}Q(s,\\dot{a})\\cdot\\delta\\quad\\mathrm{(Taylor~expansion)}}}\\\\ {{\\approx Q(s,\\dot{a})+\\nabla_{a}Q(s,\\dot{a}+\\delta)\\cdot\\delta}}\\\\ {{\\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ =Q(s,\\dot{a})-\\displaystyle\\frac{\\delta^{2}}{\\Sigma}Q(s,\\dot{a}+\\delta)}}\\end{array}\n$$", "text_format": "latex", "page_idx": 27}, {"type": "text", "text": "From Eq. (40) to Eq. (41), we consider the continuous derivative. From Eq. (41) to Eq. (42), we utilize the derivative of a Gaussian distribution $\\nabla_{x}f(x)=-(x-\\mu)/\\Sigma$ , where $f(x)$ is a onedimensional Gaussian distribution $f(x)\\sim N(\\mu,\\Sigma)$ . ", "page_idx": 27}, {"type": "text", "text": "Note that $Q(s,{\\dot{a}})=Q(s,{\\dot{a}})/{\\sqrt{2\\pi\\Sigma}}$ , which means $\\Sigma=1/2\\pi$ , so we can get: ", "page_idx": 27}, {"type": "equation", "text": "$$\nQ(s,\\dot{a}+\\delta)=\\frac{1}{1+\\delta^{2}/\\Sigma}Q(s,\\dot{a})=\\frac{1}{1+2\\pi\\delta^{2}}Q(s,\\dot{a})\n$$", "text_format": "latex", "page_idx": 27}, {"type": "text", "text": "In our implementation, we replace Eq. (43) to Eq. (15), where $k$ is used to control penalty for overestimated values, and as action range is from $^{-1}$ to 1, the alignment objective avoids severe underestimation because the minimum $\\mathrm{\\DeltaQ}$ does not tends to 0 if we set a small $k$ , which also reduces Bellman error during online update as the same thing as min operator does. And we use the euclidean distance divided by the square root of action dimension to calculate $\\delta$ , which is $\\begin{array}{r}{\\delta(a,\\dot{a})=\\sqrt{\\sum\\left(a_{i}-\\dot{a}_{i}\\right)^{2}}/|A|}\\end{array}$ . ", "page_idx": 27}, {"type": "text", "text": "Note that in O2TD3, we use the same trick of reward normalization as $\\mathrm{TD}3\\substack{+\\mathrm{BC}}$ , which means we subtract 1 from all rewards, so we need to consider the situation of negative rewards. In Eq. (43), we set $Q(s,a)/Q(s,\\dot{a})\\sim N(\\dot{a},\\Sigma)$ when rewards are positive, so it is natural to set $Q(s,\\dot{a})/\\bar{Q}(s,a)\\sim$ $N({\\dot{a}},\\Sigma)$ at the situation of negative rewards. Therefore, for the environment with negative $\\mathrm{^Q}$ -values, we use following way to redress critic: ", "page_idx": 27}, {"type": "equation", "text": "$$\nQ(s,\\dot{a}+\\delta)=(1+k\\delta^{2})Q(s,\\dot{a})\n$$", "text_format": "latex", "page_idx": 27}, {"type": "text", "text": "In a word, we multiply $Q(s,a)$ by $\\left(1+k\\delta^{2}\\right)$ if $Q(s,a)>0$ , otherwise divide it by $(1+k\\delta^{2})$ . ", "page_idx": 27}, {"type": "text", "text": "constrained fine-tuning For O2TD3, the constraint is MSE loss, so the loss functions are: ", "page_idx": 27}, {"type": "equation", "text": "$$\nL(\\theta)=\\operatorname*{max}\\mathbb{E}_{\\pi_{\\theta}}[Q^{\\pi_{\\theta}}-\\lambda(\\pi_{\\theta}(s)-\\pi_{\\mathrm{ref}}(s))^{2}]\n$$", "text_format": "latex", "page_idx": 27}, {"type": "equation", "text": "$$\nL(\\mu_{i})=\\operatorname*{min}_{(s,a,r,s^{\\prime})\\sim R}[\\left(Q_{\\mu_{i}}^{\\pi_{\\theta}}(s,a)-y\\right)^{2}]\n$$", "text_format": "latex", "page_idx": 27}, {"type": "equation", "text": "$$\ny=r+\\gamma\\underset{a^{\\prime}\\sim\\pi_{\\theta}(\\cdot\\vert s^{\\prime})}{\\mathbb{E}}\\left[Q_{\\bar{\\mu}}^{\\pi_{\\theta}}\\left(s^{\\prime},a^{\\prime}\\right)-\\lambda(\\pi_{\\theta}(s)-\\pi_{\\mathrm{ref}}(s))^{2}\\right]\n$$", "text_format": "latex", "page_idx": 27}, {"type": "equation", "text": "$$\nL(\\lambda)=\\operatorname*{min}_{\\lambda\\geq0}-\\lambda_{s\\sim R}[(\\pi_{\\theta}(s)-\\pi_{\\mathrm{ref}}(s))^{2}-\\tau]\n$$", "text_format": "latex", "page_idx": 27}, {"type": "text", "text": "G.3 O2PPO ", "text_level": 1, "page_idx": 27}, {"type": "text", "text": "policy re-evaluation Different from O2SAC and O2TD3, as Eq. (8) is not related to offilne policy, in practice we can only obtain $V^{\\mu}(s)$ through fitting the returns. Advantages $A^{\\pi_{\\mathrm{off}}}(s,a)$ computed by such $V^{\\mu}(s)$ may be awfully incorrect, which sequentially causes error update. However, in order to follow the update way of PPO (only $V(s)$ is used to update), we stick to update state value function by fitting the returns, and we introduce a modification to advantages used to update. ", "page_idx": 27}, {"type": "text", "text": "value alignment As $V^{\\pi_{\\mathrm{off}}}(s)$ obtained in policy re-evaluation is actually $V^{\\mu}(s)$ , which is incorrect to compute advantages $A^{\\pi}(s,a)$ for on-policy update, we propose an auxiliary advantage to redress erroneous update. Let us think about the property of the auxiliary advantage. First, as an advantage function, its mathematical expectation of offilne policy $\\pi_{\\mathrm{off}}$ should be 0. Second, the function should be able to output positive values and negative values for different actions to distinguish the quality of actions. Last, better actions should correspond higher values. Drawing from the policy form of SAC, we propose the auxiliary advantage as: ", "page_idx": 27}, {"type": "text", "text": "", "page_idx": 28}, {"type": "equation", "text": "$$\n\\begin{array}{r}{A_{\\alpha}(s,a)=\\alpha\\log\\pi_{\\mathrm{off}}(a\\vert s)+\\alpha\\mathcal{H}(\\pi_{\\mathrm{off}}(\\cdot\\vert s))}\\\\ {\\mathcal{H}(\\pi_{\\mathrm{off}}(\\cdot\\vert s))=-\\mathbb{E}_{a\\sim\\pi_{\\mathrm{off}}(\\cdot\\vert s)}[\\log(\\pi_{\\mathrm{off}}(a\\vert s))]}\\end{array}\n$$", "text_format": "latex", "page_idx": 28}, {"type": "text", "text": "When the policy is modeled as Gaussian distribution, it satisfies: (1) $\\mathbb{E}_{a\\sim\\pi_{\\mathrm{off}}(\\cdot|s)}[A_{\\alpha}(s,a)]=0.$ . (2) $A_{\\alpha}(s,a)>0$ when $\\|a-\\mu\\|_{2}<\\sigma$ . (3) $A_{\\alpha}(s,a)\\propto\\log\\pi_{\\mathrm{off}}(a|s)$ . And such properties are in accord with requirements of auxiliary advantage function. ", "page_idx": 28}, {"type": "text", "text": "It is notable that here is an implicit assumption that the actions with higher probability for $\\pi_{\\mathrm{off}}$ are better, and for a well trained offilne policy, such assumption should be valid, at least for the beginning of online fine-tuning. With such auxiliary advantage function, we can redress advantages computed by incorrect $V^{\\pi}(s)$ to ensure the stable performance improvement during online fine-tuning, especially for the beginning stage. ", "page_idx": 28}, {"type": "text", "text": "constrained fine-tuning As the auxiliary advantage function has the ability to constrain policy to update in a reliable region near $\\pi_{\\mathrm{off}}$ , that means $\\pi_{\\mathrm{ref}}=\\pi_{\\mathrm{off}}$ , we just need to replace $\\pi_{\\mathrm{ref}}$ as the optimal policy during online evaluations to constrain online fine-tuning. Meanwhile, with the increase of interactions, the critic gradually becomes accurate, approximating $V^{\\pi}$ . And on-policy method is naturally stable to improve performance by updating in a reliable region, therefore the constraint factor $\\beta$ anneals to 0 from 1 during online fine-tuning. ", "page_idx": 28}, {"type": "text", "text": "H Implementation Details ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "H.1 baseline implementation ", "text_level": 1, "page_idx": 28}, {"type": "text", "text": "Offilne results For obtaining offilne policy, we choose CQL [21], IQL [20] and $\\mathrm{TD3+BC}$ [10], and we reproduce offilne results according to a deep offilne RL library CORL [40] https://github.com/tinkoffai/CORL, all hyper-parameters are the same with the official implementations. The offilne results are used in our methods, Off2On and PROTO. ", "page_idx": 28}, {"type": "text", "text": "1 CQL We reproduce the results of CQL by the code from CORL https://github.com/tinkoffai/CORL/blob/main/algorithms/offline/cql.py. 2 IQL Like the implementation of CQL, we reproduce the results of IQL by the code from CORL https://github.com/tinkoff-ai/CORL/blob/main/algorithms/offline/iql.py. 3 $\\mathbf{TD3+BC}$ Similar to above, we reproduce the results of $\\mathrm{TD3+BC}$ by the code from CORL https://github.com/tinkoff-ai/CORL/blob/main/algorithms/offline/td3_bc.py. ", "page_idx": 28}, {"type": "text", "text": "Online fine-tuning results For offline-to-online algorithms, for most methods, we reproduce the results according to their official implementations. For AWAC [32], IQL [20] and Cal-QL [33], we reproduce the results by the code from CORL [40]. For ACA [48] and PEX [50], we reproduce the results by the official open-source code https://github.com/ZishunYu/Actor-Critic-Alignment, https://github.com/Haichao-Zhang/PEX. ", "page_idx": 28}, {"type": "text", "text": "Although PROTO focus on online fine-tuning, but initialize the policy from other offilne algorithms in the official implementation. For the sake of fairness, we rewrite the code according to the paper and official code (https://github.com/Facebear-ljx/PROTO) of PROTO in Pytorch, and we use the offline results of CQL and $\\mathrm{TD3+BC}$ for initialization respectively. ", "page_idx": 28}, {"type": "text", "text": "In addition, in the official implementation of Off2On [23], the policy update 1,000 times per 1,000 environment steps, that is different from the common implementation. Therefore, we reproduce by using all parts that related to the prioritized replay in the official code from https://github.com/shlee94/Off2OnRL, and we use offline results of CQL for initialization with the ensemble size of 5, that is the same as the official paper and implementation. ", "page_idx": 28}, {"type": "text", "text": "All hyper-parameters are the same as the paper. And as O2O baseline methods are all off-policy methods, they are allowed to interact with the environment in 100,000 steps. ", "page_idx": 28}, {"type": "text", "text": "H.2 General implementation of our methods ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "Network Architecture As we need to re-evaluate policy, which means we only need offline policy and do not use the offline critic, we can modify the critic network architecture for stable online fine-tuning. In our implementation, we adopt the same network architecture as offilne phase but apply Layer Normalization (LayerNorm) for the output of hidden layers after activation function. ", "page_idx": 29}, {"type": "text", "text": "[49] indicate that in offilne RL, LayerNorm is a good solution to effectively avoid divergence without introducing detrimental bias, leading to superior performance. Moreover, [4] find that LayerNorm is favourable for efficient online RL with offline data. Therefore, for stable evaluation and future consideration, we decide to apply LayerNorm to online critic network. ", "page_idx": 29}, {"type": "text", "text": "Initialization of online replay buffer We test our method by initializing the online replay buffer with four different types: (1) Initialize the buffer with the entire offilne dataset akin to [20]. (2) Conduct a separate online buffer and sample symmetrically from both offline dataset and online buffer akin to [4]. (3) Initialize the buffer with a small number of offline data with high quality akin to [48]. (4) Initialize the buffer without any offline data. For simplicity, we denote them as All, Half, Part, Null respectively. ", "page_idx": 29}, {"type": "table", "img_path": "XVfevb9XFx/tmp/0e6d4893e2e3bb66618179f68a880f490d0eb410df448034c7e32d17ceb7a95f.jpg", "table_caption": ["Table 6: Results for different initialization of online replay buffer. "], "table_footnote": [], "page_idx": 29}, {"type": "text", "text": "As the results shown in 6, there is little difference among different ways of initialization, except for $a l l$ , as the the quality of the offilne dataset may be low. Although the initialization ways of part and null also show the competitive results, however, to be consistent with [4] and future efficient update, we decide to adopt Half as our implementation way. It is notable that online policy is still favourable even if we adopt Null initialization, thanks to our adaptive constrained fine-tuning. ", "page_idx": 29}, {"type": "text", "text": "loss weight for $\\lambda$ update Since $\\lambda$ in Eq. (20) is a variable applied in all states, it may decrease greatly in a batch. In order to considering more about the situation that needs to be constrained, we modify the term about $\\lambda$ in the loss Eq. (20) with a weight. ", "page_idx": 29}, {"type": "equation", "text": "$$\nL(\\lambda)=\\operatorname*{min}_{\\lambda\\geq0}-\\lambda\\left[\\mathbb{E}_{\\pi_{\\theta}}\\omega(f(\\pi_{\\theta}(a|s),\\pi_{\\mathrm{ref}}(a|s)))-\\tau\\right]\n$$", "text_format": "latex", "page_idx": 29}, {"type": "text", "text": "where $\\omega\\,=\\,|0.7-\\mathbb{I}(\\bigl(f\\bigl(\\pi_{\\theta}(a|s),\\pi_{\\mathrm{ref}}(a|s)\\bigr)\\bigr)\\,>\\,\\tau)|$ | gives a large weight to negative coefficients, thereby constraining the abrupt decrease of $\\lambda$ . ", "page_idx": 29}, {"type": "text", "text": "The choice of the initial value of $\\lambda$ As $\\lambda$ is the Lagrange multiplier which is adaptive to the constraint, there is no need to design the initial value of $\\lambda$ specially. For all experiments of O2SAC and O2TD3, we set the initial value as 1.0. ", "page_idx": 29}, {"type": "text", "text": "H.3 O2SAC implementation ", "text_level": 1, "page_idx": 29}, {"type": "text", "text": "The choice of constraint threshold $\\tau$ As we consider the constraint in O2SAC is KL divergence, and we model policy as a squashed Gaussian distribution, we can directly the KL divergence of Gaussian distribution to approximate the constraint. Since $\\pi_{\\mathrm{ref}}$ is the best one among old policies during online evaluations and it will be close to $\\pi_{\\theta}$ with the performance improvement, we can assume that the standard deviation of $\\pi_{\\mathrm{ref}}$ is the same as the one of $\\pi_{\\theta}$ . Therefore, according to the KL divergence of Gaussian distribution, we can get: ", "page_idx": 29}, {"type": "equation", "text": "$$\nD_{K L}(N(\\mu_{\\theta},\\sigma^{2}),N(\\mu_{b},\\sigma^{2}))=\\frac{(\\mu_{\\theta}-\\mu_{b})^{2}}{2\\sigma^{2}}\n$$", "text_format": "latex", "page_idx": 29}, {"type": "text", "text": "Therefore, we can determine constraint threshold $\\tau$ based on the magnitude of change in the mean. For medium dataset, we constrain that $|\\mu_{\\theta}-\\mu_{b}|\\,<\\,\\sigma$ , hence $\\tau=0.5$ . However, due to different standard deviations, this threshold may not accurate, and it is an intuitive idea to loosen the constraint at a later stage. So we set $\\tau$ as a linearly increasing variable from 0.125 to 2.0 for medium and medium-replay datasets, which means the allowable range of policy distribution mean is from $\\sigma/2$ to $2\\sigma$ . And for medium-expert and expert datasets, we set it from 0.005 to 0.125 for safe update, which means the allowable range of policy distribution mean is from $\\sigma/10$ to $\\sigma/2$ . ", "page_idx": 29}, {"type": "text", "text": "Clipped log likelihood Due to the limit of precision of Pytorch and the squashed Gaussian policy used in O2SAC, when the output action $a$ is near 1.0, like 0.99999999, the log likelihood $\\log\\pi(a|s)$ is will be severely low as the value of action will be computed as 1.0, which will occurs when the log likelihood is need to be computed by given a action in value alignment phase and constrained fine-tuning phase. Therefore, for simple calculation, we set the minimum value of log likelihood is -50, a enough small number, which has litter influence on results. ", "page_idx": 30}, {"type": "text", "text": "H.4 O2TD3 implementation ", "text_level": 1, "page_idx": 30}, {"type": "text", "text": "The choice of constraint threshold $\\tau$ As TD3 models deterministic policy, it is unable to determine the constraint threshold according to the standard deviation. However, when we inspect the interaction process of TD3, we can find that exploration noise is akin to the standard deviation. So we determine $\\tau$ from the exploration noise. First we set exploration noise as 0.1 for medium dataset, which is the same as TD3 learning from scratch. And for expert dataset, we set exploration noise as 0.05 because offilne policy is well trained in such dataset, and a lower exploration noise is favourable to avoid poor action samples. ", "page_idx": 30}, {"type": "text", "text": "After determination of exploration noise, with the idea of the equivalence of the standard deviation and the exploration noise, we set tau similar to O2SAC. For medium and medium-replay datasets, tau grows linearly from 0.0025 to 0.01, which means the allowable range of policy distribution mean is from $\\sigma/2$ to $2\\sigma$ , when we consider the exploration noise is equal to the standard deviation. Similarly, for medium-expert and expert datasets, we set it from 0.000025 to 0.000625. ", "page_idx": 30}, {"type": "text", "text": "H.5 O2PPO implementation ", "text_level": 1, "page_idx": 30}, {"type": "text", "text": "We implement our O2PPO basically according to the code of Uni-O4 [24]. ", "page_idx": 30}, {"type": "text", "text": "The decay rate of $\\beta$ In our implementation for O2PPO, we set the interaction steps as 250,000 since PPO is an on-policy method which improves performance more slowly than off-policy methods. Since we keep the idea that in medium-expert and expert dataset, the offline policy is well learned, we decay $\\beta$ from 1 to 0 linearly in 500,000 steps, which means in the end of our fine-tuning, $\\beta=0.5$ . And for policies trained in other datasets, including AntMaze tasks and medium and medium-replay datasets of Mujoco tasks, we decay $\\beta$ from 1 to 0 linearly during 250,000 steps to reserve more potential of performance improvement. ", "page_idx": 30}, {"type": "text", "text": "Clipped standard deviation As shown in 14, the policy trained by IQL algorithm has a large standard deviation which makes poor exploration performance, especially in hopper-medium-expert- $_{\\nu2}$ and hopper-expert- $\\cdot\\nu2$ . Therefore, we set the maximum value of the standard deviations of policies trained in the two datasets as 0.05, which corresponds to the set of exploration noise in O2TD3, because for a deterministic policy, exploration noise and standard deviation of a stochastic policy are equivalent during taking actions in exploration. ", "page_idx": 30}, {"type": "image", "img_path": "XVfevb9XFx/tmp/27842fdd10373176942985b4c9d02987ff74781e331a4b528a870ac65b127337.jpg", "img_caption": ["Figure 14: Normalized return of evaluation and exploration during IQL offline training, where evaluation means policy output the mean of action distribution and exploration means actions are sampled from the distribution. "], "img_footnote": [], "page_idx": 30}, {"type": "text", "text": "Shaped and weighted auxili√ary advantage For one-dimensional Gaussian distribution $f\\ =$ $N(\\mu,\\sigma^{2})$ , the entropy is $\\log({\\sqrt{2\\pi e\\sigma^{2}}})$ , which is equal to $\\log(f(\\mu\\pm\\sigma))$ , hence the maximum value of $A_{\\alpha}(s,a)$ in (48) is $1/2$ . However, the minimum value of it may be much low, which leads to unstable training. Therefore, we use SoftPlus activation function to clip the range of $A_{\\alpha}(s,a)$ . For each dimensional, we clip $A_{\\alpha}(s,a)$ as follows: ", "page_idx": 31}, {"type": "equation", "text": "$$\n\\mathrm{Clip}(A_{\\alpha}(s,a)):=\\mathrm{SoftPlus}(A_{\\alpha}(s,a)+4)-4\n$$", "text_format": "latex", "page_idx": 31}, {"type": "text", "text": "By such clipping operator, the range of $A_{\\alpha}(s,a)$ is $\\left(-4,1/2\\right)$ approximately. Note that when the current policy is close to the reference policy, the actions with overly low logarithmic values are rare, thereby having a little effect on the results. ", "page_idx": 31}, {"type": "text", "text": "Note that in the implementation of PPO, the normalization of advantages is needed. In order to make $A_{\\alpha}(s,a)$ and $\\bar{A}(s,a)$ the same order of magnitude, we reweight $A_{\\alpha}(s,a)$ by multiplying a coefficient that is the double value of the standard deviation of $A(s,a)$ . Therefore, the maximum value of $A_{\\alpha}(s,a)$ is the standard deviation of the batch of $A(s,a)$ . ", "page_idx": 31}, {"type": "text", "text": "I Connect Different Offline and Online RL Methods ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Our methods permit connecting different offline and online RL methods as only offline policy is needed in our methods. Therefore, for those RL-based methods, which means the policy is modeled as a stochastic policy or deterministic policy in traditional RL way, it is easy to implement stable online fine-tuning by our methods. For those methods which model policy with different form, such as decision transformer (DT) [6], our methods can be applied easily if a stochastic policy or deterministic policy is used to clone the offline policy. ", "page_idx": 31}, {"type": "text", "text": "For behavior cloning of a stochastic policy, the easiest way is to Maximize log likelihood, however, we recommend the form akin to [53], as follows: ", "page_idx": 31}, {"type": "equation", "text": "$$\n\\operatorname*{min}_{\\theta}\\mathbb{E}_{(s\\sim D,a\\sim\\pi_{\\mathrm{off}}(\\cdot|s))}[-\\log(\\pi_{\\theta}(a|s))-\\lambda[\\bar{\\mathcal{H}}(\\pi_{\\theta}(\\cdot|s)]]\n$$", "text_format": "latex", "page_idx": 31}, {"type": "text", "text": "The purpose to maximize the entropy is to avoid an excessively narrow distribution, which may cause drastic jump of Q-values in O2SAC as $\\alpha$ will decay to zero quickly. However, in our experiment, such a way of behavior cloning will leads to performance degeneration, which is a question for imitation learning, It is more easy for the behavior cloning of the deterministic policy, MSE loss can be used to update the policy for the states in offline dataset. ", "page_idx": 31}, {"type": "text", "text": "It is notable that degree of coverage has an important influence on behavior cloning, which is still an intractable challenge in imitation learning. Our methods provide the opportunity for the application of advanced imitation learning to O2O RL. In addition, even though the policy initialized with imperfect performance, our methods achieve better online performance than the online algorithm learning from scratch. ", "page_idx": 31}, {"type": "text", "text": "J Pesudo-Codes ", "text_level": 1, "page_idx": 31}, {"type": "text", "text": "Algorithm 1 O2SAC ", "text_level": 1, "page_idx": 32}, {"type": "text", "text": "Require: offline policy $\\pi_{\\mathrm{off}}$ , offline dataset $D$ , factor $\\alpha$ , threshold $\\tau$ , interaction interval T   \n# Optimistic critic reconstruction before online fine-tuning   \n1: Initialize the actor $\\pi_{\\mathrm{on}}$ with $\\pi_{\\mathrm{off}}$ and the critic $Q_{\\mathrm{on}}$ with random parameters   \n2: for iteration $i=1,2,\\cdot\\cdot\\cdot$ do   \n3: Update the critic in the optimistic way by 3 ▷Policy re-evaluation   \n4: end for   \n5: for iteration $i=1,2,\\cdot\\cdot\\cdot$ do   \n6: Update $\\pi_{\\mathrm{on}}$ to seek overestimated actions by 2   \n7: Update $Q_{\\mathrm{on}}$ to suppress overestimated Q-values by 13 ▷Value Alignment   \n8: end for   \n# Constrained online fine-tuning   \n9: Set the reference policy $\\pi_{\\mathrm{ref}}$ as $\\pi_{\\mathrm{on}}$ and initialize the replay buffer $R$ with $D$   \n10: for iteration $i=1,2,\\cdot\\cdot\\cdot$ do   \n11: Interact with the environment and store the transition in replay buffer $R$   \n12: Update the temperature coefficient $\\alpha$ by 4 $\\triangleright$ Constrained Fine-tuning   \n13: Update the Lagrange multiplier $\\lambda$ by 39   \n14: Update the critic $Q_{\\mathrm{on}}$ by 38   \n15: Update the policy $\\pi_{\\mathrm{on}}$ by37   \n16: if evaluation permitted then   \n17: if i $\\%$ interaction interval $==0$ then   \n18: if $J(\\pi_{\\mathrm{on}})>J(\\pi_{\\mathrm{ref}})$ then   \n19: Replace $\\pi_{\\mathrm{ref}}$ as $\\pi_{\\mathrm{on}}$   \n20: end if   \n21: end if   \n22: else   \n23: Replace $\\pi_{\\mathrm{ref}}$ as $\\pi_{\\mathrm{on}}$ at a given interval   \n24: end if   \n25: end for ", "page_idx": 32}, {"type": "text", "text": "Algorithm 2 O2TD3 ", "text_level": 1, "page_idx": 32}, {"type": "text", "text": "Require: offline policy $\\pi_{\\mathrm{off}}$ , offline dataset $D$ , factor $k$ , threshold $\\tau$ , interaction interval   \n# Optimistic critic reconstruction before online fine-tuning   \n1: Initialize the actor $\\pi_{\\mathrm{on}}$ with $\\pi_{\\mathrm{off}}$ and the critic $Q_{\\mathrm{on}}$ with random parameters   \n2: for iteration $i=1,2,\\cdot\\cdot\\cdot$ do   \n3: Update the critic in the optimistic way by 6 ▷Policy re-evaluation   \n4: end for   \n5: for iteration $i=1,2,\\cdot\\cdot\\cdot$ do   \n6: Update $\\pi_{\\mathrm{on}}$ to seek overestimated actions by 5   \n7: Update $Q_{\\mathrm{on}}$ to suppress overestimated Q-values by 16 ▷Value Alignment   \n8: end for   \n# Constrained online fine-tuning   \n9: Set the reference policy $\\pi_{\\mathrm{ref}}$ as $\\pi_{\\mathrm{on}}$ and initialize the replay buffer $R$ with $D$   \n10: for iteration $i=1,2,\\cdot\\cdot\\cdot$ do   \n11: Interact with the environment and store the transition in replay buffer $R$   \n12: Update the Lagrange multiplier $\\lambda$ by 47 $\\triangleright$ Constrained Fine-tuning   \n13: Update the critic $Q_{\\mathrm{on}}$ by 46   \n14: Update the policy $\\pi_{\\mathrm{on}}$ by 46   \n15: if evaluation permitted then   \n16: if $\\mathrm{i}\\,\\%$ interaction interval $==0$ then   \n17: if $J(\\pi_{\\mathrm{on}})>J(\\pi_{\\mathrm{ref}})$ then   \n18: Replace $\\pi_{\\mathrm{ref}}$ as $\\pi_{\\mathrm{on}}$   \n19: end if   \n20: end if   \n21: else   \n22: Replace $\\pi_{\\mathrm{ref}}$ as $\\pi_{\\mathrm{on}}$ at a given interval   \n23: end if   \n24: end for ", "page_idx": 32}, {"type": "text", "text": "Algorithm 3 O2PPO ", "text_level": 1, "page_idx": 33}, {"type": "text", "text": "Require: offline policy $\\pi_{\\mathrm{off}}$ , offline dataset $D$ , factor $\\alpha$ , interaction interval, update interval   \n# Optimistic critic reconstruction before online fine-tuning   \n1: Initialize the actor $\\pi_{\\mathrm{on}}$ with $\\pi_{\\mathrm{off}}$ and the critic $V_{o n}$ with random parameters   \n2: for iteration $i=1,2,\\cdot\\cdot\\cdot$ do ▷Policy re-evaluation   \n3: Update the critic $V_{o n}$ in the optimistic way by fitting the returns of offline trajectories   \n4: end for   \n# Value Alignment & Constrained online fine-tuning   \n5: Set the reference policy $\\pi_{\\mathrm{ref}}$ as $\\pi_{\\mathrm{on}}$ and initialize an empty replay buffer $R$   \n6: for iteration $i=1,2,\\cdot\\cdot\\cdot$ do   \n7: Interact with the environment and store the transition in replay buffer   \n8: if i $\\%$ update interval $==0$ then   \n9: for iteration $i=1,2,\\cdots\\,,K$ do $\\triangleright$ Value Alignment & Constrained Fine-tuning   \n10: Compute advantage by 18   \n11: Update the policy $\\pi_{\\mathrm{on}}$ by 7   \n12: Update the critic $V_{o n}$ by 8   \n13: end for   \n14: Reset $R$ to empty   \n15: end if   \n16: if evaluation permitted then   \n17: if i $\\%$ interaction interval $==0$ then   \n18: if $J(\\pi_{\\mathrm{on}})>J(\\pi_{\\mathrm{ref}})$ then   \n19: Replace $\\pi_{\\mathrm{ref}}$ as $\\pi_{\\mathrm{on}}$   \n20: end if   \n21: end if   \n22: else   \n23: Replace $\\pi_{\\mathrm{ref}}$ as $\\pi_{\\mathrm{on}}$ at a given interval   \n24: end if   \n25: end for ", "page_idx": 33}, {"type": "text", "text": "NeurIPS Paper Checklist ", "text_level": 1, "page_idx": 34}, {"type": "text", "text": "1. Claims ", "text_level": 1, "page_idx": 34}, {"type": "text", "text": "Question: Do the main claims made in the abstract and introduction accurately reflect the paper’s contributions and scope? ", "page_idx": 34}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 34}, {"type": "text", "text": "Justification: We clearly claim our contributions on offilne-to-online RL in both abstract and introduction. ", "page_idx": 34}, {"type": "text", "text": "Guidelines: ", "page_idx": 34}, {"type": "text", "text": "• The answer NA means that the abstract and introduction do not include the claims made in the paper.   \n• The abstract and/or introduction should clearly state the claims made, including the contributions made in the paper and important assumptions and limitations. A No or NA answer to this question will not be perceived well by the reviewers.   \n• The claims made should match theoretical and experimental results, and reflect how much the results can be expected to generalize to other settings.   \n• It is fine to include aspirational goals as motivation as long as it is clear that these goals are not attained by the paper. ", "page_idx": 34}, {"type": "text", "text": "2. Limitations ", "text_level": 1, "page_idx": 34}, {"type": "text", "text": "Question: Does the paper discuss the limitations of the work performed by the authors? ", "page_idx": 34}, {"type": "text", "text": "Answer: [Yes] ", "text_level": 1, "page_idx": 34}, {"type": "text", "text": "Justification: Since we re-evaluate the policy under Assumption 4.1, the policy should have favourable performance after offilne training. And in Section C.2 in Appendix C, we further discuss why we do not focus on fine-tune a policy with poor performance. ", "page_idx": 34}, {"type": "text", "text": "Guidelines: ", "text_level": 1, "page_idx": 34}, {"type": "text", "text": "• The answer NA means that the paper has no limitation while the answer No means that the paper has limitations, but those are not discussed in the paper.   \n• The authors are encouraged to create a separate \"Limitations\" section in their paper.   \n• The paper should point out any strong assumptions and how robust the results are to violations of these assumptions (e.g., independence assumptions, noiseless settings, model well-specification, asymptotic approximations only holding locally). The authors should reflect on how these assumptions might be violated in practice and what the implications would be.   \n• The authors should reflect on the scope of the claims made, e.g., if the approach was only tested on a few datasets or with a few runs. In general, empirical results often depend on implicit assumptions, which should be articulated.   \n• The authors should reflect on the factors that influence the performance of the approach. For example, a facial recognition algorithm may perform poorly when image resolution is low or images are taken in low lighting. Or a speech-to-text system might not be used reliably to provide closed captions for online lectures because it fails to handle technical jargon.   \n• The authors should discuss the computational efficiency of the proposed algorithms and how they scale with dataset size.   \n• If applicable, the authors should discuss possible limitations of their approach to address problems of privacy and fairness.   \n• While the authors might fear that complete honesty about limitations might be used by reviewers as grounds for rejection, a worse outcome might be that reviewers discover limitations that aren’t acknowledged in the paper. The authors should use their best judgment and recognize that individual actions in favor of transparency play an important role in developing norms that preserve the integrity of the community. Reviewers will be specifically instructed to not penalize honesty concerning limitations. ", "page_idx": 34}, {"type": "text", "text": "3. Theory Assumptions and Proofs ", "text_level": 1, "page_idx": 34}, {"type": "text", "text": "Question: For each theoretical result, does the paper provide the full set of assumptions and a complete (and correct) proof? ", "page_idx": 34}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 35}, {"type": "text", "text": "Justification: We provide the references of our assumptions and proofs for our proposed propositions in Appendix F. ", "page_idx": 35}, {"type": "text", "text": "Guidelines: ", "page_idx": 35}, {"type": "text", "text": "• The answer NA means that the paper does not include theoretical results.   \n• All the theorems, formulas, and proofs in the paper should be numbered and crossreferenced.   \n• All assumptions should be clearly stated or referenced in the statement of any theorems.   \n• The proofs can either appear in the main paper or the supplemental material, but if they appear in the supplemental material, the authors are encouraged to provide a short proof sketch to provide intuition.   \n• Inversely, any informal proof provided in the core of the paper should be complemented by formal proofs provided in appendix or supplemental material.   \n• Theorems and Lemmas that the proof relies upon should be properly referenced. ", "page_idx": 35}, {"type": "text", "text": "4. Experimental Result Reproducibility ", "text_level": 1, "page_idx": 35}, {"type": "text", "text": "Question: Does the paper fully disclose all the information needed to reproduce the main experimental results of the paper to the extent that it affects the main claims and/or conclusions of the paper (regardless of whether the code and data are provided or not)? ", "page_idx": 35}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 35}, {"type": "text", "text": "Justification: We disclose our algorithm details in Appendix G and our implementation details in Appendix H, including the implementation of the baselines and our methods. ", "page_idx": 35}, {"type": "text", "text": "Guidelines: ", "page_idx": 35}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• If the paper includes experiments, a No answer to this question will not be perceived well by the reviewers: Making the paper reproducible is important, regardless of whether the code and data are provided or not.   \n• If the contribution is a dataset and/or model, the authors should describe the steps taken to make their results reproducible or verifiable.   \n• Depending on the contribution, reproducibility can be accomplished in various ways. For example, if the contribution is a novel architecture, describing the architecture fully might suffice, or if the contribution is a specific model and empirical evaluation, it may be necessary to either make it possible for others to replicate the model with the same dataset, or provide access to the model. In general. releasing code and data is often one good way to accomplish this, but reproducibility can also be provided via detailed instructions for how to replicate the results, access to a hosted model (e.g., in the case of a large language model), releasing of a model checkpoint, or other means that are appropriate to the research performed.   \n• While NeurIPS does not require releasing code, the conference does require all submissions to provide some reasonable avenue for reproducibility, which may depend on the nature of the contribution. For example (a) If the contribution is primarily a new algorithm, the paper should make it clear how to reproduce that algorithm. (b) If the contribution is primarily a new model architecture, the paper should describe the architecture clearly and fully. (c) If the contribution is a new model (e.g., a large language model), then there should either be a way to access this model for reproducing the results or a way to reproduce the model (e.g., with an open-source dataset or instructions for how to construct the dataset). (d) We recognize that reproducibility may be tricky in some cases, in which case authors are welcome to describe the particular way they provide for reproducibility. In the case of closed-source models, it may be that access to the model is limited in some way (e.g., to registered users), but it should be possible for other researchers to have some path to reproducing or verifying the results. ", "page_idx": 35}, {"type": "text", "text": "5. Open access to data and code ", "text_level": 1, "page_idx": 35}, {"type": "text", "text": "Question: Does the paper provide open access to the data and code, with sufficient instructions to faithfully reproduce the main experimental results, as described in supplemental material? ", "page_idx": 36}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 36}, {"type": "text", "text": "Justification: We upload our code in the supplementary material. Guidelines: ", "page_idx": 36}, {"type": "text", "text": "• The answer NA means that paper does not include experiments requiring code.   \n• Please see the NeurIPS code and data submission guidelines (https://nips.cc/ public/guides/CodeSubmissionPolicy) for more details.   \n• While we encourage the release of code and data, we understand that this might not be possible, so “No” is an acceptable answer. Papers cannot be rejected simply for not including code, unless this is central to the contribution (e.g., for a new open-source benchmark).   \n• The instructions should contain the exact command and environment needed to run to reproduce the results. See the NeurIPS code and data submission guidelines (https: //nips.cc/public/guides/CodeSubmissionPolicy) for more details.   \n• The authors should provide instructions on data access and preparation, including how to access the raw data, preprocessed data, intermediate data, and generated data, etc.   \n• The authors should provide scripts to reproduce all experimental results for the new proposed method and baselines. If only a subset of experiments are reproducible, they should state which ones are omitted from the script and why.   \n• At submission time, to preserve anonymity, the authors should release anonymized versions (if applicable).   \n• Providing as much information as possible in supplemental material (appended to the paper) is recommended, but including URLs to data and code is permitted. ", "page_idx": 36}, {"type": "text", "text": "6. Experimental Setting/Details ", "text_level": 1, "page_idx": 36}, {"type": "text", "text": "Question: Does the paper specify all the training and test details (e.g., data splits, hyperparameters, how they were chosen, type of optimizer, etc.) necessary to understand the results? ", "page_idx": 36}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 36}, {"type": "text", "text": "Justification: We disclose our experimental setting in Section 5 and Appendix H. Guidelines: ", "page_idx": 36}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments. • The experimental setting should be presented in the core of the paper to a level of detail that is necessary to appreciate the results and make sense of them. • The full details can be provided either with the code, in appendix, or as supplemental material. ", "page_idx": 36}, {"type": "text", "text": "7. Experiment Statistical Significance ", "text_level": 1, "page_idx": 36}, {"type": "text", "text": "Question: Does the paper report error bars suitably and correctly defined or other appropriate information about the statistical significance of the experiments? ", "page_idx": 36}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 36}, {"type": "text", "text": "Justification: We run our methods in 5 random seeds and report the results including the average and standard deviation. ", "page_idx": 36}, {"type": "text", "text": "Guidelines: ", "page_idx": 36}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The authors should answer \"Yes\" if the results are accompanied by error bars, confidence intervals, or statistical significance tests, at least for the experiments that support the main claims of the paper.   \n• The factors of variability that the error bars are capturing should be clearly stated (for example, train/test split, initialization, random drawing of some parameter, or overall run with given experimental conditions).   \n• The method for calculating the error bars should be explained (closed form formula, call to a library function, bootstrap, etc.)   \n• The assumptions made should be given (e.g., Normally distributed errors).   \n• It should be clear whether the error bar is the standard deviation or the standard error of the mean.   \n• It is OK to report 1-sigma error bars, but one should state it. The authors should preferably report a 2-sigma error bar than state that they have a $96\\%$ CI, if the hypothesis of Normality of errors is not verified.   \n• For asymmetric distributions, the authors should be careful not to show in tables or figures symmetric error bars that would yield results that are out of range (e.g. negative error rates).   \n• If error bars are reported in tables or plots, The authors should explain in the text how they were calculated and reference the corresponding figures or tables in the text. ", "page_idx": 36}, {"type": "text", "text": "", "page_idx": 37}, {"type": "text", "text": "8. Experiments Compute Resources ", "text_level": 1, "page_idx": 37}, {"type": "text", "text": "Question: For each experiment, does the paper provide sufficient information on the computer resources (type of compute workers, memory, time of execution) needed to reproduce the experiments? ", "page_idx": 37}, {"type": "text", "text": "Answer: [No] ", "page_idx": 37}, {"type": "text", "text": "Justification: Since our methods do not focus on computational cost, and we experiment our methods in many devices with different GPUs, we do not provide the information on the computer resources specially. ", "page_idx": 37}, {"type": "text", "text": "Guidelines: ", "page_idx": 37}, {"type": "text", "text": "• The answer NA means that the paper does not include experiments.   \n• The paper should indicate the type of compute workers CPU or GPU, internal cluster, or cloud provider, including relevant memory and storage.   \n• The paper should provide the amount of compute required for each of the individual experimental runs as well as estimate the total compute.   \n• The paper should disclose whether the full research project required more compute than the experiments reported in the paper (e.g., preliminary or failed experiments that didn’t make it into the paper). ", "page_idx": 37}, {"type": "text", "text": "9. Code Of Ethics ", "text_level": 1, "page_idx": 37}, {"type": "text", "text": "Question: Does the research conducted in the paper conform, in every respect, with the NeurIPS Code of Ethics https://neurips.cc/public/EthicsGuidelines? ", "page_idx": 37}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 37}, {"type": "text", "text": "Justification: We have read the NeurIPS Code of Ethics adequately and we make sure we followed the code. ", "page_idx": 37}, {"type": "text", "text": "Guidelines: ", "page_idx": 37}, {"type": "text", "text": "• The answer NA means that the authors have not reviewed the NeurIPS Code of Ethics.   \n• If the authors answer No, they should explain the special circumstances that require a deviation from the Code of Ethics.   \n• The authors should make sure to preserve anonymity (e.g., if there is a special consideration due to laws or regulations in their jurisdiction). ", "page_idx": 37}, {"type": "text", "text": "10. Broader Impacts ", "text_level": 1, "page_idx": 37}, {"type": "text", "text": "Question: Does the paper discuss both potential positive societal impacts and negative societal impacts of the work performed? ", "page_idx": 37}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 37}, {"type": "text", "text": "Justification: This paper presents work whose goal is to advance the field of Machine Learning. There are many potential societal consequences of our work, none which we feel must be specifically highlighted here. ", "page_idx": 37}, {"type": "text", "text": "Guidelines: ", "page_idx": 37}, {"type": "text", "text": "• The answer NA means that there is no societal impact of the work performed. ", "page_idx": 37}, {"type": "text", "text": "• If the authors answer NA or No, they should explain why their work has no societal impact or why the paper does not address societal impact.   \n• Examples of negative societal impacts include potential malicious or unintended uses (e.g., disinformation, generating fake profiles, surveillance), fairness considerations (e.g., deployment of technologies that could make decisions that unfairly impact specific groups), privacy considerations, and security considerations.   \n• The conference expects that many papers will be foundational research and not tied to particular applications, let alone deployments. However, if there is a direct path to any negative applications, the authors should point it out. For example, it is legitimate to point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point out that a generic algorithm for optimizing neural networks could enable people to train models that generate Deepfakes faster.   \n• The authors should consider possible harms that could arise when the technology is being used as intended and functioning correctly, harms that could arise when the technology is being used as intended but gives incorrect results, and harms following from (intentional or unintentional) misuse of the technology.   \n• If there are negative societal impacts, the authors could also discuss possible mitigation strategies (e.g., gated release of models, providing defenses in addition to attacks, mechanisms for monitoring misuse, mechanisms to monitor how a system learns from feedback over time, improving the efficiency and accessibility of ML). ", "page_idx": 38}, {"type": "text", "text": "11. Safeguards ", "text_level": 1, "page_idx": 38}, {"type": "text", "text": "Question: Does the paper describe safeguards that have been put in place for responsible release of data or models that have a high risk for misuse (e.g., pretrained language models, image generators, or scraped datasets)? ", "page_idx": 38}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 38}, {"type": "text", "text": "Justification: The paper poses no such risks. Guidelines: ", "page_idx": 38}, {"type": "text", "text": "• The answer NA means that the paper poses no such risks.   \n• Released models that have a high risk for misuse or dual-use should be released with necessary safeguards to allow for controlled use of the model, for example by requiring that users adhere to usage guidelines or restrictions to access the model or implementing safety filters.   \n• Datasets that have been scraped from the Internet could pose safety risks. The authors should describe how they avoided releasing unsafe images.   \n• We recognize that providing effective safeguards is challenging, and many papers do not require this, but we encourage authors to take this into account and make a best faith effort. ", "page_idx": 38}, {"type": "text", "text": "12. Licenses for existing assets ", "text_level": 1, "page_idx": 38}, {"type": "text", "text": "Question: Are the creators or original owners of assets (e.g., code, data, models), used in the paper, properly credited and are the license and terms of use explicitly mentioned and properly respected? ", "page_idx": 38}, {"type": "text", "text": "Answer: [Yes] ", "page_idx": 38}, {"type": "text", "text": "Justification: We use the open-source code and dataset, and they are explicitly cited in the paper. ", "page_idx": 38}, {"type": "text", "text": "Guidelines: ", "page_idx": 38}, {"type": "text", "text": "• The answer NA means that the paper does not use existing assets.   \n• The authors should cite the original paper that produced the code package or dataset.   \n• The authors should state which version of the asset is used and, if possible, include a URL.   \n• The name of the license (e.g., CC-BY 4.0) should be included for each asset.   \n• For scraped data from a particular source (e.g., website), the copyright and terms of service of that source should be provided.   \n• If assets are released, the license, copyright information, and terms of use in the package should be provided. For popular datasets, paperswithcode.com/datasets has curated licenses for some datasets. Their licensing guide can help determine the license of a dataset.   \n• For existing datasets that are re-packaged, both the original license and the license of the derived asset (if it has changed) should be provided.   \n• If this information is not available online, the authors are encouraged to reach out to the asset’s creators. ", "page_idx": 38}, {"type": "text", "text": "", "page_idx": 39}, {"type": "text", "text": "13. New Assets ", "text_level": 1, "page_idx": 39}, {"type": "text", "text": "Question: Are new assets introduced in the paper well documented and is the documentation provided alongside the assets? ", "page_idx": 39}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 39}, {"type": "text", "text": "Justification: We do not release new assets. ", "page_idx": 39}, {"type": "text", "text": "Guidelines: ", "page_idx": 39}, {"type": "text", "text": "• The answer NA means that the paper does not release new assets.   \n• Researchers should communicate the details of the dataset/code/model as part of their submissions via structured templates. This includes details about training, license, limitations, etc.   \n• The paper should discuss whether and how consent was obtained from people whose asset is used.   \n• At submission time, remember to anonymize your assets (if applicable). You can either create an anonymized URL or include an anonymized zip file. ", "page_idx": 39}, {"type": "text", "text": "14. Crowdsourcing and Research with Human Subjects ", "text_level": 1, "page_idx": 39}, {"type": "text", "text": "Question: For crowdsourcing experiments and research with human subjects, does the paper include the full text of instructions given to participants and screenshots, if applicable, as well as details about compensation (if any)? ", "page_idx": 39}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 39}, {"type": "text", "text": "Justification: The paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 39}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Including this information in the supplemental material is fine, but if the main contribution of the paper involves human subjects, then as much detail as possible should be included in the main paper.   \n• According to the NeurIPS Code of Ethics, workers involved in data collection, curation, or other labor should be paid at least the minimum wage in the country of the data collector. ", "page_idx": 39}, {"type": "text", "text": "15. Institutional Review Board (IRB) Approvals or Equivalent for Research with Human Subjects ", "text_level": 1, "page_idx": 39}, {"type": "text", "text": "Question: Does the paper describe potential risks incurred by study participants, whether such risks were disclosed to the subjects, and whether Institutional Review Board (IRB) approvals (or an equivalent approval/review based on the requirements of your country or institution) were obtained? ", "page_idx": 39}, {"type": "text", "text": "Answer: [NA] ", "page_idx": 39}, {"type": "text", "text": "Justification: The paper does not involve crowdsourcing nor research with human subjects. Guidelines: ", "page_idx": 39}, {"type": "text", "text": "• The answer NA means that the paper does not involve crowdsourcing nor research with human subjects.   \n• Depending on the country in which research is conducted, IRB approval (or equivalent) may be required for any human subjects research. If you obtained IRB approval, you should clearly state this in the paper.   \n• We recognize that the procedures for this may vary significantly between institutions and locations, and we expect authors to adhere to the NeurIPS Code of Ethics and the guidelines for their institution.   \n• For initial submissions, do not include any information that would break anonymity (if applicable), such as the institution conducting the review. ", "page_idx": 39}, {"type": "text", "text": "", "page_idx": 40}]