{"references": [{"fullname_first_author": "Cong Han", "paper_title": "Speaker-independent auditory attention decoding without access to clean speech sources", "publication_date": "2019-05-00", "reason": "This paper is highly relevant as it addresses the challenge of auditory attention decoding in real-world scenarios with mixed sounds, a limitation that the current paper aims to improve upon."}, {"fullname_first_author": "Mohammad Jalilpour Monesi", "paper_title": "An LSTM based architecture to relate speech stimulus to EEG", "publication_date": "2020-00-00", "reason": "This paper is cited as an example of previous research that used LSTM networks for auditory attention decoding, and the current paper improves upon this approach by incorporating spatial distribution and long-range temporal dependency information."}, {"fullname_first_author": "Nima Mesgarani", "paper_title": "Selective cortical representation of attended speaker in multi-talker speech perception", "publication_date": "2012-00-00", "reason": "This work is foundational to the field of auditory attention detection as it demonstrates a clear connection between auditory attention and brain activity, which is the basis for EEG-based approaches to auditory attention detection."}, {"fullname_first_author": "James A O'sullivan", "paper_title": "Attentional selection in a cocktail party environment can be decoded from single-trial EEG", "publication_date": "2015-00-00", "reason": "This paper is cited as an example of previous research that decoded auditory attention from EEG signals, which the current work aims to improve upon by enhancing the capturing of spatiotemporal features and reducing parameters."}, {"fullname_first_author": "Siqi Cai", "paper_title": "Low-latency auditory spatial attention detection based on spectro-spatial features from EEG", "publication_date": "2021-00-00", "reason": "This paper is relevant as it is one of the state-of-the-art models that the current paper aims to improve upon, which the current paper achieves with a significant reduction in parameters."}]}