[{"figure_path": "8Fxqn1tZM1/tables/tables_7_1.jpg", "caption": "Table 1: INR classification on MNIST, F-MNIST, CIFAR-10 and Aug. CIFAR-10. We train all methods on 3 seeds and report the mean and std. (*) denotes the baselines trained by us and we report the rest as in the corresponding papers. Colours denote First, Second and Third.", "description": "This table presents the results of INR classification experiments conducted on four datasets: MNIST, F-MNIST, CIFAR-10, and Augmented CIFAR-10.  Multiple methods were used, including the authors' ScaleGMN and a baseline MLP.  The table shows the mean and standard deviation of the test accuracy across three different random seeds.  Asterisks (*) indicate baselines whose results are reported as they appear in the original papers, whereas the others are newly trained by the authors of this paper for direct comparison.  Colors highlight the top three performing methods for each dataset.", "section": "6 Experiments"}, {"figure_path": "8Fxqn1tZM1/tables/tables_7_2.jpg", "caption": "Table 2: Generalization pred.: Kendall-τ on subsets of SmallCNN Zoo w/ ReLU/Tanh activations.", "description": "This table presents the Kendall-τ correlation results for generalisation prediction on subsets of the SmallCNN Zoo dataset.  The results are broken down by activation function (ReLU or Tanh) and dataset (CIFAR-10-GS or SVHN-GS).  The table compares the performance of ScaleGMN and ScaleGMN-B against various baseline methods.  Higher Kendall-τ scores indicate better performance in predicting the generalization ability of the CNNs.", "section": "6 Experiments"}, {"figure_path": "8Fxqn1tZM1/tables/tables_8_1.jpg", "caption": "Table 3: Dilating MNIST INRs. MSE between the reconstructed and ground-truth image.", "description": "This table presents the Mean Squared Error (MSE) results for the task of dilating MNIST INRs (Implicit Neural Representations).  It compares the performance of several methods, including a simple Multilayer Perceptron (MLP), and several state-of-the-art metanetworks such as DWS [54], NFNNP/NFNHNP [85], NG-GNN [33] and the proposed ScaleGMN and ScaleGMN-B. Lower MSE values indicate better performance in reconstructing the dilated images.", "section": "6 Experiments"}, {"figure_path": "8Fxqn1tZM1/tables/tables_8_2.jpg", "caption": "Table 1: INR classification on MNIST, F-MNIST, CIFAR-10 and Aug. CIFAR-10. We train all methods on 3 seeds and report the mean and std. (*) denotes the baselines trained by us and we report the rest as in the corresponding papers. Colours denote First, Second and Third.", "description": "The table presents the results of INR classification experiments on four datasets: MNIST, F-MNIST, CIFAR-10, and Augmented CIFAR-10.  Multiple methods, including the proposed ScaleGMN and several baselines, are evaluated based on their mean and standard deviation of accuracy across three different random seeds.  The table highlights the superior performance of ScaleGMN, especially in comparison to other state-of-the-art methods.", "section": "6 Experiments"}]