[{"figure_path": "CehOqpvOxG/tables/tables_7_1.jpg", "caption": "Table 1: Comparison results on the single kernel setting. The best and second best results are denoted in bold and underlined, respectively.", "description": "This table presents a comparison of different clustering methods on six datasets using a single kernel.  The methods compared include K-means, Kernel K-Means (KKM), Spectral Clustering (SC), three state-of-the-art fair clustering methods (SpFC, VFC, FFC), and the proposed Fair Kernel K-Means (FKKM) and its ablation version (FKKM-f).  The table shows the performance of each method in terms of accuracy (ACC), Normalized Mutual Information (NMI), balance (Bal), and Minimal Normalized Conditional Entropy (MNCE).  These metrics assess both the clustering accuracy and the fairness of the results. The best performing methods for each metric are highlighted in bold.", "section": "5 Experiments"}, {"figure_path": "CehOqpvOxG/tables/tables_8_1.jpg", "caption": "Table 2: Comparison results on the multiple kernel setting. The best and second best results are denoted in bold and underlined, respectively.", "description": "This table presents the comparison results of the proposed Fair Multiple Kernel K-Means (FMKKM) method against nine state-of-the-art Multiple Kernel K-Means (MKKM) methods across six benchmark datasets.  The performance is evaluated using four metrics: Accuracy (ACC), Normalized Mutual Information (NMI), Balance (Bal), and Minimal Normalized Conditional Entropy (MNCE).  The best and second-best results for each dataset and metric are highlighted.", "section": "5.2 Experimental Results"}, {"figure_path": "CehOqpvOxG/tables/tables_13_1.jpg", "caption": "Table 1: Comparison results on the single kernel setting. The best and second best results are denoted in bold and underlined, respectively.", "description": "This table presents a comparison of different clustering methods on various datasets using a single kernel.  The methods compared include standard K-means, Kernel K-means (KKM), Spectral Clustering (SC), three state-of-the-art fair clustering methods (SpFC, VFC, FFC), and the proposed Fair Kernel K-means (FKKM) and its ablation version (FKKM-f).  The evaluation metrics used are Accuracy (ACC), Normalized Mutual Information (NMI), Balance (Bal), and Minimal Normalized Conditional Entropy (MNCE).  The table shows the performance of each method in terms of both clustering accuracy and fairness.", "section": "5 Experiments"}, {"figure_path": "CehOqpvOxG/tables/tables_18_1.jpg", "caption": "Table 1: Comparison results on the single kernel setting. The best and second best results are denoted in bold and underlined, respectively.", "description": "This table presents a comparison of different clustering methods' performance on several datasets in a single-kernel setting.  The methods compared include K-means, Kernel K-means (KKM), Spectral Clustering (SC), three state-of-the-art fair clustering methods (SpFC, VFC, FFC), and the proposed Fair Kernel K-Means (FKKM) and its fair-agnostic counterpart (FKKM-f). The evaluation metrics used are Accuracy (ACC), Normalized Mutual Information (NMI), Balance (Bal), and Minimal Normalized Conditional Entropy (MNCE).  Higher ACC and NMI values are preferred, while higher Bal and MNCE indicate better fairness.", "section": "5 Experiments"}]