[{"figure_path": "YYY5lzE547/tables/tables_2_1.jpg", "caption": "Table 1: Average run-times (s) of cold-/warm-start Ford Fulkerson (FF) and Push-Relabel (PR)", "description": "This table presents the average running times in seconds for both Ford-Fulkerson and Push-Relabel algorithms, categorized by whether they were warm-started or not.  The results are broken down by image group (BIRDHOUSE, HEAD, SHOE, DOG) and image size (30x30, 60x60, 120x120, 240x240, 480x480 pixels).  'NA' indicates that the runtime exceeded one hour.", "section": "4 Empirical Results"}, {"figure_path": "YYY5lzE547/tables/tables_4_1.jpg", "caption": "Table 1: Average run-times (s) of cold-/warm-start Ford Fulkerson (FF) and Push-Relabel (PR)", "description": "This table presents the average running times in seconds for both cold-start and warm-start versions of the Ford-Fulkerson and Push-Relabel algorithms on four different image datasets (BIRDHOUSE, HEAD, SHOE, DOG).  Each dataset is tested with different image resolutions (30x30, 60x60, 120x120, 240x240, 480x480 pixels). The results show the running times for each algorithm and its warm-started version.  Note that 'NA' indicates that the running time exceeded one hour.", "section": "4 Empirical Results"}, {"figure_path": "YYY5lzE547/tables/tables_9_1.jpg", "caption": "Table 1: Average run-times (s) of cold-/warm-start Ford Fulkerson (FF) and Push-Relabel (PR)", "description": "This table presents the average running times in seconds for both Ford-Fulkerson and Push-Relabel algorithms, with and without warm-starting, on various image datasets of different sizes.  The image datasets are categorized into four groups: BIRDHOUSE, HEAD, SHOE, and DOG.  Each group contains images with resolutions ranging from 30x30 to 480x480 pixels. The table shows that warm-starting Push-Relabel significantly improves performance for larger images.", "section": "Empirical Results"}, {"figure_path": "YYY5lzE547/tables/tables_9_2.jpg", "caption": "Table 2: Running time of warm-start Push-Relabel break down, on BIRDHOUSE", "description": "This table breaks down the running time of the warm-start Push-Relabel algorithm into three phases: 1) finding a cut-saturating pseudo-flow; 2) fixing excess on the t-side; and 3) fixing deficits on the s-side.  The table shows the average time (in seconds) spent in each phase for different image sizes (30x30, 60x60, 120x120, 240x240, and 480x480 pixels) from the BIRDHOUSE image dataset.  It demonstrates how the time spent in each phase changes as the image size increases.", "section": "4 Empirical Results"}, {"figure_path": "YYY5lzE547/tables/tables_12_1.jpg", "caption": "Table 1: Average run-times (s) of cold-/warm-start Ford Fulkerson (FF) and Push-Relabel (PR)", "description": "The table presents the average running times in seconds for both Ford-Fulkerson and Push-Relabel algorithms on four different image groups (BIRDHOUSE, HEAD, SHOE, DOG) with varying image resolutions (30x30, 60x60, 120x120, 240x240, 480x480 pixels).  It compares the performance of both algorithms when warm-started (using a prediction of the flow) against their cold-started counterparts. The results show that while the warm-started versions might be slightly slower than the cold-started counterparts on small images, they demonstrate a significant performance gain as the image size increases.  Note that 'NA' indicates runtimes exceeding one hour. ", "section": "4 Empirical Results"}, {"figure_path": "YYY5lzE547/tables/tables_15_1.jpg", "caption": "Table 1: Average run-times (s) of cold-/warm-start Ford Fulkerson (FF) and Push-Relabel (PR)", "description": "This table presents the average running times in seconds for both Ford-Fulkerson and Push-Relabel algorithms, comparing their cold-start and warm-start versions across different image datasets and resolutions.  The image datasets (BIRDHOUSE, HEAD, SHOE, DOG) are categorized by image size (30x30 to 480x480 pixels).  The results show the running time for both cold-start and warm-start versions of each algorithm, allowing for comparison between the two algorithms' performance and efficiency with warm-starting.", "section": "Empirical Results"}]