{"references": [{"fullname_first_author": "S. Abu-El-Haija", "paper_title": "Mixhop: Higher-order graph convolutional architectures via sparsified neighborhood mixing", "publication_date": "2019-00-00", "reason": "This paper introduces MixHop, a higher-order graph convolutional architecture that addresses the limitations of previous methods in capturing higher-order relationships between nodes, which is crucial for improving GNN performance."}, {"fullname_first_author": "T. N. Kipf", "paper_title": "Semi-supervised classification with graph convolutional networks", "publication_date": "2016-00-00", "reason": "This seminal work introduced Graph Convolutional Networks (GCNs), a foundational model for graph neural networks that has significantly impacted the field and is widely used as a baseline model in numerous studies."}, {"fullname_first_author": "W. Hamilton", "paper_title": "Inductive representation learning on large graphs", "publication_date": "2017-00-00", "reason": "This paper introduced GraphSage, a powerful inductive learning method for graph representation learning that is capable of handling large-scale graph datasets and has been widely adopted in the GNN community."}, {"fullname_first_author": "Y. Ma", "paper_title": "Is homophily a necessity for graph neural networks?", "publication_date": "2021-00-00", "reason": "This paper challenges the widely held assumption that homophily is necessary for effective GNNs by empirically demonstrating that GNNs can perform well on datasets with low homophily, advancing the understanding of the relationship between homophily and GNN performance."}, {"fullname_first_author": "S. Luan", "paper_title": "Revisiting heterophily for graph neural networks", "publication_date": "2022-00-00", "reason": "This paper provides a comprehensive investigation into the impact of heterophily on GNN performance, identifying a \"mid-homophily pitfall\" and proposing novel metrics to better quantify the influence of heterophily, significantly advancing the understanding of graph homophily."}]}