[{"figure_path": "4lGPSbGe11/figures/figures_1_1.jpg", "caption": "Figure 1: Evaluation biases and coverage probabilities of interval estimates (with nominal level 90%) for the mean-squared error evaluation of a fitted random forest regressor (default setup in scikit-learn in [49] with n\n= 4 subsamples in each tree), across 500 experimental replications. The bar chart shows the evaluation bias, defined as the absolute mean difference between the estimated and true performance (the vertical line at the top of each bar shows the corresponding standard error). The lines show the coverage probabilities.", "description": "The figure shows the evaluation bias and coverage probabilities of interval estimates for different cross-validation methods (2-fold, 5-fold, LOOCV) and the plug-in approach.  The bar chart displays the bias, showing how much the estimated performance deviates from the true performance.  The lines show the coverage probability, indicating how often the true performance falls within the calculated confidence intervals.  The results are based on 500 experimental replications of a random forest regressor trained on different sample sizes (n).", "section": "1 Introduction"}, {"figure_path": "4lGPSbGe11/figures/figures_5_1.jpg", "caption": "Figure 1: Evaluation biases and coverage probabilities of interval estimates (with nominal level 90%) for the mean-squared error evaluation of a fitted random forest regressor (default setup in scikit-learn in [49] with n°.4 subsamples in each tree), across 500 experimental replications. The bar chart shows the evaluation bias, defined as the absolute mean difference between the estimated and true performance (the vertical line at the top of each bar shows the corresponding standard error). The lines show the coverage probabilities.", "description": "The figure compares the evaluation bias and coverage probability of four different methods for estimating out-of-sample performance: plug-in, 2-fold CV, 5-fold CV, and LOOCV.  The results are shown for a random forest regressor across various sample sizes and 500 experimental replications.  The bar chart visualizes the bias, while the lines depict coverage probability.  It showcases how different methods perform in terms of bias and coverage accuracy in estimating out-of-sample model performance.", "section": "1 Introduction"}]