[{"figure_path": "ZJ2ONmSgCS/tables/tables_6_1.jpg", "caption": "Table 1: Performance of attacks against diffusion-based purification on CIFAR10. Metrics include Avg./Wor. Rob, (%) and iterations (it.) taken to reach 90% best performance (in parentheses, failure to reach is noted as N/A). Attack algorithms include SOTA white-box attacks with EOT: BPDA [1], PGD [21], AA [4], DA [13], and DiffHammer (DH, ours); and transfer-based attacks (denoted by †): DMI [29], TMI [8], VMI [27], SVRE [30].", "description": "This table presents a comparison of various attack methods against three different diffusion-based purification defenses (DiffPure, GDMP, and LM) on the CIFAR-10 dataset.  The table shows the average robustness (Avg.Rob), worst-case robustness (Wor.Rob), and the number of iterations it took for each attack to reach 90% of its best performance.  Both white-box attacks (using Expectation of Transformation or EOT) and transfer-based attacks are included for comparison.  The results highlight the effectiveness and efficiency of the proposed DiffHammer attack.", "section": "4 Experiments"}, {"figure_path": "ZJ2ONmSgCS/tables/tables_7_1.jpg", "caption": "Table 2: Performance of attacks against diffusion-based purification on ImageNettete [12].", "description": "This table presents the results of various attacks against three different diffusion-based purification methods (DiffPure, GDMP, and LM) on the ImageNette dataset.  It shows the average robustness (Avg.Rob) and worst-case robustness (Wor.Rob) achieved by each defense against several state-of-the-art attacks (BPDA, DA/AA, PGD, and DiffHammer). The numbers in parentheses indicate the number of iterations taken to reach 90% of the best attack performance.  The table allows for a comparison of the effectiveness and efficiency of different attacks against each purification method.", "section": "4 Experiments"}, {"figure_path": "ZJ2ONmSgCS/tables/tables_8_1.jpg", "caption": "Table 3: Effectiveness (Avg.Rob / Wor.Rob, %) of different attacks on robust model with purification under l∞: 8/255 settings, including TRADES [33] and AWP [28]. The original adversarial robustness (Rob) without purification is listed in parentheses.", "description": "This table presents the average and worst-case robustness (Avg.Rob/Wor.Rob) of three robust models (AWP, TRADES) against different attacks under 8/255 l∞ setting. Each robust model is tested with three different purification methods (DiffPure, GDMP, LM) and four different attack methods (BPDA, PGD, DA/AA, DH). The original robustness of the model without purification is included for comparison.", "section": "4.3 Gradient dilemma and transfer-based attack"}, {"figure_path": "ZJ2ONmSgCS/tables/tables_8_2.jpg", "caption": "Table 4: Performance difference (Avg.Rob / Wor.Rob, %) from default settings with l∞ : 8/255.", "description": "This table presents the results of an ablation study conducted to evaluate the impact of different components of the DiffHammer algorithm on the average and worst-case robustness of three different diffusion-based purification methods (DiffPure, GDMP, and LM).  The ablation study varies the following components: using only approximate gradients (Eqφ), using only the full gradients (Eqx), the hyperparameter α (controlling gradient interpolation), and the number of resubmissions N (for N-evaluation).  The values shown represent the difference in average robustness (Avg.Rob) and worst-case robustness (Wor.Rob) compared to the default setting of the DiffHammer.", "section": "4.5 Ablation study"}, {"figure_path": "ZJ2ONmSgCS/tables/tables_15_1.jpg", "caption": "Table 5: Performance of attacks against diffusion-based purification on CIFAR100.", "description": "This table presents the results of various attacks against three different diffusion-based purification methods (DiffPure, GDMP, and LM) on the CIFAR100 dataset.  The metrics used to evaluate the attacks are Average Robustness (Avg.Rob) and Worst-case Robustness (Wor.Rob), both expressed as percentages.  The number of iterations (it.) taken by each attack to reach its best performance is also reported. The table shows the performance of different attacks, including BPDA, DA/AA, PGD and DiffHammer (DH), against each defense. N/A indicates that the attack did not reach 90% best performance within 150 iterations.", "section": "4.1 Experimental Setup"}, {"figure_path": "ZJ2ONmSgCS/tables/tables_15_2.jpg", "caption": "Table 6: Performance of attacks against DiffSmooth [34] on CIFAR10.", "description": "This table presents the results of various attacks against the DiffSmooth defense on the CIFAR10 dataset.  The attacks are evaluated under two different l2 settings (l2: 0.5 and l2: 1.0).  The metrics shown are the average robustness (Avg.Rob) and worst-case robustness (Wor.Rob), along with the number of iterations (it.) taken to achieve 90% of the best performance for each attack method. The attacks used include BPDA, DA, PGD, and DiffHammer (DH).", "section": "4 Experiments"}, {"figure_path": "ZJ2ONmSgCS/tables/tables_16_1.jpg", "caption": "Table 7: Performance of substitute gradient based attacks against diffusion-based purification on CIFAR10.", "description": "This table presents the results of various substitute gradient-based attacks against three different diffusion-based purification methods (DiffPure, GDMP, and LM) on the CIFAR10 dataset.  The attacks used are Score [31], Full [31], Adjoint [22], and DiffHammer (DH). The metrics shown are Average Robustness (Avg.Rob) and Worst-case Robustness (Wor.Rob), both represented as percentages.  Lower values indicate more effective attacks.", "section": "4 Experiments"}]