[{"figure_path": "AYq6GxxrrY/tables/tables_5_1.jpg", "caption": "Table 1: Comparison of Boltzmann Generators with different architectures for the single molecular system alanine dipeptide. Errors are computed over five runs. The results for the Boltzmann Generator and backbone encoding (BG + backbone) for the semi-empirical force field are taken from [23].", "description": "This table compares the performance of different Boltzmann Generator architectures (BG + backbone from prior work and the newly proposed TBG + full) for the alanine dipeptide molecule.  It shows the negative log-likelihood (NLL) and effective sample size (ESS) for both a semi-empirical and classical force field. Lower NLL indicates better model fit, and higher ESS indicates more efficient sampling. The results demonstrate that the proposed TBG + full architecture outperforms the existing BG + backbone architecture in terms of both NLL and ESS, highlighting its improved accuracy and efficiency.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/tables/tables_8_1.jpg", "caption": "Table 1: Comparison of Boltzmann Generators with different architectures for the single molecular system alanine dipeptide. Errors are computed over five runs. The results for the Boltzmann Generator and backbone encoding (BG + backbone) for the semi-empirical force field are taken from [23].", "description": "This table compares the performance of different Boltzmann Generator architectures (TBG, TBG + backbone, TBG + full) in generating samples for the alanine dipeptide molecule using both semi-empirical and classical force fields.  It shows the negative log-likelihood (NLL), effective sample size (ESS), and percentage of correct configurations for each model.  Lower NLL and higher ESS indicate better performance.  The results for the BG + backbone model from a previous study ([23]) are included for comparison.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/tables/tables_8_2.jpg", "caption": "Table 1: Comparison of Boltzmann Generators with different architectures for the single molecular system alanine dipeptide. Errors are computed over five runs. The results for the Boltzmann Generator and backbone encoding (BG + backbone) for the semi-empirical force field are taken from [23].", "description": "This table compares the performance of different Boltzmann Generator architectures (BG + backbone, TBG + full) on the alanine dipeptide system using both semi-empirical and classical force fields.  It presents the negative log-likelihood (NLL), effective sample size (ESS), and shows that the TBG + full model outperforms the BG + backbone model in terms of both likelihood and sampling efficiency.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/tables/tables_18_1.jpg", "caption": "Table 2: Effective samples size and correct configuration rate for unseen dipeptides across different transferable Boltzmann Generator (TBG) architectures. The values are computed for 8 test dipeptides. See Appendix A.5 for more results.", "description": "This table presents the performance of different transferable Boltzmann Generator architectures on unseen dipeptides, evaluating their efficiency (Effective Sample Size or ESS) and accuracy (percentage of correctly generated configurations).  The results are averaged over 8 test dipeptides, with a reference to Appendix A.5 for a more comprehensive analysis of 100 dipeptides.", "section": "5.2 Dipeptides (2AA)"}, {"figure_path": "AYq6GxxrrY/tables/tables_24_1.jpg", "caption": "Table 1: Comparison of Boltzmann Generators with different architectures for the single molecular system alanine dipeptide. Errors are computed over five runs. The results for the Boltzmann Generator and backbone encoding (BG + backbone) for the semi-empirical force field are taken from [23].", "description": "This table compares the performance of different Boltzmann Generator architectures (BG + backbone, TBG + full) in terms of negative log-likelihood (NLL) and effective sample size (ESS) for alanine dipeptide simulations using both semi-empirical and classical force fields. Lower NLL indicates better performance while higher ESS means more efficient sampling.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/tables/tables_24_2.jpg", "caption": "Table 1: Comparison of Boltzmann Generators with different architectures for the single molecular system alanine dipeptide. Errors are computed over five runs. The results for the Boltzmann Generator and backbone encoding (BG + backbone) for the semi-empirical force field are taken from [23].", "description": "This table compares the performance of different Boltzmann Generator architectures (BG + backbone, TBG + full) for the alanine dipeptide molecule using both semi-empirical and classical force fields.  It shows the negative log-likelihood (NLL), effective sample size (ESS), and the error associated with each method. Lower NLL indicates better model fit, higher ESS reflects better sampling efficiency. The results from a previous study (BG + backbone) are included for comparison.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/tables/tables_25_1.jpg", "caption": "Table 1: Comparison of Boltzmann Generators with different architectures for the single molecular system alanine dipeptide. Errors are computed over five runs. The results for the Boltzmann Generator and backbone encoding (BG + backbone) for the semi-empirical force field are taken from [23].", "description": "This table compares the performance of three different Boltzmann Generator architectures (BG + backbone, TBG + full, and TBG) on the alanine dipeptide molecule using both semi-empirical and classical force fields.  It presents the negative log-likelihood (NLL), effective sample size (ESS), and shows that the TBG + full model significantly outperforms the BG + backbone model in terms of both NLL and ESS for both force fields.", "section": "5.1 Alanine dipeptide"}]