[{"figure_path": "uqWfLgZpV1/tables/tables_5_1.jpg", "caption": "Table 1: Comparison with previous algorithms. D is the number of random features [Rahimi and Recht, 2007]. Time (s) is the per-round time complexity on client.", "description": "This table compares the proposed algorithm, FOMD-OMS, with two existing federated online multi-kernel learning algorithms, eM-KOFL and POF-MKL.  The comparison includes the regret bound, per-round time complexity on the client, and the communication cost (download).  It highlights that FOMD-OMS achieves a better regret bound and lower computational and communication costs than the other two algorithms.", "section": "4.2 Comparison with Previous Work"}, {"figure_path": "uqWfLgZpV1/tables/tables_9_1.jpg", "caption": "Table 1: Comparison with previous algorithms. D is the number of random features [Rahimi and Recht, 2007]. Time (s) is the per-round time complexity on client.", "description": "This table compares the proposed FOMD-OMS algorithm with two existing federated online multi-kernel learning (OMKL) algorithms: eM-KOFL and POF-MKL.  The comparison includes the regret bound achieved by each algorithm, the per-round time complexity on a single client, and the communication cost (in bits) for downloading information from the server.  The table highlights that FOMD-OMS offers improvements in both computational cost and communication overhead compared to the existing methods.", "section": "4.2 Comparison with Previous Work"}, {"figure_path": "uqWfLgZpV1/tables/tables_14_1.jpg", "caption": "Table 1: Comparison with previous algorithms. D is the number of random features [Rahimi and Recht, 2007]. Time (s) is the per-round time complexity on client.", "description": "The table compares the proposed FOMD-OMS algorithm with two previously published federated online multi-kernel learning algorithms (eM-KOFL and POF-MKL) in terms of regret bound, per-round time complexity on client, and communication cost (download in bits).  It highlights that FOMD-OMS offers improved regret bounds and reduced computational and communication costs compared to existing methods.", "section": "4.2 Comparison with Previous Work"}, {"figure_path": "uqWfLgZpV1/tables/tables_15_1.jpg", "caption": "Table 1: Comparison with previous algorithms. D is the number of random features [Rahimi and Recht, 2007]. Time (s) is the per-round time complexity on client.", "description": "This table compares the proposed FOMD-OMS algorithm with two existing federated online multi-kernel learning (OMKL) algorithms, eM-KOFL and POF-MKL.  The comparison includes the regret bound achieved by each algorithm, the per-round time complexity on each client, and the communication cost (in bits) for downloading model parameters.  The results highlight that FOMD-OMS achieves a better regret bound with significantly lower computational and communication costs than the other two algorithms.", "section": "4.2 Comparison with Previous Work"}, {"figure_path": "uqWfLgZpV1/tables/tables_16_1.jpg", "caption": "Table 1: Comparison with previous algorithms. D is the number of random features [Rahimi and Recht, 2007]. Time (s) is the per-round time complexity on client.", "description": "The table compares the proposed FOMD-OMS algorithm with two existing federated online multi-kernel learning (OMKL) algorithms, eM-KOFL and POF-MKL.  It shows the regret bounds, per-round time complexity on the client, and download cost (in bits) for each algorithm.  The results highlight that FOMD-OMS achieves better regret bounds and lower computational and communication costs than the existing algorithms.", "section": "4.2 Comparison with Previous Work"}]