[{"figure_path": "UE6CeRMnq3/tables/tables_7_1.jpg", "caption": "Table 1: Imputation performance of various methods over real datasets with different missing rates", "description": "This table presents the results of a comparative study evaluating the performance of various time series imputation methods on three real-world datasets with varying missing data rates.  The methods are compared using two metrics: RMSE (Root Mean Squared Error) and MAE (Mean Absolute Error). Lower values indicate better imputation accuracy.  The table allows for a comparison of different imputation techniques under different data conditions and missing rates, highlighting their strengths and weaknesses.", "section": "4.2 Comparative Experiments"}, {"figure_path": "UE6CeRMnq3/tables/tables_8_1.jpg", "caption": "Table 2: Ablation analysis of FGTI with 10% missing values", "description": "This table presents the ablation study results for the Frequency-aware Generative Models for Multivariate Time Series Imputation (FGTI) model.  The study evaluates the impact of removing different components of the FGTI model on the imputation performance using RMSE and MAE metrics across three datasets (KDD, Guangzhou, and PhysioNet). By systematically removing components such as cross-domain learning, frequency condition, dominant-frequency filter, and high-frequency filter, the table reveals the relative contribution of each component to the overall accuracy of the model.", "section": "4.3 Ablation Analysis"}, {"figure_path": "UE6CeRMnq3/tables/tables_19_1.jpg", "caption": "Table 3: Varying the mask ratio of the imputation target when training the denoising network with 10% missing values", "description": "This table presents the imputation performance (RMSE and MAE) of the FGTI model on three datasets (KDD, Guangzhou, and PhysioNet) with varying mask ratios (10%, 20%, 30%, 40%, 50%, and random ratio) during the training of the denoising network.  The mask ratio represents the percentage of observed values used as the imputation target. A random ratio means a different ratio is used at each training step, instead of a fixed masking ratio. The table shows how the imputation accuracy changes with different mask ratios for each dataset.", "section": "4.4 Supplemental Experiments"}, {"figure_path": "UE6CeRMnq3/tables/tables_19_2.jpg", "caption": "Table 4: Varying the mask pattern of the imputation target when training the denoising network with 10% missing values", "description": "This table presents the imputation performance (RMSE and MAE) of the FGTI model trained with different mask patterns (block missing, mix missing, random missing) on three datasets (KDD, Guangzhou, PhysioNet). The goal is to evaluate the impact of the mask pattern on the model's ability to impute missing values when 10% of the data is missing.", "section": "4.4 Supplemental Experiments"}, {"figure_path": "UE6CeRMnq3/tables/tables_20_1.jpg", "caption": "Table 1: Imputation performance of various methods over real datasets with different missing rates", "description": "This table presents the results of several imputation methods on three real-world datasets with varying missing data rates (10%, 20%, 30%, and 40%).  The methods are compared using RMSE and MAE metrics to assess imputation accuracy.  The datasets used are KDD, Guangzhou, and PhysioNet, each representing a different type of multivariate time series data. The table allows for a comparison of the effectiveness of different approaches in handling missing data across different datasets and missing rates.", "section": "4.2 Comparative Experiments"}, {"figure_path": "UE6CeRMnq3/tables/tables_20_2.jpg", "caption": "Table 6: CRPS of various probabilistic generative methods with different missing mechanisms", "description": "This table presents the Continuous Ranked Probability Score (CRPS) for various probabilistic generative models under different missing data mechanisms (MCAR, MAR, MNAR).  The CRPS evaluates the discrepancy between predicted and actual probability distributions. Lower CRPS values indicate better performance.", "section": "A.5 Comparative Experiments of Generative Baselines"}, {"figure_path": "UE6CeRMnq3/tables/tables_21_1.jpg", "caption": "Table 7: Imputation results for the trend, seasonal and residual terms of KDD dataset with 10% missing values", "description": "This table presents the imputation results (RMSE and MAE) for the trend, seasonal, and residual components of the KDD dataset when 10% of the data is missing.  It compares the performance of the FGTI model against three ablation studies: removing the frequency condition, removing the dominant-frequency filter, and removing the high-frequency filter.  The results show the impact of each component (high-frequency, dominant-frequency, and frequency condition) on the accuracy of imputing each of the three time series components.", "section": "4.5 Case Study"}]