[{"figure_path": "5FHzrRGOKR/figures/figures_1_1.jpg", "caption": "Figure 1: The Federated Behavioural Planes framework enables the visualization of client behaviour in FL from two perspectives: predictive performance (Error Behavioural Plane) and decision-making processes (Counterfactuals Behavioural Plane). It highlights client trajectories and similarities, offering insights into client interactions and supporting the introduction of a new and effective robust aggregation mechanism with performance that surpasses state-of-the-art baselines.", "description": "This figure illustrates the Federated Behavioral Planes (FBPs) framework.  It shows how FBPs visualize client behavior in federated learning (FL) using two planes: the Error Behavioral Plane (EBP) representing predictive performance and the Counterfactuals Behavioral Plane (CBP) representing decision-making processes. Client trajectories and clusters are shown, highlighting how FBPs can reveal insights into client interactions and inform a new robust aggregation method.", "section": "3 Federated Behavioural Planes"}, {"figure_path": "5FHzrRGOKR/figures/figures_6_1.jpg", "caption": "Figure 2: Relative variation of client-proximity across datasets.", "description": "This box plot displays the relative proximity values for three different datasets (Diabetes, Breast Cancer, Synthetic) under non-IID settings. The relative proximity metric is calculated as (Pglobal - Plocal)/Pglobal, where Pglobal represents the proximity of the globally trained model and Plocal is the proximity of the client-specific model. The plot visually shows how much the client-specific models deviate from the global model, indicating the level of client-specific adaptation. The higher values of relative proximity indicate a higher level of client-specific adaptation.", "section": "5 Key Findings & Results"}, {"figure_path": "5FHzrRGOKR/figures/figures_7_1.jpg", "caption": "Figure 3: Client trajectories on Counterfactuals and Error Behavioural Planes for Synthetic, Breast Cancer, and small-MNIST datasets, corresponding to Inverted-loss, Crafted-noise, and Inverted-gradient attacks, respectively. The figure highlights the deviation of the malicious client (red) from honest clients, who tend to cluster together over time, along with the previous-round global model (S).", "description": "This figure visualizes client behavior in Federated Learning (FL) using Federated Behavioral Planes (FBPs).  It shows trajectories of clients on two planes: the Error Behavioural Plane (EBP) representing predictive performance, and the Counterfactual Behavioural Plane (CBP) illustrating decision-making processes.  Three datasets (Synthetic, Breast Cancer, small-MNIST) are shown, each with a different attack (Inverted-loss, Crafted-noise, Inverted-gradient).  The plots reveal how malicious clients (red) deviate from the behavior of honest clients, which tend to cluster together, and how these behaviors impact the overall model (S).", "section": "Explaining FL training"}, {"figure_path": "5FHzrRGOKR/figures/figures_8_1.jpg", "caption": "Figure 3: Client trajectories on Counterfactuals and Error Behavioural Planes for Synthetic, Breast Cancer, and small-MNIST datasets, corresponding to Inverted-loss, Crafted-noise, and Inverted-gradient attacks, respectively. The figure highlights the deviation of the malicious client (red) from honest clients, who tend to cluster together over time, along with the previous-round global model (S)", "description": "This figure shows the trajectories of clients in Federated Behavioural Planes (FBPs) under different attack scenarios.  It uses three datasets (Synthetic, Breast Cancer, small-MNIST) and three attack types (Inverted-loss, Crafted-noise, Inverted-gradient). Each point on the plot represents a client's state at a given training round, and the trajectory shows how the client's behavior changes over time. The plots reveal distinct patterns in clients' predictive performance and decision-making processes under different attacks.  Malicious clients (red) deviate from the clusters of honest clients, and FBPs enables the identification of these malicious clients.", "section": "5.2 Explaining FL training"}, {"figure_path": "5FHzrRGOKR/figures/figures_16_1.jpg", "caption": "Figure 1: The Federated Behavioural Planes framework enables the visualization of client behaviour in FL from two perspectives: predictive performance (Error Behavioural Plane) and decision-making processes (Counterfactuals Behavioural Plane). It highlights client trajectories and similarities, offering insights into client interactions and supporting the introduction of a new and effective robust aggregation mechanism with performance that surpasses state-of-the-art baselines.", "description": "This figure illustrates the Federated Behavioural Planes (FBPs) framework, which visualizes client behavior in Federated Learning (FL) using two planes: the Error Behavioural Plane (EBP) showing predictive performance and the Counterfactuals Behavioural Plane (CBP) showing decision-making processes.  It demonstrates how FBPs track client trajectories, identify similarities in client behavior, and support the development of a novel robust aggregation mechanism, Federated Behavioural Shields.", "section": "3 Federated Behavioural Planes"}, {"figure_path": "5FHzrRGOKR/figures/figures_19_1.jpg", "caption": "Figure 3: Client trajectories on Counterfactuals and Error Behavioural Planes for Synthetic, Breast Cancer, and small-MNIST datasets, corresponding to Inverted-loss, Crafted-noise, and Inverted-gradient attacks, respectively. The figure highlights the deviation of the malicious client (red) from honest clients, who tend to cluster together over time, along with the previous-round global model (S)", "description": "This figure shows the trajectories of clients in the Federated Behavioural Planes (FBPs) framework for three different datasets under various attack scenarios.  The trajectories visualize client behavior from two perspectives: predictive performance (Error Behavioural Plane) and decision-making processes (Counterfactual Behavioural Plane). The figure highlights how malicious clients (red) deviate from the behavior of honest clients, which tend to form clusters over time. The trajectories provide insights into the dynamics of federated learning systems.", "section": "5.2 Explaining FL training"}, {"figure_path": "5FHzrRGOKR/figures/figures_20_1.jpg", "caption": "Figure 6: (a) Synthetic dataset. (b) Counterfactuals generated by the server on the synthetic test set. (c) Counterfactuals for Client 4 after adaptation. (d) Counterfactuals for Client 8, similar to (c). Notably, Client 4, with a data distribution perpendicular to the decision boundary, achieves effective adaptation, whereas Client 8 encounters more challenges.", "description": "This figure visualizes the synthetic data distribution and generated counterfactuals for different clients. The synthetic dataset is designed with a linear decision boundary, allowing for a controlled study of data distribution impact on counterfactual generation.  The figure shows that Client 4, whose data distribution is perpendicular to the decision boundary, achieves effective adaptation when the counterfactual generator is adapted to client-specific data; conversely, Client 8, whose data is close to the decision boundary, exhibits more challenges in the adaptation process. This highlights the influence of data distribution on the effectiveness of counterfactual adaptation in federated learning.", "section": "5.1 Counterfactuals in FL"}, {"figure_path": "5FHzrRGOKR/figures/figures_21_1.jpg", "caption": "Figure 7: Relative variation of client-proximity across Diabetes, Breast Cancer, and Synthetic datasets in both IID and non-IID settings. Client-personalization is particularly effective in non-IID settings.", "description": "This figure compares the relative proximity (a measure of similarity) between global and client-specific models for three datasets (Diabetes, Breast Cancer, and Synthetic) under both IID (independently and identically distributed data) and non-IID (non-independently and identically distributed data) settings.  The boxplots show that client-specific adaptation of the counterfactual generator reduces the proximity more in the non-IID setting, suggesting that personalization is more beneficial when data is not evenly distributed across clients.", "section": "5.2 Explaining FL training"}, {"figure_path": "5FHzrRGOKR/figures/figures_21_2.jpg", "caption": "Figure 2: Relative variation of client-proximity across datasets.", "description": "This box plot displays the relative variation of client proximity across three datasets (Diabetes, Breast Cancer, and Synthetic) for VCNet.  The relative proximity is calculated as (Pglobal - Plocal)/Pglobal, where Pglobal represents the proximity of the global counterfactual model and Plocal represents the proximity of the client-specific counterfactual model. The plot shows a significant reduction in relative proximity for all three datasets, indicating that client-specific adaptation significantly improves the personalization of counterfactuals.  Non-IID settings are used.", "section": "5.1 Counterfactuals in FL"}, {"figure_path": "5FHzrRGOKR/figures/figures_22_1.jpg", "caption": "Figure 3: Client trajectories on Counterfactuals and Error Behavioural Planes for Synthetic, Breast Cancer, and small-MNIST datasets, corresponding to Inverted-loss, Crafted-noise, and Inverted-gradient attacks, respectively. The figure highlights the deviation of the malicious client (red) from honest clients, who tend to cluster together over time, along with the previous-round global model (S)", "description": "This figure displays the Federated Behavioural Planes (FBPs) for three different datasets (Synthetic, Breast Cancer, and small-MNIST) under three different attacks (Inverted-loss, Crafted-noise, and Inverted-gradient).  Each plane shows client trajectories over time.  The trajectories of honest clients cluster together, while the trajectory of a malicious client (shown in red) deviates significantly from these clusters. The figure demonstrates how FBPs can visualize and explain the evolving behavior of clients in federated learning, highlighting the impact of malicious clients on the global model.", "section": "5.2 Explaining FL training"}, {"figure_path": "5FHzrRGOKR/figures/figures_23_1.jpg", "caption": "Figure 3: Client trajectories on Counterfactuals and Error Behavioural Planes for Synthetic, Breast Cancer, and small-MNIST datasets, corresponding to Inverted-loss, Crafted-noise, and Inverted-gradient attacks, respectively. The figure highlights the deviation of the malicious client (red) from honest clients, who tend to cluster together over time, along with the previous-round global model (S)", "description": "This figure visualizes client behavior in Federated Learning (FL) using Federated Behavioral Planes (FBPs).  It shows trajectories of clients in two behavioral planes: the Error Behavioural Plane (EBP) representing predictive performance and the Counterfactual Behavioural Plane (CBP) illustrating decision-making processes.  The figure demonstrates how clients behave under different attack types (Inverted-loss, Crafted-noise, and Inverted-gradient) on three different datasets (Synthetic, Breast Cancer, and small-MNIST).  Honest clients tend to cluster together, while malicious clients deviate significantly from the cluster and the global model, allowing for easy identification.", "section": "5.2 Explaining FL training"}, {"figure_path": "5FHzrRGOKR/figures/figures_24_1.jpg", "caption": "Figure 10: Mean and 95% confidence interval of client scores assigned by our FBSs over 200 rounds on CIFAR-10 across different attacks.", "description": "This figure visualizes the effectiveness of Federated Behavioral Shields (FBSs) in identifying malicious clients across multiple attacks.  The plot shows the mean and 95% confidence interval of client scores over 200 training rounds for honest clients, malicious clients, and a client with an unfair validation set (meaning its data distribution is not well-represented in the validation set used to compute the scores). The results demonstrate that FBSs effectively distinguish malicious clients from honest ones, even in the presence of clients with an unfair validation set, across different types of attacks.", "section": "5.3 Leveraging FBPs information"}, {"figure_path": "5FHzrRGOKR/figures/figures_24_2.jpg", "caption": "Figure 3: Client trajectories on Counterfactuals and Error Behavioural Planes for Synthetic, Breast Cancer, and small-MNIST datasets, corresponding to Inverted-loss, Crafted-noise, and Inverted-gradient attacks, respectively. The figure highlights the deviation of the malicious client (red) from honest clients, who tend to cluster together over time, along with the previous-round global model (S)", "description": "This figure shows the trajectories of clients in Federated Behavioural Planes (FBPs) under different attack scenarios.  The FBPs consist of two planes: Error Behavioural Plane (EBP) representing predictive performance, and Counterfactual Behavioural Plane (CBP) illustrating decision-making processes.  The trajectories reveal how clients behave under three different attacks: Inverted-loss, Crafted-noise, and Inverted-gradient.  Honest clients tend to cluster together while the malicious client (red) deviates significantly.  The server's global model (S) is also shown for comparison.", "section": "5.2 Explaining FL training"}, {"figure_path": "5FHzrRGOKR/figures/figures_25_1.jpg", "caption": "Figure 13: Relationship between test set size, computational time, and accuracy evaluated on Diabetes dataset against inverted gradient attack. As test set size increases (logarithmic x-axis), computational time grows exponentially (log10 scale, red line), while accuracy (blue line) only slightly increases before plateauing.", "description": "The figure shows the relationship between the size of the test set used for validation and both the computational time and accuracy achieved by the proposed method against an inverted gradient attack.  As the size of the test set increases, the computational time increases exponentially.  However, accuracy improvements are minimal after a certain point, indicating that increasing the test set size beyond a threshold does not provide significantly improved performance.", "section": "B.8 Impact of server validation set size"}, {"figure_path": "5FHzrRGOKR/figures/figures_26_1.jpg", "caption": "Figure 3: Client trajectories on Counterfactuals and Error Behavioural Planes for Synthetic, Breast Cancer, and small-MNIST datasets, corresponding to Inverted-loss, Crafted-noise, and Inverted-gradient attacks, respectively. The figure highlights the deviation of the malicious client (red) from honest clients, who tend to cluster together over time, along with the previous-round global model (S)", "description": "This figure visualizes the trajectories of clients in Federated Behavioural Planes (FBPs) under different attack scenarios.  It shows how honest clients cluster together over time, while malicious clients deviate significantly from both the honest clients and the global model.  The figure uses two planes to represent client behavior: one for predictive performance (Error Behavioural Plane) and one for decision-making processes (Counterfactual Behavioural Plane).  The different attacks (Inverted-loss, Crafted-noise, and Inverted-gradient) are represented on different datasets.", "section": "5.2 Explaining FL training"}, {"figure_path": "5FHzrRGOKR/figures/figures_26_2.jpg", "caption": "Figure 3: Client trajectories on Counterfactuals and Error Behavioural Planes for Synthetic, Breast Cancer, and small-MNIST datasets, corresponding to Inverted-loss, Crafted-noise, and Inverted-gradient attacks, respectively. The figure highlights the deviation of the malicious client (red) from honest clients, who tend to cluster together over time, along with the previous-round global model (S)", "description": "This figure visualizes client behavior in Federated Learning (FL) using Federated Behavioral Planes (FBPs).  It shows trajectories of clients across two planes: the Error Behavioural Plane (EBP) representing predictive performance and the Counterfactual Behavioural Plane (CBP) representing decision-making processes.  The plots illustrate how clients behave under different attacks (Inverted-loss, Crafted-noise, and Inverted-gradient), highlighting how malicious clients (red) deviate from the behavior of honest clients, which tend to cluster together.", "section": "Explaining FL training"}, {"figure_path": "5FHzrRGOKR/figures/figures_27_1.jpg", "caption": "Figure 3: Client trajectories on Counterfactuals and Error Behavioural Planes for Synthetic, Breast Cancer, and small-MNIST datasets, corresponding to Inverted-loss, Crafted-noise, and Inverted-gradient attacks, respectively. The figure highlights the deviation of the malicious client (red) from honest clients, who tend to cluster together over time, along with the previous-round global model (S)", "description": "This figure visualizes client behavior in Federated Learning (FL) using Federated Behavioural Planes (FBPs). It shows trajectories of clients on two planes: Error Behavioural Plane (EBP) and Counterfactual Behavioural Plane (CBP).  The EBP represents predictive performance, while the CBP represents decision-making processes. The trajectories illustrate how clients behave under different attacks (Inverted-loss, Crafted-noise, and Inverted-gradient).  The figure highlights that honest clients tend to cluster together, while malicious clients deviate significantly.  The global model's trajectory is also shown for comparison.", "section": "5.2 Explaining FL training"}]