[{"figure_path": "j2hzCTqbF0/figures/figures_1_1.jpg", "caption": "Figure 1: Left: we use only six IMUs to predict the full-body pose in real-time, which are fixed on left and right forearm, the left and right lower leg, the head, and the pelvis. Right: our system is capable of capturing a wide range of daily motions as well as challenging movements.", "description": "This figure shows a person wearing six IMUs on their body.  The left side shows the IMU placement on the body; the right side shows various example poses captured by the system in real-time, demonstrating the system's capability to handle various movement types, from simple daily actions to complex poses.", "section": "1 Introduction"}, {"figure_path": "j2hzCTqbF0/figures/figures_4_1.jpg", "caption": "Figure 2: (a) Previous work only employ temporal encoders (RNN or transformer) to predict pose. (b) Our spatial-temporal framework. (c) Our spatial-temporal framework with SSM. (d) Our sequence structure module (SSM), simply consists of structural matrix S, LayerNorm [1] and MLP Block.", "description": "This figure illustrates the proposed architecture of the Sequence Structure Module (SSM) in comparison with the traditional methods that only utilize temporal encoders.  Part (a) shows the traditional approach using only temporal encoders. (b) demonstrates the novel spatial-temporal framework that combines both spatial and temporal encoders. (c) integrates the SSM into the spatial-temporal framework, showing how it enhances the architecture. Finally, (d) provides a detailed view of the SSM itself, explaining its components: a structural matrix (S), a Layer Normalization (LN) layer, and a Multilayer Perceptron (MLP) block. The SSM leverages structural information of fixed-length sequences to improve performance.", "section": "3 Method"}, {"figure_path": "j2hzCTqbF0/figures/figures_5_1.jpg", "caption": "Figure 3: The visualization of SE-S, and SE-T with different σ.", "description": "This figure visualizes the spatial structure matrix (SE-S) and three versions of the temporal structure matrix (SE-T) with different hyperparameters (σ). SE-S is a correlation matrix calculated from AMASS dataset showing the correlation between different joints. SE-T represents the correlation between different frames in the sequence, with higher values for closer frames and decreasing values for more distant frames, controlled by σ.", "section": "3.4 Constructing Explicit Structures"}, {"figure_path": "j2hzCTqbF0/figures/figures_7_1.jpg", "caption": "Figure 4: Qualitative comparisons with the state-of-the-art methods on TotalCapture dataset.", "description": "This figure compares the qualitative results of the proposed method against three state-of-the-art methods (TIP, PIP, and DynaIP) on the TotalCapture dataset.  It shows visualizations of the estimated poses for various actions (leaning forward, bending over, raising a leg, and raising both hands) alongside the ground truth poses. The red boxes highlight areas where the proposed method shows improvements in accuracy compared to the other methods. This visual comparison demonstrates the superior performance of the proposed method in accurately predicting human pose, especially in ambiguous situations.", "section": "4.3 Comparisons with SOTA"}, {"figure_path": "j2hzCTqbF0/figures/figures_8_1.jpg", "caption": "Figure 5: Error of different joints on DIP-IMU and TotalCapture datasets.", "description": "This figure compares the angular errors of individual joints predicted by the proposed method and two other state-of-the-art methods (PIP and TIP) on two datasets: DIP-IMU and TotalCapture.  The results show that the proposed method consistently achieves lower angular errors across most joints, indicating improved accuracy in pose estimation, particularly at the hands and legs, where previous methods tend to show more errors.  This visual representation highlights the method's superior performance in capturing the fine details of human poses.", "section": "4.3 Comparisons with SOTA"}, {"figure_path": "j2hzCTqbF0/figures/figures_9_1.jpg", "caption": "Figure 6: The visualization of SE-S, Ps and SEI-S. First column: SE-S obtained using the AMASS dataset before training. First row: results from our model trained on the AMASS, DIP-IMU dataset. Second row: results from our model trained on the AnDy, CIP, and Emokine datasets.", "description": "This figure visualizes the spatial structure matrices SE-S (before training), Ps (learnable matrix), and SEI-S (after training).  The first column shows SE-S initialized using the AMASS dataset; it captures inherent correlations between body parts.  The second column shows Ps, the learnable matrix which is learned during training to adapt to the specific dataset.  The final column, SEI-S, is the sum of SE-S and Ps after training, representing the refined spatial structure. The top row shows results trained on AMASS and DIP-IMU, while the bottom row shows results trained on AnDy, CIP, and Emokine, demonstrating how the learnable matrix adapts to different dataset characteristics.", "section": "3.4 Constructing Explicit Structures"}, {"figure_path": "j2hzCTqbF0/figures/figures_15_1.jpg", "caption": "Figure 2: (a) Previous work only employ temporal encoders (RNN or transformer) to predict pose. (b) Our spatial-temporal framework. (c) Our spatial-temporal framework with SSM. (d) Our sequence structure module (SSM), simply consists of structural matrix S, LayerNorm [1] and MLP Block.", "description": "This figure illustrates the architecture of the proposed model for inertial pose estimation. (a) shows the traditional approach using only temporal encoders. (b) introduces the spatial-temporal framework with separate spatial and temporal encoders. (c) integrates the Sequence Structure Module (SSM) into the spatial-temporal framework. (d) details the SSM's components: structural matrix S, Layer Normalization, and Multilayer Perceptron (MLP).", "section": "3 Method"}, {"figure_path": "j2hzCTqbF0/figures/figures_16_1.jpg", "caption": "Figure 3: The visualization of SE-S, and SE-T with different σ.", "description": "This figure visualizes the spatial structure matrix SE-S, and the temporal structure matrix SE-T under different values of σ, which is a hyperparameter that determines the maximum \"distance\" between two frames that are considered correlated. The spatial structure matrix is based on the correlation between body joints obtained from the AMASS dataset. The temporal structure matrix uses a function that linearly decreases with increasing \"distance\".", "section": "3.4 Constructing Explicit Structures"}]