[{"figure_path": "j2hzCTqbF0/tables/tables_6_1.jpg", "caption": "Table 1: Comparison with SOTA methods on DIP-IMU [18] and TotalCapture [46] datasets with SMPL [29] skeleton. Bold indicates best and underline indicates runner-up results.", "description": "This table presents a quantitative comparison of the proposed method against state-of-the-art (SOTA) methods for sparse inertial human pose estimation.  Two benchmark datasets, DIP-IMU and TotalCapture, are used for evaluation. The comparison is done using multiple metrics: SIP error, Angular error, Positional error, Mesh error, and Jitter.  The best and second-best results for each metric on each dataset are highlighted in bold and underlined, respectively.  The table demonstrates the superior performance of the proposed method across all metrics and datasets.", "section": "4.3 Comparisons with SOTA"}, {"figure_path": "j2hzCTqbF0/tables/tables_7_1.jpg", "caption": "Table 2: Comparison with SOTA methods on AnDy [33] and CIP [37] datasets with Xsens [41] skeleton.", "description": "This table presents a comparison of the proposed method's performance against state-of-the-art (SOTA) methods on two benchmark datasets, AnDy and CIP, which use the Xsens skeleton.  The metrics used for comparison include SIP error, angular error, and positional error.  These metrics reflect the accuracy of the pose estimation results.", "section": "4.3 Comparisons with SOTA"}, {"figure_path": "j2hzCTqbF0/tables/tables_7_2.jpg", "caption": "Table 3: Ablation study of SSM-S and SSM-T.", "description": "This table presents the results of an ablation study evaluating the impact of the Sequence Structure Module (SSM) on the performance of the proposed model. It compares the performance (Ang Err and Jitter) of four different model variants: a baseline model without SSM, a model with only SSM-S, a model with only SSM-T, and the full model with both SSM-S and SSM-T. The results demonstrate the individual and combined contributions of SSM-S and SSM-T in improving the accuracy and steadiness of the inertial pose estimation.", "section": "4.4 Ablation Study"}, {"figure_path": "j2hzCTqbF0/tables/tables_8_1.jpg", "caption": "Table 4: Ablation study on SSM design.", "description": "This table presents the ablation study results comparing different combinations of SSM-S and SSM-T module designs. The table shows the effects of different structure choices (IS, ES, EIHS) for each module on the angular error (Ang Err), jitter, and a combined metric (τ).  The results indicate that the combination of EIHS for SSM-S and ES for SSM-T yields the best performance.", "section": "4 Experiments"}, {"figure_path": "j2hzCTqbF0/tables/tables_16_1.jpg", "caption": "Table 6: The performance under different definition for SE-T on TotalCapture dataset.", "description": "This table compares the performance of two different definitions for the temporal explicit structure SE-T on the TotalCapture dataset.  The performance is measured using Angular Error, Jitter, and a combined metric T.  Different values of the hyperparameter σ are used for each definition. The results show that the original definition of SE-T (Equation 8) outperforms the alternative definition (Equation 18).", "section": "4.4 Ablation Study"}, {"figure_path": "j2hzCTqbF0/tables/tables_17_1.jpg", "caption": "Table 7: The performance under different definition for SE-T on TotalCapture dataset.", "description": "This table presents a comparison of the performance of two different methods, SE-TE and TE-SE, using different definitions for SE-T on the TotalCapture dataset.  The results are measured using three metrics: Ang Err (Angular Error), Jitter, and τ (tau, a combined metric).  The SE-TE method, which is the proposed approach in the paper, outperforms the TE-SE method significantly across all three metrics, demonstrating the superiority of their proposed sequence structure learning and modulation approach.", "section": "4.4 Ablation Study"}, {"figure_path": "j2hzCTqbF0/tables/tables_17_2.jpg", "caption": "Table 8: The performance under more sensors on DIP-IMU dataset.", "description": "This table shows the performance of the proposed method with 6 and 10 IMUs on the DIP-IMU dataset. It compares the angular error, jitter, and τ (a combined metric of angular error and jitter) to demonstrate the impact of increasing the number of IMUs and the effectiveness of SSM-S and SSM-T modules. The results indicate improved performance with more sensors and highlight the contribution of each module in achieving accuracy and stability.", "section": "4.4 Ablation Study"}, {"figure_path": "j2hzCTqbF0/tables/tables_17_3.jpg", "caption": "Table 1: Comparison with SOTA methods on DIP-IMU [18] and TotalCapture [46] datasets with SMPL [29] skeleton. Bold indicates best and underline indicates runner-up results.", "description": "This table presents a quantitative comparison of the proposed method against state-of-the-art (SOTA) methods on two benchmark datasets: DIP-IMU and TotalCapture.  The evaluation metrics used are SIP error, angular error, positional error, mesh error, and jitter.  The results show the superior performance of the proposed method across all metrics.", "section": "4.3 Comparisons with SOTA"}, {"figure_path": "j2hzCTqbF0/tables/tables_18_1.jpg", "caption": "Table 1: Comparison with SOTA methods on DIP-IMU [18] and TotalCapture [46] datasets with SMPL [29] skeleton. Bold indicates best and underline indicates runner-up results.", "description": "This table compares the proposed method's performance with state-of-the-art (SOTA) methods on two benchmark datasets, DIP-IMU and TotalCapture, using the SMPL skeleton.  The metrics used for comparison include SIP error, angular error, positional error, mesh error, and jitter.  Bold values represent the best performance, and underlined values represent the second-best performance for each metric.", "section": "4.3 Comparisons with SOTA"}, {"figure_path": "j2hzCTqbF0/tables/tables_18_2.jpg", "caption": "Table 1: Comparison with SOTA methods on DIP-IMU [18] and TotalCapture [46] datasets with SMPL [29] skeleton. Bold indicates best and underline indicates runner-up results.", "description": "This table compares the performance of the proposed method against state-of-the-art (SOTA) methods on two benchmark datasets, DIP-IMU and TotalCapture, using the SMPL skeleton.  The metrics used for comparison are SIP error, angular error, positional error, mesh error, and jitter. The best and second-best results for each metric are highlighted in bold and underlined, respectively, showcasing the superiority of the proposed approach in terms of accuracy and steadiness.", "section": "4.3 Comparisons with SOTA"}]