[{"figure_path": "UddVRqTrjt/tables/tables_8_1.jpg", "caption": "Table 1: Comparison to the proposed baseline on 100 test images from the FFHQ dataset. Hierarchical K-means was applied to 100 posterior samples per test image. Runtime is reported as both the speed of a forward pass (sec) and the memory usage (GB) required to infer a single test image with a batch of 1 on an A6000 GPU. The NLL at the root node (d = 0) is trivial and therefore omitted. Blue and Red indicate best and second best respectively.", "description": "This table compares the proposed method's performance against a baseline method on the FFHQ dataset for three different image inpainting tasks.  The baseline uses hierarchical K-means clustering on 100 posterior samples per image. The table presents quantitative results including optimal Peak Signal-to-Noise Ratio (PSNR) at different tree depths (d=0,1,2), negative log-likelihood (NLL) (omitting the trivial root node), forward pass speed, and memory usage (for a single test image inference on an A6000 GPU).  Blue and red highlight the best and second-best performing methods for each task and metric.", "section": "4 Experiments"}, {"figure_path": "UddVRqTrjt/tables/tables_34_1.jpg", "caption": "Table 1: Comparison to the proposed baseline on 100 test images from the FFHQ dataset. Hierarchical K-means was applied to 100 posterior samples per test image. Runtime is reported as both the speed of a forward pass (sec) and the memory usage (GB) required to infer a single test image with a batch of 1 on an A6000 GPU. The NLL at the root node (d = 0) is trivial and therefore omitted. Blue and Red indicate best and second best respectively.", "description": "This table compares the proposed method's performance to a baseline method on the FFHQ dataset for various image restoration tasks. The baseline involves sampling from the posterior distribution and then applying hierarchical K-means clustering.  The table shows the PSNR and NLL scores for different depths of the tree, along with the runtime and memory usage of the forward pass.  The results highlight that the proposed method achieves comparable performance to the baseline while being significantly faster.", "section": "4 Experiments"}]