[{"figure_path": "lJuQxkDbDo/tables/tables_7_1.jpg", "caption": "Table 1: Statistics of three datasets: ASSISTments, Math, and SLP.", "description": "This table presents the number of students, exercises, concepts, and total logs for three datasets used in the paper's experiments: ASSISTments, Math, and SLP.  It also shows the average number of logs per student in each dataset. This information is crucial for understanding the scale and characteristics of the data used to evaluate the proposed model and compare it against other state-of-the-art methods.", "section": "5.1 Experimental Settings"}, {"figure_path": "lJuQxkDbDo/tables/tables_7_2.jpg", "caption": "Table 2: Performance comparison between DisenGCD and five CDM in terms of AUC, ACC, and RMSE values, obtained on ASSISTments and Math. Four dataset-splitting ratios were adopted, and the best result of each column on one dataset was highlighted.", "description": "This table presents a performance comparison of DisenGCD against five other Cognitive Diagnosis Models (CDMs) using three metrics: Area Under the Curve (AUC), Accuracy (ACC), and Root Mean Squared Error (RMSE).  The comparison is done on two datasets, ASSISTments and Math, using four different data splits. The best result for each metric and dataset is highlighted.", "section": "5 Experiments"}, {"figure_path": "lJuQxkDbDo/tables/tables_8_1.jpg", "caption": "Table 3: Performance of DisenGCD, RCD, and its four variants on ASSISTments dataset.", "description": "This table presents a comparison of the performance of DisenGCD and four of its variants against the baseline RCD model.  The variants of DisenGCD explore different combinations of graph usage for learning the three representation types (student, exercise, concept) across the three disentangled graphs. DisenGCD(I) uses only the interaction graph, while the other variants combine the interaction graph with either the relation or dependency graph, or both, for learning the different representations. The metrics used for comparison are Accuracy (ACC), Root Mean Squared Error (RMSE), and Area Under the Curve (AUC).  Higher ACC and AUC values and lower RMSE values indicate better performance.", "section": "5.3 Effectiveness of Disentangled Learning Framework of DisenGCD (RQ2)"}, {"figure_path": "lJuQxkDbDo/tables/tables_14_1.jpg", "caption": "Table 2: Performance comparison between DisenGCD and five CDM in terms of AUC, ACC, and RMSE values, obtained on ASSISTments and Math. Four dataset-splitting ratios were adopted, and the best result of each column on one dataset was highlighted.", "description": "This table presents a comparison of the performance of DisenGCD against five other Cognitive Diagnosis Models (CDMs) on two datasets: ASSISTments and Math.  The performance metrics used are Area Under the Curve (AUC), Accuracy (ACC), and Root Mean Squared Error (RMSE). Four different data splits were used to evaluate the models' robustness across different data configurations.  The best result for each metric and dataset split is highlighted.", "section": "5 Experiments"}, {"figure_path": "lJuQxkDbDo/tables/tables_14_2.jpg", "caption": "Table 2: Performance comparison between DisenGCD and five CDM in terms of AUC, ACC, and RMSE values, obtained on ASSISTments and Math. Four dataset-splitting ratios were adopted, and the best result of each column on one dataset was highlighted.", "description": "This table presents a comparison of the performance of DisenGCD against five other Cognitive Diagnosis Models (CDMs) on two datasets, namely ASSISTments and Math.  The performance is measured using three metrics: Area Under the Curve (AUC), Accuracy (ACC), and Root Mean Squared Error (RMSE). Four different data splitting ratios (40%/10%/50%, 50%/10%/40%, 60%/10%/30%, and 70%/10%/20%) were used for training and testing. The best result for each metric in each dataset is highlighted.", "section": "5.2 Overall Performance Comparison (RQ1)"}, {"figure_path": "lJuQxkDbDo/tables/tables_15_1.jpg", "caption": "Table 6: Performance comparison of recent CDMs (SCD, KaNCD, KSCD) and DisenGCD on the Math dataset.", "description": "This table presents a comparison of the performance of four different cognitive diagnosis models (CDMs) on the Math dataset.  The CDMs compared are SCD, KaNCD, KSCD, and the proposed DisenGCD model. The performance is evaluated using three metrics: Accuracy (ACC), Root Mean Squared Error (RMSE), and Area Under the Curve (AUC). Higher ACC and AUC values, and lower RMSE values indicate better performance.", "section": "5 Experiments"}, {"figure_path": "lJuQxkDbDo/tables/tables_16_1.jpg", "caption": "Table 7: Performance comparison between DisenGCD, NCD, and RCD under sparse interaction data.", "description": "This table compares the performance of DisenGCD, NCD, and RCD models on two datasets (ASSISTments and Math) under different levels of data sparsity (5%, 10%, and 20%).  The performance is evaluated using three metrics: Accuracy (ACC), Root Mean Squared Error (RMSE), and Area Under the Curve (AUC).  The results show how well each model handles missing data in the student-exercise interactions.", "section": "5.3 Effectiveness of Disentangled Learning Framework of DisenGCD (RQ2)"}, {"figure_path": "lJuQxkDbDo/tables/tables_17_1.jpg", "caption": "Table 2: Performance comparison between DisenGCD and five CDM in terms of AUC, ACC, and RMSE values, obtained on ASSISTments and Math. Four dataset-splitting ratios were adopted, and the best result of each column on one dataset was highlighted.", "description": "This table presents a comparison of the performance of DisenGCD against five other Cognitive Diagnosis Models (CDMs) on two datasets: ASSISTments and Math. The performance is measured using three metrics: Area Under the Curve (AUC), Accuracy (ACC), and Root Mean Squared Error (RMSE). Four different dataset splitting ratios were used to ensure robustness of the results. The best result for each metric on each dataset is highlighted in bold.", "section": "5 Experiments"}, {"figure_path": "lJuQxkDbDo/tables/tables_19_1.jpg", "caption": "Table 2: Performance comparison between DisenGCD and five CDM in terms of AUC, ACC, and RMSE values, obtained on ASSISTments and Math. Four dataset-splitting ratios were adopted, and the best result of each column on one dataset was highlighted.", "description": "This table presents the performance comparison of DisenGCD against five other Cognitive Diagnosis Models (CDMs) across four different dataset splitting ratios.  The metrics used for comparison are Area Under the Curve (AUC), Accuracy (ACC), and Root Mean Squared Error (RMSE). The best performance for each metric on each dataset is highlighted.", "section": "5.2 Overall Performance Comparison (RQ1)"}, {"figure_path": "lJuQxkDbDo/tables/tables_19_2.jpg", "caption": "Table 2: Performance comparison between DisenGCD and five CDM in terms of AUC, ACC, and RMSE values, obtained on ASSISTments and Math. Four dataset-splitting ratios were adopted, and the best result of each column on one dataset was highlighted.", "description": "This table presents a comparison of the performance of DisenGCD against five other cognitive diagnosis models (CDMs) across four different data splits.  The performance metrics used are AUC (Area Under the Curve), ACC (Accuracy), and RMSE (Root Mean Squared Error).  The best performance for each metric and dataset is highlighted.", "section": "5.2 Overall Performance Comparison (RQ1)"}, {"figure_path": "lJuQxkDbDo/tables/tables_19_3.jpg", "caption": "Table 6: Performance comparison of recent CDMs (SCD, KaNCD, KSCD) and DisenGCD on the Math dataset.", "description": "This table presents a comparison of the performance of DisenGCD against three other state-of-the-art Cognitive Diagnosis Models (CDMs): SCD, KaNCD, and KSCD. The comparison is done using the Math dataset and considers three evaluation metrics: Accuracy (ACC), Root Mean Squared Error (RMSE), and Area Under the Curve (AUC).  Higher ACC and AUC values, and lower RMSE values indicate better performance.", "section": "5 Experiments"}]