[{"figure_path": "u1mNGLYN74/figures/figures_1_1.jpg", "caption": "Figure 1: Overview of DRACO. For pre-training, we construct a large-scale curated dataset containing 529 types of protein data with over 270,000 cryo-EM movies or micrographs. Based on this, we present DRACO, a denoising-reconstruction autoencoder for cryo-EM. A pre-trained DRACO naturally serves as a generalizable cryo-EM image denoiser and a foundation for various downstream model adaptions such as micrograph curation and particle picking.", "description": "This figure provides a high-level overview of the DRACO architecture and its training process.  It shows how a large-scale curated dataset of cryo-EM movies/micrographs is used for pre-training a denoising-reconstruction autoencoder. The pre-trained model (DRACO) is then shown to be adaptable to various downstream cryo-EM tasks, including micrograph curation and particle picking.", "section": "1 Introduction"}, {"figure_path": "u1mNGLYN74/figures/figures_4_1.jpg", "caption": "Figure 2: The pipeline of DRACO. Given a pair of partially masked odd and even micrographs, the encoder takes odd-visible patches and even-visible patches as inputs. The unmasked latent patches are combined with masked latent patches together to generate the latent representation z<sub>i</sub>. Then the latent representation passes through the decoder to generate predicted patches. The N2N loss is applied to odd-visible predicted patches with corresponding even input patches, and vice versa. The reconstruction loss is applied to both invisible predicted patches with higher SNR input patches.", "description": "This figure illustrates the architecture of DRACO, a denoising-reconstruction autoencoder for cryo-EM. It shows how the model processes odd and even micrographs, uses masking to create denoising and reconstruction tasks, and applies both Noise2Noise (N2N) and reconstruction losses for training. The encoder extracts features from visible patches, and the decoder reconstructs the entire micrograph using both visible and masked patches, with additional supervision from the original micrograph for masked patches.  The diagram also clearly shows the flow of data and the application of different loss functions.", "section": "4 Denoising-reconstruction Autoencoder"}, {"figure_path": "u1mNGLYN74/figures/figures_6_1.jpg", "caption": "Figure 3: Visualization of particle picking results. We show the picking results of DRACO and baselines on the test datasets range from small transport proteins to huge ribosomes. Blue, red, and yellow circles denote true positives, false positives, and false negatives, respectively.", "description": "This figure visualizes the performance of DRACO and several baseline methods on particle picking for three different protein datasets: LetB transport protein, 70S ribosome, and Human HCN1 channel protein.  Each image shows a micrograph with particles identified by different colored circles: blue circles indicate correctly identified particles (true positives), red circles show incorrectly identified particles (false positives), and yellow circles represent missed particles (false negatives). The figure highlights the superior performance of DRACO in accurately identifying particles compared to the baselines, especially when dealing with challenging datasets containing diverse particle sizes and shapes.", "section": "5.1 Particle Picking"}, {"figure_path": "u1mNGLYN74/figures/figures_7_1.jpg", "caption": "Figure 4: Qualitative comparison results of micrograph denoising. We visualize the denoising results of DRACO and state-of-the-art baselines. Our results show the most significant SNR improvement without the loss of the particle structure details. In contrast, Low-pass leads to a severe blur on particles, MAE introduces severe patch-wise artifacts and Topaz only shows either minor SNR improvements or blurred results.", "description": "This figure shows a qualitative comparison of micrograph denoising results using DRACO and several state-of-the-art methods.  It highlights DRACO's ability to improve the signal-to-noise ratio (SNR) while preserving fine details of the particle structures, unlike other methods which either cause significant blurring or introduce unwanted artifacts.", "section": "5.2 Micrograph Denoising"}, {"figure_path": "u1mNGLYN74/figures/figures_14_1.jpg", "caption": "Figure 5: Additional denoising results. We have conducted additional experiments on datasets of membrane proteins and bacteriophages. DRACO achieves the highest visual denoising quality by optimally balancing signal preservation and noise reduction.", "description": "This figure shows the qualitative results of DRACO and other denoising methods on two different types of cryo-EM micrographs: HA Trimer and Phage MS2.  The results demonstrate that DRACO achieves the highest visual denoising quality in terms of both signal preservation and noise reduction, better than Low-pass filtering, MAE, and Topaz-Denoise.  The image showcases the raw micrographs, their low-pass filtered versions, the results using MAE, Topaz-Denoise, and DRACO-L respectively.  The results show that DRACO effectively reduces noise while preserving fine details of the particles. In contrast, Low-pass filtering significantly blurs the images; MAE introduces some patch-wise artifacts; and Topaz-Denoise shows some minor improvements or blurred results.", "section": "Additional Results of DRACO"}, {"figure_path": "u1mNGLYN74/figures/figures_14_2.jpg", "caption": "Figure 6: Visualization of DRACO's results on different mask ratios. At a 0.75 mask ratio, DRACO achieves the best trade-off between signal preservation and background noise removal.", "description": "This figure shows the results of DRACO's denoising performance with different mask ratios (50%, 62.5%, 75%, 87.5%). The results indicate that a mask ratio of 0.75 provides the optimal balance between preserving important signal details and removing background noise.  The top row displays the results for Phage MS2, while the bottom row shows the results for RNA polymerase.  The images are cryo-EM micrographs, and the improvement in clarity and detail with the 0.75 mask ratio is evident.", "section": "Additional Results of DRACO"}, {"figure_path": "u1mNGLYN74/figures/figures_15_1.jpg", "caption": "Figure 7: Additional results on image reconstruction. We present the reconstruction results at various image resolutions while maintaining a consistent mask ratio of 0.75. DRACO demonstrates enhanced detail preservation on the visible patches compared to MAE.", "description": "This figure shows the reconstruction results of DRACO and MAE at different resolutions, using a constant mask ratio of 0.75.  It highlights DRACO's superior ability to preserve fine details in the visible (unmasked) regions of the image compared to MAE.", "section": "Additional Results of DRACO"}, {"figure_path": "u1mNGLYN74/figures/figures_16_1.jpg", "caption": "Figure 8: Denoising cryo-ET HIV tilt series with DRACO. Figure (a) and (b) show the HIV tilt series beforeand after DRACO's denoising process. Using IMOD, we reconstruct 3D volumes of HIV from both the original and denoised series, showing their slice in Figures (c) and (d). Note the horizontal stripes in these images, which are artifacts due to the missing wedge issue in cryo-ET. Figure (e) shows a denoised slice from Figure (c) by DRACO.", "description": "This figure demonstrates DRACO's ability to denoise cryo-ET data.  It shows a comparison of original and denoised HIV tilt series images (a, b).  The denoising improves the quality of the 3D reconstruction (c, d), with the denoised reconstruction showing a clearer image than the reconstruction done with the original image (e).", "section": "B Zero-shot Capability on Cryo-ET"}]