[{"figure_path": "bUi2xECa7w/figures/figures_7_1.jpg", "caption": "Figure 1: Pareto front recovered by Algorithm 1 for the Adult, Census, and BlueBike datasets (by row), for various fairness objectives (by column), for k = 2 clusters.", "description": "This figure presents the Pareto front for clustering on three real-world datasets (Adult, Census, BlueBike) using Algorithm 1.  Each row represents a dataset, and each column represents a different fairness objective (Balance, Group Util, Group Util-Sum, Group Egalit, Group Egalit-Sum). The Pareto front illustrates the trade-off between clustering quality (cost) and fairness.  For each dataset and fairness objective, the curve shows all the non-dominated clustering solutions; solutions on the curve represent a balance between cost and fairness, where any improvement in one metric necessitates a compromise in the other. The different shapes of the curves reflect the varying relationships between cost and fairness across the different datasets and fairness measures.", "section": "4.1 Pareto Front on Real-World Data"}, {"figure_path": "bUi2xECa7w/figures/figures_9_1.jpg", "caption": "Figure 1: Pareto front recovered by Algorithm 1 for the Adult, Census, and BlueBike datasets (by row), for various fairness objectives (by column), for k = 2 clusters.", "description": "This figure shows the Pareto fronts obtained for three real-world datasets (Adult, Census, and BlueBike) using Algorithm 1. Each row represents a dataset, and each column represents a different fairness objective (Balance, Group Utilitarian, Group Utilitarian-Sum, Group Egalitarian, Group Egalitarian-Sum). The Pareto front illustrates the trade-off between clustering cost and fairness for each dataset and fairness objective.  The x-axis shows the clustering cost and the y-axis shows the fairness metric for each corresponding objective. The algorithm finds the exact Pareto front for the assignment problem (centers are fixed), which provides an approximation for the Pareto front of the clustering problem (centers are not fixed).", "section": "4.1 Pareto Front on Real-World Data"}, {"figure_path": "bUi2xECa7w/figures/figures_21_1.jpg", "caption": "Figure 3: (a) An illustration of clustering under for non-pattern based fairness objectives. (b) An illustration of the (Pi)i∈[8] sets for non-mergeable fairness objectives.", "description": "Figure 3 demonstrates examples of clustering scenarios that violate the pattern-based and mergeable properties for fairness objectives. Subfigure (a) illustrates a clustering where the fairness depends on the relative location of points and the cluster centers, not just the number of points of each attribute. Subfigure (b) shows how a non-mergeable objective leads to non-optimality when clusters are merged. These examples highlight the limitations of algorithms designed for pattern-based and mergeable objectives when applied to scenarios that do not satisfy these properties.", "section": "B.2 A discussion on pattern-based and mergeability properties"}, {"figure_path": "bUi2xECa7w/figures/figures_23_1.jpg", "caption": "Figure 4: An illustration of implementing the repeated FCBC algorithm as the clustering cost upper bound U varies.", "description": "This figure illustrates the repeated FCBC algorithm for approximating the Pareto front.  The algorithm sweeps across different upper bounds (U) on the clustering cost, generating a set of approximate Pareto points.  Each point represents the result of the FCBC algorithm for a given clustering cost bound. The dashed line represents a sweep across different upper bound values, and the points show the resulting fairness and clustering objective values for each bound.  The algorithm effectively traces out an approximation of the Pareto frontier.", "section": "Repeated-FCBC: Experimental Details"}, {"figure_path": "bUi2xECa7w/figures/figures_24_1.jpg", "caption": "Figure 5: Running time comparison with our dynamic programming approach from Algorithm 1, labeled as ‘Dyn Progr’, and the repeated FCBC approach from Algorithm 2, labeled as ‘FCBC’, for each dataset (by column) and for the GROUP UTILITARIAN and GROUP EGALITARIAN objective (by row).", "description": "This figure compares the running times of two algorithms for computing the Pareto front for fair clustering problems. The dynamic programming approach (Dyn Progr) is shown to be more efficient for larger datasets. The repeated FCBC approach, while faster for small datasets, becomes increasingly slower as dataset size increases.", "section": "4.2 Exploring Faster Pareto Front Approximations"}, {"figure_path": "bUi2xECa7w/figures/figures_25_1.jpg", "caption": "Figure 1: Pareto front recovered by Algorithm 1 for the Adult, Census, and BlueBike datasets (by row), for various fairness objectives (by column), for k = 2 clusters.", "description": "This figure displays the Pareto fronts obtained by applying Algorithm 1 (dynamic programming approach) to three real-world datasets (Adult, Census, and BlueBike). Each row represents a dataset, and each column represents a different fairness objective (Balance, Group Util, Group Util-Sum, Group Egalit, Group Egalit-Sum). The x-axis shows the clustering cost, and the y-axis shows the fairness value for each objective. Each curve represents the Pareto front, which shows the trade-off between clustering quality and fairness for that specific dataset and fairness objective.", "section": "4.1 Pareto Front on Real-World Data"}, {"figure_path": "bUi2xECa7w/figures/figures_25_2.jpg", "caption": "Figure 1: Pareto front recovered by Algorithm 1 for the Adult, Census, and BlueBike datasets (by row), for various fairness objectives (by column), for k = 2 clusters.", "description": "This figure displays the Pareto fronts obtained by applying Algorithm 1 (dynamic programming) to three real-world datasets: Adult, Census, and BlueBike. Each row represents a different dataset, and each column represents a different fairness objective (Balance, Group Utilitarian, Group Utilitarian-Sum, Group Egalitarian, and Group Egalitarian-Sum). The Pareto front illustrates the trade-off between clustering cost and fairness for each dataset and objective.  Each point on the curve represents a clustering solution that is not dominated by any other solution in terms of both cost and fairness; that is, no other solution has both lower cost and higher fairness. The shapes of the Pareto fronts vary across datasets and objectives, reflecting the different balances between cost and fairness achievable in different situations. For example, in the BALANCE objective, the improvement in fairness as clustering cost increases diminishes quickly, suggesting that a practitioner may find an optimal trade-off by allowing a small amount of decline in fairness for a significant improvement in quality.", "section": "4.1 Pareto Front on Real-World Data"}, {"figure_path": "bUi2xECa7w/figures/figures_26_1.jpg", "caption": "Figure 8: Pareto front recovered for the SUM OF IMBALANCES objective for the Adult, Census, and BlueBike datasets (by column), for k = 2 (top row) and k = 3 (bottom row) clusters.", "description": "This figure shows the Pareto fronts obtained for the SUM OF IMBALANCES fairness objective for three real-world datasets: Adult, Census, and BlueBike.  The Pareto fronts are shown for both k=2 and k=3 clusters.  Each plot displays the trade-off between clustering cost and the sum of imbalances across clusters. The x-axis represents the clustering cost, and the y-axis represents the sum of imbalances.  The plots demonstrate how the optimal trade-off between clustering cost and fairness varies depending on the dataset and the number of clusters.", "section": "4 Experiments"}]