[{"figure_path": "yKvHJJE9le/tables/tables_2_1.jpg", "caption": "Table 1: Overview of safe learning methods based on BO for time-varying problems.", "description": "This table compares four different safe Bayesian optimization methods (A-GOOSE, C-SAFEOPT, ETSAFEOPT, and TVSAFEOPT) in terms of their ability to handle changes in time, their safety and optimality guarantees, and the type of safe seed they require.  It highlights the unique spatio-temporal kernel approach of TVSAFEOPT and its improved safety and optimality properties compared to the other methods.", "section": "1.2 Methodology and Contributions"}, {"figure_path": "yKvHJJE9le/tables/tables_8_1.jpg", "caption": "Table 2: Synthetic example: comparison of TVSAFEOPT and ETSAFEOPT with respect to SAFEOPT, showing the average and the standard deviation results from five runs with different initial safe sets (chosen randomly from the feasible space).", "description": "This table presents a comparison of three Bayesian Optimization algorithms: TVSAFEOPT, ETSAFEOPT, and SAFEOPT.  The comparison is based on three metrics: Violations (percentage of unsafe decisions made within the safe sets), Coverage Ratio (percentage of safe decisions within the ground truth safe region), and Cumulative Regret (a measure of the cumulative difference between the reward obtained by each method and the optimal reward).  The results are averages and standard deviations from five independent runs, each starting with a different randomly selected initial safe set.", "section": "3 Experiments"}, {"figure_path": "yKvHJJE9le/tables/tables_8_2.jpg", "caption": "Table 3: Compressors case study: comparison of TVSAFEOPT and SAFEOPT with respect to Approximate Optimization, showing the average and the standard deviation results from 10 runs with different initial safe sets (chosen randomly from [xo - 0.5/√3d,xo + 0.5/√3d] where xo is the initial safe seed and d is the distance to the boundary of the feasible region). ETSAFEOPT is not included due to its high dependency on event detection methods, which are unavailable for compressor degradation.", "description": "This table compares the performance of TVSAFEOPT and SAFEOPT against a simple approximate optimization method in a realistic case study involving gas compressors.  The results are averaged over 10 runs with varying initial safe sets.  Key metrics include the percentage of violations, the coverage ratio (how well the safe set covers the true safe region), and cumulative regret (performance compared to the optimum).  ETSAFEOPT is excluded because its performance heavily relies on event detection which is not applicable to this study's compressor degradation.", "section": "3.2 Gas Compressor Case Study"}]