[{"figure_path": "XEbPJUQzs3/tables/tables_16_1.jpg", "caption": "Table A.1: Comparison of different machine learning frameworks in terms of the distributional assumptions on the data. Task IID indicates that data within a task are IID, and that tasks are IID from some meta-distribution. Loss characterizes whether the assumed loss function is instantaneous or time-varying. Optimal hypothesis indicates the total possible number of different optimal hypotheses (assuming each hypothesis has a unique risk). Data availability indicates whether the data are available all at once (in batch), or after each task arrives (task sequential), or one data sample at a time (sequential). The answers are given for typical settings, further details are available in the paragraphs below.", "description": "This table compares various machine learning frameworks based on their assumptions about data distribution (IID, change point, task-based, etc.), loss function type (instantaneous or time-varying), number of optimal hypotheses, and data availability (batch, sequential, or any).  It highlights the key differences between these approaches, particularly in relation to the novel \"prospective learning\" framework introduced in the paper. The table serves as a concise summary of existing methods' characteristics, enabling a clearer understanding of how prospective learning distinguishes itself.", "section": "A Isn't this just..."}, {"figure_path": "XEbPJUQzs3/tables/tables_32_1.jpg", "caption": "Table A.1: Comparison of different machine learning frameworks in terms of the distributional assumptions on the data. Task IID indicates that data within a task are IID, and that tasks are IID from some meta-distribution. Loss characterizes whether the assumed loss function is instantaneous or time-varying. Optimal hypothesis indicates the total possible number of different optimal hypotheses (assuming each hypothesis has a unique risk). Data availability indicates whether the data are available all at once (in batch), or after each task arrives (task sequential), or one data sample at a time (sequential). The answers are given for typical settings, further details are available in the paragraphs below.", "description": "This table compares several machine learning frameworks, highlighting their differences in data distribution assumptions, loss function types, the number of optimal hypotheses, and data availability (batch, task-sequential, or sequential). It provides a concise overview of the key distinctions between various learning approaches to clarify the unique aspects of prospective learning.", "section": "A Isn't this just..."}]