[{"figure_path": "yvUHnBkCzd/tables/tables_8_1.jpg", "caption": "Table 1: Average MSE (×10−3) and its standard deviation (×10−3) across clients for online regression on Air and WEC datasets.", "description": "This table presents the mean squared error (MSE) and standard deviation achieved by different federated learning algorithms and a local learning baseline on two real-world regression datasets: Air and WEC.  The MSE is a measure of prediction accuracy, with lower values indicating better performance.  The standard deviation shows the variability of the results across different clients. The table aims to compare the performance of the proposed Fed-POE method against other state-of-the-art algorithms for online prediction and demonstrates its superior performance.", "section": "5.1 Regression"}, {"figure_path": "yvUHnBkCzd/tables/tables_8_2.jpg", "caption": "Table 2: Average accuracy and its standard deviation across clients for image classification.", "description": "This table presents the average accuracy and standard deviation across 20 clients for image classification tasks using different federated learning algorithms on CIFAR-10 and FMNIST datasets.  The results show the performance of each algorithm in terms of classification accuracy and the variability in performance among the clients.", "section": "5.2 Image Classification"}, {"figure_path": "yvUHnBkCzd/tables/tables_9_1.jpg", "caption": "Table 3: Average accuracy and standard deviation across clients employing Fed-POE for image classification on CIFAR-10 with varying values of M and batch size b.", "description": "This table presents the average accuracy and standard deviation achieved by the Fed-POE algorithm on the CIFAR-10 image classification dataset.  It shows the impact of varying two key hyperparameters: the number of models (M) selected from the server's stored models and the batch size (b) used during each local model update.  The results reveal the performance trade-offs between model diversity (M) and the potential for overfitting to recent data (b), guiding the selection of optimal hyperparameters for different data and computational constraints.", "section": "5.2 Image Classification"}, {"figure_path": "yvUHnBkCzd/tables/tables_21_1.jpg", "caption": "Table 3: Average accuracy and standard deviation across clients employing Fed-POE for image classification on CIFAR-10 with varying values of M and batch size b.", "description": "This table presents the average accuracy and standard deviation achieved by the Fed-POE algorithm on the CIFAR-10 image classification dataset.  It shows the impact of varying two hyperparameters: the number of models (M) selected by each client at each time step to construct an ensemble model, and the batch size (b) used to update the model parameters. The results demonstrate the effect of different model selection and training strategies on model performance.", "section": "5.2 Image Classification"}]