[{"figure_path": "cUcvlgkQxP/tables/tables_5_1.jpg", "caption": "Table 1: Classification of existing Deep MIL methodologies.", "description": "This table classifies existing deep multiple instance learning (MIL) methodologies based on three criteria: 1) the level at which aggregation is performed (embedding level or instance level), 2) whether an attention mechanism is used or not, and 3) if an attention mechanism is used, at which level the attention weights are applied (embedding level or instance level).  The table lists several example pooling methods for each category.", "section": "4.1 Classifications of Existing Deep MIL Methodologies"}, {"figure_path": "cUcvlgkQxP/tables/tables_8_1.jpg", "caption": "Table 1: Classification of existing Deep MIL methodologies.", "description": "This table classifies existing deep multiple instance learning (MIL) methodologies based on two criteria: 1) the level of aggregation (embedding-level vs. instance-level) and 2) the use of attention mechanisms (none, embedding-level, or instance-level).  It shows five types of pooling techniques used in Deep MIL algorithms and their characteristics.  The table helps to contextualize the discussion of various Deep MIL algorithms within the paper.", "section": "4.1 Classifications of Existing Deep MIL Methodologies"}, {"figure_path": "cUcvlgkQxP/tables/tables_9_1.jpg", "caption": "Table 3: Prediction performance comparison of MIL algorithms on bags and instances.", "description": "This table compares the performance of several deep MIL algorithms on both bag-level and instance-level prediction tasks.  The metrics used are Macro-F1, AUROC, and the difference between the instance and bag performance (PInst - PBag) for each algorithm.  The goal is to show how well each algorithm performs instance-level predictions relative to its bag-level predictions.  Algorithms with smaller differences are considered better at instance-level learning.", "section": "4.2 Theoretical Verification"}, {"figure_path": "cUcvlgkQxP/tables/tables_9_2.jpg", "caption": "Table 2: Prediction performance of Deep MIL on Bags in DGenXY.", "description": "This table presents the Macro-F1, Micro-F1, and Weighted-F1 scores, along with AUROC, achieved by various Deep MIL algorithms on a synthetic dataset designed for evaluating bag-level learnability. The algorithms are categorized by their pooling method (Instance-Pooling, Attention-Pooling, Additive-Pooling, Conjunctive-Pooling, and None-Pooling).  The results demonstrate that algorithms employing attention mechanisms generally outperform those without attention, especially in the challenging DGenXY domain.", "section": "4.4.1 Experimental Validation of Theorem 5"}, {"figure_path": "cUcvlgkQxP/tables/tables_16_1.jpg", "caption": "Table 1: Classification of existing Deep MIL methodologies.", "description": "This table categorizes existing Deep Multiple Instance Learning (MIL) methodologies based on two criteria: 1) the level at which aggregation is performed (embedding-level vs. instance-level), and 2) the type of pooling technique used (no attention, embedding-level attention, instance-level attention, additive pooling, or conjunctive pooling).  The table shows the different combinations of these criteria, giving an overview of the diversity of Deep MIL approaches.", "section": "4.1 Classifications of Existing Deep MIL Methodologies"}, {"figure_path": "cUcvlgkQxP/tables/tables_27_1.jpg", "caption": "Table 1: Classification of existing Deep MIL methodologies.", "description": "This table categorizes existing deep multiple instance learning (MIL) methodologies based on two criteria: 1) the level at which aggregation is performed (embedding level or instance level), and 2) the type of pooling technique used (no attention mechanism, embedding-level attention, instance-level attention, additive pooling, and conjunctive pooling).  It provides a concise overview of the different approaches used in Deep MIL.", "section": "4.1 Classifications of Existing Deep MIL Methodologies"}, {"figure_path": "cUcvlgkQxP/tables/tables_27_2.jpg", "caption": "Table 1: Classification of existing Deep MIL methodologies.", "description": "This table categorizes existing deep multiple instance learning (MIL) methodologies based on two criteria: 1) the level at which aggregation is performed (embedding-level vs. instance-level), and 2) the type of pooling technique used (with or without attention mechanisms, and the target of attention).  It lists several example algorithms for each category.", "section": "4.1 Classifications of Existing Deep MIL Methodologies"}, {"figure_path": "cUcvlgkQxP/tables/tables_31_1.jpg", "caption": "Table 1: Classification of existing Deep MIL methodologies.", "description": "This table categorizes existing deep multiple instance learning (MIL) methodologies based on two criteria: 1) the level at which aggregation occurs (embedding-level vs. instance-level) and 2) the presence and type of attention mechanism used (none, embedding-level attention, instance-level attention).  Five types of pooling techniques are differentiated: Instance-pooling, Embedding-pooling, Attention-pooling, Additive-pooling, and Conjunctive-pooling.  The table provides a concise overview of how different Deep MIL approaches handle the aggregation of instance features and whether they utilize attention mechanisms.", "section": "4.1 Classifications of Existing Deep MIL Methodologies"}, {"figure_path": "cUcvlgkQxP/tables/tables_31_2.jpg", "caption": "Table 1: Classification of existing Deep MIL methodologies.", "description": "This table classifies existing Deep Multiple Instance Learning (MIL) methodologies based on two criteria: 1) the level at which aggregation is performed (embedding-level or instance-level), and 2) the type of pooling technique used (no attention, embedding attention, instance attention, additive pooling, or conjunctive pooling).  It provides a concise overview of how different Deep MIL approaches differ in their aggregation strategies and the use of attention mechanisms.", "section": "4.1 Classifications of Existing Deep MIL Methodologies"}, {"figure_path": "cUcvlgkQxP/tables/tables_32_1.jpg", "caption": "Table 1: Classification of existing Deep MIL methodologies.", "description": "This table categorizes existing Deep MIL methodologies based on two criteria: 1) the level at which aggregation is performed (embedding level or instance level) and 2) the type of pooling technique used (none, attention at embedding level, attention at instance level, additive, or conjunctive).  Each category is further sub-categorized by the target of attention (instance or embedding).", "section": "4.1 Classifications of Existing Deep MIL Methodologies"}, {"figure_path": "cUcvlgkQxP/tables/tables_32_2.jpg", "caption": "Table 2: Prediction performance of Deep MIL on Bags in DGenXY.", "description": "This table presents the Macro-F1, Micro-F1, and Weighted-F1 scores, along with AUROC, achieved by various Deep MIL models on a synthetic dataset designed to evaluate bag-level learnability in the general bag domain space (DGenXY). The models are categorized by their pooling methods (Instance-Pooling, Attention-Pooling, Additive-Pooling, Conjunctive-Pooling, and None-Pooling).  The results demonstrate the impact of different pooling methods on the ability of the Deep MIL algorithms to learn from bags in a scenario where instances within bags may exhibit dependencies, contrasting with the independent bag scenario.", "section": "4.4 Experimental Validation"}]