[{"figure_path": "I29aiMdm4u/figures/figures_1_1.jpg", "caption": "Figure 1: Comparison between the output from HiNeRV [30] and the proposed NVRC. The image is from UVG dataset (Jockey/ReadySetGo sequence) [45]", "description": "This figure compares the visual quality of video frames reconstructed by two different video compression methods: HiNeRV and the proposed NVRC method.  The top row shows close-up views of a horse's head, while the bottom row shows a wider shot of a horse race.  For both close-up and wider shots, NVRC produces sharper images than HiNeRV, demonstrating the improved visual quality achieved by the proposed method. The PSNR (Peak Signal-to-Noise Ratio) and bits per pixel (bpp) values are provided for each reconstruction, quantifying the improvement in objective quality and compression efficiency.", "section": "1 Introduction"}, {"figure_path": "I29aiMdm4u/figures/figures_3_1.jpg", "caption": "Figure 2: In NVRC, the parameters are encoded in a hierarchical structure, where (Middle-left) per-block quantization scales and (bottom-left) context-based model are utilized for encoding feature grids, and (Middle-right and bottom-right) per-axis quantization scales and dual-axis Gaussian model are applied for encoding network layer parameters.", "description": "This figure illustrates the hierarchical structure used in NVRC for encoding model parameters.  It shows how the feature grids (representing the spatial and temporal aspects of the video) and network layer parameters are encoded separately, but both leverage hierarchical quantization and entropy coding schemes for improved efficiency. For feature grids, per-block quantization scales and a context-based model reduce redundancy and bitrate.  For network layer parameters, per-axis quantization scales and a dual-axis conditional Gaussian model are used.  The entire process of encoding the parameters for the INR model (feature grids, network layers), and the quantization and entropy models themselves are all optimized together for rate-distortion trade-offs.", "section": "3 Method"}, {"figure_path": "I29aiMdm4u/figures/figures_7_1.jpg", "caption": "Figure 3: Average rate quality curves of various tested codecs on the UVG dataset [45].", "description": "This figure compares the rate-distortion performance of NVRC against several other video codecs on the UVG dataset.  The graph shows how the PSNR (Peak Signal-to-Noise Ratio), a measure of video quality, changes with bitrate (bits per pixel).  Lower bitrates mean better compression, while higher PSNR indicates better quality. The figure helps to visualize how NVRC performs relative to existing methods, such as x265, HM (High Efficiency Video Coding), VTM (Versatile Video Coding), and other learning-based methods.", "section": "4.2 Results and discussion"}, {"figure_path": "I29aiMdm4u/figures/figures_7_2.jpg", "caption": "Figure 3: Average rate quality curves of various tested codecs on the UVG dataset [45].", "description": "This figure presents a comparison of the rate-distortion performance of different video codecs on the UVG dataset.  The x-axis represents bits per pixel (bpp), a measure of compression efficiency, and the y-axis shows the peak signal-to-noise ratio (PSNR) and multi-scale structural similarity index (MS-SSIM), which are metrics for image quality. The graph displays the performance curves for various codecs, including x265, HM, VTM, DCVC-HEM, DCVC-DC, HiNeRV, C3, HNeRV-Boost, and NVRC.  It allows a visual comparison of the rate-distortion trade-off for each codec, showing which codec achieves the best balance of compression and quality for a given bitrate.  The results indicate the relative effectiveness of each codec in achieving high compression with minimal loss of visual quality. The comparison is shown for both RGB 4:4:4 and YUV 4:2:0 color spaces, reflecting the different color formats used in video compression.", "section": "4 Results and discussion"}, {"figure_path": "I29aiMdm4u/figures/figures_13_1.jpg", "caption": "Figure 3: Average rate quality curves of various tested codecs on the UVG dataset [45].", "description": "This figure compares the rate-distortion performance of several video codecs on the UVG dataset.  The x-axis represents bits per pixel (bpp), and the y-axis shows either PSNR (Peak Signal-to-Noise Ratio) or MS-SSIM (Multi-Scale Structural Similarity Index).  The various lines represent different codecs, including x265 (a high-performance general-purpose codec), HM (HEVC Test Model), VTM (VVC Test Model), DCVC-HEM, DCVC-DC (both learning-based codecs), HiNeRV, C3, HNeRV-Boost, and NVRC (the authors' proposed codec).  The curves illustrate how each codec trades off compression rate (bpp) for reconstruction quality (PSNR or MS-SSIM).  NVRC's superior performance compared to others, especially VVC VTM, is clearly visible in both the PSNR and MS-SSIM curves.", "section": "4 Results and discussion"}, {"figure_path": "I29aiMdm4u/figures/figures_15_1.jpg", "caption": "Figure 6: (Left) Rate distribution and (Right) bits-per-parameter of different parameter types.", "description": "This figure shows the breakdown of bits used for different components of the NVRC model at various rate points. The left panel displays the proportion of total bits allocated to feature grids, network layers, and their respective quantization and entropy models. The right panel presents bits-per-parameter for these components across different video sequences, revealing how the bit allocation varies depending on the video content complexity. Sequences with higher motion tend to use more bits for feature grids, as expected.", "section": "A.3.1 Rate distribution"}]