[{"figure_path": "LI5KmimXbM/figures/figures_1_1.jpg", "caption": "Figure 1: Comparisons of feature update strategy among non-graph methods, graph-based methods, hypergraph-based methods, and the proposed association pattern-aware method. Unlike existing methods that map or aggregate node features, the proposed method mines and then fuses association patterns for each target entity node in the graph to enhance the model's representative ability.", "description": "This figure compares four different approaches for updating features in a graph neural network.  Non-graph methods concatenate independently encoded features. Graph-based methods use graph structure for feature propagation. Hypergraph-based methods utilize hypergraph structure and complex feature aggregation. The proposed association pattern-aware method is distinct in that it identifies and integrates association patterns to improve the representation of target entities.", "section": "1 Introduction"}, {"figure_path": "LI5KmimXbM/figures/figures_3_1.jpg", "caption": "Figure 2: Overall framework of Pattern-BERP. First, entity attributes are initialized with different types of bio-encoders. Then, these existing associations are constructed into one hypergraph G and two bipartite graphs GA,B, GB,с. After that, the hypergraph is encoded with Association Pattern-aware Fusion module based on the pattern commonality, thereby affecting target entity representation. In addition, the bipartite graphs are encoded to output the missing bind-relation feature and thus generate hard negative samples. Finally, the integrated entity feature are used for final association prediction.", "description": "The figure illustrates the Pattern-BERP framework, which consists of four main modules: bio-encoding, association pattern-aware fusion, bind-relation enhancement, and association predictor.  The bio-encoding module initializes entity attributes using different encoders based on entity type. A hypergraph and two bipartite graphs representing relationships are then constructed and fed into the association pattern-aware fusion module. This module incorporates association patterns to enhance entity representations. The bind-relation enhancement module reconstructs missing bind-relation features to generate hard negative samples. Finally, the association predictor module uses the combined entity features to predict the association.", "section": "4 Pattern-BERP"}, {"figure_path": "LI5KmimXbM/figures/figures_8_1.jpg", "caption": "Figure 3: The interpretability cases of N=100 association patterns related to drug #53 and #207 in DMD dataset. The pattern commonality coefficients are represented in the form of a percentage to indicate the contribution for visualization, with each pattern typically assigned a default value of 1%. Larger pattern commonality coefficients indicate a more significant contribution to the target drugs, and these patterns frequently exhibit similar or even identical biological pathways. Conversely, smaller commonality coefficients suggest a lack of relevance to these drugs.", "description": "This figure visualizes the interpretability of the Pattern-BERP model by showing the association patterns for two drugs (Cefadroxil and S-(2-Thienyl)-L-cysteine) in the DMD dataset.  The size of the node indicates the contribution of that pattern.  Larger nodes indicate more significant contributions and similar biological pathways, while smaller nodes indicate less relevance.", "section": "Association Pattern Interpretability"}, {"figure_path": "LI5KmimXbM/figures/figures_18_1.jpg", "caption": "Figure 2: Overall framework of Pattern-BERP. First, entity attributes are initialized with different types of bio-encoders. Then, these existing associations are constructed into one hypergraph G and two bipartite graphs GA,B, GB,с. After that, the hypergraph is encoded with Association Pattern-aware Fusion module based on the pattern commonality, thereby affecting target entity representation. In addition, the bipartite graphs are encoded to output the missing bind-relation feature and thus generate hard negative samples. Finally, the integrated entity feature are used for final association prediction.", "description": "This figure presents the overall architecture of the Pattern-BERP model. It starts by encoding the input entities (drugs, microbes, diseases) using different bio-encoders tailored to each entity type. Then, it builds a hypergraph and two bipartite graphs to represent the relationships between the entities.  The hypergraph is processed by an Association Pattern-aware Fusion module which integrates association pattern information to enhance entity representation.  A Bind-relation Enhancement module, based on the bipartite graphs, reconstructs missing information and generates hard negative samples for improved model training.  Finally, an Association Predictor uses the integrated entity features to predict new entity relationships.", "section": "4 Pattern-BERP"}, {"figure_path": "LI5KmimXbM/figures/figures_20_1.jpg", "caption": "Figure 2: Overall framework of Pattern-BERP. First, entity attributes are initialized with different types of bio-encoders. Then, these existing associations are constructed into one hypergraph G and two bipartite graphs GA,B, GB,с. After that, the hypergraph is encoded with Association Pattern-aware Fusion module based on the pattern commonality, thereby affecting target entity representation. In addition, the bipartite graphs are encoded to output the missing bind-relation feature and thus generate hard negative samples. Finally, the integrated entity feature are used for final association prediction.", "description": "This figure illustrates the overall framework of the proposed Pattern-BERP model.  It shows how entity attributes are encoded, how a hypergraph and two bipartite graphs are constructed from the data, and how these graphs are used in the Association Pattern-aware Fusion module and Bind-relation Enhancement module to generate an integrated entity feature for final association prediction.  The process involves identifying association patterns, integrating them into the entity representation, and generating hard negative samples to improve the model's performance.", "section": "4 Pattern-BERP"}, {"figure_path": "LI5KmimXbM/figures/figures_21_1.jpg", "caption": "Figure 2: Overall framework of Pattern-BERP. First, entity attributes are initialized with different types of bio-encoders. Then, these existing associations are constructed into one hypergraph G and two bipartite graphs GA,B, GB,с. After that, the hypergraph is encoded with Association Pattern-aware Fusion module based on the pattern commonality, thereby affecting target entity representation. In addition, the bipartite graphs are encoded to output the missing bind-relation feature and thus generate hard negative samples. Finally, the integrated entity feature are used for final association prediction.", "description": "This figure illustrates the overall architecture of the Pattern-BERP model. It shows how entity attributes are initialized, how the hypergraph and bipartite graphs are constructed, and how the association pattern-aware fusion and bind-relation enhancement modules are used to generate entity representations for association prediction.", "section": "4 Pattern-BERP"}, {"figure_path": "LI5KmimXbM/figures/figures_21_2.jpg", "caption": "Figure 2: Overall framework of Pattern-BERP. First, entity attributes are initialized with different types of bio-encoders. Then, these existing associations are constructed into one hypergraph G and two bipartite graphs GA,B, GB,с. After that, the hypergraph is encoded with Association Pattern-aware Fusion module based on the pattern commonality, thereby affecting target entity representation. In addition, the bipartite graphs are encoded to output the missing bind-relation feature and thus generate hard negative samples. Finally, the integrated entity feature are used for final association prediction.", "description": "This figure illustrates the overall framework of the Pattern-BERP model. It starts with bio-encoding of entities, then uses association pattern-aware fusion and bind-relation enhancement to generate final entity representation for association prediction. The figure shows how different components such as hypergraph, bipartite graphs and pattern interaction work together.", "section": "4 Pattern-BERP"}]