[{"figure_path": "6KThdqFgmA/figures/figures_9_1.jpg", "caption": "Figure 1: Left: CVaR as noise increases for AAMAS 2015. Right: Convergence behavior of the Iterated Quadratic Program (Iterated QP) vs. Adversarial Projected Subgradient Ascent approach on AAMAS 2015.", "description": "The left plot shows how CVaR of utilitarian social welfare (USW) and group egalitarian social welfare (GESW) change with increasing uncertainty (represented by standard deviation scale).  The right plot compares the convergence speed of two optimization algorithms: Iterated Quadratic Programming and Adversarial Projected Subgradient Ascent, applied to the robust USW maximization problem.", "section": "Robustness under Increasing Uncertainty"}, {"figure_path": "6KThdqFgmA/figures/figures_16_1.jpg", "caption": "Figure 1: Left: CVaR as noise increases for AAMAS 2015. Right: Convergence behavior of the Iterated Quadratic Program (Iterated QP) vs. Adversarial Projected Subgradient Ascent approach on AAMAS 2015.", "description": "The left plot shows how CVaR0.01 (at the 0.01 quantile) of both utilitarian (USW) and egalitarian (GESW) welfare changes as the standard deviation of the Gaussian valuation distribution is increased by a scalar multiple. The right plot shows convergence time in seconds for two different optimization approaches: Iterated Quadratic Programming (Iterated QP) and Adversarial Projected Subgradient Ascent on the AAMAS 2015 dataset. The results highlight the trade-off between the accuracy and computational cost of the two approaches.", "section": "Robustness under Increasing Uncertainty"}, {"figure_path": "6KThdqFgmA/figures/figures_16_2.jpg", "caption": "Figure 1: Left: CVaR as noise increases for AAMAS 2015. Right: Convergence behavior of the Iterated Quadratic Program (Iterated QP) vs. Adversarial Projected Subgradient Ascent approach on AAMAS 2015.", "description": "The figure shows two plots. The left plot displays the CVaR (Conditional Value at Risk) of utilitarian social welfare (USW) and group egalitarian social welfare (GESW) as the standard deviation scale increases for the AAMAS 2015 dataset. The right plot illustrates the convergence speed of the iterated quadratic programming approach against the adversarial projected subgradient ascent method for computing robust USW on the AAMAS 2015 dataset.", "section": "5 Experiments"}, {"figure_path": "6KThdqFgmA/figures/figures_28_1.jpg", "caption": "Figure 1: Left: CVaR as noise increases for AAMAS 2015. Right: Convergence behavior of the Iterated Quadratic Program (Iterated QP) vs. Adversarial Projected Subgradient Ascent approach on AAMAS 2015.", "description": "This figure shows two plots. The left plot displays how the Conditional Value at Risk (CVaR) of utilitarian and egalitarian social welfare changes as the level of noise increases in the AAMAS 2015 dataset. The right plot compares the convergence speed of two optimization algorithms: Iterated Quadratic Programming (IQP) and Adversarial Projected Subgradient Ascent, for maximizing the robust utilitarian and egalitarian welfare.", "section": "5 Experiments"}]