[{"figure_path": "aTNT3FuVBG/figures/figures_4_1.jpg", "caption": "Figure 2: Single-task evaluations on Diabetes (top, disaggregating by race, sex, and age), Adult (middle, disaggregating by race, sex, and age), and Common Voice (bottom, disaggregating by sex and age). The MAE is averaged across all groups (left), large groups (center), or small groups (right). Large and small groups are defined as above and below median group size.", "description": "This figure compares the performance of SureMap against other methods for single-task disaggregated evaluation.  The results are shown across three different datasets: Diabetes, Adult, and Common Voice.  Each dataset is evaluated using different metrics (Mean Absolute Error (MAE)) and group sizes (all, large, and small). The x-axis represents the subsampling rate (related to the median group size), while the y-axis shows the MAE.", "section": "5.1 Single-task"}, {"figure_path": "aTNT3FuVBG/figures/figures_4_2.jpg", "caption": "Figure 1: Matrices CA ∈ {0,1}dxd, whose linear combination defines the covariance Λ(τ) of our additive intersectional effects prior (Eq. 9). In this example, there are two categories for sex (F, M) and three for age (<25,25-64,>64), yielding d = 6 groups. Shaded squares are 1s, unshaded are 0s.", "description": "This figure shows the structure of the covariance matrix Λ(τ) used in the SureMap method.  The matrix is built from a linear combination of several matrices, CA, each representing a different set of intersecting demographic attributes (in this case, sex and age). Each CA is a dxd matrix (where d is the number of groups defined by the intersection of attributes), with a 1 in the (i,j)th entry if groups i and j share the same values for the attributes in A, and 0 otherwise. The weights (hyperparameters) τ for this combination determine how strongly each attribute contributes to the overall covariance structure. The figure helps visualize how the additive prior combines effects of different attributes to model complex relationships between subgroups.", "section": "3.1.1 An additive intersectional effects prior"}, {"figure_path": "aTNT3FuVBG/figures/figures_7_1.jpg", "caption": "Figure 2: Single-task evaluations on Diabetes (top, disaggregating by race, sex, and age), Adult (middle, disaggregating by race, sex, and age), and Common Voice (bottom, disaggregating by sex and age). The MAE is averaged across all groups (left), large groups (center), or small groups (right). Large and small groups are defined as above and below median group size.", "description": "This figure presents the results of single-task evaluations on three different datasets: Diabetes, Adult, and Common Voice.  Each dataset is disaggregated by multiple demographic attributes (race, sex, and age). The figure shows the mean absolute error (MAE) for different subsampling rates. The MAE is calculated across all groups, large groups (above the median group size), and small groups (below the median group size) separately to illustrate the performance of SureMap in different group sizes.", "section": "5.1 Single-task"}, {"figure_path": "aTNT3FuVBG/figures/figures_8_1.jpg", "caption": "Figure 3: Multi-task evaluations on SLACS (top, disaggregating by race, sex, and age) and CVC (bottom, disaggregating by sex and age). Left: Performance across different subsampling rates. Right: Multiplicative improvement in MAE over naive estimator on individual tasks; subsampling rate=0.1.", "description": "This figure presents the results of multi-task evaluations performed on two datasets: SLACS (State-Level ACS) and CVC (Common Voice Clusters).  The left side shows the average performance (measured by Mean Absolute Error, MAE) across various subsampling rates which represents different median group sizes. The right side zooms in on the subsampling rate of 0.1, visualizing the multiplicative improvement of multi-task SureMap against the naive approach for each individual task. The x-axis of the right plots shows the distance between each individual task's true performance and the median multi-task performance. These plots highlight how effective multi-task learning is in boosting performance, particularly when data is scarce.", "section": "5.2 Multi-task"}, {"figure_path": "aTNT3FuVBG/figures/figures_9_1.jpg", "caption": "Figure 3: Multi-task evaluations on SLACS (top, disaggregating by race, sex, and age) and CVC (bottom, disaggregating by sex and age). Left: Performance across different subsampling rates. Right: Multiplicative improvement in MAE over naive estimator on individual tasks; subsampling rate=0.1.", "description": "This figure presents the results of multi-task evaluations using two different datasets: SLACS and CVC.  The left panels show how the mean absolute error (MAE) changes across different subsampling rates.  The right panels focus on a subsampling rate of 0.1 and illustrate the multiplicative improvement in MAE achieved by the proposed multi-task method compared to the naive method for each individual task.", "section": "5.2 Multi-task"}, {"figure_path": "aTNT3FuVBG/figures/figures_9_2.jpg", "caption": "Figure 3: Multi-task evaluations on SLACS (top, disaggregating by race, sex, and age) and CVC (bottom, disaggregating by sex and age). Left: Performance across different subsampling rates. Right: Multiplicative improvement in MAE over naive estimator on individual tasks; subsampling rate=0.1.", "description": "This figure presents the results of multi-task evaluations performed on two datasets: SLACS and CVC.  The left panels show the task-averaged mean absolute error (MAE) across different subsampling rates (which influence the median group size). The right panels illustrate the multiplicative improvement in MAE that the multi-task SureMap model achieves compared to the naive estimator for each task individually at a specific subsampling rate (0.1). This highlights the performance gain obtained by leveraging multi-task information.", "section": "5.2 Multi-task"}, {"figure_path": "aTNT3FuVBG/figures/figures_16_1.jpg", "caption": "Figure 5: Performance as the number of tasks varies, evaluated on SLACS (left) and CVC (right).", "description": "This figure displays the performance of various disaggregated evaluation methods across different numbers of tasks for the SLACS (State-Level ACS) and CVC (Common Voice Clusters) datasets.  The x-axis represents the number of tasks, and the y-axis shows the task-averaged MAE (Mean Absolute Error). The plot helps to understand how the performance of different methods, including the proposed SureMap and various baselines (naive, pooled, Bock, structured regression, MT global, MT offset, MT Bock), changes as more tasks are incorporated into the evaluation. It shows the comparative effectiveness of single-task and multi-task approaches under varying data conditions and is key in understanding the scalability and robustness of the SureMap method. ", "section": "5.2 Multi-task"}, {"figure_path": "aTNT3FuVBG/figures/figures_26_1.jpg", "caption": "Figure 7: Cost of running the methods evaluated in this paper as a function of the number of tasks, with both axes scaled logarithmically. While they are 1–2 orders of magnitude more expensive than the baselines—which all have closed form expressions—SureMap and multi-task SureMap are also 1–2 orders of magnitude than structured regression [Herlihy et al., 2024]. Note that for the most part the runtime of all methods will usually be dwarfed by the cost of inference.", "description": "This figure compares the computational cost of different methods (naive, pooled, Bock, structured regression, SureMap, and multi-task SureMap) for disaggregated evaluation as a function of the number of tasks.  It shows that SureMap and its multi-task variant are significantly more computationally expensive than the simpler baselines, but still substantially faster than structured regression. The cost of inference is typically far greater than model training, so the runtime differences shown here are less important in the overall cost of disaggregated evaluation.", "section": "5 Evaluation"}, {"figure_path": "aTNT3FuVBG/figures/figures_26_2.jpg", "caption": "Figure 8: Evaluations on the regression variant of Diabetes, using MAE as the target metric, disaggregating by race, sex, and age. On the left the MAE is taken across all groups, while in the center it is only over large groups and on the left over small groups. Large and small are defined as the top and bottom half of all groups, respectively.", "description": "This figure displays the performance of different methods for disaggregated evaluation on the Diabetes regression task using MAE. The results are broken down by group size (all, large, and small), showing how the methods perform across different scales and in scenarios with varying amounts of data. This helps to visualize the efficacy of each method under various conditions.", "section": "5.1 Single-task"}, {"figure_path": "aTNT3FuVBG/figures/figures_26_3.jpg", "caption": "Figure 8: Evaluations on the regression variant of Diabetes, using MAE as the target metric, disaggregating by race, sex, and age. On the left the MAE is taken across all groups, while in the center it is only over large groups and on the right over small groups. Large and small are defined as the top and bottom half of all groups, respectively.", "description": "This figure presents single-task evaluation results on the Diabetes regression dataset. Three plots display MAE values for different group sizes (all, large, small) at various subsampling rates.  The plots compare SureMap against several baselines (naive, pooled, Bock, structured regression), illustrating the impact of data scarcity on accuracy.  The figure helps assess SureMap's performance against others, specifically highlighting its effectiveness when dealing with limited data within specific subgroups.", "section": "5.1 Single-task"}, {"figure_path": "aTNT3FuVBG/figures/figures_27_1.jpg", "caption": "Figure 10: Single-task evaluations on the Diabetes classification setting (disaggregating by race,\nsex, and age) when using AUC as the target metric. In the left column the RMSE is taken across\nall groups, while in the center it is only over large groups and on the right over small groups. Large\nand small are defined as the top and bottom half of all groups, respectively.", "description": "This figure presents the results of single-task evaluations on the Diabetes dataset using AUC as the performance metric. The results are disaggregated by race, sex, and age. The figure shows the mean absolute error (MAE) across all groups, large groups (above median group size), and small groups (below median group size) for various subsampling rates.  This allows for an analysis of the performance across different group sizes and data scarcity levels.", "section": "5.1 Single-task"}, {"figure_path": "aTNT3FuVBG/figures/figures_27_2.jpg", "caption": "Figure 11: Single-task evaluation on the Common Voice ASR setting (bottom, disaggregating by sex and age) when using CER as the target metric. In the left column the MAE is taken across all groups, while in the center it is only over large groups and on the right over small groups. Large and small are defined as the top and bottom half of all groups, respectively.", "description": "This figure shows the results of single-task evaluations on the Common Voice ASR dataset using CER (character error rate) as the metric. The dataset is disaggregated by sex and age.  Three plots are presented, each showing the mean absolute error (MAE) for various group sizes (all groups, large groups, and small groups) at different subsampling rates. This visualization helps understand the performance of different methods in estimating errors for diverse group sizes and data availabilities.", "section": "5.1 Single-task"}, {"figure_path": "aTNT3FuVBG/figures/figures_27_3.jpg", "caption": "Figure 12: Multi-task evaluations on state-level ACS data (disaggregating by race, sex, and age) when using AUC as the target metric. On the left is the performance across different subsampling rates while on the right we show (multiplicative) performance improvement over the naive estimator on different tasks at subsampling rate 0.1.", "description": "This figure displays the results of multi-task evaluations on the State-Level ACS dataset.  The left panel shows how the task-averaged mean absolute error (MAE) changes as the median group size varies (due to subsampling). The right panel shows the multiplicative improvement in MAE over the naive estimator for individual tasks when the median group size is 33, highlighting the benefit of the multi-task approach.", "section": "5.2 Multi-task"}, {"figure_path": "aTNT3FuVBG/figures/figures_27_4.jpg", "caption": "Figure 3: Multi-task evaluations on SLACS (top, disaggregating by race, sex, and age) and CVC (bottom, disaggregating by sex and age). Left: Performance across different subsampling rates. Right: Multiplicative improvement in MAE over naive estimator on individual tasks; subsampling rate=0.1.", "description": "This figure presents the results of multi-task evaluations performed on two datasets: SLACS and CVC.  The left panels show how the mean absolute error (MAE) changes across different subsampling rates for various methods.  The right panels illustrate the multiplicative improvement in MAE achieved by the multi-task SureMap method compared to the naive method at a specific subsampling rate (0.1). This highlights the performance gains of the multi-task approach in various settings.", "section": "5.2 Multi-task"}, {"figure_path": "aTNT3FuVBG/figures/figures_27_5.jpg", "caption": "Figure 3: Multi-task evaluations on SLACS (top, disaggregating by race, sex, and age) and CVC (bottom, disaggregating by sex and age). Left: Performance across different subsampling rates. Right: Multiplicative improvement in MAE over naive estimator on individual tasks; subsampling rate=0.1.", "description": "This figure presents the results of multi-task evaluations performed on two datasets: SLACS (State-Level ACS) and CVC (Common Voice Clusters).  The left panels show how the performance (measured by Mean Absolute Error or MAE) changes across various subsampling rates. The right panels highlight the multiplicative improvement in MAE achieved by the multi-task SureMap method compared to the naive approach for each individual task at a subsampling rate of 0.1. This visualization helps to understand the effectiveness of the multi-task learning in improving the accuracy of disaggregated evaluation.", "section": "5.2 Multi-task"}, {"figure_path": "aTNT3FuVBG/figures/figures_28_1.jpg", "caption": "Figure 14: Single-task evaluations on the Diabetes classification setting (top, disaggregating by race, sex, and age), the Adult in-context classification setting (middle, disaggregating by race, sex, and age), and the Common Voice ASR setting (bottom, disaggregating by sex and age); these are the same evaluations as Figure 2 except with RMSE instead of MAE as the performance measure. In the left column the RMSE is taken across all groups, while in the center it is only over large groups and on the right over small groups. Large and small are defined as the top and bottom half of all groups, respectively.", "description": "This figure shows single-task evaluations on three different datasets using RMSE as the performance metric. It compares the performance of SureMap against baselines for three different group sizes (all, large, and small). The x-axis represents the subsampling rate (median group size), and the y-axis represents RMSE.", "section": "5.1 Single-task"}, {"figure_path": "aTNT3FuVBG/figures/figures_28_2.jpg", "caption": "Figure 3: Multi-task evaluations on SLACS (top, disaggregating by race, sex, and age) and CVC (bottom, disaggregating by sex and age). Left: Performance across different subsampling rates. Right: Multiplicative improvement in MAE over naive estimator on individual tasks; subsampling rate=0.1.", "description": "This figure presents the results of multi-task evaluations on two datasets: SLACS and CVC.  The left-hand plots show how the performance of different methods (including the proposed SureMap method) varies across different subsampling rates of the data.  The right-hand plots illustrate the multiplicative improvement in Mean Absolute Error (MAE) that SureMap achieves compared to a simple \"naive\" baseline method at a subsampling rate of 0.1.  These improvements are shown individually for each task (client) in the multi-task setting.", "section": "5.2 Multi-task"}]