[{"figure_path": "WI2VpcBdnd/figures/figures_3_1.jpg", "caption": "Figure 1: Distilled data of MNIST (first row) and CIFAR-100 (second row) for LRR when m = k. Discussion. The requirement for λs can be easily satisfied by setting λs ≤ λ/2 for a given D. If we want to fix a predefined λs, e.g., λs = λ, we need to sample different D (by sampling different Z) so that λs ≤ λ/2 is satisfied. Theorem 4.1 generally suggests that a smaller λs is better for constructing distilled data.", "description": "This figure shows the distilled data generated for MNIST and CIFAR-100 datasets using Linear Ridge Regression (LRR).  The top row displays the distilled MNIST data (one image per class), and the bottom row presents the distilled CIFAR-100 data (one image per class). The caption highlights a key finding from Theorem 4.1: a smaller regularization parameter (λs) generally leads to better results when constructing distilled datasets.", "section": "4.1 Analytical Computation for Linear Ridge Regression"}, {"figure_path": "WI2VpcBdnd/figures/figures_4_1.jpg", "caption": "Figure 2: Initialized data (first row), distilled data generated from real images using techniques in Sec 4.2 (second row), and distilled data generated from random noise using techniques in Sec 4.1 (third row) for a LRR with m = 50 on MNIST and CIFAR-100. IPC: images per class.", "description": "This figure shows three rows of images for MNIST and CIFAR-100 datasets. The first row contains initialized data, which are real images from the datasets. The second row shows the distilled data generated from real images using techniques described in Section 4.2 of the paper. The third row shows distilled data generated using random noise, based on methods presented in Section 4.1. This comparison demonstrates the differences in data generation techniques and their effect on data realism.", "section": "4.2 Finding Realistic Distilled Data"}, {"figure_path": "WI2VpcBdnd/figures/figures_9_1.jpg", "caption": "Figure 2: Initialized data (first row), distilled data generated from real images using techniques in Sec 4.2 (second row), and distilled data generated from random noise using techniques in Sec 4.1 (third row) for a LRR with m = 500 on MNIST and CIFAR-100. IPC: images per class.", "description": "This figure shows the comparison of three different types of data used in the experiment of dataset distillation for Linear Ridge Regression (LRR) with m = 500 data points. The first row is the initialized data used for generating other data; the second row is the distilled data generated from real images using the technique proposed in Section 4.2; and the third row is the distilled data generated from random noise using the technique proposed in Section 4.1. This figure shows the results for MNIST and CIFAR-100 datasets. IPC means Images Per Class.", "section": "4.2 Finding Realistic Distilled Data"}]