[{"figure_path": "kf80ZS3fVy/tables/tables_6_1.jpg", "caption": "Table 1: Main results on one-step editing on the MMEdit. Rel., T-Gen., M-Gen., T-Loc., and M-Loc. refer to Reliability, T-Generality, M-Generality, T-Locality, and M-Locality, respectively.", "description": "This table presents the performance of different multimodal knowledge editing methods on two tasks: VQA and Image Captioning, using two different backbone models (BLIP-2 OPT and MiniGPT-4).  The performance is measured using five metrics: Reliability, Text Generality (T-Gen), Multimodal Generality (M-Gen), Text Locality (T-Loc), and Multimodal Locality (M-Loc).  The table allows for a comparison of the proposed UniKE method against several baselines, demonstrating its effectiveness in balancing reliability, generality, and locality.", "section": "4.2 Main Results on One-step Editing"}, {"figure_path": "kf80ZS3fVy/tables/tables_7_1.jpg", "caption": "Table 1: Main results on one-step editing on the MMEdit. Rel., T-Gen., M-Gen., T-Loc., and M-Loc. refer to Reliability, T-Generality, M-Generality, T-Locality, and M-Locality, respectively.", "description": "This table presents the performance of different methods on the MMEdit benchmark for one-step multimodal editing.  It shows the reliability, generality (text and multimodal), and locality (text and multimodal) of each method across two different backbones (BLIP-2 OPT and MiniGPT-4) and two tasks (VQA and image captioning).  The results are used to compare UniKE against several baseline methods, including fine-tuning, intrinsic knowledge editing approaches (KE, T-Patcher, MEND), and external knowledge resorting (In-Context Editing, SERAC).", "section": "4.2 Main Results on One-step Editing"}, {"figure_path": "kf80ZS3fVy/tables/tables_7_2.jpg", "caption": "Table 4: Results of ablation study to illustrate the effect of individual components.", "description": "This ablation study analyzes the individual components of the UniKE model to understand their contributions to the overall performance. It compares UniKE's full model against versions with only intrinsic knowledge editing, only external knowledge resorting (using latent IKE), intrinsic editing combined with standard IKE, and intrinsic editing combined with latent IKE. The results show how each component impacts the reliability, generality, and locality of the multimodal editing process, demonstrating the synergistic effects of UniKE's unified framework and knowledge disentanglement.", "section": "4.5 In-Depth Analysis"}, {"figure_path": "kf80ZS3fVy/tables/tables_7_3.jpg", "caption": "Table 3: Main results on cross-task editing.", "description": "This table presents the results of cross-task editing experiments, where the model is required to edit both VQA and image captioning samples within the same sequence.  The metrics used are Reliability, T-Generality, M-Generality, T-Locality, and M-Locality. The results show the performance of different methods across these two tasks simultaneously, highlighting UniKE's effectiveness in integrating knowledge from distinct tasks.", "section": "4.4 Main Results on Cross-task Editing"}, {"figure_path": "kf80ZS3fVy/tables/tables_16_1.jpg", "caption": "Table 1: Main results on one-step editing on the MMEdit. Rel., T-Gen., M-Gen., T-Loc., and M-Loc. refer to Reliability, T-Generality, M-Generality, T-Locality, and M-Locality, respectively.", "description": "This table presents the main results of the one-step multimodal editing experiments conducted on the MMEdit benchmark.  It compares the performance of several methods, including the proposed UniKE, across two different backbones (BLIP-2 OPT and MiniGPT-4). The performance is evaluated using five metrics: Reliability (how accurately the editing changes the model's output), T-Generality (generality on text-based aspects), M-Generality (generality on multimodal aspects), T-Locality (locality on text-based aspects), and M-Locality (locality on multimodal aspects).  Higher scores indicate better performance.", "section": "4.2 Main Results on One-step Editing"}]