[{"figure_path": "3ACXaFxjTy/tables/tables_8_1.jpg", "caption": "Table 1 - Results of few-shot semantic segmentation on COCO-20², PASCAL-5², and LVIS-92², under in-context setting.", "description": "This table presents the results of few-shot semantic segmentation experiments conducted on three benchmark datasets (COCO-20, PASCAL-5, and LVIS-92) using different methods, in an in-context learning setting.  The results show the performance of each method in terms of mean Intersection over Union (mIoU) for both one-shot and few-shot scenarios.  This allows for a comparison of various methods' ability to generalize to unseen categories with limited labeled data. The table provides a quantitative evaluation and comparison of different approaches to Few-Shot Semantic Segmentation.", "section": "5.1 In-context setting"}, {"figure_path": "3ACXaFxjTy/tables/tables_8_2.jpg", "caption": "Table 2 - Results of strict few-shot semantic segmentation on COCO-20². DiffewS-n represents using training time improvements for N-shot.", "description": "This table presents the results of the strict few-shot semantic segmentation experiment conducted on the COCO-20 dataset.  It compares the performance of the proposed DiffewS method (both the original version and a version with training time improvements denoted by DiffewS-n) against several state-of-the-art (SOTA) methods.  The results are shown for both 1-shot and 5-shot settings across four different folds (20\". Each fold consists of 60 classes for training and 20 for testing, and for each fold 1000 reference-target pairs are randomly sampled. The table shows the mean Intersection over Union (mIoU) scores for each method across all folds, offering a comprehensive evaluation of few-shot segmentation performance.", "section": "5 Experiment"}, {"figure_path": "3ACXaFxjTy/tables/tables_15_1.jpg", "caption": "Table 3 - Comparison of different thresholding methods", "description": "This table presents the results of an experiment comparing different thresholding methods (absolute and relative) used in post-processing the model's output mask.  The goal was to determine which thresholding method yielded the best segmentation performance (measured by mIoU).  The table shows that a relative threshold of 0.25 produced the best results in this instance (47.69 mIoU).", "section": "A.5 More ablation studies"}, {"figure_path": "3ACXaFxjTy/tables/tables_15_2.jpg", "caption": "Table 4 - Comparison of different Multiplication methods", "description": "This table presents a comparison of two different methods for applying the multiplication operation within the DiffewS framework. One method applies the multiplication in the latent space, while the other applies it directly to the RGB images. The table shows that applying the multiplication directly to the RGB images achieves slightly better results (33.12 mIoU) compared to applying it in the latent space (32.14 mIoU).", "section": "4.2 Injection of support mask information"}, {"figure_path": "3ACXaFxjTy/tables/tables_15_3.jpg", "caption": "Table 5 – Comparison of different Self-Attention fusion strategies", "description": "This table presents a comparison of two different self-attention fusion strategies: KV fusion and QKV fusion. The results show that the KV fusion strategy achieves slightly better performance (46.64 mIoU) compared to the QKV fusion strategy (46.61 mIoU).", "section": "4.1 Interaction between query and support images"}, {"figure_path": "3ACXaFxjTy/tables/tables_16_1.jpg", "caption": "Table 6 - Performance of DiffewS with Inference Time Improvement", "description": "This table presents the results of the DiffewS model on COCO and PASCAL datasets, comparing the performance with and without the inference time improvement.  The original DiffewS model ('ori') is compared against a version that employs random sampling of keys and values from support samples during inference ('sample'). Results are shown for 1-shot, 5-shot, and 10-shot scenarios, demonstrating the impact of the inference optimization on performance.", "section": "5.1 In-context setting"}, {"figure_path": "3ACXaFxjTy/tables/tables_17_1.jpg", "caption": "Table 7 - Performance of DiffewS with Training Time Improvement", "description": "This table shows the performance (mIoU) of the DiffewS model in a few-shot semantic segmentation task under different training scenarios.  The \"Diffews (ori, train 1 shot)\" row represents the original model trained only for the 1-shot setting.  The other rows demonstrate the improvement achieved by training the model with multiple shots (1-5 shots and 1-7 shots) before evaluating it on 1, 5, and 10 shot scenarios.  The results indicate how training with multiple shots impacts the performance in different few-shot settings.", "section": "5 Experiment"}]