[{"figure_path": "N8YbGX98vc/tables/tables_5_1.jpg", "caption": "Table 1: Influence of the number of Monte-Carlo samples in estimating the expectation of Line 4. Both the FID and the accuracy remain unchanged when #Samples varies, suggesting that the number of samples is less important.", "description": "This table presents the results of an experiment to determine the effect of the number of Monte Carlo samples used in estimating the expectation in Line 4 of the TFG algorithm.  The experiment is broken down into two parts: Variance only, where the focus is on the variance component, and Mean only, focusing on the mean. The results show that the number of samples has little impact on the performance of the algorithm (as measured by FID and accuracy). This suggests that a smaller number of samples can be used without significantly affecting the outcomes.", "section": "3.2 Algorithm and design space analysis"}, {"figure_path": "N8YbGX98vc/tables/tables_7_1.jpg", "caption": "Table 2: List of 14 task types we benchmark. Each task is run with multiple individual targets (38 in total). We evaluate the guidance validity (how well a sample is aligned with the target predictor) and the guidance fidelity (how well a sample is aligned with the unconditional distribution) according to the task type.", "description": "This table presents a comprehensive list of the 14 different tasks used to benchmark the training-free guidance methods proposed in the paper.  Each task involves multiple individual targets (a total of 38).  For each task, the table specifies the diffusion model used, the type of guidance (e.g., Gaussian deblurring, label guidance), and the metrics employed to evaluate both the validity (alignment with the target) and fidelity (alignment with the original distribution) of the generated samples. This table provides a clear overview of the range of tasks and evaluation criteria used in the study.", "section": "5 Benchmarking"}, {"figure_path": "N8YbGX98vc/tables/tables_8_1.jpg", "caption": "Table 3: Benchmarking TFG and existing algorithms on 16 task types and 40 individual targets. Each cell presents the guidance validity/generation fidelity averaged across multiple targets in the task (e.g., labels, image styles). The best guidance validity is bold, and the second best underline. The relative improvement of guidance validity is computed between TFG and the existing method with the highest guidance validity.", "description": "This table presents a comprehensive benchmark comparing the performance of the proposed Training-Free Guidance (TFG) framework against five existing training-free guidance methods across 16 diverse tasks and a total of 40 individual targets.  Each task involves multiple targets (e.g., different labels or image styles), and the table shows the average guidance validity (how well the generated samples align with the desired properties) and generation fidelity (how realistic the generated samples appear) for each method. The best performing method for each task is highlighted in bold, indicating the superior performance of TFG across various scenarios.", "section": "5 Benchmarking"}, {"figure_path": "N8YbGX98vc/tables/tables_9_1.jpg", "caption": "Table 4: The accuracy / FID for TFG with different recurrence step Nrecur on three label guidance datasets, averaged across all labels.", "description": "This table presents the accuracy and FID (Fréchet Inception Distance) scores achieved by the Training-Free Guidance (TFG) method on three different datasets (CIFAR10, ImageNet, and Fine-grained) for label guidance task. The results are shown for different numbers of recurrence steps (Nrecur = 1, 2, and 4).  It demonstrates the impact of recurrence on the performance of the TFG method in improving both the accuracy of label classification and reducing the FID (a measure of image quality). Higher accuracy and lower FID indicate better performance.", "section": "Multiple guidance and bias mitigation"}, {"figure_path": "N8YbGX98vc/tables/tables_9_2.jpg", "caption": "Table 5: The accuracy of multi-label guidance on CelebA, where labels 0 and 1 correspond to female and male (gender), non-blonde and blonde (hair color), and young and old (age). The accuracy is lower for minority groups, indicating an implicit bias in the generation process. Despite this, it is still much higher than unconditional generation.", "description": "This table presents the accuracy of multi-label guidance on the CelebA dataset.  It shows the accuracy of generating images with specific combinations of gender and hair color (or age).  Noteworthy is that the accuracy is lower for less frequent combinations, demonstrating an implicit bias in the data and the model despite overall high performance compared to unconditional generation. ", "section": "Multiple guidance and bias mitigation"}, {"figure_path": "N8YbGX98vc/tables/tables_19_1.jpg", "caption": "Table 3: Benchmarking TFG and existing algorithms on 16 task types and 40 individual targets. Each cell presents the guidance validity/generation fidelity averaged across multiple targets in the task (e.g., labels, image styles). The best guidance validity is bold, and the second best underline. The relative improvement of guidance validity is computed between TFG and the existing method with the highest guidance validity.", "description": "This table presents a comprehensive benchmark comparing the performance of the proposed Training-Free Guidance (TFG) framework against five existing training-free guidance methods across 16 diverse tasks and a total of 40 individual targets.  The tasks cover various domains, such as image processing, audio processing, and molecular design. For each task and target, the table shows the guidance validity (how well the generated samples align with the desired properties) and guidance fidelity (how well the generated samples reflect the underlying data distribution).  The best performing method for each task is highlighted in bold, while the second-best is underlined.  Additionally, the relative improvement achieved by TFG compared to the best-performing existing method is also provided, demonstrating the superiority of the TFG framework.", "section": "5 Benchmarking"}, {"figure_path": "N8YbGX98vc/tables/tables_27_1.jpg", "caption": "Table 3: Benchmarking TFG and existing algorithms on 16 task types and 40 individual targets. Each cell presents the guidance validity/generation fidelity averaged across multiple targets in the task (e.g., labels, image styles). The best guidance validity is bold, and the second best underline. The relative improvement of guidance validity is computed between TFG and the existing method with the highest guidance validity.", "description": "This table presents a comprehensive benchmark comparing the performance of the proposed TFG method against five existing training-free guidance algorithms across 16 different tasks and a total of 40 individual targets.  The tasks encompass diverse domains including image processing, audio processing, and molecular generation. For each task and target, the table shows the guidance validity (how well the generated samples align with the desired properties) and generation fidelity (how realistic the generated samples are). The best performing method for each task is highlighted in bold, showcasing TFG's superior performance across the different tasks and demonstrating its ability to achieve consistently good results. The relative improvement of TFG over the best baseline method is also provided for each task.", "section": "5 Benchmarking"}, {"figure_path": "N8YbGX98vc/tables/tables_27_2.jpg", "caption": "Table 3: Benchmarking TFG and existing algorithms on 16 task types and 40 individual targets. Each cell presents the guidance validity/generation fidelity averaged across multiple targets in the task (e.g., labels, image styles). The best guidance validity is bold, and the second best underline. The relative improvement of guidance validity is computed between TFG and the existing method with the highest guidance validity.", "description": "This table presents a comprehensive benchmark comparing the performance of the proposed Training-Free Guidance (TFG) framework against five existing training-free guidance methods across sixteen diverse tasks and forty target properties.  The results show the average guidance validity and fidelity for each method on each task, highlighting TFG's superior performance and relative improvement over existing methods. Guidance validity refers to how well the generated samples align with the intended target, while fidelity measures how well the samples match the unconditional data distribution.", "section": "5 Benchmarking"}, {"figure_path": "N8YbGX98vc/tables/tables_31_1.jpg", "caption": "Table 3: Benchmarking TFG and existing algorithms on 16 task types and 40 individual targets. Each cell presents the guidance validity/generation fidelity averaged across multiple targets in the task (e.g., labels, image styles). The best guidance validity is bold, and the second best underline. The relative improvement of guidance validity is computed between TFG and the existing method with the highest guidance validity.", "description": "This table presents a comprehensive benchmark comparing the performance of the proposed Training-Free Guidance (TFG) framework against five existing training-free guidance methods across 16 diverse tasks and a total of 40 individual targets.  For each task and target, the table shows the guidance validity (how well the generated samples align with the desired properties) and guidance fidelity (how well the samples align with the unconditional data distribution).  The best and second-best results for each task are highlighted, and the relative improvement achieved by TFG over the best-performing existing method is also indicated.", "section": "5 Benchmarking"}, {"figure_path": "N8YbGX98vc/tables/tables_33_1.jpg", "caption": "Table 3: Benchmarking TFG and existing algorithms on 16 task types and 40 individual targets. Each cell presents the guidance validity/generation fidelity averaged across multiple targets in the task (e.g., labels, image styles). The best guidance validity is bold, and the second best underline. The relative improvement of guidance validity is computed between TFG and the existing method with the highest guidance validity.", "description": "This table presents a comprehensive benchmark comparing the Training-Free Guidance (TFG) framework with existing methods across 16 different tasks and 40 individual targets.  For each task and target, the table shows the guidance validity (how well the generated samples align with the target) and the guidance fidelity (how well the samples align with the unconditional distribution).  The best performing method for validity is highlighted in bold, and the second best is underlined. Finally, it calculates the percentage improvement achieved by TFG over the best-performing existing method for each task.", "section": "5 Benchmarking"}, {"figure_path": "N8YbGX98vc/tables/tables_39_1.jpg", "caption": "Table 3: Benchmarking TFG and existing algorithms on 16 task types and 40 individual targets. Each cell presents the guidance validity/generation fidelity averaged across multiple targets in the task (e.g., labels, image styles). The best guidance validity is bold, and the second best underline. The relative improvement of guidance validity is computed between TFG and the existing method with the highest guidance validity.", "description": "This table presents a comprehensive benchmark comparing the performance of the proposed Training-Free Guidance (TFG) framework against existing methods across 16 diverse tasks and 40 specific targets.  The results are shown as guidance validity (how well the generated samples align with the desired properties) and generation fidelity (how realistic the generated samples appear). For each task, the best-performing method is highlighted in bold, while the second-best is underlined.  The relative improvement column quantifies TFG's advantage over the best existing method for each task.", "section": "5 Benchmarking"}, {"figure_path": "N8YbGX98vc/tables/tables_40_1.jpg", "caption": "Table 3: Benchmarking TFG and existing algorithms on 16 task types and 40 individual targets. Each cell presents the guidance validity/generation fidelity averaged across multiple targets in the task (e.g., labels, image styles). The best guidance validity is bold, and the second best underline. The relative improvement of guidance validity is computed between TFG and the existing method with the highest guidance validity.", "description": "This table presents a comprehensive benchmark comparing the performance of the proposed Training-Free Guidance (TFG) framework against existing methods across 16 different tasks and a total of 40 individual targets.  For each task and target, the table shows the guidance validity (how well the generated samples align with the target property) and guidance fidelity (how well the generated samples resemble the true data distribution). The best and second-best performance for each cell is highlighted, along with the relative percentage improvement achieved by TFG over the best-performing existing method. The table offers a quantitative comparison of TFG's effectiveness across diverse applications. ", "section": "5 Benchmarking"}]