[{"figure_path": "AYq6GxxrrY/figures/figures_6_1.jpg", "caption": "Figure 1: Results for the alanine dipeptide system simulated with a classical force field (a) Ramachandran plots for the biased MD distribution (left) and for samples generate with the TBG + full model (right). (b) Energies of samples generated with different methods. (c) Free energy projection along the slowest transition (φ angle), computed with different methods.", "description": "This figure shows the results for the alanine dipeptide system simulated with a classical force field.  Panel (a) presents Ramachandran plots comparing the biased MD distribution with samples generated using the Transferable Boltzmann Generator (TBG) + full model.  Panel (b) displays the energy distributions of samples from various methods: biased MD, TBG + backbone, and TBG + full. Finally, panel (c) shows the free energy projection along the slowest transition (φ angle) illustrating the performance of the different methods in capturing the free energy landscape.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/figures/figures_6_2.jpg", "caption": "Figure 1: Results for the alanine dipeptide system simulated with a classical force field (a) Ramachandran plots for the biased MD distribution (left) and for samples generate with the TBG + full model (right). (b) Energies of samples generated with different methods. (c) Free energy projection along the slowest transition (φ angle), computed with different methods.", "description": "This figure presents a comparison of different methods for simulating the alanine dipeptide molecule, focusing on the accuracy of free energy landscape reproduction.  Panel (a) shows Ramachandran plots, visualizing the distribution of dihedral angles (φ and ψ).  The biased MD distribution and the samples generated by the transferable Boltzmann Generator (TBG + full model) are compared. Panel (b) displays the energy distributions from various methods.  Finally, panel (c) shows free energy profiles along the slowest reaction coordinate (φ), highlighting the accuracy and efficiency of the proposed TBG + full model compared to other approaches such as biased MD.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/figures/figures_7_1.jpg", "caption": "Figure 1: Results for the alanine dipeptide system simulated with a classical force field (a) Ramachandran plots for the biased MD distribution (left) and for samples generate with the TBG + full model (right). (b) Energies of samples generated with different methods. (c) Free energy projection along the slowest transition (φ angle), computed with different methods.", "description": "This figure presents a comparison of results obtained using different methods for simulating the alanine dipeptide system with a classical force field.  Panel (a) shows Ramachandran plots, visualizing the conformational landscape. The biased MD distribution is compared to samples generated by the Transferable Boltzmann Generator (TBG) model. Panel (b) compares the energy distributions of samples generated by various methods, including biased MD, the TBG model, and the reweighted TBG samples. Finally, panel (c) illustrates the free energy projection along the slowest transition coordinate (φ angle), further highlighting the performance of the TBG + full model in reproducing the correct free energy landscape.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/figures/figures_16_1.jpg", "caption": "Figure 1: Results for the alanine dipeptide system simulated with a classical force field (a) Ramachandran plots for the biased MD distribution (left) and for samples generate with the TBG + full model (right). (b) Energies of samples generated with different methods. (c) Free energy projection along the slowest transition (φ angle), computed with different methods.", "description": "This figure shows the results for the alanine dipeptide system simulated using different methods: biased MD, Boltzmann Generator with backbone encoding (BG + backbone), and the proposed transferable Boltzmann Generator with full architecture (TBG + full).  Panel (a) compares Ramachandran plots visualizing the conformational space sampled by each method. Panel (b) provides a comparison of the energy distributions obtained.  Panel (c) displays the free energy projection along the slowest transition coordinate (φ angle), illustrating the free energy landscape generated by each approach and its agreement with the reference (umbrella sampling) calculation.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/figures/figures_17_1.jpg", "caption": "Figure 1: Results for the alanine dipeptide system simulated with a classical force field (a) Ramachandran plots for the biased MD distribution (left) and for samples generate with the TBG + full model (right). (b) Energies of samples generated with different methods. (c) Free energy projection along the slowest transition (φ angle), computed with different methods.", "description": "This figure displays results for the alanine dipeptide, comparing different sampling methods. Panel (a) shows Ramachandran plots visualizing the conformational space sampled by biased molecular dynamics (MD) and the transferable Boltzmann Generator (TBG) + full model.  Panel (b) presents the energy distributions of samples generated via different techniques. Panel (c) illustrates free energy profiles along the slowest-moving dihedral angle (φ), highlighting the ability of the TBG+full model to accurately capture the free energy landscape.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/figures/figures_17_2.jpg", "caption": "Figure 7: Results for the KS dipeptide for TBG + full model trained on 100 times smaller training trajectories. As can be seen in Figure 2, the results for the TBG + full model trained on the whole trajectories are much better. (a) KS dipeptide (b) Ramachandran plot for the weighted MD distribution (left) and for samples generate with the model (right). (c) TICA plot for the weighted MD distribution (left) and for samples generate with the model (right). (d) Energies of samples generated with the model. (e) Free energy projection along the φ angle. (f) Free energy projection along the slowest transition (TICO).", "description": "Figure 7 shows the results for the KS dipeptide when the TBG + full model is trained with 100 times smaller training trajectories compared to the results in Figure 2.  Subfigures (a) through (f) show a Ramachandran plot, TICA plot, energy distribution, and free energy projections along both φ and the slowest transition coordinate (TIC0).  The results from the model trained on the shorter trajectories are significantly worse compared to the model trained on longer trajectories. This highlights the importance of adequate sampling during training to capture all relevant metastable states.", "section": "5.2 Dipeptides (2AA)"}, {"figure_path": "AYq6GxxrrY/figures/figures_18_1.jpg", "caption": "Figure 9: Sampled molecules with the TBG and TBG + backbone models, which do not have the correct topology. (a) NY dipeptide reference (b) Generated molecule with NY atoms by the TBG model. (c) IM dipeptide reference (d) Generated molecule with IM atoms by the TBG model. (e) TD dipeptide reference (f) Generated molecule with TD atoms by the TBG + backbone model.", "description": "This figure shows examples of molecules sampled by the TBG and TBG + backbone models that have incorrect topologies, highlighting a limitation of these models in correctly capturing molecular structures.  It contrasts these incorrect samples with the correct reference structures for NY, IM, and TD dipeptides, illustrating the failure of the TBG and TBG + backbone models to accurately reproduce the correct bonding configurations. The figure emphasizes the improved performance of the TBG + full model in this regard, which is not shown here but referenced in the text.", "section": "4.3 Inference with transferable Boltzmann Generators"}, {"figure_path": "AYq6GxxrrY/figures/figures_18_2.jpg", "caption": "Figure 1: Results for the alanine dipeptide system simulated with a classical force field (a) Ramachandran plots for the biased MD distribution (left) and for samples generate with the TBG + full model (right). (b) Energies of samples generated with different methods. (c) Free energy projection along the slowest transition (φ angle), computed with different methods.", "description": "This figure compares different methods for simulating the alanine dipeptide, focusing on the accuracy of the free energy landscape.  Panel (a) shows Ramachandran plots, visualizing the conformational space sampled by biased molecular dynamics (MD) and the transferable Boltzmann Generator (TBG) + full model. Panel (b) presents energy distributions for each method. Panel (c) displays free energy projections along the slowest transition coordinate (φ angle), highlighting differences in sampling efficiency and accuracy. The TBG + full model shows improved performance in sampling and recovering the correct free energy landscape compared to traditional methods.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/figures/figures_19_1.jpg", "caption": "Figure 1: Results for the alanine dipeptide system simulated with a classical force field (a) Ramachandran plots for the biased MD distribution (left) and for samples generate with the TBG + full model (right). (b) Energies of samples generated with different methods. (c) Free energy projection along the slowest transition (φ angle), computed with different methods.", "description": "This figure shows the results for the alanine dipeptide system simulated with a classical force field. Panel (a) shows Ramachandran plots comparing the biased MD distribution with samples generated using the transferable Boltzmann Generator (TBG) + full model. Panel (b) presents a comparison of the energies of samples generated by different methods: biased MD, TBG + full, and TBG + full after reweighting. Finally, panel (c) displays the free energy projection along the slowest transition (φ angle) calculated using different approaches. The figure visually demonstrates the effectiveness of the TBG + full model in accurately capturing the energy landscape of the system, particularly after reweighting.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/figures/figures_20_1.jpg", "caption": "Figure 1: Results for the alanine dipeptide system simulated with a classical force field (a) Ramachandran plots for the biased MD distribution (left) and for samples generate with the TBG + full model (right). (b) Energies of samples generated with different methods. (c) Free energy projection along the slowest transition (φ angle), computed with different methods.", "description": "This figure shows the results for alanine dipeptide simulations using classical force fields.  Panel (a) presents Ramachandran plots comparing biased molecular dynamics (MD) simulations with samples generated using the transferable Boltzmann Generator (TBG) with a full architecture. Panel (b) displays energy distributions for the different methods. Panel (c) shows free energy projections along the slowest transition coordinate (φ angle).  The TBG + full model demonstrates improved performance in aligning with the reference MD simulation.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/figures/figures_21_1.jpg", "caption": "Figure 1: Results for the alanine dipeptide system simulated with a classical force field (a) Ramachandran plots for the biased MD distribution (left) and for samples generate with the TBG + full model (right). (b) Energies of samples generated with different methods. (c) Free energy projection along the slowest transition (φ angle), computed with different methods.", "description": "This figure presents a comparison of results obtained using different methods for simulating the alanine dipeptide system. The methods include biased molecular dynamics (MD), a Boltzmann Generator with a backbone encoding (BG + backbone), and a transferable Boltzmann Generator with a full encoding (TBG + full).  Panel (a) shows Ramachandran plots, illustrating the conformational space sampled by each method. Panel (b) compares the energy distributions of the generated samples. Panel (c) depicts the free energy profiles along the slowest transition coordinate (φ dihedral angle). This provides a comprehensive comparison of the accuracy and efficiency of different sampling techniques.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/figures/figures_21_2.jpg", "caption": "Figure 1: Results for the alanine dipeptide system simulated with a classical force field (a) Ramachandran plots for the biased MD distribution (left) and for samples generate with the TBG + full model (right). (b) Energies of samples generated with different methods. (c) Free energy projection along the slowest transition (φ angle), computed with different methods.", "description": "This figure presents the results of simulations on the alanine dipeptide system using both classical molecular dynamics (MD) and the proposed Transferable Boltzmann Generator (TBG) model. Panel (a) shows Ramachandran plots, visualizing the conformational space sampled by each method.  Panel (b) displays energy distributions for samples from each simulation method, highlighting the differences in energy coverage and bias. Panel (c) presents a free energy profile calculated along the slowest-moving transition coordinate (φ dihedral angle), demonstrating the TBG model's ability to recover the correct free energy landscape.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/figures/figures_22_1.jpg", "caption": "Figure 1: Results for the alanine dipeptide system simulated with a classical force field (a) Ramachandran plots for the biased MD distribution (left) and for samples generate with the TBG + full model (right). (b) Energies of samples generated with different methods. (c) Free energy projection along the slowest transition (φ angle), computed with different methods.", "description": "This figure shows the results of applying different methods to simulate the alanine dipeptide system.  Panel (a) compares Ramachandran plots from biased molecular dynamics (MD) simulations with those generated by the Transferable Boltzmann Generator (TBG) model. Panel (b) presents a comparison of the energy distributions obtained from various methods. Finally, panel (c) displays free energy projections along the slowest transition coordinate (φ angle) from these simulations, highlighting the enhanced accuracy and efficiency of the TBG + full model.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/figures/figures_22_2.jpg", "caption": "Figure 1: Results for the alanine dipeptide system simulated with a classical force field (a) Ramachandran plots for the biased MD distribution (left) and for samples generate with the TBG + full model (right). (b) Energies of samples generated with different methods. (c) Free energy projection along the slowest transition (ψ angle), computed with different methods.", "description": "This figure shows the results for the alanine dipeptide system simulated using both classical MD and the proposed Transferable Boltzmann Generator (TBG) with the full architecture.  Panel (a) compares Ramachandran plots from biased MD simulations to those generated by the TBG model, illustrating the model's ability to sample conformations. Panel (b) presents the energy distributions for samples generated using different methods (biased MD, TBG + full model), while panel (c) displays the free energy profiles along the slowest conformational transition coordinate (ψ angle) comparing different sampling methods demonstrating the TBG model's effectiveness in accurately representing the system's energy landscape.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/figures/figures_23_1.jpg", "caption": "Figure 1: Results for the alanine dipeptide system simulated with a classical force field (a) Ramachandran plots for the biased MD distribution (left) and for samples generate with the TBG + full model (right). (b) Energies of samples generated with different methods. (c) Free energy projection along the slowest transition (φ angle), computed with different methods.", "description": "This figure displays the results of simulating the alanine dipeptide system using various methods.  Panel (a) shows Ramachandran plots, comparing the biased molecular dynamics (MD) simulation with samples generated using the transferable Boltzmann Generator (TBG) + full model. Panel (b) provides a comparison of the energies of samples from different methods. Finally, panel (c) presents the free energy projection along the slowest transition (the φ angle) calculated using several methods, illustrating the accuracy of the TBG + full model in capturing the free energy landscape.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/figures/figures_23_2.jpg", "caption": "Figure 2: Results for the KS dipeptide (a) Sample generated with the TBG + full model (b) Ramachandran plot for the weighted MD distribution (left) and for samples generate with the TBG + full model (right). (c) TICA plot for the weighted MD distribution (left) and for samples generate with the TBG + full model (right). (d) Energies of samples generated with different methods and architectures. (e) Free energy projection along the φ angle. (f) Free energy projection along the slowest transition (TIC0).", "description": "This figure displays the results for the KS dipeptide using the Transferable Boltzmann Generator (TBG) with the full architecture. It shows a Ramachandran plot, TICA plot, energy distributions, and free energy projections along φ and the slowest collective variable (TIC0), comparing the TBG + full model with other methods and architectures. The results demonstrate the TBG + full model's ability to effectively sample from the target Boltzmann distribution.", "section": "5.2 Dipeptides (2AA)"}, {"figure_path": "AYq6GxxrrY/figures/figures_24_1.jpg", "caption": "Figure 1: Results for the alanine dipeptide system simulated with a classical force field (a) Ramachandran plots for the biased MD distribution (left) and for samples generate with the TBG + full model (right). (b) Energies of samples generated with different methods. (c) Free energy projection along the slowest transition (φ angle), computed with different methods.", "description": "This figure presents the results for alanine dipeptide simulations using classical force fields.  Panel (a) shows Ramachandran plots comparing biased molecular dynamics (MD) simulations to those generated with the Transferable Boltzmann Generator (TBG) + full model. The TBG + full model successfully samples the relevant conformational space of the dipeptide, mirroring the MD results. Panel (b) provides a direct energy comparison of the samples generated with the different methods; highlighting the enhanced sampling capabilities of the TBG model. Finally, panel (c) displays the free energy profiles along the slowest transition coordinate (φ dihedral angle), computed using various methods, to showcase that the TBG model accurately reproduces the free energy landscape.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/figures/figures_25_1.jpg", "caption": "Figure 20: Comparison of classical MD runs for 1 hour (MD - 1h) and the sampling with the TBG + full (smaller) model without weight computation for 1 hour (TBG + full (smaller) - 1h). The TICA plots of different peptides from the test set are shown. It is important to note that the TICA projection is always computed with respect to the long MD trajectory (MD). All peptides stem from the test set. (a) CS dipeptide (b) EK dipeptide (c) KI dipeptide (d) LW dipeptide (e) RL dipeptide (f) TF dipeptide.", "description": "This figure compares the results of classical Molecular Dynamics (MD) simulations and the proposed Transferable Boltzmann Generator (TBG) model for six different dipeptides. The TBG model is run for a shorter time (1 hour) without reweighting, while the MD simulations run for a longer period (1 hour).  TICA plots are used to visualize the different metastable states of the dipeptides.  The comparison showcases the ability of the TBG model to efficiently sample from the Boltzmann distribution, even in a shorter time frame, and to capture the relevant metastable states.", "section": "5.2 Dipeptides (2AA)"}, {"figure_path": "AYq6GxxrrY/figures/figures_26_1.jpg", "caption": "Figure 1: Results for the alanine dipeptide system simulated with a classical force field (a) Ramachandran plots for the biased MD distribution (left) and for samples generate with the TBG + full model (right). (b) Energies of samples generated with different methods. (c) Free energy projection along the slowest transition (φ angle), computed with different methods.", "description": "This figure shows the results of simulations for alanine dipeptide using a classical force field. It compares three different methods: biased MD, the Boltzmann Generator with backbone encoding, and the transferable Boltzmann Generator with the full architecture. Panel (a) displays Ramachandran plots illustrating the conformational distributions obtained by each method. Panel (b) presents a comparison of the energy distributions generated by each method, highlighting the differences in their sampling efficiency. Finally, panel (c) shows a free energy projection along the slowest transition (φ angle), allowing the comparison of the accuracy in the free energy landscape reconstruction for each method.", "section": "5.1 Alanine dipeptide"}, {"figure_path": "AYq6GxxrrY/figures/figures_26_2.jpg", "caption": "Figure 1: Results for the alanine dipeptide system simulated with a classical force field (a) Ramachandran plots for the biased MD distribution (left) and for samples generate with the TBG + full model (right). (b) Energies of samples generated with different methods. (c) Free energy projection along the slowest transition (φ angle), computed with different methods.", "description": "The figure presents a comparison of different methods for simulating the alanine dipeptide system.  Panel (a) shows Ramachandran plots comparing biased molecular dynamics (MD) simulations and samples generated using the transferable Boltzmann Generator (TBG) with the full architecture. Panel (b) shows energy distributions for each method, highlighting differences in energy landscape exploration. Panel (c) displays the free energy profile along the slowest-transitioning dihedral angle (φ) based on MD simulations, the TBG model with a full architecture, and the same TBG model after reweighting.", "section": "5.1 Alanine dipeptide"}]