[{"figure_path": "dxxj4S06YL/tables/tables_4_1.jpg", "caption": "Table 1: Competitive ratio (mean ± std deviation) on Almost-constant", "description": "This table presents the results of the competitive ratio for the Almost-constant dataset. The competitive ratio is calculated as the ratio of the true value accepted by the algorithm to the maximum true value across all candidates. The mean and standard deviation are computed across 10000 instances for each algorithm and for different levels of prediction error (ε).", "section": "5 Experiments"}, {"figure_path": "dxxj4S06YL/tables/tables_13_1.jpg", "caption": "Table 1: Competitive ratio (mean ± std deviation) on Almost-constant", "description": "This table presents the mean and standard deviation of the competitive ratios achieved by different algorithms on Almost-constant instances.  The competitive ratio measures the ratio of the true value accepted by an algorithm to the maximum true value.  The results are shown for varying levels of prediction error (ε), from 0 to 0.95, allowing analysis of the algorithms’ performance across different levels of prediction accuracy.", "section": "5 Experiments"}, {"figure_path": "dxxj4S06YL/tables/tables_15_1.jpg", "caption": "Table 1: Competitive ratio (mean ± std deviation) on Almost-constant", "description": "This table presents the results of the competitive ratio for the Almost-constant instance type. The competitive ratio is calculated as the ratio of the true value accepted by the algorithm to the maximum true value. The mean and standard deviation are calculated across 10000 instances for each algorithm and value of epsilon. The table shows that ADDITIVE-PEGGING and MULTIPLICATIVE-PEGGING consistently achieve the highest competitive ratio compared to the benchmarks, particularly for higher values of epsilon.", "section": "5 Experiments"}, {"figure_path": "dxxj4S06YL/tables/tables_25_1.jpg", "caption": "Table 1: Competitive ratio (mean ± std deviation) on Almost-constant", "description": "This table presents the average competitive ratio and its standard deviation for different algorithms on Almost-constant datasets with varying prediction error (epsilon).  The competitive ratio measures the performance of each algorithm by comparing the value of the chosen candidate to the maximum value.  The standard deviation reflects the variability in the algorithm's performance across multiple runs for each epsilon value.  The algorithms compared include ADDITIVE-PEGGING, MULTIPLICATIVE-PEGGING, LEARNED-DYNKIN, DYNKIN, and HIGHEST-PREDICTION.", "section": "5 Experiments"}, {"figure_path": "dxxj4S06YL/tables/tables_25_2.jpg", "caption": "Table 1: Competitive ratio (mean ± std deviation) on Almost-constant", "description": "This table presents the results of the competitive ratio for the Almost-constant instance type. The competitive ratio is calculated as the ratio of the true value accepted by the algorithm to the maximum true value across 10000 instances for each value of epsilon.  The mean and standard deviation of this ratio are reported. Epsilon represents the prediction error.", "section": "5 Experiments"}, {"figure_path": "dxxj4S06YL/tables/tables_26_1.jpg", "caption": "Table 1: Competitive ratio (mean ± std deviation) on Almost-constant", "description": "This table presents the results of the competitive ratio for the Almost-constant instance type. The competitive ratio is calculated as the ratio of the true value accepted by the algorithm to the maximum true value. The mean and standard deviation of the ratio are calculated across 10000 instances for each algorithm and each value of epsilon (prediction error). Epsilon ranges from 0 to 0.95 in increments of 0.05. The algorithms compared are ADDITIVE-PEGGING, MULTIPLICATIVE-PEGGING, LEARNED-DYNKIN, DYNKIN, and HIGHEST-PREDICTION.", "section": "5 Experiments"}, {"figure_path": "dxxj4S06YL/tables/tables_26_2.jpg", "caption": "Table 1: Competitive ratio (mean ± std deviation) on Almost-constant", "description": "This table presents the mean and standard deviation of the competitive ratios achieved by different algorithms on the Almost-constant dataset for various prediction error levels (ε).  The competitive ratio measures the algorithm's performance in achieving the maximum possible value.  The algorithms compared are ADDITIVE-PEGGING, MULTIPLICATIVE-PEGGING, LEARNED-DYNKIN, DYNKIN, and HIGHEST-PREDICTION. The results show that ADDITIVE-PEGGING and MULTIPLICATIVE-PEGGING consistently perform better than the baselines.", "section": "5 Experiments"}]