[{"figure_path": "voJCpdlw53/tables/tables_6_1.jpg", "caption": "Table 1: Quantitative comparison with other methods. Our UltraPixel achieves state-of-the-art performance on all metrics across different resolutions.", "description": "This table presents a quantitative comparison of UltraPixel's performance against other state-of-the-art methods for high-resolution image generation.  It evaluates across multiple resolutions (1024x1792, 2048x2048, 2160x3840, 4096x2048, 4096x4096), using metrics such as FID, FID-patch, IS, IS-patch, CLIP, and inference latency. The results demonstrate that UltraPixel achieves superior performance in terms of image quality and efficiency.", "section": "4 Experiments"}, {"figure_path": "voJCpdlw53/tables/tables_9_1.jpg", "caption": "Table 2: Ablation study on timesteps of LR guidance extraction.", "description": "This table presents an ablation study on the impact of different timesteps used to extract low-resolution (LR) guidance for high-resolution image generation. It compares the performance (CLIP score and Inception Score) at resolutions 2560x2560 and 4096x4096 using three different LR guidance extraction timesteps: synchronized with high-resolution timesteps (t=tH), a fixed middle timestep (t=0.5), and a timestep near the end (t=0.05).  The results demonstrate that extracting LR guidance near the end of the process (t=0.05) yields superior performance compared to other timesteps.", "section": "4.3 Ablation Study"}, {"figure_path": "voJCpdlw53/tables/tables_13_1.jpg", "caption": "Table A.1: Quantatitive comparison of reconstruction quality and complexity between StableCascade [36] and SDXL [37]", "description": "This table compares the peak signal-to-noise ratio (PSNR), compression ratio, and the number of parameters between StableCascade and SDXL, two different models for image generation.  It demonstrates that StableCascade achieves significantly higher compression with a slightly lower PSNR, indicating a trade-off between efficiency and reconstruction quality. ", "section": "A Latent Space of StableCascade"}, {"figure_path": "voJCpdlw53/tables/tables_32_1.jpg", "caption": "Table 1: Quantitative comparison with other methods. Our UltraPixel achieves state-of-the-art performance on all metrics across different resolutions.", "description": "This table presents a quantitative comparison of UltraPixel's performance against several other state-of-the-art methods for high-resolution image generation.  Metrics include FID (Fréchet Inception Distance), a measure of image quality; IS (Inception Score), another measure of image quality; CLIP score, reflecting the alignment between image content and text prompt; and latency, the time taken to generate images. The comparison is done across multiple resolutions (1024x1792, 2048x2048, 2160x3840, 4096x2048, and 4096x4096), showing UltraPixel's consistent superior performance.", "section": "4 Experiments"}, {"figure_path": "voJCpdlw53/tables/tables_33_1.jpg", "caption": "Table 1: Quantitative comparison with other methods. Our UltraPixel achieves state-of-the-art performance on all metrics across different resolutions.", "description": "This table presents a quantitative comparison of UltraPixel's performance against other state-of-the-art methods for high-resolution image generation.  Metrics include FID (Fréchet Inception Distance), FID-patch (FID calculated on image patches), IS (Inception Score), IS-patch (IS calculated on image patches), CLIP (Contrastive Language–Image Pre-training) score, and inference latency (in seconds).  The comparison is conducted across multiple resolutions (1024x1792, 2048x2048, 2160x3840, 4096x2048, and 4096x4096), demonstrating UltraPixel's superior performance and efficiency.", "section": "4 Experiments"}]