[{"figure_path": "N0xNf9Qqmc/figures/figures_0_1.jpg", "caption": "Figure 1: Unsupervised zero-shot image segmentation. Our DiffCut method exploits features from a diffusion UNet encoder in a graph-based recursive partitioning algorithm. Compared to DiffSeg [1], DiffCut provides finely detailed segmentation maps that more closely align with semantic concepts.", "description": "This figure shows a comparison of unsupervised zero-shot image segmentation results between the proposed DiffCut method and the DiffSeg method.  Three example images are shown with their corresponding segmentation maps generated by each method.  DiffCut demonstrates improved accuracy and detail in its segmentation compared to DiffSeg, more accurately capturing semantic concepts within the images.", "section": "Introduction"}, {"figure_path": "N0xNf9Qqmc/figures/figures_3_1.jpg", "caption": "Figure 2: Overview of DiffCut. 1) DiffCut takes an image as input and extracts the features of the last self-attention block of a diffusion UNet encoder. 2) These features are used to construct an affinity matrix that serves in a recursive normalized cut algorithm, which outputs a segmentation map at the latent spatial resolution. 3) A high-resolution segmentation map is produced via a concept assignment mechanism on the features upsampled at the original image size.", "description": "This figure illustrates the pipeline of the DiffCut model.  First, features from the final self-attention block of a diffusion UNet encoder are extracted from an input image. These features are used to create an affinity matrix, which is then processed by a recursive normalized cut algorithm to generate a low-resolution segmentation map. Finally, a high-resolution segmentation map is generated by upsampling the low-resolution map and using a concept assignment mechanism.", "section": "3 DiffCut"}, {"figure_path": "N0xNf9Qqmc/figures/figures_6_1.jpg", "caption": "Figure 3: ROC curves revealing the semantic coherence of vision encoders.", "description": "This ROC curve shows the area under the curve (AUC) scores for different vision encoders, measuring their ability to correctly identify whether pairs of image patches belong to the same semantic class.  The higher the AUC score, the better the semantic coherence of the encoder's feature representations.  The figure demonstrates that the SSD-1B UNet encoder outperforms other models, indicating its strong semantic coherence for image segmentation.", "section": "Semantic Coherence in Vision Encoders"}, {"figure_path": "N0xNf9Qqmc/figures/figures_6_2.jpg", "caption": "Figure 4: Qualitative results on the semantic coherence of various vision encoders. We select a patch (red marker) associated to the dog in REF. IMAGE. Top row shows the cosine similarity heatmap between the selected patch and all patches produced by vision encoders for REF. IMAGE. Bottom row shows the heatmap between the selected patch in REF. IMAGE and all patches produced by vision encoders for TARGET. IMAGE.", "description": "This figure displays the results of an experiment designed to evaluate the semantic coherence of various vision encoders by comparing the patch-level alignment of features extracted from different models.  The experiment focuses on measuring the cosine similarity between patches representing semantically similar concepts across different images. The visualization shows heatmaps illustrating the similarity scores, providing insights into the capacity of each vision encoder to capture and represent semantic information within image patches. The stronger alignment shown by certain models highlights their ability to group semantically related visual elements.", "section": "4.2 Semantic Coherence in Vision Encoders"}, {"figure_path": "N0xNf9Qqmc/figures/figures_7_1.jpg", "caption": "Figure 5: Sensitivity of DiffCut. As α increases, DiffCut shows competitive results for a broad range of τ values.", "description": "This figure shows the sensitivity analysis of the hyperparameters α (exponent value) and τ (threshold value) on the segmentation performance of the DiffCut method.  It demonstrates that as α increases, the range of τ values resulting in competitive performance widens significantly, improving the robustness of DiffCut across various settings.", "section": "4.4 Model Analysis"}, {"figure_path": "N0xNf9Qqmc/figures/figures_8_1.jpg", "caption": "Figure 6: Effect of τ. As τ corresponds to the maximum Ncut value, a larger threshold loosens the constraint on the partitioning algorithm and allows it to perform more recursive steps to uncover finer objects. It can be interpreted as the level of granularity of detected objects.", "description": "This figure shows the effect of the hyperparameter τ on the segmentation results.  The hyperparameter τ controls the granularity of the segmentation. A smaller value of τ leads to finer-grained segmentations, while a larger value results in coarser segmentations. The figure displays segmentation results for three different values of τ (0.3, 0.5, and 0.7) on two example images.  In both images, increasing τ leads to fewer, larger segments.", "section": "4.3 Ablation study"}, {"figure_path": "N0xNf9Qqmc/figures/figures_18_1.jpg", "caption": "Figure 1: Unsupervised zero-shot image segmentation. Our DiffCut method exploits features from a diffusion UNet encoder in a graph-based recursive partitioning algorithm. Compared to DiffSeg [1], DiffCut provides finely detailed segmentation maps that more closely align with semantic concepts.", "description": "This figure showcases the results of unsupervised zero-shot image segmentation using three different methods: a reference image, DiffSeg, and the authors' proposed method, DiffCut.  DiffCut uses features from a diffusion UNet encoder within a recursive graph partitioning algorithm. The comparison highlights that DiffCut produces more detailed and semantically accurate segmentation maps compared to DiffSeg, aligning more closely with the actual semantic concepts in the image.", "section": "Introduction"}, {"figure_path": "N0xNf9Qqmc/figures/figures_19_1.jpg", "caption": "Figure 7: mIoU according to the noising timestep on Pascal VOC.", "description": "This figure shows the relationship between the amount of Gaussian noise added to the input image (controlled by the 'timestep' parameter) and the resulting mean Intersection over Union (mIoU) score on the Pascal VOC dataset.  The mIoU, a common metric for evaluating semantic segmentation, measures the accuracy of the segmentation produced.  The graph illustrates that there's an optimal level of noise; a small amount of noise leads to the best performance, demonstrating that the best semantic features are obtained with a slightly noisy input image.  Conversely, adding too much noise significantly reduces performance.", "section": "I Image Noising"}, {"figure_path": "N0xNf9Qqmc/figures/figures_19_2.jpg", "caption": "Figure 8: Robustness of DiffCut on Pascal VOC.", "description": "This figure shows the performance of DiffCut on the Pascal VOC dataset with respect to different values of the hyperparameters α and τ.  The x-axis represents the threshold τ, and the y-axis represents the mean Intersection over Union (mIoU).  Different curves represent different values of the hyperparameter α. The figure demonstrates that DiffCut is robust to changes in τ across a wide range of α values, indicating that the method is relatively insensitive to the precise tuning of these hyperparameters.", "section": "4.4 Model Analysis"}, {"figure_path": "N0xNf9Qqmc/figures/figures_20_1.jpg", "caption": "Figure 1: Unsupervised zero-shot image segmentation. Our DiffCut method exploits features from a diffusion UNet encoder in a graph-based recursive partitioning algorithm. Compared to DiffSeg [1], DiffCut provides finely detailed segmentation maps that more closely align with semantic concepts.", "description": "This figure shows a comparison of unsupervised zero-shot image segmentation results between the proposed method, DiffCut, and a baseline method, DiffSeg. DiffCut leverages features from a diffusion UNet encoder in a recursive graph partitioning algorithm, resulting in more accurate and detailed segmentation maps that better align with semantic concepts. The figure visually demonstrates the improved performance of DiffCut by showcasing examples of image segmentation for various scenes.", "section": "Introduction"}, {"figure_path": "N0xNf9Qqmc/figures/figures_20_2.jpg", "caption": "Figure 1: Unsupervised zero-shot image segmentation. Our DiffCut method exploits features from a diffusion UNet encoder in a graph-based recursive partitioning algorithm. Compared to DiffSeg [1], DiffCut provides finely detailed segmentation maps that more closely align with semantic concepts.", "description": "This figure showcases the performance of DiffCut on unsupervised zero-shot image segmentation. It compares the segmentation maps produced by DiffCut and DiffSeg on several sample images. DiffCut, by leveraging features from a diffusion UNet encoder and a recursive normalized cut algorithm, achieves more accurate and detailed segmentation maps that better align with semantic concepts compared to DiffSeg.", "section": "Introduction"}, {"figure_path": "N0xNf9Qqmc/figures/figures_21_1.jpg", "caption": "Figure 1: Unsupervised zero-shot image segmentation. Our DiffCut method exploits features from a diffusion UNet encoder in a graph-based recursive partitioning algorithm. Compared to DiffSeg [1], DiffCut provides finely detailed segmentation maps that more closely align with semantic concepts.", "description": "This figure shows a comparison of unsupervised zero-shot image segmentation results between the proposed DiffCut method and the baseline DiffSeg method.  DiffCut uses features from a diffusion UNet encoder within a recursive normalized cut algorithm to produce segmentation maps. The figure visually demonstrates that DiffCut produces more accurate and detailed segmentations that better align with semantic concepts compared to DiffSeg.", "section": "Introduction"}, {"figure_path": "N0xNf9Qqmc/figures/figures_22_1.jpg", "caption": "Figure 1: Unsupervised zero-shot image segmentation. Our DiffCut method exploits features from a diffusion UNet encoder in a graph-based recursive partitioning algorithm. Compared to DiffSeg [1], DiffCut provides finely detailed segmentation maps that more closely align with semantic concepts.", "description": "This figure showcases the results of unsupervised zero-shot image segmentation using the proposed DiffCut method.  It compares DiffCut's performance against a previous method (DiffSeg). DiffCut utilizes features from a diffusion UNet encoder within a recursive graph partitioning algorithm. The images demonstrate that DiffCut produces finer segmentation maps that more accurately reflect the underlying semantic concepts compared to DiffSeg.", "section": "Introduction"}]