[{"figure_path": "VazkRbCGxt/tables/tables_9_1.jpg", "caption": "Table 1: Quantitative results of my subject in my style generation. We report subject, style, and image-text similarity scores of DB Merge, DB ZipLoRA, and DCO Merge (ours).", "description": "This table presents a quantitative comparison of three different methods for generating images with a specific subject and style.  The methods compared are DreamBooth Merge (DB Merge), DreamBooth ZipLoRA (DB ZipLoRA), and the proposed Direct Consistency Optimization Merge (DCO Merge).  The table shows the average scores for three different metrics: Subject similarity, Style similarity, and Text similarity. Higher scores indicate better performance.  The DCO Merge method shows the highest subject and text similarity scores.", "section": "5.3 My Subject in My Style"}, {"figure_path": "VazkRbCGxt/tables/tables_16_1.jpg", "caption": "Table 2: User evaluation. We asked the users to select better one given two images generated by DCO vs. baselines (DB and DB+p.p.) for each question: 1) subject fidelity, 2) image-text alignment, and 3) image quality. We report the percentage of judgements in favor of DCO over baselines.", "description": "This table presents the results of a user study comparing the performance of the proposed Direct Consistency Optimization (DCO) method against two baseline methods (DreamBooth (DB) and DreamBooth with prior preservation loss (DB+p.p.)) across three evaluation criteria: subject fidelity, prompt fidelity, and image quality.  For each criterion, the table shows the percentage of times users preferred images generated using DCO over those generated by each baseline method.  It indicates the relative strengths of DCO in terms of generating images that accurately reflect the subject, align with prompts, and exhibit high overall quality.", "section": "5.1 Subject Personalization"}, {"figure_path": "VazkRbCGxt/tables/tables_20_1.jpg", "caption": "Table 1: Quantitative results of my subject in my style generation. We report subject, style, and image-text similarity scores of DB Merge, DB ZipLoRA, and DCO Merge (ours).", "description": "This table presents a quantitative comparison of three different methods for generating images of a custom subject in a custom style.  The methods compared are: DreamBooth merge (DB Merge), DreamBooth with ZipLoRA (DB ZipLoRA), and the authors' proposed Direct Consistency Optimization merge (DCO Merge). The table reports the average image similarity scores (using DINOv2) for subject and style, as well as the image-text similarity score (using SigLIP) for each method.  These metrics evaluate how well the generated images match the intended subject, style, and textual description.", "section": "5.3 My Subject in My Style"}]