[{"figure_path": "tQukGCDaNT/tables/tables_7_1.jpg", "caption": "Table 1: Image quality comparison on ImageNet-64×64.", "description": "This table compares the FID scores achieved by various image generation methods on the ImageNet-64x64 dataset.  It shows the number of forward passes required by each method, and contrasts the performance of the proposed method (DMD2) against several state-of-the-art baselines and the original teacher model. The table highlights DMD2's superior performance, surpassing even the teacher model in terms of FID score, particularly with longer training.", "section": "5.1 Class-conditional Image Generation"}, {"figure_path": "tQukGCDaNT/tables/tables_8_1.jpg", "caption": "Table 3: Ablation studies on ImageNet. TTUR stands for two-timescale update rule.", "description": "This table presents the results of ablation studies conducted on the ImageNet dataset to evaluate the impact of different components of the proposed DMD2 method.  It shows the FID scores achieved by models trained with and without specific components such as the regression loss, the two-timescale update rule (TTUR), and the GAN loss. The table helps to understand the individual contributions of each component in improving the overall performance of the model.", "section": "5.3 Ablation Studies"}, {"figure_path": "tQukGCDaNT/tables/tables_8_2.jpg", "caption": "Table 4: Ablation studies with SDXL backbone on 10K prompts from COCO 2014.", "description": "This table presents the ablation study results using the SDXL backbone on 10K prompts from the COCO 2014 dataset. It shows the impact of removing different components of the proposed DMD2 method on the FID, Patch FID, and CLIP scores. By comparing the performance of models with and without specific components (GAN, distribution matching, backward simulation), this table illustrates the contribution of each component to the overall performance of the DMD2 model.", "section": "5.3 Ablation Studies"}, {"figure_path": "tQukGCDaNT/tables/tables_15_1.jpg", "caption": "Table 5: Sample quality comparison on 30K prompts from COCO 2014.", "description": "This table compares the image quality of various text-to-image generation methods on 30K prompts from the COCO 2014 dataset.  The comparison includes original, unaccelerated methods; GAN-based methods; accelerated diffusion methods; and the teacher model.  Metrics include resolution, latency, and FID score.  The table is organized by family of methods for easier comparison and analysis.", "section": "5.2 Text-to-Image Synthesis"}, {"figure_path": "tQukGCDaNT/tables/tables_16_1.jpg", "caption": "Table 6: Image quality and diversity comparison with SDXL backbone.", "description": "This table compares the image quality and diversity of different models, including the proposed DMD2 model and several baseline models, using SDXL as the backbone. The metrics used for comparison are FID (Fréchet Inception Distance), Patch FID, CLIP score, and diversity score. The FID and Patch FID scores measure the visual quality of the generated images, while the CLIP score and diversity score assess how well the generated images align with the text prompts and how diverse they are, respectively.  Lower FID and Patch FID scores indicate better image quality, higher CLIP scores represent better text alignment, and higher diversity scores suggest greater variety in the generated images.", "section": "5.3 Ablation Studies"}]