[{"figure_path": "SvmJJJS0q1/figures/figures_4_1.jpg", "caption": "Figure 1: Setting 1: When contexts C{i}^¬Pij and C{j}^¬Pji are known where Pij is the set of node indices that belong to a path from Xi to Xj, including j, we leverage directed information from Xi to Xj and from Xj to Xi to define a measure of confounding (Defn. 4.4). Setting 2: Causal mechanism changes in Z introduces dependencies on the observed distributions of Xi, Xj. We leverage such dependencies to measure confounding when contexts C{i}^{j} are known (Defn. 4.6). Setting 3: If we know that there is a causal path from Xi to Xj, we leverage dependencies between the pairs (Xi, Xj) and (Z, Xi) to measure confounding. Similarly, if we know that there is a causal path from Xj to Xi, we leverage dependencies between the pairs (Xi, Xj) and (Z, Xj) to measure confounding (Defn. 4.7). Dashed arrows from Z indicate that Z is unobserved.", "description": "This figure illustrates three different settings for measuring confounding between two variables Xi and Xj, potentially influenced by an unobserved confounder Z. Each setting leverages different contextual information and methods to quantify confounding: Setting 1 uses directed information, Setting 2 employs causal mechanism shifts in Z, and Setting 3 incorporates knowledge of the causal path direction between Xi and Xj.", "section": "4 Detecting and Measuring Confounding"}, {"figure_path": "SvmJJJS0q1/figures/figures_8_1.jpg", "caption": "Figure 2: Measure of confounding between a pair of variables Xi, Xj. Our measures output zero when there is no confounding between Xi, Xj and output positive values when Xi, Xj are confounded.", "description": "This figure displays the results of measuring confounding between two variables (Xi, Xj) using three different methods (CNF-1, CNF-2, CNF-3) across various sample sizes.  The results are shown for four different causal graph structures (G1-G4).  G1 and G2 represent unconfounded scenarios (empty graph and Xi→Xj, respectively), while G3 and G4 represent confounded scenarios (Z→Xi, Z→Xj and Z→Xi, Z→Xj, Xi→Xj respectively).  The plots show that the confounding measures correctly output values near zero in the unconfounded cases and positive values in the confounded cases, demonstrating the methods' effectiveness in detecting confounding.", "section": "6 Experiments and Results"}, {"figure_path": "SvmJJJS0q1/figures/figures_8_2.jpg", "caption": "Figure 3: Left: Conditioning on one of Ø, Z1, Z2 will not remove confounding between X₁, Xj in G5. Hence CNF-2 returns positive values. Right: In G6, conditioning on (Ø) does not remove the confounding effect of Z on X₁, Xj. Hence, we observe a positive value for CNF-2(Xi, Xj|0). Conditioning on Z will block the confounding between Xi, Xj. Hence CNF-2 is closer to zero.", "description": "This figure shows the results of measuring conditional confounding using CNF-2 in two different causal structures (G5 and G6). G5 has two confounding variables, Z1 and Z2, while G6 has one (Z). The left panel illustrates that conditioning on either Z1, Z2, or neither, still results in positive conditional confounding values because the confounding relationship remains. Conversely, the right panel depicts that while conditioning on nothing results in positive confounding, conditioning on Z removes it, leading to a CNF-2 value closer to zero.", "section": "Measuring Conditional Confounding"}, {"figure_path": "SvmJJJS0q1/figures/figures_16_1.jpg", "caption": "Figure 4: Two real-world examples where our method can be applied. Here Pro: Production Volume, Exp: Exports, Lab: Total Labor Required, Edu: Education, Wag: Wages, Inv: Investments. We can perform interventions on the above variables and any combination thereof to obtain context-specific data. We can use such data to identify and measure confounding by applying our methods.", "description": "This figure shows two example graphs representing real-world scenarios where the proposed method can be applied to detect and measure confounding.  The graphs illustrate two different sets of variables and their relationships, providing concrete examples of how the methods described in the paper can be used in practical applications.", "section": "B Real-world Examples"}]