[{"figure_path": "AUeTkSymOq/figures/figures_13_1.jpg", "caption": "Figure 1: Experiments with nonconvex quadratic optimization tasks. We plot function suboptimality against elapsed time.", "description": "This figure compares the performance of Freya PAGE, Rennala SGD, Soviet PAGE, and Asynchronous SGD on nonconvex quadratic optimization tasks.  The x-axis represents the time elapsed in seconds, and the y-axis shows the function suboptimality (f(x_t) - f(x*)). The plots demonstrate the convergence behavior of each algorithm over time.  Two plots are shown: one with 1000 workers (n=1000) and another with 10000 workers (n=10000), illustrating how the performance changes with an increase in the number of workers.", "section": "A Experiments"}, {"figure_path": "AUeTkSymOq/figures/figures_13_2.jpg", "caption": "Figure 1: Experiments with nonconvex quadratic optimization tasks. We plot function suboptimality against elapsed time.", "description": "The figure shows the results of experiments comparing the performance of several optimization algorithms on synthetic nonconvex quadratic optimization tasks.  The x-axis represents time in seconds, and the y-axis represents the function suboptimality,  measuring how far the algorithm's current solution is from the optimal solution.  Multiple lines represent different algorithms (Asynchronous SGD, Soviet PAGE, Rennala SGD, Freya PAGE) with different hyperparameter settings (step sizes, batch sizes). The plot visualizes the convergence speed and stability of each algorithm, indicating Freya PAGE's superior performance.", "section": "A Experiments"}, {"figure_path": "AUeTkSymOq/figures/figures_14_1.jpg", "caption": "Figure 2: Experiments with the logistic regression problem on the MNIST dataset.", "description": "The figure shows the results of the logistic regression experiments on the MNIST dataset with different numbers of workers (n = 100 and n = 10000).  The x-axis represents the time in seconds, and the y-axis represents the function suboptimality (f(x<sub>t</sub>) - f(x*)). The plot compares the performance of Freya PAGE against Rennala SGD, Asynchronous SGD, and Soviet PAGE.  It demonstrates that Freya PAGE achieves better convergence and lower function suboptimality, especially as the number of workers increases.  The plots also highlight the noisy behavior of Asynchronous SGD and Rennala SGD.", "section": "A Experiments"}]