[{"figure_path": "AUeTkSymOq/tables/tables_2_1.jpg", "caption": "Table 1: Comparison of the worst-case time complexity guarantees of methods that work with asynchronous computations in the setup from Section 1 (up to smoothness constants). We assume that Ti ∈ [0,∞] is the bound on the times required to calculate one stochastic gradient ∇fi by worker i, T1 < ... < Tn, and m > n log n. Abbr: δ° := f(xº) − f*, m = # of data samples, n = # of workers, ɛ = error tolerance.", "description": "This table compares the worst-case time complexity of various asynchronous optimization methods for solving finite-sum nonconvex optimization problems.  It considers the impact of heterogeneous worker speeds and asynchronous computation, highlighting the limitations of prior methods and demonstrating the optimality of Freya PAGE in large-scale settings (where the number of data samples is significantly larger than the number of workers).", "section": "Contributions"}, {"figure_path": "AUeTkSymOq/tables/tables_4_1.jpg", "caption": "Table 1: Comparison of the worst-case time complexity guarantees of methods that work with asynchronous computations in the setup from Section 1 (up to smoothness constants). We assume that Ti ∈ [0,∞] is the bound on the times required to calculate one stochastic gradient ∇fi by worker i, T₁ < ... < Tn, and m > n log n.", "description": "This table compares the time complexity of various algorithms for solving nonconvex finite-sum optimization problems with asynchronous and heterogeneous workers.  It shows how the worst-case time complexity depends on the number of data samples (m), number of workers (n), error tolerance (ɛ), and the slowest worker's computation time (Tn). The table highlights the optimality of the Freya PAGE algorithm in the large-scale regime (√m ≥ n).", "section": "1 Introduction"}, {"figure_path": "AUeTkSymOq/tables/tables_13_1.jpg", "caption": "Table 1: Comparison of the worst-case time complexity guarantees of methods that work with asynchronous computations in the setup from Section 1 (up to smoothness constants). We assume that Ti ∈ [0,∞] is the bound on the times required to calculate one stochastic gradient ∇fi by worker i, T₁ < ... < Tn, and m > n log n.", "description": "This table compares the time complexity of various algorithms for solving non-convex finite-sum optimization problems with asynchronous and heterogeneous workers.  It shows that Freya PAGE has better time complexity than other methods in the large-scale regime (when the number of data samples is much larger than the number of workers).", "section": "Contributions"}, {"figure_path": "AUeTkSymOq/tables/tables_16_1.jpg", "caption": "Table 1: Comparison of the worst-case time complexity guarantees of methods that work with asynchronous computations in the setup from Section 1 (up to smoothness constants). We assume that Ti ∈ [0,∞] is the bound on the times required to calculate one stochastic gradient ∇fi by worker i, T₁ < ... < Tn, and m > n log n.", "description": "This table compares the worst-case time complexity of several asynchronous methods for solving smooth nonconvex finite-sum optimization problems.  The comparison considers the impact of heterogeneous workers with varying computation times, denoted by Ti. The table highlights the limitations of existing methods and shows how Freya PAGE offers significantly improved time complexity guarantees under weaker assumptions.", "section": "1 Introduction"}, {"figure_path": "AUeTkSymOq/tables/tables_33_1.jpg", "caption": "Table 1: Comparison of the worst-case time complexity guarantees of methods that work with asynchronous computations in the setup from Section 1 (up to smoothness constants). We assume that Ti ∈ [0,∞] is the bound on the times required to calculate one stochastic gradient f; by worker i, T₁ < ... < Tη, and m > n log n.", "description": "This table compares the time complexity of various asynchronous optimization methods.  It highlights Freya PAGE's superior performance, especially in large-scale settings (where the number of data samples is significantly larger than the number of workers). The comparison considers factors like the number of data samples, number of workers, error tolerance, and the time bounds for individual workers' computations.", "section": "1.3 Some previous time complexities"}]