[{"figure_path": "HGnxhHz6ss/figures/figures_1_1.jpg", "caption": "Figure 1: Training the proposed Patch Diffusion Inverse Solver (PaDIS) method. Different sized patches are used in each training iteration. The X and Y position arrays have the same size as the patch and consist of the normalized X and Y coordinates of each pixel of the patch.", "description": "The figure illustrates the training process of the PaDIS method.  It shows how different sized image patches are extracted from the training images.  For each patch, the x and y coordinates of each pixel are normalized and appended to the patch as additional channels.  These patches with positional information are then fed into a UNet to learn the denoising score function.  The noise level is also inputted to the UNet during training.", "section": "3 Methods"}, {"figure_path": "HGnxhHz6ss/figures/figures_2_1.jpg", "caption": "Figure 2: Overview of reconstruction process for the proposed Patch Diffusion Inverse Solver (PaDIS) method. Starting at t = T, at each iteration we choose a random partition of the zero padded image and use the neural network trained on patches to get the score function of the entire image. Due to the shifting patch locations, the output image has no boundary artifacts.", "description": "This figure illustrates the reconstruction process of the PaDIS method.  It begins with pure noise at time t=T.  At each step, a random partition of the zero-padded image is selected, and a neural network (trained on image patches) computes the score function for the entire image. This process iteratively refines the image, removing noise until a clean reconstruction is obtained at t=1. The shifting patch locations during each iteration help to avoid boundary artifacts in the final image.", "section": "3 Methods"}, {"figure_path": "HGnxhHz6ss/figures/figures_4_1.jpg", "caption": "Figure 3: Schematic for zero padding and partitioning image into patches", "description": "The figure illustrates the process of preparing an image for patch-based processing. First, the image is zero-padded on all sides by M pixels. Then, this padded image is partitioned into (k+1)² patches, each of size P x P.  The patches are arranged in a grid, where k = [N/P] and N is the original image size.  The central N x N area of the padded image corresponds to the original image.  This method provides a way to obtain overlapping patches without explicitly using overlapping patches, which would lead to boundary artifacts.", "section": "Methods"}, {"figure_path": "HGnxhHz6ss/figures/figures_6_1.jpg", "caption": "Figure A.1: Additional results of 20 view CT reconstruction for 7 different test slices.", "description": "This figure displays additional results of 20-view CT reconstruction for seven different test slices.  It showcases the performance of several methods, including Filtered Back Projection (FBP), ADMM-TV, a whole image diffusion model, and the proposed PaDIS method. Each column shows the reconstruction results for a specific slice, allowing for a visual comparison of the different methods. The ground truth is also included for reference.", "section": "A.1 Additional inverse problem solving experiments"}, {"figure_path": "HGnxhHz6ss/figures/figures_8_1.jpg", "caption": "Figure 4: Unconditional generation of CT images. Top row: generation with a network trained on whole image; middle row: patch-only version of [16]; bottom row: proposed PaDIS method.", "description": "This figure demonstrates the unconditional image generation capabilities of three different methods: a whole-image diffusion model, a patch-based method from a previous work ([16]), and the proposed PaDIS method.  The top row shows the results from training and generating with the entire image. The middle row shows the result of using only patches to train a model and generate individual patches, then assembling them without considering global image consistency. The bottom row shows the results of the proposed PaDIS method which addresses the shortcomings of the previous patch-based approach by incorporating positional information and cleverly combining patches to generate complete, artifact-free images.", "section": "Experiments"}, {"figure_path": "HGnxhHz6ss/figures/figures_8_2.jpg", "caption": "Figure A.3: Additional results of deblurring with Gaussian noise (σ = 0.01).", "description": "This figure displays additional examples of image deblurring results using four different methods: Measurement (blurred image), ADMM-TV, Whole image (using a whole-image diffusion model), PaDIS (the proposed patch-based diffusion model), and Ground truth (original, unblurred image).  Each row shows the results for a different image.  The figure visually demonstrates the performance comparison of different methods in deblurring images corrupted with Gaussian noise.", "section": "A.3 Additional results of deblurring with Gaussian noise (σ = 0.01)."}, {"figure_path": "HGnxhHz6ss/figures/figures_9_1.jpg", "caption": "Figure A.3: Additional results of deblurring with Gaussian noise (σ = 0.01).", "description": "This figure displays additional examples of image deblurring results, comparing the performance of ADMM-TV, the whole-image diffusion model, and the proposed PaDIS method. Each row shows a different image, with the \"Measurement\" column showing the blurry image, followed by the results from ADMM-TV, whole image diffusion, PaDIS, and finally the \"Ground truth\" column showing the original, unblurred image.  The results demonstrate the visual quality and effectiveness of the PaDIS method in reducing noise and restoring the sharpness and details of the images.", "section": "A.3 Additional results of deblurring"}, {"figure_path": "HGnxhHz6ss/figures/figures_9_2.jpg", "caption": "Figure 5: Results of CT reconstruction. 60 views are used for the top two rows, 20 views are used for the bottom two rows. To better show contrast between organs, we use modified Hounsfield units (HU) in the top figure, while we use the same scale the images were trained on in the bottom figure.", "description": "This figure compares the results of CT reconstruction using different methods: Filtered Back Projection (FBP), ADMM-TV, a whole image diffusion model, and the proposed PaDIS method.  Two different scenarios are shown: one with 60 projection views and another with 20.  The top row uses a modified Hounsfield unit scale to better visualize organ contrast, while the bottom row uses the same scale as the training data.  The results demonstrate the improved performance of PaDIS, especially in the low-view scenario, compared to traditional and other diffusion methods.", "section": "Experiments"}, {"figure_path": "HGnxhHz6ss/figures/figures_14_1.jpg", "caption": "Figure A.1: Additional results of 20 view CT reconstruction for 7 different test slices.", "description": "This figure shows additional results of 20-view CT reconstruction for seven different test slices.  It expands on the results presented in the main body of the paper, providing visual examples to supplement the quantitative data.", "section": "A.1 Additional inverse problem solving experiments"}, {"figure_path": "HGnxhHz6ss/figures/figures_15_1.jpg", "caption": "Figure A.1: Additional results of 20 view CT reconstruction for 7 different test slices.", "description": "This figure shows additional results of 20-view CT reconstruction for 7 different test slices.  It compares the results of five methods: FBP, ADMM-TV, the whole image diffusion model, the proposed PaDIS method, and the ground truth. The images are arranged in columns, with each column representing one of the methods. Each row presents a slice from a different test image.  The figure illustrates the performance of the proposed PaDIS method in reconstructing CT images from sparse data, and shows the qualitative difference between the proposed method and other traditional or deep learning based methods.", "section": "A.1 Additional inverse problem solving experiments"}, {"figure_path": "HGnxhHz6ss/figures/figures_16_1.jpg", "caption": "Figure A.3: Additional results of deblurring with Gaussian noise (σ = 0.01).", "description": "This figure shows additional visual results of the deblurring experiments with Gaussian noise (σ = 0.01).  It presents a comparison between the results obtained using ADMM-TV, the whole image diffusion model, the PaDIS method, and the ground truth images for several different faces. The results show how well each method is able to recover the sharp details and clean textures of the images after they've been blurred and corrupted by noise.", "section": "A.3 Additional results of deblurring with Gaussian noise (σ = 0.01)"}, {"figure_path": "HGnxhHz6ss/figures/figures_17_1.jpg", "caption": "Figure A.3: Additional results of deblurring with Gaussian noise (σ = 0.01).", "description": "This figure shows additional examples of the deblurring results. The images in each row show the results for a particular test image. The columns show (from left to right): the blurry input image, the deblurred images generated using ADMM-TV, the whole image diffusion model, PaDIS, and the ground truth image.", "section": "A.3 Additional results of deblurring with Gaussian noise (σ = 0.01)"}, {"figure_path": "HGnxhHz6ss/figures/figures_20_1.jpg", "caption": "Figure A.5: Results of PaDIS for 20 view CT reconstruction with different sized patches.", "description": "This figure demonstrates the effect of using different patch sizes (P) during the reconstruction process using the PaDIS method for 20-view CT reconstruction.  It shows that the quality of the reconstruction varies depending on the size of the patches used.  Small patch sizes lead to artifacts such as blurry features or the appearance of false features, while larger patches tend to produce better results. The figure visually compares the results obtained using patch sizes of 8, 16, 32, 56, and 96, alongside the result from using the whole image as a single patch (256). The ground truth image is also provided for comparison.", "section": "A.3 Ablation study images"}, {"figure_path": "HGnxhHz6ss/figures/figures_20_2.jpg", "caption": "Figure A.6: Results for 20 view CT reconstruction with different dataset sizes. Top row shows recon performed by PaDIS; bottom row shows recon performed with the whole-image model.", "description": "This figure compares the results of 20-view CT reconstruction using the proposed PaDIS method and a traditional whole-image diffusion model. The images in the top row show the reconstructions obtained with the PaDIS method, while those in the bottom row show reconstructions using the whole-image method.  Each column represents a reconstruction from a dataset of different sizes. The ground truth is shown in the far-right column. The figure demonstrates that, despite decreasing dataset size, the PaDIS method is able to maintain reasonably consistent image quality. The whole-image diffusion model's image quality is considerably worse, especially in the reconstructions obtained from smaller training datasets.", "section": "A.3 Ablation study images"}, {"figure_path": "HGnxhHz6ss/figures/figures_21_1.jpg", "caption": "Figure A.7: Results of PaDIS for 20 view CT reconstruction for different positional encoding methods.", "description": "This figure demonstrates the importance of adding positional encoding information into the patch-based network. When positional information is not included, the network simply learns a mixture of all patches, resulting in a very blurry image with many artifacts.  Even when a better initialization of the image is provided, the same blurriness remains. The figure shows the results for two different test images, comparing the performance with positional encoding versus without it, along with the filtered back-projection (FBP) baseline and the ground truth images.", "section": "A.3 Ablation study images"}, {"figure_path": "HGnxhHz6ss/figures/figures_22_1.jpg", "caption": "Figure A.8: Results of PaDIS for 20 view CT reconstruction using different sampling and inverse problem solving algorithms. Top row is with PaDIS and bottom row is with the whole-image model.", "description": "This figure compares the results of using the proposed Patch Diffusion Inverse Solver (PaDIS) method with different sampling and inverse problem-solving algorithms against a whole-image diffusion model for 20-view CT reconstruction.  The top row shows results using PaDIS, while the bottom row uses the whole-image model. The different algorithms used are: Predictor-corrector, Langevin, DDNM, and DPS. The ground truth image is also provided for comparison. The figure demonstrates the flexibility of PaDIS by showing comparable results across different sampling methods.", "section": "A.4 Experiment parameters"}, {"figure_path": "HGnxhHz6ss/figures/figures_26_1.jpg", "caption": "Figure A.1: Additional results of 20 view CT reconstruction for 7 different test slices.", "description": "This figure shows additional results for 20-view CT reconstruction on 7 different test slices.  It supplements the main results presented in Table 1 of the paper by providing visual examples of the reconstruction quality achieved using the proposed PaDIS method, compared against other methods (FBP, ADMM-TV, Whole image).  Each row represents a different slice from the CT scan data, and each column represents a different reconstruction method. This allows a visual comparison of the effectiveness of each method in reconstructing different regions of the CT image.", "section": "A.1 Additional inverse problem solving experiments"}, {"figure_path": "HGnxhHz6ss/figures/figures_27_1.jpg", "caption": "Figure A.1: Additional results of 20 view CT reconstruction for 7 different test slices.", "description": "This figure shows additional results of 20-view CT reconstruction for 7 different test slices.  It expands on the main results presented in Table 1 of the paper, providing visual examples to complement the quantitative data. Each column represents a different reconstruction method: FBP (Filtered Back Projection), ADMM-TV (Alternating Direction Method of Multipliers with Total Variation regularization), Whole image, PaDIS (the proposed Patch Diffusion Inverse Solver), and Ground truth.  The rows represent different slices from the test dataset.  The image quality and detail are compared across different reconstruction methods for these seven slices.", "section": "A.1 Additional inverse problem solving experiments"}, {"figure_path": "HGnxhHz6ss/figures/figures_27_2.jpg", "caption": "Figure A.1: Additional results of 20 view CT reconstruction for 7 different test slices.", "description": "This figure shows additional results for 20-view CT reconstruction on seven different test slices.  It visually compares the results from Filtered Back Projection (FBP), ADMM-TV, the whole image diffusion model, the proposed PaDIS method, and the ground truth.  The purpose is to show the performance of PaDIS in more detail and across several different slices, beyond the summary statistics presented in Table 1 of the main paper.", "section": "A.1 Additional inverse problem solving experiments"}, {"figure_path": "HGnxhHz6ss/figures/figures_28_1.jpg", "caption": "Figure A.12: Comparison between PSNR of deblurring between whole-image model and proposed method for each image in the test dataset.", "description": "This figure shows a comparison of the Peak Signal-to-Noise Ratio (PSNR) for deblurring results obtained using two methods: a whole-image diffusion model and the proposed patch-based diffusion model.  The x-axis represents the PSNR values obtained from the whole-image method for each test image, and the y-axis represents the corresponding PSNR values obtained using the proposed method. A red line representing y=x is added as a visual aid to quickly compare performance between both models on a per image basis.", "section": "A.3 Ablation study images"}, {"figure_path": "HGnxhHz6ss/figures/figures_28_2.jpg", "caption": "Figure A.13: Comparison between PSNR of superresolution between whole-image model and proposed method for each image in the test dataset.", "description": "This figure compares the Peak Signal-to-Noise Ratio (PSNR) values for super-resolution between two models: a whole-image model and a proposed patch-based model.  The x-axis represents the PSNR of the whole-image model, and the y-axis represents the PSNR of the proposed method. Each point represents the PSNR for a single image in the test dataset. The red line shows the y=x line, indicating where the PSNR values for both models are equal. Points above the line indicate that the proposed model outperforms the whole-image model for that particular image, while points below indicate the opposite.", "section": "A.3 Ablation study images"}]