[{"figure_path": "HGnxhHz6ss/tables/tables_5_1.jpg", "caption": "Table 1: Comparison of quantitative results on three different inverse problems. Results are averages across all images in the test dataset. Best results are in bold.", "description": "This table presents a quantitative comparison of different methods for solving three inverse problems: CT reconstruction with 8 and 20 views, image deblurring, and image super-resolution.  The methods compared include baselines (FBP, ADMM-TV, PnP-ADMM, PnP-RED), a whole-image diffusion model, and the proposed PaDIS method along with several sampling algorithms.  The results are presented as average PSNR and SSIM values across all test images.  The bold values indicate the best performing method for each inverse problem.", "section": "4 Experiments"}, {"figure_path": "HGnxhHz6ss/tables/tables_7_1.jpg", "caption": "Table 1: Comparison of quantitative results on three different inverse problems. Results are averages across all images in the test dataset. Best results are in bold.", "description": "This table compares the performance of different methods on three inverse problems: CT reconstruction with 20 and 8 views, image deblurring, and image super-resolution.  The methods compared include baselines (FBP, ADMM-TV, PnP-ADMM, PnP-RED), a whole-image diffusion model, several sampling algorithms used with the whole-image diffusion model (Langevin dynamics, predictor-corrector, VE-DDNM),  other patch-based methods (Patch Averaging, Patch Stitching), and the proposed PaDIS method.  The evaluation metrics are PSNR and SSIM, averaged across all test images.  Bold values indicate the best performing method for each task.", "section": "4 Experiments"}, {"figure_path": "HGnxhHz6ss/tables/tables_7_2.jpg", "caption": "Table 2: Extra inverse problem experiments. Results are averages across all images in the test dataset. Best results are in bold.", "description": "This table presents the quantitative results of additional experiments conducted on three different inverse problems: 60 view CT reconstruction, fan beam reconstruction using 180 views, and deblurring with a 17x17 uniform kernel.  Each problem's results are shown as PSNR and SSIM values, averaged across all images in the test dataset, comparing the proposed PaDIS method with baseline results, ADMM-TV, and a whole image diffusion model. The best-performing method for each metric is highlighted in bold.", "section": "4 Experiments"}, {"figure_path": "HGnxhHz6ss/tables/tables_18_1.jpg", "caption": "Table 4: Effect of patch size P on CT reconstruction", "description": "This table shows the effect of different patch sizes (P) used during reconstruction on the performance of the proposed PaDIS method for the 20-view CT reconstruction task.  The results (PSNR and SSIM) demonstrate that choosing an appropriate patch size is crucial for optimal performance.  Smaller patch sizes may struggle to capture global image information while very large patch sizes may require more memory and training data, resulting in suboptimal performance. The best performance is achieved with a patch size of 56.", "section": "3.1 Patch-wise training"}, {"figure_path": "HGnxhHz6ss/tables/tables_18_2.jpg", "caption": "Table 5: Dataset size effect on CT reconstruction", "description": "This table shows the impact of varying training dataset sizes on the performance of both the proposed patch-based method and the traditional whole-image diffusion model in 20-view CT reconstruction.  The results demonstrate that while both approaches show a decrease in performance (measured by PSNR and SSIM) with reduced dataset size, the whole-image model's performance degrades more significantly than the proposed patch-based method, highlighting the latter's improved data efficiency.", "section": "4 Experiments"}, {"figure_path": "HGnxhHz6ss/tables/tables_19_1.jpg", "caption": "Table 6: Positional encoding effect for CT reconstruction", "description": "This table presents the results of an ablation study on the effect of positional encoding in the proposed PaDIS method for CT reconstruction. Three experimental settings are compared: (1) no positional encoding; (2) no positional encoding but with initialization; and (3) with positional encoding.  The results show a significant improvement in PSNR and SSIM when positional encoding is included, highlighting its importance for effective image reconstruction in this context.", "section": "A.2 Ablation studies"}, {"figure_path": "HGnxhHz6ss/tables/tables_19_2.jpg", "caption": "Table 7: Dataset size effect on CT reconstruction", "description": "This table compares the performance of different sampling methods (Langevin dynamics, predictor-corrector, VE-DDNM, VE-DPS) for CT reconstruction using both patch-based and whole-image diffusion models.  The results show the PSNR and SSIM metrics for each method and model type.  It highlights the impact of dataset size on reconstruction accuracy for each approach.", "section": "Experiments"}, {"figure_path": "HGnxhHz6ss/tables/tables_23_1.jpg", "caption": "Table 1: Comparison of quantitative results on three different inverse problems. Results are averages across all images in the test dataset. Best results are in bold.", "description": "This table compares the performance of different methods on three inverse problems: CT reconstruction (with 8 and 20 views), image deblurring, and image super-resolution.  The methods compared include baselines (FBP, ADMM-TV, PnP-ADMM, PnP-RED), a whole-image diffusion model, and the proposed PaDIS method along with several sampling algorithms. The table reports the Peak Signal-to-Noise Ratio (PSNR) and Structural Similarity Index (SSIM) metrics, which are higher is better.  The best performing method for each task is shown in bold.", "section": "4 Experiments"}, {"figure_path": "HGnxhHz6ss/tables/tables_23_2.jpg", "caption": "Table 1: Comparison of quantitative results on three different inverse problems. Results are averages across all images in the test dataset. Best results are in bold.", "description": "This table presents a comparison of Peak Signal-to-Noise Ratio (PSNR) and Structural Similarity Index (SSIM) for three different inverse problems (CT reconstruction with 8 and 20 views, image deblurring, and image super-resolution).  The results are compared across several methods: a baseline (no reconstruction), Total Variation with Alternating Direction Method of Multipliers (ADMM-TV), Plug-and-Play with ADMM (PnP-ADMM), Plug-and-Play with Regularization by Denoising (PnP-RED), a whole-image diffusion model, and several sampling methods (Langevin dynamics, predictor-corrector, Variation Exploding DDIM (VE-DDIM)) paired with the proposed PaDIS method.  The best performance for each metric and problem is highlighted in bold, demonstrating the superior performance of PaDIS especially when compared to the whole-image diffusion model.", "section": "4 Experiments"}, {"figure_path": "HGnxhHz6ss/tables/tables_24_1.jpg", "caption": "Table 1: Comparison of quantitative results on three different inverse problems. Results are averages across all images in the test dataset. Best results are in bold.", "description": "This table compares the performance of different methods for solving three inverse problems: CT reconstruction (with 8 and 20 views), image deblurring, and image super-resolution. The methods compared include baselines (FBP, ADMM-TV), plug-and-play methods (PnP-ADMM, PnP-RED), a whole-image diffusion model, and other sampling methods applied to the whole image diffusion model (Langevin dynamics, predictor-corrector, VE-DDNM).  The proposed PaDIS method is also included.  The results are presented in terms of average PSNR and SSIM across the test images.  Bold values highlight the best performing methods for each problem.", "section": "4 Experiments"}, {"figure_path": "HGnxhHz6ss/tables/tables_24_2.jpg", "caption": "Table 1: Comparison of quantitative results on three different inverse problems. Results are averages across all images in the test dataset. Best results are in bold.", "description": "This table presents a comparison of Peak Signal-to-Noise Ratio (PSNR) and Structural Similarity Index (SSIM) for three different inverse problems (CT reconstruction with 20 and 8 views, image deblurring, and image super-resolution).  It compares the performance of several methods: a baseline (no reconstruction), ADMM-TV, PnP-ADMM, PnP-RED, a whole image diffusion model, Langevin dynamics, predictor-corrector, VE-DDNM, patch averaging, patch stitching, and the proposed PaDIS method.  The best results for each metric in each category are highlighted in bold.  The results demonstrate the proposed PaDIS model's performance compared to other methods across various inverse problems.", "section": "4 Experiments"}]