[{"figure_path": "pCJ0l1JVUX/tables/tables_7_1.jpg", "caption": "Table 1: Comparison with SOTAs on FreiHAND dataset [111]. *Stacked Structure; †used Test-Time Augmentation (TTA). Best scores highlighted Green, while second best are highlighted Light Green PA-MPJPE and PA-MPVPE are measured in mm. -: Info not reported by model.", "description": "This table presents a quantitative comparison of the proposed Hamba model with other state-of-the-art 3D hand reconstruction models on the FreiHAND dataset.  The table includes metrics such as PA-MPJPE (Procrustes Aligned Mean Per Joint Position Error), PA-MPVPE (Procrustes Aligned Mean Per Vertex Position Error), F@5mm (F-score at 5mm threshold), and F@15mm (F-score at 15mm threshold).  The results show Hamba's superior performance compared to existing methods, with and without test-time augmentation (TTA).", "section": "4.1 Main Results"}, {"figure_path": "pCJ0l1JVUX/tables/tables_8_1.jpg", "caption": "Table 1: Comparison with SOTAs on FreiHAND dataset [111]. *Stacked Structure; †used Test-Time Augmentation (TTA). Best scores highlighted Green, while second best are highlighted Light Green PA-MPJPE and PA-MPVPE are measured in mm. -: Info not reported by model.", "description": "This table presents a quantitative comparison of the proposed Hamba model with state-of-the-art (SOTA) 3D hand reconstruction models on the FreiHAND benchmark dataset.  The table includes various performance metrics, such as PA-MPJPE (Procrustes Aligned Mean Per Joint Position Error), PA-MPVPE (Procrustes Aligned Mean Per Vertex Position Error), F@5mm (F-score at 5mm threshold), F@15mm (F-score at 15mm threshold), AUCj (Area Under the Curve for joint accuracy), and AUCv (Area Under the Curve for mesh accuracy). The results are presented for both the original model and the model using test-time augmentation (TTA), highlighting the best and second best results.", "section": "4.1 Main Results"}, {"figure_path": "pCJ0l1JVUX/tables/tables_8_2.jpg", "caption": "Table 3: Comparison with SOTAs on HO3Dv3 [30] benchmark. We only list SOTAs that reported on HO3Dv3.", "description": "This table presents a quantitative comparison of the proposed Hamba model with state-of-the-art 3D hand reconstruction models on the HO3Dv3 benchmark.  The table includes the method name, venue of publication, PA-MPJPE, PA-MPVPE, F@5mm, F@15mm, AUCj, and AUCv metrics.  Lower values for PA-MPJPE and PA-MPVPE, and higher values for F@5mm, F@15mm, AUCj, and AUCv indicate better performance.", "section": "4.1 Main Results"}, {"figure_path": "pCJ0l1JVUX/tables/tables_8_3.jpg", "caption": "Table 1: Comparison with SOTAs on FreiHAND dataset [111]. *Stacked Structure; †used Test-Time Augmentation (TTA). Best scores highlighted Green, while second best are highlighted Light Green PA-MPJPE and PA-MPVPE are measured in mm. -: Info not reported by model.", "description": "This table presents a quantitative comparison of the proposed Hamba model with state-of-the-art (SOTA) 3D hand reconstruction models on the FreiHAND benchmark dataset.  It shows the performance of various methods in terms of PA-MPJPE (Procrustes Aligned Mean Per Joint Position Error), PA-MPVPE (Procrustes Aligned Mean Per Vertex Position Error), F@5mm (F-score at 5mm threshold), and F@15mm (F-score at 15mm threshold).  The table highlights the best and second-best results for each metric, indicating Hamba's superior performance compared to other SOTA methods.", "section": "4.1 Main Results"}, {"figure_path": "pCJ0l1JVUX/tables/tables_9_1.jpg", "caption": "Table 1: Comparison with SOTAs on FreiHAND dataset [111]. *Stacked Structure; †used Test-Time Augmentation (TTA). Best scores highlighted Green, while second best are highlighted Light Green PA-MPJPE and PA-MPVPE are measured in mm. -: Info not reported by model.", "description": "This table compares the performance of the proposed Hamba model with other state-of-the-art (SOTA) methods on the FreiHAND dataset.  It provides quantitative results in terms of PA-MPJPE (Procrustes Aligned Mean Per Joint Position Error), PA-MPVPE (Procrustes Aligned Mean Per Vertex Position Error), F@5mm (F-score at 5mm threshold), and F@15mm (F-score at 15mm threshold).  The table notes whether methods used stacked structures or test-time augmentation, and highlights the top two performing methods for each metric.", "section": "4.1 Main Results"}, {"figure_path": "pCJ0l1JVUX/tables/tables_23_1.jpg", "caption": "Table 1: Comparison with SOTAs on FreiHAND dataset [111]. *Stacked Structure; †used Test-Time Augmentation (TTA). Best scores highlighted Green, while second best are highlighted Light Green PA-MPJPE and PA-MPVPE are measured in mm. -: Info not reported by model.", "description": "This table compares the proposed Hamba model with other state-of-the-art 3D hand reconstruction models on the FreiHAND dataset.  The metrics used are PA-MPJPE, PA-MPVPE, F@5mm, and F@15mm, measuring the error in millimeters.  The table highlights the best and second-best results, and notes which methods used stacked structures or test-time augmentation (TTA).", "section": "4.1 Main Results"}, {"figure_path": "pCJ0l1JVUX/tables/tables_23_2.jpg", "caption": "Table 1: Comparison with SOTAs on FreiHAND dataset [111]. *Stacked Structure; †used Test-Time Augmentation (TTA). Best scores highlighted Green, while second best are highlighted Light Green PA-MPJPE and PA-MPVPE are measured in mm. -: Info not reported by model.", "description": "This table compares the performance of the proposed method, Hamba, against other state-of-the-art (SOTA) methods on the FreiHAND dataset.  The evaluation metrics used are PA-MPJPE (Procrustes Aligned Mean Per Joint Position Error), PA-MPVPE (Procrustes Aligned Mean Per Vertex Position Error), F@5mm (F-score at 5mm threshold), and F@15mm (F-score at 15mm threshold). The table highlights the superior performance of Hamba, particularly when considering the smaller number of tokens used (indicated by *).  It also notes when other methods used test-time augmentation (TTA), a technique that can improve results but isn't always used in testing.", "section": "4.1 Main Results"}, {"figure_path": "pCJ0l1JVUX/tables/tables_23_3.jpg", "caption": "Table 1: Comparison with SOTAs on FreiHAND dataset [111]. *Stacked Structure; †used Test-Time Augmentation (TTA). Best scores highlighted Green, while second best are highlighted Light Green PA-MPJPE and PA-MPVPE are measured in mm. -: Info not reported by model.", "description": "This table presents a quantitative comparison of the proposed Hamba model with state-of-the-art (SOTA) 3D hand reconstruction models on the FreiHAND dataset.  The metrics used for comparison include PA-MPJPE (Procrustes Aligned Mean Per Joint Position Error), PA-MPVPE (Procrustes Aligned Mean Per Vertex Position Error), F@5mm (F-score at 5mm threshold), and F@15mm (F-score at 15mm threshold).  The table also notes whether models used stacked structures or test-time augmentation (TTA) and highlights the best and second-best performing models.", "section": "4.1 Main Results"}]