[{"figure_path": "v1BIm8wESL/figures/figures_2_1.jpg", "caption": "Figure 1: Comparison with the existing method. Contrary to the earlier retargeting-correction approach [32], which suffer from internal contradictions leading to interpenetration, jitter, and contact mismatches, our pipeline leverages the DMI field to accurately model complex geometric interactions.", "description": "This figure compares the proposed MeshRet method with existing methods for skinned motion retargeting. Existing methods typically involve a two-stage process: first, skeleton-aware retargeting, then geometry correction.  However, these stages often conflict, resulting in issues such as mesh interpenetration, jittery motion, and inaccurate contact representation. In contrast, MeshRet directly models dense geometric interactions using a Dense Mesh Interaction (DMI) field, eliminating these conflicts and improving the accuracy of retargeted motion.", "section": "1 Introduction"}, {"figure_path": "v1BIm8wESL/figures/figures_3_1.jpg", "caption": "Figure 2: Overview of the proposed MeshRet. The pipeline begins with the extraction of the DMI field using sensor forward kinematics, denoted as Fk, and pairwise interaction feature selection, represented by Fe. This DMI field, in conjunction with geometric features derived from Fg, is fed into an encoder-decoder network. The network predicts the target motion sequence, which is aligned with the target character's geometry and the original DMI field.", "description": "This figure illustrates the MeshRet framework, which processes source motion and geometry to generate target motion.  It highlights the key stages: extracting the Dense Mesh Interaction (DMI) field from source motion data using sensor kinematics and feature selection, encoding both the DMI and geometric features, decoding to obtain target motion, and ensuring consistency between the source and target DMI fields. This approach directly models geometric interactions, unlike previous methods.", "section": "3 Method"}, {"figure_path": "v1BIm8wESL/figures/figures_4_1.jpg", "caption": "Figure 3: Left: Illustration of the method to derive a sensor feature s from the semantic coordinate (b, l, ϕ) across different characters. The red line represents the projected ray. The feature s encompasses the sensor's location and its tangent space matrix. Right: The DMI field effectively captures both contact and non-contact interactions. Red lines represent dt,i,j in the DMI field. In the second example, the body sensors (yellow points) are located in the tangent plane of the hand sensors (blue points), signifying a contact interaction.", "description": "This figure illustrates two key aspects of the MeshRet framework. The left panel demonstrates how sensor features are derived from semantic coordinates, combining bone index, ray origin, and ray direction to create a representation that encapsulates both location and tangent space information. The right panel visually depicts the dense mesh interaction (DMI) field, showing how it captures both contact and non-contact interactions between different body parts.  The use of yellow and blue points to illustrate contact and non-contact is clearly shown.", "section": "3.3 Dense mesh interaction field"}, {"figure_path": "v1BIm8wESL/figures/figures_7_1.jpg", "caption": "Figure 4: Qualitative comparison with baseline methods. Our method ensures precise contact preservation and minimal geometric interpenetration.", "description": "This figure compares the results of the proposed MeshRet method with several baseline methods for skinned motion retargeting. It visually demonstrates the superior performance of MeshRet in terms of maintaining precise contact between body parts and minimizing geometric artifacts such as mesh interpenetration and jittering. The figure showcases several motion sequences with different characters and highlights areas where the baseline methods fail to accurately preserve contact and introduce undesirable artifacts, while MeshRet successfully handles these challenges.", "section": "4 Experiments"}, {"figure_path": "v1BIm8wESL/figures/figures_8_1.jpg", "caption": "Figure 1: Comparison with the existing method. Contrary to the earlier retargeting-correction approach [32], which suffer from internal contradictions leading to interpenetration, jitter, and contact mismatches, our pipeline leverages the DMI field to accurately model complex geometric interactions.", "description": "This figure compares the proposed MeshRet method with existing methods for skinned motion retargeting. Existing methods often separate skeleton-aware retargeting from geometry correction, leading to issues such as jittery motion, mesh interpenetration, and contact mismatches.  MeshRet, in contrast, directly models dense geometric interactions using a DMI field, resulting in more accurate and natural-looking animations.", "section": "1 Introduction"}, {"figure_path": "v1BIm8wESL/figures/figures_12_1.jpg", "caption": "Figure 6: Left: Characters of varying body types in the Mixamo dataset do not always maintain reasonable hand contact during clapping actions. Right: In our ScanRet dataset, characters of diverse body types consistently maintain appropriate hand contact while performing the same clapping actions.", "description": "This figure compares the Mixamo and ScanRet datasets. The left panel shows that the Mixamo dataset does not always show characters maintaining correct hand contact during clapping actions, even when the characters have varying body types. The right panel shows that the ScanRet dataset shows characters of diverse body types consistently maintaining correct hand contact during clapping actions. This highlights one of the key differences between the two datasets and underscores the improved quality of the ScanRet dataset for motion retargeting.", "section": "4.1 Settings"}, {"figure_path": "v1BIm8wESL/figures/figures_14_1.jpg", "caption": "Figure 1: Comparison with the existing method. Contrary to the earlier retargeting-correction approach [32], which suffer from internal contradictions leading to interpenetration, jitter, and contact mismatches, our pipeline leverages the DMI field to accurately model complex geometric interactions.", "description": "The figure compares the proposed MeshRet method with existing methods for skinned motion retargeting.  Existing methods often separate skeletal retargeting and geometry correction, leading to problems like jittering, mesh interpenetration, and inaccurate contact. MeshRet, on the other hand, directly models dense geometric interactions using a DMI field, resulting in more natural and accurate retargeting.", "section": "1 Introduction"}, {"figure_path": "v1BIm8wESL/figures/figures_15_1.jpg", "caption": "Figure 1: Comparison with the existing method. Contrary to the earlier retargeting-correction approach [32], which suffer from internal contradictions leading to interpenetration, jitter, and contact mismatches, our pipeline leverages the DMI field to accurately model complex geometric interactions.", "description": "This figure compares the proposed MeshRet method with existing methods for skinned motion retargeting.  Existing methods often use a two-stage process (skeleton retargeting followed by geometry correction) that leads to problems like jittering, mesh interpenetration, and inaccurate contact representation. MeshRet, in contrast, directly models dense geometric interactions using a DMI (Dense Mesh Interaction) field, leading to more accurate and natural results.", "section": "Introduction"}, {"figure_path": "v1BIm8wESL/figures/figures_15_2.jpg", "caption": "Figure 4: Qualitative comparison with baseline methods. Our method ensures precise contact preservation and minimal geometric interpenetration.", "description": "This figure compares the results of the proposed MeshRet method with several baseline methods for skinned motion retargeting. The comparison is qualitative and shows the effectiveness of MeshRet in terms of preserving precise contact and minimizing geometric interpenetration.  The images display several different characters performing the same action;  MeshRet produces more realistic results with proper contact and avoidance of mesh artifacts compared to the other methods.", "section": "4 Experiments"}, {"figure_path": "v1BIm8wESL/figures/figures_17_1.jpg", "caption": "Figure 10: Qualitative results with different proximal sensor pair ratios.", "description": "This figure shows a qualitative comparison of the results obtained using different ratios of proximal sensor pairs. The top row displays results for a human-like character, while the bottom row shows results for a cartoon character. In both cases, using 100% proximal pairs yields the best results in terms of preserving contact and avoiding interpenetration. As the percentage of proximal pairs decreases, the results gradually deteriorate, with 0% proximal pairs producing the poorest results. This illustrates the importance of including proximal sensor pairs in the DMI field to capture detailed geometric interactions.", "section": "4.3 Ablation Studies"}, {"figure_path": "v1BIm8wESL/figures/figures_17_2.jpg", "caption": "Figure 1: Comparison with the existing method. Contrary to the earlier retargeting-correction approach [32], which suffer from internal contradictions leading to interpenetration, jitter, and contact mismatches, our pipeline leverages the DMI field to accurately model complex geometric interactions.", "description": "The figure compares the proposed MeshRet method with existing methods for skinned motion retargeting. Existing methods often involve a two-stage pipeline: skeletal retargeting followed by geometry correction. This approach leads to inconsistencies and artifacts such as jittering, interpenetration, and inaccurate contact.  In contrast, MeshRet directly models dense geometric interactions using a DMI field, resulting in more accurate and natural motion with preserved contact.", "section": "1 Introduction"}, {"figure_path": "v1BIm8wESL/figures/figures_17_3.jpg", "caption": "Figure 1: Comparison with the existing method. Contrary to the earlier retargeting-correction approach [32], which suffer from internal contradictions leading to interpenetration, jitter, and contact mismatches, our pipeline leverages the DMI field to accurately model complex geometric interactions.", "description": "This figure compares the proposed MeshRet method with existing methods for skinned motion retargeting. Existing methods often suffer from contradictions between skeleton-based retargeting and geometry correction, resulting in issues like mesh interpenetration, jittery motion, and inaccurate contact representation. In contrast, MeshRet directly models dense geometric interactions using a Dense Mesh Interaction (DMI) field, effectively resolving these issues and producing more natural and accurate results.", "section": "1 Introduction"}, {"figure_path": "v1BIm8wESL/figures/figures_18_1.jpg", "caption": "Figure 12: Qualitative results on the Mixamo dataset with clean and noisy inputs. A red rectangle indicates interpenetration.", "description": "This figure shows a qualitative comparison of the proposed MeshRet method's performance on the Mixamo dataset with both clean and noisy inputs. The results demonstrate the method's ability to accurately retarget motion in the presence of clean data, while highlighting its sensitivity to noise. The red rectangles highlight areas where mesh interpenetration occurs, indicating the limitations of the approach when dealing with noisy data.", "section": "Experiments"}, {"figure_path": "v1BIm8wESL/figures/figures_18_2.jpg", "caption": "Figure 4: Qualitative comparison with baseline methods. Our method ensures precise contact preservation and minimal geometric interpenetration.", "description": "This figure compares the results of the proposed MeshRet method with several baseline methods for skinned motion retargeting.  It showcases several motion sequences applied to different characters (a cartoon character, a muscular character, and a realistic character).  The goal is to highlight that MeshRet accurately preserves contact between body parts and avoids mesh interpenetration, unlike the baseline methods which suffer from issues like jittering, self-interpenetration, and contact mismatches.", "section": "4 Experiments"}, {"figure_path": "v1BIm8wESL/figures/figures_19_1.jpg", "caption": "Figure 4: Qualitative comparison with baseline methods. Our method ensures precise contact preservation and minimal geometric interpenetration.", "description": "This figure compares the results of the proposed MeshRet method with several baseline methods for skinned motion retargeting.  It shows several motion sequences, each retargeted to different characters with various body shapes.  The \"Source\" column demonstrates the original motion.  The other columns represent the outputs of different methods: Copy (simple copying), PMnet, SAN, R2ET, and the proposed method (Ours). The images highlight the effectiveness of MeshRet in maintaining precise contact preservation between body parts and minimizing self-interpenetration, issues often encountered with other techniques.  The differences in geometric accuracy and contact preservation between MeshRet and the baseline methods are clearly visible.", "section": "4 Experiments"}, {"figure_path": "v1BIm8wESL/figures/figures_19_2.jpg", "caption": "Figure 4: Qualitative comparison with baseline methods. Our method ensures precise contact preservation and minimal geometric interpenetration.", "description": "This figure compares the results of the proposed MeshRet method with several baseline methods for skinned motion retargeting.  The top row shows the source motion. Subsequent rows display the retargeting results for different characters using various methods: Copy (simple copying of the motion), PMnet, SAN, R2ET, and finally the authors' method (Ours). The comparison highlights MeshRet's success in maintaining precise contact preservation and minimizing geometric artifacts like interpenetration, which are notable issues with the baseline methods.  MeshRet’s superior performance in handling complex geometric interactions during motion retargeting is evident.", "section": "4 Experiments"}, {"figure_path": "v1BIm8wESL/figures/figures_20_1.jpg", "caption": "Figure 4: Qualitative comparison with baseline methods. Our method ensures precise contact preservation and minimal geometric interpenetration.", "description": "This figure compares the results of the proposed MeshRet method against several baseline methods for skinned motion retargeting.  The top row shows the source motion sequence, which is then retargeted to different target characters in the subsequent rows.  Each column represents a different method.  The figure visually demonstrates that MeshRet achieves significantly better results than the alternatives in terms of maintaining accurate contact points between body parts and reducing instances of mesh interpenetration (where parts of the mesh overlap or pass through each other). The improvements in visual fidelity indicate more realistic and natural-looking character animation.", "section": "4 Experiments"}]