[{"figure_path": "YIOvR40hSo/tables/tables_7_1.jpg", "caption": "Table 1: Quantitative Panorama Comparisons with Baseline Methods", "description": "This table presents a quantitative comparison of the proposed Pano-SD method with two baseline methods, Text2Light and PanFusion, for single-view panorama generation.  The comparison is based on three metrics: Fréchet Inception Distance (FID), Inception Score (IS), and CLIP Score (CS).  Lower FID indicates better image quality, higher IS suggests both better quality and diversity, and higher CS shows better consistency between generated images and input text descriptions.  Inference time is also compared to show the efficiency of each method.", "section": "5.1 Single-View Panorama Generation"}, {"figure_path": "YIOvR40hSo/tables/tables_8_1.jpg", "caption": "Table 2: User Study of Text to Multi-view Panoramas", "description": "This table presents the results of a user study comparing three different methods for generating multi-view panoramas from text descriptions: MVDream, PanFusion, and DiffPano (the authors' method).  Users rated each method on three aspects: image quality, image-text consistency (how well the generated images matched the text), and multi-view consistency (how consistent the multiple views of the same scene were).  Higher scores indicate better performance.  The results show that DiffPano outperforms the other two methods across all three criteria.", "section": "5 Experiment"}, {"figure_path": "YIOvR40hSo/tables/tables_8_2.jpg", "caption": "Table 3: Ablation Study on the Number of Sampling Points and Reference Frames", "description": "This table presents the results of an ablation study conducted to investigate the impact of varying the number of sampling points (S) and reference frames (K) on the performance of the multi-view panorama generation model.  The study evaluates the model's performance using FID (Fréchet Inception Distance), IS (Inception Score), CS (CLIP Score), PSNR (Peak Signal-to-Noise Ratio), and SSIM (Structural Similarity Index Measure).  It shows how these metrics change as the number of sampling points and reference frames are adjusted, illustrating the effect on generation quality and consistency.", "section": "5.2 Multi-View Panorama Generation"}, {"figure_path": "YIOvR40hSo/tables/tables_9_1.jpg", "caption": "Table 4: Ablation Study of One-Stage vs Two-Stage Training", "description": "This table presents the results of an ablation study comparing the performance of a one-stage training approach against a two-stage training approach for generating multi-view panoramas.  The metrics used to evaluate performance include FID (Fréchet Inception Distance), IS (Inception Score), LPIPS (Learned Perceptual Image Patch Similarity), PSNR (Peak Signal-to-Noise Ratio), and SSIM (Structural Similarity Index). Lower FID and LPIPS scores indicate better image quality, while higher IS, PSNR, and SSIM scores also represent improved image quality. The comparison highlights the differences in the overall performance of the model under the two training strategies.", "section": "5.2 Multi-View Panorama Generation"}, {"figure_path": "YIOvR40hSo/tables/tables_16_1.jpg", "caption": "Table 5: Quantitative Perspective Images Comparisons with Baseline Methods", "description": "This table presents a quantitative comparison of the performance of three different methods (MVDiffusion, PanFusion, and Pano-SD) in generating perspective images.  The comparison is based on two metrics: Fréchet Inception Distance (FID), a measure of the similarity between generated and real images; and Inception Score (IS), a measure of the quality and diversity of the generated images. Lower FID values and higher IS values indicate better performance.  The results show that the Pano-SD method achieves the lowest FID and a competitive IS, suggesting that it generates more realistic and diverse perspective images compared to the baseline methods.", "section": "5.1 Single-View Panorama Generation"}, {"figure_path": "YIOvR40hSo/tables/tables_18_1.jpg", "caption": "Table 7: Network architecture of DiffPano-2", "description": "This table details the architecture of the DiffPano-2 model, specifying the layers, output dimensions, and additional inputs at each layer.  It shows the progression of the model through convolutional, attention, and upsampling blocks.  The `CrossAttnUpBlock` layers are particularly relevant for multi-view consistency, utilizing time embeddings and prompt embeddings for contextual information.  The table allows a reader to understand the technical construction of the multi-view panorama generation model.", "section": "C Network Architecture and Training Details"}, {"figure_path": "YIOvR40hSo/tables/tables_22_1.jpg", "caption": "Table 7: Network architecture of DiffPano-2", "description": "This table details the architecture of the second part of the DiffPano model, specifically focusing on the  `CrossAttnUpBlock2` and `CrossAttnUpBlock3` components.  It lists each layer (ResBlock, AttnBlock, EAModule, GroupNorm, SiLU, Conv.), their respective outputs (dimensions), and any additional inputs used in each layer (Time embedding and Prompt embedding). This structure illustrates the upsampling process within the network and how different information is integrated at various stages.", "section": "C Network Architecture and Training Details"}]