[{"figure_path": "MFKfm5scHi/figures/figures_1_1.jpg", "caption": "Figure 1: A toy example.", "description": "This figure shows a simple example of a point set in one dimension, illustrating the tension between the k-diameter and k-separation problems in clustering.  An optimal k-diameter clustering (minimizing the maximum diameter of any cluster) with k=2 might result in clusters where points in different clusters are quite close together. Conversely, an optimal k-separation clustering (maximizing the minimum distance between clusters) could result in clusters that are less compact in terms of diameter. This highlights the conflicting nature of these two objectives in clustering.", "section": "1 Introduction"}, {"figure_path": "MFKfm5scHi/figures/figures_3_1.jpg", "caption": "Figure 3: Examples of approximate Pareto sets copied from the later experimental sections.", "description": "This figure shows two examples of approximate Pareto sets from the experimental sections of the paper. Subfigure (a) displays the trade-off between k-separation and k-means on the same metric, and subfigure (b) displays the trade-off between k-center with two different metrics. Each point in the plots represents a solution, and the area dominated by a solution lies to the right and above the corresponding point.  The plots visually demonstrate the concept of the Pareto front, showing a set of solutions where there is no single solution that simultaneously optimizes both objectives.  Each point in the Pareto set represents a good clustering that cannot be found by considering one of the objectives separately.", "section": "Related work on Pareto sets"}, {"figure_path": "MFKfm5scHi/figures/figures_8_1.jpg", "caption": "Figure 7: Visualization of the ground truth for the three synthetic data sets.", "description": "This figure visualizes the ground truth for three synthetic datasets used in the paper's experiments. Each plot represents a different dataset (2d-4c-no3, 2d-10c-no3, 2d-10c-no4), showing the true cluster assignments for each data point.  These visualizations help readers understand the underlying structure of the datasets and compare it against the clustering results produced by different algorithms.", "section": "C.1 Application: k-separation and k-means"}, {"figure_path": "MFKfm5scHi/figures/figures_9_1.jpg", "caption": "Figure 5. Comparison between the 10-th Pareto solution with the purely geographic and the purely income based clustering for k = 16.", "description": "This figure compares three different clustering results for visualizing median incomes in Germany with k=16 clusters.  (a) shows a clustering based solely on income, resulting in geographically dispersed clusters. (b) displays the 10th Pareto-optimal solution, which balances both geographic proximity and income similarity. Notice that this solution is more geographically coherent while still capturing the income structure.  (c) presents a clustering focused only on geographic proximity, leading to clusters with a wide range of incomes.", "section": "3.2 Applications: k-center with two different metrics"}, {"figure_path": "MFKfm5scHi/figures/figures_25_1.jpg", "caption": "Figure 3: Examples of approximate Pareto sets copied from the later experimental sections.", "description": "This figure shows two examples of approximate Pareto sets. The first one shows the trade-off between k-separation and k-means on the same metric (use case 1), while the second one shows the trade-off between two k-center objectives with different metrics (use case 2). In both cases, the area dominated by a solution lies to the right and above the corresponding point. The approximate Pareto sets give a variety of trade-offs, offering more information and flexibility in data analysis.", "section": "Related work on Pareto sets"}, {"figure_path": "MFKfm5scHi/figures/figures_35_1.jpg", "caption": "Figure 1: A toy example.", "description": "This figure shows a simple example with four points on a line to illustrate the conflict between k-diameter and k-separation clustering objectives.  The optimal k-diameter clustering (minimizing the maximum diameter of any cluster) results in a large distance between some points that are close together, while the optimal k-separation clustering (maximizing the minimum distance between clusters) may not be as good with respect to k-diameter. This highlights the need for finding Pareto-optimal solutions to address such trade-offs.", "section": "1 Introduction"}, {"figure_path": "MFKfm5scHi/figures/figures_40_1.jpg", "caption": "Figure 7: Visualization of the ground truth for the three synthetic data sets.", "description": "This figure shows the ground truth for three synthetic datasets used in the paper's experiments. Each subplot represents a different dataset: (a) 2d-4c-no3, (b) 2d-10c-no3, and (c) 2d-10c-no4.  The points are colored according to their cluster assignment in the ground truth, providing a visual representation of the true cluster structure for each dataset. These datasets are used to evaluate the performance of the proposed multi-objective clustering algorithms.", "section": "C.1 Application: k-separation and k-means"}, {"figure_path": "MFKfm5scHi/figures/figures_41_1.jpg", "caption": "Figure 4: Clusterings computed on data set 2d-10c-no4 by Handl and Knowles [33].", "description": "This figure shows three different clusterings of the same 2D dataset (2d-10c-no4) with 10 clusters.  (a) shows the result of using the k-means++ algorithm. (b) shows the result of using Single Linkage clustering. (c) shows the best clustering found on the approximate Pareto curve.  The Pareto curve in this case balances k-separation (maximizing the minimum distance between clusters) and k-means (minimizing the sum of squared distances to cluster centers). The figure illustrates the trade-off between these two often conflicting objectives. k-means++ produces a good clustering in terms of minimizing the sum of squared distances, but the clusters are not well-separated. Single linkage produces well-separated clusters, but at the cost of high squared distances to cluster centers.  The Pareto-optimal solution provides a balanced compromise, achieving reasonably well-separated clusters with relatively low squared distances to cluster centers.", "section": "3.1 Application: k-separation and k-means"}, {"figure_path": "MFKfm5scHi/figures/figures_41_2.jpg", "caption": "Figure 4: Clusterings computed on data set 2d-10c-no4 by Handl and Knowles [33].", "description": "This figure visualizes the clustering results obtained using different methods on the 2d-10c-no4 dataset. It showcases three separate clusterings generated via three distinct methods: (a) k-means++, (b) Single Linkage, and (c) a solution selected from the approximate Pareto curve. This comparison aims to highlight the advantages and drawbacks of each method in terms of cluster shape, separation, and overall accuracy in capturing the underlying structure of the dataset.", "section": "3.1 Application: k-separation and k-means"}, {"figure_path": "MFKfm5scHi/figures/figures_41_3.jpg", "caption": "Figure 4: Clusterings computed on data set 2d-10c-no4 by Handl and Knowles [33].", "description": "The figure shows three different clusterings of the same data set (2d-10c-no4) produced by three different methods: k-means++, Single Linkage, and the best clustering found on the approximate Pareto curve. The data set consists of points in a two-dimensional space, and the ground truth consists of 10 clusters. The k-means++ algorithm produces a clustering that is reasonably close to the ground truth, but some clusters are split or merged. The Single Linkage algorithm produces a very different clustering, that contains two large clusters and 8 small clusters, largely due to outliers. The best clustering on the approximate Pareto curve is much closer to the ground truth, and has a more balanced trade-off between different objectives than k-means++ or Single Linkage.", "section": "3.1 Application: k-separation and k-means"}, {"figure_path": "MFKfm5scHi/figures/figures_41_4.jpg", "caption": "Figure 4: Clusterings computed on data set 2d-10c-no4 by Handl and Knowles [33].", "description": "This figure shows three different clusterings of the same dataset (2d-10c-no4), each with 10 clusters.  (a) shows a clustering generated using the k-means++ algorithm, (b) shows a clustering produced by Single Linkage, and (c) shows the best clustering found on the approximate Pareto curve, which represents a trade-off between multiple objectives. The visualization allows for a comparison of the three different approaches and their performance in terms of cluster separation and data homogeneity.  The differences highlight the inherent conflict between various clustering objectives and the benefits of considering multiple objectives simultaneously to find a balanced solution.", "section": "3.1 Application: k-separation and k-means"}, {"figure_path": "MFKfm5scHi/figures/figures_42_1.jpg", "caption": "Figure 4: Clusterings computed on data set 2d-10c-no4 by Handl and Knowles [33].", "description": "This figure shows three different clusterings of the same dataset (2d-10c-no4) created by three different methods. (a) shows a clustering performed by the k-means++ algorithm, resulting in a clustering that mostly captures the ground truth but has some inaccuracies due to its limitations. (b) shows a clustering performed by Single Linkage, which is overly sensitive to outliers resulting in an inaccurate clustering. (c) shows a clustering that is chosen from the approximate Pareto set, achieving a better balance between the two objectives of accurate clustering and good separation.", "section": "3.1 Application: k-separation and k-means"}, {"figure_path": "MFKfm5scHi/figures/figures_43_1.jpg", "caption": "Figure 4: Clusterings computed on data set 2d-10c-no4 by Handl and Knowles [33].", "description": "This figure shows three different clusterings of the same dataset (2d-10c-no4 from Handl and Knowles [33]), each with k=10 clusters. (a) shows a clustering produced by the k-means++ algorithm.  (b) shows a clustering produced by the Single Linkage algorithm. (c) shows the best clustering found among the approximate Pareto set, demonstrating a combination of the strengths of k-means++ and Single Linkage, producing a superior clustering compared to the other two.", "section": "3.1 Application: k-separation and k-means"}, {"figure_path": "MFKfm5scHi/figures/figures_45_1.jpg", "caption": "Figure 3: Examples of approximate Pareto sets copied from the later experimental sections.", "description": "This figure shows two examples of approximate Pareto sets for bi-objective clustering problems.  Subfigure (a) illustrates the trade-off between k-separation and k-means using the same metric (use case 1). Subfigure (b) displays the trade-off between two k-center objectives, but using different metrics derived from map design (use case 2).  The area dominated by a given solution lies to the right and above its plotted point.", "section": "2 Results"}, {"figure_path": "MFKfm5scHi/figures/figures_46_1.jpg", "caption": "Figure 3: Examples of approximate Pareto sets copied from the later experimental sections.", "description": "The figure contains two subfigures showing examples of approximate Pareto sets for different combinations of clustering objectives. Subfigure (a) shows the trade-off between k-separation and k-means on the same metric, while subfigure (b) shows the trade-off between two k-center objectives with two different metrics. The Pareto sets represent the set of non-dominated solutions, offering a range of trade-offs between the chosen objectives. These Pareto fronts provide insights into the different balancing points between conflicting objectives, such as achieving good cluster separation while also minimizing k-means cost or optimizing k-center under different distance metrics.", "section": "Related work on Pareto sets"}, {"figure_path": "MFKfm5scHi/figures/figures_49_1.jpg", "caption": "Figure 15: Visualization of the median monthly incomes in Germany (in Euro).", "description": "This figure shows a choropleth map of Germany, where each district is colored based on its median monthly income. The color scale ranges from dark purple (lowest income) to bright yellow (highest income), providing a visual representation of income distribution across the country.  It illustrates regional income variations, with some areas showing significantly higher incomes compared to others. The map provides a clear overview of the income disparity within Germany, highlighting potential areas of economic inequality or focusing areas for economic policy consideration.", "section": "3.2 Applications: k-center with two different metrics"}, {"figure_path": "MFKfm5scHi/figures/figures_49_2.jpg", "caption": "Figure 16: The resulting Pareto curve for k = 16. The 10-th and 15-th solution are marked with red squares.", "description": "This figure shows the Pareto curve obtained by applying the proposed multi-objective clustering algorithm for k=16.  The x-axis represents the maximum geographic distance between any two points within a cluster (in kilometers), and the y-axis represents the maximum difference in median income (in Euros) between any two districts within a cluster. Each point on the curve represents a Pareto-optimal clustering solution, meaning there is no other solution that simultaneously improves both the geographic compactness and income homogeneity. The 10th and 15th solutions are highlighted with red squares, indicating specific clusterings that offer a particular trade-off between these two objectives.  The shape of the curve itself shows the inherent conflict between these two objectives: improving one typically worsens the other.", "section": "3.2 Application: k-center with two different metrics"}, {"figure_path": "MFKfm5scHi/figures/figures_50_1.jpg", "caption": "Figure 16. The resulting Pareto curve for k = 16. The 10-th and 15-th solution are marked with red squares.", "description": "This figure shows the Pareto curve obtained by the algorithm for the case k=16 (number of clusters).  The x-axis represents the geographic distance in kilometers, and the y-axis represents the difference in median income (in Euros) between districts within the same cluster.  The plot displays a set of non-dominated solutions (Pareto front), representing trade-offs between minimizing geographic spread and income disparity within clusters. The 10th and 15th solutions along the curve are highlighted with red squares, indicating particular trade-offs between spatial compactness and income homogeneity that might be of interest to the researchers.", "section": "C.2 Visualizing median incomes in Germany"}, {"figure_path": "MFKfm5scHi/figures/figures_50_2.jpg", "caption": "Figure 5: Comparison between the 10-th Pareto solution with the purely geographic and the purely income based clustering for k = 16.", "description": "This figure shows a comparison of three different clusterings of the 400 German districts based on their median income.  (a) shows a purely income-based clustering, where districts are grouped solely by income similarity, regardless of geographic location. (b) depicts the 10th Pareto-optimal solution from a bi-objective optimization that considers both income similarity and geographic proximity. This solution represents a trade-off between the two objectives, aiming for clusters that are both income-homogeneous and geographically compact. (c) illustrates a purely geography-based clustering, focusing solely on geographic proximity. By comparing these three visuals, one can see how the Pareto-optimal solution finds a balance between income homogeneity and geographic compactness, offering a more informative clustering than either extreme approach.", "section": "3.2 Applications: k-center with two different metrics"}, {"figure_path": "MFKfm5scHi/figures/figures_51_1.jpg", "caption": "Figure 15: Visualization of the median monthly incomes in Germany (in Euro).", "description": "This figure shows a choropleth map of Germany, where each district is colored according to its median monthly income.  The color scale represents the income levels, ranging from approximately 3000 Euros to over 4500 Euros.  The map provides a visual representation of income distribution across different regions of Germany, highlighting areas of higher and lower average income.", "section": "3.2 Applications: k-center with two different metrics"}, {"figure_path": "MFKfm5scHi/figures/figures_51_2.jpg", "caption": "Figure 18. Comparison between the 10-th Pareto solution with the purely geographic and the purely income based clustering for k = 16.", "description": "This figure compares three different clustering results for k=16: one that only considers income (left), one that only considers geographic distance (right), and the 10th solution from the approximate Pareto set (middle). The differences illustrate the tradeoff between the two objectives. The Pareto solution aims to achieve a balance by presenting a compromise between income homogeneity and geographical proximity.", "section": "3.2 Applications: k-center with two different metrics"}, {"figure_path": "MFKfm5scHi/figures/figures_51_3.jpg", "caption": "Figure 15: Visualization of the median monthly incomes in Germany (in Euro).", "description": "This figure shows a choropleth map of Germany, where each district is colored according to its median monthly income in Euros.  The color scale ranges from approximately 3000 Euros to 4500 Euros, illustrating the income distribution across the country.  Darker colors represent higher incomes, while lighter colors represent lower incomes. The map provides a visual representation of regional income disparities within Germany.", "section": "3.2 Applications: k-center with two different metrics"}, {"figure_path": "MFKfm5scHi/figures/figures_52_1.jpg", "caption": "Figure 19: Comparison between the 10-th Pareto solution with the purely geographic and the purely income-based clustering for k = 16. The clusters are once colored according to the average income over all districts in that cluster (left) and once with well distinguishable colors (right).", "description": "This figure compares three different clusterings of German districts based on median income and geographic location.  The leftmost image shows a clustering based solely on income, resulting in geographically dispersed clusters. The rightmost image shows a clustering based solely on geographic proximity, leading to clusters with a wide range of income levels.  The center image depicts the 10th solution from the approximate Pareto set, which represents a trade-off between income homogeneity and geographic compactness. This solution aims to find clusters that are both geographically coherent and relatively homogenous in terms of income. The visualization clearly shows how the Pareto-optimal solution balances the two objectives, offering a compromise between the other two solutions that offers more insights.", "section": "3.2 Applications: k-center with two different metrics"}, {"figure_path": "MFKfm5scHi/figures/figures_52_2.jpg", "caption": "Figure 21: Positions of the PSMSL tide gauge stations.", "description": "This figure shows the geographic locations of 1581 tide gauge stations around the world, most situated along coastlines.  These stations measure sea levels, providing data for the study's time-series analysis. The distribution of stations is not uniform globally, with higher concentrations in certain areas.", "section": "C.3 Clustering of sea level data"}, {"figure_path": "MFKfm5scHi/figures/figures_53_1.jpg", "caption": "Figure 22: Approximate Pareto curve for the sea level data for k=150. The 54-th approximate Pareto solution is highlighted in red.", "description": "This figure shows the approximate Pareto curve obtained for clustering sea level data using two k-center objectives (geographic distance and mean time series distance) with k=150 clusters.  The x-axis represents the Euclidean distance (in km) between cluster centers, while the y-axis represents the mean time series distance (in m) between time series within the same cluster.  The curve illustrates the trade-off between these two objectives.  The point highlighted in red corresponds to the 54th solution on the Pareto front, representing a compromise between geographic compactness and similarity of time series within clusters.", "section": "C.3 Clustering of sea level data"}, {"figure_path": "MFKfm5scHi/figures/figures_55_1.jpg", "caption": "Figure 21: Positions of the PSMSL tide gauge stations.", "description": "This figure shows the geographical locations of 1581 tide gauge stations from the Permanent Service for Mean Sea Level (PSMSL) dataset.  These stations are located around the world, predominantly along coastlines, and record monthly sea level data. The map provides a visual representation of the global distribution of these stations, highlighting their concentration in certain regions (e.g., Europe, North America) while showing a relative scarcity in others. This distribution is relevant to the study's analysis of clustering these stations based on both their geographical proximity and the similarity of their recorded time series.", "section": "C.3 Clustering of sea level data"}, {"figure_path": "MFKfm5scHi/figures/figures_55_2.jpg", "caption": "Figure 21: Positions of the PSMSL tide gauge stations.", "description": "This figure shows the geographical locations of 1581 tide gauge stations around the world.  These stations are part of the Permanent Service for Mean Sea Level (PSMSL) dataset and measure sea level at their respective locations. The map displays the distribution of these stations across various coastlines and oceans.  The concentration of stations in the Northern Hemisphere is higher than in the Southern Hemisphere.", "section": "C.3 Clustering of sea level data"}, {"figure_path": "MFKfm5scHi/figures/figures_55_3.jpg", "caption": "Figure 21: Positions of the PSMSL tide gauge stations.", "description": "This figure shows the geographical locations of the 1581 tide gauge stations used in the sea level data clustering experiments.  The stations are spread across the globe, but with a higher concentration in the Northern Hemisphere and along coastlines.", "section": "C.3 Clustering of sea level data"}, {"figure_path": "MFKfm5scHi/figures/figures_56_1.jpg", "caption": "Figure 24. The geography based clustering, the 54-th Pareto solution, and the time series based clustering in the area of Europe. Centers are drawn in red.", "description": "This figure compares three different clustering approaches applied to the European region of the sea level data.  The top panel shows the geographically-based clustering which focuses on grouping geographically close stations. The middle panel presents the 54th solution from the approximate Pareto front, which balances geographic proximity with time series similarity. The bottom panel displays the time-series-based clustering, focusing solely on the similarity of sea level patterns over time.  The red squares indicate the cluster centers in each clustering.", "section": "C.3 Clustering of sea level data"}, {"figure_path": "MFKfm5scHi/figures/figures_56_2.jpg", "caption": "Figure 8: Clusterings computed on data set 2d-10c-no4.", "description": "This figure visualizes the clustering results on the 2d-10c-no4 dataset using three different methods: k-means++, single linkage, and the best clustering from the approximate Pareto curve.  (a) shows the k-means++ clustering, illustrating how some clusters are split or merged due to the algorithm's limitations. (b) demonstrates the single linkage clustering, where most points are merged into two large clusters. (c) presents the single linkage clustering obtained with a specific separation value (0.67), revealing a better separation of clusters but with a larger number of clusters than in (a) or (b). Finally, (d) displays the best clustering found in the approximate Pareto set (a trade-off between k-separation and k-means++), successfully finding the important clusters while maintaining a balance of cluster separation and the number of clusters.", "section": "3.1 Application: k-separation and k-means"}, {"figure_path": "MFKfm5scHi/figures/figures_57_1.jpg", "caption": "Figure 7: Visualization of the ground truth for the three synthetic data sets.", "description": "This figure shows the ground truth visualization of three synthetic datasets used in the paper's experiments. Each dataset represents a different clustering scenario, with varying levels of cluster separation and complexity. Visualizing the ground truth helps in evaluating the performance of clustering algorithms by comparing the produced clusters to the actual structure present in the data.", "section": "3.1 Application: k-separation and k-means"}, {"figure_path": "MFKfm5scHi/figures/figures_57_2.jpg", "caption": "Figure 7: Visualization of the ground truth for the three synthetic data sets.", "description": "This figure visualizes the ground truth for three synthetic datasets used in the paper's experiments. Each dataset represents a 2D point set with a certain number of clusters.  The visualization helps to understand the structure of the data and evaluate the performance of the proposed clustering algorithms against a known ideal outcome.", "section": "C.1 Application: k-separation and k-means"}, {"figure_path": "MFKfm5scHi/figures/figures_57_3.jpg", "caption": "Figure 21: Positions of the PSMSL tide gauge stations.", "description": "This figure shows the geographical locations of 1581 tide gauge stations around the world, which are part of the Permanent Service for Mean Sea Level (PSMSL) dataset.  The data from these stations is used in the paper to perform a clustering analysis of sea level behavior. The concentration of stations is not even across the globe, with a higher concentration in the northern hemisphere, particularly along coastlines.", "section": "C.3 Clustering of sea level data"}]