[{"figure_path": "tz83Nyb71l/tables/tables_6_1.jpg", "caption": "Table 1: Comparisons with state-of-the-arts. Latency is measured using official pre-trained models. Latencyf denotes the latency in the forward process of model without post-processing. † means the results of YOLOv10 with the original one-to-many training using NMS. All results below are without the additional advanced training techniques like knowledge distillation or PGI for fair comparisons.", "description": "This table compares the performance of YOLOv10 with other state-of-the-art real-time object detection models across various scales (N, S, M, L, X).  Metrics include the number of parameters (#Param.), Giga Floating Point Operations (FLOPs), average precision (APval), end-to-end latency (Latency), and latency of the forward pass only (Latencyf).  The table highlights YOLOv10's improved speed and efficiency while maintaining competitive accuracy, showcasing its advantages over existing models.", "section": "4 Experiments"}, {"figure_path": "tz83Nyb71l/tables/tables_7_1.jpg", "caption": "Table 2: Ablation study with YOLOv10-S and YOLOv10-M on COCO.", "description": "This table presents the ablation study results performed on the COCO dataset using two different models: YOLOv10-S and YOLOv10-M.  It shows the impact of different components on the model's performance and efficiency. The columns represent the model configuration (NMS-free, Efficiency, Accuracy), number of parameters, FLOPs, mAP (APval), and latency.", "section": "4.3 Model Analyses"}, {"figure_path": "tz83Nyb71l/tables/tables_8_1.jpg", "caption": "Table 7: Results of d.s.", "description": "This table presents the ablation study of the spatial-channel decoupled downsampling in YOLOv10-S. It shows the impact of this technique on the model's performance (APval) and latency. The \"base.\" row represents the baseline model without this technique. The \"ours\" row shows the results after implementing the spatial-channel decoupled downsampling technique. The results show a slight improvement in performance with a minimal reduction in latency.", "section": "4.3 Model Analyses"}, {"figure_path": "tz83Nyb71l/tables/tables_8_2.jpg", "caption": "Table 8: Results of CIB.", "description": "This ablation study shows the impact of using the Compact Inverted Block (CIB) in different stages of the YOLOv8-S model.  It compares the model's performance (AP<sup>val</sup>) and latency with different combinations of stages that utilize CIB, ranging from no CIB to including CIB in stages 8, 8 and 4, and 8, 4, and 7. The results highlight the trade-off between performance and computational efficiency.", "section": "4.3 Model Analyses"}, {"figure_path": "tz83Nyb71l/tables/tables_9_1.jpg", "caption": "Table 1: Comparisons with state-of-the-arts. Latency is measured using official pre-trained models. Latencyf denotes the latency in the forward process of model without post-processing. † means the results of YOLOv10 with the original one-to-many training using NMS. All results below are without the additional advanced training techniques like knowledge distillation or PGI for fair comparisons.", "description": "This table compares the performance of YOLOv10 with other state-of-the-art real-time object detection models across various scales (N, S, M, B, L, X).  The metrics used are the number of parameters (#Param.), Giga Floating Point Operations (GFLOPs), Average Precision (AP<sup>val</sup>), end-to-end latency (Latency), and forward-only latency (Latency<sup>f</sup>).  The results highlight YOLOv10's superior speed and efficiency while maintaining competitive accuracy.", "section": "4 Experiments"}, {"figure_path": "tz83Nyb71l/tables/tables_15_1.jpg", "caption": "Table 1: Comparisons with state-of-the-arts. Latency is measured using official pre-trained models. Latencyf denotes the latency in the forward process of model without post-processing. † means the results of YOLOv10 with the original one-to-many training using NMS. All results below are without the additional advanced training techniques like knowledge distillation or PGI for fair comparisons.", "description": "This table compares the performance of YOLOv10 with other state-of-the-art real-time object detectors.  Metrics include model size (#Param.), computational cost (FLOPs), accuracy (APval), end-to-end latency (Latency), and forward-only latency (Latencyf).  The table highlights YOLOv10's speed and efficiency improvements, especially when compared to RT-DETR and YOLOv9.  Note that advanced training techniques were excluded for a fair comparison.", "section": "4 Experiments"}, {"figure_path": "tz83Nyb71l/tables/tables_17_1.jpg", "caption": "Table 1: Comparisons with state-of-the-arts. Latency is measured using official pre-trained models. Latencyf denotes the latency in the forward process of model without post-processing. † means the results of YOLOv10 with the original one-to-many training using NMS. All results below are without the additional advanced training techniques like knowledge distillation or PGI for fair comparisons.", "description": "This table compares YOLOv10 with other state-of-the-art real-time object detectors across various model scales (N, S, M, B, L, X).  Metrics include the number of parameters (#Param.), Giga Floating Point Operations (GFLOPs), Average Precision (APval), end-to-end latency (Latency), and forward-only latency (Latencyf).  It highlights YOLOv10's speed and efficiency gains compared to existing models, while achieving comparable or better accuracy.", "section": "4 Experiments"}, {"figure_path": "tz83Nyb71l/tables/tables_18_1.jpg", "caption": "Table 1: Comparisons with state-of-the-arts. Latency is measured using official pre-trained models. Latencyf denotes the latency in the forward process of model without post-processing. † means the results of YOLOv10 with the original one-to-many training using NMS. All results below are without the additional advanced training techniques like knowledge distillation or PGI for fair comparisons.", "description": "This table compares YOLOv10's performance against other state-of-the-art real-time object detection models.  Metrics include model size (#Param.), computational cost (FLOPs), accuracy (APval), and inference latency (Latencyf and Latency).  It highlights YOLOv10's speed and efficiency gains, particularly when comparing against RT-DETR models and other YOLO variants, while achieving similar or superior accuracy.", "section": "4 Experiments"}, {"figure_path": "tz83Nyb71l/tables/tables_18_2.jpg", "caption": "Table 1: Comparisons with state-of-the-arts. Latency is measured using official pre-trained models. Latencyf denotes the latency in the forward process of model without post-processing. † means the results of YOLOv10 with the original one-to-many training using NMS. All results below are without the additional advanced training techniques like knowledge distillation or PGI for fair comparisons.", "description": "This table compares the performance of YOLOv10 with other state-of-the-art real-time object detection models.  The metrics include the number of parameters (#Param.), Giga Floating Point Operations (GFLOPs), Average Precision (APval), end-to-end latency (Latency), and latency of the forward process (Latencyf).  It highlights YOLOv10's speed and efficiency advantages while maintaining competitive accuracy. The comparison includes models from the YOLO series (YOLOv6, YOLOv7, YOLOv8, YOLOv9, YOLO-MS, Gold-YOLO), and RT-DETR.", "section": "4 Experiments"}, {"figure_path": "tz83Nyb71l/tables/tables_18_3.jpg", "caption": "Table 1: Comparisons with state-of-the-arts. Latency is measured using official pre-trained models. Latencyf denotes the latency in the forward process of model without post-processing. † means the results of YOLOv10 with the original one-to-many training using NMS. All results below are without the additional advanced training techniques like knowledge distillation or PGI for fair comparisons.", "description": "This table compares YOLOv10 with other state-of-the-art real-time object detection models.  It shows a comparison of the number of parameters, FLOPs (floating point operations), average precision (APval), end-to-end latency (Latency), and forward-only latency (Latencyf) for different model sizes (N, S, M, L, X).  The table highlights YOLOv10's superior performance and efficiency across various scales, particularly its faster speed and reduced parameter count compared to models with similar accuracy.  It also notes that the results exclude additional training techniques used by some other models to ensure a fair comparison.", "section": "4 Experiments"}]